[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskWomen", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64py67", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 36, "report_reasons": null, "author": "UrbanProduction", "saved": false, "mod_reports": [], "name": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "approved_by": null, "over_18": false, "domain": "self.AskWomen", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rxrw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskWomen/comments/64py67/ladies_who_grew_up_in_a_happy_home_what_was_it/", "num_reports": null, "locked": false, "stickied": false, "created": 1491934213.0, "url": "https://www.reddit.com/r/AskWomen/comments/64py67/ladies_who_grew_up_in_a_happy_home_what_was_it/", "author_flair_text": null, "quarantine": false, "title": "Ladies who grew up in a happy home, what was it like?", "created_utc": 1491905413.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 19, "visited": false, "subreddit_type": "public", "ups": 36}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg489js", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Lyanina", "parent_id": "t1_dg47pfr", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I was the younger (by 4 years) bratty kid to my brother when we were little tbh. He was a sweetheart from day 1 and took his role as older brother very seriously. Poor guy.\n\n I have this video of me at maybe 2 years old messing with his toys and hitting him with one of them. He just has this long-suffering look on his face and puts everything back in its place without even complaining.\n\nSorry, bro. I love you now, I promise.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was the younger (by 4 years) bratty kid to my brother when we were little tbh. He was a sweetheart from day 1 and took his role as older brother very seriously. Poor guy.&lt;/p&gt;\n\n&lt;p&gt;I have this video of me at maybe 2 years old messing with his toys and hitting him with one of them. He just has this long-suffering look on his face and puts everything back in its place without even complaining.&lt;/p&gt;\n\n&lt;p&gt;Sorry, bro. I love you now, I promise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg489js", "score_hidden": false, "stickied": false, "created": 1491945235.0, "created_utc": 1491916435.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg47pfr", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "gfjq23", "parent_id": "t1_dg43muj", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "This is exactly my background. Though my sister and I have always been close even in childhood. I feel silly as an adult saying my sister and my mom are my best friends, but it's true. I talk to them every single day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is exactly my background. Though my sister and I have always been close even in childhood. I feel silly as an adult saying my sister and my mom are my best friends, but it&amp;#39;s true. I talk to them every single day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg47pfr", "score_hidden": false, "stickied": false, "created": 1491944370.0, "created_utc": 1491915570.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg43muj", "gilded": 0, "archived": false, "score": 42, "report_reasons": null, "author": "Lyanina", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Happy.\n\nMy parents are still together. They raised two children who tolerated each other and didn't fight (and now love each other), got top grades, and were respectful. I grew up believing family was Very Important because I was raised that way. When I realized some friends couldn't stand their stepmother, or were on bad terms with their dad, I'd be sad. Sometimes I argue with my mom, but it's never really affected our relationship, which is one of love I can always count on to be returned. And sometimes my parents argue, but they're always *there* as a team.\n\n I know my parents will always support me no matter what, even though there are many things we don't see eye to eye on. It's just... nice. I'm very grateful to my parents for giving me this environment to grow up in. Home has always been a safe space for me to come back to.\n\nThanks for posting this OP! I'm going to visit my parents next week and this has made me reflect. :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Happy.&lt;/p&gt;\n\n&lt;p&gt;My parents are still together. They raised two children who tolerated each other and didn&amp;#39;t fight (and now love each other), got top grades, and were respectful. I grew up believing family was Very Important because I was raised that way. When I realized some friends couldn&amp;#39;t stand their stepmother, or were on bad terms with their dad, I&amp;#39;d be sad. Sometimes I argue with my mom, but it&amp;#39;s never really affected our relationship, which is one of love I can always count on to be returned. And sometimes my parents argue, but they&amp;#39;re always &lt;em&gt;there&lt;/em&gt; as a team.&lt;/p&gt;\n\n&lt;p&gt;I know my parents will always support me no matter what, even though there are many things we don&amp;#39;t see eye to eye on. It&amp;#39;s just... nice. I&amp;#39;m very grateful to my parents for giving me this environment to grow up in. Home has always been a safe space for me to come back to.&lt;/p&gt;\n\n&lt;p&gt;Thanks for posting this OP! I&amp;#39;m going to visit my parents next week and this has made me reflect. :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg43muj", "score_hidden": false, "stickied": false, "created": 1491936108.0, "created_utc": 1491907308.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 42}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg447ur", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "FloortjeH", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "My childhood and relationship with my parents was (and is) amazing.\n\nThey are always incredibly supportive of me and what I do. They often tell me how proud they are of me, but also make me feel like it's okay to fail sometimes. \n\nThey taught me how to empathetic towards other people and always take other people's feeling into account. I think they played a huge part in my self-esteem and my self-worth, and the fact that I have a very healthy relationship and friendships. They are still together and still act like they are teenagers in love, it's grand. They still appreciate and love each other and it taught me what love should look like.\n\nSure, we argue and yell sometimes, but it's never nasty, nobody ever says something really hurtful and it's usually over within 10 minutes. My dad always comes up to me afterwards to apologize and talk it through, which I think is a great habit, that I often find myself copying.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My childhood and relationship with my parents was (and is) amazing.&lt;/p&gt;\n\n&lt;p&gt;They are always incredibly supportive of me and what I do. They often tell me how proud they are of me, but also make me feel like it&amp;#39;s okay to fail sometimes. &lt;/p&gt;\n\n&lt;p&gt;They taught me how to empathetic towards other people and always take other people&amp;#39;s feeling into account. I think they played a huge part in my self-esteem and my self-worth, and the fact that I have a very healthy relationship and friendships. They are still together and still act like they are teenagers in love, it&amp;#39;s grand. They still appreciate and love each other and it taught me what love should look like.&lt;/p&gt;\n\n&lt;p&gt;Sure, we argue and yell sometimes, but it&amp;#39;s never nasty, nobody ever says something really hurtful and it&amp;#39;s usually over within 10 minutes. My dad always comes up to me afterwards to apologize and talk it through, which I think is a great habit, that I often find myself copying.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg447ur", "score_hidden": false, "stickied": false, "created": 1491937631.0, "created_utc": 1491908831.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg45a0p", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "DrAwesomeSauce101", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Loving. \n\nMy parents had disagreements, but they always talk it out. They've been married for over 38 years now and are a solid team. I honestly know that I'm always loved and they will support me (including to pull my head in). I have a fantastic relationship with my parents and all my siblings, we just all honestly like each other as people. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Loving. &lt;/p&gt;\n\n&lt;p&gt;My parents had disagreements, but they always talk it out. They&amp;#39;ve been married for over 38 years now and are a solid team. I honestly know that I&amp;#39;m always loved and they will support me (including to pull my head in). I have a fantastic relationship with my parents and all my siblings, we just all honestly like each other as people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg45a0p", "score_hidden": false, "stickied": false, "created": 1491940061.0, "created_utc": 1491911261.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg4dm0o", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "JWitch90", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I didn't really know anything else of course, but I had a good childhood. My parents never fought (at least not where we could hear, but I don't think they really did anyway). They're still together now, married 30 years this year, and still happy.\n\nWe weren't rich by any standard but didn't lack anything either, just average. I played outside a lot (I'm from just before video games became so popular that everyone had them, and before unlimited internet). I remember my childhood summers as lots of being outside, climbing trees, doing all kinds of things. I was friends with the neighbour kids who would often pick me up after dinner to go adventuring (we once climbed on the roof of a nearby school).\n\nI have two younger brothers and got along well with both, especially the oldest one. The youngest one was a bit more problematic, mostly because I'm no good with children and the age difference was enough to notice that. Now that we're both grown up it's totally fine though! We still often have family get togethers. I live in the same city as my parents so I'll sometimes spontaneously join them for dinner, or my mom comes over to have tea.\n\nI'm glad my parents weren't really strict so I could grow up to be who I wanted to be (I'm not really traditional and deviate from the norm in a few big life decisions). That's never been a problem and they always encouraged me to do what made me happy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t really know anything else of course, but I had a good childhood. My parents never fought (at least not where we could hear, but I don&amp;#39;t think they really did anyway). They&amp;#39;re still together now, married 30 years this year, and still happy.&lt;/p&gt;\n\n&lt;p&gt;We weren&amp;#39;t rich by any standard but didn&amp;#39;t lack anything either, just average. I played outside a lot (I&amp;#39;m from just before video games became so popular that everyone had them, and before unlimited internet). I remember my childhood summers as lots of being outside, climbing trees, doing all kinds of things. I was friends with the neighbour kids who would often pick me up after dinner to go adventuring (we once climbed on the roof of a nearby school).&lt;/p&gt;\n\n&lt;p&gt;I have two younger brothers and got along well with both, especially the oldest one. The youngest one was a bit more problematic, mostly because I&amp;#39;m no good with children and the age difference was enough to notice that. Now that we&amp;#39;re both grown up it&amp;#39;s totally fine though! We still often have family get togethers. I live in the same city as my parents so I&amp;#39;ll sometimes spontaneously join them for dinner, or my mom comes over to have tea.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m glad my parents weren&amp;#39;t really strict so I could grow up to be who I wanted to be (I&amp;#39;m not really traditional and deviate from the norm in a few big life decisions). That&amp;#39;s never been a problem and they always encouraged me to do what made me happy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4dm0o", "score_hidden": false, "stickied": false, "created": 1491951981.0, "created_utc": 1491923181.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg4gu47", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ChrisHansenBait", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "OP, I just wanna say that I am happy that you exist, if you want to exist to be happy", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP, I just wanna say that I am happy that you exist, if you want to exist to be happy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4gu47", "score_hidden": false, "stickied": false, "created": 1491955560.0, "created_utc": 1491926760.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg47734", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "-clementines", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I'm not sure what to compare it to.\n\nWe lived near to a small town in the countryside and had a big garden and lots of pets. Although we didn't have much extra money, we were never starving. My mum was always very frugal so we could go on trips during the summer. Most important is the support - I still feel so supported by my parents despite the fact I've moved out now and live independently. For example, they helped me find a driving instructor and paid for some of my lessons because I really want to learn and couldn't afford to on my student loan.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure what to compare it to.&lt;/p&gt;\n\n&lt;p&gt;We lived near to a small town in the countryside and had a big garden and lots of pets. Although we didn&amp;#39;t have much extra money, we were never starving. My mum was always very frugal so we could go on trips during the summer. Most important is the support - I still feel so supported by my parents despite the fact I&amp;#39;ve moved out now and live independently. For example, they helped me find a driving instructor and paid for some of my lessons because I really want to learn and couldn&amp;#39;t afford to on my student loan.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg47734", "score_hidden": false, "stickied": false, "created": 1491943568.0, "created_utc": 1491914768.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg4px3e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sephorv", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "It was definitely a unconventional setup , just my mom and I - as well as a pack of animals , we generally had 3-4 at a time.  It was fantastic , my mother and I are crazy close , she's my best friend . she's strong , caring , smart - we have great discussions together that are engaging and thoughtful . I wasn't one of those kids who spent my days in my bedroom, when she was home we hung out together about 90% of the time . \n\nShe's a police officer so she worked shift work - this helped me to become a very independent person, cooking my own meals , taking care of our dogs, entertaining myself , because of the way I grew up I think I'm very comfortable with myself . She always treated me like an adult , I always felt like I was heard and what I had to say was important and valid . She supported me no matter what, I want to be an artist and she supports that, she always got me sketchbooks , art supplies , etc- and I'm very thankful and lucky I didn't end up with a parent who didn't agree with my dreams and aspirations . \n\n A lot of people thought we'd both struggle when I moved out , since we're so close . we still talk every day, I visit her as much as I can - I definitely miss her but I we're both fine with being apart. \n\nDefinitely an unconventional happy home , but I was very happy . ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was definitely a unconventional setup , just my mom and I - as well as a pack of animals , we generally had 3-4 at a time.  It was fantastic , my mother and I are crazy close , she&amp;#39;s my best friend . she&amp;#39;s strong , caring , smart - we have great discussions together that are engaging and thoughtful . I wasn&amp;#39;t one of those kids who spent my days in my bedroom, when she was home we hung out together about 90% of the time . &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s a police officer so she worked shift work - this helped me to become a very independent person, cooking my own meals , taking care of our dogs, entertaining myself , because of the way I grew up I think I&amp;#39;m very comfortable with myself . She always treated me like an adult , I always felt like I was heard and what I had to say was important and valid . She supported me no matter what, I want to be an artist and she supports that, she always got me sketchbooks , art supplies , etc- and I&amp;#39;m very thankful and lucky I didn&amp;#39;t end up with a parent who didn&amp;#39;t agree with my dreams and aspirations . &lt;/p&gt;\n\n&lt;p&gt;A lot of people thought we&amp;#39;d both struggle when I moved out , since we&amp;#39;re so close . we still talk every day, I visit her as much as I can - I definitely miss her but I we&amp;#39;re both fine with being apart. &lt;/p&gt;\n\n&lt;p&gt;Definitely an unconventional happy home , but I was very happy . &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4px3e", "score_hidden": false, "stickied": false, "created": 1491965479.0, "created_utc": 1491936679.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg46mfl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "i-am-naz", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I'd say it was mostly happy. There were areas of difficulty and a few family emergencies, but we have always found humor and a lesson in those situations. I don't view my parents as toxic, although I did when I was a teenager and couldn't understand their perspective.\n\nThey are the one constant in my life - I consider myself very attached to my parents because I don't think anyone can love me as unconditionally or be more supportive of me than they are. I still live with them (23 years old for reference), but they're totally ok with it because I've had a set goal in life that I've been working towards and am about to complete. They let me do whatever I want (go out late, etc) as long as I act like a member of the house and do my share of house maintenance.\n\nI have friends who don't have such an easy relationship with their parents and it makes me cling onto mine for dear life. I can't imagine anyone not having parents as a life-crutch of sorts. However, I do find that people who don't have great relationships with their parents make for some very good friends because they're choosing and building their ideal family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d say it was mostly happy. There were areas of difficulty and a few family emergencies, but we have always found humor and a lesson in those situations. I don&amp;#39;t view my parents as toxic, although I did when I was a teenager and couldn&amp;#39;t understand their perspective.&lt;/p&gt;\n\n&lt;p&gt;They are the one constant in my life - I consider myself very attached to my parents because I don&amp;#39;t think anyone can love me as unconditionally or be more supportive of me than they are. I still live with them (23 years old for reference), but they&amp;#39;re totally ok with it because I&amp;#39;ve had a set goal in life that I&amp;#39;ve been working towards and am about to complete. They let me do whatever I want (go out late, etc) as long as I act like a member of the house and do my share of house maintenance.&lt;/p&gt;\n\n&lt;p&gt;I have friends who don&amp;#39;t have such an easy relationship with their parents and it makes me cling onto mine for dear life. I can&amp;#39;t imagine anyone not having parents as a life-crutch of sorts. However, I do find that people who don&amp;#39;t have great relationships with their parents make for some very good friends because they&amp;#39;re choosing and building their ideal family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg46mfl", "score_hidden": false, "stickied": false, "created": 1491942616.0, "created_utc": 1491913816.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg482i9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "searedscallops", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Mostly awesome. We had 5 kids (I'm the oldest) and we each felt important and validated. My parents strongly modeled kindness and empathy, so we picked up on it - the older ones were also very kind to the younger ones. Sure, we had little struggles (mine was for more freedom; next sister was on the autism spectrum, so her struggle was for figuring out how to exist in the world), but our struggles were seen as important not only to us, but to others.\n\nI'm now in my early 40s and I try to give my children a similar home life (divorcing their dad was a big step in that - not that he's a bad person, but we really made each other angry). I suspect I'm successful, because sometimes they voice their opinions with vigor and I'm like, \"Yep, you feel important and validated - lulz\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mostly awesome. We had 5 kids (I&amp;#39;m the oldest) and we each felt important and validated. My parents strongly modeled kindness and empathy, so we picked up on it - the older ones were also very kind to the younger ones. Sure, we had little struggles (mine was for more freedom; next sister was on the autism spectrum, so her struggle was for figuring out how to exist in the world), but our struggles were seen as important not only to us, but to others.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m now in my early 40s and I try to give my children a similar home life (divorcing their dad was a big step in that - not that he&amp;#39;s a bad person, but we really made each other angry). I suspect I&amp;#39;m successful, because sometimes they voice their opinions with vigor and I&amp;#39;m like, &amp;quot;Yep, you feel important and validated - lulz&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg482i9", "score_hidden": false, "stickied": false, "created": 1491944944.0, "created_utc": 1491916144.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg49ynv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "canadian_maplesyrup", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "It was nice, we were a close family. My parents have been happily married coming up on 45 years. \n\nMom stayed home and was an actively involved SAHM mom, dad was busy and worked a lot, but we had dinner as a family every night without fail. We'd sit around the table and chat about our day, the news, books we were reading, school, and so forth. My parents attended my sports games, schools plays, dad coached soccer, mom was my brownie leader. \n\nThere were fights, mom and I could go at it, but once they were done, we moved on. Even in our worst fights, not once have I ever said \"I hate you!\" I have never uttered those words, to anyone in my family, because I honestly don't. \n\nMy parents raised us to be close to our family, but to have our own lives. They encouraged me to move away for university and strike out on my own, knowing that I would always have a room to return to in their home. They told me when I screwed up, but never denied praise when it was deserved. \n\nThey gave us a home that wasn't perfect, but it was loving, warm and I alway know that my parents will have my back no matter what. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was nice, we were a close family. My parents have been happily married coming up on 45 years. &lt;/p&gt;\n\n&lt;p&gt;Mom stayed home and was an actively involved SAHM mom, dad was busy and worked a lot, but we had dinner as a family every night without fail. We&amp;#39;d sit around the table and chat about our day, the news, books we were reading, school, and so forth. My parents attended my sports games, schools plays, dad coached soccer, mom was my brownie leader. &lt;/p&gt;\n\n&lt;p&gt;There were fights, mom and I could go at it, but once they were done, we moved on. Even in our worst fights, not once have I ever said &amp;quot;I hate you!&amp;quot; I have never uttered those words, to anyone in my family, because I honestly don&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;My parents raised us to be close to our family, but to have our own lives. They encouraged me to move away for university and strike out on my own, knowing that I would always have a room to return to in their home. They told me when I screwed up, but never denied praise when it was deserved. &lt;/p&gt;\n\n&lt;p&gt;They gave us a home that wasn&amp;#39;t perfect, but it was loving, warm and I alway know that my parents will have my back no matter what. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg49ynv", "score_hidden": false, "stickied": false, "created": 1491947569.0, "created_utc": 1491918769.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg4gtol", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MuppetManiac", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "It was stable. You knew what to expect so much that you didn't even think about it. Hearing your friends talk about things like their stepdad screaming and hitting their mom or their dad getting drunk or filling the tub with water in case they shut it off before payday made you really uncomfortable because that was so far outside your norm.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was stable. You knew what to expect so much that you didn&amp;#39;t even think about it. Hearing your friends talk about things like their stepdad screaming and hitting their mom or their dad getting drunk or filling the tub with water in case they shut it off before payday made you really uncomfortable because that was so far outside your norm.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4gtol", "score_hidden": false, "stickied": false, "created": 1491955546.0, "created_utc": 1491926746.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg4h15n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "whats_her_face34", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I always felt safe. That's the best way to describe it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always felt safe. That&amp;#39;s the best way to describe it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4h15n", "score_hidden": false, "stickied": false, "created": 1491955775.0, "created_utc": 1491926975.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg4ywxx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "oceanage", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Safe. Happy. Supported. Loved. Protected. \n\n\nMy parents were together 34 years before my dad passed. They raised two kids together. I rarely saw my parents argue but I know they did. Whenever I had a problem big or small I knew I could ask for help. I remember the day I told my dad i was suicidal. He understood, hugged me, prayed, and said we will get you help and they did. There were normal tiffs because of course that happens. I was never abused or felt unloved or scared. I felt stable and aside from my depression was healthy mentally.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Safe. Happy. Supported. Loved. Protected. &lt;/p&gt;\n\n&lt;p&gt;My parents were together 34 years before my dad passed. They raised two kids together. I rarely saw my parents argue but I know they did. Whenever I had a problem big or small I knew I could ask for help. I remember the day I told my dad i was suicidal. He understood, hugged me, prayed, and said we will get you help and they did. There were normal tiffs because of course that happens. I was never abused or felt unloved or scared. I felt stable and aside from my depression was healthy mentally.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4ywxx", "score_hidden": false, "stickied": false, "created": 1491975518.0, "created_utc": 1491946718.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg44n6m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Citychic88", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "It was great. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was great. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg44n6m", "score_hidden": false, "stickied": false, "created": 1491938647.0, "created_utc": 1491909847.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg4inj1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Butt-Factory", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "It was great.  \n\nMy parents are not only still together,  but madly in love.  I've never seen them fight.  I have three awesome brothers and one amazing sister, we are incredibly close.  \n\nWe grew up without much money,  which meant we moved almost every year and often had to go without things that \"the other kids\" had.  It never bothered us. We just loved being together.  \n\nThe world can be a sad and scary place,  but no matter what happens,  I can pick up the phone and have my entire family scrambling to support and love me.  Having that security means a lot to me. So many people have no family to rely on,  and I sometimes feel like I have too much!  It can be annoying to have so many people in my business all the time,  no big decision in my life is made on my own,  but I'm so grateful.  I'll never be alone. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was great.  &lt;/p&gt;\n\n&lt;p&gt;My parents are not only still together,  but madly in love.  I&amp;#39;ve never seen them fight.  I have three awesome brothers and one amazing sister, we are incredibly close.  &lt;/p&gt;\n\n&lt;p&gt;We grew up without much money,  which meant we moved almost every year and often had to go without things that &amp;quot;the other kids&amp;quot; had.  It never bothered us. We just loved being together.  &lt;/p&gt;\n\n&lt;p&gt;The world can be a sad and scary place,  but no matter what happens,  I can pick up the phone and have my entire family scrambling to support and love me.  Having that security means a lot to me. So many people have no family to rely on,  and I sometimes feel like I have too much!  It can be annoying to have so many people in my business all the time,  no big decision in my life is made on my own,  but I&amp;#39;m so grateful.  I&amp;#39;ll never be alone. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4inj1", "score_hidden": false, "stickied": false, "created": 1491957550.0, "created_utc": 1491928750.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg4jxxz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cran-lemonade", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Happy. \n\nMy mom was 25 and my dad was 35 when I was born, so they had their shit together. They both worked full time jobs with good benefits. Both sets of grandparents were nearby and they were free babysitters during the summers. One set of grandparents opened a new business and my other set of grandparents got involved, so then my family was even more integrated. As in, grandparents and aunt and uncles from both sides of my family would be at the same Christmas dinner. I had a few cousins around my same age to hang out with. My dad likes to cook and he got off work earlier than my mom, so he would cook dinner and have it waiting when my mom got home. We ate together around the dining room table every night. My brother was born when I was 7 and I didn't like him for a little while, but we got really close as we got older. He's still my favorite person. We went on vacation every summer usually. To Disney a few times or renting a cabin in the woods a few times for a week or so. The grandparents all came on vacation too because they could and everyone got alone so it was no big deal. No one in my family really fights with each other and it's fine. My dad and my aunt were both previously married and divorced young, but no kids were involved and they're both friends with their ex's. My aunts ex and his family invite us over for family functions regularly. I've always called him my uncle even though they were divorced before I was born. There was money saved for my college education so I didn't have to go too far in debt. But also I got my first job at 13 and paid for my first car with $3,000 cash I had saved. Birthdays were/are a family only event. Just grandparents and cousins and a cake from the grocery store. No presents really, but sometimes grandpa gives mom some money to add to your college fund. I never realized how much I had to be thankful for until I went to college and realized how crazy some other people's families are. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Happy. &lt;/p&gt;\n\n&lt;p&gt;My mom was 25 and my dad was 35 when I was born, so they had their shit together. They both worked full time jobs with good benefits. Both sets of grandparents were nearby and they were free babysitters during the summers. One set of grandparents opened a new business and my other set of grandparents got involved, so then my family was even more integrated. As in, grandparents and aunt and uncles from both sides of my family would be at the same Christmas dinner. I had a few cousins around my same age to hang out with. My dad likes to cook and he got off work earlier than my mom, so he would cook dinner and have it waiting when my mom got home. We ate together around the dining room table every night. My brother was born when I was 7 and I didn&amp;#39;t like him for a little while, but we got really close as we got older. He&amp;#39;s still my favorite person. We went on vacation every summer usually. To Disney a few times or renting a cabin in the woods a few times for a week or so. The grandparents all came on vacation too because they could and everyone got alone so it was no big deal. No one in my family really fights with each other and it&amp;#39;s fine. My dad and my aunt were both previously married and divorced young, but no kids were involved and they&amp;#39;re both friends with their ex&amp;#39;s. My aunts ex and his family invite us over for family functions regularly. I&amp;#39;ve always called him my uncle even though they were divorced before I was born. There was money saved for my college education so I didn&amp;#39;t have to go too far in debt. But also I got my first job at 13 and paid for my first car with $3,000 cash I had saved. Birthdays were/are a family only event. Just grandparents and cousins and a cake from the grocery store. No presents really, but sometimes grandpa gives mom some money to add to your college fund. I never realized how much I had to be thankful for until I went to college and realized how crazy some other people&amp;#39;s families are. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4jxxz", "score_hidden": false, "stickied": false, "created": 1491958940.0, "created_utc": 1491930140.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64py67", "likes": null, "replies": "", "user_reports": [], "id": "dg4lwzc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "worried19", "parent_id": "t3_64py67", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "It was nice, stable, happy. I always knew what to expect. There was never anything negative (beyond a normal argument) going on at home. It was a safe place, and I knew my parents loved each other and loved me and my siblings. I wish all kids were able to have what I had.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was nice, stable, happy. I always knew what to expect. There was never anything negative (beyond a normal argument) going on at home. It was a safe place, and I knew my parents loved each other and loved me and my siblings. I wish all kids were able to have what I had.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4lwzc", "score_hidden": false, "stickied": false, "created": 1491961104.0, "created_utc": 1491932304.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]