[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskWomen", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What sort of reactions to you get from people? Do people tend to be dismissive of your situation and feelings? Do you know any other women who are in similar situations as you? What is your life like?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "What sort of reactions to you get from people? Do people tend to be dismissive of your situation and feelings? Do you know any other women who are in similar situations as you? What is your life like?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64r7tz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 62, "report_reasons": null, "author": "x298", "saved": false, "mod_reports": [], "name": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "approved_by": null, "over_18": false, "domain": "self.AskWomen", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rxrw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskWomen/comments/64r7tz/women_who_dont_have_relationships_with_their/", "num_reports": null, "locked": false, "stickied": false, "created": 1491950399.0, "url": "https://www.reddit.com/r/AskWomen/comments/64r7tz/women_who_dont_have_relationships_with_their/", "author_flair_text": null, "quarantine": false, "title": "Women who don't have relationships with their mothers, do you feel like you are stigmatised?", "created_utc": 1491921599.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 72, "visited": false, "subreddit_type": "public", "ups": 62}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4xscr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "therrrn", "parent_id": "t1_dg4mftf", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "My mom's been clean for 20 years, too. She also became an addiction counselor. I never lost contact with her and I always knew she loved me but I was really, really angry for a very long time for all of the different ways her addiction changed my life. \n\nI think I just finally let go of a lot of it within the last few years. I know it sounds cheesy and it's super cliche, but for me, it's really just so much less tiring to just forgive her. \n\nMy mother was abused as a child and has mental issues. She started using as a teenager to escape her pain and everything just spiraled from there. She had my older sister and was unable to care for her, so my grandmother raised her. Despite that, she and my mother were close. When my mom and dad divorced, she tried to get clean to raise me and did well for a while. Then my sister died and she was sent over the edge again. She finally got clean for the last time when I was put into foster care, also as an addict, at 13. \n\nIt was hard for a while to forgive her because she put me through a lot. While I never stopped speaking to her and we always had a loving relationship, it was severely disfunctional and I was so angry, all the time. It took about 15 years, but I finally just looked at her as this little woman who loves me so much and just went through a lot of pain throughout her life and dealt with it very, very poorly. She wasted so much of her life just trying to numb the pain and regrets it so much but there's nothing she can ever do to take it back and all she can do now is try to be a better person. I can't imagine living he rest of my life with that kind of regret. \n\nI don't know your situation at all and our experiences may be wildly different. I just know that people that go through drastic life changes like our mothers did, may have earned a little bit of a positive second thought when it comes to us considering our relationships with them.  \n\nETA my mom's back story a little, to try to convey my reasons for forgiving her. ", "edited": 1491945865.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My mom&amp;#39;s been clean for 20 years, too. She also became an addiction counselor. I never lost contact with her and I always knew she loved me but I was really, really angry for a very long time for all of the different ways her addiction changed my life. &lt;/p&gt;\n\n&lt;p&gt;I think I just finally let go of a lot of it within the last few years. I know it sounds cheesy and it&amp;#39;s super cliche, but for me, it&amp;#39;s really just so much less tiring to just forgive her. &lt;/p&gt;\n\n&lt;p&gt;My mother was abused as a child and has mental issues. She started using as a teenager to escape her pain and everything just spiraled from there. She had my older sister and was unable to care for her, so my grandmother raised her. Despite that, she and my mother were close. When my mom and dad divorced, she tried to get clean to raise me and did well for a while. Then my sister died and she was sent over the edge again. She finally got clean for the last time when I was put into foster care, also as an addict, at 13. &lt;/p&gt;\n\n&lt;p&gt;It was hard for a while to forgive her because she put me through a lot. While I never stopped speaking to her and we always had a loving relationship, it was severely disfunctional and I was so angry, all the time. It took about 15 years, but I finally just looked at her as this little woman who loves me so much and just went through a lot of pain throughout her life and dealt with it very, very poorly. She wasted so much of her life just trying to numb the pain and regrets it so much but there&amp;#39;s nothing she can ever do to take it back and all she can do now is try to be a better person. I can&amp;#39;t imagine living he rest of my life with that kind of regret. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know your situation at all and our experiences may be wildly different. I just know that people that go through drastic life changes like our mothers did, may have earned a little bit of a positive second thought when it comes to us considering our relationships with them.  &lt;/p&gt;\n\n&lt;p&gt;ETA my mom&amp;#39;s back story a little, to try to convey my reasons for forgiving her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4xscr", "score_hidden": false, "stickied": false, "created": 1491974164.0, "created_utc": 1491945364.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4mftf", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "ohokmmhmm", "parent_id": "t1_dg4kynz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "That sounds rough. My mom has actually been clean for 20 years now, and is an addictions counselor. So people love to tell me that I should forgive her because she's turned her life around. I just can't get back those years when I needed a mother and she wasn't around, so now that she's older and wants/needs a daughter, she doesn't get that privilege from me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That sounds rough. My mom has actually been clean for 20 years now, and is an addictions counselor. So people love to tell me that I should forgive her because she&amp;#39;s turned her life around. I just can&amp;#39;t get back those years when I needed a mother and she wasn&amp;#39;t around, so now that she&amp;#39;s older and wants/needs a daughter, she doesn&amp;#39;t get that privilege from me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4mftf", "score_hidden": false, "stickied": false, "created": 1491961674.0, "created_utc": 1491932874.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4sx9j", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Sister_Winter", "parent_id": "t1_dg4kynz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "And I mean, even if it *were* just the drugs making the parent a bad parent, they still neglected/abused their children. Why on earth would someone expect you to forgive them for that??!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And I mean, even if it &lt;em&gt;were&lt;/em&gt; just the drugs making the parent a bad parent, they still neglected/abused their children. Why on earth would someone expect you to forgive them for that??!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4sx9j", "score_hidden": false, "stickied": false, "created": 1491968682.0, "created_utc": 1491939882.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4kynz", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "ffreudiannipss", "parent_id": "t1_dg4dpwt", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Yessssss. Did you ever get the \"well you can't blame the way she acts while she's abusing, drugs do terrible things to people\" justification? I got it for the longest time on top of what you said. Until my mom was sober for three years straight, still refused any contact with us kids, found herself in jail numerous times, and was essentially the same person off the drugs as she was on. I get so tired of people who have no idea of my situation saying \"yea well she's still your mom\" but then when they found out how she really is, it's a complete 180 and they have nothing to say. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yessssss. Did you ever get the &amp;quot;well you can&amp;#39;t blame the way she acts while she&amp;#39;s abusing, drugs do terrible things to people&amp;quot; justification? I got it for the longest time on top of what you said. Until my mom was sober for three years straight, still refused any contact with us kids, found herself in jail numerous times, and was essentially the same person off the drugs as she was on. I get so tired of people who have no idea of my situation saying &amp;quot;yea well she&amp;#39;s still your mom&amp;quot; but then when they found out how she really is, it&amp;#39;s a complete 180 and they have nothing to say. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4kynz", "score_hidden": false, "stickied": false, "created": 1491960069.0, "created_utc": 1491931269.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4dpwt", "gilded": 0, "archived": false, "score": 75, "report_reasons": null, "author": "ohokmmhmm", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I don't feel stigmatized, more like people just act like I'm being unreasonable. My mom was a drug addict for most of my childhood and she abandoned us when I was a pre-teen, so I feel no obligation to care about her. People act like I'm too harsh on her because she's my mother, but my though process is... yeah, she's my mother. She shouldn't have abandoned us. I think people who expect me to forgive her for that just have no concept because their mother was always there for them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t feel stigmatized, more like people just act like I&amp;#39;m being unreasonable. My mom was a drug addict for most of my childhood and she abandoned us when I was a pre-teen, so I feel no obligation to care about her. People act like I&amp;#39;m too harsh on her because she&amp;#39;s my mother, but my though process is... yeah, she&amp;#39;s my mother. She shouldn&amp;#39;t have abandoned us. I think people who expect me to forgive her for that just have no concept because their mother was always there for them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4dpwt", "score_hidden": false, "stickied": false, "created": 1491952103.0, "created_utc": 1491923303.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 75}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4wrb8", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "theevilhillbilly", "parent_id": "t1_dg4f7a1", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "This has happened but with my dad. I have an aunt who has both her parents but I've never met my dad more my two half siblings on his side. She keeps insisting that I look for them. Even though they were I'm their 20's when I was born and my dad never even bothered with me. So obviously they don't care about me and it's not.my job to make them care. And I don't care about them either.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This has happened but with my dad. I have an aunt who has both her parents but I&amp;#39;ve never met my dad more my two half siblings on his side. She keeps insisting that I look for them. Even though they were I&amp;#39;m their 20&amp;#39;s when I was born and my dad never even bothered with me. So obviously they don&amp;#39;t care about me and it&amp;#39;s not.my job to make them care. And I don&amp;#39;t care about them either.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4wrb8", "score_hidden": false, "stickied": false, "created": 1491972945.0, "created_utc": 1491944145.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4f7a1", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "SpamTheEagle", "parent_id": "t1_dg4d0nt", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Ugh. My Dad's wife tried to guilt me into calling my mother the other day because \"I only get one\" and \"life is too short.\" Lady, life is too short to bully your teenager into suicidal ideations and attempts, but here we are. How about you butt out. I lost it on her and I cannot imagine how the conversation with my dad went after I ended our phone call.\n\nTo clarify: She is not my step mother, she married my dad after I was already married with kids. She's a religious nut with her own three crazy kids that live in the neighborhood and call her three times a day. Also unhealthy, IMO. I unknowingly called when they were in the car, on speaker. That won't happen again. And my mother is a narc who bullied me until I cut ties and enlisted to escape. I divorced her 20 years ago, no regrets.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ugh. My Dad&amp;#39;s wife tried to guilt me into calling my mother the other day because &amp;quot;I only get one&amp;quot; and &amp;quot;life is too short.&amp;quot; Lady, life is too short to bully your teenager into suicidal ideations and attempts, but here we are. How about you butt out. I lost it on her and I cannot imagine how the conversation with my dad went after I ended our phone call.&lt;/p&gt;\n\n&lt;p&gt;To clarify: She is not my step mother, she married my dad after I was already married with kids. She&amp;#39;s a religious nut with her own three crazy kids that live in the neighborhood and call her three times a day. Also unhealthy, IMO. I unknowingly called when they were in the car, on speaker. That won&amp;#39;t happen again. And my mother is a narc who bullied me until I cut ties and enlisted to escape. I divorced her 20 years ago, no regrets.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4f7a1", "score_hidden": false, "stickied": false, "created": 1491953758.0, "created_utc": 1491924958.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 35}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4xahv", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "withbellson", "parent_id": "t1_dg4d0nt", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "&gt; It's also kind of annoying when people assume that your mom (or dad) will automatically support you when you need it. \n\nExactly.  \"Oh, is your mother helping you take care of the baby?\"  I usually say something mild like \"Oh, she visits sometimes,\" because the real answer to that question is \"Every time I talked to my mother during my pregnancy she asked me if I had had a miscarriage, kept bringing up her own miscarriages, and harped on how serious my pregnancy complications could become, so we keep her away from us as much as we fucking can.\"  \n\nAnd it bothers the shit out of me when people can't imagine that different people are different.  Geesh.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s also kind of annoying when people assume that your mom (or dad) will automatically support you when you need it. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Exactly.  &amp;quot;Oh, is your mother helping you take care of the baby?&amp;quot;  I usually say something mild like &amp;quot;Oh, she visits sometimes,&amp;quot; because the real answer to that question is &amp;quot;Every time I talked to my mother during my pregnancy she asked me if I had had a miscarriage, kept bringing up her own miscarriages, and harped on how serious my pregnancy complications could become, so we keep her away from us as much as we fucking can.&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;And it bothers the shit out of me when people can&amp;#39;t imagine that different people are different.  Geesh.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4xahv", "score_hidden": false, "stickied": false, "created": 1491973564.0, "created_utc": 1491944764.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4d79r", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "localgyro", "parent_id": "t1_dg4d0nt", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Yeah.  People seem not to believe me when I say that I got divorced and my mother didn't want to talk about it, never asked why I left my marriage.  She just can't handle non-happy emotions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah.  People seem not to believe me when I say that I got divorced and my mother didn&amp;#39;t want to talk about it, never asked why I left my marriage.  She just can&amp;#39;t handle non-happy emotions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4d79r", "score_hidden": false, "stickied": false, "created": 1491951507.0, "created_utc": 1491922707.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4d0nt", "gilded": 0, "archived": false, "score": 93, "report_reasons": null, "author": "ayuxx", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Stigmatized isn't really the right word. Like /u/localgyro said, it's more like feeling left out. It's also kind of annoying when people assume that your mom (or dad) will automatically support you when you need it. My ex-best friend's mom keeps telling me to ask my mom for help with my health issues, and the life-related problems that come with them. She seems unable to believe me when I say that my mom won't do much, if anything. Her only reply is \"But she's *your mom*!\" It's kinda hard to hear that, honestly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stigmatized isn&amp;#39;t really the right word. Like &lt;a href=\"/u/localgyro\"&gt;/u/localgyro&lt;/a&gt; said, it&amp;#39;s more like feeling left out. It&amp;#39;s also kind of annoying when people assume that your mom (or dad) will automatically support you when you need it. My ex-best friend&amp;#39;s mom keeps telling me to ask my mom for help with my health issues, and the life-related problems that come with them. She seems unable to believe me when I say that my mom won&amp;#39;t do much, if anything. Her only reply is &amp;quot;But she&amp;#39;s &lt;em&gt;your mom&lt;/em&gt;!&amp;quot; It&amp;#39;s kinda hard to hear that, honestly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4d0nt", "score_hidden": false, "stickied": false, "created": 1491951303.0, "created_utc": 1491922503.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 93}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4q3xi", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "tristin_forthe3", "parent_id": "t1_dg4dt3c", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "That is literally the last place I want her", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is literally the last place I want her&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4q3xi", "score_hidden": false, "stickied": false, "created": 1491965675.0, "created_utc": 1491936875.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg5g3vq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Belmagick", "parent_id": "t1_dg58vzg", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Yeah. People don't get it! My mum left me when I was 6 months but then came back into my life when I was 3 and saw me periodically. At 11, she told me I was too old to have a mother and we haven't spoken since. \n\nI will never understand why people think I'll need my mother at my wedding of all my life events.\n\nYeah, I probably needed her when I got my heart broken, when I got sick and hurt while I was growing up, when I was depressed etc. I won't need her if I ever decide to put on a white dress and get married?? It's just inconceivably rude. \n\nI don't know if I'll cry when she dies. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah. People don&amp;#39;t get it! My mum left me when I was 6 months but then came back into my life when I was 3 and saw me periodically. At 11, she told me I was too old to have a mother and we haven&amp;#39;t spoken since. &lt;/p&gt;\n\n&lt;p&gt;I will never understand why people think I&amp;#39;ll need my mother at my wedding of all my life events.&lt;/p&gt;\n\n&lt;p&gt;Yeah, I probably needed her when I got my heart broken, when I got sick and hurt while I was growing up, when I was depressed etc. I won&amp;#39;t need her if I ever decide to put on a white dress and get married?? It&amp;#39;s just inconceivably rude. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if I&amp;#39;ll cry when she dies. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg5g3vq", "score_hidden": false, "stickied": false, "created": 1491998735.0, "created_utc": 1491969935.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg58vzg", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "queenoreo", "parent_id": "t1_dg4dt3c", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I stopped talking to my mom right after I turned 20. When I was planning our wedding omg, it was awful. Everyone and their cousin's friend's brother insisted that I had to invite my mother. No I don't. I won't. She has nothing to offer me, I have nothing to offer her. \n\nWhen I had my first baby my sister and I had a horrible blow out about how it was unfair of me not to let her meet my child. Well, I could list the things that were \"unfair\" to me for the previous 27 years but let's just agree to disagree ok?  \n\nShe died 10 years ago and I felt nothing. I cried because, good lord, what kind of monster can't even cry when her mother dies?  This girl right here. It did make the whole \"and what about your mom?\" conversation simpler \"she's dead\". Done!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I stopped talking to my mom right after I turned 20. When I was planning our wedding omg, it was awful. Everyone and their cousin&amp;#39;s friend&amp;#39;s brother insisted that I had to invite my mother. No I don&amp;#39;t. I won&amp;#39;t. She has nothing to offer me, I have nothing to offer her. &lt;/p&gt;\n\n&lt;p&gt;When I had my first baby my sister and I had a horrible blow out about how it was unfair of me not to let her meet my child. Well, I could list the things that were &amp;quot;unfair&amp;quot; to me for the previous 27 years but let&amp;#39;s just agree to disagree ok?  &lt;/p&gt;\n\n&lt;p&gt;She died 10 years ago and I felt nothing. I cried because, good lord, what kind of monster can&amp;#39;t even cry when her mother dies?  This girl right here. It did make the whole &amp;quot;and what about your mom?&amp;quot; conversation simpler &amp;quot;she&amp;#39;s dead&amp;quot;. Done!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg58vzg", "score_hidden": false, "stickied": false, "created": 1491988545.0, "created_utc": 1491959745.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg5glr3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lavenderblue", "parent_id": "t1_dg4dt3c", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "OMG I wasn't able to exclude my mother from my wedding day for a number of reasons but I have the most bomb-ass bridesmaids. I told them their one and only job was to make sure my mother and I never had a \"moment,\" because she would find a way to wreck it. I realized just the other day I had not a single memory of my mother from my wedding. They were wonderful, and I'm so happy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OMG I wasn&amp;#39;t able to exclude my mother from my wedding day for a number of reasons but I have the most bomb-ass bridesmaids. I told them their one and only job was to make sure my mother and I never had a &amp;quot;moment,&amp;quot; because she would find a way to wreck it. I realized just the other day I had not a single memory of my mother from my wedding. They were wonderful, and I&amp;#39;m so happy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg5glr3", "score_hidden": false, "stickied": false, "created": 1491999580.0, "created_utc": 1491970780.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4dt3c", "gilded": 0, "archived": false, "score": 46, "report_reasons": null, "author": "Belmagick", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "They always say \"Oh! But you'll want your mother there on your wedding day!!\"\n\nYeah. No I won't. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They always say &amp;quot;Oh! But you&amp;#39;ll want your mother there on your wedding day!!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Yeah. No I won&amp;#39;t. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4dt3c", "score_hidden": false, "stickied": false, "created": 1491952204.0, "created_utc": 1491923404.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 46}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4wu0m", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "spirality5", "parent_id": "t1_dg4ngsx", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Yeah, I've found that there tend to be 3 categories of reactions - listed below from most common to least common:\n\n1) Invalidation. The mindset of \"I've got a happy family so all families must be happy - your parents are just overprotective because they love you.\"\n\n2) Awkwardness. They don't not believe you, but they can't relate so they don't know what to say other than \"that sucks.\"\n\n3) OMG ME TOO. I have one single friend who has a mother equally as crazy as mine, if not a bit more. It was so nice to both of us when we found out because we FINALLY had someone who could relate to our situation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I&amp;#39;ve found that there tend to be 3 categories of reactions - listed below from most common to least common:&lt;/p&gt;\n\n&lt;p&gt;1) Invalidation. The mindset of &amp;quot;I&amp;#39;ve got a happy family so all families must be happy - your parents are just overprotective because they love you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;2) Awkwardness. They don&amp;#39;t not believe you, but they can&amp;#39;t relate so they don&amp;#39;t know what to say other than &amp;quot;that sucks.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;3) OMG ME TOO. I have one single friend who has a mother equally as crazy as mine, if not a bit more. It was so nice to both of us when we found out because we FINALLY had someone who could relate to our situation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4wu0m", "score_hidden": false, "stickied": false, "created": 1491973032.0, "created_utc": 1491944232.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg592o3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "queenoreo", "parent_id": "t1_dg4ngsx", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I never told the really bad stories because even the mild ones brought back nightmares for weeks when I talked about it. It's only now in my mid 40s that I can make dark jokes about my childhood. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I never told the really bad stories because even the mild ones brought back nightmares for weeks when I talked about it. It&amp;#39;s only now in my mid 40s that I can make dark jokes about my childhood. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg592o3", "score_hidden": false, "stickied": false, "created": 1491988784.0, "created_utc": 1491959984.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ngsx", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "spidermon", "parent_id": "t1_dg4csnl", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "THIS. I don't think people realize the stories you're telling them _are the not-so-bad ones_. They're are worse that you don't share because you figure the pretty terrible ones are sufficient enough to explain the situation, and getting into more traumatic ones can make people treat you as a poor helpless victim. Bah.  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;THIS. I don&amp;#39;t think people realize the stories you&amp;#39;re telling them &lt;em&gt;are the not-so-bad ones&lt;/em&gt;. They&amp;#39;re are worse that you don&amp;#39;t share because you figure the pretty terrible ones are sufficient enough to explain the situation, and getting into more traumatic ones can make people treat you as a poor helpless victim. Bah.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4ngsx", "score_hidden": false, "stickied": false, "created": 1491962802.0, "created_utc": 1491934002.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg5a44j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "belbites", "parent_id": "t1_dg4csnl", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "People keep doing this with my dad. Literally 2 days ago people were mad because I was annoyed he was calling me- what they don't know is he has no interest in my life beyond calling me every day to say hi, but doesn't even really want to talk. \n\nEveryine has been demonizing me for being upset with him, but frankly my dad cared more about drugs and alcohol than he ever did about me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People keep doing this with my dad. Literally 2 days ago people were mad because I was annoyed he was calling me- what they don&amp;#39;t know is he has no interest in my life beyond calling me every day to say hi, but doesn&amp;#39;t even really want to talk. &lt;/p&gt;\n\n&lt;p&gt;Everyine has been demonizing me for being upset with him, but frankly my dad cared more about drugs and alcohol than he ever did about me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg5a44j", "score_hidden": false, "stickied": false, "created": 1491990120.0, "created_utc": 1491961320.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4csnl", "gilded": 0, "archived": false, "score": 42, "report_reasons": null, "author": "spirality5", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I don't have the greatest relationship with my mother (understatement of the year tbh) and what I find most annoying is that a lot of friends will act like I'm lying when I say it. And they'll invalidate me with shit like \"oh I'm sure it's because she loves you, she can't be that bad\" and I just want to shake them and tell them no, she's not as bad as you think, she's SO MUCH WORSE.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have the greatest relationship with my mother (understatement of the year tbh) and what I find most annoying is that a lot of friends will act like I&amp;#39;m lying when I say it. And they&amp;#39;ll invalidate me with shit like &amp;quot;oh I&amp;#39;m sure it&amp;#39;s because she loves you, she can&amp;#39;t be that bad&amp;quot; and I just want to shake them and tell them no, she&amp;#39;s not as bad as you think, she&amp;#39;s SO MUCH WORSE.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4csnl", "score_hidden": false, "stickied": false, "created": 1491951048.0, "created_utc": 1491922248.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 42}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4ce2m", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "localgyro", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I feel a bit left out, I suppose -- not due to any malice on anyone's part, but there's an assumption that I've got her as a part of my life in a way I don't.  \n\nMy family is friendly enough, but doesn't spend time together.  My life just doesn't include family.  That means that holidays seem more lonely than for most people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel a bit left out, I suppose -- not due to any malice on anyone&amp;#39;s part, but there&amp;#39;s an assumption that I&amp;#39;ve got her as a part of my life in a way I don&amp;#39;t.  &lt;/p&gt;\n\n&lt;p&gt;My family is friendly enough, but doesn&amp;#39;t spend time together.  My life just doesn&amp;#39;t include family.  That means that holidays seem more lonely than for most people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4ce2m", "score_hidden": false, "stickied": false, "created": 1491950580.0, "created_utc": 1491921780.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4d2wa", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "Embarrassinghuman", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I tend to get very surprised reactions from people. They try to be dismissive sometimes, but when I tell you I haven't spoken to my bio-mom in ~17 years, there's a reason for it and I don't need your \"Well, I'm sure you two will work it out\" BS so I tend to shut it down before it starts. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I tend to get very surprised reactions from people. They try to be dismissive sometimes, but when I tell you I haven&amp;#39;t spoken to my bio-mom in ~17 years, there&amp;#39;s a reason for it and I don&amp;#39;t need your &amp;quot;Well, I&amp;#39;m sure you two will work it out&amp;quot; BS so I tend to shut it down before it starts. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4d2wa", "score_hidden": false, "stickied": false, "created": 1491951372.0, "created_utc": 1491922572.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4ev5g", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "RachoThePsycho", "parent_id": "t1_dg4deh0", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "\"She's my mother. But she isn't my mum.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;She&amp;#39;s my mother. But she isn&amp;#39;t my mum.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4ev5g", "score_hidden": false, "stickied": false, "created": 1491953376.0, "created_utc": 1491924576.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4t3k5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Restingbface91", "parent_id": "t1_dg4deh0", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "She's my mother in the sense that she pushed me out of her vagina. After that there wasn't much mothering 😒", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s my mother in the sense that she pushed me out of her vagina. After that there wasn&amp;#39;t much mothering 😒&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4t3k5", "score_hidden": false, "stickied": false, "created": 1491968865.0, "created_utc": 1491940065.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg594zl", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "queenoreo", "parent_id": "t1_dg4deh0", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "My answer once to that statement was \"well someone should have told her\". Ohhhh ok.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My answer once to that statement was &amp;quot;well someone should have told her&amp;quot;. Ohhhh ok.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg594zl", "score_hidden": false, "stickied": false, "created": 1491988862.0, "created_utc": 1491960062.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4deh0", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "tercerero", "parent_id": "t1_dg4dboe", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "\"But she's your mother...\"  Yeah, and?!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;But she&amp;#39;s your mother...&amp;quot;  Yeah, and?!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4deh0", "score_hidden": false, "stickied": false, "created": 1491951732.0, "created_utc": 1491922932.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4dboe", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "RachoThePsycho", "parent_id": "t1_dg4cpa4", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I absolutely *love* when someone asks why I am no longer in contact with my mother, and after explaining to them how her destructive and toxic alcoholism (compounded by her having bipolar disorder 2, which she refuses to medicate for) has completely destroyed any chance of having some semblance of a mother/daughter relationship, they *always* have the answer that will fix our broken relationship! The most recent being, \"Just talk and listen to her! Try and persuade her to seek help!\".\n\nLady. What do you think I've been trying to do for nearly 20 years?!\n\nWhen it comes to family some people seem unable to comprehend that in toxic situations, it's healthier to remove yourself from a vicious cycle than be a part of its perpetuation. One phrase that has stuck with me for the past few years is: family matters, but family isn't always blood.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I absolutely &lt;em&gt;love&lt;/em&gt; when someone asks why I am no longer in contact with my mother, and after explaining to them how her destructive and toxic alcoholism (compounded by her having bipolar disorder 2, which she refuses to medicate for) has completely destroyed any chance of having some semblance of a mother/daughter relationship, they &lt;em&gt;always&lt;/em&gt; have the answer that will fix our broken relationship! The most recent being, &amp;quot;Just talk and listen to her! Try and persuade her to seek help!&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Lady. What do you think I&amp;#39;ve been trying to do for nearly 20 years?!&lt;/p&gt;\n\n&lt;p&gt;When it comes to family some people seem unable to comprehend that in toxic situations, it&amp;#39;s healthier to remove yourself from a vicious cycle than be a part of its perpetuation. One phrase that has stuck with me for the past few years is: family matters, but family isn&amp;#39;t always blood.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4dboe", "score_hidden": false, "stickied": false, "created": 1491951645.0, "created_utc": 1491922845.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4cpa4", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "tercerero", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I don't feel stigmatized, although I do often feel somewhat judged as though it wasn't the years of her shitty behavior that drove me away but some flaw of mine for choosing to separate myself.  Like, I fucking tried, ok?  It took years of therapy to even vocalize the hurt much less take positive steps to remedy the situation for myself.\n\nMy life is overwhelmingly good despite the hassles anyone faces.  I've been able to find solid maternal support from older ladies although yes, it would be ideal to get it from her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t feel stigmatized, although I do often feel somewhat judged as though it wasn&amp;#39;t the years of her shitty behavior that drove me away but some flaw of mine for choosing to separate myself.  Like, I fucking tried, ok?  It took years of therapy to even vocalize the hurt much less take positive steps to remedy the situation for myself.&lt;/p&gt;\n\n&lt;p&gt;My life is overwhelmingly good despite the hassles anyone faces.  I&amp;#39;ve been able to find solid maternal support from older ladies although yes, it would be ideal to get it from her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4cpa4", "score_hidden": false, "stickied": false, "created": 1491950944.0, "created_utc": 1491922144.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4nlul", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "spidermon", "parent_id": "t1_dg4cpvi", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "&gt; Well, how bad was it really?\n\n[Would be my face] (http://www.tinygif.com/data/media/11/stewie-turn.gif)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Well, how bad was it really?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.tinygif.com/data/media/11/stewie-turn.gif\"&gt;Would be my face&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4nlul", "score_hidden": false, "stickied": false, "created": 1491962957.0, "created_utc": 1491934157.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4vsvo", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "whoop_there_she_is", "parent_id": "t1_dg4cpvi", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Hey! I feel that way with my father.\n\nI cut him out years ago for his violent, shitty, narcissistic behavior and my life has been exponentially better since. But every time it gets brought up, inevitably someone with an equally shitty dad justifies sticking around through the abuse because \"he's faaaaamily, i couldn't do it\" or even worse, \"i can't believe you would abandon your own father! Mine is bad but blah blah blah\". Like no, sorry, it's not my job to constantly put up with shitty behavior my whole life just because two people had unprotected sex in the 70's. Familial guilt is real but you're right, it is awkward when people don't understand the concept of cutting ties with family members.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey! I feel that way with my father.&lt;/p&gt;\n\n&lt;p&gt;I cut him out years ago for his violent, shitty, narcissistic behavior and my life has been exponentially better since. But every time it gets brought up, inevitably someone with an equally shitty dad justifies sticking around through the abuse because &amp;quot;he&amp;#39;s faaaaamily, i couldn&amp;#39;t do it&amp;quot; or even worse, &amp;quot;i can&amp;#39;t believe you would abandon your own father! Mine is bad but blah blah blah&amp;quot;. Like no, sorry, it&amp;#39;s not my job to constantly put up with shitty behavior my whole life just because two people had unprotected sex in the 70&amp;#39;s. Familial guilt is real but you&amp;#39;re right, it is awkward when people don&amp;#39;t understand the concept of cutting ties with family members.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4vsvo", "score_hidden": false, "stickied": false, "created": 1491971874.0, "created_utc": 1491943074.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg5itfd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Bobannon", "parent_id": "t1_dg4cpvi", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "&gt; \"I wish I could do that, too, but I still just really need my mom. I just can't\" and while I understand that, it stil makes me feel awkward.\n\nI hear that one a lot, too. Awkward is the right word. But there's also the ruthlessly practical, unsentimental side of me that just thinks, \"Then do it. Just do it. Walk away. Move if you have to. If it's that bad, just do it.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;I wish I could do that, too, but I still just really need my mom. I just can&amp;#39;t&amp;quot; and while I understand that, it stil makes me feel awkward.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I hear that one a lot, too. Awkward is the right word. But there&amp;#39;s also the ruthlessly practical, unsentimental side of me that just thinks, &amp;quot;Then do it. Just do it. Walk away. Move if you have to. If it&amp;#39;s that bad, just do it.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg5itfd", "score_hidden": false, "stickied": false, "created": 1492003679.0, "created_utc": 1491974879.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg599ck", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FrozenFractalsofIce", "parent_id": "t1_dg4cpvi", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I cut ties with my entire maternal family because of the abuse she put me through. Most people assume I'm being dramatic and blowing it out of proportion unless I explain just a FEW of the very fucked up things she did. Then they're shocked and horrified. It's annoying that people think just because you're related biologically you're obligated to maintain relationships with people who constantly hurt you. I haven't spoken to my mother in 6+ years because it took having my own child to realize how truly messed up the way she treated me was. I'll never talk to her again and can't wait to move away to a place she can't stalk me anymore. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I cut ties with my entire maternal family because of the abuse she put me through. Most people assume I&amp;#39;m being dramatic and blowing it out of proportion unless I explain just a FEW of the very fucked up things she did. Then they&amp;#39;re shocked and horrified. It&amp;#39;s annoying that people think just because you&amp;#39;re related biologically you&amp;#39;re obligated to maintain relationships with people who constantly hurt you. I haven&amp;#39;t spoken to my mother in 6+ years because it took having my own child to realize how truly messed up the way she treated me was. I&amp;#39;ll never talk to her again and can&amp;#39;t wait to move away to a place she can&amp;#39;t stalk me anymore. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg599ck", "score_hidden": false, "stickied": false, "created": 1491989013.0, "created_utc": 1491960213.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4cpvi", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "maryjanesandbobbysox", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "&gt;  Do people tend to be dismissive of your situation and feelings?\n\nYes.  I cut off contact with both of my parents due to a long history of abuse: sexual, physical, emotional and I'm absolutely floored at the number of people who, after I've disclosed this, will actually ask me \"well, how bad was it really?\"  like it wasn't bad enough to warrant severing family ties.\n\nMy husband and his family are very supportive, and honestly are the very few people I know who understand.\n\nIRL, I don't know anyone else who has severed family ties this way.  I actually do know several women (30s/40s) who have toxic/terrible relationships with their mothers, who say things like \"I wish I could do that, too, but I still just really need my mom. I just can't\"  and while I understand that, it stil makes me feel awkward.  \n\nIt's just hard to be alone in it.  I honestly don't have any regrets about it, though.  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Do people tend to be dismissive of your situation and feelings?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes.  I cut off contact with both of my parents due to a long history of abuse: sexual, physical, emotional and I&amp;#39;m absolutely floored at the number of people who, after I&amp;#39;ve disclosed this, will actually ask me &amp;quot;well, how bad was it really?&amp;quot;  like it wasn&amp;#39;t bad enough to warrant severing family ties.&lt;/p&gt;\n\n&lt;p&gt;My husband and his family are very supportive, and honestly are the very few people I know who understand.&lt;/p&gt;\n\n&lt;p&gt;IRL, I don&amp;#39;t know anyone else who has severed family ties this way.  I actually do know several women (30s/40s) who have toxic/terrible relationships with their mothers, who say things like &amp;quot;I wish I could do that, too, but I still just really need my mom. I just can&amp;#39;t&amp;quot;  and while I understand that, it stil makes me feel awkward.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just hard to be alone in it.  I honestly don&amp;#39;t have any regrets about it, though.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4cpvi", "score_hidden": false, "stickied": false, "created": 1491950962.0, "created_utc": 1491922162.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4dky4", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "sidebirch", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I primarily feel like people just don't want to hear it, and things get awkward fast. People assume you're close to your family, they assume you'll go see them for holidays and such. It's awkward to say no, you haven't seen your parents in a while and that's fine, and then when people ask why that is it gets even more awkward if you try to tell the truth.\n\nEven my friends, who I talk to about other issues, are pretty dismissive of this and will change the subject. Those who grew up in stable homes with good parents, they will just change the subject if I mention anything negative about my parents or my childhood, like they can't deal with even references to that.\n\nI grew up with a girl who is one of my best friends. She actually was the one who pointed out my mom's behavior to me and that it wasn't normal and she was worried about me as a kid. But when she got married last year she wanted to invite my parents to her wedding. When I told her I wasn't speaking to my mom because I'd realized our relationship was toxic, she invited them anyway. Even though she's one of the few that noticed my mom was abusive, she decided it wasn't really *that* bad.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I primarily feel like people just don&amp;#39;t want to hear it, and things get awkward fast. People assume you&amp;#39;re close to your family, they assume you&amp;#39;ll go see them for holidays and such. It&amp;#39;s awkward to say no, you haven&amp;#39;t seen your parents in a while and that&amp;#39;s fine, and then when people ask why that is it gets even more awkward if you try to tell the truth.&lt;/p&gt;\n\n&lt;p&gt;Even my friends, who I talk to about other issues, are pretty dismissive of this and will change the subject. Those who grew up in stable homes with good parents, they will just change the subject if I mention anything negative about my parents or my childhood, like they can&amp;#39;t deal with even references to that.&lt;/p&gt;\n\n&lt;p&gt;I grew up with a girl who is one of my best friends. She actually was the one who pointed out my mom&amp;#39;s behavior to me and that it wasn&amp;#39;t normal and she was worried about me as a kid. But when she got married last year she wanted to invite my parents to her wedding. When I told her I wasn&amp;#39;t speaking to my mom because I&amp;#39;d realized our relationship was toxic, she invited them anyway. Even though she&amp;#39;s one of the few that noticed my mom was abusive, she decided it wasn&amp;#39;t really &lt;em&gt;that&lt;/em&gt; bad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4dky4", "score_hidden": false, "stickied": false, "created": 1491951945.0, "created_utc": 1491923145.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4u1g7", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "lc166", "parent_id": "t1_dg4h86l", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I think that's one of my big problems in talking about my relationship with my family, is there's either the discomfort of people making assumptions about how you interact with them or the discomfort of having to explain like your entire relationship history and walk the line between \"no it was actually really bad\" and not freaking out whoever you're talking to... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that&amp;#39;s one of my big problems in talking about my relationship with my family, is there&amp;#39;s either the discomfort of people making assumptions about how you interact with them or the discomfort of having to explain like your entire relationship history and walk the line between &amp;quot;no it was actually really bad&amp;quot; and not freaking out whoever you&amp;#39;re talking to... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4u1g7", "score_hidden": false, "stickied": false, "created": 1491969895.0, "created_utc": 1491941095.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4h86l", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "kanikkers", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I think it's more that folks assume family/parents to be pillars in your life. Like, when I'm having a rough time of it, folks who don't know me well might say \"well at least your family loves you unconditionally.\" And I'm like, not really. They're not good supports for me, and I'm okay with that (folks will treat it like this huge tragic thing, too, which is annoying).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s more that folks assume family/parents to be pillars in your life. Like, when I&amp;#39;m having a rough time of it, folks who don&amp;#39;t know me well might say &amp;quot;well at least your family loves you unconditionally.&amp;quot; And I&amp;#39;m like, not really. They&amp;#39;re not good supports for me, and I&amp;#39;m okay with that (folks will treat it like this huge tragic thing, too, which is annoying).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4h86l", "score_hidden": false, "stickied": false, "created": 1491955991.0, "created_utc": 1491927191.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4elyi", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "iocanepowderimmunity", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I do feel like people see me as the stubborn teen who's just acting out. Like I'm the unreasonable one. I'm 30 and my decision to cut my mom out was well thought out after years of heartbreak. \n\nMy MIL, for example, refuses to accept this and brings her up every time I see her. Asking what happened. I think in order to accept it, people need a dramatic story like 'she stabbed in the face' or something extreme. Unfortunately, it's never that simple. So it's stressful when family comes up because people have a hard time or just don't want to understand. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do feel like people see me as the stubborn teen who&amp;#39;s just acting out. Like I&amp;#39;m the unreasonable one. I&amp;#39;m 30 and my decision to cut my mom out was well thought out after years of heartbreak. &lt;/p&gt;\n\n&lt;p&gt;My MIL, for example, refuses to accept this and brings her up every time I see her. Asking what happened. I think in order to accept it, people need a dramatic story like &amp;#39;she stabbed in the face&amp;#39; or something extreme. Unfortunately, it&amp;#39;s never that simple. So it&amp;#39;s stressful when family comes up because people have a hard time or just don&amp;#39;t want to understand. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4elyi", "score_hidden": false, "stickied": false, "created": 1491953096.0, "created_utc": 1491924296.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4tmli", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Restingbface91", "parent_id": "t1_dg4edsx", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Ugh I can so relate to this. \n\nMother's Day sucks, I get kinda sour on my birthday and hers and holidays, I used to get all teary eyed and pissy when I was getting my nails done and a mother daughter came in. I've gotten better about it but I used to even have a difficult time being around friends with their mothers who clearly had a great relationship.", "edited": 1491940847.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ugh I can so relate to this. &lt;/p&gt;\n\n&lt;p&gt;Mother&amp;#39;s Day sucks, I get kinda sour on my birthday and hers and holidays, I used to get all teary eyed and pissy when I was getting my nails done and a mother daughter came in. I&amp;#39;ve gotten better about it but I used to even have a difficult time being around friends with their mothers who clearly had a great relationship.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4tmli", "score_hidden": false, "stickied": false, "created": 1491969441.0, "created_utc": 1491940641.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4edsx", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "0228", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Been no contact for 5+ years. It honestly doesn't come up that much. I dont talk about it with people who dont know me. And people who know me, know that I am thoughtful, serious, considerate, and kind. So they know that decision was not made lightly. \n\nI just feel alone. Like everyone has a built in best friend, and I dont. I used to be very bitter about that.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Been no contact for 5+ years. It honestly doesn&amp;#39;t come up that much. I dont talk about it with people who dont know me. And people who know me, know that I am thoughtful, serious, considerate, and kind. So they know that decision was not made lightly. &lt;/p&gt;\n\n&lt;p&gt;I just feel alone. Like everyone has a built in best friend, and I dont. I used to be very bitter about that.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4edsx", "score_hidden": false, "stickied": false, "created": 1491952849.0, "created_utc": 1491924049.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4kibb", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Mammitu", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "People who have a relatively normal relationship with their family seem (mostly) unable to understand or empathize when you don't. I never really knew my real mother, and my step mother was a nightmare (read: abusive) narcissistic woman (I went NC after her divorce with my father). \n\nI really have no one I can rely on or go to for support and/or advice, family wise. People have a hard time wrapping their head around that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People who have a relatively normal relationship with their family seem (mostly) unable to understand or empathize when you don&amp;#39;t. I never really knew my real mother, and my step mother was a nightmare (read: abusive) narcissistic woman (I went NC after her divorce with my father). &lt;/p&gt;\n\n&lt;p&gt;I really have no one I can rely on or go to for support and/or advice, family wise. People have a hard time wrapping their head around that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4kibb", "score_hidden": false, "stickied": false, "created": 1491959566.0, "created_utc": 1491930766.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4f1ld", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Tiffanyblue235", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I don't feel stigmatized. Half the time I get pity from the people who really know what my mother is like (a narcissistic, manipulative, controlling abuser).\n\n The other half, I'm treated like a rebellious hormonal teenager and told that my mother means well and is a good person, I'll only have one mother so I have to forgive her, it's my fault I was abused to the point of attempted suicide and chronic depression, I can't cut off family bc family etc etc. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t feel stigmatized. Half the time I get pity from the people who really know what my mother is like (a narcissistic, manipulative, controlling abuser).&lt;/p&gt;\n\n&lt;p&gt;The other half, I&amp;#39;m treated like a rebellious hormonal teenager and told that my mother means well and is a good person, I&amp;#39;ll only have one mother so I have to forgive her, it&amp;#39;s my fault I was abused to the point of attempted suicide and chronic depression, I can&amp;#39;t cut off family bc family etc etc. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4f1ld", "score_hidden": false, "stickied": false, "created": 1491953579.0, "created_utc": 1491924779.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4gx24", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "turbulence17", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "My mother is very religious and I am not at all. It put a lot of strain on our relationship, that seems to be less and less of a relationship as I get older. When I tell people about it they all say it makes sense that we don't get along. And they sympathize.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My mother is very religious and I am not at all. It put a lot of strain on our relationship, that seems to be less and less of a relationship as I get older. When I tell people about it they all say it makes sense that we don&amp;#39;t get along. And they sympathize.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4gx24", "score_hidden": false, "stickied": false, "created": 1491955651.0, "created_utc": 1491926851.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4r550", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "oliver_north4236", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I have a \"relationship\" with my mother, but it was a very rocky childhood and some things are just irreparable.  We have a relationship now, but it's more like two separate adults than a mother and daughter.  There has never been any closeness between us and there's lots of lingering hate and anger on my end, mixed with incapacitating guilt because, you know, she's my mother. \n\nI don't really talk about it with people, so I wouldn't say I feel stigmatized.  Just sort of...empty, sometimes, when I get to thinking about it.  I get really warm inside when I see a mother smiling at her daughter, or encouraging her, or hugging her.  I cry a lot at generic-ass mother/daughter movies like Brave.  I keep quiet when people talk about their mothers and wonder what it must be like to have had that during childhood.  To have that now, even.  To have something like that to fall back on.  Sometimes it feels like there's just no ground beneath you, if that makes sense.  \n\nI agree that \"left out\" is a better way to put it, but it's complicated.  I don't know, I really don't like to think about it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a &amp;quot;relationship&amp;quot; with my mother, but it was a very rocky childhood and some things are just irreparable.  We have a relationship now, but it&amp;#39;s more like two separate adults than a mother and daughter.  There has never been any closeness between us and there&amp;#39;s lots of lingering hate and anger on my end, mixed with incapacitating guilt because, you know, she&amp;#39;s my mother. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t really talk about it with people, so I wouldn&amp;#39;t say I feel stigmatized.  Just sort of...empty, sometimes, when I get to thinking about it.  I get really warm inside when I see a mother smiling at her daughter, or encouraging her, or hugging her.  I cry a lot at generic-ass mother/daughter movies like Brave.  I keep quiet when people talk about their mothers and wonder what it must be like to have had that during childhood.  To have that now, even.  To have something like that to fall back on.  Sometimes it feels like there&amp;#39;s just no ground beneath you, if that makes sense.  &lt;/p&gt;\n\n&lt;p&gt;I agree that &amp;quot;left out&amp;quot; is a better way to put it, but it&amp;#39;s complicated.  I don&amp;#39;t know, I really don&amp;#39;t like to think about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4r550", "score_hidden": false, "stickied": false, "created": 1491966760.0, "created_utc": 1491937960.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4lxhk", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "zuzburglar", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Uh yeah it's awkward and I've learned to say short half-truths to avoid the subject. My mom is severely schizoaffective and it went untreated for too long. She was first hospitalized when I was about 9. My grandmother basically raised me and became my official legal guardian at this time, but due to the circumstances we've had a strained relationship. On top of that, I don't have a father (not in a family sense).\n\nWhen people ask about my \"parents\" I basically just say, \"oh they live over in X country and I don't really see them much.\" I feel like I grew up really fast and learned to fend for myself young, but people really have no idea. It's easier to let them believe whatever illusion they want to believe, especially in a professional setting. I do tell friends somewhat, but most of them can't empathize with having a dysfunctional family so I don't go into detail.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Uh yeah it&amp;#39;s awkward and I&amp;#39;ve learned to say short half-truths to avoid the subject. My mom is severely schizoaffective and it went untreated for too long. She was first hospitalized when I was about 9. My grandmother basically raised me and became my official legal guardian at this time, but due to the circumstances we&amp;#39;ve had a strained relationship. On top of that, I don&amp;#39;t have a father (not in a family sense).&lt;/p&gt;\n\n&lt;p&gt;When people ask about my &amp;quot;parents&amp;quot; I basically just say, &amp;quot;oh they live over in X country and I don&amp;#39;t really see them much.&amp;quot; I feel like I grew up really fast and learned to fend for myself young, but people really have no idea. It&amp;#39;s easier to let them believe whatever illusion they want to believe, especially in a professional setting. I do tell friends somewhat, but most of them can&amp;#39;t empathize with having a dysfunctional family so I don&amp;#39;t go into detail.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4lxhk", "score_hidden": false, "stickied": false, "created": 1491961120.0, "created_utc": 1491932320.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4misx", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "thehalflingcooks", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I feel like people pity me because I don't have a mother. It absolutely annoys TF out of me, because my father is so great I really never missed having one. I feel like pitying me is insulting to my dad, like he didn't do a good enough job and if I'd had a mom I'd somehow have/have had a \"better\" life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like people pity me because I don&amp;#39;t have a mother. It absolutely annoys TF out of me, because my father is so great I really never missed having one. I feel like pitying me is insulting to my dad, like he didn&amp;#39;t do a good enough job and if I&amp;#39;d had a mom I&amp;#39;d somehow have/have had a &amp;quot;better&amp;quot; life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4misx", "score_hidden": false, "stickied": false, "created": 1491961764.0, "created_utc": 1491932964.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4sj6w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MysteryMeat101", "parent_id": "t1_dg4nv37", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "She's better at it than anyone I know", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s better at it than anyone I know&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4sj6w", "score_hidden": false, "stickied": false, "created": 1491968262.0, "created_utc": 1491939462.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4nv37", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "spidermon", "parent_id": "t1_dg4n5gp", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "&gt; Apparently my mother still resents me because I was a colicky baby and cried all the time.\n\nThat's holding quite the grudge", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Apparently my mother still resents me because I was a colicky baby and cried all the time.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s holding quite the grudge&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4nv37", "score_hidden": false, "stickied": false, "created": 1491963243.0, "created_utc": 1491934443.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4n5gp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MysteryMeat101", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "My mom is an abusive person, always has been, always will be.  I try to have as little contact with her as possible because that's the healthy thing for me to do.  Apparently my mother still resents me because I was a colicky baby and cried all the time.  I wish I were kidding.  \n\nIt's lonely and mother's day sucks.  When I was a child I always felt ostracized by other kids and especially their parents because my mom was such a nut job.  Most members of my family get it but others think I'm ungrateful or bad for avoiding her. \n\nI've tried forgiving and renewing our relationship over and over but she's just plain toxic.  In her opinion, I'm not \"allowed\" to voice an opinion different from hers and should obey every order she barks out.  Every time I try to fake it for the sake of the rest of the family she ends up embarrassing me or verbally abusing me.  She insisted on sitting beside me at my cousin's wedding and announced that the brides' boobs were fake as she (the bride) was walking down the aisle (I'm pretty sure they're real BTW).  Then at the reception she told everyone that would listen that men only marry me for my money and that my cousin better get a good job so she can hook the next one.  \n\nThe last time I spoke to my mom, she told me I was absolutely going to hell because I don't attend church anymore and that she can't stand the thought of me burning in hell with my grandfather.  When I disagreed with her (as calmly and pleasantly as possible) she repeatedly sent texts and left voicemails for me and my husband and threatened to call both of us at work as long as necessary until I \"shaped up\".  \n\nAfter lots of therapy, my life is great as long as I leave my mom out of it.  My spouse thought I was exaggerating for a long time until he saw her in action.  My MIL still doesn't understand and asks me if I've talked to my mother every time we speak.  Consequently, I avoid my MIL which causes stress for my husband.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My mom is an abusive person, always has been, always will be.  I try to have as little contact with her as possible because that&amp;#39;s the healthy thing for me to do.  Apparently my mother still resents me because I was a colicky baby and cried all the time.  I wish I were kidding.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s lonely and mother&amp;#39;s day sucks.  When I was a child I always felt ostracized by other kids and especially their parents because my mom was such a nut job.  Most members of my family get it but others think I&amp;#39;m ungrateful or bad for avoiding her. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve tried forgiving and renewing our relationship over and over but she&amp;#39;s just plain toxic.  In her opinion, I&amp;#39;m not &amp;quot;allowed&amp;quot; to voice an opinion different from hers and should obey every order she barks out.  Every time I try to fake it for the sake of the rest of the family she ends up embarrassing me or verbally abusing me.  She insisted on sitting beside me at my cousin&amp;#39;s wedding and announced that the brides&amp;#39; boobs were fake as she (the bride) was walking down the aisle (I&amp;#39;m pretty sure they&amp;#39;re real BTW).  Then at the reception she told everyone that would listen that men only marry me for my money and that my cousin better get a good job so she can hook the next one.  &lt;/p&gt;\n\n&lt;p&gt;The last time I spoke to my mom, she told me I was absolutely going to hell because I don&amp;#39;t attend church anymore and that she can&amp;#39;t stand the thought of me burning in hell with my grandfather.  When I disagreed with her (as calmly and pleasantly as possible) she repeatedly sent texts and left voicemails for me and my husband and threatened to call both of us at work as long as necessary until I &amp;quot;shaped up&amp;quot;.  &lt;/p&gt;\n\n&lt;p&gt;After lots of therapy, my life is great as long as I leave my mom out of it.  My spouse thought I was exaggerating for a long time until he saw her in action.  My MIL still doesn&amp;#39;t understand and asks me if I&amp;#39;ve talked to my mother every time we speak.  Consequently, I avoid my MIL which causes stress for my husband.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4n5gp", "score_hidden": false, "stickied": false, "created": 1491962456.0, "created_utc": 1491933656.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4rh6f", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "mmogie7788", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "It's incredibly disheartening when I try and explain why I don't have a relationship. I always refer to her by her real name to distance herself from the term of mother because she never has acted like a mother. People will tell me that I am being harsh and tell me that I should reach out because their relationship with their moms is great which makes me switch conversation topics. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s incredibly disheartening when I try and explain why I don&amp;#39;t have a relationship. I always refer to her by her real name to distance herself from the term of mother because she never has acted like a mother. People will tell me that I am being harsh and tell me that I should reach out because their relationship with their moms is great which makes me switch conversation topics. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4rh6f", "score_hidden": false, "stickied": false, "created": 1491967119.0, "created_utc": 1491938319.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4t06r", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "destria", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I'm not sure about stigmatised but I think it definitely confuses and makes people uncomfortable to know I'm not very close with my mother. I think for a lot of people it kind of questions their worldview. I try to avoid questions about my parents (I am no contact with them) and fob questions off with kind of half truths. So someone might ask how my folks are doing and I'll say \"Well no news is good news, right?\" and try to change the topic. Or I'll say that my parents are abroad so I don't always keep in contact with them (pretty much a 50/50 chance that's true anyway). \n\nOccasionally if I go into more detail about how I don't contact my mother and why, they tend to be quite dismissive of my reasons, falling back on clichés like \"Well she's your mother I'm sure she loves you.\" I tend to get this the most from people who are mothers themselves, who often react as if I'm being negative about all mothers rather than just my own.\n\nI'll be honest though I don't know any other women in similar situations as mine. All my friends seem to be on good terms with their mothers. But there's probably lots of women like me who don't really share our lack of relationship with our mothers, precisely for the reasons I've listed above.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure about stigmatised but I think it definitely confuses and makes people uncomfortable to know I&amp;#39;m not very close with my mother. I think for a lot of people it kind of questions their worldview. I try to avoid questions about my parents (I am no contact with them) and fob questions off with kind of half truths. So someone might ask how my folks are doing and I&amp;#39;ll say &amp;quot;Well no news is good news, right?&amp;quot; and try to change the topic. Or I&amp;#39;ll say that my parents are abroad so I don&amp;#39;t always keep in contact with them (pretty much a 50/50 chance that&amp;#39;s true anyway). &lt;/p&gt;\n\n&lt;p&gt;Occasionally if I go into more detail about how I don&amp;#39;t contact my mother and why, they tend to be quite dismissive of my reasons, falling back on clichés like &amp;quot;Well she&amp;#39;s your mother I&amp;#39;m sure she loves you.&amp;quot; I tend to get this the most from people who are mothers themselves, who often react as if I&amp;#39;m being negative about all mothers rather than just my own.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll be honest though I don&amp;#39;t know any other women in similar situations as mine. All my friends seem to be on good terms with their mothers. But there&amp;#39;s probably lots of women like me who don&amp;#39;t really share our lack of relationship with our mothers, precisely for the reasons I&amp;#39;ve listed above.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4t06r", "score_hidden": false, "stickied": false, "created": 1491968768.0, "created_utc": 1491939968.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4tl80", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "scrote_inspector", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "When my now-MIL found out that I don't have a relationship with my mother, she tried getting me to reconnect with her, which I completely ignored. I've never really felt stigmatized by the situation; most people assume my stepmom is my bio mother. If people ask why I'm no-contact with my mother, I tell them the truth: she was abusive and my life is better without her in it. Most people drop it at that point. If somebody really presses me (\"but she's family!\"), I tell them that she's an unstable piece of shit who abandoned all three of her daughters, and so far no one has tried to argue with that.", "edited": 1491940826.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When my now-MIL found out that I don&amp;#39;t have a relationship with my mother, she tried getting me to reconnect with her, which I completely ignored. I&amp;#39;ve never really felt stigmatized by the situation; most people assume my stepmom is my bio mother. If people ask why I&amp;#39;m no-contact with my mother, I tell them the truth: she was abusive and my life is better without her in it. Most people drop it at that point. If somebody really presses me (&amp;quot;but she&amp;#39;s family!&amp;quot;), I tell them that she&amp;#39;s an unstable piece of shit who abandoned all three of her daughters, and so far no one has tried to argue with that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4tl80", "score_hidden": false, "stickied": false, "created": 1491969399.0, "created_utc": 1491940599.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4n3hu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "UrbanCowgirl79", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I'm 38 so I don't feel stigmatized at this point. Maybe I've just gotten lucky but when I've said she was abusive and neglectful, and told stories about her, I've never had anybod say \"I don't believe you\" or \"you're just being a brat\". I didn't talk about her or the abuse until I was over age 30 and married, so I was at an age and in a life-place where I had general credibility. Mostly people are sympathetic and understand. Sometimes I can tell the person is uncomfortable hearing about it so I change the subject. My husband's other is alive AFAIK but he hasn't had a relationship with anybody in his family of origin for about 20 years. He's Ex-Mormon, you know how that goes. I don't personally know anybody else with a mother so toxic that they chose to cut contact, but there are plenty of other people in the same situation over at /r/raisedbynarcissists. As someone else said on this thread, it feels sad like I'm left out. Other people have these wonderful, positive relationships in their life and I don't.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 38 so I don&amp;#39;t feel stigmatized at this point. Maybe I&amp;#39;ve just gotten lucky but when I&amp;#39;ve said she was abusive and neglectful, and told stories about her, I&amp;#39;ve never had anybod say &amp;quot;I don&amp;#39;t believe you&amp;quot; or &amp;quot;you&amp;#39;re just being a brat&amp;quot;. I didn&amp;#39;t talk about her or the abuse until I was over age 30 and married, so I was at an age and in a life-place where I had general credibility. Mostly people are sympathetic and understand. Sometimes I can tell the person is uncomfortable hearing about it so I change the subject. My husband&amp;#39;s other is alive AFAIK but he hasn&amp;#39;t had a relationship with anybody in his family of origin for about 20 years. He&amp;#39;s Ex-Mormon, you know how that goes. I don&amp;#39;t personally know anybody else with a mother so toxic that they chose to cut contact, but there are plenty of other people in the same situation over at &lt;a href=\"/r/raisedbynarcissists\"&gt;/r/raisedbynarcissists&lt;/a&gt;. As someone else said on this thread, it feels sad like I&amp;#39;m left out. Other people have these wonderful, positive relationships in their life and I don&amp;#39;t.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4n3hu", "score_hidden": false, "stickied": false, "created": 1491962397.0, "created_utc": 1491933597.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4pj3w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "_antsinmypants_", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Like many of the comments, I don't feel stigmatized, but more of an anomaly? For most people, being part of a \"normal family\" means having parents and having a relationship with them. I've never met my dad and I speak to my mom about twice per year. So yeah, not the \"norm\" and I feel like people don' usually know how to process that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like many of the comments, I don&amp;#39;t feel stigmatized, but more of an anomaly? For most people, being part of a &amp;quot;normal family&amp;quot; means having parents and having a relationship with them. I&amp;#39;ve never met my dad and I speak to my mom about twice per year. So yeah, not the &amp;quot;norm&amp;quot; and I feel like people don&amp;#39; usually know how to process that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4pj3w", "score_hidden": false, "stickied": false, "created": 1491965070.0, "created_utc": 1491936270.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4sppq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ifoundxaway", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I don't have much of a relationship with either one of my parents.  I don't really talk about it much.  People don't usually believe me, or say \"but they're family\".  But there is a reason I have a chosen family and I have my parents.\n\nI deal with it by having my own family (son and son's father, the \"in-laws\", a few friends), etc. full of good people.  I have a great life.  But sometimes when I hear people talking about their parents and how great they are I feel like I'm missing out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have much of a relationship with either one of my parents.  I don&amp;#39;t really talk about it much.  People don&amp;#39;t usually believe me, or say &amp;quot;but they&amp;#39;re family&amp;quot;.  But there is a reason I have a chosen family and I have my parents.&lt;/p&gt;\n\n&lt;p&gt;I deal with it by having my own family (son and son&amp;#39;s father, the &amp;quot;in-laws&amp;quot;, a few friends), etc. full of good people.  I have a great life.  But sometimes when I hear people talking about their parents and how great they are I feel like I&amp;#39;m missing out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4sppq", "score_hidden": false, "stickied": false, "created": 1491968457.0, "created_utc": 1491939657.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4sqww", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "knittedsock", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I've had to explain myself a number of times, but I've actually only had 1 reaction - a guy I was dating asked why I never talk about my mom, so I had to explain myself. He thought that was too bad, and I should become friends with his mom... which is weird for my time of being in my 20s and self sufficient. \n\nMost don't say anything else, and no one has questioned my decision to mend things. Maybe it is my age as I'm in my 30s. Or maybe it is my explanation that she was abusive, threw me out of the house as a teen, and is a huge homophobe and racist. But back when all this was happening, my friend's moms became my mom, I stayed with them and had that safety net.\n\nOn the flip side. My husband has been asked more about my mom, which he simply says we are not in contact. It is a \"high five you have no MIL.\" reaction which I find also offense to assume all MIL are terrors. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had to explain myself a number of times, but I&amp;#39;ve actually only had 1 reaction - a guy I was dating asked why I never talk about my mom, so I had to explain myself. He thought that was too bad, and I should become friends with his mom... which is weird for my time of being in my 20s and self sufficient. &lt;/p&gt;\n\n&lt;p&gt;Most don&amp;#39;t say anything else, and no one has questioned my decision to mend things. Maybe it is my age as I&amp;#39;m in my 30s. Or maybe it is my explanation that she was abusive, threw me out of the house as a teen, and is a huge homophobe and racist. But back when all this was happening, my friend&amp;#39;s moms became my mom, I stayed with them and had that safety net.&lt;/p&gt;\n\n&lt;p&gt;On the flip side. My husband has been asked more about my mom, which he simply says we are not in contact. It is a &amp;quot;high five you have no MIL.&amp;quot; reaction which I find also offense to assume all MIL are terrors. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4sqww", "score_hidden": false, "stickied": false, "created": 1491968493.0, "created_utc": 1491939693.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4t24b", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "pm_me_ur_raccoon", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Prior to her death at the end of last year, I had a very low contact relationship with my Mother for about 5+years due to her alcoholism. The situation never really came up with strangers and the people who knew why I didn't speak to her completely understood why.\n\nI just remember one guy who I worked with who I didn't really know insisting that I *had* to forgive and love my Mother. Nah mate, jog the fuck on.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Prior to her death at the end of last year, I had a very low contact relationship with my Mother for about 5+years due to her alcoholism. The situation never really came up with strangers and the people who knew why I didn&amp;#39;t speak to her completely understood why.&lt;/p&gt;\n\n&lt;p&gt;I just remember one guy who I worked with who I didn&amp;#39;t really know insisting that I &lt;em&gt;had&lt;/em&gt; to forgive and love my Mother. Nah mate, jog the fuck on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4t24b", "score_hidden": false, "stickied": false, "created": 1491968823.0, "created_utc": 1491940023.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4thkz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lncr", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Actually no. Usually I just say I haven't talked to my mother in 5 years and that's that. If I do ever explain the situation, nobody gives me grief for it. I have my dad and my step mom and that seems to be good enough for people lol.\n\nThe only thing people tell me is that I need to forgive her for my own sake, so I can move on... Not that I need to talk to her. But I like keeping my anger and hatred of her, my one way I won and maintained control, for once in my life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually no. Usually I just say I haven&amp;#39;t talked to my mother in 5 years and that&amp;#39;s that. If I do ever explain the situation, nobody gives me grief for it. I have my dad and my step mom and that seems to be good enough for people lol.&lt;/p&gt;\n\n&lt;p&gt;The only thing people tell me is that I need to forgive her for my own sake, so I can move on... Not that I need to talk to her. But I like keeping my anger and hatred of her, my one way I won and maintained control, for once in my life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4thkz", "score_hidden": false, "stickied": false, "created": 1491969289.0, "created_utc": 1491940489.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4ycsa", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "pre77yki77y", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I really appreciate seeing this thread because it so often feels like I'm the only person that I know who does not want to have a relationship with their mother. \n\nI definitely feel like I've been \"shamed\" by people who do not know much about my situation, but I always remind myself that any abusive relationship is unhealthy, even if it's my own mother. I would rather be a happy, healthy human with a great mother-in-law than an unhappy one with a scary mother.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really appreciate seeing this thread because it so often feels like I&amp;#39;m the only person that I know who does not want to have a relationship with their mother. &lt;/p&gt;\n\n&lt;p&gt;I definitely feel like I&amp;#39;ve been &amp;quot;shamed&amp;quot; by people who do not know much about my situation, but I always remind myself that any abusive relationship is unhealthy, even if it&amp;#39;s my own mother. I would rather be a happy, healthy human with a great mother-in-law than an unhappy one with a scary mother.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4ycsa", "score_hidden": false, "stickied": false, "created": 1491974846.0, "created_utc": 1491946046.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg4zqvb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheMarkHasBeenMade", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "It's really awkward when my older female colleague assumes that my mom always wants to see me and is always happy to see me and vice versa, because she herself is a doting mom of three who loves her kids very much and wouldn't get that I basically had no emotional support from my mother for all of my childhood and formative years. \n\nI haven't told my colleague any of this yet, I just agree with her and change the subject when she says \"I bet your mom is looking forward to your visit home\" because I don't want to have to explain my shitty childhood and my mom's shitty parenting. And apparently no one wants to hear what can be construed as negativity or complaining (life lesson) so I don't bother to get into it. \n\nIt just sucks that this colleague is always bringing up, \"Are you going to see your mom for the holidays? I bet she misses you being around.\" ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s really awkward when my older female colleague assumes that my mom always wants to see me and is always happy to see me and vice versa, because she herself is a doting mom of three who loves her kids very much and wouldn&amp;#39;t get that I basically had no emotional support from my mother for all of my childhood and formative years. &lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t told my colleague any of this yet, I just agree with her and change the subject when she says &amp;quot;I bet your mom is looking forward to your visit home&amp;quot; because I don&amp;#39;t want to have to explain my shitty childhood and my mom&amp;#39;s shitty parenting. And apparently no one wants to hear what can be construed as negativity or complaining (life lesson) so I don&amp;#39;t bother to get into it. &lt;/p&gt;\n\n&lt;p&gt;It just sucks that this colleague is always bringing up, &amp;quot;Are you going to see your mom for the holidays? I bet she misses you being around.&amp;quot; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg4zqvb", "score_hidden": false, "stickied": false, "created": 1491976527.0, "created_utc": 1491947727.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg50t5o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RockyFlintstone", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Not really, because I don't tell many people except my few friends who get it.  I have one friend who is also estranged and then one who saw the \"if you don't agree that I was perfect and you were the worst child ever then I can no longer love you\" letter.  And another who was thrown out of his home for being gay at age 15.  But mostly I keep that shit to myself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not really, because I don&amp;#39;t tell many people except my few friends who get it.  I have one friend who is also estranged and then one who saw the &amp;quot;if you don&amp;#39;t agree that I was perfect and you were the worst child ever then I can no longer love you&amp;quot; letter.  And another who was thrown out of his home for being gay at age 15.  But mostly I keep that shit to myself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg50t5o", "score_hidden": false, "stickied": false, "created": 1491977870.0, "created_utc": 1491949070.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg56h0x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sparkplugadoodle", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "There is a big difference between someone who gave birth to you and a mother.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is a big difference between someone who gave birth to you and a mother.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg56h0x", "score_hidden": false, "stickied": false, "created": 1491985379.0, "created_utc": 1491956579.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg586wr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "queenofmirth", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I've been estranged from my mother for ten years. The people I've chosen to talk to about it all seem understanding, and I've never felt like anyone was dismissive or saw me differently after I told them. However, I do believe that the negative relationship I had with my mom until I stopped seeing her when I was 13 has really affected my in certain ways. For example, I don't think I have a single maternal instinct and I probably never will. I'm actually quite afraid of children and pregnancy.\n\nWhen I was a young girl I had a really misogynistic attitude and wished I had been born a man. I had a hard time trusting women and forming friendships with other girls until I got to college. My life is good now, though! I believe it's better than it would be if I had continued to be in contact with her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been estranged from my mother for ten years. The people I&amp;#39;ve chosen to talk to about it all seem understanding, and I&amp;#39;ve never felt like anyone was dismissive or saw me differently after I told them. However, I do believe that the negative relationship I had with my mom until I stopped seeing her when I was 13 has really affected my in certain ways. For example, I don&amp;#39;t think I have a single maternal instinct and I probably never will. I&amp;#39;m actually quite afraid of children and pregnancy.&lt;/p&gt;\n\n&lt;p&gt;When I was a young girl I had a really misogynistic attitude and wished I had been born a man. I had a hard time trusting women and forming friendships with other girls until I got to college. My life is good now, though! I believe it&amp;#39;s better than it would be if I had continued to be in contact with her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg586wr", "score_hidden": false, "stickied": false, "created": 1491987663.0, "created_utc": 1491958863.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg5bxdg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "allfor1", "parent_id": "t1_dg593gn", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "This is exactly what I wanted to write. I 100% feel misunderstood even after explaining my reasoning behind not wanting to have a relationship with her. My teenage years were a nightmare because of her abuse, hurtfulness, and just plain meanness. What do we do when we feel a relationship is not worth sustaining? We get away, we move on, we cut that person from our life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is exactly what I wanted to write. I 100% feel misunderstood even after explaining my reasoning behind not wanting to have a relationship with her. My teenage years were a nightmare because of her abuse, hurtfulness, and just plain meanness. What do we do when we feel a relationship is not worth sustaining? We get away, we move on, we cut that person from our life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg5bxdg", "score_hidden": false, "stickied": false, "created": 1491992560.0, "created_utc": 1491963760.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg593gn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "skipp-it-ee-doo-da", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I wouldn't say I feel stigmatised. More like misunderstood. Like, I've lost count of how many people I've told about how my mother was abusive who still tell me that I should give her another chance, or call her, or whatever. It's like, you would NEVER tell me these things if we were talking about an abusive partner, so why are you saying them to me because this is my mom? Just because she birthed me does not mean she gets some sort of special privileges when it comes to how she treats me. \n\nAnd, to a certain extent, I get it. Like, I mostly get this reaction from people who had really good mothers, so they don't get the idea of a really hurtful mom. They don't get that, no, I don't need to forgive my mom for doing X mean thing because no, it wasn't a misunderstanding, she knew exactly what she was doing and no, this wasn't a one-time mistake, she does this ALL THE TIME.\n\nAnd, on one hand, I'm glad they have no idea what it's like to have a parent wage an 18-year war against your psychological well-being. But, on the other hand, they can fuck right off when they try to tell me how I should or shouldn't deal with my mom.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t say I feel stigmatised. More like misunderstood. Like, I&amp;#39;ve lost count of how many people I&amp;#39;ve told about how my mother was abusive who still tell me that I should give her another chance, or call her, or whatever. It&amp;#39;s like, you would NEVER tell me these things if we were talking about an abusive partner, so why are you saying them to me because this is my mom? Just because she birthed me does not mean she gets some sort of special privileges when it comes to how she treats me. &lt;/p&gt;\n\n&lt;p&gt;And, to a certain extent, I get it. Like, I mostly get this reaction from people who had really good mothers, so they don&amp;#39;t get the idea of a really hurtful mom. They don&amp;#39;t get that, no, I don&amp;#39;t need to forgive my mom for doing X mean thing because no, it wasn&amp;#39;t a misunderstanding, she knew exactly what she was doing and no, this wasn&amp;#39;t a one-time mistake, she does this ALL THE TIME.&lt;/p&gt;\n\n&lt;p&gt;And, on one hand, I&amp;#39;m glad they have no idea what it&amp;#39;s like to have a parent wage an 18-year war against your psychological well-being. But, on the other hand, they can fuck right off when they try to tell me how I should or shouldn&amp;#39;t deal with my mom.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg593gn", "score_hidden": false, "stickied": false, "created": 1491988811.0, "created_utc": 1491960011.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg6f89c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "txmoonpie1", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I don't feel stigmatized, but it is always a gamble when people ask about my mom. (I am NC with both parents) My mother was emotionally and physically abusive, and allowed my dad to do the same. It took me until the age of 38 to cut her off. When she left my father I allowed her to stay in my home for almost a year. I tried to get a conversation going about the abuse, but her eyes glazed over and she never said a word. After she left she told my brother and sister in law that I was crazy. She found out that I talked to them about the abuse and she tried to invalidate me even to my brother, who had witnessed her abuse towards me. Thankfully people have been very supportive and understanding when I tell them that I no longer have my parents in my life due to abuse. I reached out to two of my aunts for female support and was pleasantly surprised when they were nothing but supportive. They have never tried to get me to reconcile with my mother. I really don't know anyone in real life that is in the same situation as I am with my parents. Abuse is a hard thing to talk about. My life is good now. I have  struggled many years, but going to therapy is helping me through the process of grieving for the parents I never had, but definitely deserved. My boyfriend is also very supportive and has said that he never would have allowed my mother to stay with us last year if I had told him some of the things she did to me. He is protective. It's nice having someone that has your back. My boyfriend's mom has been very understanding and has never questioned my sincerity. She asked about my mother once, but after I told her that I was abused, she never brought her up again. I have a child who I love so much. I know that the cycle of violence and abuse can be stopped, because it stopped with me. I have never even spanked my child. Talking to him always worked. I could never bring myself to treat my son the way my parents treated me. I think that at some point I will stop grieving the fact that I never had good parents. I have been NC with my mom for a year, and it has already gotten easier to live with. I feel less guilt about it everyday. I do still feel a twinge of jealousy when I see a mom and daughter having a good time together, but I have been very lucky in that my friend's moms have always filled that role in some capacity, even when I was a kid.\n\nEdit: A sentence.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t feel stigmatized, but it is always a gamble when people ask about my mom. (I am NC with both parents) My mother was emotionally and physically abusive, and allowed my dad to do the same. It took me until the age of 38 to cut her off. When she left my father I allowed her to stay in my home for almost a year. I tried to get a conversation going about the abuse, but her eyes glazed over and she never said a word. After she left she told my brother and sister in law that I was crazy. She found out that I talked to them about the abuse and she tried to invalidate me even to my brother, who had witnessed her abuse towards me. Thankfully people have been very supportive and understanding when I tell them that I no longer have my parents in my life due to abuse. I reached out to two of my aunts for female support and was pleasantly surprised when they were nothing but supportive. They have never tried to get me to reconcile with my mother. I really don&amp;#39;t know anyone in real life that is in the same situation as I am with my parents. Abuse is a hard thing to talk about. My life is good now. I have  struggled many years, but going to therapy is helping me through the process of grieving for the parents I never had, but definitely deserved. My boyfriend is also very supportive and has said that he never would have allowed my mother to stay with us last year if I had told him some of the things she did to me. He is protective. It&amp;#39;s nice having someone that has your back. My boyfriend&amp;#39;s mom has been very understanding and has never questioned my sincerity. She asked about my mother once, but after I told her that I was abused, she never brought her up again. I have a child who I love so much. I know that the cycle of violence and abuse can be stopped, because it stopped with me. I have never even spanked my child. Talking to him always worked. I could never bring myself to treat my son the way my parents treated me. I think that at some point I will stop grieving the fact that I never had good parents. I have been NC with my mom for a year, and it has already gotten easier to live with. I feel less guilt about it everyday. I do still feel a twinge of jealousy when I see a mom and daughter having a good time together, but I have been very lucky in that my friend&amp;#39;s moms have always filled that role in some capacity, even when I was a kid.&lt;/p&gt;\n\n&lt;p&gt;Edit: A sentence.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg6f89c", "score_hidden": false, "stickied": false, "created": 1492054725.0, "created_utc": 1492025925.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg50fz8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mlktea", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I really don't get bad reactions. Then again, anyone who needs to know about my relationship with my mom will know me well enough to just take my word for it. I think it's a matter of phrasing and what you let them know. It can come off as bratty \"ugh mommmm\" unless you frame it properly. If someone asks something like, \"are you seeing your mom for ___?\" I just say \"No, we don't get along,\" and they drop it. I haven't had people rude enough to insist I'm wrong about my own family. \n\nOther than that, I really don't care. Mother's Day doesn't bother me, maybe a mom-daughter flick one in a while will make me envy them a little, but I rarely think about it. My life is fine the way it is. ", "edited": 1491948798.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really don&amp;#39;t get bad reactions. Then again, anyone who needs to know about my relationship with my mom will know me well enough to just take my word for it. I think it&amp;#39;s a matter of phrasing and what you let them know. It can come off as bratty &amp;quot;ugh mommmm&amp;quot; unless you frame it properly. If someone asks something like, &amp;quot;are you seeing your mom for ___?&amp;quot; I just say &amp;quot;No, we don&amp;#39;t get along,&amp;quot; and they drop it. I haven&amp;#39;t had people rude enough to insist I&amp;#39;m wrong about my own family. &lt;/p&gt;\n\n&lt;p&gt;Other than that, I really don&amp;#39;t care. Mother&amp;#39;s Day doesn&amp;#39;t bother me, maybe a mom-daughter flick one in a while will make me envy them a little, but I rarely think about it. My life is fine the way it is. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg50fz8", "score_hidden": false, "stickied": false, "created": 1491977401.0, "created_utc": 1491948601.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg553iw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ANNEJOY", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "It really sucks. I see all these posts about kids wanting to care for their lovely mother because she sacrificed so much for them, and I can't relate and that makes me feel like shit. It's like society expects me to love her regardless of what she did/is doing. I'm not going to take care of a gas-lighting, abusive, crazy person who refuses to get better or listen to how she's messed me up. \n\n\nPeople condescend/brush off what I say until they meet her or get to know her, and then they're like, \"oh shit, you weren't kidding or making a big deal of it. This is fucked up, something is seriously wrong with her\". I've been told countless times that \"she's your mother and you have to love her\". Those people took that back as soon as they experienced what she was like first hand. Just because she's related does not mean I have to love her; I didn't pick her and I didn't choose to be born.\n\n\nWhat's good is I'm finally getting people to see my point of view, after being told to keep quiet all my life because my mom told me \"it'll make me look bad if I say something bad about my mom\". I think I just got sick of her mind games and depression she caused. Once college hit and I gave less fucks and knew I needed to tell someone. So at least my feelings and experiences are validated, and now I have a support network. ", "edited": 1491955057.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It really sucks. I see all these posts about kids wanting to care for their lovely mother because she sacrificed so much for them, and I can&amp;#39;t relate and that makes me feel like shit. It&amp;#39;s like society expects me to love her regardless of what she did/is doing. I&amp;#39;m not going to take care of a gas-lighting, abusive, crazy person who refuses to get better or listen to how she&amp;#39;s messed me up. &lt;/p&gt;\n\n&lt;p&gt;People condescend/brush off what I say until they meet her or get to know her, and then they&amp;#39;re like, &amp;quot;oh shit, you weren&amp;#39;t kidding or making a big deal of it. This is fucked up, something is seriously wrong with her&amp;quot;. I&amp;#39;ve been told countless times that &amp;quot;she&amp;#39;s your mother and you have to love her&amp;quot;. Those people took that back as soon as they experienced what she was like first hand. Just because she&amp;#39;s related does not mean I have to love her; I didn&amp;#39;t pick her and I didn&amp;#39;t choose to be born.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s good is I&amp;#39;m finally getting people to see my point of view, after being told to keep quiet all my life because my mom told me &amp;quot;it&amp;#39;ll make me look bad if I say something bad about my mom&amp;quot;. I think I just got sick of her mind games and depression she caused. Once college hit and I gave less fucks and knew I needed to tell someone. So at least my feelings and experiences are validated, and now I have a support network. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg553iw", "score_hidden": false, "stickied": false, "created": 1491983554.0, "created_utc": 1491954754.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg5dazr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Purple-Leopard", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "People don't believe me when I'm vague and tell them my mother and I don't really have a relationship at all. The stupid facebook memes talking about loving your mother and all this BS gets to be sometimes. /r/raisedbynarcissists helps, as well as the facebook group Moms without Moms. Helps knowing you're not alone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People don&amp;#39;t believe me when I&amp;#39;m vague and tell them my mother and I don&amp;#39;t really have a relationship at all. The stupid facebook memes talking about loving your mother and all this BS gets to be sometimes. &lt;a href=\"/r/raisedbynarcissists\"&gt;/r/raisedbynarcissists&lt;/a&gt; helps, as well as the facebook group Moms without Moms. Helps knowing you&amp;#39;re not alone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg5dazr", "score_hidden": false, "stickied": false, "created": 1491994475.0, "created_utc": 1491965675.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg5ipl1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bobannon", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I think it's generally hard for normies to wrap their head around how someone could walk away from a relationship with her mother at the age of 16. There wasn't abuse, but I'll just say that thankfully my dad got custody in the divorce when I was 5. \n\nSo given that there's no horrible stories of abuse or mental torture, there's a bit of dismissiveness from people who don't know her. Like, \"Yeah. Your mother is an awful human being who was shit at being a mother. That was such a long time ago. Get over it!\" \n\nShe had another daughter (I'll call her \"Amy\" here) when I was 15, shortly before I moved to another province with my dad. The last time I saw Amy, she was 3 months old. About 6 or 7 years ago Amy found me on Facebook and we started e-mailing/chatting. It's like looking through a fun house mirror at a life that could have been mine if things had been slightly different. It just makes me thankful I have the father I do because hers is a bit useless and our mother still is kind of terrible at being a mother though they're very, very close. \n\nI don't think I'm envious of their specific relationship but rather I feel like I've missed out on the *idea* of a close mother-daughter relationship? \n\nThen again, I'm sure there are people who *are* in relationships with their mothers who pine a little for that idealized version of that relationship, too! \n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s generally hard for normies to wrap their head around how someone could walk away from a relationship with her mother at the age of 16. There wasn&amp;#39;t abuse, but I&amp;#39;ll just say that thankfully my dad got custody in the divorce when I was 5. &lt;/p&gt;\n\n&lt;p&gt;So given that there&amp;#39;s no horrible stories of abuse or mental torture, there&amp;#39;s a bit of dismissiveness from people who don&amp;#39;t know her. Like, &amp;quot;Yeah. Your mother is an awful human being who was shit at being a mother. That was such a long time ago. Get over it!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;She had another daughter (I&amp;#39;ll call her &amp;quot;Amy&amp;quot; here) when I was 15, shortly before I moved to another province with my dad. The last time I saw Amy, she was 3 months old. About 6 or 7 years ago Amy found me on Facebook and we started e-mailing/chatting. It&amp;#39;s like looking through a fun house mirror at a life that could have been mine if things had been slightly different. It just makes me thankful I have the father I do because hers is a bit useless and our mother still is kind of terrible at being a mother though they&amp;#39;re very, very close. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think I&amp;#39;m envious of their specific relationship but rather I feel like I&amp;#39;ve missed out on the &lt;em&gt;idea&lt;/em&gt; of a close mother-daughter relationship? &lt;/p&gt;\n\n&lt;p&gt;Then again, I&amp;#39;m sure there are people who &lt;em&gt;are&lt;/em&gt; in relationships with their mothers who pine a little for that idealized version of that relationship, too! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg5ipl1", "score_hidden": false, "stickied": false, "created": 1492003467.0, "created_utc": 1491974667.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg5nk35", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RAGE-RAGE-RAGE", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "By my friends? No, because they know how much of a wacko she is. Other people? Occasionally. I never bring it up, but sometimes it does pop into conversation and people often tend to demand to know why. I hate saying that she was an abusive fuck,  because it's none of their business. I usually just say we don't have a relationship and leave it at that.\n\nSome people pry though or accuse me of being the problem because they can't possibly comprehend a non maternal mother. They seem to think that motherhood somehow makes a mother a saint or they argue that they should be forgiven for every wrong because \"you've only got one mother!\". \nWith these kinds of people you can never win, and I'm glad that with age I've stopped trying to justify my choices to them, because it was exhausting and frustrating.\nI feel like media often romanticizes bad mother daughter relationships, making them out to be tumultuous but in the end worth it because \"family\".\n\nMainly I just feel left out. I wish I had a mom that loved me and cared for me and was there for me. But I don't. So people telling me \"but she's your mom!\" Can fuck off because I know that and it fucking hurts. \n ", "edited": 1491988248.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;By my friends? No, because they know how much of a wacko she is. Other people? Occasionally. I never bring it up, but sometimes it does pop into conversation and people often tend to demand to know why. I hate saying that she was an abusive fuck,  because it&amp;#39;s none of their business. I usually just say we don&amp;#39;t have a relationship and leave it at that.&lt;/p&gt;\n\n&lt;p&gt;Some people pry though or accuse me of being the problem because they can&amp;#39;t possibly comprehend a non maternal mother. They seem to think that motherhood somehow makes a mother a saint or they argue that they should be forgiven for every wrong because &amp;quot;you&amp;#39;ve only got one mother!&amp;quot;. \nWith these kinds of people you can never win, and I&amp;#39;m glad that with age I&amp;#39;ve stopped trying to justify my choices to them, because it was exhausting and frustrating.\nI feel like media often romanticizes bad mother daughter relationships, making them out to be tumultuous but in the end worth it because &amp;quot;family&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Mainly I just feel left out. I wish I had a mom that loved me and cared for me and was there for me. But I don&amp;#39;t. So people telling me &amp;quot;but she&amp;#39;s your mom!&amp;quot; Can fuck off because I know that and it fucking hurts. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg5nk35", "score_hidden": false, "stickied": false, "created": 1492016170.0, "created_utc": 1491987370.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg5q339", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MindyS1719", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "People who are close to me completely understand why I choose to have limited contact with both of my parents. My mom is bipolar, abusive and hasn't cleaned a day in her life. My dad is just a loser living off the government with his 4th wife (who is just as crazy as my mom). I've got a baby on the way, do you think I'm going to allow them to be around that type of behavior? Heck no. Now those that don't understand my situation, once I give them the raw details, it becomes clear to them that maybe having my parents in my life isn't a wise decision. Signed the eggshell walker. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People who are close to me completely understand why I choose to have limited contact with both of my parents. My mom is bipolar, abusive and hasn&amp;#39;t cleaned a day in her life. My dad is just a loser living off the government with his 4th wife (who is just as crazy as my mom). I&amp;#39;ve got a baby on the way, do you think I&amp;#39;m going to allow them to be around that type of behavior? Heck no. Now those that don&amp;#39;t understand my situation, once I give them the raw details, it becomes clear to them that maybe having my parents in my life isn&amp;#39;t a wise decision. Signed the eggshell walker. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg5q339", "score_hidden": false, "stickied": false, "created": 1492023816.0, "created_utc": 1491995016.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_64r7tz", "likes": null, "replies": "", "user_reports": [], "id": "dg6kj9p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sleeplessinwa", "parent_id": "t3_64r7tz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "No I've never felt stigmatized. Ever. I feel more embarrassment about the story than anything. Jealousy towards people that have their mothers. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No I&amp;#39;ve never felt stigmatized. Ever. I feel more embarrassment about the story than anything. Jealousy towards people that have their mothers. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dg6kj9p", "score_hidden": false, "stickied": false, "created": 1492060298.0, "created_utc": 1492031498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]