[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskWomen", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65vp17", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 83, "report_reasons": null, "author": "natolate", "saved": false, "mod_reports": [], "name": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "approved_by": null, "over_18": false, "domain": "self.AskWomen", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rxrw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "female", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskWomen/comments/65vp17/former_and_current_sorority_sisters_of_askwomen/", "num_reports": null, "locked": false, "stickied": false, "created": 1492466344.0, "url": "https://www.reddit.com/r/AskWomen/comments/65vp17/former_and_current_sorority_sisters_of_askwomen/", "author_flair_text": "♀", "quarantine": false, "title": "Former and current sorority sisters of AskWomen, what were your best and worst experiences and how old is too old to rush?", "created_utc": 1492437544.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 29, "visited": false, "subreddit_type": "public", "ups": 83}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdj503", "gilded": 0, "archived": false, "score": 44, "report_reasons": null, "author": "maryjanesandbobbysox", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I always liked the charity fundraisers and the networking has helped me professionally in my career over the years. \n\nthe only thing I didn't like was the drama over who liked which boys, etc.  But that's true of other social circles too.  It's not sorority-exclusive, by any means.\n\nI'm sure it varies from place to place, but I wouldn't rush past 21/22 (senior year age for a lot of people)\n\n", "edited": 1492439236.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always liked the charity fundraisers and the networking has helped me professionally in my career over the years. &lt;/p&gt;\n\n&lt;p&gt;the only thing I didn&amp;#39;t like was the drama over who liked which boys, etc.  But that&amp;#39;s true of other social circles too.  It&amp;#39;s not sorority-exclusive, by any means.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure it varies from place to place, but I wouldn&amp;#39;t rush past 21/22 (senior year age for a lot of people)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdj503", "score_hidden": false, "stickied": false, "created": 1492467572.0, "created_utc": 1492438772.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 44}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdk6fd", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "dginmc", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I rushed and pledged a sorority in 1995.  Twenty years later I am still besties with 5 of my sorority sisters.  The others keep in touch via a facebook group.  I recommend it to anyone.  I'd say pledge, with the expectation that you'll be an active member for at least another school year.  \nBest experience?  Looking back at twenty years of friendships via photos and stories.\n\n\n\nWorst experience?  Helping my friend through the divorce of her parents in 1997, and then helping her through her divorce in 2010.  ", "edited": 1492440412.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I rushed and pledged a sorority in 1995.  Twenty years later I am still besties with 5 of my sorority sisters.  The others keep in touch via a facebook group.  I recommend it to anyone.  I&amp;#39;d say pledge, with the expectation that you&amp;#39;ll be an active member for at least another school year.&lt;br/&gt;\nBest experience?  Looking back at twenty years of friendships via photos and stories.&lt;/p&gt;\n\n&lt;p&gt;Worst experience?  Helping my friend through the divorce of her parents in 1997, and then helping her through her divorce in 2010.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdk6fd", "score_hidden": false, "stickied": false, "created": 1492468968.0, "created_utc": 1492440168.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dge7pu5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "classykindofsassy", "parent_id": "t1_dge0673", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "a lot of NPC sororities don't like giving bids to minority women, especially not black women. i didn't know this going into it and if i did i would have never rushed in the first place. most of the sororities at my school refuse to give bids to minority women so i was pretty limited in which sororities would accept me in the first place. eventually i got sick of being around a bunch of racist girls when we would do mixers/events with other sororities. a lot of girls in other sororities got in trouble for making racist posts online about the black girls in other sororities and i wasn't down to be the butt of a joke. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;a lot of NPC sororities don&amp;#39;t like giving bids to minority women, especially not black women. i didn&amp;#39;t know this going into it and if i did i would have never rushed in the first place. most of the sororities at my school refuse to give bids to minority women so i was pretty limited in which sororities would accept me in the first place. eventually i got sick of being around a bunch of racist girls when we would do mixers/events with other sororities. a lot of girls in other sororities got in trouble for making racist posts online about the black girls in other sororities and i wasn&amp;#39;t down to be the butt of a joke. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dge7pu5", "score_hidden": true, "stickied": false, "created": 1492495989.0, "created_utc": 1492467189.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge0673", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "Parkkkko", "parent_id": "t1_dgdiufz", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "What was the racism like?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What was the racism like?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dge0673", "score_hidden": false, "stickied": false, "created": 1492487175.0, "created_utc": 1492458375.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdiufz", "gilded": 0, "archived": false, "score": 66, "report_reasons": null, "author": "classykindofsassy", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "best experiences - the last day of rush was fun, and i always had something to do every weekend and most weeknights. having a group of people to help me study (we had mandatory study hours). all the events, especially charity events we had were always a good time. homecoming week was probably some of the most fun i ever had, especially making the floats for the parade. \n\nworst experiences - racism\n\nhow old is too old really depends on the school. i think if i were like, 25, i wouldn't want to rush and be around a bunch of 18-21 year olds. 22 i think is the oldest i'd go, personally. \n\nit's nice because you essentially have a built in social network of people who are willing to be your friend. you won't be lonely. in the end it wasn't for me, though. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;best experiences - the last day of rush was fun, and i always had something to do every weekend and most weeknights. having a group of people to help me study (we had mandatory study hours). all the events, especially charity events we had were always a good time. homecoming week was probably some of the most fun i ever had, especially making the floats for the parade. &lt;/p&gt;\n\n&lt;p&gt;worst experiences - racism&lt;/p&gt;\n\n&lt;p&gt;how old is too old really depends on the school. i think if i were like, 25, i wouldn&amp;#39;t want to rush and be around a bunch of 18-21 year olds. 22 i think is the oldest i&amp;#39;d go, personally. &lt;/p&gt;\n\n&lt;p&gt;it&amp;#39;s nice because you essentially have a built in social network of people who are willing to be your friend. you won&amp;#39;t be lonely. in the end it wasn&amp;#39;t for me, though. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdiufz", "score_hidden": false, "stickied": false, "created": 1492467167.0, "created_utc": 1492438367.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 66}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdja3a", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "braveandwild", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I'm in college right now and I'm so glad I joined my sorority. The best part of it for me is how I was easily introduced to so many incredible women. I was a transfer at my school and didn't have an easy time meeting people my first couple months. After I joined my sorority I started to get involved on campus and became so much happier! There are always activities going on and things to do (emphasis on the activities part - not just parties!) The worst I would say is the drama. With a group of approximately 200 women, obviously there are going to be plenty of differences in opinion which can lead to conflict. There hasn't been any incidents where I was directly involved, as I tend to stay out of that kind of stuff, so it's really not all that bad. I would say there's no age limit to rush, we take in women of all ages, but I would personally only rush if you're going to be in school for at least a couple more years. It's a big commitment and I don't think it'd be worth it if you rushed as a senior.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in college right now and I&amp;#39;m so glad I joined my sorority. The best part of it for me is how I was easily introduced to so many incredible women. I was a transfer at my school and didn&amp;#39;t have an easy time meeting people my first couple months. After I joined my sorority I started to get involved on campus and became so much happier! There are always activities going on and things to do (emphasis on the activities part - not just parties!) The worst I would say is the drama. With a group of approximately 200 women, obviously there are going to be plenty of differences in opinion which can lead to conflict. There hasn&amp;#39;t been any incidents where I was directly involved, as I tend to stay out of that kind of stuff, so it&amp;#39;s really not all that bad. I would say there&amp;#39;s no age limit to rush, we take in women of all ages, but I would personally only rush if you&amp;#39;re going to be in school for at least a couple more years. It&amp;#39;s a big commitment and I don&amp;#39;t think it&amp;#39;d be worth it if you rushed as a senior.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdja3a", "score_hidden": false, "stickied": false, "created": 1492467768.0, "created_utc": 1492438968.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdkvhd", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "clea_vage", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I was very involved in one of our philanthropies and it was so much fun. We were paired up with a fraternity and we worked on it the whole year. So many memories and fun times. I also met tons of people. I used to be pretty shy around my peers and being in a sorority forced me to get out of my shell. Now I can talk to anybody, which is an excellent skill to have in the \"real world.\"\n\nIt was also really great having events going on all the time - unique parties, formals, philanthropic events, football gameday parties, etc. You didn't have to go to everything, but it was nice to have the option. \n\nWorst? We did have requirements that we had to meet, and sometimes it wasn't terribly convenient. You could miss things if you had a test at the same time, but generally you were required to be at most things (not parties - I'm talking about our formal meetings, fundraising events, homecoming, greek week, etc).\n\nHow old is too old? At my university, most people who rushed were freshman, but sophomores did rush too. Anyone older than that wasn't usually seriously considered during the rush process (unless they were a transfer from another university and they wanted to join the same house). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was very involved in one of our philanthropies and it was so much fun. We were paired up with a fraternity and we worked on it the whole year. So many memories and fun times. I also met tons of people. I used to be pretty shy around my peers and being in a sorority forced me to get out of my shell. Now I can talk to anybody, which is an excellent skill to have in the &amp;quot;real world.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It was also really great having events going on all the time - unique parties, formals, philanthropic events, football gameday parties, etc. You didn&amp;#39;t have to go to everything, but it was nice to have the option. &lt;/p&gt;\n\n&lt;p&gt;Worst? We did have requirements that we had to meet, and sometimes it wasn&amp;#39;t terribly convenient. You could miss things if you had a test at the same time, but generally you were required to be at most things (not parties - I&amp;#39;m talking about our formal meetings, fundraising events, homecoming, greek week, etc).&lt;/p&gt;\n\n&lt;p&gt;How old is too old? At my university, most people who rushed were freshman, but sophomores did rush too. Anyone older than that wasn&amp;#39;t usually seriously considered during the rush process (unless they were a transfer from another university and they wanted to join the same house). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdkvhd", "score_hidden": false, "stickied": false, "created": 1492469852.0, "created_utc": 1492441052.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdm400", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "deets19", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "In retrospect the best experience was that it expanded and changed my social circle throughout college. My junior and senior year I shared a house with other people in my major and was mostly in upper-level classes and study groups with those same people. Being in a sorority meant that I was always meeting new people (rush, a Greek Week partner where I didn't know many guys, etc) and that I was going to non-academic things to support my sisters. Greek life has a reputation for being really insular, and maybe it is at some schools, but at my college it was the thing that brought people from different majors, sports teams, clubs, etc together. \n\nThe worst... my senior year there was a lot of drama around officer elections - it was a very tight race for president, and even the winning side wasn't happy at the end because of all the conflict. Although there's something to be said for being forced to deal with conflicts like that. In previous instances of friend drama I'd basically walked away, and it's harder to do that when you're committed to the group. \n\nBasically all of our members joined as freshman or sophomores... maybe the occasional junior? Usually people who are interested in Greek life get involved early. I suppose you could join as a senior but it would be a really different experience and potentially not worth it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In retrospect the best experience was that it expanded and changed my social circle throughout college. My junior and senior year I shared a house with other people in my major and was mostly in upper-level classes and study groups with those same people. Being in a sorority meant that I was always meeting new people (rush, a Greek Week partner where I didn&amp;#39;t know many guys, etc) and that I was going to non-academic things to support my sisters. Greek life has a reputation for being really insular, and maybe it is at some schools, but at my college it was the thing that brought people from different majors, sports teams, clubs, etc together. &lt;/p&gt;\n\n&lt;p&gt;The worst... my senior year there was a lot of drama around officer elections - it was a very tight race for president, and even the winning side wasn&amp;#39;t happy at the end because of all the conflict. Although there&amp;#39;s something to be said for being forced to deal with conflicts like that. In previous instances of friend drama I&amp;#39;d basically walked away, and it&amp;#39;s harder to do that when you&amp;#39;re committed to the group. &lt;/p&gt;\n\n&lt;p&gt;Basically all of our members joined as freshman or sophomores... maybe the occasional junior? Usually people who are interested in Greek life get involved early. I suppose you could join as a senior but it would be a really different experience and potentially not worth it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdm400", "score_hidden": false, "stickied": false, "created": 1492471366.0, "created_utc": 1492442566.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdsgm1", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "whitemm2", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Best: I met my best friends and bridesmaids, kept my social calendar full, helped me meet my fiancé. \n\nWorst: living with a ton of women, being in a \"lower tier\" sorority is kind of degrading sometimes, recruitment is incredibly draining mentally and emotionally because you're judged superficially on 5 second conversations. \n\n\nAs for rushing age, it depends on what college you go to. Rushing as a sophomore/junior was a death sentence at my college and most sororities only wanted freshmen, which I rushed as. But some colleges it might not matter! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Best: I met my best friends and bridesmaids, kept my social calendar full, helped me meet my fiancé. &lt;/p&gt;\n\n&lt;p&gt;Worst: living with a ton of women, being in a &amp;quot;lower tier&amp;quot; sorority is kind of degrading sometimes, recruitment is incredibly draining mentally and emotionally because you&amp;#39;re judged superficially on 5 second conversations. &lt;/p&gt;\n\n&lt;p&gt;As for rushing age, it depends on what college you go to. Rushing as a sophomore/junior was a death sentence at my college and most sororities only wanted freshmen, which I rushed as. But some colleges it might not matter! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdsgm1", "score_hidden": false, "stickied": false, "created": 1492478528.0, "created_utc": 1492449728.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgducix", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "olivia928", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I'm in a sorority right now!\n\nBest: I have made friendships with some amazing women who have empowered me to be my best self. Got to meet people who expanded my worldview. I was incredibly lonely at college and considering transferring and I honestly think rushing saved my life. I love female centric spaces and the conversations we have and I LOVED living in the house. \n\nWorst: I have a lot of issues with the system of Greek life as a whole that I do struggle with. My chapter is very diverse, lots of queer women, etc but I also go to an intense academically minded school with those sort of people. I know that if I lived in many other places the racism and classism I hear about would be in my face. Overall I think being in a sorority has made me a better feminist but that's because I'm surrounded by women who constantly try to be better, whereas in many places it's all about staying the same as it always has been. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in a sorority right now!&lt;/p&gt;\n\n&lt;p&gt;Best: I have made friendships with some amazing women who have empowered me to be my best self. Got to meet people who expanded my worldview. I was incredibly lonely at college and considering transferring and I honestly think rushing saved my life. I love female centric spaces and the conversations we have and I LOVED living in the house. &lt;/p&gt;\n\n&lt;p&gt;Worst: I have a lot of issues with the system of Greek life as a whole that I do struggle with. My chapter is very diverse, lots of queer women, etc but I also go to an intense academically minded school with those sort of people. I know that if I lived in many other places the racism and classism I hear about would be in my face. Overall I think being in a sorority has made me a better feminist but that&amp;#39;s because I&amp;#39;m surrounded by women who constantly try to be better, whereas in many places it&amp;#39;s all about staying the same as it always has been. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgducix", "score_hidden": false, "stickied": false, "created": 1492480604.0, "created_utc": 1492451804.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdwo3i", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bookworm924", "parent_id": "t1_dgdmtee", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Was she the woman who wrote that Pledged book about sororities?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Was she the woman who wrote that Pledged book about sororities?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdwo3i", "score_hidden": false, "stickied": false, "created": 1492483203.0, "created_utc": 1492454403.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmtee", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "pizzzaing", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "It was amazing and I would highly recommend to anyone. I decided on a whim senior year in high school to do it and just see how things fall into place. I went through the process, and I found that I loved it. And I wasn't very social in the first place but over the 4 years of being in a social sorority, I grew my social awareness, networking skills, and morals. I'm kinda nerdy and always have been- majored in STEM in college, I would limit my partying to just a few nights/month, wasn't the most open but I still found a spot perfectly carved for me. It really helped my studying because in about 50% of my classes (everything but my core classes), I knew someone else and could always go to them with questions/study with them. Another aspect I liked a lot was that we had a chef in our sorority house so I never had to personally pay for meals- it was included in my dues. I knew, no matter how much money I did or didn't have that month, I'd still be able to get 3 healthy meals and 2 snacks every day. Thankfully, my mom paid for my dues so my $10/hr job didn't go towards food really ever. Also, because I majored in STEM, I like to put on my resume that I was in a social sorority because it shows that I am socially apt and a team player, which is not the easiest thing to find in science fields. \n\nWorst part? The drama. There's so much drama, but absolutely not more than any other organization that you spend a lot of time with. I was in marching band and track in high school and it was prettttty much the same level if you negate living together. 55 girls shared a house together and 3-4 girls shared a room so we didn't have that in my high school activities so it was a little bit more drama, just because we literally saw each other 24/7. \n\nHow old? I would really think if it's worth it junior year. By senior year, I had pretty much checked out and was focused on moving away from college so junior year was the last best year I had. Once our school had a 40 year old woman rush and trust me, the gossip was unreal. She ended up being a reporter but still, I would definitely be questioning your junior year if it's worth it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was amazing and I would highly recommend to anyone. I decided on a whim senior year in high school to do it and just see how things fall into place. I went through the process, and I found that I loved it. And I wasn&amp;#39;t very social in the first place but over the 4 years of being in a social sorority, I grew my social awareness, networking skills, and morals. I&amp;#39;m kinda nerdy and always have been- majored in STEM in college, I would limit my partying to just a few nights/month, wasn&amp;#39;t the most open but I still found a spot perfectly carved for me. It really helped my studying because in about 50% of my classes (everything but my core classes), I knew someone else and could always go to them with questions/study with them. Another aspect I liked a lot was that we had a chef in our sorority house so I never had to personally pay for meals- it was included in my dues. I knew, no matter how much money I did or didn&amp;#39;t have that month, I&amp;#39;d still be able to get 3 healthy meals and 2 snacks every day. Thankfully, my mom paid for my dues so my $10/hr job didn&amp;#39;t go towards food really ever. Also, because I majored in STEM, I like to put on my resume that I was in a social sorority because it shows that I am socially apt and a team player, which is not the easiest thing to find in science fields. &lt;/p&gt;\n\n&lt;p&gt;Worst part? The drama. There&amp;#39;s so much drama, but absolutely not more than any other organization that you spend a lot of time with. I was in marching band and track in high school and it was prettttty much the same level if you negate living together. 55 girls shared a house together and 3-4 girls shared a room so we didn&amp;#39;t have that in my high school activities so it was a little bit more drama, just because we literally saw each other 24/7. &lt;/p&gt;\n\n&lt;p&gt;How old? I would really think if it&amp;#39;s worth it junior year. By senior year, I had pretty much checked out and was focused on moving away from college so junior year was the last best year I had. Once our school had a 40 year old woman rush and trust me, the gossip was unreal. She ended up being a reporter but still, I would definitely be questioning your junior year if it&amp;#39;s worth it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdmtee", "score_hidden": false, "stickied": false, "created": 1492472187.0, "created_utc": 1492443387.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdp1rt", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "startink26", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Best experiences- I met the best friends I could ever have in my sorority. Even now, 5+ years after graduating and spread across the country, I know if I call any one of them they would drop everything to be there for me. I also was pretty shy going into college, and all of the events and community engagement really helped me with my public speaking and made me a more outgoing person.\n\nWorst experience- Sometimes living in a house with a bunch of people can be full of drama and get incredibly stressful, but there are so many more good memories!\n\nToo old to rush- I would say now, in my older 20's, I would not fit in with the dynamic the same way an 18-22 year old would, but it's really up to the individual!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Best experiences- I met the best friends I could ever have in my sorority. Even now, 5+ years after graduating and spread across the country, I know if I call any one of them they would drop everything to be there for me. I also was pretty shy going into college, and all of the events and community engagement really helped me with my public speaking and made me a more outgoing person.&lt;/p&gt;\n\n&lt;p&gt;Worst experience- Sometimes living in a house with a bunch of people can be full of drama and get incredibly stressful, but there are so many more good memories!&lt;/p&gt;\n\n&lt;p&gt;Too old to rush- I would say now, in my older 20&amp;#39;s, I would not fit in with the dynamic the same way an 18-22 year old would, but it&amp;#39;s really up to the individual!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdp1rt", "score_hidden": false, "stickied": false, "created": 1492474737.0, "created_utc": 1492445937.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdne8o", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "QuaereVerumm", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "My best experiences--I met so many people, both in and outside of my sorority. All kinds of people joined the frats and sororities at my school! I live in a different state now, but I can still keep in touch with my sisters. I realized stereotyping Greek life was pretty silly of me. \n\nWorst--lots of drama. \n\nI was 21 when I rushed because my sorority wasn't started until my junior year. Before that there were only 3 sororities at my school, and I wasn't very interested in any of them. There were some seniors who joined too, though I think they only joined because they were friends with the girls who started it. I don't think it's bad to join later, but you don't get as much time with the sorority and you're more focused on school and trying to graduate. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My best experiences--I met so many people, both in and outside of my sorority. All kinds of people joined the frats and sororities at my school! I live in a different state now, but I can still keep in touch with my sisters. I realized stereotyping Greek life was pretty silly of me. &lt;/p&gt;\n\n&lt;p&gt;Worst--lots of drama. &lt;/p&gt;\n\n&lt;p&gt;I was 21 when I rushed because my sorority wasn&amp;#39;t started until my junior year. Before that there were only 3 sororities at my school, and I wasn&amp;#39;t very interested in any of them. There were some seniors who joined too, though I think they only joined because they were friends with the girls who started it. I don&amp;#39;t think it&amp;#39;s bad to join later, but you don&amp;#39;t get as much time with the sorority and you&amp;#39;re more focused on school and trying to graduate. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdne8o", "score_hidden": false, "stickied": false, "created": 1492472853.0, "created_utc": 1492444053.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdsury", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "boatofnoodles", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Best: the events.  There are always fun things going on--philanthropic fundraising and volunteering, planning and participating in themed parties, taking weekend and break trips to super fun places with really great girls, networking professionally and socially with other chapters/sisters from many moons ago, etc.  There was always something amazing to participate in and it was always done with smart, fun girls with whom I grew immensely at a really crazy transitional period of my youg adult life.\n\nWorst: the events. It made participating in other activities and groups that piqued my interest and/or meant a lot to me really difficult, as we pretty much HAD to attend everything the sorority (and often our partner frat) organized, and then some.  It became too restrictive for me as I wanted to take on leadership roles in several other student organizations.  Ultimately, at the end of sophomore year, I decided that it would be best for me personally to leave to pursue other opportunities.  I retained a lot of great connections and friends made in my sorority, though, and do not at all regret spending the time in my early college career in it.\n\nI think most people who rushed in all of our on-campus sororities were freshmen, with a smattering of some sophomores and the occasional rare junior.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Best: the events.  There are always fun things going on--philanthropic fundraising and volunteering, planning and participating in themed parties, taking weekend and break trips to super fun places with really great girls, networking professionally and socially with other chapters/sisters from many moons ago, etc.  There was always something amazing to participate in and it was always done with smart, fun girls with whom I grew immensely at a really crazy transitional period of my youg adult life.&lt;/p&gt;\n\n&lt;p&gt;Worst: the events. It made participating in other activities and groups that piqued my interest and/or meant a lot to me really difficult, as we pretty much HAD to attend everything the sorority (and often our partner frat) organized, and then some.  It became too restrictive for me as I wanted to take on leadership roles in several other student organizations.  Ultimately, at the end of sophomore year, I decided that it would be best for me personally to leave to pursue other opportunities.  I retained a lot of great connections and friends made in my sorority, though, and do not at all regret spending the time in my early college career in it.&lt;/p&gt;\n\n&lt;p&gt;I think most people who rushed in all of our on-campus sororities were freshmen, with a smattering of some sophomores and the occasional rare junior.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdsury", "score_hidden": false, "stickied": false, "created": 1492478969.0, "created_utc": 1492450169.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdu9jj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "twopercentpls", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I was in a sorority for women in STEM.\n\nFor me, it was nice because my school had 47K students so it kind of narrowed down the pool of potential friends to people who I know had at least some common interests as me and made it less intimidating. I honestly met some of my best friends in the sorority, and it also really helped my grades? Being surrounded my motivated ladies all the time really pushed me to study more.\n\nWorst: Like with any big group of humans, there's drama and cliques. Also, we did a lot of stuff with frats and while most frats are fine some of them are creepy and that sucks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was in a sorority for women in STEM.&lt;/p&gt;\n\n&lt;p&gt;For me, it was nice because my school had 47K students so it kind of narrowed down the pool of potential friends to people who I know had at least some common interests as me and made it less intimidating. I honestly met some of my best friends in the sorority, and it also really helped my grades? Being surrounded my motivated ladies all the time really pushed me to study more.&lt;/p&gt;\n\n&lt;p&gt;Worst: Like with any big group of humans, there&amp;#39;s drama and cliques. Also, we did a lot of stuff with frats and while most frats are fine some of them are creepy and that sucks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdu9jj", "score_hidden": false, "stickied": false, "created": 1492480515.0, "created_utc": 1492451715.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dge15z5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "moomooyellow", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "I just got alumni status last year! At my school, most girls rush their freshman year, but it is very common for sophomores and sometimes juniors to rush. \n\nI would say my best experiences were meeting my best friends and also going to sorority functions. It was great to hang out with my pledge class and do pre games and fun activities together. Swaps with fraternities are so much fun and getting dressed up for formal with your sisters is awesome!\n\nThe only downside I experienced was them basically blackmailing their members to participate in rush activities and philanthropy events. If we didn't show up or we had an excuse and they didn't think it was a legitimate excuse then they would fine us $150 for missing half a day and $300 for a whole day. One year a girl had to miss our philanthropy event because her grandfather passed away and it was sudden. They still fined her because she didn't come back with a piece of paper saying she was at the funeral. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just got alumni status last year! At my school, most girls rush their freshman year, but it is very common for sophomores and sometimes juniors to rush. &lt;/p&gt;\n\n&lt;p&gt;I would say my best experiences were meeting my best friends and also going to sorority functions. It was great to hang out with my pledge class and do pre games and fun activities together. Swaps with fraternities are so much fun and getting dressed up for formal with your sisters is awesome!&lt;/p&gt;\n\n&lt;p&gt;The only downside I experienced was them basically blackmailing their members to participate in rush activities and philanthropy events. If we didn&amp;#39;t show up or we had an excuse and they didn&amp;#39;t think it was a legitimate excuse then they would fine us $150 for missing half a day and $300 for a whole day. One year a girl had to miss our philanthropy event because her grandfather passed away and it was sudden. They still fined her because she didn&amp;#39;t come back with a piece of paper saying she was at the funeral. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dge15z5", "score_hidden": true, "stickied": false, "created": 1492488296.0, "created_utc": 1492459496.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdxf7k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "isthiscleverr", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Best experiences: \n\n- During my recruitment (which was actually during an informal recruitment), there was one night with cupcake decorating (we're a small school). I was kinda bummed when I heard because I have celiac disease and wasn't sure how I'd politely bow out. Turns out, they'd gotten all gluten free cupcake mixes and baked them for us. It was the most touching thing! \n\n- Getting to serve on our school's Panhellenic council for two years. We even got to go to a few big conventions and workshops, etc. with our council. I learned so much about leadership and responsibility, and we got to work on uniting all of our Greek chapters on campus. It was an incredible experience. \n\n- I'm not a person who makes friends or gets super close to people very easily. I would say I have a lot of \"good friends\" who are more like acquaintances. But my sorority gave me two or three of my closest friends I've ever had. Besides being that close to someone, just not having to worry about where to sit in a class or in the caf was always a relief -- I'm naturally shy and introverted, but knowing that there were always people you could sit with was a big comfort during college. And even some of those \"good friends\" that were really only surface friends came through at very, very difficult times for me. \n\nWorst experiences:\n\n- Preparing for recruitment in general. Not that this was innately bad; I'm just not really a social person, and this was basically a month of late nights with 60 other girls, training to do small talk with 100 people going through Rush. Some girls absolutely *lived* for recruitment; I was never one of them. I was thankful that for 2 of the 3 years I was in a sorority, I was unaffiliated (being on Panhellenic at the time of recruitment) and didn't have to prep for recruitment. \n\n- I really hated the politics that could go on behind the scenes. In particular, my junior year, our presidential board of our group really bullied another good friend of mine because she used to date (super briefly) the boyfriend of one of the board chicks. It was ridiculous, and if it had just been perpetrated by petty college chicks, whatever; but one of our advisors was in on it, too, because she was super close to the board chick who was instigating it. Bullying anyone is bad anyway, but this friend was having a really hard time because she'd chosen to go through recruitment as an older student (a junior, I think) and none of them -- including my sorority -- picked her up. So it was just extra salt in the wound. \n\n- My senior year, I was on Panhellenic and unaffiliated for eight months (as opposed to the previous year, when I'd filled a vacancy left by someone suddenly leaving the council, so I was only unaffiliated for about 2 months). It was kind of hard separating myself even partially from my organization, and it really opened my eyes to some of the messed up politics going on behind the scenes. After our spring recruitment, I was affiliated again but really disillusioned. By graduation, I was ready to be rid of everyone and everything. \n\nThe Verdict:\n\n- Joining a sorority was absolutely one of the best decisions I've made in my life. If I had been at a large university, I probably wouldn't have -- in fact, I didn't my freshman year at my small school because I just loathed the idea of being in a sorority -- but my school and the environment we were all in made it a really enriching part of my college experience. Yes, there were some bad experiences, but there were so so so many great ones, too. I'm far enough out of college now for all those negative feelings I had upon graduation to be long gone, and I really appreciate the years I spent with my sisters. Joining my sorority helped me grow as a person, a student, a leader, a friend, and a woman. \n\nHow old is too old? I don't know that there's a limit, other than if you're several years older than all the other women going through recruitment, you just may not have much in common with them. And at a small school like mine, the longer you wait, the more of a \"reputation\" you can build for yourself -- for better or worse -- that can really haunt you when you're wanting to join an organization of 60 rather than 600 like some of the larger schools. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Best experiences: &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;During my recruitment (which was actually during an informal recruitment), there was one night with cupcake decorating (we&amp;#39;re a small school). I was kinda bummed when I heard because I have celiac disease and wasn&amp;#39;t sure how I&amp;#39;d politely bow out. Turns out, they&amp;#39;d gotten all gluten free cupcake mixes and baked them for us. It was the most touching thing! &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Getting to serve on our school&amp;#39;s Panhellenic council for two years. We even got to go to a few big conventions and workshops, etc. with our council. I learned so much about leadership and responsibility, and we got to work on uniting all of our Greek chapters on campus. It was an incredible experience. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I&amp;#39;m not a person who makes friends or gets super close to people very easily. I would say I have a lot of &amp;quot;good friends&amp;quot; who are more like acquaintances. But my sorority gave me two or three of my closest friends I&amp;#39;ve ever had. Besides being that close to someone, just not having to worry about where to sit in a class or in the caf was always a relief -- I&amp;#39;m naturally shy and introverted, but knowing that there were always people you could sit with was a big comfort during college. And even some of those &amp;quot;good friends&amp;quot; that were really only surface friends came through at very, very difficult times for me. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Worst experiences:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Preparing for recruitment in general. Not that this was innately bad; I&amp;#39;m just not really a social person, and this was basically a month of late nights with 60 other girls, training to do small talk with 100 people going through Rush. Some girls absolutely &lt;em&gt;lived&lt;/em&gt; for recruitment; I was never one of them. I was thankful that for 2 of the 3 years I was in a sorority, I was unaffiliated (being on Panhellenic at the time of recruitment) and didn&amp;#39;t have to prep for recruitment. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I really hated the politics that could go on behind the scenes. In particular, my junior year, our presidential board of our group really bullied another good friend of mine because she used to date (super briefly) the boyfriend of one of the board chicks. It was ridiculous, and if it had just been perpetrated by petty college chicks, whatever; but one of our advisors was in on it, too, because she was super close to the board chick who was instigating it. Bullying anyone is bad anyway, but this friend was having a really hard time because she&amp;#39;d chosen to go through recruitment as an older student (a junior, I think) and none of them -- including my sorority -- picked her up. So it was just extra salt in the wound. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;My senior year, I was on Panhellenic and unaffiliated for eight months (as opposed to the previous year, when I&amp;#39;d filled a vacancy left by someone suddenly leaving the council, so I was only unaffiliated for about 2 months). It was kind of hard separating myself even partially from my organization, and it really opened my eyes to some of the messed up politics going on behind the scenes. After our spring recruitment, I was affiliated again but really disillusioned. By graduation, I was ready to be rid of everyone and everything. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The Verdict:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Joining a sorority was absolutely one of the best decisions I&amp;#39;ve made in my life. If I had been at a large university, I probably wouldn&amp;#39;t have -- in fact, I didn&amp;#39;t my freshman year at my small school because I just loathed the idea of being in a sorority -- but my school and the environment we were all in made it a really enriching part of my college experience. Yes, there were some bad experiences, but there were so so so many great ones, too. I&amp;#39;m far enough out of college now for all those negative feelings I had upon graduation to be long gone, and I really appreciate the years I spent with my sisters. Joining my sorority helped me grow as a person, a student, a leader, a friend, and a woman. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;How old is too old? I don&amp;#39;t know that there&amp;#39;s a limit, other than if you&amp;#39;re several years older than all the other women going through recruitment, you just may not have much in common with them. And at a small school like mine, the longer you wait, the more of a &amp;quot;reputation&amp;quot; you can build for yourself -- for better or worse -- that can really haunt you when you&amp;#39;re wanting to join an organization of 60 rather than 600 like some of the larger schools. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdxf7k", "score_hidden": false, "stickied": false, "created": 1492484058.0, "created_utc": 1492455258.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdv7pc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "awhimpernotabang", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "My twins in a small sorority at a different school, but she seems to like it. It's great for having a social life and a support network, especially​ if you're studying in a new city. It does seem like A LOT of work, and a bit of drama surrounding elections. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My twins in a small sorority at a different school, but she seems to like it. It&amp;#39;s great for having a social life and a support network, especially​ if you&amp;#39;re studying in a new city. It does seem like A LOT of work, and a bit of drama surrounding elections. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdv7pc", "score_hidden": false, "stickied": false, "created": 1492481564.0, "created_utc": 1492452764.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdvzfl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jajajennifer", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "The best things for me have been having a support system and the leadership opportunities. Being in a sorority had not only led me to some of my best friends, but a whole group of women who share similar values and are always willing to grab a coffee or help you out, even if you don't see them everyday (we don't have a house). \n\nI've also become a lot more confident in myself as a leader. When I first came in, I wasn't involved in a lot and shied away from any sort of leadership. Luckily, my sorority saw potential in me early on, and I was able to serve on my exec board for 2 years and really grow into my own as a leader and see how my qualities could be useful in a leadership role.\n\nThe worst thing for me, by far, was actual rush week. When I rushed, I was super shy and not very good at small talk, so it took a huge toll on my self-esteem when I was only down to one sorority mid-week while most girls were going to 3 or 4. Obviously, things worked out well, though!\n\nAs far as age, I would say junior year (20-21) at the absolute latest. In my experience, rushing as early as possible maximizes your opportunity to really take advantage of everything the sorority has to offer and to build stronger relationships.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The best things for me have been having a support system and the leadership opportunities. Being in a sorority had not only led me to some of my best friends, but a whole group of women who share similar values and are always willing to grab a coffee or help you out, even if you don&amp;#39;t see them everyday (we don&amp;#39;t have a house). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve also become a lot more confident in myself as a leader. When I first came in, I wasn&amp;#39;t involved in a lot and shied away from any sort of leadership. Luckily, my sorority saw potential in me early on, and I was able to serve on my exec board for 2 years and really grow into my own as a leader and see how my qualities could be useful in a leadership role.&lt;/p&gt;\n\n&lt;p&gt;The worst thing for me, by far, was actual rush week. When I rushed, I was super shy and not very good at small talk, so it took a huge toll on my self-esteem when I was only down to one sorority mid-week while most girls were going to 3 or 4. Obviously, things worked out well, though!&lt;/p&gt;\n\n&lt;p&gt;As far as age, I would say junior year (20-21) at the absolute latest. In my experience, rushing as early as possible maximizes your opportunity to really take advantage of everything the sorority has to offer and to build stronger relationships.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdvzfl", "score_hidden": false, "stickied": false, "created": 1492482428.0, "created_utc": 1492453628.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdywp7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spiggy93", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Best - philanthropy and different events. We did a lot for St Jude and one of my most memorable experiences was visiting there. So it definitely gave me a lot of opportunity.\n\nWorst - It was very... clique-y. My sorority was 200+ people, so you couldn't expect to be close to everyone. But as we got older, it got less and less comfortable to walk up to certain groups because they were always with the same people. Also we had some requirements for attendance/etc. that just felt ridiculous at times.\n\nToo old? I'd say it depends on the school. I did as a sophomore and was a founding member of my sorority. But to go through rush, I would recommend not doing it after sophomore year. You lose a lot of opportunities to get closer to your pledge class (like living in our dorm corridor), etc. It could still be worth it after that, but you definitely lost a lot by doing it later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Best - philanthropy and different events. We did a lot for St Jude and one of my most memorable experiences was visiting there. So it definitely gave me a lot of opportunity.&lt;/p&gt;\n\n&lt;p&gt;Worst - It was very... clique-y. My sorority was 200+ people, so you couldn&amp;#39;t expect to be close to everyone. But as we got older, it got less and less comfortable to walk up to certain groups because they were always with the same people. Also we had some requirements for attendance/etc. that just felt ridiculous at times.&lt;/p&gt;\n\n&lt;p&gt;Too old? I&amp;#39;d say it depends on the school. I did as a sophomore and was a founding member of my sorority. But to go through rush, I would recommend not doing it after sophomore year. You lose a lot of opportunities to get closer to your pledge class (like living in our dorm corridor), etc. It could still be worth it after that, but you definitely lost a lot by doing it later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdywp7", "score_hidden": false, "stickied": false, "created": 1492485745.0, "created_utc": 1492456945.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dge7h5v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Narwhals4Lyf", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Current sister - \n\nGood - I love being a part of a community and leading a group of women and helping to (hopefully) guide them in a good direction. It is nice to know a lot of people on campus.\n\nBad - It is a time suck and sometimes I don't have enough time to be as involved as I would like to be in all aspects in life. \n\nIt is never too old! We had a girl join at 23 this semester :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Current sister - &lt;/p&gt;\n\n&lt;p&gt;Good - I love being a part of a community and leading a group of women and helping to (hopefully) guide them in a good direction. It is nice to know a lot of people on campus.&lt;/p&gt;\n\n&lt;p&gt;Bad - It is a time suck and sometimes I don&amp;#39;t have enough time to be as involved as I would like to be in all aspects in life. &lt;/p&gt;\n\n&lt;p&gt;It is never too old! We had a girl join at 23 this semester :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dge7h5v", "score_hidden": true, "stickied": false, "created": 1492495681.0, "created_utc": 1492466881.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dge8n87", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gabbythefck", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Best - for once in my life I was finally \"cool\" and part of the in-crowd.  I didn't fit in at all in HS, went to a public HS in the midwest, in the gifted program, I was just...super weird and crying out for attention.  I didn't get it from my parents because I had a shit childhood and I didn't get it from my peers because we just couldn't relate.  I was working full-time to help support my family - Dad, an out of work alcoholic, Mom had cancer.  On top of that I was taking 5 APs, president of two clubs, golf, traveling for debate every weekend, went to nationals in FBLA and debate, got myself into a program to travel to China for free... my classmates were excited about pep rallys, made fun of kids who took APs, wanted to stay in our hometown for the rest of their lives.  It really fucking sucked.  Not knocking them - we just had nothing in common, but I wanted to fit in so badly, and just couldn't.\n\nI got into a good private southern university on scholarship.  Didn't rush freshmen year, didn't understand greek life at all back then, made some friends in a particular sorority despite not rushing, realized how imperative the networking connections could be, rushed sophomore year, and got into the \"best\" sorority on campus.  Shit was like winning the lottery.  I still honestly have no idea how I got in - it was like 59 girls who were either super upper class from the northeast (NY, CT, MD) or old money southern blondes. Then there was me - first generation, daughter of a mechanic, not particularly attractive or girly.  They liked me and appreciated me because I was SMART, and that's all I'd ever wanted.\n\nWorst - I never really fit in.  I had my friends in the sorority, my maid of honor in my wedding three weeks ago was my sorority sister and we met through the sorority, as was one of my other bridesmaids, but a lot of the sorority shit on me behind my back.  They'd let me fix the damn projector no one could figure out how to use before meetings, be nice to my face, but I was never going to 100% fit in.  It hurt a lot.  But, I stayed involved a lot after I graduated and become membership chairman and rush adviser.  Made a TONNNNN of connections that were absolutely invaluable.  Ultimately, it got me in to law school.\n\nHow old is too old?  My sorority wont take girls after their sophomore year.  So, 20-21 is too old for them.  Honestly, I wouldn't rush if you were older, even if the organization you're targeting has different guidelines.  It's really catty, time intensive, and just...nothing I'd want to be a part of after I turned like 22.  However, alumnae life rocks and is way better than being an active in a lot of ways.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Best - for once in my life I was finally &amp;quot;cool&amp;quot; and part of the in-crowd.  I didn&amp;#39;t fit in at all in HS, went to a public HS in the midwest, in the gifted program, I was just...super weird and crying out for attention.  I didn&amp;#39;t get it from my parents because I had a shit childhood and I didn&amp;#39;t get it from my peers because we just couldn&amp;#39;t relate.  I was working full-time to help support my family - Dad, an out of work alcoholic, Mom had cancer.  On top of that I was taking 5 APs, president of two clubs, golf, traveling for debate every weekend, went to nationals in FBLA and debate, got myself into a program to travel to China for free... my classmates were excited about pep rallys, made fun of kids who took APs, wanted to stay in our hometown for the rest of their lives.  It really fucking sucked.  Not knocking them - we just had nothing in common, but I wanted to fit in so badly, and just couldn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;I got into a good private southern university on scholarship.  Didn&amp;#39;t rush freshmen year, didn&amp;#39;t understand greek life at all back then, made some friends in a particular sorority despite not rushing, realized how imperative the networking connections could be, rushed sophomore year, and got into the &amp;quot;best&amp;quot; sorority on campus.  Shit was like winning the lottery.  I still honestly have no idea how I got in - it was like 59 girls who were either super upper class from the northeast (NY, CT, MD) or old money southern blondes. Then there was me - first generation, daughter of a mechanic, not particularly attractive or girly.  They liked me and appreciated me because I was SMART, and that&amp;#39;s all I&amp;#39;d ever wanted.&lt;/p&gt;\n\n&lt;p&gt;Worst - I never really fit in.  I had my friends in the sorority, my maid of honor in my wedding three weeks ago was my sorority sister and we met through the sorority, as was one of my other bridesmaids, but a lot of the sorority shit on me behind my back.  They&amp;#39;d let me fix the damn projector no one could figure out how to use before meetings, be nice to my face, but I was never going to 100% fit in.  It hurt a lot.  But, I stayed involved a lot after I graduated and become membership chairman and rush adviser.  Made a TONNNNN of connections that were absolutely invaluable.  Ultimately, it got me in to law school.&lt;/p&gt;\n\n&lt;p&gt;How old is too old?  My sorority wont take girls after their sophomore year.  So, 20-21 is too old for them.  Honestly, I wouldn&amp;#39;t rush if you were older, even if the organization you&amp;#39;re targeting has different guidelines.  It&amp;#39;s really catty, time intensive, and just...nothing I&amp;#39;d want to be a part of after I turned like 22.  However, alumnae life rocks and is way better than being an active in a lot of ways.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dge8n87", "score_hidden": true, "stickied": false, "created": 1492497175.0, "created_utc": 1492468375.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdlvgk", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "shimmy_shimmy_ya", "parent_id": "t1_dgdizyw", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "Who cares what judgmental people think anyways.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Who cares what judgmental people think anyways.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdlvgk", "score_hidden": false, "stickied": false, "created": 1492471085.0, "created_utc": 1492442285.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdizyw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 1, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdizyw", "score_hidden": false, "stickied": false, "created": 1492467377.0, "created_utc": 1492438577.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rxrw", "removal_reason": null, "link_id": "t3_65vp17", "likes": null, "replies": "", "user_reports": [], "id": "dgdp633", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "TrynaGetThePipe", "parent_id": "t1_dgdnu43", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 1, "body": "I agree except I never specified gender. men who rush do it for similar reasons\n\nalso I would never call someone 'bimbo' ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree except I never specified gender. men who rush do it for similar reasons&lt;/p&gt;\n\n&lt;p&gt;also I would never call someone &amp;#39;bimbo&amp;#39; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdp633", "score_hidden": false, "stickied": false, "created": 1492474871.0, "created_utc": 1492446071.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnu43", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "shimmy_shimmy_ya", "parent_id": "t1_dgdniiq", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 1, "body": "&gt;I think women who join sororities are just doing it for the attention.  Prove me wrong, bimbos.\n\nThis is basically what you typed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I think women who join sororities are just doing it for the attention.  Prove me wrong, bimbos.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is basically what you typed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdnu43", "score_hidden": false, "stickied": false, "created": 1492473353.0, "created_utc": 1492444553.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdniiq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TrynaGetThePipe", "parent_id": "t1_dgdlxx5", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "just because I don't see the point of something doesn't mean I don't want to understand it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;just because I don&amp;#39;t see the point of something doesn&amp;#39;t mean I don&amp;#39;t want to understand it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdniiq", "score_hidden": false, "stickied": false, "created": 1492472989.0, "created_utc": 1492444189.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdlxx5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "shimmy_shimmy_ya", "parent_id": "t1_dgdip9a", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 1, "body": "&gt;I don't see much of a point of rushing\n\nThen don't rush.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t see much of a point of rushing&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Then don&amp;#39;t rush.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdlxx5", "score_hidden": false, "stickied": false, "created": 1492471167.0, "created_utc": 1492442367.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdip9a", "gilded": 0, "archived": false, "score": -7, "report_reasons": null, "author": "TrynaGetThePipe", "parent_id": "t3_65vp17", "subreddit_name_prefixed": "r/AskWomen", "controversiality": 0, "body": "interested to see what people who went to college pre-social media say, because I don't see much of a point of rushing besides boosting your likes and followers on insta", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;interested to see what people who went to college pre-social media say, because I don&amp;#39;t see much of a point of rushing besides boosting your likes and followers on insta&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskWomen", "name": "t1_dgdip9a", "score_hidden": false, "stickied": false, "created": 1492466972.0, "created_utc": 1492438172.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -7}}], "after": null, "before": null}}]