[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "audiophile", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h2&gt;&lt;a href=\"http://imgur.com/a/WkdPw\"&gt;Pictures are up&lt;/a&gt; and here is a look at the &lt;a href=\"http://imgur.com/a/1q2Rm\"&gt;JSON view of the exported data&lt;/a&gt;&lt;/h2&gt;\n\n&lt;hr/&gt;\n\n&lt;h2&gt;Click for the link to &lt;a href=\"https://play.google.com/store/apps/details?id=com.dmholdings.AudysseyMultEq&amp;amp;hl=en\"&gt;Android&lt;/a&gt; and &lt;a href=\"https://itunes.apple.com/us/app/audyssey-multeq-editor-app/id1210584625?mt=8\"&gt;Apple&lt;/a&gt;&lt;/h2&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;This was promised last year, and delayed, and delayed and delayed, but it has finally been released. It&amp;#39;s $20 on the Google play store, and compatible with Denon AV Receiver: AVR-X6300H, AVR-X4300H, AVR-X3300W, AVR-X2300W, AVR-X1300W, AVR-S920W, AVR-S720W, AVR-S930H, AVR-S730H\nMarantz AV Receiver: AV7703, SR7011, SR6011, SR5011, NR1607&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;How does it work? \nYou must re-calibrate your system at least 1 time. The app puts the receiver into calibration mode that differs from the built in one by having all the menus put up on the phone or tablet. At each step in the 7 calibration spots it downloads the results from the stereo to the app. Once the calibration is completed you have a profile on the phone, but it has not been applied to the stereo yet. When you are ready you can share that profile with others using Google drive, email, or any other transfer method. The saved files are in a JSON format and a .ady extension. You then upload the calibrated profile to the stereo through the app. It takes about 30 seconds to 2 minutes to transfer. At that point your stereo now has the profile. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;What can I do with it? \nYou can modify any of the calibration curves. It&amp;#39;s following a typical hifi reference curve with a roll off above 10khz and below 30hz. You get 3 parametric points you can place at any frequency and adjust up or down to change the over all curve. In practice the use I found for this is extending the rolloff in the bass regions to 20hz. This does not change the EQ of the speaker though. Instead it sets a goal in DB for that frequency. Lets say you have a speaker that naturally has -6db at 50hz. You set 50hz to +1db. In order to meet that, the DSP will apply 7db of boost, 6 to bring it to 0, and 1 more to bring it to +1. This means that the curve is VERY sensitive to changes. Even changing it by 1db has very noticeable results. Again, you are not modifying the EQ profile, you are modifying the target and it will meet that  target using considerable boosts or cuts. &lt;/p&gt;\n\n&lt;p&gt;You can also modify the mid cut which drops 1-5 to 3khz by about 1.5db to help with room coloration. You are able to select 2 high frequency curves with different rolloff rates. Each pair of speakers can have curves and other options set independently including the sub channel. This means you can increase a frequency in the sub, without affecting the main speakers or change the front without changing the rear or sub. &lt;/p&gt;\n\n&lt;p&gt;You are able to modify speaker levels and distances, change the speaker config, and have these changes rolled into the Audyssey profile instead of needing to manually change them in the speaker setup in the receiver menus. &lt;/p&gt;\n\n&lt;p&gt;You can copy and have multiple profiles using that first calibration, allowing you to quickly upload different profiles to the stereo. &lt;/p&gt;\n\n&lt;p&gt;You are able to exclude Audyssey from operating in certain frequency ranges. For instance say that you love the midrange on your speakers naturally. You can exclude the mids from Audyssey and it will correct everything BUT the mids. This is great for applying correction sparingly for you purists out there. If you just want to remove a bass resonance or a room resonance without modifying the rest of the speakers frequency response you are able to do this. &lt;/p&gt;\n\n&lt;p&gt;Once a calibration is saved you can also view the speaker frequency response as measured before and after. It is gratifying to see a huge 6db boost in my subwoofer get chopped flat from 20hz to 200hz. It really does make the response ruler flat. You can view the frequency chart of each speaker by itself. It&amp;#39;s interesting to see how flat your speaker is in your listening environment compared to it&amp;#39;s response measured in an anechoic chamber.  &lt;/p&gt;\n\n&lt;p&gt;Your calibrations can be saved on the phone, or in email, google drive etc. And you need never run through the speaker calibration setup again. If you need to make changes to the calibration after uploading, you simply change them and re-upload. No need to step through the lengthy microphone calibration again. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;That&amp;#39;s all really great, but tell us how it REALLY is to use it: &lt;/p&gt;\n\n&lt;p&gt;A pain. It is a pain sometimes. The software has crashed on me many times along with random communication errors, and errors requiring me to power cycle the amp and  close and restart the phone app several times. The full details are in &amp;quot;update 1&amp;quot; below. Once you get your profile loaded onto your stereo you shouldn&amp;#39;t need to change it that often. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Troubleshooting that worked for me:&lt;/p&gt;\n\n&lt;p&gt;If you run into trouble.......&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Communication errors mean power cycle your amp from the wall. If you still get them after power cycling it means the amp is still loading internally. Give it 60 seconds and try again. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;App hanging requires you to completely close out of the app, then re-launch it. I power cycled my phone at one point although I&amp;#39;m not sure if that was necessary &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If it sends the profile to your AVR but hangs at 100%, try the power cycling option. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Check the results and make sure none of your speakers shows 0 feet of distance or a flat frequency response  that doesn&amp;#39;t match the other speakers. IE an obvious &amp;quot;null&amp;quot; reading. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;hr/&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Update #1. Buggy as hell. The first calibration I did was almost flawless. I made it all the way to the end, uploaded it, and noticed speaker left showed 0 feet distance and the frequency response was a flat line. All the rest were fine. I uploaded it, checked the stereo and it was the same under &amp;quot;check results&amp;quot;. To be fair, this happened without the app once before and I corrected by re-doing. &lt;/p&gt;\n\n&lt;p&gt;So attempt #2 I went through it again, and this time I got normal results. I saved the profile and shared it on google drive which it makes very easy to do. However when I went to send it to my receiver I got app hangs, communication errors, and sometimes it would analyze the room information, get to 100% and hang there indefinitely. In the end I had to power cycle my receiver, as in unplug it from the wall, and power cycle my mobile. I still got the same errors but on the 4th or 5th try it finally sent correctly, albeit much slower than the first time. However, it got sent correctly, and is a valid configuration.&lt;/p&gt;\n\n&lt;p&gt;Options I changed were the target curve for front speakers and sub. I decreased the 10khz rolloff, and I decreased the 20hz subwoofer rolloff and actually added 3db of boost from 20hz to 40hz. &lt;/p&gt;\n\n&lt;p&gt;It basically lets you edit the reference curve independently for all channels and with 3 points. So it&amp;#39;s kind of like a 3 point parametric EQ where you get to decide  which frequency and how much to boost or cut. It allowed up to 20db which is insane. I added that 3db to 20-40hz and put on a dubstep track that almost made me trip over myself to turn it down. &lt;/p&gt;\n\n&lt;p&gt;So, it has some growing pains and could use some stability improvements. But it&amp;#39;s not something you will need to change ever again, and the amount of control it gives me over the correction I feel is worth it. You can also manually over ride any of the levels or speaker distances and it adds it to the audyssey profile (so you don&amp;#39;t have to manually mess with anything at all from the &amp;quot;manual speaker setup&amp;quot; in the amp) &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Update 2&lt;/em&gt; \nI realized that by changing the reference curve to increase 10-16khz treble response, it wasn&amp;#39;t slightly altering it, it was boosting those frequencies as much as needed to make the speaker play it at 0db, which considering the normal rolloff of most speakers was a LOT of boost. The treble was brittle if impressive. &lt;/p&gt;\n\n&lt;p&gt;So I decided to fix it. This is the cool bit after all the trouble I had yesterday. I open the app, I select my speaker calibration, edit, reference curve, front speaker, clear. Then upload to receiver, it crashed once. I reloaded, sent to receiver and it worked immediately and quickly. In less than 2 minutes I have corrected the audio and am listening to the much more relaxed presentation &lt;em&gt;without&lt;/em&gt; needing to completely step through the re-calibration process. &lt;/p&gt;\n\n&lt;p&gt;So doing things like removing mid cut, or changing your reference curve, is as easy as a few finger taps, then hitting upload. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[Pictures are up](http://imgur.com/a/WkdPw) and here is a look at the [JSON view of the exported data](http://imgur.com/a/1q2Rm)\n-----------------\n------\n\nClick for the link to [Android](https://play.google.com/store/apps/details?id=com.dmholdings.AudysseyMultEq&amp;hl=en) and [Apple](https://itunes.apple.com/us/app/audyssey-multeq-editor-app/id1210584625?mt=8)\n-----------------\n------\n\nThis was promised last year, and delayed, and delayed and delayed, but it has finally been released. It's $20 on the Google play store, and compatible with Denon AV Receiver: AVR-X6300H, AVR-X4300H, AVR-X3300W, AVR-X2300W, AVR-X1300W, AVR-S920W, AVR-S720W, AVR-S930H, AVR-S730H\nMarantz AV Receiver: AV7703, SR7011, SR6011, SR5011, NR1607\n\n-----------------\n------\n\nHow does it work? \nYou must re-calibrate your system at least 1 time. The app puts the receiver into calibration mode that differs from the built in one by having all the menus put up on the phone or tablet. At each step in the 7 calibration spots it downloads the results from the stereo to the app. Once the calibration is completed you have a profile on the phone, but it has not been applied to the stereo yet. When you are ready you can share that profile with others using Google drive, email, or any other transfer method. The saved files are in a JSON format and a .ady extension. You then upload the calibrated profile to the stereo through the app. It takes about 30 seconds to 2 minutes to transfer. At that point your stereo now has the profile. \n\n-----------------\n------\n\nWhat can I do with it? \nYou can modify any of the calibration curves. It's following a typical hifi reference curve with a roll off above 10khz and below 30hz. You get 3 parametric points you can place at any frequency and adjust up or down to change the over all curve. In practice the use I found for this is extending the rolloff in the bass regions to 20hz. This does not change the EQ of the speaker though. Instead it sets a goal in DB for that frequency. Lets say you have a speaker that naturally has -6db at 50hz. You set 50hz to +1db. In order to meet that, the DSP will apply 7db of boost, 6 to bring it to 0, and 1 more to bring it to +1. This means that the curve is VERY sensitive to changes. Even changing it by 1db has very noticeable results. Again, you are not modifying the EQ profile, you are modifying the target and it will meet that  target using considerable boosts or cuts. \n\nYou can also modify the mid cut which drops 1-5 to 3khz by about 1.5db to help with room coloration. You are able to select 2 high frequency curves with different rolloff rates. Each pair of speakers can have curves and other options set independently including the sub channel. This means you can increase a frequency in the sub, without affecting the main speakers or change the front without changing the rear or sub. \n\nYou are able to modify speaker levels and distances, change the speaker config, and have these changes rolled into the Audyssey profile instead of needing to manually change them in the speaker setup in the receiver menus. \n\nYou can copy and have multiple profiles using that first calibration, allowing you to quickly upload different profiles to the stereo. \n\nYou are able to exclude Audyssey from operating in certain frequency ranges. For instance say that you love the midrange on your speakers naturally. You can exclude the mids from Audyssey and it will correct everything BUT the mids. This is great for applying correction sparingly for you purists out there. If you just want to remove a bass resonance or a room resonance without modifying the rest of the speakers frequency response you are able to do this. \n\nOnce a calibration is saved you can also view the speaker frequency response as measured before and after. It is gratifying to see a huge 6db boost in my subwoofer get chopped flat from 20hz to 200hz. It really does make the response ruler flat. You can view the frequency chart of each speaker by itself. It's interesting to see how flat your speaker is in your listening environment compared to it's response measured in an anechoic chamber.  \n\nYour calibrations can be saved on the phone, or in email, google drive etc. And you need never run through the speaker calibration setup again. If you need to make changes to the calibration after uploading, you simply change them and re-upload. No need to step through the lengthy microphone calibration again. \n\n-----------------\n------\n\nThat's all really great, but tell us how it REALLY is to use it: \n\nA pain. It is a pain sometimes. The software has crashed on me many times along with random communication errors, and errors requiring me to power cycle the amp and  close and restart the phone app several times. The full details are in \"update 1\" below. Once you get your profile loaded onto your stereo you shouldn't need to change it that often. \n\n-----------------\n------\n\nTroubleshooting that worked for me:\n\nIf you run into trouble.......\n\n1. Communication errors mean power cycle your amp from the wall. If you still get them after power cycling it means the amp is still loading internally. Give it 60 seconds and try again. \n\n2. App hanging requires you to completely close out of the app, then re-launch it. I power cycled my phone at one point although I'm not sure if that was necessary \n\n3. If it sends the profile to your AVR but hangs at 100%, try the power cycling option. \n\n4. Check the results and make sure none of your speakers shows 0 feet of distance or a flat frequency response  that doesn't match the other speakers. IE an obvious \"null\" reading. \n\n-----------------\n------\n\nUpdate #1. Buggy as hell. The first calibration I did was almost flawless. I made it all the way to the end, uploaded it, and noticed speaker left showed 0 feet distance and the frequency response was a flat line. All the rest were fine. I uploaded it, checked the stereo and it was the same under \"check results\". To be fair, this happened without the app once before and I corrected by re-doing. \n\nSo attempt #2 I went through it again, and this time I got normal results. I saved the profile and shared it on google drive which it makes very easy to do. However when I went to send it to my receiver I got app hangs, communication errors, and sometimes it would analyze the room information, get to 100% and hang there indefinitely. In the end I had to power cycle my receiver, as in unplug it from the wall, and power cycle my mobile. I still got the same errors but on the 4th or 5th try it finally sent correctly, albeit much slower than the first time. However, it got sent correctly, and is a valid configuration.\n\nOptions I changed were the target curve for front speakers and sub. I decreased the 10khz rolloff, and I decreased the 20hz subwoofer rolloff and actually added 3db of boost from 20hz to 40hz. \n\nIt basically lets you edit the reference curve independently for all channels and with 3 points. So it's kind of like a 3 point parametric EQ where you get to decide  which frequency and how much to boost or cut. It allowed up to 20db which is insane. I added that 3db to 20-40hz and put on a dubstep track that almost made me trip over myself to turn it down. \n\nSo, it has some growing pains and could use some stability improvements. But it's not something you will need to change ever again, and the amount of control it gives me over the correction I feel is worth it. You can also manually over ride any of the levels or speaker distances and it adds it to the audyssey profile (so you don't have to manually mess with anything at all from the \"manual speaker setup\" in the amp) \n\n\n*Update 2* \nI realized that by changing the reference curve to increase 10-16khz treble response, it wasn't slightly altering it, it was boosting those frequencies as much as needed to make the speaker play it at 0db, which considering the normal rolloff of most speakers was a LOT of boost. The treble was brittle if impressive. \n\nSo I decided to fix it. This is the cool bit after all the trouble I had yesterday. I open the app, I select my speaker calibration, edit, reference curve, front speaker, clear. Then upload to receiver, it crashed once. I reloaded, sent to receiver and it worked immediately and quickly. In less than 2 minutes I have corrected the audio and am listening to the much more relaxed presentation *without* needing to completely step through the re-calibration process. \n\nSo doing things like removing mid cut, or changing your reference curve, is as easy as a few finger taps, then hitting upload. \n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Discussion", "id": "651cnh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "kodack10", "saved": false, "mod_reports": [], "name": "t3_651cnh", "subreddit_name_prefixed": "r/audiophile", "approved_by": null, "over_18": false, "domain": "self.audiophile", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/4b5JfWxzQrpZygM9ne7ElHQ9mECzMAPisU_l2qDzXpE.jpg?s=3ab316723c66bd43cec2f5288d442e5e", "width": 1920, "height": 1080}, "resolutions": [{"url": "https://i.redditmedia.com/4b5JfWxzQrpZygM9ne7ElHQ9mECzMAPisU_l2qDzXpE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=ea98d644d812cc27486cbbe138c2bc59", "width": 108, "height": 60}, {"url": "https://i.redditmedia.com/4b5JfWxzQrpZygM9ne7ElHQ9mECzMAPisU_l2qDzXpE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=c298d1af3faa18df013f21423efb5c13", "width": 216, "height": 121}, {"url": "https://i.redditmedia.com/4b5JfWxzQrpZygM9ne7ElHQ9mECzMAPisU_l2qDzXpE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=0a09980ec1d7dcbbf8bd23c3c2497e8b", "width": 320, "height": 180}, {"url": "https://i.redditmedia.com/4b5JfWxzQrpZygM9ne7ElHQ9mECzMAPisU_l2qDzXpE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=bac06f41c31ecbd416f690627978e24f", "width": 640, "height": 360}, {"url": "https://i.redditmedia.com/4b5JfWxzQrpZygM9ne7ElHQ9mECzMAPisU_l2qDzXpE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=591833dc88640da26f006788bb9565c8", "width": 960, "height": 540}, {"url": "https://i.redditmedia.com/4b5JfWxzQrpZygM9ne7ElHQ9mECzMAPisU_l2qDzXpE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=a9a5328114120e06587f83998ed2e93d", "width": 1080, "height": 607}], "variants": {}, "id": "S16-3RgxPWrk0sU-_UTqHewBLei5kKzEzTSG3slpz2o"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2qmiy", "edited": 1492155471.0, "link_flair_css_class": "orange", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/audiophile/comments/651cnh/the_denon_and_marantz_audyssey_dsp_app_has/", "num_reports": null, "locked": false, "stickied": false, "created": 1492063306.0, "url": "https://www.reddit.com/r/audiophile/comments/651cnh/the_denon_and_marantz_audyssey_dsp_app_has/", "author_flair_text": null, "quarantine": false, "title": "The Denon and Marantz Audyssey DSP app has finally launched for Iphone and Android", "created_utc": 1492034506.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmiy", "removal_reason": null, "link_id": "t3_651cnh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmiy", "removal_reason": null, "link_id": "t3_651cnh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmiy", "removal_reason": null, "link_id": "t3_651cnh", "likes": null, "replies": "", "user_reports": [], "id": "dg78332", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kodack10", "parent_id": "t1_dg77v62", "subreddit_name_prefixed": "r/audiophile", "controversiality": 0, "body": "You're right. I loaded it up in a json viewer and formatted perfectly. Check it http://imgur.com/a/1q2Rm\n\nThat could actually be problematic as I have some experience with JSON in a logging format, and I know that many log parsers have a maximum record size that is a lot less than 9MB. I've actually run into issues with Amazon's S3 bucket for instance where they sent large events as a single syslog event, which overloaded the daemon that writes them to disk. And as I wrote that firefox hung on the json website lol. ", "edited": 1492064540.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right. I loaded it up in a json viewer and formatted perfectly. Check it &lt;a href=\"http://imgur.com/a/1q2Rm\"&gt;http://imgur.com/a/1q2Rm&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;That could actually be problematic as I have some experience with JSON in a logging format, and I know that many log parsers have a maximum record size that is a lot less than 9MB. I&amp;#39;ve actually run into issues with Amazon&amp;#39;s S3 bucket for instance where they sent large events as a single syslog event, which overloaded the daemon that writes them to disk. And as I wrote that firefox hung on the json website lol. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "audiophile", "name": "t1_dg78332", "score_hidden": false, "stickied": false, "created": 1492092013.0, "created_utc": 1492063213.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg77v62", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DjSall", "parent_id": "t1_dg75dis", "subreddit_name_prefixed": "r/audiophile", "controversiality": 0, "body": "looks like JSON data", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;looks like JSON data&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "audiophile", "name": "t1_dg77v62", "score_hidden": false, "stickied": false, "created": 1492091518.0, "created_utc": 1492062718.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg75dis", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kodack10", "parent_id": "t3_651cnh", "subreddit_name_prefixed": "r/audiophile", "controversiality": 0, "body": "This is an example of the file output format. It's saved as a .ady file and looks like you can edit it in any text editor as it's a CSV file. DJSall correctly identified it as JSON data and sure enough it loads up in any json viewer. [JSON viewer shows a much better view ](http://imgur.com/a/1q2Rm)", "edited": 1492153635.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is an example of the file output format. It&amp;#39;s saved as a .ady file and looks like you can edit it in any text editor as it&amp;#39;s a CSV file. DJSall correctly identified it as JSON data and sure enough it loads up in any json viewer. &lt;a href=\"http://imgur.com/a/1q2Rm\"&gt;JSON viewer shows a much better view &lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "audiophile", "name": "t1_dg75dis", "score_hidden": false, "stickied": false, "created": 1492086878.0, "created_utc": 1492058078.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmiy", "removal_reason": null, "link_id": "t3_651cnh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmiy", "removal_reason": null, "link_id": "t3_651cnh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmiy", "removal_reason": null, "link_id": "t3_651cnh", "likes": null, "replies": "", "user_reports": [], "id": "dg8nifv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hydro123456", "parent_id": "t1_dg8n7qi", "subreddit_name_prefixed": "r/audiophile", "controversiality": 0, "body": "Yeah, when I first heard about it I was super excited. Then I checked the supported models and was super disappointed, then I thought about my experiences with the Denon software I've used, and I thought, meh. I hope it works out though, I'd love to play around with it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, when I first heard about it I was super excited. Then I checked the supported models and was super disappointed, then I thought about my experiences with the Denon software I&amp;#39;ve used, and I thought, meh. I hope it works out though, I&amp;#39;d love to play around with it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "audiophile", "name": "t1_dg8nifv", "score_hidden": false, "stickied": false, "created": 1492166934.0, "created_utc": 1492138134.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8n7qi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kodack10", "parent_id": "t1_dg8mgad", "subreddit_name_prefixed": "r/audiophile", "controversiality": 0, "body": "I have to say though, now that my changes are in, I'm in audio heaven. Listening to a track with a good bass line mixed with good dynamics like FKA Twigs \"Water me\" is like sitting in front of the voice of a god. I think the reference curve I used for treble is a little too high though. It occurs to me on reflection that it's not an EQ setting, because it isn't changing an EQ, it's changing the calibration point for that speaker. So if you say \"I want 1db of boost from 10khz to 16khz, it will give you 1db, above 0db......meaning like most speakers there is a roll off from 10khz up, so to hit +1db it has seriously boosted those frequencies and the effect is super sonics like a shattering wine glass. Biting, but so good. But it does need to be rolled back. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have to say though, now that my changes are in, I&amp;#39;m in audio heaven. Listening to a track with a good bass line mixed with good dynamics like FKA Twigs &amp;quot;Water me&amp;quot; is like sitting in front of the voice of a god. I think the reference curve I used for treble is a little too high though. It occurs to me on reflection that it&amp;#39;s not an EQ setting, because it isn&amp;#39;t changing an EQ, it&amp;#39;s changing the calibration point for that speaker. So if you say &amp;quot;I want 1db of boost from 10khz to 16khz, it will give you 1db, above 0db......meaning like most speakers there is a roll off from 10khz up, so to hit +1db it has seriously boosted those frequencies and the effect is super sonics like a shattering wine glass. Biting, but so good. But it does need to be rolled back. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "audiophile", "name": "t1_dg8n7qi", "score_hidden": false, "stickied": false, "created": 1492166505.0, "created_utc": 1492137705.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mgad", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hydro123456", "parent_id": "t3_651cnh", "subreddit_name_prefixed": "r/audiophile", "controversiality": 0, "body": "I figured it would be a buggy mess. I like their hardware for the most part, but I've had nothing but trouble with their software. They're remote app is garbage, and their streaming and app capabilities are junk.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I figured it would be a buggy mess. I like their hardware for the most part, but I&amp;#39;ve had nothing but trouble with their software. They&amp;#39;re remote app is garbage, and their streaming and app capabilities are junk.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "audiophile", "name": "t1_dg8mgad", "score_hidden": false, "stickied": false, "created": 1492165399.0, "created_utc": 1492136599.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmiy", "removal_reason": null, "link_id": "t3_651cnh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmiy", "removal_reason": null, "link_id": "t3_651cnh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmiy", "removal_reason": null, "link_id": "t3_651cnh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmiy", "removal_reason": null, "link_id": "t3_651cnh", "likes": null, "replies": "", "user_reports": [], "id": "dg87mwv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Heheheheha", "parent_id": "t1_dg6qy6v", "subreddit_name_prefixed": "r/audiophile", "controversiality": 0, "body": "You were downvoted by a Roon lifetime purchaser apparently...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You were downvoted by a Roon lifetime purchaser apparently...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "audiophile", "name": "t1_dg87mwv", "score_hidden": false, "stickied": false, "created": 1492145754.0, "created_utc": 1492116954.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmiy", "removal_reason": null, "link_id": "t3_651cnh", "likes": null, "replies": "", "user_reports": [], "id": "dg90eu9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Shike", "parent_id": "t1_dg6qy6v", "subreddit_name_prefixed": "r/audiophile", "controversiality": 0, "body": "You're not wrong, but the installer kit alone without someone to use it was $500.  In comparison hiring an installer to come out would be cheaper.\n\nI don't care either way regardless, my Pre-Pro isn't on the supported list and my DIY sounds a lot better - especially after I made some final adjustments to how I do my target (no longer follow the HK curve directly, but abstracted key points).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re not wrong, but the installer kit alone without someone to use it was $500.  In comparison hiring an installer to come out would be cheaper.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t care either way regardless, my Pre-Pro isn&amp;#39;t on the supported list and my DIY sounds a lot better - especially after I made some final adjustments to how I do my target (no longer follow the HK curve directly, but abstracted key points).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "audiophile", "name": "t1_dg90eu9", "score_hidden": false, "stickied": false, "created": 1492196852.0, "created_utc": 1492168052.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6qy6v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Arve", "parent_id": "t1_dg6pvfe", "subreddit_name_prefixed": "r/audiophile", "controversiality": 1, "body": "That's still utter bullshit. \n\nIf you hire a professional installer, it's because you need the knowledge of someone external, or you want to pay someone so you don't have to spend any time on installing. \n\nWith this, you're getting neither. You're paying an extra $20 on top of your hardware purchase to access a built-in feature through a slightly more convenient means.  \n\nIt ranks slightly below snake oil and Roon on the audiophile extortion scale, and is deplorable for even making it on to that list. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s still utter bullshit. &lt;/p&gt;\n\n&lt;p&gt;If you hire a professional installer, it&amp;#39;s because you need the knowledge of someone external, or you want to pay someone so you don&amp;#39;t have to spend any time on installing. &lt;/p&gt;\n\n&lt;p&gt;With this, you&amp;#39;re getting neither. You&amp;#39;re paying an extra $20 on top of your hardware purchase to access a built-in feature through a slightly more convenient means.  &lt;/p&gt;\n\n&lt;p&gt;It ranks slightly below snake oil and Roon on the audiophile extortion scale, and is deplorable for even making it on to that list. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "audiophile", "name": "t1_dg6qy6v", "score_hidden": false, "stickied": false, "created": 1492068130.0, "created_utc": 1492039330.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pvfe", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kodack10", "parent_id": "t1_dg6p5m9", "subreddit_name_prefixed": "r/audiophile", "controversiality": 0, "body": "I think the idea is that it will replace the \"professional installer\" kit that was sold for custom installs. That kit was considerably more than $20 and was harder to obtain so I'm okay with paying for it. I just hope it's stable. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the idea is that it will replace the &amp;quot;professional installer&amp;quot; kit that was sold for custom installs. That kit was considerably more than $20 and was harder to obtain so I&amp;#39;m okay with paying for it. I just hope it&amp;#39;s stable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "audiophile", "name": "t1_dg6pvfe", "score_hidden": false, "stickied": false, "created": 1492066780.0, "created_utc": 1492037980.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6p5m9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bigsoftier", "parent_id": "t3_651cnh", "subreddit_name_prefixed": "r/audiophile", "controversiality": 0, "body": "why is this not free? It's only an external config app, most manufacturers give this kinda app free... 20 bucks!... I'll pass.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;why is this not free? It&amp;#39;s only an external config app, most manufacturers give this kinda app free... 20 bucks!... I&amp;#39;ll pass.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "audiophile", "name": "t1_dg6p5m9", "score_hidden": false, "stickied": false, "created": 1492065895.0, "created_utc": 1492037095.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]