[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "audiophile", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi everyone,&lt;/p&gt;\n\n&lt;p&gt;I want to start by saying I definitely don&amp;#39;t consider myself an audiophile, and I definitely don&amp;#39;t have the equipment to begin to place me in that category, but I do have a few questions so here I go:&lt;/p&gt;\n\n&lt;p&gt;I have an old Yamaha RX-530 receiver powering two 50W ceiling speakers of non-description (I wasn&amp;#39;t around when they were installed). To my ears, the speakers themselves sound great – I was assured they were reasonably expensive (more so than the outside ceiling speakers), and I&amp;#39;ve been generally satisfied by the stereo separation, instrument separation, crispness and bass.&lt;/p&gt;\n\n&lt;p&gt;I wanted to add some sound to other joining rooms, so I connected via AirPlay an oldish Panasonic SC-PM91D. Not necessarily good systems, I&amp;#39;m aware.&lt;/p&gt;\n\n&lt;p&gt;Together, (the rooms are somewhat joined), it&amp;#39;s a bit of a loud mess. The Panasonic system is very &amp;#39;punchy&amp;#39; if that makes sense. It&amp;#39;s like the bass punctuates the music, and I don&amp;#39;t like that. It doesn&amp;#39;t pair well with the ceiling speakers that seem to provide a more powerful, surrounding sound. The Panasonic shelf speakers sound like a narrower spout of sound – all from one direction, with an artificially enhanced separation.&lt;/p&gt;\n\n&lt;p&gt;I want to know how to fix that. I don&amp;#39;t always like speakers with a high &lt;em&gt;wow&lt;/em&gt; factor and loudness, as it can sound a bit artificial. Whereas my other speakers are more balanced at every level. There&amp;#39;s also the throw issue – where it just seems to carry, even when it&amp;#39;s not actually turned up loud. My brother seems to notice this too.&lt;/p&gt;\n\n&lt;p&gt;For technical reasons, the speakers in ceiling are wired, and sent over unsuitably long 3.5mm (10 meters?) and the Panasonic, AirPlay.&lt;/p&gt;\n\n&lt;p&gt;Anyway, how can I get things to sound &lt;em&gt;better&lt;/em&gt;? Neither system works well together, except when both played very loud where it makes a great house party – not very good for a dining room table setting. Can I do something to soften punchiness? Make the systems sound better together (they&amp;#39;re not matched in sound-style)? &lt;/p&gt;\n\n&lt;p&gt;Can things be done to make speakers more volume level independent? I.e. not needing to be loud to sound &lt;em&gt;good&lt;/em&gt;, or always sounding &amp;#39;loud&amp;#39; or &amp;#39;wowish&amp;#39;? &lt;/p&gt;\n\n&lt;p&gt;What are these properties called? What does an audiophile look for when describing sound?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi everyone,\n\nI want to start by saying I definitely don't consider myself an audiophile, and I definitely don't have the equipment to begin to place me in that category, but I do have a few questions so here I go:\n\nI have an old Yamaha RX-530 receiver powering two 50W ceiling speakers of non-description (I wasn't around when they were installed). To my ears, the speakers themselves sound great – I was assured they were reasonably expensive (more so than the outside ceiling speakers), and I've been generally satisfied by the stereo separation, instrument separation, crispness and bass.\n\nI wanted to add some sound to other joining rooms, so I connected via AirPlay an oldish Panasonic SC-PM91D. Not necessarily good systems, I'm aware.\n\nTogether, (the rooms are somewhat joined), it's a bit of a loud mess. The Panasonic system is very 'punchy' if that makes sense. It's like the bass punctuates the music, and I don't like that. It doesn't pair well with the ceiling speakers that seem to provide a more powerful, surrounding sound. The Panasonic shelf speakers sound like a narrower spout of sound – all from one direction, with an artificially enhanced separation.\n\nI want to know how to fix that. I don't always like speakers with a high *wow* factor and loudness, as it can sound a bit artificial. Whereas my other speakers are more balanced at every level. There's also the throw issue – where it just seems to carry, even when it's not actually turned up loud. My brother seems to notice this too.\n\nFor technical reasons, the speakers in ceiling are wired, and sent over unsuitably long 3.5mm (10 meters?) and the Panasonic, AirPlay.\n\nAnyway, how can I get things to sound *better*? Neither system works well together, except when both played very loud where it makes a great house party – not very good for a dining room table setting. Can I do something to soften punchiness? Make the systems sound better together (they're not matched in sound-style)? \n\nCan things be done to make speakers more volume level independent? I.e. not needing to be loud to sound *good*, or always sounding 'loud' or 'wowish'? \n\nWhat are these properties called? What does an audiophile look for when describing sound?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "660okj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "mildlycustard", "saved": false, "mod_reports": [], "name": "t3_660okj", "subreddit_name_prefixed": "r/audiophile", "approved_by": null, "over_18": false, "domain": "self.audiophile", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmiy", "edited": 1492490137.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/audiophile/comments/660okj/audio_properties_for_a_beginner_and_matching_home/", "num_reports": null, "locked": false, "stickied": false, "created": 1492518005.0, "url": "https://www.reddit.com/r/audiophile/comments/660okj/audio_properties_for_a_beginner_and_matching_home/", "author_flair_text": null, "quarantine": false, "title": "Audio Properties for a Beginner and matching home speakers", "created_utc": 1492489205.0, "distinguished": null, "media": null, "upvote_ratio": 0.33, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]