[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "stocks", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Posted this to &lt;a href=\"/r/investing\"&gt;r/investing&lt;/a&gt; in a discussion thread, but haven&amp;#39;t got much. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 17, and I&amp;#39;m looking for a handful of stocks to invest in long term; over 20 years. I want to invest in them not only to make money, but just to see the effects of long term investing, compared to short term investing. I know a decent amount about the market, and will be studying economics in university. I understand that I will need someone older than 18 to set up an account, so no need to remind me. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just looking for people&amp;#39;s opinions on the long term growth of 5 stocks. I&amp;#39;m not looking for a particular return, however, I&amp;#39;d like stocks that would not only provide decent long term growth, but also have the potential to have short term (5 years or less) growth, in the instance where I&amp;#39;d have to pull out early. Further, if the price of a stock goes up, however it is still apart of my portfolio (I don&amp;#39;t sell it) would I be taxed on its &amp;quot;potential return&amp;quot;; I&amp;#39;m in Canada. &lt;/p&gt;\n\n&lt;p&gt;I understand that asking Reddit is probably not the best place to ask this type of question, but I&amp;#39;m just looking for a start, several people&amp;#39;s opinions, and will eventually get to conducting my own research. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Posted this to r/investing in a discussion thread, but haven't got much. \n\nI'm 17, and I'm looking for a handful of stocks to invest in long term; over 20 years. I want to invest in them not only to make money, but just to see the effects of long term investing, compared to short term investing. I know a decent amount about the market, and will be studying economics in university. I understand that I will need someone older than 18 to set up an account, so no need to remind me. \n\nI'm just looking for people's opinions on the long term growth of 5 stocks. I'm not looking for a particular return, however, I'd like stocks that would not only provide decent long term growth, but also have the potential to have short term (5 years or less) growth, in the instance where I'd have to pull out early. Further, if the price of a stock goes up, however it is still apart of my portfolio (I don't sell it) would I be taxed on its \"potential return\"; I'm in Canada. \n\nI understand that asking Reddit is probably not the best place to ask this type of question, but I'm just looking for a start, several people's opinions, and will eventually get to conducting my own research. \n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65yy53", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "Santo_R", "saved": false, "mod_reports": [], "name": "t3_65yy53", "subreddit_name_prefixed": "r/stocks", "approved_by": null, "over_18": false, "domain": "self.stocks", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjfk", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/stocks/comments/65yy53/long_term_investing/", "num_reports": null, "locked": false, "stickied": false, "created": 1492497881.0, "url": "https://www.reddit.com/r/stocks/comments/65yy53/long_term_investing/", "author_flair_text": null, "quarantine": false, "title": "Long term investing", "created_utc": 1492469081.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjfk", "removal_reason": null, "link_id": "t3_65yy53", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjfk", "removal_reason": null, "link_id": "t3_65yy53", "likes": null, "replies": "", "user_reports": [], "id": "dgegc3p", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Santo_R", "parent_id": "t1_dgedslp", "subreddit_name_prefixed": "r/stocks", "controversiality": 0, "body": "Ok then, that way, do I go index or S&amp;P?? And then can you buy those or any index like you would a stock? \nAlso, can I hold indexes indefinitely, or am I forced to sell/re-work at a loss after a given period (like a managed portfolio)? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok then, that way, do I go index or S&amp;amp;P?? And then can you buy those or any index like you would a stock? \nAlso, can I hold indexes indefinitely, or am I forced to sell/re-work at a loss after a given period (like a managed portfolio)? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "stocks", "name": "t1_dgegc3p", "score_hidden": false, "stickied": false, "created": 1492506999.0, "created_utc": 1492478199.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgedslp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Kuwong", "parent_id": "t3_65yy53", "subreddit_name_prefixed": "r/stocks", "controversiality": 0, "body": "You're getting into economics next year? I'll tell you what to do, throw 80% into a low expense ratio total market ETF (VTI, SCHB, Fidelity). Save that 20% for whatever long term stocks you'll be doing DD on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re getting into economics next year? I&amp;#39;ll tell you what to do, throw 80% into a low expense ratio total market ETF (VTI, SCHB, Fidelity). Save that 20% for whatever long term stocks you&amp;#39;ll be doing DD on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "stocks", "name": "t1_dgedslp", "score_hidden": false, "stickied": false, "created": 1492503850.0, "created_utc": 1492475050.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjfk", "removal_reason": null, "link_id": "t3_65yy53", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjfk", "removal_reason": null, "link_id": "t3_65yy53", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjfk", "removal_reason": null, "link_id": "t3_65yy53", "likes": null, "replies": "", "user_reports": [], "id": "dgenm2f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cyrilix", "parent_id": "t1_dgefmh7", "subreddit_name_prefixed": "r/stocks", "controversiality": 0, "body": "I can direct your attention to a diversified utility such as BIP. It has had quite a bit of a run up in the last few months, but it's a great company if you can get it at a good price. In the tech/e-commerce space, I like SHOP and am a long term holder. The price is kind of high though, and am looking for a better entry point. Entering at this price is a little risky. In the transports sector, I like CNI, a very efficiently run railway with a huge moat.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can direct your attention to a diversified utility such as BIP. It has had quite a bit of a run up in the last few months, but it&amp;#39;s a great company if you can get it at a good price. In the tech/e-commerce space, I like SHOP and am a long term holder. The price is kind of high though, and am looking for a better entry point. Entering at this price is a little risky. In the transports sector, I like CNI, a very efficiently run railway with a huge moat.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "stocks", "name": "t1_dgenm2f", "score_hidden": false, "stickied": false, "created": 1492516151.0, "created_utc": 1492487351.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjfk", "removal_reason": null, "link_id": "t3_65yy53", "likes": null, "replies": "", "user_reports": [], "id": "dgf0jow", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Zman14q", "parent_id": "t1_dgefmh7", "subreddit_name_prefixed": "r/stocks", "controversiality": 0, "body": "AUPH", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;AUPH&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "stocks", "name": "t1_dgf0jow", "score_hidden": false, "stickied": false, "created": 1492546219.0, "created_utc": 1492517419.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgefmh7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Santo_R", "parent_id": "t1_dgeanir", "subreddit_name_prefixed": "r/stocks", "controversiality": 0, "body": "Ya I was originally thinking index funds, and may eventually sway toward one, but I'm going to start looking at stocks for now, but they've definitely got my attention. And I'm not looking at any particular sector, but between the 5 stocks, I was thinking of maybe diversifying (5 sectors, 5 stocks). Like I know fundamentally, it'll be hard to lose money, because over time stocks naturally grow, and at the least I'll be at par with inflation. But ya, depending on how things go, personally or with a particular company, I may opt to sell early, but still hope to sell at a gain. Like I said, I'm most likely getting into the financial field as a career, so I'll have more direct exposure to indexes as well as stocks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ya I was originally thinking index funds, and may eventually sway toward one, but I&amp;#39;m going to start looking at stocks for now, but they&amp;#39;ve definitely got my attention. And I&amp;#39;m not looking at any particular sector, but between the 5 stocks, I was thinking of maybe diversifying (5 sectors, 5 stocks). Like I know fundamentally, it&amp;#39;ll be hard to lose money, because over time stocks naturally grow, and at the least I&amp;#39;ll be at par with inflation. But ya, depending on how things go, personally or with a particular company, I may opt to sell early, but still hope to sell at a gain. Like I said, I&amp;#39;m most likely getting into the financial field as a career, so I&amp;#39;ll have more direct exposure to indexes as well as stocks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "stocks", "name": "t1_dgefmh7", "score_hidden": false, "stickied": false, "created": 1492506110.0, "created_utc": 1492477310.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeanir", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Cyrilix", "parent_id": "t3_65yy53", "subreddit_name_prefixed": "r/stocks", "controversiality": 0, "body": "Any stocks? Sector preference? I wouldn't own stocks that you don't understand. Holding long term is fine but the business of a company changes and you need to know whether they are worth buying more, holding, or selling, due to fundamentals.\n\nMost of /r/investing is pretty lazy when it comes to following companies so they'll just tell you to buy an index fund, but if you enjoy the art of investing, learning, making mistakes, and thoughtfully refining your analysis, stocks are the way to go.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Any stocks? Sector preference? I wouldn&amp;#39;t own stocks that you don&amp;#39;t understand. Holding long term is fine but the business of a company changes and you need to know whether they are worth buying more, holding, or selling, due to fundamentals.&lt;/p&gt;\n\n&lt;p&gt;Most of &lt;a href=\"/r/investing\"&gt;/r/investing&lt;/a&gt; is pretty lazy when it comes to following companies so they&amp;#39;ll just tell you to buy an index fund, but if you enjoy the art of investing, learning, making mistakes, and thoughtfully refining your analysis, stocks are the way to go.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "stocks", "name": "t1_dgeanir", "score_hidden": false, "stickied": false, "created": 1492499808.0, "created_utc": 1492471008.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjfk", "removal_reason": null, "link_id": "t3_65yy53", "likes": null, "replies": "", "user_reports": [], "id": "dgebr9c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "trader27", "parent_id": "t3_65yy53", "subreddit_name_prefixed": "r/stocks", "controversiality": 0, "body": "I like Amazon a lot, I remember friends making fun of me two years ago for still buying it because it had a crazy P/E ratio and still is high but, I'm still buying and up over 200%.\n\nYou should also Look into Shopify (SHOP)  They have had great growth in share price last year and are increasing sales year over year over 50%.  Still have a lot of market share to capture.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like Amazon a lot, I remember friends making fun of me two years ago for still buying it because it had a crazy P/E ratio and still is high but, I&amp;#39;m still buying and up over 200%.&lt;/p&gt;\n\n&lt;p&gt;You should also Look into Shopify (SHOP)  They have had great growth in share price last year and are increasing sales year over year over 50%.  Still have a lot of market share to capture.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "stocks", "name": "t1_dgebr9c", "score_hidden": false, "stickied": false, "created": 1492501236.0, "created_utc": 1492472436.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjfk", "removal_reason": null, "link_id": "t3_65yy53", "likes": null, "replies": "", "user_reports": [], "id": "dgemkw1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "XXAM24", "parent_id": "t3_65yy53", "subreddit_name_prefixed": "r/stocks", "controversiality": 0, "body": "Apple safe move, low price per earnings decent book value. However earnings per share will keep increasing at a very solid rate. I phone 8 will do extremely well and should see more sales in Asia. Also FSLR first solar worlds biggest and best solar company right now at 3 year low selling for about half book value a real steal. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Apple safe move, low price per earnings decent book value. However earnings per share will keep increasing at a very solid rate. I phone 8 will do extremely well and should see more sales in Asia. Also FSLR first solar worlds biggest and best solar company right now at 3 year low selling for about half book value a real steal. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "stocks", "name": "t1_dgemkw1", "score_hidden": false, "stickied": false, "created": 1492514686.0, "created_utc": 1492485886.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjfk", "removal_reason": null, "link_id": "t3_65yy53", "likes": null, "replies": "", "user_reports": [], "id": "dgexx1b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "New4356", "parent_id": "t3_65yy53", "subreddit_name_prefixed": "r/stocks", "controversiality": 0, "body": "You don't know a decent amount about the stock market. Trust me. There's so much information you need to know. Accounting is the core fundamental of long-term investing. If you don't understand accounting on a good level, you shouldn't be picking your own stocks for the long-term. This is one reason why people invest for the short-term. They're protecting against their own ignorance because they don't know how good the stock will do over the long-term. \n\nYou DEFINITELY do not want to handpick only five stocks. This could work if you're exceptionally good at the stock market. By this, I mean one of the BEST. If you're not one of the best, you need at least ten stocks. The less confident you are in your stock picking ability, the more stocks you should own. This is why most amateurs are recommended to purchase index funds. Index funds have so many stocks. One bad stock won't crush an index fund. \n\nNow consider this. According to Peter Lynch, most seasoned investors will pick a bad stock 20% of the time. This number is higher for people that have a higher risk strategy. What do you think that number would be for someone who has a \"decent\" amount of knowledge. Depends how lucky you get, but you can count on it being higher.\n\nThis is what I would recommend. Do not pick your own stocks right now. Read a bunch of books about investing in the stock market. In the meantime, purchase an index fund or something that is highly diversified. If it's a small amount of money, buy books instead of investing in the stock market. But I'll give you the most important information for long term investing in the stock market. Stocks can go down even if they're growing, making money, and doing well. These are the kinds of opportunities you want to look for as a long term investor. I purchased Apple stock for $90 last year, and now it's around $140. I didn't buy it just because it's Apple.... It met the criteria I said above. It's hard to find these when the market is at an all time high, but there's opportunities if you look hard enough. The best time to find these is obviously when the market has crashed or declined significantly. Once again, Apple is a good example if you look at the recent crash. Look at the financial statements of companies and compare them to how the stock reacted. Sometimes you will find inconsistencies you can take advantage of or avoid. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t know a decent amount about the stock market. Trust me. There&amp;#39;s so much information you need to know. Accounting is the core fundamental of long-term investing. If you don&amp;#39;t understand accounting on a good level, you shouldn&amp;#39;t be picking your own stocks for the long-term. This is one reason why people invest for the short-term. They&amp;#39;re protecting against their own ignorance because they don&amp;#39;t know how good the stock will do over the long-term. &lt;/p&gt;\n\n&lt;p&gt;You DEFINITELY do not want to handpick only five stocks. This could work if you&amp;#39;re exceptionally good at the stock market. By this, I mean one of the BEST. If you&amp;#39;re not one of the best, you need at least ten stocks. The less confident you are in your stock picking ability, the more stocks you should own. This is why most amateurs are recommended to purchase index funds. Index funds have so many stocks. One bad stock won&amp;#39;t crush an index fund. &lt;/p&gt;\n\n&lt;p&gt;Now consider this. According to Peter Lynch, most seasoned investors will pick a bad stock 20% of the time. This number is higher for people that have a higher risk strategy. What do you think that number would be for someone who has a &amp;quot;decent&amp;quot; amount of knowledge. Depends how lucky you get, but you can count on it being higher.&lt;/p&gt;\n\n&lt;p&gt;This is what I would recommend. Do not pick your own stocks right now. Read a bunch of books about investing in the stock market. In the meantime, purchase an index fund or something that is highly diversified. If it&amp;#39;s a small amount of money, buy books instead of investing in the stock market. But I&amp;#39;ll give you the most important information for long term investing in the stock market. Stocks can go down even if they&amp;#39;re growing, making money, and doing well. These are the kinds of opportunities you want to look for as a long term investor. I purchased Apple stock for $90 last year, and now it&amp;#39;s around $140. I didn&amp;#39;t buy it just because it&amp;#39;s Apple.... It met the criteria I said above. It&amp;#39;s hard to find these when the market is at an all time high, but there&amp;#39;s opportunities if you look hard enough. The best time to find these is obviously when the market has crashed or declined significantly. Once again, Apple is a good example if you look at the recent crash. Look at the financial statements of companies and compare them to how the stock reacted. Sometimes you will find inconsistencies you can take advantage of or avoid. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "stocks", "name": "t1_dgexx1b", "score_hidden": false, "stickied": false, "created": 1492540293.0, "created_utc": 1492511493.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjfk", "removal_reason": null, "link_id": "t3_65yy53", "likes": null, "replies": "", "user_reports": [], "id": "dgeknsk", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "QAFY", "parent_id": "t3_65yy53", "subreddit_name_prefixed": "r/stocks", "controversiality": 0, "body": "VTI, SCHB, VIG, SCHD?\n\nPersonally​ the only thing I'm holding for the long long game is SHOP but that's not guaranteed growth. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;VTI, SCHB, VIG, SCHD?&lt;/p&gt;\n\n&lt;p&gt;Personally​ the only thing I&amp;#39;m holding for the long long game is SHOP but that&amp;#39;s not guaranteed growth. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "stocks", "name": "t1_dgeknsk", "score_hidden": false, "stickied": false, "created": 1492512212.0, "created_utc": 1492483412.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]