[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "NeutralPolitics", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;While not new news, it was recently mentioned in a &lt;a href=\"/r/neutralpolitics\"&gt;/r/neutralpolitics&lt;/a&gt; conversation that &lt;a href=\"http://www.reuters.com/article/us-usa-cybersecurity-surveillance-idUSKCN0XR009\"&gt;the overwhelming majority of warrants requested from the Foreign Intelligence Surveillance Court (FISC) are approved.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This is pertinent to &lt;a href=\"https://www.washingtonpost.com/world/national-security/fbi-obtained-fisa-warrant-to-monitor-former-trump-adviser-carter-page/2017/04/11/620192ea-1e0e-11e7-ad74-3a742a6e93a7_story.html\"&gt;the recent report about Carter Page&lt;/a&gt; insofar as it is used to derive an assessment of the FISC&amp;#39;s credibility and therefore the meaningfulness of that report.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.law.cornell.edu/uscode/text/50/1805\"&gt;The law governing the issuance of FISA-controlled warrants can be found here.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It has been observed that the FISC has authorized activities that would not withstand rigorous scrutiny, though this pertained specifically to unwarranted surveillance. &lt;a href=\"https://en.wikipedia.org/wiki/NSA_warrantless_surveillance_(2001%E2%80%9307\"&gt;Wikipedia covers the context well&lt;/a&gt;), but the key note for this discussion is that the law had to be amended, thereby obviating ambiguity about the specific activities&amp;#39; legality (i.e. rigorous external scrutiny made it apparent the FISC was not necessarily executing its oversight entirely in accordance with existing law). &lt;/p&gt;\n\n&lt;p&gt;Even considering such criticism of the FISC, it seems imprudent to dismiss entirely the existence of non-public, opaque courts tasked with reviewing and controlling the ways the executive branch manages classified information and executes classified operations. By definition you can&amp;#39;t review classified information or activities publicly, but this seems to contradict &lt;a href=\"https://en.wikipedia.org/wiki/Fourth_Amendment_to_the_United_States_Constitution\"&gt;constitutional protections guaranteed to US citizens.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;So how can US law be changed to allow for the necessary existence of &amp;quot;secret&amp;quot; courts while ensuring those courts don&amp;#39;t overstep legal constraints or constitutional protections? How do you you provide appropriate judicial oversight of programs, activities, and information that one or more affected parties can&amp;#39;t even know exist? Or, I suppose, does anyone think our current legal framework for this is more or less appropriate?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "While not new news, it was recently mentioned in a /r/neutralpolitics conversation that [the overwhelming majority of warrants requested from the Foreign Intelligence Surveillance Court (FISC) are approved.](http://www.reuters.com/article/us-usa-cybersecurity-surveillance-idUSKCN0XR009)\n\nThis is pertinent to [the recent report about Carter Page](\nhttps://www.washingtonpost.com/world/national-security/fbi-obtained-fisa-warrant-to-monitor-former-trump-adviser-carter-page/2017/04/11/620192ea-1e0e-11e7-ad74-3a742a6e93a7_story.html) insofar as it is used to derive an assessment of the FISC's credibility and therefore the meaningfulness of that report.\n\n[The law governing the issuance of FISA-controlled warrants can be found here.](https://www.law.cornell.edu/uscode/text/50/1805)\n\nIt has been observed that the FISC has authorized activities that would not withstand rigorous scrutiny, though this pertained specifically to unwarranted surveillance. [Wikipedia covers the context well](https://en.wikipedia.org/wiki/NSA_warrantless_surveillance_(2001%E2%80%9307)), but the key note for this discussion is that the law had to be amended, thereby obviating ambiguity about the specific activities' legality (i.e. rigorous external scrutiny made it apparent the FISC was not necessarily executing its oversight entirely in accordance with existing law). \n\nEven considering such criticism of the FISC, it seems imprudent to dismiss entirely the existence of non-public, opaque courts tasked with reviewing and controlling the ways the executive branch manages classified information and executes classified operations. By definition you can't review classified information or activities publicly, but this seems to contradict [constitutional protections guaranteed to US citizens.](https://en.wikipedia.org/wiki/Fourth_Amendment_to_the_United_States_Constitution)\n\nSo how can US law be changed to allow for the necessary existence of \"secret\" courts while ensuring those courts don't overstep legal constraints or constitutional protections? How do you you provide appropriate judicial oversight of programs, activities, and information that one or more affected parties can't even know exist? Or, I suppose, does anyone think our current legal framework for this is more or less appropriate?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "650x5e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 146, "report_reasons": null, "author": "baish", "saved": false, "mod_reports": [], "name": "t3_650x5e", "subreddit_name_prefixed": "r/NeutralPolitics", "approved_by": null, "over_18": false, "domain": "self.NeutralPolitics", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2tk0i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/NeutralPolitics/comments/650x5e/what_is_the_optimal_configuration_for_judicial/", "num_reports": null, "locked": false, "stickied": false, "created": 1492059044.0, "url": "https://www.reddit.com/r/NeutralPolitics/comments/650x5e/what_is_the_optimal_configuration_for_judicial/", "author_flair_text": null, "quarantine": false, "title": "What is the optimal configuration for judicial oversight of classified information and operations?", "created_utc": 1492030244.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 23, "visited": false, "subreddit_type": "public", "ups": 146}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": "", "user_reports": [], "id": "dg7zuq0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "senjutsuka", "parent_id": "t1_dg7ywzo", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "For exactly the reason you've stated.  Its a compromise.  Historically it works out in the short run, but eventually the secret authority gets abused and accepted long enough that it decays the institutions of democracy.  \n\nAs a logical exercise think of it this way, rulership by the people (democracy) requires an informed populace, which is logically incompatible with secretive authority.  There are some papers and discussions around this in both eras I mentioned by the people forming the institutions.  I believe it was the first director of the FBI and some of the founding members of the OSA which wrote these essays but you'd have to dig around for it.  Its been written about extensively and ultimately it always seems to fall to 'its the lesser of two evils to carry this power in defense against such powers in other's hands, but it does decay our democracy to do so'.  Worth reading about.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For exactly the reason you&amp;#39;ve stated.  Its a compromise.  Historically it works out in the short run, but eventually the secret authority gets abused and accepted long enough that it decays the institutions of democracy.  &lt;/p&gt;\n\n&lt;p&gt;As a logical exercise think of it this way, rulership by the people (democracy) requires an informed populace, which is logically incompatible with secretive authority.  There are some papers and discussions around this in both eras I mentioned by the people forming the institutions.  I believe it was the first director of the FBI and some of the founding members of the OSA which wrote these essays but you&amp;#39;d have to dig around for it.  Its been written about extensively and ultimately it always seems to fall to &amp;#39;its the lesser of two evils to carry this power in defense against such powers in other&amp;#39;s hands, but it does decay our democracy to do so&amp;#39;.  Worth reading about.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg7zuq0", "score_hidden": false, "stickied": false, "created": 1492137207.0, "created_utc": 1492108407.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ywzo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "baish", "parent_id": "t1_dg7h9pn", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "&gt; this somewhat invalidates your premise that the court's credibility is meaningless\n\ni was very careful when wording my premise to *not* imply a final verdict regarding the court's credibility - i fully acknowledge that while amending laws for retroactive authorization implies SOME compromise of credibility, there is nonetheless plenty of evidence the FISC is exercising a non-zero amount of IC oversight.\n\ni'm interested in your claim that there has never been a successful reconciliation of democracy and secret authority, though, particularly considering your defense of the FISC. ostensibly the the FISC *IS* our contemporary attempt to do exactly that - reconcile democracy and secret authority. so if it is defensible, why specifically is it still unsuccessful?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;this somewhat invalidates your premise that the court&amp;#39;s credibility is meaningless&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;i was very careful when wording my premise to &lt;em&gt;not&lt;/em&gt; imply a final verdict regarding the court&amp;#39;s credibility - i fully acknowledge that while amending laws for retroactive authorization implies SOME compromise of credibility, there is nonetheless plenty of evidence the FISC is exercising a non-zero amount of IC oversight.&lt;/p&gt;\n\n&lt;p&gt;i&amp;#39;m interested in your claim that there has never been a successful reconciliation of democracy and secret authority, though, particularly considering your defense of the FISC. ostensibly the the FISC &lt;em&gt;IS&lt;/em&gt; our contemporary attempt to do exactly that - reconcile democracy and secret authority. so if it is defensible, why specifically is it still unsuccessful?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg7ywzo", "score_hidden": false, "stickied": false, "created": 1492136217.0, "created_utc": 1492107417.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7h9pn", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "senjutsuka", "parent_id": "t3_650x5e", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "It was mentioned before the Carter Page info came out that the FBI had to refine its FISA request to get the warrant.  Initially it was too broad and the FISA court rejected it on grounds it could be politicized (ie swept in too many from the campaign).   So this somewhat invalidates your premise that the court's credibility is meaningless in this particular regard.  In fact it shows the opposite, that despite rejecting initial requests, there was in fact enough probable cause to grant a limited warrant even in the potentially explosive political landscape. \n\nSource:  \n\"The Guardian has learned that the FBI applied for a warrant from the foreign intelligence surveillance (Fisa) court over the summer in order to monitor four members of the Trump team suspected of irregular contacts with Russian officials. The Fisa court turned down the application asking FBI counter-intelligence investigators to narrow its focus. According to one report, the FBI was finally granted a warrant in October, but that has not been confirmed, and it is not clear whether any warrant led to a full investigation.\"\nhttps://www.theguardian.com/us-news/2017/jan/10/fbi-chief-given-dossier-by-john-mccain-alleging-secret-trump-russia-contacts\n\nAs for how do we properly limit secret programs with oversight, that is a debate that goes back to the earliest formation of both national police (FBI precursor) and secret spy organization (CIA precursor).  There has never been a successful reconciliation of democracy and secret authority.  Its just logically irreconcilable and must either be lived with, or the results of the lack there of accepted.  Neither is optimal both are acceptable to various countries for various reasons.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was mentioned before the Carter Page info came out that the FBI had to refine its FISA request to get the warrant.  Initially it was too broad and the FISA court rejected it on grounds it could be politicized (ie swept in too many from the campaign).   So this somewhat invalidates your premise that the court&amp;#39;s credibility is meaningless in this particular regard.  In fact it shows the opposite, that despite rejecting initial requests, there was in fact enough probable cause to grant a limited warrant even in the potentially explosive political landscape. &lt;/p&gt;\n\n&lt;p&gt;Source:&lt;br/&gt;\n&amp;quot;The Guardian has learned that the FBI applied for a warrant from the foreign intelligence surveillance (Fisa) court over the summer in order to monitor four members of the Trump team suspected of irregular contacts with Russian officials. The Fisa court turned down the application asking FBI counter-intelligence investigators to narrow its focus. According to one report, the FBI was finally granted a warrant in October, but that has not been confirmed, and it is not clear whether any warrant led to a full investigation.&amp;quot;\n&lt;a href=\"https://www.theguardian.com/us-news/2017/jan/10/fbi-chief-given-dossier-by-john-mccain-alleging-secret-trump-russia-contacts\"&gt;https://www.theguardian.com/us-news/2017/jan/10/fbi-chief-given-dossier-by-john-mccain-alleging-secret-trump-russia-contacts&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;As for how do we properly limit secret programs with oversight, that is a debate that goes back to the earliest formation of both national police (FBI precursor) and secret spy organization (CIA precursor).  There has never been a successful reconciliation of democracy and secret authority.  Its just logically irreconcilable and must either be lived with, or the results of the lack there of accepted.  Neither is optimal both are acceptable to various countries for various reasons.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg7h9pn", "score_hidden": false, "stickied": false, "created": 1492115804.0, "created_utc": 1492087004.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": "", "user_reports": [], "id": "dg7laa8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "amunak", "parent_id": "t1_dg7fs6n", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "&gt;Now, I ask you: Try to imagine *any way* to justly oversee the NSA database.\n\nRandomly selected individuals from a big pool from the general population that would have the necessary security checks could access *stuff* in the database that'd be randomly assigned to them for review and with personal or identifying information blacked out. And always multiple people would be checking a single thing. Then they could bring up comments, issues, questions, etc. to their \"higher ups\" who would be full time government employees - with even better security checks but picked by entirely different government branches (or maybe even elected). Those could decide if the brought up issues are potentially \"bad\", would even be able to view the documents uncensored, and they could have their own \"courts\" and procedures to solely rule any of this stuff illegal (as in their only power would be to veto specific secret court rulings, requests for information, they could remove select data - perhaps deemed as too personal or broad - from the government databases, the like). And in case of huge or repeat breaches of trust, privacy and the Constitution they could even make some secret data public, prosecute the people who made the decisions in public courts, etc.\n\nBasically the idea is to have a big-ish (and thus not easily corruptible) group of people *with no ties to those who have any power to make the decisions* and give them the power to keep the \"other side\" in check and inform the general populace if necessary.\n\nThey'd also have to publicly publish all metadata about their actions - how many were taken, what kind, the results, etc. Basically disclose anything *but the actual secret content*.\n\nShould work pretty well, some governments already implement stuff like that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Now, I ask you: Try to imagine &lt;em&gt;any way&lt;/em&gt; to justly oversee the NSA database.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Randomly selected individuals from a big pool from the general population that would have the necessary security checks could access &lt;em&gt;stuff&lt;/em&gt; in the database that&amp;#39;d be randomly assigned to them for review and with personal or identifying information blacked out. And always multiple people would be checking a single thing. Then they could bring up comments, issues, questions, etc. to their &amp;quot;higher ups&amp;quot; who would be full time government employees - with even better security checks but picked by entirely different government branches (or maybe even elected). Those could decide if the brought up issues are potentially &amp;quot;bad&amp;quot;, would even be able to view the documents uncensored, and they could have their own &amp;quot;courts&amp;quot; and procedures to solely rule any of this stuff illegal (as in their only power would be to veto specific secret court rulings, requests for information, they could remove select data - perhaps deemed as too personal or broad - from the government databases, the like). And in case of huge or repeat breaches of trust, privacy and the Constitution they could even make some secret data public, prosecute the people who made the decisions in public courts, etc.&lt;/p&gt;\n\n&lt;p&gt;Basically the idea is to have a big-ish (and thus not easily corruptible) group of people &lt;em&gt;with no ties to those who have any power to make the decisions&lt;/em&gt; and give them the power to keep the &amp;quot;other side&amp;quot; in check and inform the general populace if necessary.&lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;d also have to publicly publish all metadata about their actions - how many were taken, what kind, the results, etc. Basically disclose anything &lt;em&gt;but the actual secret content&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Should work pretty well, some governments already implement stuff like that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg7laa8", "score_hidden": false, "stickied": false, "created": 1492121422.0, "created_utc": 1492092622.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": "", "user_reports": [], "id": "dg80vtv", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ThuviaofMars", "parent_id": "t1_dg7xo4e", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "I clearly cited Binney for Five Eyes not the other.\n\nThe quote you use from him is deceptive both in reference to what I wrote and to the basic issue of secrecy and misuse of the database. Listen to the whole interview. Binney is appalled at what is happening.\n\nBinney left NSA in 2001 because they weren't using those controls and they haven't since and he saw no way to get them to use them.\n\nThe US system has problems with oversight in many areas - police conduct, expert testimony, political corruption, white collar crime, etc. As a nation we have been able to sort of live with that.\n\nThe special problem with the NSA database is the scope of information it contains is huge, massive, gigantic. Misuse of that database is beyond anything anyone imagined in the past. The East German Stasi had peanuts compared to what the NSA now has.\n\nThanks for this discussion. It was enjoyable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I clearly cited Binney for Five Eyes not the other.&lt;/p&gt;\n\n&lt;p&gt;The quote you use from him is deceptive both in reference to what I wrote and to the basic issue of secrecy and misuse of the database. Listen to the whole interview. Binney is appalled at what is happening.&lt;/p&gt;\n\n&lt;p&gt;Binney left NSA in 2001 because they weren&amp;#39;t using those controls and they haven&amp;#39;t since and he saw no way to get them to use them.&lt;/p&gt;\n\n&lt;p&gt;The US system has problems with oversight in many areas - police conduct, expert testimony, political corruption, white collar crime, etc. As a nation we have been able to sort of live with that.&lt;/p&gt;\n\n&lt;p&gt;The special problem with the NSA database is the scope of information it contains is huge, massive, gigantic. Misuse of that database is beyond anything anyone imagined in the past. The East German Stasi had peanuts compared to what the NSA now has.&lt;/p&gt;\n\n&lt;p&gt;Thanks for this discussion. It was enjoyable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg80vtv", "score_hidden": false, "stickied": false, "created": 1492138318.0, "created_utc": 1492109518.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7xo4e", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "baish", "parent_id": "t1_dg7ulth", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "&gt;I have answered all of your questions.\n\nCan you quote the section of Binney's interview which supports your claim that 2015's zero rate of warrant denial is a result of absent or ineffective oversight (instead of being a result of only solid warrants being requested)? I can't seem to find it. \n\nOf the three times Binney said the word \"warrant\" in that interview, here is the first:\n\n&gt; Bill Binney: There are, under the FISA law though, at the time, there was called—what they called the FASTA, or quick reaction capability. Which meant that if, for example a terrorist called into someone in the United States and they were presumed to be a US citizen at that point. You still had the, because of the fast pursuit approach—in the agreement, in the law you had 72 hours to look at that. And if, at the end of 72 hours you had to request a warrant. And justify it with probable cause or you dropped the collection.\n&gt;\n&gt; Robert Scheer: Okay, so…\n&gt;\n&gt; Bill Binney: So, there—there was a—you could do that for awhile. We in turn simply said, okay. What that meant to us was if anybody fell into that kind of approach, we would automatically start the collection. But, also we would encrypt all of their attributes so you couldn’t tell who it was. Even people inside NSA couldn’t do that.\n&gt;\n&gt; Robert Scheer: So, you’d protect their privacy.\n&gt;\n&gt; Bill Binney: Yeah. Right. \n\nWhich is pretty clear evidence there are FISC-supported standards the IC complies with (from a strong IC critic, mind). \n\nWhich is to say I still see no concrete evidence for this claim:\n\n&gt;if it's secret it's not transparent and if it's not transparent it is not oversight\n\nWhich means this position is still quite dubious:\n\n&gt;There is probably no real-world solution to this problem.\n\n[edit: quote formatting]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have answered all of your questions.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Can you quote the section of Binney&amp;#39;s interview which supports your claim that 2015&amp;#39;s zero rate of warrant denial is a result of absent or ineffective oversight (instead of being a result of only solid warrants being requested)? I can&amp;#39;t seem to find it. &lt;/p&gt;\n\n&lt;p&gt;Of the three times Binney said the word &amp;quot;warrant&amp;quot; in that interview, here is the first:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Bill Binney: There are, under the FISA law though, at the time, there was called—what they called the FASTA, or quick reaction capability. Which meant that if, for example a terrorist called into someone in the United States and they were presumed to be a US citizen at that point. You still had the, because of the fast pursuit approach—in the agreement, in the law you had 72 hours to look at that. And if, at the end of 72 hours you had to request a warrant. And justify it with probable cause or you dropped the collection.&lt;/p&gt;\n\n&lt;p&gt;Robert Scheer: Okay, so…&lt;/p&gt;\n\n&lt;p&gt;Bill Binney: So, there—there was a—you could do that for awhile. We in turn simply said, okay. What that meant to us was if anybody fell into that kind of approach, we would automatically start the collection. But, also we would encrypt all of their attributes so you couldn’t tell who it was. Even people inside NSA couldn’t do that.&lt;/p&gt;\n\n&lt;p&gt;Robert Scheer: So, you’d protect their privacy.&lt;/p&gt;\n\n&lt;p&gt;Bill Binney: Yeah. Right. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Which is pretty clear evidence there are FISC-supported standards the IC complies with (from a strong IC critic, mind). &lt;/p&gt;\n\n&lt;p&gt;Which is to say I still see no concrete evidence for this claim:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;if it&amp;#39;s secret it&amp;#39;s not transparent and if it&amp;#39;s not transparent it is not oversight&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Which means this position is still quite dubious:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;There is probably no real-world solution to this problem.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;[edit: quote formatting]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg7xo4e", "score_hidden": false, "stickied": false, "created": 1492134893.0, "created_utc": 1492106093.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ulth", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "ThuviaofMars", "parent_id": "t1_dg7rqen", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "&gt;standards of some sort being enforced by the FISC\n\nPlease, if it's secret it's not transparent and if it's not transparent it is not oversight. Our system runs on transparency and checks and balances. It's a wonderful system but it is not able to handle the NSA database. You do realize the database contains all electronic communication including telephone audio and more. Even if FISC was adequate oversight (it is not), there is still the problem of people authorized to access the database abusing that access. Five Eyes is one example of this. Susan Rice is another.\n\nBill Binney discusses [Five Eyes here](http://www.truthdig.com/avbooth/item/live_at_truthdig_robert_scheer_and_william_binney_on_the_alleged_russian_ha).\n\nI have answered all of your questions. If you want to argue that there \"are standards\" at FISC that mean anything, *you* need to prove they are working. You can't do this because the system is not transparent. Even members of Congress can't prove it for the same reason.\n\nLet's recall your original query:\n\n&gt;How do you you provide appropriate judicial oversight of programs, activities, and information that one or more affected parties can't even know exist?\n\nAnd my first answer:\n\n&gt;There is probably no real-world solution to this problem...\n\n...at this time.\n\nMaybe in future, with the invention of an accurate lie-detector, you might be able to set up a system that uses lie-detectors with many tiers of redundancy for checking anyone who accesses the database and anyone who guards it and anyone who checks it or checks people who access it or uses the lie-detectors. That system *might* work.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;standards of some sort being enforced by the FISC&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Please, if it&amp;#39;s secret it&amp;#39;s not transparent and if it&amp;#39;s not transparent it is not oversight. Our system runs on transparency and checks and balances. It&amp;#39;s a wonderful system but it is not able to handle the NSA database. You do realize the database contains all electronic communication including telephone audio and more. Even if FISC was adequate oversight (it is not), there is still the problem of people authorized to access the database abusing that access. Five Eyes is one example of this. Susan Rice is another.&lt;/p&gt;\n\n&lt;p&gt;Bill Binney discusses &lt;a href=\"http://www.truthdig.com/avbooth/item/live_at_truthdig_robert_scheer_and_william_binney_on_the_alleged_russian_ha\"&gt;Five Eyes here&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;I have answered all of your questions. If you want to argue that there &amp;quot;are standards&amp;quot; at FISC that mean anything, &lt;em&gt;you&lt;/em&gt; need to prove they are working. You can&amp;#39;t do this because the system is not transparent. Even members of Congress can&amp;#39;t prove it for the same reason.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s recall your original query:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;How do you you provide appropriate judicial oversight of programs, activities, and information that one or more affected parties can&amp;#39;t even know exist?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And my first answer:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;There is probably no real-world solution to this problem...&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;...at this time.&lt;/p&gt;\n\n&lt;p&gt;Maybe in future, with the invention of an accurate lie-detector, you might be able to set up a system that uses lie-detectors with many tiers of redundancy for checking anyone who accesses the database and anyone who guards it and anyone who checks it or checks people who access it or uses the lie-detectors. That system &lt;em&gt;might&lt;/em&gt; work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg7ulth", "score_hidden": false, "stickied": false, "created": 1492131635.0, "created_utc": 1492102835.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7rqen", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "baish", "parent_id": "t1_dg7fs6n", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "Why should we assume the lack of rejected surveillance warrants in 2015 indicates a lack of oversight rather than a lack of weak/insufficient warrant applications? As /u/senjutsuka [mentioned here](https://www.reddit.com/r/NeutralPolitics/comments/650x5e/what_is_the_optimal_configuration_for_judicial/dg7h9pn/), there are likely standards of some sort being enforced by the FISC.\n\nI worded my initial question as I did very intentionally - while I am personally apt to assume this rejection rate indicates an issue, it alone is insufficient to indicate secret oversight is no oversight. As this is a central pillar of your argument, I hope you can provide something compelling to indicate why you're so sure it indicates what you say it does.\n\nRegarding the FVEY \"backdoor\" - do you have any proof of this mechanism being abused as you describe? This certainly seems a likely form of abuse for such a database, but is there anything other than speculation to indicate it has actually been abused in this way?\n\n[replaced an errant word]", "edited": 1492100139.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why should we assume the lack of rejected surveillance warrants in 2015 indicates a lack of oversight rather than a lack of weak/insufficient warrant applications? As &lt;a href=\"/u/senjutsuka\"&gt;/u/senjutsuka&lt;/a&gt; &lt;a href=\"https://www.reddit.com/r/NeutralPolitics/comments/650x5e/what_is_the_optimal_configuration_for_judicial/dg7h9pn/\"&gt;mentioned here&lt;/a&gt;, there are likely standards of some sort being enforced by the FISC.&lt;/p&gt;\n\n&lt;p&gt;I worded my initial question as I did very intentionally - while I am personally apt to assume this rejection rate indicates an issue, it alone is insufficient to indicate secret oversight is no oversight. As this is a central pillar of your argument, I hope you can provide something compelling to indicate why you&amp;#39;re so sure it indicates what you say it does.&lt;/p&gt;\n\n&lt;p&gt;Regarding the FVEY &amp;quot;backdoor&amp;quot; - do you have any proof of this mechanism being abused as you describe? This certainly seems a likely form of abuse for such a database, but is there anything other than speculation to indicate it has actually been abused in this way?&lt;/p&gt;\n\n&lt;p&gt;[replaced an errant word]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg7rqen", "score_hidden": false, "stickied": false, "created": 1492128582.0, "created_utc": 1492099782.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7fs6n", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ThuviaofMars", "parent_id": "t1_dg7c2wm", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "&gt;evidence do you conclude secret oversight is NO oversight?\n\nYou provided it yourself: [U.S. spy court rejected zero surveillance orders in 2015](http://www.reuters.com/article/us-usa-cybersecurity-surveillance-idUSKCN0XR009). There have always been some problems with traditional oversight. The US is based on checks and balances plus transparency. Both of these concepts predate today's spy capabilities by over two centuries. \"Secret oversight\" by definition is not transparent and thus not even possibly subject to review, checks, balances, or legitimate oversight. In this respect, we are fundamentally in a post-Constitutional era. I for one do not see any way to correct this problem unless we have extremely reliable lie-detectors and are able to use them with perfect integrity on anyone who accesses the NSA database. Fat chance. Do you see any other way?\n\nThe Five Eyes backdoor will be officially denied whenever it comes up and that illustrates the problem well. *Officially* in this context just means some people (officials) will say \"we don't do that.\" Where is the oversight? Where is the transparency? Who watches the watchers? The way Five Eyes circumvents oversight is an \"official\" from one of those countries can casually/privately ask an \"official\" from one of the other countries to access the NSA database and tell them what they want to know. Susan Rice, it seems, didn't even bother to do that.\n\nI am not throwing the baby out, new technology has crushed it. Besides extremely good lie-detectors, which will still present numerous problems, I do not see any way to restore outdated Constitutional controls.\n\nNow, I ask you: Try to imagine *any way* to justly oversee the NSA database.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;evidence do you conclude secret oversight is NO oversight?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You provided it yourself: &lt;a href=\"http://www.reuters.com/article/us-usa-cybersecurity-surveillance-idUSKCN0XR009\"&gt;U.S. spy court rejected zero surveillance orders in 2015&lt;/a&gt;. There have always been some problems with traditional oversight. The US is based on checks and balances plus transparency. Both of these concepts predate today&amp;#39;s spy capabilities by over two centuries. &amp;quot;Secret oversight&amp;quot; by definition is not transparent and thus not even possibly subject to review, checks, balances, or legitimate oversight. In this respect, we are fundamentally in a post-Constitutional era. I for one do not see any way to correct this problem unless we have extremely reliable lie-detectors and are able to use them with perfect integrity on anyone who accesses the NSA database. Fat chance. Do you see any other way?&lt;/p&gt;\n\n&lt;p&gt;The Five Eyes backdoor will be officially denied whenever it comes up and that illustrates the problem well. &lt;em&gt;Officially&lt;/em&gt; in this context just means some people (officials) will say &amp;quot;we don&amp;#39;t do that.&amp;quot; Where is the oversight? Where is the transparency? Who watches the watchers? The way Five Eyes circumvents oversight is an &amp;quot;official&amp;quot; from one of those countries can casually/privately ask an &amp;quot;official&amp;quot; from one of the other countries to access the NSA database and tell them what they want to know. Susan Rice, it seems, didn&amp;#39;t even bother to do that.&lt;/p&gt;\n\n&lt;p&gt;I am not throwing the baby out, new technology has crushed it. Besides extremely good lie-detectors, which will still present numerous problems, I do not see any way to restore outdated Constitutional controls.&lt;/p&gt;\n\n&lt;p&gt;Now, I ask you: Try to imagine &lt;em&gt;any way&lt;/em&gt; to justly oversee the NSA database.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg7fs6n", "score_hidden": false, "stickied": false, "created": 1492113069.0, "created_utc": 1492084269.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7c2wm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "baish", "parent_id": "t1_dg7br39", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "The ambiguity of the legal issues involved in the warrantless surveillance matter I linked originally implies there was, in fact, a level of legal adherence maintained by the FISC - i.e. while the secret oversight was not perfect, neither was it wholly absent. Based on what competing evidence do you conclude secret oversight is *NO* oversight? \n\nAdditionally, as Five Eye access is a feature, not a bug, of modern US intelligence collection, I understand that the backdoor you're referring to is a pheomenon whereby the US IC can access information on American citizens by asking its four close partners to access that data in its database on its behalf? I've heard something similar before, but I'm interested to know how, exactly, you think that works? Particularly if you have sources. Or, if I'm misunderstanding, what exactly *do* you mean?\n\nTaking both points together, how are you sure you're not throwing the baby out with the bathwater and avoiding the more difficult task of actually discerning what oversight works, what doesn't, and designing something effective?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The ambiguity of the legal issues involved in the warrantless surveillance matter I linked originally implies there was, in fact, a level of legal adherence maintained by the FISC - i.e. while the secret oversight was not perfect, neither was it wholly absent. Based on what competing evidence do you conclude secret oversight is &lt;em&gt;NO&lt;/em&gt; oversight? &lt;/p&gt;\n\n&lt;p&gt;Additionally, as Five Eye access is a feature, not a bug, of modern US intelligence collection, I understand that the backdoor you&amp;#39;re referring to is a pheomenon whereby the US IC can access information on American citizens by asking its four close partners to access that data in its database on its behalf? I&amp;#39;ve heard something similar before, but I&amp;#39;m interested to know how, exactly, you think that works? Particularly if you have sources. Or, if I&amp;#39;m misunderstanding, what exactly &lt;em&gt;do&lt;/em&gt; you mean?&lt;/p&gt;\n\n&lt;p&gt;Taking both points together, how are you sure you&amp;#39;re not throwing the baby out with the bathwater and avoiding the more difficult task of actually discerning what oversight works, what doesn&amp;#39;t, and designing something effective?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg7c2wm", "score_hidden": false, "stickied": false, "created": 1492102949.0, "created_utc": 1492074149.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7br39", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ThuviaofMars", "parent_id": "t3_650x5e", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "&gt;How do you you provide appropriate judicial oversight of programs, activities, and information that one or more affected parties can't even know exist?\n\nThere is probably no real-world solution to this problem since 1) secret oversight is no oversight as FISC history has shown and 2) the NSA database which contains records of all electronic communications, including phone calls, can be backdoor-accessed through [Five Eyes](https://en.wikipedia.org/wiki/Five_Eyes#Domestic_espionage_sharing_controversy) shared access. No matter what oversight is in place, Five Eyes will continue to be a backdoor.\n\nI do not see any way to *not* have the NSA database in this age. If we don't do it someone else will. At the same time, there does not seem to be any way to ensure perfect oversight of NSA information even if there were no Five Eye shared access.\n\nThought experiment: Try to imagine *any way* to justly oversee the NSA database. Even the president only sees [reports gleaned from it.](https://www.nsa.gov/news-features/declassified-documents/intelligence-oversight-board/)\n\nThe NSA database has created unprecedented conditions that cannot be corralled by the Constitution. We cannot even answer the following questions: Who controls the database? Who has most complete access to it? Who watches the watchers?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;How do you you provide appropriate judicial oversight of programs, activities, and information that one or more affected parties can&amp;#39;t even know exist?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There is probably no real-world solution to this problem since 1) secret oversight is no oversight as FISC history has shown and 2) the NSA database which contains records of all electronic communications, including phone calls, can be backdoor-accessed through &lt;a href=\"https://en.wikipedia.org/wiki/Five_Eyes#Domestic_espionage_sharing_controversy\"&gt;Five Eyes&lt;/a&gt; shared access. No matter what oversight is in place, Five Eyes will continue to be a backdoor.&lt;/p&gt;\n\n&lt;p&gt;I do not see any way to &lt;em&gt;not&lt;/em&gt; have the NSA database in this age. If we don&amp;#39;t do it someone else will. At the same time, there does not seem to be any way to ensure perfect oversight of NSA information even if there were no Five Eye shared access.&lt;/p&gt;\n\n&lt;p&gt;Thought experiment: Try to imagine &lt;em&gt;any way&lt;/em&gt; to justly oversee the NSA database. Even the president only sees &lt;a href=\"https://www.nsa.gov/news-features/declassified-documents/intelligence-oversight-board/\"&gt;reports gleaned from it.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The NSA database has created unprecedented conditions that cannot be corralled by the Constitution. We cannot even answer the following questions: Who controls the database? Who has most complete access to it? Who watches the watchers?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg7br39", "score_hidden": false, "stickied": false, "created": 1492101942.0, "created_utc": 1492073142.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": "", "user_reports": [], "id": "dg7i9dn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CQME", "parent_id": "t3_650x5e", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "One possibility is to transfer all \"secret courts\" to military courts.  I mean, these rulings apply to surveillance of foreigners and national security threats originating overseas, which really is the military's purview.  The military is an organization that has to routinely deal with opaque situations and classified information, and which also has all of the infrastructure necessary to handle other responsibilities such as alternative forms of law and order.\n\nIt would be a blunt admission that the necessity of a permanent standing army along with the now-permanent \"war on terror\" in America has turned the country into a quasi-police state, where citizens could very well find themselves [in a court where due process is not a guarantee.](http://www.washingtontimes.com/news/2003/jul/20/20030720-103233-5342r/)\n\nedit - [Here is an overview on military tribunals.](http://www.crf-usa.org/america-responds-to-terrorism/military-tribunals.html)  Some key points:\n\n&gt; Under the procedures, a defendant would receive many, but not all, of the due process protections guaranteed to a defendant in a U.S. civilian criminal court.\n\n&gt; Under the procedures, however, a person can be convicted in a commission trial by a two-thirds majority of the commissioners: Unanimous verdicts are not required.\n\n&gt; Supporters of military tribunals cite their necessity under the circumstances. They fear that trying terrorists in open U.S. courts could compromise intelligence gathering by forcing the government to disclose its sources. \n\n&gt; The procedures do not provide for appeals from a guilty verdict to civilian judges.\n\nNote the Supreme Court is a panel of civilian judges, so these tribunals have authority separate from civil law and most of of the government for that matter.  Also, since it comprises of solely military officers, it places ultimate judicial authority for these courts under the CinC.\n\nThis is indicative of a wartime society, where civil law is incapable of handling the judicial responsibilities necessary for our society to function.  This is IMHO the ultimate consequence of waging an endless \"war on terror\".\n\n", "edited": 1492089512.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One possibility is to transfer all &amp;quot;secret courts&amp;quot; to military courts.  I mean, these rulings apply to surveillance of foreigners and national security threats originating overseas, which really is the military&amp;#39;s purview.  The military is an organization that has to routinely deal with opaque situations and classified information, and which also has all of the infrastructure necessary to handle other responsibilities such as alternative forms of law and order.&lt;/p&gt;\n\n&lt;p&gt;It would be a blunt admission that the necessity of a permanent standing army along with the now-permanent &amp;quot;war on terror&amp;quot; in America has turned the country into a quasi-police state, where citizens could very well find themselves &lt;a href=\"http://www.washingtontimes.com/news/2003/jul/20/20030720-103233-5342r/\"&gt;in a court where due process is not a guarantee.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;edit - &lt;a href=\"http://www.crf-usa.org/america-responds-to-terrorism/military-tribunals.html\"&gt;Here is an overview on military tribunals.&lt;/a&gt;  Some key points:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Under the procedures, a defendant would receive many, but not all, of the due process protections guaranteed to a defendant in a U.S. civilian criminal court.&lt;/p&gt;\n\n&lt;p&gt;Under the procedures, however, a person can be convicted in a commission trial by a two-thirds majority of the commissioners: Unanimous verdicts are not required.&lt;/p&gt;\n\n&lt;p&gt;Supporters of military tribunals cite their necessity under the circumstances. They fear that trying terrorists in open U.S. courts could compromise intelligence gathering by forcing the government to disclose its sources. &lt;/p&gt;\n\n&lt;p&gt;The procedures do not provide for appeals from a guilty verdict to civilian judges.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Note the Supreme Court is a panel of civilian judges, so these tribunals have authority separate from civil law and most of of the government for that matter.  Also, since it comprises of solely military officers, it places ultimate judicial authority for these courts under the CinC.&lt;/p&gt;\n\n&lt;p&gt;This is indicative of a wartime society, where civil law is incapable of handling the judicial responsibilities necessary for our society to function.  This is IMHO the ultimate consequence of waging an endless &amp;quot;war on terror&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg7i9dn", "score_hidden": false, "stickied": false, "created": 1492117349.0, "created_utc": 1492088549.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": "", "user_reports": [], "id": "dg7tnxe", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AutoModerator", "parent_id": "t1_dg7tnx5", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "Hi there, It looks like your comment is a top-level reply to the question posed by the OP which does not provide any        links to sources. This is a friendly reminder from the NP mod team that all factual claims must be [backed up by sources.](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_source_quality)  We would ask that you edit your comment if it is making any factual claims, even if you might think they are common knowledge. Thanks, The NP Mod Team\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi there, It looks like your comment is a top-level reply to the question posed by the OP which does not provide any        links to sources. This is a friendly reminder from the NP mod team that all factual claims must be &lt;a href=\"https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_source_quality\"&gt;backed up by sources.&lt;/a&gt;  We would ask that you edit your comment if it is making any factual claims, even if you might think they are common knowledge. Thanks, The NP Mod Team&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/NeutralPolitics\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg7tnxe", "score_hidden": false, "stickied": false, "created": 1492130641.0, "created_utc": 1492101841.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7tnx5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HonorAmongSteves", "parent_id": "t3_650x5e", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "None! The oversight and responsibility should fall solely on elected--and politically accountable--officials. An attorney general is much less likely to sign off on surveillance of political rivals if it's his name alone on the warrant.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;None! The oversight and responsibility should fall solely on elected--and politically accountable--officials. An attorney general is much less likely to sign off on surveillance of political rivals if it&amp;#39;s his name alone on the warrant.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg7tnx5", "score_hidden": false, "stickied": false, "created": 1492130641.0, "created_utc": 1492101841.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": "", "user_reports": [], "id": "dg78ie3", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg71vas", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg78ie3", "score_hidden": false, "stickied": false, "created": 1492092992.0, "created_utc": 1492064192.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tk0i", "removal_reason": null, "link_id": "t3_650x5e", "likes": null, "replies": "", "user_reports": [], "id": "dg7ja2q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ummmbacon", "parent_id": "t1_dg71vas", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "&gt; there are three comments before my comment posted here and 1 comment chain is missing.\n\nThat happens with deleted comments, shadow banned comments wouldn't show at all.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;there are three comments before my comment posted here and 1 comment chain is missing.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That happens with deleted comments, shadow banned comments wouldn&amp;#39;t show at all.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg7ja2q", "score_hidden": false, "stickied": false, "created": 1492118816.0, "created_utc": 1492090016.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg71vas", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg71udr", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg71vas", "score_hidden": false, "stickied": false, "created": 1492081678.0, "created_utc": 1492052878.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg71udr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg71e6p", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg71udr", "score_hidden": false, "stickied": false, "created": 1492081641.0, "created_utc": 1492052841.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg71e6p", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_650x5e", "subreddit_name_prefixed": "r/NeutralPolitics", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "NeutralPolitics", "name": "t1_dg71e6p", "score_hidden": false, "stickied": false, "created": 1492081041.0, "created_utc": 1492052241.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]