[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "privacy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was thinking that relative to my friends, the technology I use is becoming more and more old fashioned.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not that I don&amp;#39;t &lt;em&gt;want&lt;/em&gt; to use modern things.  I do!  Problem is there has been a change in who they serve.  Time was, you would buy a gadget to do X, and the gadget&amp;#39;s purpose was to do X.  Now, you buy a gadget to do X, but it also &lt;em&gt;watches everything you do&lt;/em&gt; with or sometimes even near it, and reports that data back &amp;quot;somewhere&amp;quot;.  Often to many somewheres!  And even more, often its master is not you!  Someone else controls it even after you bought it, and can &lt;a href=\"http://www.businessinsider.com/iot-garage-door-opener-garadget-kills-customers-device-bad-amazon-review-2017-4\"&gt;shut it off&lt;/a&gt; or change its behavior or remove features at any time for any reason.&lt;/p&gt;\n\n&lt;p&gt;So I have all this relatively ancient tech I am still using because I cannot find a replacement that isn&amp;#39;t designed to rip control of the data or the device or both from me and give it to someone else.  When my old things break, more and more my only hope is to find another old thing like it someone is selling used.&lt;/p&gt;\n\n&lt;p&gt;So far I am getting by like this.  But it cannot last forever!  Consider trying to use a 1978 home computer in the modern era: it may still work as it ever did, but you are locked out of a lot of modern life.  It won&amp;#39;t connect to the internet for example.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I was thinking that relative to my friends, the technology I use is becoming more and more old fashioned.\n\nIt's not that I don't *want* to use modern things.  I do!  Problem is there has been a change in who they serve.  Time was, you would buy a gadget to do X, and the gadget's purpose was to do X.  Now, you buy a gadget to do X, but it also *watches everything you do* with or sometimes even near it, and reports that data back \"somewhere\".  Often to many somewheres!  And even more, often its master is not you!  Someone else controls it even after you bought it, and can [shut it off](http://www.businessinsider.com/iot-garage-door-opener-garadget-kills-customers-device-bad-amazon-review-2017-4) or change its behavior or remove features at any time for any reason.\n\nSo I have all this relatively ancient tech I am still using because I cannot find a replacement that isn't designed to rip control of the data or the device or both from me and give it to someone else.  When my old things break, more and more my only hope is to find another old thing like it someone is selling used.\n\nSo far I am getting by like this.  But it cannot last forever!  Consider trying to use a 1978 home computer in the modern era: it may still work as it ever did, but you are locked out of a lot of modern life.  It won't connect to the internet for example.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65rmy5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "Liquid_Reality", "saved": false, "mod_reports": [], "name": "t3_65rmy5", "subreddit_name_prefixed": "r/privacy", "approved_by": null, "over_18": false, "domain": "self.privacy", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhlc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/privacy/comments/65rmy5/technoanachronism/", "num_reports": null, "locked": false, "stickied": false, "created": 1492408171.0, "url": "https://www.reddit.com/r/privacy/comments/65rmy5/technoanachronism/", "author_flair_text": null, "quarantine": false, "title": "techno-anachronism", "created_utc": 1492379371.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhlc", "removal_reason": null, "link_id": "t3_65rmy5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhlc", "removal_reason": null, "link_id": "t3_65rmy5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhlc", "removal_reason": null, "link_id": "t3_65rmy5", "likes": null, "replies": "", "user_reports": [], "id": "dgdve8s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "alreadyburnt", "parent_id": "t1_dgdn2sc", "subreddit_name_prefixed": "r/privacy", "controversiality": 0, "body": "I mostly agree with you in spirit, but I think we must be living somewhat different experiences. My perspective may be colored by it. While I see the *effort* being put forth against the cars(See \"Right to Repair\"), I don't see it happening unless older cars become more restricted. New cars are getting GPS, but used cars change hands privately and from dealerships every day. One could argue that It's pretty easy to buy a 400 dollar used car that doesn't report your GPS coordinates to anyone. Not ideal, but tons of people buy used cars, maybe most?\n\nWith you on the TV's, if we're going with the assumption that the TV's will eventually have the \"smart\" part hard-wired in. But there are some practical differences between Smart TV's and phones that might make that happen slower, at least, which is that smart TV's are more expensive, and non-smart TV's have been behaving like smart TV's for a pretty long time. They have xBoxes and Playstations(Both non-free, admittedly but at least it's a second power cord) that they're already used to using because they are simplified. They have Roku's, which are admittedly tivoized, but I seriously doubt are routinely concealing microphones or GSM hardware. What I'm saying is that I'm skeptical of smart TV adoption in the face of options that are just plain *better for most people right now*. Especially considering how people buy Android-based devices, every couple months, disposably? Very different from the big-screen TV buying pattern.\n\nNow if something that is functionally a smart TV, less a touchscreen if getting up to touch your TV screen is your thing, is possible to \"build\" by adding a trivial appliance to a TV that costs much less that you might already have, then what are the options that give you the most freedom? Well any number of single-board computers would work, or you could use one of the various Android set-top boxes and pack-of-gum sized computers, while they don't seem to apply for RYF status, many of them can be run with only software which would apply. You actually pretty much can build a smart TV, and it's pretty easy, too. Maybe you'll be stuck without Netflix or Hulu, which sucks. EME is really stupid. But you can still use DLNA to serve up any media you have at hand, and that's really all that personal Freedom can guarantee. I can't fix MPAA lawyer's attitudes.\n\nWhat's more, the \"Connect to anything wifi\" strategy is probably untenable. For one thing, most wi-fi networks are already protected or, if they offer a guest network, it's usually a captive portal. Does the TV do DNS tunneling? That seems like it's the sort of thing you could sue the balls off a company for. I'd like to see that, actually. Just for the Schadenfreude. So I figure what they end up doing in the end is negotiating a deal with Comcast to connect to those irritating xFinityWifi hotspots. I'm going to have to look up the case, but I'm pretty sure at least one state in the US has had a court of law affirm a claimant's right to turn off the xFinityWifi hotspot. So like I said, it's not perfect, but there's actually alot more ground on our side than one might think.\n\nOther smart appliances have all kinds of wierd consequences and whether they'll be widely adopted is something that remains to be seen, in my opinion, but if I had to make a prediction about the IOT, it will boom and bust, and the survivors will be the things that don't break and can be trusted not to ~~don't~~ get their owners house burned down. I read a paper on IOT security that used the phrase \"Kinetic Consequences.\" It's going to get worse before it gets better here, and I don't relish the consequences of what's going to happen, but it seems much more likely than anything else to change people's perspectives. House fire does that to people...\n\nThe incorporation of the cell network into everything is indeed disturbing and I don't have a counter-argument for that. I don't know how to take control of that situation at all, except to help build meshlocals and hoard non-cellular devices.", "edited": 1492453158.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mostly agree with you in spirit, but I think we must be living somewhat different experiences. My perspective may be colored by it. While I see the &lt;em&gt;effort&lt;/em&gt; being put forth against the cars(See &amp;quot;Right to Repair&amp;quot;), I don&amp;#39;t see it happening unless older cars become more restricted. New cars are getting GPS, but used cars change hands privately and from dealerships every day. One could argue that It&amp;#39;s pretty easy to buy a 400 dollar used car that doesn&amp;#39;t report your GPS coordinates to anyone. Not ideal, but tons of people buy used cars, maybe most?&lt;/p&gt;\n\n&lt;p&gt;With you on the TV&amp;#39;s, if we&amp;#39;re going with the assumption that the TV&amp;#39;s will eventually have the &amp;quot;smart&amp;quot; part hard-wired in. But there are some practical differences between Smart TV&amp;#39;s and phones that might make that happen slower, at least, which is that smart TV&amp;#39;s are more expensive, and non-smart TV&amp;#39;s have been behaving like smart TV&amp;#39;s for a pretty long time. They have xBoxes and Playstations(Both non-free, admittedly but at least it&amp;#39;s a second power cord) that they&amp;#39;re already used to using because they are simplified. They have Roku&amp;#39;s, which are admittedly tivoized, but I seriously doubt are routinely concealing microphones or GSM hardware. What I&amp;#39;m saying is that I&amp;#39;m skeptical of smart TV adoption in the face of options that are just plain &lt;em&gt;better for most people right now&lt;/em&gt;. Especially considering how people buy Android-based devices, every couple months, disposably? Very different from the big-screen TV buying pattern.&lt;/p&gt;\n\n&lt;p&gt;Now if something that is functionally a smart TV, less a touchscreen if getting up to touch your TV screen is your thing, is possible to &amp;quot;build&amp;quot; by adding a trivial appliance to a TV that costs much less that you might already have, then what are the options that give you the most freedom? Well any number of single-board computers would work, or you could use one of the various Android set-top boxes and pack-of-gum sized computers, while they don&amp;#39;t seem to apply for RYF status, many of them can be run with only software which would apply. You actually pretty much can build a smart TV, and it&amp;#39;s pretty easy, too. Maybe you&amp;#39;ll be stuck without Netflix or Hulu, which sucks. EME is really stupid. But you can still use DLNA to serve up any media you have at hand, and that&amp;#39;s really all that personal Freedom can guarantee. I can&amp;#39;t fix MPAA lawyer&amp;#39;s attitudes.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s more, the &amp;quot;Connect to anything wifi&amp;quot; strategy is probably untenable. For one thing, most wi-fi networks are already protected or, if they offer a guest network, it&amp;#39;s usually a captive portal. Does the TV do DNS tunneling? That seems like it&amp;#39;s the sort of thing you could sue the balls off a company for. I&amp;#39;d like to see that, actually. Just for the Schadenfreude. So I figure what they end up doing in the end is negotiating a deal with Comcast to connect to those irritating xFinityWifi hotspots. I&amp;#39;m going to have to look up the case, but I&amp;#39;m pretty sure at least one state in the US has had a court of law affirm a claimant&amp;#39;s right to turn off the xFinityWifi hotspot. So like I said, it&amp;#39;s not perfect, but there&amp;#39;s actually alot more ground on our side than one might think.&lt;/p&gt;\n\n&lt;p&gt;Other smart appliances have all kinds of wierd consequences and whether they&amp;#39;ll be widely adopted is something that remains to be seen, in my opinion, but if I had to make a prediction about the IOT, it will boom and bust, and the survivors will be the things that don&amp;#39;t break and can be trusted not to &lt;del&gt;don&amp;#39;t&lt;/del&gt; get their owners house burned down. I read a paper on IOT security that used the phrase &amp;quot;Kinetic Consequences.&amp;quot; It&amp;#39;s going to get worse before it gets better here, and I don&amp;#39;t relish the consequences of what&amp;#39;s going to happen, but it seems much more likely than anything else to change people&amp;#39;s perspectives. House fire does that to people...&lt;/p&gt;\n\n&lt;p&gt;The incorporation of the cell network into everything is indeed disturbing and I don&amp;#39;t have a counter-argument for that. I don&amp;#39;t know how to take control of that situation at all, except to help build meshlocals and hoard non-cellular devices.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "privacy", "name": "t1_dgdve8s", "score_hidden": false, "stickied": false, "created": 1492481769.0, "created_utc": 1492452969.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdn2sc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Liquid_Reality", "parent_id": "t1_dgdb6rq", "subreddit_name_prefixed": "r/privacy", "controversiality": 0, "body": "Libreboot and similar are great advice for PC type computers, but another problem also is that this stuff is creeping into other domains where you can't as easily put together your own equipment.\n\nFor example it is getting more difficult to buy an automobile that doesn't report your GPS track back to somewhere.  You can still find one... for now, *if* you do careful research up front.  The trend is clear though, in almost every consumer domain: televisions, fitness trackers, all manner of things.\n\nWith TVs you can not allow it to connect to your local network, but that will stop working very soon if it hasn't already.  New ones search for any open AP, so if if finds *anything* to talk to, you lost.  And many cars and other devices now have their own 3G.  You don't have to \"let\" it do anything: it will connect behind your back.\n\nSo then it's a game of trying to find and disconnect antennas, but that game can only be lost in the end.  It's too easy to design a device that doesn't function if it can't \"phone home\" with your data.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Libreboot and similar are great advice for PC type computers, but another problem also is that this stuff is creeping into other domains where you can&amp;#39;t as easily put together your own equipment.&lt;/p&gt;\n\n&lt;p&gt;For example it is getting more difficult to buy an automobile that doesn&amp;#39;t report your GPS track back to somewhere.  You can still find one... for now, &lt;em&gt;if&lt;/em&gt; you do careful research up front.  The trend is clear though, in almost every consumer domain: televisions, fitness trackers, all manner of things.&lt;/p&gt;\n\n&lt;p&gt;With TVs you can not allow it to connect to your local network, but that will stop working very soon if it hasn&amp;#39;t already.  New ones search for any open AP, so if if finds &lt;em&gt;anything&lt;/em&gt; to talk to, you lost.  And many cars and other devices now have their own 3G.  You don&amp;#39;t have to &amp;quot;let&amp;quot; it do anything: it will connect behind your back.&lt;/p&gt;\n\n&lt;p&gt;So then it&amp;#39;s a game of trying to find and disconnect antennas, but that game can only be lost in the end.  It&amp;#39;s too easy to design a device that doesn&amp;#39;t function if it can&amp;#39;t &amp;quot;phone home&amp;quot; with your data.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "privacy", "name": "t1_dgdn2sc", "score_hidden": false, "stickied": false, "created": 1492472487.0, "created_utc": 1492443687.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdb6rq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "alreadyburnt", "parent_id": "t3_65rmy5", "subreddit_name_prefixed": "r/privacy", "controversiality": 0, "body": "You should support the Libre Hardware, Micro-Manufacturing, Right-to-Repair, Global Meshnet and Free Software(Obviously) movements then. There is quite a bit of good work being done to make general purpose computing that respects the rights of users much more tenable. The work of projects like coreboot and libreboot, eoma68, purism, pirateboxes, get your VPS from the Vikings provider, the various projects to liberate and upstream single-board computer components, 3D printers, et cetera. Looking backward will almost certainly never be the answer(perhaps some conservatism regarding what hardware features you adopt when is warranted, some of us still use Core2 Thinkpads) and expecting things to be perfect will do more harm than good, but these are real things and they make real strides. If you'd like some links I can help you out. [I was just helping a guy with this yesterday](https://www.reddit.com/r/privacytoolsIO/comments/65ht36/looking_to_invest_into_open_source_hardware/).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should support the Libre Hardware, Micro-Manufacturing, Right-to-Repair, Global Meshnet and Free Software(Obviously) movements then. There is quite a bit of good work being done to make general purpose computing that respects the rights of users much more tenable. The work of projects like coreboot and libreboot, eoma68, purism, pirateboxes, get your VPS from the Vikings provider, the various projects to liberate and upstream single-board computer components, 3D printers, et cetera. Looking backward will almost certainly never be the answer(perhaps some conservatism regarding what hardware features you adopt when is warranted, some of us still use Core2 Thinkpads) and expecting things to be perfect will do more harm than good, but these are real things and they make real strides. If you&amp;#39;d like some links I can help you out. &lt;a href=\"https://www.reddit.com/r/privacytoolsIO/comments/65ht36/looking_to_invest_into_open_source_hardware/\"&gt;I was just helping a guy with this yesterday&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "privacy", "name": "t1_dgdb6rq", "score_hidden": false, "stickied": false, "created": 1492450231.0, "created_utc": 1492421431.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhlc", "removal_reason": null, "link_id": "t3_65rmy5", "likes": null, "replies": "", "user_reports": [], "id": "dgdb6ji", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rubdos", "parent_id": "t3_65rmy5", "subreddit_name_prefixed": "r/privacy", "controversiality": 0, "body": "I think you're confusing technology and gadgets. The former, you can mostly use withou a lot of harm,; the latter is known to be a gimmick, and won't last two years.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re confusing technology and gadgets. The former, you can mostly use withou a lot of harm,; the latter is known to be a gimmick, and won&amp;#39;t last two years.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "privacy", "name": "t1_dgdb6ji", "score_hidden": false, "stickied": false, "created": 1492450210.0, "created_utc": 1492421410.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]