[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Battlefield", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;EA&amp;#39;s Battlefront 2 campaign is currently being developed by Motive, and it looks to have a lot more potential than any Battlefield campaign ever had. While the war stories was a good idea, there seemed to be a little laziness on some parts, especially the later stories (nothing is written literally had Sinai desert as a level twice, also only being around 30 minutes long). I just don&amp;#39;t think it&amp;#39;s DICE&amp;#39;s strong point and a dedicated team could do a lot more. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "EA's Battlefront 2 campaign is currently being developed by Motive, and it looks to have a lot more potential than any Battlefield campaign ever had. While the war stories was a good idea, there seemed to be a little laziness on some parts, especially the later stories (nothing is written literally had Sinai desert as a level twice, also only being around 30 minutes long). I just don't think it's DICE's strong point and a dedicated team could do a lot more. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Other", "id": "65qgny", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "DUTCH_DUDES", "saved": false, "mod_reports": [], "name": "t3_65qgny", "subreddit_name_prefixed": "r/Battlefield", "approved_by": null, "over_18": false, "domain": "self.Battlefield", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rdgw", "edited": false, "link_flair_css_class": "other", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Battlefield/comments/65qgny/should_the_next_battlefield_let_a_different/", "num_reports": null, "locked": false, "stickied": false, "created": 1492394721.0, "url": "https://www.reddit.com/r/Battlefield/comments/65qgny/should_the_next_battlefield_let_a_different/", "author_flair_text": null, "quarantine": false, "title": "Should the next Battlefield let a different studio handle the single player?", "created_utc": 1492365921.0, "distinguished": null, "media": null, "upvote_ratio": 0.73, "num_comments": 32, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": "", "user_reports": [], "id": "dgdx22o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheLegendOfCheerios", "parent_id": "t1_dgdqogw", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "I nearly put in the comment if you were referring to 1 but I thought I'd leave it out. Titanfall 1 was a success in terms of sales but the problem was people lost interest with all the other great titles coming out, not to mention the game was overhyped to shit. Fundamentally multiplayer only titles are fine however it's not an excuse to include less content. Just look at Overwatch, one of the most popular multiplayer only games in the world and doesn't have a single player. Single player isn't necessary anymore and the idea that a game HAS to have one to be classed as 'complete' is ridiculous. I'd buy Battlefront 2 regardless of whether it had a single player or not, the fact it does is just a bonus.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I nearly put in the comment if you were referring to 1 but I thought I&amp;#39;d leave it out. Titanfall 1 was a success in terms of sales but the problem was people lost interest with all the other great titles coming out, not to mention the game was overhyped to shit. Fundamentally multiplayer only titles are fine however it&amp;#39;s not an excuse to include less content. Just look at Overwatch, one of the most popular multiplayer only games in the world and doesn&amp;#39;t have a single player. Single player isn&amp;#39;t necessary anymore and the idea that a game HAS to have one to be classed as &amp;#39;complete&amp;#39; is ridiculous. I&amp;#39;d buy Battlefront 2 regardless of whether it had a single player or not, the fact it does is just a bonus.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgdx22o", "score_hidden": false, "stickied": false, "created": 1492483641.0, "created_utc": 1492454841.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqogw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DUTCH_DUDES", "parent_id": "t1_dgdq80u", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "There were other reasons that those games failed yes (btw I'm saying Titanfall 1 not 2, Titanfall 2 is an excellent game with a lot of depth and a great campaign it has plenty of content) but I'm saying that EA experimented with multiplayer only and failed to make a game people were happy with. Therefore I doubt them doing any sort of multiplayer only game for a while just because people now associate \"no single player\" with games like Battlefront and Titanfall and therefore will automatically think it's a bad move. That is why I'm suggesting they just give the singleplayer to another studio while DICE just works on multiplayer so we can actually get a good experience with both aspects. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There were other reasons that those games failed yes (btw I&amp;#39;m saying Titanfall 1 not 2, Titanfall 2 is an excellent game with a lot of depth and a great campaign it has plenty of content) but I&amp;#39;m saying that EA experimented with multiplayer only and failed to make a game people were happy with. Therefore I doubt them doing any sort of multiplayer only game for a while just because people now associate &amp;quot;no single player&amp;quot; with games like Battlefront and Titanfall and therefore will automatically think it&amp;#39;s a bad move. That is why I&amp;#39;m suggesting they just give the singleplayer to another studio while DICE just works on multiplayer so we can actually get a good experience with both aspects. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgdqogw", "score_hidden": false, "stickied": false, "created": 1492476540.0, "created_utc": 1492447740.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdq80u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheLegendOfCheerios", "parent_id": "t1_dgcso5u", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Titanfall and Battlefront didn't 'fail' and even if they did it's not because of a lack of single player. Titanfall 2 was released in an awful window right next to BF1 and Battlefront just lacked content in general, I don't really think a single player would've changed that because most of the complaints were about lack of online content (to be fair offline content as well).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Titanfall and Battlefront didn&amp;#39;t &amp;#39;fail&amp;#39; and even if they did it&amp;#39;s not because of a lack of single player. Titanfall 2 was released in an awful window right next to BF1 and Battlefront just lacked content in general, I don&amp;#39;t really think a single player would&amp;#39;ve changed that because most of the complaints were about lack of online content (to be fair offline content as well).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgdq80u", "score_hidden": false, "stickied": false, "created": 1492476041.0, "created_utc": 1492447241.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcso5u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DUTCH_DUDES", "parent_id": "t1_dgcs2rh", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "I understand games can do this model, I am saying Battlefield doesn't seem to be going into a multiplayer only model, Titanfall and Battlefront tried and failed hard. I don't think EA are up to try it again. So instead of arguing that, how about we actually discuss my idea :). \n\nIf Motive worked on the single player, using all of its resources and time to work on a good 7-9 hour campaign. Meanwhile DICE works solely on multiplayer, making sure we get good progression, depth all the good stuff (with maybe even more maps now that they can devote more resources to it). Wouldn't that be better? And what if they pull off a campaign, what if they reignite the COD 2/Modern Warfare style of campaign where you truly feel like a soldier amongst chaos. So they way I see it, they aren't dropping single player might as well try to make it better.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand games can do this model, I am saying Battlefield doesn&amp;#39;t seem to be going into a multiplayer only model, Titanfall and Battlefront tried and failed hard. I don&amp;#39;t think EA are up to try it again. So instead of arguing that, how about we actually discuss my idea :). &lt;/p&gt;\n\n&lt;p&gt;If Motive worked on the single player, using all of its resources and time to work on a good 7-9 hour campaign. Meanwhile DICE works solely on multiplayer, making sure we get good progression, depth all the good stuff (with maybe even more maps now that they can devote more resources to it). Wouldn&amp;#39;t that be better? And what if they pull off a campaign, what if they reignite the COD 2/Modern Warfare style of campaign where you truly feel like a soldier amongst chaos. So they way I see it, they aren&amp;#39;t dropping single player might as well try to make it better.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcso5u", "score_hidden": false, "stickied": false, "created": 1492416245.0, "created_utc": 1492387445.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcs2rh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vveyro", "parent_id": "t1_dgcrnbh", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "More people will buy it, when it's cheaper. Battlefront II won't have Premium Pass, BF1 has gotten the Premium Friends thing. EA is realizing Premium Pass for game like this is a terrible idea. Other games have moved on to smarter model recently, where game is 60€, maps are free and cosmetic items bring in the extra bucks. If EA is smart, they will follow suit. \n\nRainbow Six goes this route, and that's why it gets larger playerbase every day. BF1 is already having dark clouds over it, players counts are dropping especially on PC because of the Premium Pass extortion. Same as happened with Battlefront. DICE / EA already noticed they aren't doing it the smart way. Cutting expenses by not making single player would save them money, and not lose almost any customers, because nobody I know gets Battlefield games to play them alone.\n\nFair pricing and free maps will keep the game growing over years. Instead of dropping player counts, like now. In the end, it will bring them more money, if the play it smart. Nobody would miss single player, BF audience isn't after it they never were. BF1942 and BF2 didn't have single player at all, both are still played to this very day.", "edited": 1492386895.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;More people will buy it, when it&amp;#39;s cheaper. Battlefront II won&amp;#39;t have Premium Pass, BF1 has gotten the Premium Friends thing. EA is realizing Premium Pass for game like this is a terrible idea. Other games have moved on to smarter model recently, where game is 60€, maps are free and cosmetic items bring in the extra bucks. If EA is smart, they will follow suit. &lt;/p&gt;\n\n&lt;p&gt;Rainbow Six goes this route, and that&amp;#39;s why it gets larger playerbase every day. BF1 is already having dark clouds over it, players counts are dropping especially on PC because of the Premium Pass extortion. Same as happened with Battlefront. DICE / EA already noticed they aren&amp;#39;t doing it the smart way. Cutting expenses by not making single player would save them money, and not lose almost any customers, because nobody I know gets Battlefield games to play them alone.&lt;/p&gt;\n\n&lt;p&gt;Fair pricing and free maps will keep the game growing over years. Instead of dropping player counts, like now. In the end, it will bring them more money, if the play it smart. Nobody would miss single player, BF audience isn&amp;#39;t after it they never were. BF1942 and BF2 didn&amp;#39;t have single player at all, both are still played to this very day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcs2rh", "score_hidden": false, "stickied": false, "created": 1492415429.0, "created_utc": 1492386629.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrnbh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DUTCH_DUDES", "parent_id": "t1_dgcqkf3", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "I understand your point of view, but you got to think about EAs perspective here (in all honesty I'm ok with just multiplayer) but Battlefield has new fans that are aren't familiar with a only multiplayer type of Battlefield. A price cut will get extreme backlash, not from the BF veteran community (although I think some would still as I doubt any mod support would be included so they would complain there), but from the widely more popular casual crowd that EA sells to. It could see it already on the top of /r/gaming, \"EA cuts single player from Battlefield\" with people complaining how \"EA is at it again, nickel and diming us to get more money.\" It's something they would definitely not want (look towards Star Wars Battlefront as a good example, a lot of backlash for no singleplayer and that was way before we learned the game had no depth). \n\nWhat I propose is to start making good campaigns by outsourcing it to a EA studio that can make campaigns, meanwhile DICE can improve more on the multiplayer. The way I see it is the campaign is here to stay so why not actually make it good. ", "edited": 1492388503.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand your point of view, but you got to think about EAs perspective here (in all honesty I&amp;#39;m ok with just multiplayer) but Battlefield has new fans that are aren&amp;#39;t familiar with a only multiplayer type of Battlefield. A price cut will get extreme backlash, not from the BF veteran community (although I think some would still as I doubt any mod support would be included so they would complain there), but from the widely more popular casual crowd that EA sells to. It could see it already on the top of &lt;a href=\"/r/gaming\"&gt;/r/gaming&lt;/a&gt;, &amp;quot;EA cuts single player from Battlefield&amp;quot; with people complaining how &amp;quot;EA is at it again, nickel and diming us to get more money.&amp;quot; It&amp;#39;s something they would definitely not want (look towards Star Wars Battlefront as a good example, a lot of backlash for no singleplayer and that was way before we learned the game had no depth). &lt;/p&gt;\n\n&lt;p&gt;What I propose is to start making good campaigns by outsourcing it to a EA studio that can make campaigns, meanwhile DICE can improve more on the multiplayer. The way I see it is the campaign is here to stay so why not actually make it good. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcrnbh", "score_hidden": false, "stickied": false, "created": 1492414853.0, "created_utc": 1492386053.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": "", "user_reports": [], "id": "dgcu2pv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Plogplast", "parent_id": "t1_dgcqkf3", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "I bought bf4 for the single player now \"burn those mother fuckers\"\nAnd honestly it's not like they're developing at a lose they'll still make money even if they just develop a story mode for a while that's actually the express purpose they added the ability to buy battle packs. As a sort of backup in case they wanna spend extra time developing a part of the game instead of just churning out map packs and dlc", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I bought bf4 for the single player now &amp;quot;burn those mother fuckers&amp;quot;\nAnd honestly it&amp;#39;s not like they&amp;#39;re developing at a lose they&amp;#39;ll still make money even if they just develop a story mode for a while that&amp;#39;s actually the express purpose they added the ability to buy battle packs. As a sort of backup in case they wanna spend extra time developing a part of the game instead of just churning out map packs and dlc&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcu2pv", "score_hidden": false, "stickied": false, "created": 1492418147.0, "created_utc": 1492389347.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqkf3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vveyro", "parent_id": "t1_dgclmyl", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 1, "body": "SP never was big component of Battlefield. Nobody got BF4 for campaign, have you played it? It's beyond terrible. People hated it, critics hated it, people struggled through the shit just to unlock P90 and M249. Then never looked back.\n\nBig component for some games, for people who play Battlefield not at all. It's multiplayer only game, disguised to have SP element. Audience would be prepared for it, because it's multiplayer gamers mostly. It would make it better, because that money and time could be used to polish the Multiplayer, that everyone came in for. Add few extra maps, for free. For example. Use more time polishing map balance. And then just sell it 60-70€ a piece, like normal game, not pretending it's more than just multiplayer game.", "edited": 1492384784.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;SP never was big component of Battlefield. Nobody got BF4 for campaign, have you played it? It&amp;#39;s beyond terrible. People hated it, critics hated it, people struggled through the shit just to unlock P90 and M249. Then never looked back.&lt;/p&gt;\n\n&lt;p&gt;Big component for some games, for people who play Battlefield not at all. It&amp;#39;s multiplayer only game, disguised to have SP element. Audience would be prepared for it, because it&amp;#39;s multiplayer gamers mostly. It would make it better, because that money and time could be used to polish the Multiplayer, that everyone came in for. Add few extra maps, for free. For example. Use more time polishing map balance. And then just sell it 60-70€ a piece, like normal game, not pretending it&amp;#39;s more than just multiplayer game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcqkf3", "score_hidden": false, "stickied": false, "created": 1492413398.0, "created_utc": 1492384598.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": "", "user_reports": [], "id": "dgdhr4n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DUTCH_DUDES", "parent_id": "t1_dgdcnuv", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Again, I literally say a different studio should tackle the singleplayer so DICE doesn't waste resources on it, they aren't going to get rid of it so they might as well make it better. And also again Overwatch is made for a different market, it's competitive and has a big esports crowd they don't get as much backlash because that market,they fit into the CSGO, Overwatch, and somewhat Rainbow Six Siege (I say that because they still received some backlash before launch but it picked up competitively during its lifespan) type of games, they don't care for it. However the majority of the Battlefield crowd  does, the same people who play Battlefield pick up games like Battlefront, Titanfall, Call of Duty etc. Now Titanfall and Battlefront already tried the only multiplayer route and failed miserably, they got extreme backlash. \n\nSo what I am saying is its not going to go away, why not make it better. Two different studios can make the game better. Motive on the singleplayer, which has huge potential with the Frostbite engine. DICE only on multiplayer, which means they can work on more maps and add in some needed things in time for launch (look at RSP for BF1). It is a compromise and the only one we will get that could make the game better. They will not take singleplayer out, might as well make it better. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Again, I literally say a different studio should tackle the singleplayer so DICE doesn&amp;#39;t waste resources on it, they aren&amp;#39;t going to get rid of it so they might as well make it better. And also again Overwatch is made for a different market, it&amp;#39;s competitive and has a big esports crowd they don&amp;#39;t get as much backlash because that market,they fit into the CSGO, Overwatch, and somewhat Rainbow Six Siege (I say that because they still received some backlash before launch but it picked up competitively during its lifespan) type of games, they don&amp;#39;t care for it. However the majority of the Battlefield crowd  does, the same people who play Battlefield pick up games like Battlefront, Titanfall, Call of Duty etc. Now Titanfall and Battlefront already tried the only multiplayer route and failed miserably, they got extreme backlash. &lt;/p&gt;\n\n&lt;p&gt;So what I am saying is its not going to go away, why not make it better. Two different studios can make the game better. Motive on the singleplayer, which has huge potential with the Frostbite engine. DICE only on multiplayer, which means they can work on more maps and add in some needed things in time for launch (look at RSP for BF1). It is a compromise and the only one we will get that could make the game better. They will not take singleplayer out, might as well make it better. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgdhr4n", "score_hidden": false, "stickied": false, "created": 1492465567.0, "created_utc": 1492436767.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdcnuv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Collic001", "parent_id": "t1_dgclmyl", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "It will make it better because that dev time can make the important part - the multiplayer - better. A short 7 hour campaign is wasted resources. The SP has never been good. It's not the games focus and never has been, better to cut it and give us all a  MP that has more time and money spent on it.\n\nYou don't see Overwatch shoe-horning in a lackluster SP element. Battlefield doesn't have to either and they shouldn't. It's existence is evidence of a lack of confidence in their own product, and likely external publisher pressure, nothing more.", "edited": 1492426608.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It will make it better because that dev time can make the important part - the multiplayer - better. A short 7 hour campaign is wasted resources. The SP has never been good. It&amp;#39;s not the games focus and never has been, better to cut it and give us all a  MP that has more time and money spent on it.&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t see Overwatch shoe-horning in a lackluster SP element. Battlefield doesn&amp;#39;t have to either and they shouldn&amp;#39;t. It&amp;#39;s existence is evidence of a lack of confidence in their own product, and likely external publisher pressure, nothing more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgdcnuv", "score_hidden": false, "stickied": false, "created": 1492455073.0, "created_utc": 1492426273.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgclmyl", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "DUTCH_DUDES", "parent_id": "t1_dgcjplt", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Ok there seems to be a lot of good BF vets here but I fail to see why taking away a big component of a game will somehow make it better. It's clear DICE will never bring back Mod support or custom maps, and like I say in my post I'm proposing another studio works on singleplayer (to actually make it good) while DICE focuses on multiplayer and doesn't have to worry about cocking up singleplayer. It's a good comprise and way better than just \"don't make one\" in my opinion", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok there seems to be a lot of good BF vets here but I fail to see why taking away a big component of a game will somehow make it better. It&amp;#39;s clear DICE will never bring back Mod support or custom maps, and like I say in my post I&amp;#39;m proposing another studio works on singleplayer (to actually make it good) while DICE focuses on multiplayer and doesn&amp;#39;t have to worry about cocking up singleplayer. It&amp;#39;s a good comprise and way better than just &amp;quot;don&amp;#39;t make one&amp;quot; in my opinion&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgclmyl", "score_hidden": false, "stickied": false, "created": 1492406738.0, "created_utc": 1492377938.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": "", "user_reports": [], "id": "dgcth4h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vveyro", "parent_id": "t1_dgct4r4", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Yeah, but BF1 cost 120€ at release, if you wanted the Full multiplayer experience (Premium). 16 DLC maps locked behind paywall. \n\nHow that is any more justified price tag, when the SP campaign lasts about 4-5 hours. (Took me 4,5 hours on hardest difficulty, never touched it again). I have R6 Siege too, even when it was 60€ MP-only game, I've had a lot more fun with it than BF1 Ultimate Edition tbh... that game has just so much depth, SP would never offer depth like that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, but BF1 cost 120€ at release, if you wanted the Full multiplayer experience (Premium). 16 DLC maps locked behind paywall. &lt;/p&gt;\n\n&lt;p&gt;How that is any more justified price tag, when the SP campaign lasts about 4-5 hours. (Took me 4,5 hours on hardest difficulty, never touched it again). I have R6 Siege too, even when it was 60€ MP-only game, I&amp;#39;ve had a lot more fun with it than BF1 Ultimate Edition tbh... that game has just so much depth, SP would never offer depth like that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcth4h", "score_hidden": false, "stickied": false, "created": 1492417337.0, "created_utc": 1492388537.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgct4r4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BlindSpider11", "parent_id": "t1_dgcsy7v", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "I personally want a campaign with my $59.99 games, if they lack one I have a very hard time justifying that price tag. Even if I only play the campaign once, at least it's there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I personally want a campaign with my $59.99 games, if they lack one I have a very hard time justifying that price tag. Even if I only play the campaign once, at least it&amp;#39;s there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgct4r4", "score_hidden": false, "stickied": false, "created": 1492416885.0, "created_utc": 1492388085.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcsy7v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vveyro", "parent_id": "t1_dgcseuc", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Just look at CS:GO and R6 Siege. Siege (released 2015) has more PC players right now playing than Battlefield 1. And R6 playerbase is actually growing rapidly.\n\nTitanfall 1 and Battlefront didn't fail because of MP-Only. But because of lack of content / ridiculous business model (Premium Pass that kills the DLCs), and in Battlefronts case, boring and casual gameplay with no depth.\n\nWhy would people be hesitant? They got BF1. Seriously, BF1 campaign lasts 4-5 hours? Are you telling me that this mini-campaign was massive reason for BF1 selling? Some people gladly dished out 120€ for Ultimate Edition, despite the campaign being that short? They paid 120€ for essentially multiplayer only game. That's exactly what BF1 is. Multiplayer Only game, that costs 2x the price of normal AAA game. Stop kidding yourself, only reason they can sell it for 120€ is because they can say \"Oh, but it has single player too!\"", "edited": 1492388348.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just look at CS:GO and R6 Siege. Siege (released 2015) has more PC players right now playing than Battlefield 1. And R6 playerbase is actually growing rapidly.&lt;/p&gt;\n\n&lt;p&gt;Titanfall 1 and Battlefront didn&amp;#39;t fail because of MP-Only. But because of lack of content / ridiculous business model (Premium Pass that kills the DLCs), and in Battlefronts case, boring and casual gameplay with no depth.&lt;/p&gt;\n\n&lt;p&gt;Why would people be hesitant? They got BF1. Seriously, BF1 campaign lasts 4-5 hours? Are you telling me that this mini-campaign was massive reason for BF1 selling? Some people gladly dished out 120€ for Ultimate Edition, despite the campaign being that short? They paid 120€ for essentially multiplayer only game. That&amp;#39;s exactly what BF1 is. Multiplayer Only game, that costs 2x the price of normal AAA game. Stop kidding yourself, only reason they can sell it for 120€ is because they can say &amp;quot;Oh, but it has single player too!&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcsy7v", "score_hidden": false, "stickied": false, "created": 1492416636.0, "created_utc": 1492387836.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcseuc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BlindSpider11", "parent_id": "t1_dgcjplt", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Why? A lot of people like campaigns in games, even Battlefield campaigns. \n\nPlus if it's just the multiplayer a lot of players will be hesitant to even purchase the game, just look at the first Titanfall and Battlefront...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why? A lot of people like campaigns in games, even Battlefield campaigns. &lt;/p&gt;\n\n&lt;p&gt;Plus if it&amp;#39;s just the multiplayer a lot of players will be hesitant to even purchase the game, just look at the first Titanfall and Battlefront...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcseuc", "score_hidden": false, "stickied": false, "created": 1492415885.0, "created_utc": 1492387085.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": "", "user_reports": [], "id": "dgcjtug", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Lunch_Boxx", "parent_id": "t1_dgcjplt", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "And they should start making the game $40 ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And they should start making the game $40 &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcjtug", "score_hidden": false, "stickied": false, "created": 1492404377.0, "created_utc": 1492375577.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": "", "user_reports": [], "id": "dgd1qik", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ssoxton7", "parent_id": "t1_dgcjplt", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "What? Just give up on single player? No! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What? Just give up on single player? No! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgd1qik", "score_hidden": false, "stickied": false, "created": 1492428639.0, "created_utc": 1492399839.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjplt", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "vveyro", "parent_id": "t3_65qgny", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "They should not make single player.. quite simply. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They should not make single player.. quite simply. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcjplt", "score_hidden": false, "stickied": false, "created": 1492404228.0, "created_utc": 1492375428.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": "", "user_reports": [], "id": "dgcf371", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DUTCH_DUDES", "parent_id": "t1_dgcewl7", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Yes I have, however that's it's own thing. It doesn't fit into the main Battlefield's tone. The campaigns are way to short for any AAA game, especially now that Battlefield is EAs front runner. A well thought out single player would really \"complete the game\" said f you know what I mean. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes I have, however that&amp;#39;s it&amp;#39;s own thing. It doesn&amp;#39;t fit into the main Battlefield&amp;#39;s tone. The campaigns are way to short for any AAA game, especially now that Battlefield is EAs front runner. A well thought out single player would really &amp;quot;complete the game&amp;quot; said f you know what I mean. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcf371", "score_hidden": false, "stickied": false, "created": 1492398218.0, "created_utc": 1492369418.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcewl7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Klyox", "parent_id": "t3_65qgny", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Have you ever even played the bad company series?\n\n&gt; and it looks to have a lot more potential than any Battlefield campaign ever had.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you ever even played the bad company series?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;and it looks to have a lot more potential than any Battlefield campaign ever had.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcewl7", "score_hidden": false, "stickied": false, "created": 1492397974.0, "created_utc": 1492369174.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": "", "user_reports": [], "id": "dgcscft", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "r4pt0r_SPQR", "parent_id": "t3_65qgny", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "BF needs to go back to 1942's singleplayer.\n\nMultiplayer but with only bots.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;BF needs to go back to 1942&amp;#39;s singleplayer.&lt;/p&gt;\n\n&lt;p&gt;Multiplayer but with only bots.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcscft", "score_hidden": false, "stickied": false, "created": 1492415794.0, "created_utc": 1492386994.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": "", "user_reports": [], "id": "dgd468o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nayhem_jr", "parent_id": "t3_65qgny", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Not sure that it matters who actually does it, but until it happens, singleplayer is just another generic shooter. Too many times it still feels like you're the only one with a stake in the action, when it should feel like everyone has their own goals in mind but you're the one who can make things happen.\n\nI'm gonna keep preaching that the bot AI needs to be more diverse, and that many more cues should be taken from multiplayer—squadwork, tactical use of destruction, unconventional use of gadgets.\n\nBF3 had one defense-minded section part of a mission. BF1 had a few flag-capture points. Now how about some back-and-forth? No one complains about playing the same map in conquest for 30 minutes, with flags changing hands all throughout. Maybe your first objective is made to sound like cakewalk, but the enemy actually throws whole battalions after you, turning an easy mission into desperate attrition.\n\nBF4 toyed a bit with squadmates you could order to suppress. Now how about tossing me some bandages when I'm hurt, asking for ammo I can provide, spotting targets for the minimap, reviving? Maybe have a separate squad be in charge of achieving objectives, while we provide cover and open routes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not sure that it matters who actually does it, but until it happens, singleplayer is just another generic shooter. Too many times it still feels like you&amp;#39;re the only one with a stake in the action, when it should feel like everyone has their own goals in mind but you&amp;#39;re the one who can make things happen.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m gonna keep preaching that the bot AI needs to be more diverse, and that many more cues should be taken from multiplayer—squadwork, tactical use of destruction, unconventional use of gadgets.&lt;/p&gt;\n\n&lt;p&gt;BF3 had one defense-minded section part of a mission. BF1 had a few flag-capture points. Now how about some back-and-forth? No one complains about playing the same map in conquest for 30 minutes, with flags changing hands all throughout. Maybe your first objective is made to sound like cakewalk, but the enemy actually throws whole battalions after you, turning an easy mission into desperate attrition.&lt;/p&gt;\n\n&lt;p&gt;BF4 toyed a bit with squadmates you could order to suppress. Now how about tossing me some bandages when I&amp;#39;m hurt, asking for ammo I can provide, spotting targets for the minimap, reviving? Maybe have a separate squad be in charge of achieving objectives, while we provide cover and open routes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgd468o", "score_hidden": false, "stickied": false, "created": 1492432575.0, "created_utc": 1492403775.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65qgny", "likes": null, "replies": "", "user_reports": [], "id": "dgct58c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DUTCH_DUDES", "parent_id": "t1_dgcslnr", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "The key difference here is that your a BF veteran, who remembers the multiplayer only Battlefield. I know that the multiplayer is the meat and potatoes of the game but (and you already probably know this) they aren't trying to sell the game to *you* (meaning older BF veterans). They keep single player to get the causal crowd, the one time battlefielders that just bought BF1 because it went \"backwards instead of forwards in time.\" I know the single player sucks and I know the subreddit crowd doesn't play it but it's not meant for you. I'm sorry but with Titanfall and Battlefront already trying the multiplayer only route and  failing hard (extreme backlash) I don't see EA trying again. I'm just looking at it with a realistic outlook, it doesn't mean I wouldn't want a cheaper multiplayer only game, it just looks like it currently won't happen. So what I'm saying is why not try to actually make the campaign good by giving it to another studio while DICE just focuses on multiplayer like they are doing in Battlefront 2. For once it could actually be good and that is better than a half assed attempt right? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The key difference here is that your a BF veteran, who remembers the multiplayer only Battlefield. I know that the multiplayer is the meat and potatoes of the game but (and you already probably know this) they aren&amp;#39;t trying to sell the game to &lt;em&gt;you&lt;/em&gt; (meaning older BF veterans). They keep single player to get the causal crowd, the one time battlefielders that just bought BF1 because it went &amp;quot;backwards instead of forwards in time.&amp;quot; I know the single player sucks and I know the subreddit crowd doesn&amp;#39;t play it but it&amp;#39;s not meant for you. I&amp;#39;m sorry but with Titanfall and Battlefront already trying the multiplayer only route and  failing hard (extreme backlash) I don&amp;#39;t see EA trying again. I&amp;#39;m just looking at it with a realistic outlook, it doesn&amp;#39;t mean I wouldn&amp;#39;t want a cheaper multiplayer only game, it just looks like it currently won&amp;#39;t happen. So what I&amp;#39;m saying is why not try to actually make the campaign good by giving it to another studio while DICE just focuses on multiplayer like they are doing in Battlefront 2. For once it could actually be good and that is better than a half assed attempt right? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgct58c", "score_hidden": false, "stickied": false, "created": 1492416902.0, "created_utc": 1492388102.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcslnr", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "vveyro", "parent_id": "t1_dgcs8n7", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "All of my 100 Battlelog friends have at least 600-700 hours in multiplayer. Most have over 1000. All of them are rank 140 by now.  Everyone hated the single player and hasn't touched it since 2013 when game released. Nobody thinks \"Gee, tough day at work, free evening yay... finally can fire up BF4 single player again, and see those epic cutscenes!\" \n\nMany of them got BF1, but are now back to BF4. Not to play single player, but to play multiplayer. Your argument about casual makes no sense. People play BF4 today for multiplayer, killing AI enemies will never compare to killing human enemies. Casual or non-casual.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All of my 100 Battlelog friends have at least 600-700 hours in multiplayer. Most have over 1000. All of them are rank 140 by now.  Everyone hated the single player and hasn&amp;#39;t touched it since 2013 when game released. Nobody thinks &amp;quot;Gee, tough day at work, free evening yay... finally can fire up BF4 single player again, and see those epic cutscenes!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Many of them got BF1, but are now back to BF4. Not to play single player, but to play multiplayer. Your argument about casual makes no sense. People play BF4 today for multiplayer, killing AI enemies will never compare to killing human enemies. Casual or non-casual.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcslnr", "score_hidden": false, "stickied": false, "created": 1492416149.0, "created_utc": 1492387349.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcs8n7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DUTCH_DUDES", "parent_id": "t1_dgcrmwf", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "&gt; Casual, competitive.. totally irrelevant.\n\nIt is completely relevant. The only reason people play CSGO so much is because if it's competitive multiplayer, their audience does not care for single player. Meanwhile the causal crowd does because they enjoy couch play, so games like titanfall 1 (even with a price reduction) and Battlefront get massive backlash for no singleplayer. \n\n&gt; Why would people be \"pissed off\", if they don't have to pay for short and crappy campaign they play once, and pay 40-50€ less?\n\nAgain **you** wouldn't but we see with examples (Battlefront and titanfall) that a lot of other people will. You can't just say they wouldn't because there is clear evidence that people will! I understand that no one cares for DICE's single player and only play multiplayer but they half ass it on purpose. Because the comfort of it being included will make people buy and play there game, even with a price reduction there are a lot of people who won't purchase solely for the fact that they are only getting \"half an experience.\" \n\nSo I propose an idea to actually make the single player that DICE includes (and I see no evidence they are just going to stop making them) an actually good campaign by outsourcing to a studio that can focus all of its resources on making it. Meanwhile DICE focuses all of its resources to make multiplayer better. This is currently happening in Battlefront 2 and if successful I think it's better than what we have now and more realistic then them dropping it (because you and I both know they aren't going to). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Casual, competitive.. totally irrelevant.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It is completely relevant. The only reason people play CSGO so much is because if it&amp;#39;s competitive multiplayer, their audience does not care for single player. Meanwhile the causal crowd does because they enjoy couch play, so games like titanfall 1 (even with a price reduction) and Battlefront get massive backlash for no singleplayer. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Why would people be &amp;quot;pissed off&amp;quot;, if they don&amp;#39;t have to pay for short and crappy campaign they play once, and pay 40-50€ less?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Again &lt;strong&gt;you&lt;/strong&gt; wouldn&amp;#39;t but we see with examples (Battlefront and titanfall) that a lot of other people will. You can&amp;#39;t just say they wouldn&amp;#39;t because there is clear evidence that people will! I understand that no one cares for DICE&amp;#39;s single player and only play multiplayer but they half ass it on purpose. Because the comfort of it being included will make people buy and play there game, even with a price reduction there are a lot of people who won&amp;#39;t purchase solely for the fact that they are only getting &amp;quot;half an experience.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;So I propose an idea to actually make the single player that DICE includes (and I see no evidence they are just going to stop making them) an actually good campaign by outsourcing to a studio that can focus all of its resources on making it. Meanwhile DICE focuses all of its resources to make multiplayer better. This is currently happening in Battlefront 2 and if successful I think it&amp;#39;s better than what we have now and more realistic then them dropping it (because you and I both know they aren&amp;#39;t going to). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcs8n7", "score_hidden": false, "stickied": false, "created": 1492415650.0, "created_utc": 1492386850.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrmwf", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "vveyro", "parent_id": "t1_dgcr5fj", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Casual, competitive.. totally irrelevant. Both have audience consisting of largely multiplayer gamers. Who are interested only in multiplayer. No matter if they are \"casual\". Why would people be \"pissed off\", if they don't have to pay for short and crappy campaign they play once, and pay 40-50€ less?\n\nSome idiots will be mad, who cares. Majority will welcome it, if the price is cheaper. Some idiots were mad about Rainbow Six Siege not having SP campaign too (And R6 always had EXCELLENT single player, unlike BF), look at where the game is now. Major success, more players on PC than Battlefield 1 and growing, game that was released in 2015.", "edited": 1492386370.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Casual, competitive.. totally irrelevant. Both have audience consisting of largely multiplayer gamers. Who are interested only in multiplayer. No matter if they are &amp;quot;casual&amp;quot;. Why would people be &amp;quot;pissed off&amp;quot;, if they don&amp;#39;t have to pay for short and crappy campaign they play once, and pay 40-50€ less?&lt;/p&gt;\n\n&lt;p&gt;Some idiots will be mad, who cares. Majority will welcome it, if the price is cheaper. Some idiots were mad about Rainbow Six Siege not having SP campaign too (And R6 always had EXCELLENT single player, unlike BF), look at where the game is now. Major success, more players on PC than Battlefield 1 and growing, game that was released in 2015.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcrmwf", "score_hidden": false, "stickied": false, "created": 1492414839.0, "created_utc": 1492386039.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcr5fj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DUTCH_DUDES", "parent_id": "t1_dgcqhga", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Overwatch was clearly going the competitive route (classed almost like a MOBA but in FPS form), it's along the lines of CSGO where it would be become very popular in Esports. Battlefield is very casual compared to CSGO and Overwatch, it's target audience is the causal player, not the competitive kind. Because of that I think a lot more people would be pissed off if they removed the single player. I know you would think it was OK if they just dropped the price to $40 but it will get a lot of people mad. Look at titanfall 1, same type of deal, it was skill based shooter that rewarded skill but didn't have a single player. Even with the price reduction it still was thought negatively upon in the reviews. I just don't think it will work for Battlefield. \n\nAnd again listen to my idea, Motive can work on a good campaign that fits the series (along the lines of COD 2) without putting any strain on DICE to make one half assed attempt. Why wouldn't it fit the series, it is literally about being in a war, working as a team. They could easily make a single player incorporating those elements  and I think a lot of people would play (and be happy) it if they did it right. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Overwatch was clearly going the competitive route (classed almost like a MOBA but in FPS form), it&amp;#39;s along the lines of CSGO where it would be become very popular in Esports. Battlefield is very casual compared to CSGO and Overwatch, it&amp;#39;s target audience is the causal player, not the competitive kind. Because of that I think a lot more people would be pissed off if they removed the single player. I know you would think it was OK if they just dropped the price to $40 but it will get a lot of people mad. Look at titanfall 1, same type of deal, it was skill based shooter that rewarded skill but didn&amp;#39;t have a single player. Even with the price reduction it still was thought negatively upon in the reviews. I just don&amp;#39;t think it will work for Battlefield. &lt;/p&gt;\n\n&lt;p&gt;And again listen to my idea, Motive can work on a good campaign that fits the series (along the lines of COD 2) without putting any strain on DICE to make one half assed attempt. Why wouldn&amp;#39;t it fit the series, it is literally about being in a war, working as a team. They could easily make a single player incorporating those elements  and I think a lot of people would play (and be happy) it if they did it right. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcr5fj", "score_hidden": false, "stickied": false, "created": 1492414198.0, "created_utc": 1492385398.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqhga", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "vveyro", "parent_id": "t1_dgclfrt", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Overwatch was attracting different audience how. BF always attracted primarily multiplayer gamers. If it didn't have multiplayer, nobody would buy it.\n\nAnd what makes you think future BF without single player would cost same as BF1 did? That's exactly the point, removing SP so they can't use it as excuse to ask 120€ for it. When people only play multiplayer anyway.", "edited": 1492385168.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Overwatch was attracting different audience how. BF always attracted primarily multiplayer gamers. If it didn&amp;#39;t have multiplayer, nobody would buy it.&lt;/p&gt;\n\n&lt;p&gt;And what makes you think future BF without single player would cost same as BF1 did? That&amp;#39;s exactly the point, removing SP so they can&amp;#39;t use it as excuse to ask 120€ for it. When people only play multiplayer anyway.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcqhga", "score_hidden": false, "stickied": false, "created": 1492413285.0, "created_utc": 1492384485.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgclfrt", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "DUTCH_DUDES", "parent_id": "t1_dgcjvi2", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Well I know for a fact people complained about no singleplayer in Rainbow Six, Overwatch was attracting a different audience and was cheaper. Those are way more competitive style types of games as well, it's clear DICE try's to keep the BF crowd happy while attracting the casual crowd as well, they tend to demand single player (look at Battlefront and Titanfall 1 as good examples of this) \n\n&gt; It's clear that DICE aren't talented in making SP games, and they really shouldn't. Nobody will miss their shitty campaigns. \n\nMy post literally says another studio should take charge of handling singleplayer, while DICE should focus on multiplayer. Therefore both aspects have more depth and are better for release. \n\n&gt; if anything sales will go up, when people don't have to pay for something they never wanted.\n\nI'm sorry but that logic just doesn't make any sense to me. I'm absolutely sure any consumer prefers more content over less (in a sense of depth not bloating like BF4). There are very few people who would be happy taking away a single player. To them it shows laziness (and for good reason), they think \"why should I buy this game when it isn't complete.\" Again look at Battlefront and Titanfall as good examples. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I know for a fact people complained about no singleplayer in Rainbow Six, Overwatch was attracting a different audience and was cheaper. Those are way more competitive style types of games as well, it&amp;#39;s clear DICE try&amp;#39;s to keep the BF crowd happy while attracting the casual crowd as well, they tend to demand single player (look at Battlefront and Titanfall 1 as good examples of this) &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s clear that DICE aren&amp;#39;t talented in making SP games, and they really shouldn&amp;#39;t. Nobody will miss their shitty campaigns. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;My post literally says another studio should take charge of handling singleplayer, while DICE should focus on multiplayer. Therefore both aspects have more depth and are better for release. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;if anything sales will go up, when people don&amp;#39;t have to pay for something they never wanted.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m sorry but that logic just doesn&amp;#39;t make any sense to me. I&amp;#39;m absolutely sure any consumer prefers more content over less (in a sense of depth not bloating like BF4). There are very few people who would be happy taking away a single player. To them it shows laziness (and for good reason), they think &amp;quot;why should I buy this game when it isn&amp;#39;t complete.&amp;quot; Again look at Battlefront and Titanfall as good examples. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgclfrt", "score_hidden": false, "stickied": false, "created": 1492406475.0, "created_utc": 1492377675.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjvi2", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "vveyro", "parent_id": "t1_dgch6is", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Look at games like Rainbow Six Siege, Overwatch, Playerunknown's Battlegrounds, CS:GO. There is a big market for multiplayer only.  No real Battlefield veteran cares about single player. It's just small sidebonus, tops. In BF4 which still has strong following, it always was just waste of hard disk space. \n\nEven in BF1 single player is very short duration, while better than BF:HL, BF4 and BF3 campaigns. People get BF 100% for multiplayer. \"Look at games like Call of Duty\" yes, but this isn't Call of Duty. CoD always had good SP campaign, it was born as a single player game. Battlefield was born as multiplayer game first and foremost (BF1942, BF2 didn't have single player at all). Even in Bad Company games it wasn't that spectacular (while good for BF campaign), people still got it mainly for Multiplayer.\n\nIt's just waste of resources, you play SP for 5-6 hours and then play 500-600 hours of multiplayer. While making the short SP campaign with all the voice acting and cutscenes costs a fortune, and takes a big slice out of funds/time DICE has to develop it. Complete waste of resources, and it \"justifies\" them charging 120€ for essentially MP only game.\n\nBattlefield is CRYING to be like Rainbow Six Siege or Overwatch, Multiplayer only. It always was. It's clear that DICE aren't talented in making SP games, and they really shouldn't. Nobody will miss their shitty campaigns, if anything sales will go up, when the game can cost 60-70€ like other AAA games and people don't have to pay for something they never wanted.", "edited": 1492385541.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Look at games like Rainbow Six Siege, Overwatch, Playerunknown&amp;#39;s Battlegrounds, CS:GO. There is a big market for multiplayer only.  No real Battlefield veteran cares about single player. It&amp;#39;s just small sidebonus, tops. In BF4 which still has strong following, it always was just waste of hard disk space. &lt;/p&gt;\n\n&lt;p&gt;Even in BF1 single player is very short duration, while better than BF:HL, BF4 and BF3 campaigns. People get BF 100% for multiplayer. &amp;quot;Look at games like Call of Duty&amp;quot; yes, but this isn&amp;#39;t Call of Duty. CoD always had good SP campaign, it was born as a single player game. Battlefield was born as multiplayer game first and foremost (BF1942, BF2 didn&amp;#39;t have single player at all). Even in Bad Company games it wasn&amp;#39;t that spectacular (while good for BF campaign), people still got it mainly for Multiplayer.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just waste of resources, you play SP for 5-6 hours and then play 500-600 hours of multiplayer. While making the short SP campaign with all the voice acting and cutscenes costs a fortune, and takes a big slice out of funds/time DICE has to develop it. Complete waste of resources, and it &amp;quot;justifies&amp;quot; them charging 120€ for essentially MP only game.&lt;/p&gt;\n\n&lt;p&gt;Battlefield is CRYING to be like Rainbow Six Siege or Overwatch, Multiplayer only. It always was. It&amp;#39;s clear that DICE aren&amp;#39;t talented in making SP games, and they really shouldn&amp;#39;t. Nobody will miss their shitty campaigns, if anything sales will go up, when the game can cost 60-70€ like other AAA games and people don&amp;#39;t have to pay for something they never wanted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcjvi2", "score_hidden": false, "stickied": false, "created": 1492404436.0, "created_utc": 1492375636.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgch6is", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "DUTCH_DUDES", "parent_id": "t1_dgcfq25", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "There is a big market for single player, look at games like Call of Duty and Halo, both known for excellent single players and multiplayers, that is why Modern Warfare and Halo 3 are considered classics to this day. I get that Battlefield is not known for their single player nor have earlier games even included one, but I don't see harm in a different studio tackling it? Why is is such a big deal to include one, we already know mod support won't make a comeback so there really won't be any justification to just buy multiplayer. Two different developers could benefit way more than harm, DICE gets to focus on multiplayer and add or improve things they otherwise couldn't because of the development of single player. While Motive (or whomever) focuses  on single player and actually gets a good story and gameplay that would look amazing in the frostbite engine. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is a big market for single player, look at games like Call of Duty and Halo, both known for excellent single players and multiplayers, that is why Modern Warfare and Halo 3 are considered classics to this day. I get that Battlefield is not known for their single player nor have earlier games even included one, but I don&amp;#39;t see harm in a different studio tackling it? Why is is such a big deal to include one, we already know mod support won&amp;#39;t make a comeback so there really won&amp;#39;t be any justification to just buy multiplayer. Two different developers could benefit way more than harm, DICE gets to focus on multiplayer and add or improve things they otherwise couldn&amp;#39;t because of the development of single player. While Motive (or whomever) focuses  on single player and actually gets a good story and gameplay that would look amazing in the frostbite engine. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgch6is", "score_hidden": false, "stickied": false, "created": 1492400966.0, "created_utc": 1492372166.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcfq25", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "ImNotATexan", "parent_id": "t3_65qgny", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "No one cares about single player. This game never had single player and they never should have started giving it one with BC. It's a multiplayer game and they need to recognize that and stop charging $120 for it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No one cares about single player. This game never had single player and they never should have started giving it one with BC. It&amp;#39;s a multiplayer game and they need to recognize that and stop charging $120 for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgcfq25", "score_hidden": false, "stickied": false, "created": 1492399051.0, "created_utc": 1492370251.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}]