[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Battlefield", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For the past 5 months, 99% of community servers have been dead due to 20-player start. &lt;strong&gt;We&amp;#39;ve basically seen an experiment in what happens to Battlefield without community servers, and it&amp;#39;s not pretty. As with Star Wars Battlefront, BF1 had huge initial sales followed by a sharp drop in player numbers.&lt;/strong&gt; Only a year and a half after release, Star Wars Battlefront is already approaching death. BF1 is on a similar trajectory, with the player stats suggesting the game will be on life support within a year or so--sooner for game modes like Operations.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;In contrast to those two games, BF4 has seen an extraordinary amount of longevity.&lt;/strong&gt; After all these years, BF4 still has a decent, steady population. Despite its age and despite selling millions fewer copies, more people play BF4 than play Star Wars Battlefront. Incredibly, BF1 currently has less than double BF4&amp;#39;s population on PC.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Longevity matters because the new business model increasingly relies on DLC, premium, and microtransactions.&lt;/strong&gt; Some people think DICE wants people buy a game and then stop playing so they can get the next game. That&amp;#39;s an outdated view. Today, most gaming companies want players to stick around so they&amp;#39;ll spend money on DLC, premium, and microtransactions. Those take much less time and money than creating a new game from scratch, so they&amp;#39;re very profitable. When people leave a game quickly like Battlefront or BF1, the company loses millions of dollars in potential profits.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Evidence suggests community servers, rather than unlocks and maps, is the answer.&lt;/strong&gt; To be sure, BF1&amp;#39;s DLC release schedule was far too slow and the game lacked unlocks and progression. However, the player stats show a bigger picture: The decline in BF1 player numbers didn&amp;#39;t slow down very much after the release of They Shall Not Pass. As for BF4, its longevity has been maintained years after DICE stopped releasing new content for the game. People finished unlocking everything in BF4 years ago, but they still play; people got new things to unlock in BF1 a few weeks ago, but they&amp;#39;re still leaving.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Why are community servers so good at keeping players playing? Because people are inherently more interested in playing with people they know, even if they&amp;#39;re just acquaintances whose player names they recognize.&lt;/strong&gt; It&amp;#39;s the same principle that made Facebook billions of dollars: People like to download pictures of cats, but they&amp;#39;re far more interested in pictures of cats shared by friends and acquaintances. Battlefield players like to score a kill, but they really like to score a kill and recognize the name of the person they killed.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&amp;quot;Party&amp;quot; systems and friend-joining is never a substitute for a good community server. It&amp;#39;s the difference between people meeting up at the local bar, versus everyone needing to get together into the same van before they go there.&lt;/strong&gt; Not only is a common meeting place more convenient, it also promotes community much more. It allows you to join a wider group of people. Someone might go to the same server as you who isn&amp;#39;t close enough to be one of your friends. Community servers enable people a few degrees of separation further away to join together, adding to the experience.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The benefits of clan-run servers aren&amp;#39;t fully captured by stats of clan membership and clan tags.&lt;/strong&gt; Don&amp;#39;t discount their importance: Only a small percentage of a server&amp;#39;s &amp;quot;regulars&amp;quot; actually belong to the clan that rents the server. The vast majority of players go there because they like the atmosphere and the server ping/settings, and because their friends play there. When a clan server shuts down, it affects far more people than the size of the clan would suggest.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Another reason communities promote longevity: &lt;strong&gt;People buy games and stick with games based on what their friends are playing.&lt;/strong&gt; It&amp;#39;s an even more powerful effect than word-of-mouth advertising. Part of the reason BF4&amp;#39;s player stats are still decent compared to BF1&amp;#39;s is that a lot of people bought BF1 but then returned to BF4, because that was the only game they could play with their friends.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;DICE should avoid trying to copy other games that were more successful in relying on matchmaking systems. For every blockbuster game, there&amp;#39;s a hundred imitations that fail. Battlefield is its own game with its own kind of player. &lt;strong&gt;Every time DICE has tried to copy another franchise, it&amp;#39;s been a disaster.&lt;/strong&gt; DICE tried to copy Team Fortress 2 with Battlefield Heroes, and it failed. DICE tried to copy Grand Theft Auto with Battlefield Hardline, and it failed. DICE succeeds when it&amp;#39;s true to Battlefield&amp;#39;s roots. Let Battlefield be Battlefield. Bring back the community servers!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "For the past 5 months, 99% of community servers have been dead due to 20-player start. **We've basically seen an experiment in what happens to Battlefield without community servers, and it's not pretty. As with Star Wars Battlefront, BF1 had huge initial sales followed by a sharp drop in player numbers.** Only a year and a half after release, Star Wars Battlefront is already approaching death. BF1 is on a similar trajectory, with the player stats suggesting the game will be on life support within a year or so--sooner for game modes like Operations.\n\n&amp;nbsp;\n\n**In contrast to those two games, BF4 has seen an extraordinary amount of longevity.** After all these years, BF4 still has a decent, steady population. Despite its age and despite selling millions fewer copies, more people play BF4 than play Star Wars Battlefront. Incredibly, BF1 currently has less than double BF4's population on PC.\n\n&amp;nbsp;\n\n**Longevity matters because the new business model increasingly relies on DLC, premium, and microtransactions.** Some people think DICE wants people buy a game and then stop playing so they can get the next game. That's an outdated view. Today, most gaming companies want players to stick around so they'll spend money on DLC, premium, and microtransactions. Those take much less time and money than creating a new game from scratch, so they're very profitable. When people leave a game quickly like Battlefront or BF1, the company loses millions of dollars in potential profits.\n\n&amp;nbsp;\n\n**Evidence suggests community servers, rather than unlocks and maps, is the answer.** To be sure, BF1's DLC release schedule was far too slow and the game lacked unlocks and progression. However, the player stats show a bigger picture: The decline in BF1 player numbers didn't slow down very much after the release of They Shall Not Pass. As for BF4, its longevity has been maintained years after DICE stopped releasing new content for the game. People finished unlocking everything in BF4 years ago, but they still play; people got new things to unlock in BF1 a few weeks ago, but they're still leaving.\n\n&amp;nbsp;\n\n**Why are community servers so good at keeping players playing? Because people are inherently more interested in playing with people they know, even if they're just acquaintances whose player names they recognize.** It's the same principle that made Facebook billions of dollars: People like to download pictures of cats, but they're far more interested in pictures of cats shared by friends and acquaintances. Battlefield players like to score a kill, but they really like to score a kill and recognize the name of the person they killed.\n\n&amp;nbsp;\n\n**\"Party\" systems and friend-joining is never a substitute for a good community server. It's the difference between people meeting up at the local bar, versus everyone needing to get together into the same van before they go there.** Not only is a common meeting place more convenient, it also promotes community much more. It allows you to join a wider group of people. Someone might go to the same server as you who isn't close enough to be one of your friends. Community servers enable people a few degrees of separation further away to join together, adding to the experience.\n\n&amp;nbsp;\n\n**The benefits of clan-run servers aren't fully captured by stats of clan membership and clan tags.** Don't discount their importance: Only a small percentage of a server's \"regulars\" actually belong to the clan that rents the server. The vast majority of players go there because they like the atmosphere and the server ping/settings, and because their friends play there. When a clan server shuts down, it affects far more people than the size of the clan would suggest.\n\n&amp;nbsp;\n\nAnother reason communities promote longevity: **People buy games and stick with games based on what their friends are playing.** It's an even more powerful effect than word-of-mouth advertising. Part of the reason BF4's player stats are still decent compared to BF1's is that a lot of people bought BF1 but then returned to BF4, because that was the only game they could play with their friends.\n\n&amp;nbsp;\n\nDICE should avoid trying to copy other games that were more successful in relying on matchmaking systems. For every blockbuster game, there's a hundred imitations that fail. Battlefield is its own game with its own kind of player. **Every time DICE has tried to copy another franchise, it's been a disaster.** DICE tried to copy Team Fortress 2 with Battlefield Heroes, and it failed. DICE tried to copy Grand Theft Auto with Battlefield Hardline, and it failed. DICE succeeds when it's true to Battlefield's roots. Let Battlefield be Battlefield. Bring back the community servers!\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Battlefield 1", "id": "65sufg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 23, "report_reasons": null, "author": "netticon", "saved": false, "mod_reports": [], "name": "t3_65sufg", "subreddit_name_prefixed": "r/Battlefield", "approved_by": null, "over_18": false, "domain": "self.Battlefield", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rdgw", "edited": false, "link_flair_css_class": "bf1", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Battlefield/comments/65sufg/bf1_supporting_community_servers_is_the_best_way/", "num_reports": null, "locked": false, "stickied": false, "created": 1492422937.0, "url": "https://www.reddit.com/r/Battlefield/comments/65sufg/bf1_supporting_community_servers_is_the_best_way/", "author_flair_text": null, "quarantine": false, "title": "[BF1] Supporting community servers is the best way for DICE to improve BF1's longevity and make more money.", "created_utc": 1492394137.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65sufg", "likes": null, "replies": "", "user_reports": [], "id": "dgd5k1w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "LTSarc", "parent_id": "t3_65sufg", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "I support the idea, but is it not too late? I know R6 Siege recovered, but that was with massive discounts and lots of free weekends - and it's the odd one out. \n\nThe player base is declining to near terminal levels on many game modes, and when I am on playing with them, most of those who are left are fed up with the game and are only still going in hopes of fixes. Considering the time it'll take to implement fixes, it's quite likely that those people are going to leave anyhow. \n\nI fear BF1 is going to go down in textbooks as an example of how not to manage post-launch support.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I support the idea, but is it not too late? I know R6 Siege recovered, but that was with massive discounts and lots of free weekends - and it&amp;#39;s the odd one out. &lt;/p&gt;\n\n&lt;p&gt;The player base is declining to near terminal levels on many game modes, and when I am on playing with them, most of those who are left are fed up with the game and are only still going in hopes of fixes. Considering the time it&amp;#39;ll take to implement fixes, it&amp;#39;s quite likely that those people are going to leave anyhow. &lt;/p&gt;\n\n&lt;p&gt;I fear BF1 is going to go down in textbooks as an example of how not to manage post-launch support.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgd5k1w", "score_hidden": false, "stickied": false, "created": 1492435228.0, "created_utc": 1492406428.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65sufg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65sufg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65sufg", "likes": null, "replies": "", "user_reports": [], "id": "dgdvg39", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MrBrightside1009", "parent_id": "t1_dgdubqx", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Yes, but Battlefield 4 had ALL of it's DLC for free last Summer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, but Battlefield 4 had ALL of it&amp;#39;s DLC for free last Summer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgdvg39", "score_hidden": false, "stickied": false, "created": 1492481824.0, "created_utc": 1492453024.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdubqx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Awful_Hero", "parent_id": "t1_dgdavof", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "I am not saying premium and DLC maps are a good thing, but BF4 has been pretty stable with that model as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am not saying premium and DLC maps are a good thing, but BF4 has been pretty stable with that model as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgdubqx", "score_hidden": false, "stickied": false, "created": 1492480580.0, "created_utc": 1492451780.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdavof", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MrBrightside1009", "parent_id": "t3_65sufg", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "The other issue is that the current DLC model that companies use is completely broken and ruins the longevity of a game. Every time a DLC is released, you split the community into another part.\n\nRight now you have two sub-communities: Standard and premium players. When the next DLC comes out, you'll then have FOUR sub-communuties: Standard, premium, those who only own DLC 1, and those who only own DLC 2.\n\nWhen DLC 3 comes out, it will be standard, premium, DLC 1, DLC 2, DLC 3 owners, those who own DLC 1 and 2, those who own 1 and 3, and those who own 2 and 3.\n\nAnd it grows more with DLC 4.\n\nAnd if there's 20,000 players on at one time, divide that up into multiple parts and you'll see how broken this DLC system is. I'm glad that DICE is being proactive and trying something new with Battlefront 2, so hopefully it works out and they set a new precedent.\n\nThe problems also wouldn't be this exacerbated if season-pass prices were so high, but we can think Activision's greed for showing publishers they can get away with that bullshit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The other issue is that the current DLC model that companies use is completely broken and ruins the longevity of a game. Every time a DLC is released, you split the community into another part.&lt;/p&gt;\n\n&lt;p&gt;Right now you have two sub-communities: Standard and premium players. When the next DLC comes out, you&amp;#39;ll then have FOUR sub-communuties: Standard, premium, those who only own DLC 1, and those who only own DLC 2.&lt;/p&gt;\n\n&lt;p&gt;When DLC 3 comes out, it will be standard, premium, DLC 1, DLC 2, DLC 3 owners, those who own DLC 1 and 2, those who own 1 and 3, and those who own 2 and 3.&lt;/p&gt;\n\n&lt;p&gt;And it grows more with DLC 4.&lt;/p&gt;\n\n&lt;p&gt;And if there&amp;#39;s 20,000 players on at one time, divide that up into multiple parts and you&amp;#39;ll see how broken this DLC system is. I&amp;#39;m glad that DICE is being proactive and trying something new with Battlefront 2, so hopefully it works out and they set a new precedent.&lt;/p&gt;\n\n&lt;p&gt;The problems also wouldn&amp;#39;t be this exacerbated if season-pass prices were so high, but we can think Activision&amp;#39;s greed for showing publishers they can get away with that bullshit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgdavof", "score_hidden": false, "stickied": false, "created": 1492449162.0, "created_utc": 1492420362.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65sufg", "likes": null, "replies": "", "user_reports": [], "id": "dgdm52z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dynamaxion", "parent_id": "t3_65sufg", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "You forgot another key aspect of community servers, the one that's most important to me- custom game modes. \n\nIn BF4 you had that Christian server running Hardcore mode but with HUD. You had pistol/knife only servers. You had hardcore servers. You had servers running certain maps, or certain DLC packages. There were even Mixed Mode servers, where everyone would vote on what mode to play for the next game. \n\nI can say for a fact that I stopped playing BF1 after a few weeks because of this huge lack of variety. Even when they added hardcore, almost no one played and there was no ability to even see what server you're joining. \n\nAlso, I'm sick of hitting join for operations or hardcore, waiting for map load, only to be the only person in the game. I don't get paid to seed. Overall getting rid of custom servers removes a monstrous aspect of the game. \n\nAnyway, I bet all the shitposters who used to talk about how EA needs to stop being greedy by making clans pay for servers are eating their words. ", "edited": 1492442810.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You forgot another key aspect of community servers, the one that&amp;#39;s most important to me- custom game modes. &lt;/p&gt;\n\n&lt;p&gt;In BF4 you had that Christian server running Hardcore mode but with HUD. You had pistol/knife only servers. You had hardcore servers. You had servers running certain maps, or certain DLC packages. There were even Mixed Mode servers, where everyone would vote on what mode to play for the next game. &lt;/p&gt;\n\n&lt;p&gt;I can say for a fact that I stopped playing BF1 after a few weeks because of this huge lack of variety. Even when they added hardcore, almost no one played and there was no ability to even see what server you&amp;#39;re joining. &lt;/p&gt;\n\n&lt;p&gt;Also, I&amp;#39;m sick of hitting join for operations or hardcore, waiting for map load, only to be the only person in the game. I don&amp;#39;t get paid to seed. Overall getting rid of custom servers removes a monstrous aspect of the game. &lt;/p&gt;\n\n&lt;p&gt;Anyway, I bet all the shitposters who used to talk about how EA needs to stop being greedy by making clans pay for servers are eating their words. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgdm52z", "score_hidden": false, "stickied": false, "created": 1492471400.0, "created_utc": 1492442600.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65sufg", "likes": null, "replies": "", "user_reports": [], "id": "dge02t5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "WarCriminal_954", "parent_id": "t3_65sufg", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "agreed. communities are a massive force that keep the game going. with the lack of controls on the servers and the lack of communication from the devs has turned many off. other FPS games out and offer free servers (Rainbow Six Siege). \n\nthis plus the crap autobalancer leaving matches lopsided has not helped. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;agreed. communities are a massive force that keep the game going. with the lack of controls on the servers and the lack of communication from the devs has turned many off. other FPS games out and offer free servers (Rainbow Six Siege). &lt;/p&gt;\n\n&lt;p&gt;this plus the crap autobalancer leaving matches lopsided has not helped. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dge02t5", "score_hidden": false, "stickied": false, "created": 1492487070.0, "created_utc": 1492458270.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65sufg", "likes": null, "replies": "", "user_reports": [], "id": "dgdchan", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "triadwarfare", "parent_id": "t3_65sufg", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "I stopped playing because of the horrible ping. I dunno what happened as I was only getting 90-100ms ping from PH to Japan (not all servers are like this) and options to connect to closer neighbors such as Hong Kong or Singapore on BF4. On BF1, I'm getting a minimum of 190ms ping and the only option is to connect to Japan.\n\nSomething must have happened to the underlying infrastructure, however, with the lack of other available options, getting this bad of a ping left me with no choice but to give up Battlefield in favor of Overwatch, in which I normally get 70-80ms ping and connections are based om the Singapore server.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I stopped playing because of the horrible ping. I dunno what happened as I was only getting 90-100ms ping from PH to Japan (not all servers are like this) and options to connect to closer neighbors such as Hong Kong or Singapore on BF4. On BF1, I&amp;#39;m getting a minimum of 190ms ping and the only option is to connect to Japan.&lt;/p&gt;\n\n&lt;p&gt;Something must have happened to the underlying infrastructure, however, with the lack of other available options, getting this bad of a ping left me with no choice but to give up Battlefield in favor of Overwatch, in which I normally get 70-80ms ping and connections are based om the Singapore server.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgdchan", "score_hidden": false, "stickied": false, "created": 1492454514.0, "created_utc": 1492425714.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65sufg", "likes": null, "replies": "", "user_reports": [], "id": "dgde5kv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "charliebrownau", "parent_id": "t3_65sufg", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "Awesome post.\n\n\n.\n\nBut I doubt ANYONE at EA or DICE or Battlefield team is willing to listen to PC mature clan player base.\n\n\n\n.\n\nThey seem to be going out of the way RUINING battlefield on PC platform", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome post.&lt;/p&gt;\n\n&lt;p&gt;.&lt;/p&gt;\n\n&lt;p&gt;But I doubt ANYONE at EA or DICE or Battlefield team is willing to listen to PC mature clan player base.&lt;/p&gt;\n\n&lt;p&gt;.&lt;/p&gt;\n\n&lt;p&gt;They seem to be going out of the way RUINING battlefield on PC platform&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgde5kv", "score_hidden": false, "stickied": false, "created": 1492458982.0, "created_utc": 1492430182.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65sufg", "likes": null, "replies": "", "user_reports": [], "id": "dgdikar", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mjfame", "parent_id": "t3_65sufg", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "i agree, however, i've done a pretty good job keeping mine full.. perhaps you xbox one players have heard of it...\n\n\" # - 24/7 - | The People's Hellhole | - 365 - # \"\n\nhttps://battlefieldtracker.com/bf1/servers/xboxone/9243602830030", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i agree, however, i&amp;#39;ve done a pretty good job keeping mine full.. perhaps you xbox one players have heard of it...&lt;/p&gt;\n\n&lt;p&gt;&amp;quot; # - 24/7 - | The People&amp;#39;s Hellhole | - 365 - # &amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://battlefieldtracker.com/bf1/servers/xboxone/9243602830030\"&gt;https://battlefieldtracker.com/bf1/servers/xboxone/9243602830030&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgdikar", "score_hidden": false, "stickied": false, "created": 1492466775.0, "created_utc": 1492437975.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rdgw", "removal_reason": null, "link_id": "t3_65sufg", "likes": null, "replies": "", "user_reports": [], "id": "dgdo0bs", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Soulshot96", "parent_id": "t3_65sufg", "subreddit_name_prefixed": "r/Battlefield", "controversiality": 0, "body": "I'm half glad they aren't supporting custom servers for shit, especially on PC...\n\nThey did that with BF4, ended up selling off every goddamned offical server to asshat clans, who 90% of the time imposed shit rules and let admins run rampant kicking and banning on a whim. Half ruined that game for me. BF1 has no such issue. It's great. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m half glad they aren&amp;#39;t supporting custom servers for shit, especially on PC...&lt;/p&gt;\n\n&lt;p&gt;They did that with BF4, ended up selling off every goddamned offical server to asshat clans, who 90% of the time imposed shit rules and let admins run rampant kicking and banning on a whim. Half ruined that game for me. BF1 has no such issue. It&amp;#39;s great. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Battlefield", "name": "t1_dgdo0bs", "score_hidden": false, "stickied": false, "created": 1492473552.0, "created_utc": 1492444752.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]