[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "investing", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m interested to hear people&amp;#39;s opinions.  I have read the Boglehead guide and have immersed myself quite a bit in the markets, investing, and personal finance.  I totally understand that in looking at the past, US stock market indices have been more or less the best performers over time, and if you extrapolate the past to the future, it&amp;#39;s a no-brainer for a young person to get as much money in the market as soon as possible.  But on the flip side, one of the very first lessons of playing in the stock market is that it is forward-looking, and the past has no bearing on the future.  &lt;/p&gt;\n\n&lt;p&gt;So for a young person investing today, there will likely be corrections/crashes, maybe a recession or two, and maybe even a depression or two before they retire.  But prevailing logic is to just hold tight, as the stock market will eventually rebound from those events and WILL rise again, and in the end, growth will be recognized.&lt;/p&gt;\n\n&lt;p&gt;But is perpetual growth of business&amp;#39; market cap beyond inflation levels really possible forever?  On a finite planet, that seems highly unlikely.  That doesn&amp;#39;t necessarily mean THE ECONOMY IS DOOMED, or HERE COMES THE CRASH etc.  - and maybe it&amp;#39;s still 100, 200, or 300 years from now, but does anyone actually believe that business can just grow forever and that stock market index returns over long periods are going to continue at the rate we have seen in the relatively young history of the market?&lt;/p&gt;\n\n&lt;p&gt;There seem to be some embedded risk in holding stock market indices, even if you hang tight and ride out the crashes.  A few examples:&lt;/p&gt;\n\n&lt;p&gt;-Finite supplies of fossil fuels.  Fossil fuel usage correlates very strongly with economic growth.&lt;/p&gt;\n\n&lt;p&gt;-The global population (aka product markets) have grown substantially since the stock market&amp;#39;s inception, likely contributing strongly to the growth.  Population analyses do show that growth will continue until 2050-2100 or so, but it is yet to be seen what kind of buying power the additional people will have.&lt;/p&gt;\n\n&lt;p&gt;-The stock market has seen some incredible developments of technology that have changed the way just about everyone lives, and has really changed the entire planet.  There will likely be more innovation coming, but did we already hit the &amp;quot;low hanging fruit&amp;quot; of invention, and should we expect slower progress from here? Have we already depleted the &amp;quot;low-hanging fruit&amp;quot; of easily retrievable materials and fossil fuels that made innovation so easy?&lt;/p&gt;\n\n&lt;p&gt;-When do environmental issues really start affecting the country/world to a point where we demand regulations and policies that slow economic growth for the sake of a more sustainable/healthy planet?  There are some very serious problems with current methods of agriculture, depletion of fisheries, freshwater use, land use, fossil fuel use, and raw material use being unsustainable.  Do we &amp;quot;tech&amp;quot; our way out of those problems, or do they really come to a head at some point? (Though it dominates the media, &amp;quot;global warming&amp;quot; is FAR from the only environmental issue we face.  It doesn&amp;#39;t even need to enter the discussion to take this stuff seriously)&lt;/p&gt;\n\n&lt;p&gt;Obviously this is a massive topic and there are a million points to make supporting either side.  I&amp;#39;m curious where you all stand with this.  Bullish? Bearish? Undecided and see both sides of the coin like me? Understand the risk, but realize there&amp;#39;s really nowhere else to put your money for possible substantial gains?  Do you see different risks in the different indices (Total stock market vs. S&amp;amp;P  vs. Blue Chips vs. Large Cap vs. Small Cap etc.)?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm interested to hear people's opinions.  I have read the Boglehead guide and have immersed myself quite a bit in the markets, investing, and personal finance.  I totally understand that in looking at the past, US stock market indices have been more or less the best performers over time, and if you extrapolate the past to the future, it's a no-brainer for a young person to get as much money in the market as soon as possible.  But on the flip side, one of the very first lessons of playing in the stock market is that it is forward-looking, and the past has no bearing on the future.  \n\nSo for a young person investing today, there will likely be corrections/crashes, maybe a recession or two, and maybe even a depression or two before they retire.  But prevailing logic is to just hold tight, as the stock market will eventually rebound from those events and WILL rise again, and in the end, growth will be recognized.\n\nBut is perpetual growth of business' market cap beyond inflation levels really possible forever?  On a finite planet, that seems highly unlikely.  That doesn't necessarily mean THE ECONOMY IS DOOMED, or HERE COMES THE CRASH etc.  - and maybe it's still 100, 200, or 300 years from now, but does anyone actually believe that business can just grow forever and that stock market index returns over long periods are going to continue at the rate we have seen in the relatively young history of the market?\n\nThere seem to be some embedded risk in holding stock market indices, even if you hang tight and ride out the crashes.  A few examples:\n\n-Finite supplies of fossil fuels.  Fossil fuel usage correlates very strongly with economic growth.\n\n-The global population (aka product markets) have grown substantially since the stock market's inception, likely contributing strongly to the growth.  Population analyses do show that growth will continue until 2050-2100 or so, but it is yet to be seen what kind of buying power the additional people will have.\n\n-The stock market has seen some incredible developments of technology that have changed the way just about everyone lives, and has really changed the entire planet.  There will likely be more innovation coming, but did we already hit the \"low hanging fruit\" of invention, and should we expect slower progress from here? Have we already depleted the \"low-hanging fruit\" of easily retrievable materials and fossil fuels that made innovation so easy?\n\n-When do environmental issues really start affecting the country/world to a point where we demand regulations and policies that slow economic growth for the sake of a more sustainable/healthy planet?  There are some very serious problems with current methods of agriculture, depletion of fisheries, freshwater use, land use, fossil fuel use, and raw material use being unsustainable.  Do we \"tech\" our way out of those problems, or do they really come to a head at some point? (Though it dominates the media, \"global warming\" is FAR from the only environmental issue we face.  It doesn't even need to enter the discussion to take this stuff seriously)\n\nObviously this is a massive topic and there are a million points to make supporting either side.  I'm curious where you all stand with this.  Bullish? Bearish? Undecided and see both sides of the coin like me? Understand the risk, but realize there's really nowhere else to put your money for possible substantial gains?  Do you see different risks in the different indices (Total stock market vs. S&amp;P  vs. Blue Chips vs. Large Cap vs. Small Cap etc.)?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "650mpc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 25, "report_reasons": null, "author": "JJMorse292", "saved": false, "mod_reports": [], "name": "t3_650mpc", "subreddit_name_prefixed": "r/investing", "approved_by": null, "over_18": false, "domain": "self.investing", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhhq", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/investing/comments/650mpc/are_30_40_50_year_bets_on_us_stock_market_indices/", "num_reports": null, "locked": false, "stickied": false, "created": 1492056361.0, "url": "https://www.reddit.com/r/investing/comments/650mpc/are_30_40_50_year_bets_on_us_stock_market_indices/", "author_flair_text": null, "quarantine": false, "title": "Are 30, 40, 50 year bets on US Stock Market Indices really a good investment?", "created_utc": 1492027561.0, "distinguished": null, "media": null, "upvote_ratio": 0.79, "num_comments": 32, "visited": false, "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg6rm5e", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg6hfky", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "This is pretty much the right right answer. The thing is, while looking at something like the andex chart, you see that rise over time, and wonder if it can go on sure. What people forget (besides everything) is that there is A LOT of the world that is still undeveloped that will take immense amounts of time and investment to see how markets include it all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is pretty much the right right answer. The thing is, while looking at something like the andex chart, you see that rise over time, and wonder if it can go on sure. What people forget (besides everything) is that there is A LOT of the world that is still undeveloped that will take immense amounts of time and investment to see how markets include it all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6rm5e", "score_hidden": false, "stickied": false, "created": 1492068940.0, "created_utc": 1492040140.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg6oj1q", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "erik__", "parent_id": "t1_dg6k2x2", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "In a little to no growth scenario I would think PE ratios would expand.  If people say 4% returns are impossible, set your goals to 2%.  That suggests to me that 50x PE would become the new normal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In a little to no growth scenario I would think PE ratios would expand.  If people say 4% returns are impossible, set your goals to 2%.  That suggests to me that 50x PE would become the new normal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6oj1q", "score_hidden": false, "stickied": false, "created": 1492065130.0, "created_utc": 1492036330.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6k2x2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "hfutrell", "parent_id": "t1_dg6jmun", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "&gt; wouldn't it function differently with money in a stock market index, where your money only grows if the market's aggregate valuation of the companies in that index becomes higher\n\nA total market fund is just holding lots of individual stocks, so I wouldn't think it'd be different. It's true that the index doesn't go up from dividends or buybacks, but you're not invested directly in the index: you're invested in the companies that make up the index.\n\n&gt; The major indices include lots of companies with current market caps that are based on the assumption of future growth\n\nWell, sure, if growth doesn't happen those companies will probably fall. My calculation assumes that investors in the future are willing to pay the same earnings multiple they are today. If their hopes are in fact dashed by a no-growth scenario then they'll be willing to pay less and so prices will fall. \n\nPersonally I don't really like to speculate about what investors might be willing to pay for stocks in the future. I invest as if I'm going to hold forever.", "edited": 1492031274.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;wouldn&amp;#39;t it function differently with money in a stock market index, where your money only grows if the market&amp;#39;s aggregate valuation of the companies in that index becomes higher&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A total market fund is just holding lots of individual stocks, so I wouldn&amp;#39;t think it&amp;#39;d be different. It&amp;#39;s true that the index doesn&amp;#39;t go up from dividends or buybacks, but you&amp;#39;re not invested directly in the index: you&amp;#39;re invested in the companies that make up the index.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The major indices include lots of companies with current market caps that are based on the assumption of future growth&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, sure, if growth doesn&amp;#39;t happen those companies will probably fall. My calculation assumes that investors in the future are willing to pay the same earnings multiple they are today. If their hopes are in fact dashed by a no-growth scenario then they&amp;#39;ll be willing to pay less and so prices will fall. &lt;/p&gt;\n\n&lt;p&gt;Personally I don&amp;#39;t really like to speculate about what investors might be willing to pay for stocks in the future. I invest as if I&amp;#39;m going to hold forever.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6k2x2", "score_hidden": false, "stickied": false, "created": 1492059777.0, "created_utc": 1492030977.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg6wv6t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HiMyth", "parent_id": "t1_dg6jmun", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "&gt; The major indices include lots of companies with current market caps that are based on the assumption of future growth. So for those companies, wouldn't a lack of growth destroy their share price and cause losses to the index?\n\nSolution to that concern: Guggenheim S&amp;P 500 Equal Weight ETF (RSP)\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The major indices include lots of companies with current market caps that are based on the assumption of future growth. So for those companies, wouldn&amp;#39;t a lack of growth destroy their share price and cause losses to the index?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Solution to that concern: Guggenheim S&amp;amp;P 500 Equal Weight ETF (RSP)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6wv6t", "score_hidden": false, "stickied": false, "created": 1492075351.0, "created_utc": 1492046551.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jmun", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JJMorse292", "parent_id": "t1_dg6hfky", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "That's good food for thought.  That makes logical sense for an individual stock, assuming the market is pricing it appropriately, since if growth were to stop and there were nowhere to reinvest profits, the company would distribute dividends and shareholders would get continued exponential returns either way.\n\nBut wouldn't it function differently with money in a stock market index, where your money only grows if the market's aggregate valuation of the companies in that index becomes higher?  The major indices include lots of companies with current market caps that are based on the assumption of future growth.  So for those companies, wouldn't a lack of growth destroy their share price and cause losses to the index?  I feel like in reality, exponential returns would at least require SOME growth, because a lack of growth entirely would mean a huge chunk of today's market cap disappearing as investors realized that the potential future earnings they paid a premium for are not going to happen.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s good food for thought.  That makes logical sense for an individual stock, assuming the market is pricing it appropriately, since if growth were to stop and there were nowhere to reinvest profits, the company would distribute dividends and shareholders would get continued exponential returns either way.&lt;/p&gt;\n\n&lt;p&gt;But wouldn&amp;#39;t it function differently with money in a stock market index, where your money only grows if the market&amp;#39;s aggregate valuation of the companies in that index becomes higher?  The major indices include lots of companies with current market caps that are based on the assumption of future growth.  So for those companies, wouldn&amp;#39;t a lack of growth destroy their share price and cause losses to the index?  I feel like in reality, exponential returns would at least require SOME growth, because a lack of growth entirely would mean a huge chunk of today&amp;#39;s market cap disappearing as investors realized that the potential future earnings they paid a premium for are not going to happen.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6jmun", "score_hidden": false, "stickied": false, "created": 1492059282.0, "created_utc": 1492030482.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg73ug4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "moviedude26", "parent_id": "t1_dg6hfky", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "Amongst a sea of shitty and selective replies, an actual answer that gets to the root of the question asked! Thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Amongst a sea of shitty and selective replies, an actual answer that gets to the root of the question asked! Thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg73ug4", "score_hidden": false, "stickied": false, "created": 1492084508.0, "created_utc": 1492055708.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg7u456", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "3keek3000", "parent_id": "t1_dg6rpna", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "&gt;expected inflation is driving stock prices up.\n\nUntil about 3 months ago, nobody was talking any spectre of inflation. Now, everyone is...  it really hasn't been a factor driving up equity prices at all over the past several years- in fact, some big names really didn't see any inflation until after 2020, or even well beyond that. They were likely wrong in hindsight.\n\n&gt;deflationary environment, nobody wants to invest or buy stuff, they can wait for t+1 and get more stuff or value for the same principal ammount.\n\nthe same thing happens in an excessive inflation environment with sellers... they are both destructive!\n\n&gt;Hence why all central banks have a public charter and goal to keep inflation around 2%.\n\nCould you clarify what you mean by that? Because there's nothing I know of where central banks have inflation targets in their charters... 2% inflation target is becoming an increasingly questionable operating principle, right?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;expected inflation is driving stock prices up.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Until about 3 months ago, nobody was talking any spectre of inflation. Now, everyone is...  it really hasn&amp;#39;t been a factor driving up equity prices at all over the past several years- in fact, some big names really didn&amp;#39;t see any inflation until after 2020, or even well beyond that. They were likely wrong in hindsight.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;deflationary environment, nobody wants to invest or buy stuff, they can wait for t+1 and get more stuff or value for the same principal ammount.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;the same thing happens in an excessive inflation environment with sellers... they are both destructive!&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Hence why all central banks have a public charter and goal to keep inflation around 2%.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Could you clarify what you mean by that? Because there&amp;#39;s nothing I know of where central banks have inflation targets in their charters... 2% inflation target is becoming an increasingly questionable operating principle, right?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg7u456", "score_hidden": false, "stickied": false, "created": 1492131120.0, "created_utc": 1492102320.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6rpna", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "samenrofringslikeLBJ", "parent_id": "t1_dg6mox7", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "People seriously dont know econ 101 in this sub, inflation is a primary driver of growth and valuations. In a deflationary environment, nobody wants to invest or buy stuff, they can wait for t+1 and get more stuff or value for the same principal ammount. Hence why all central banks have a public charter and goal to keep inflation around 2%. I understand now why people think the market is so overvalued, they dont understand that low rates and the resulting liquidity and expected inflation is driving stock prices up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People seriously dont know econ 101 in this sub, inflation is a primary driver of growth and valuations. In a deflationary environment, nobody wants to invest or buy stuff, they can wait for t+1 and get more stuff or value for the same principal ammount. Hence why all central banks have a public charter and goal to keep inflation around 2%. I understand now why people think the market is so overvalued, they dont understand that low rates and the resulting liquidity and expected inflation is driving stock prices up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6rpna", "score_hidden": false, "stickied": false, "created": 1492069059.0, "created_utc": 1492040259.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mox7", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "hfutrell", "parent_id": "t1_dg6mgcs", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "&gt; But you are forget inflation\n\nNo, I didn't. That's why I said *real* returns.\n\nIn fact inflation only raises nominal returns because in a no-growth scenario earnings still rise with inflation, which will cause capital appreciation if the PE ratio is maintained over time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But you are forget inflation&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, I didn&amp;#39;t. That&amp;#39;s why I said &lt;em&gt;real&lt;/em&gt; returns.&lt;/p&gt;\n\n&lt;p&gt;In fact inflation only raises nominal returns because in a no-growth scenario earnings still rise with inflation, which will cause capital appreciation if the PE ratio is maintained over time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6mox7", "score_hidden": false, "stickied": false, "created": 1492062848.0, "created_utc": 1492034048.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mgcs", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Zaigard", "parent_id": "t1_dg6hfky", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "But you are forget inflation, just because its low now it doesn't mean it can't go up. You just need a 4% annualized inflation to kill hypothetical 4% annualized returns. Please correct me if i am wrong.\nSo let's say you are buying index at 25x PE and over the next 20 years inflation is 5% you will end with very poor results...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But you are forget inflation, just because its low now it doesn&amp;#39;t mean it can&amp;#39;t go up. You just need a 4% annualized inflation to kill hypothetical 4% annualized returns. Please correct me if i am wrong.\nSo let&amp;#39;s say you are buying index at 25x PE and over the next 20 years inflation is 5% you will end with very poor results...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6mgcs", "score_hidden": false, "stickied": false, "created": 1492062557.0, "created_utc": 1492033757.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6hfky", "gilded": 0, "archived": false, "score": 42, "report_reasons": null, "author": "hfutrell", "parent_id": "t3_650mpc", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "I want to rail this point home: exponential returns do not require exponential growth. They only require *profits* and *reinvestment of profits*. The market could stay the same size it is today forever, but on the basis of a 25x PE ratio, you'd still realize 4% annualized real returns. That's lower than historical returns, but it's still higher than you'll find elsewhere.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to rail this point home: exponential returns do not require exponential growth. They only require &lt;em&gt;profits&lt;/em&gt; and &lt;em&gt;reinvestment of profits&lt;/em&gt;. The market could stay the same size it is today forever, but on the basis of a 25x PE ratio, you&amp;#39;d still realize 4% annualized real returns. That&amp;#39;s lower than historical returns, but it&amp;#39;s still higher than you&amp;#39;ll find elsewhere.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6hfky", "score_hidden": false, "stickied": false, "created": 1492056985.0, "created_utc": 1492028185.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 42}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg6peyx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "klf0", "parent_id": "t1_dg6pck3", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "Yes. That also gets into the more specific issue of America's hegemony over the seas, partly thanks to her pan-continental existence.\n\nA few books that really discuss all these things:\n\nhttps://www.amazon.ca/Prisoners-Geography-Explain-Everything-About/dp/1501121464\n\nhttps://www.amazon.ca/Next-100-Years-Forecast-Century/dp/0767923057", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. That also gets into the more specific issue of America&amp;#39;s hegemony over the seas, partly thanks to her pan-continental existence.&lt;/p&gt;\n\n&lt;p&gt;A few books that really discuss all these things:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.amazon.ca/Prisoners-Geography-Explain-Everything-About/dp/1501121464\"&gt;https://www.amazon.ca/Prisoners-Geography-Explain-Everything-About/dp/1501121464&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.amazon.ca/Next-100-Years-Forecast-Century/dp/0767923057\"&gt;https://www.amazon.ca/Next-100-Years-Forecast-Century/dp/0767923057&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6peyx", "score_hidden": false, "stickied": false, "created": 1492066215.0, "created_utc": 1492037415.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pck3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "biz_student", "parent_id": "t1_dg6ixbi", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "It also has the military budget of the other largest 10 countries combined. Makes it very hard to neglect the USA. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It also has the military budget of the other largest 10 countries combined. Makes it very hard to neglect the USA. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6pck3", "score_hidden": false, "stickied": false, "created": 1492066130.0, "created_utc": 1492037330.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg6y7gh", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "klf0", "parent_id": "t1_dg6xsa8", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "Sure. As an asset class, I think US equities will continue to lead the world. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure. As an asset class, I think US equities will continue to lead the world. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6y7gh", "score_hidden": false, "stickied": false, "created": 1492077003.0, "created_utc": 1492048203.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xsa8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "asdfghlkj", "parent_id": "t1_dg6rus2", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "Could be better though. There is a difference between being just \"good\" and striving to be great.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could be better though. There is a difference between being just &amp;quot;good&amp;quot; and striving to be great.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6xsa8", "score_hidden": false, "stickied": false, "created": 1492076488.0, "created_utc": 1492047688.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6rus2", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "klf0", "parent_id": "t1_dg6roz0", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "By and large, yes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;By and large, yes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6rus2", "score_hidden": false, "stickied": false, "created": 1492069234.0, "created_utc": 1492040434.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6roz0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "FCowperwood", "parent_id": "t1_dg6ixbi", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "So, there is no need to make America great again - it is actually great?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, there is no need to make America great again - it is actually great?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6roz0", "score_hidden": false, "stickied": false, "created": 1492069034.0, "created_utc": 1492040234.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ixbi", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "klf0", "parent_id": "t3_650mpc", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "Over the next century I would remain very bullish on the US economy. Geopolitically, the US is dominant. It has a very large, well-educated population. It is the global nexus for innovation. It has excellent established rule of law.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Over the next century I would remain very bullish on the US economy. Geopolitically, the US is dominant. It has a very large, well-educated population. It is the global nexus for innovation. It has excellent established rule of law.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6ixbi", "score_hidden": false, "stickied": false, "created": 1492058524.0, "created_utc": 1492029724.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg6jstm", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "alisonstone", "parent_id": "t3_650mpc", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "Whether we switch from fossil fuels to solar or some other type of energy, do you think the electric company will stop charging their customers more than it costs for them to produce electricity?\n\nAssuming property rights don't vanish (if it does, your money is probably canceled anyways so thinking about investments is pointless), do you think that property owners will stop renting out their space at a profit?\n\nEven if population doesn't grow and technological progress freezes, do you think people will stop using toothpaste or that the companies making toothpaste would suddenly decide to give it away for free instead of selling at a profit?\n\nYou don't need perpetual growth and scientific advancement to make money.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whether we switch from fossil fuels to solar or some other type of energy, do you think the electric company will stop charging their customers more than it costs for them to produce electricity?&lt;/p&gt;\n\n&lt;p&gt;Assuming property rights don&amp;#39;t vanish (if it does, your money is probably canceled anyways so thinking about investments is pointless), do you think that property owners will stop renting out their space at a profit?&lt;/p&gt;\n\n&lt;p&gt;Even if population doesn&amp;#39;t grow and technological progress freezes, do you think people will stop using toothpaste or that the companies making toothpaste would suddenly decide to give it away for free instead of selling at a profit?&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t need perpetual growth and scientific advancement to make money.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6jstm", "score_hidden": false, "stickied": false, "created": 1492059462.0, "created_utc": 1492030662.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg6lf9u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ddd333ddd", "parent_id": "t1_dg6kmnw", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "Since 1967 for example France has had a higher yearly return than US, as did UK, Switzerland. Stereotypically France was always a dodgy investment due to wars and social policy that favored workers over stocks, but the results were very good once the wars were over. Of course wars could return in Europe if the EU breaks up and national populists gain influence. Many use this foreign risk argument to argue for buying home stuff onlny, since Americans have never needed to buy foreign stocks to get OK returns.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since 1967 for example France has had a higher yearly return than US, as did UK, Switzerland. Stereotypically France was always a dodgy investment due to wars and social policy that favored workers over stocks, but the results were very good once the wars were over. Of course wars could return in Europe if the EU breaks up and national populists gain influence. Many use this foreign risk argument to argue for buying home stuff onlny, since Americans have never needed to buy foreign stocks to get OK returns.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6lf9u", "score_hidden": false, "stickied": false, "created": 1492061329.0, "created_utc": 1492032529.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6kmnw", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ddd333ddd", "parent_id": "t3_650mpc", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "&gt;US stock market indices have been more or less the best performers over time\n\nIt's very common to say that, but actually South Africa and Australia are deemed to have had higher real returns since 1900 by many Credit Suisse Investment Returns Yearbooks. From the latest one:\n\n7.2% a year South Africa\n\n6.8% a year Australia\n\n6.4% a year US\n\nThis is the latest Yearbook (PDF): https://publications.credit-suisse.com/tasks/render/file/?fileID=B8FDD84D-A4CD-D983-12840F52F61BA0B4\n\nIt's all rather close at the top and it doesn't really matter, almost no one got those returns since there were no index funds. Most investors in those nations would have substantially underperformed due to broker fees, taxes and lack of having a total market index. Nowadays with global stock indexing it's easy to get the future returns of every major nation put together. I prefer simple global index funds rather than worrying about individual nations.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;US stock market indices have been more or less the best performers over time&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s very common to say that, but actually South Africa and Australia are deemed to have had higher real returns since 1900 by many Credit Suisse Investment Returns Yearbooks. From the latest one:&lt;/p&gt;\n\n&lt;p&gt;7.2% a year South Africa&lt;/p&gt;\n\n&lt;p&gt;6.8% a year Australia&lt;/p&gt;\n\n&lt;p&gt;6.4% a year US&lt;/p&gt;\n\n&lt;p&gt;This is the latest Yearbook (PDF): &lt;a href=\"https://publications.credit-suisse.com/tasks/render/file/?fileID=B8FDD84D-A4CD-D983-12840F52F61BA0B4\"&gt;https://publications.credit-suisse.com/tasks/render/file/?fileID=B8FDD84D-A4CD-D983-12840F52F61BA0B4&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s all rather close at the top and it doesn&amp;#39;t really matter, almost no one got those returns since there were no index funds. Most investors in those nations would have substantially underperformed due to broker fees, taxes and lack of having a total market index. Nowadays with global stock indexing it&amp;#39;s easy to get the future returns of every major nation put together. I prefer simple global index funds rather than worrying about individual nations.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6kmnw", "score_hidden": false, "stickied": false, "created": 1492060403.0, "created_utc": 1492031603.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg6ull4", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Biggame34", "parent_id": "t3_650mpc", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "Roughly 30 years ago someone was thinking this same thing and since then we have seen Amazon, Google/Alphabet, Facebook, Apple, Facebook, Netflix, Tesla and others rise to be some of the largest market cap companies in the world, driving a significant amount of growth in the US Market.  At that same time cellphones were expensive and a small market, touch screen technology didn't exist (or wasn't readily accessible), flat screen TVs were the same way.\n \nAs for fossil fuels, the oil majors spend Billions of dollars a year each in R&amp;D on new technologies and they will most likely be some of the companies leading growth into new fuel technology when it does come to market.  I read somewhere that if gasoline fueled vehicles ceased to exist tomorrow that Exxon Mobil would still be one of the largest industrial chemical companies in the world.  So while our dependence on fossil fuels will not end in the next 30 to 50 years, when it does there will be existing and new companies companies supplying the new fuel source and creating economic growth.  \n\nMy point being that technological advancement and companies in market segments that don't even exist right now will be the ones driving economic growth 50 years from now. As for if the US will be leading the worldwide growth, I guess that can be debated, but they will almost certainly be a major player.  That is why it is important to include both US and International indexes and companies in your overall equity diversification. \n\nSorry if this is a rambling response....", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Roughly 30 years ago someone was thinking this same thing and since then we have seen Amazon, Google/Alphabet, Facebook, Apple, Facebook, Netflix, Tesla and others rise to be some of the largest market cap companies in the world, driving a significant amount of growth in the US Market.  At that same time cellphones were expensive and a small market, touch screen technology didn&amp;#39;t exist (or wasn&amp;#39;t readily accessible), flat screen TVs were the same way.&lt;/p&gt;\n\n&lt;p&gt;As for fossil fuels, the oil majors spend Billions of dollars a year each in R&amp;amp;D on new technologies and they will most likely be some of the companies leading growth into new fuel technology when it does come to market.  I read somewhere that if gasoline fueled vehicles ceased to exist tomorrow that Exxon Mobil would still be one of the largest industrial chemical companies in the world.  So while our dependence on fossil fuels will not end in the next 30 to 50 years, when it does there will be existing and new companies companies supplying the new fuel source and creating economic growth.  &lt;/p&gt;\n\n&lt;p&gt;My point being that technological advancement and companies in market segments that don&amp;#39;t even exist right now will be the ones driving economic growth 50 years from now. As for if the US will be leading the worldwide growth, I guess that can be debated, but they will almost certainly be a major player.  That is why it is important to include both US and International indexes and companies in your overall equity diversification. &lt;/p&gt;\n\n&lt;p&gt;Sorry if this is a rambling response....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6ull4", "score_hidden": false, "stickied": false, "created": 1492072604.0, "created_utc": 1492043804.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg7eg5x", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mkamvo22", "parent_id": "t3_650mpc", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "I'm bullish overall. Because of capitalism, as long as we stay a capitalistic society, there will always be some sort of growth. Because you list so many potential issues our country and world will be facing, it will lead to people and companies trying to find solutions to those problems. The only thing I see being detrimental to the markets would be all out world war, which in that case, survival would be more important than your money in the market. I guess I'd say I understand the risk but realize there really isn't anywhere else to put my money for gains. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m bullish overall. Because of capitalism, as long as we stay a capitalistic society, there will always be some sort of growth. Because you list so many potential issues our country and world will be facing, it will lead to people and companies trying to find solutions to those problems. The only thing I see being detrimental to the markets would be all out world war, which in that case, survival would be more important than your money in the market. I guess I&amp;#39;d say I understand the risk but realize there really isn&amp;#39;t anywhere else to put my money for gains. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg7eg5x", "score_hidden": false, "stickied": false, "created": 1492109976.0, "created_utc": 1492081176.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg6mw7e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "1000_Louisiana_77002", "parent_id": "t3_650mpc", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "Short answer: yes.\n\nWe still have a ways to go until the end of human civilization.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Short answer: yes.&lt;/p&gt;\n\n&lt;p&gt;We still have a ways to go until the end of human civilization.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6mw7e", "score_hidden": false, "stickied": false, "created": 1492063091.0, "created_utc": 1492034291.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg6tocb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "IB___", "parent_id": "t3_650mpc", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "I would definitely diversify across economies (hold international equities) and to a lesser extent asset classes (hold real estate etc) to mitigate the risk of a multi-decade decline in US equities prices. This kind of thing is rare, but it has happened - investing in Japan in the 90s would have yielded negative real returns over a very long time horizon.  In terms of your specific criticism, that continuous growth on a finite planet is impossible - I don't think it's a highly probable event but I don't think it's insane either.  It will only be possible with continuous technological innovation, and it's very hard to know if that can keep us out ahead of environmental degradation and geopolitical instability. The thing is, the entire capitalist system is dependent on growth - so if the growth stops it really won't matter where you put your money because we'll be transitioning to something else.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would definitely diversify across economies (hold international equities) and to a lesser extent asset classes (hold real estate etc) to mitigate the risk of a multi-decade decline in US equities prices. This kind of thing is rare, but it has happened - investing in Japan in the 90s would have yielded negative real returns over a very long time horizon.  In terms of your specific criticism, that continuous growth on a finite planet is impossible - I don&amp;#39;t think it&amp;#39;s a highly probable event but I don&amp;#39;t think it&amp;#39;s insane either.  It will only be possible with continuous technological innovation, and it&amp;#39;s very hard to know if that can keep us out ahead of environmental degradation and geopolitical instability. The thing is, the entire capitalist system is dependent on growth - so if the growth stops it really won&amp;#39;t matter where you put your money because we&amp;#39;ll be transitioning to something else.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6tocb", "score_hidden": false, "stickied": false, "created": 1492071502.0, "created_utc": 1492042702.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg83beb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lingx073", "parent_id": "t3_650mpc", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "Eventually the stock market will be flat out, like Japan. Maybe 100 years from now, AI robots will replace human workers, population growth will stop. I think it's likely you will see little to no gain at that time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eventually the stock market will be flat out, like Japan. Maybe 100 years from now, AI robots will replace human workers, population growth will stop. I think it&amp;#39;s likely you will see little to no gain at that time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg83beb", "score_hidden": false, "stickied": false, "created": 1492140961.0, "created_utc": 1492112161.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg6mupi", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "1000_Louisiana_77002", "parent_id": "t1_dg6man2", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "I wouldn't go so far to say that it's a myth, but it's quite clear between shale, emerging renewable energy technology and batteries we have a loooooooooong ways to go before we run out of energy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t go so far to say that it&amp;#39;s a myth, but it&amp;#39;s quite clear between shale, emerging renewable energy technology and batteries we have a loooooooooong ways to go before we run out of energy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6mupi", "score_hidden": false, "stickied": false, "created": 1492063041.0, "created_utc": 1492034241.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6man2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "enginerd03", "parent_id": "t3_650mpc", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "Peak oil is a myth. Thanks to new technologies reserves have never been *higher* there's always more oil to be found. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Peak oil is a myth. Thanks to new technologies reserves have never been &lt;em&gt;higher&lt;/em&gt; there&amp;#39;s always more oil to be found. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6man2", "score_hidden": false, "stickied": false, "created": 1492062369.0, "created_utc": 1492033569.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg6gxjr", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "kyler1120", "parent_id": "t3_650mpc", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "Bearish", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bearish&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6gxjr", "score_hidden": false, "stickied": false, "created": 1492056465.0, "created_utc": 1492027665.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg6mo4b", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "thethiefstheme", "parent_id": "t3_650mpc", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "&gt;Finite supplies of fossil fuels. Fossil fuel usage correlates very strongly with economic growth.\n\nyeah so does toilet paper sales over time, or sales of almost any basic necessity. doesn't mean shit.\n\nglobally, this shouldn't impact anyone, except for countries that don't have the new alternative to fossil fuels. ipod killed the cd/mp3 player, the wealth transferred to apple over time. you have a flawed view of how money works and the role of money. i suggest you study more and wrap your head around the reason why money exists and why money collects in certain areas of the economy.\n\nyou invest because you believe a company can extract money from a population faster than it can lose it. it does so by providing a service. if fuel is no longer needed, then that service is no longer needed, but the alternative to fuel is needed. \n\namazon might be killing retail, but it's killing retail because retail has a cheaper alternative now: amazon. plus we have devices that replaced most things that existed. the economy keeps on chugging.\n\nthat's why people buy index funds/etfs, they don't know when one sector will be popular and another wont, but they know progress is always happening.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Finite supplies of fossil fuels. Fossil fuel usage correlates very strongly with economic growth.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;yeah so does toilet paper sales over time, or sales of almost any basic necessity. doesn&amp;#39;t mean shit.&lt;/p&gt;\n\n&lt;p&gt;globally, this shouldn&amp;#39;t impact anyone, except for countries that don&amp;#39;t have the new alternative to fossil fuels. ipod killed the cd/mp3 player, the wealth transferred to apple over time. you have a flawed view of how money works and the role of money. i suggest you study more and wrap your head around the reason why money exists and why money collects in certain areas of the economy.&lt;/p&gt;\n\n&lt;p&gt;you invest because you believe a company can extract money from a population faster than it can lose it. it does so by providing a service. if fuel is no longer needed, then that service is no longer needed, but the alternative to fuel is needed. &lt;/p&gt;\n\n&lt;p&gt;amazon might be killing retail, but it&amp;#39;s killing retail because retail has a cheaper alternative now: amazon. plus we have devices that replaced most things that existed. the economy keeps on chugging.&lt;/p&gt;\n\n&lt;p&gt;that&amp;#39;s why people buy index funds/etfs, they don&amp;#39;t know when one sector will be popular and another wont, but they know progress is always happening.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6mo4b", "score_hidden": false, "stickied": false, "created": 1492062820.0, "created_utc": 1492034020.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_650mpc", "likes": null, "replies": "", "user_reports": [], "id": "dg6o0rv", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "erik__", "parent_id": "t3_650mpc", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "Good investment compared to what?\n\nIt's hard too look 50 years into the future.  I mean, you didn't even mention nuclear war.  It's possible.  That would crash the market even if enough of us were left to invest.  I'd probably rather just own a bunch of gold on the day nuclear war breaks out.\n\nIgnoring that type of situation, and in the more immediate term it seems obvious to me that we're going to have increased automation followed by some sort of basic income so that people can enjoy some of the benefits of automation instead of just being out of work and starving.  I view the basic income part as a massive sustained stimulus which should propel the markets (and inflation) to new levels and am currently bullish on stocks for the next 30-50 years.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good investment compared to what?&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s hard too look 50 years into the future.  I mean, you didn&amp;#39;t even mention nuclear war.  It&amp;#39;s possible.  That would crash the market even if enough of us were left to invest.  I&amp;#39;d probably rather just own a bunch of gold on the day nuclear war breaks out.&lt;/p&gt;\n\n&lt;p&gt;Ignoring that type of situation, and in the more immediate term it seems obvious to me that we&amp;#39;re going to have increased automation followed by some sort of basic income so that people can enjoy some of the benefits of automation instead of just being out of work and starving.  I view the basic income part as a massive sustained stimulus which should propel the markets (and inflation) to new levels and am currently bullish on stocks for the next 30-50 years.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dg6o0rv", "score_hidden": false, "stickied": false, "created": 1492064491.0, "created_utc": 1492035691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]