[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "investing", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m still looking the fundamentals, such as balance sheets and income statements. My general impression was that $PSX has been diversifying into the petrochemical and midstream operations (most notably their 25% stake in the Dakota Access Pipeline), and has stopped expanding their refinery operation. Both $XOM and $RDS.B are heavily involved with natural gas.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also still looking at their renewable energy projects, as I personally believe that once the smart grids and grid storage implementation becomes much more common place, along with solar/wind becoming rapidly cheaper, it will push out fossil fuel from electricity generation (starting with coal and oil, natural gas last). Electric vehicle market growth is another factor to take in consideration. How long will all this take? No idea, but there&amp;#39;s still plenty of profit to be made from oil and natural gas (and oil is still needed for ship fuel, kerosene and petrochemicals), although it would be nice to have a backup plan.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s one thing to advertise the renewable energy projects, it&amp;#39;s a different thing if they make 0.5% or 5% of a balance sheet.&lt;/p&gt;\n\n&lt;p&gt;There are also other energy companies that I could consider, but I haven&amp;#39;t looked into them at all. (Fun fact, Total S.A. owns about 60% of SunPower, although I have not looked into TOT either. I also personally do not directly invest into renewable energy developers/installers, with the exception of yieldcos or giants such as GE.)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm still looking the fundamentals, such as balance sheets and income statements. My general impression was that $PSX has been diversifying into the petrochemical and midstream operations (most notably their 25% stake in the Dakota Access Pipeline), and has stopped expanding their refinery operation. Both $XOM and $RDS.B are heavily involved with natural gas.\n\nI'm also still looking at their renewable energy projects, as I personally believe that once the smart grids and grid storage implementation becomes much more common place, along with solar/wind becoming rapidly cheaper, it will push out fossil fuel from electricity generation (starting with coal and oil, natural gas last). Electric vehicle market growth is another factor to take in consideration. How long will all this take? No idea, but there's still plenty of profit to be made from oil and natural gas (and oil is still needed for ship fuel, kerosene and petrochemicals), although it would be nice to have a backup plan.\n\nIt's one thing to advertise the renewable energy projects, it's a different thing if they make 0.5% or 5% of a balance sheet.\n\nThere are also other energy companies that I could consider, but I haven't looked into them at all. (Fun fact, Total S.A. owns about 60% of SunPower, although I have not looked into TOT either. I also personally do not directly invest into renewable energy developers/installers, with the exception of yieldcos or giants such as GE.)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65hpy4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "COMPUTER1313", "saved": false, "mod_reports": [], "name": "t3_65hpy4", "subreddit_name_prefixed": "r/investing", "approved_by": null, "over_18": false, "domain": "self.investing", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhhq", "edited": 1492281388.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/investing/comments/65hpy4/betting_on_oil_price_eventually_recovering_or_at/", "num_reports": null, "locked": false, "stickied": false, "created": 1492265821.0, "url": "https://www.reddit.com/r/investing/comments/65hpy4/betting_on_oil_price_eventually_recovering_or_at/", "author_flair_text": null, "quarantine": false, "title": "Betting on oil price eventually recovering (or at least the companies successfully diversifying). I have been specifically looking at $PSX, $XOM, and $RDS.B", "created_utc": 1492237021.0, "distinguished": null, "media": null, "upvote_ratio": 0.67, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_65hpy4", "likes": null, "replies": "", "user_reports": [], "id": "dgafe4r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ASitl", "parent_id": "t3_65hpy4", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "I got in XOM in the low 70s, has been up and down and sitting at low 80s but it's payingn dividends so can't complain. I'm not sure an oil recovery is coming anytime soon, feels like it'll stay between $50-60/barrel.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I got in XOM in the low 70s, has been up and down and sitting at low 80s but it&amp;#39;s payingn dividends so can&amp;#39;t complain. I&amp;#39;m not sure an oil recovery is coming anytime soon, feels like it&amp;#39;ll stay between $50-60/barrel.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dgafe4r", "score_hidden": false, "stickied": false, "created": 1492270602.0, "created_utc": 1492241802.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhhq", "removal_reason": null, "link_id": "t3_65hpy4", "likes": null, "replies": "", "user_reports": [], "id": "dgaziyn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RockhopperZP", "parent_id": "t3_65hpy4", "subreddit_name_prefixed": "r/investing", "controversiality": 0, "body": "It's good you're being very careful with renewables right now... they're **heavily** subsidized by the government, and I hear our president's not a fan of the environment so..... \n\nIf the subsidies get cut, which is looking definitely possible right now, renewable companies will absolutely take a dive... It'd be absolutely catastrophic as many are leveraged in debt which was issued with the subsidized profits baked in. Total SA could get destroyed in such a scenario, though honestly I know nothing about that company's particular situation.\n\nWhat I'd do:\n\nYour big oil is a decent position IMO, especially look into those which hedge their sales... It's a huge advantage which allows us to \"drill baby drill\" unlimited amounts without an oil price drop hitting the balance sheets. I believe that if/when the smaller over-debted renewables go into bankrupcy and need to sell their assets, the big energy companies will gobble them up at a discount, so big upside being long \"traditional\" energy companies as opposed to pure renewables.\nAn asset sale happened with SunEdison... and apparently the acquired the assets have been doing well for their new companies. \n\nAlso be careful with GE... I'm a huge fan of the company and think the move to Boston will be great for getting talent moving forward, however look into the export-import bank stuff going on right now... GE is a huge beneficiary and could take a hit depending on how Trump and that dept's new head move forward with that institution.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s good you&amp;#39;re being very careful with renewables right now... they&amp;#39;re &lt;strong&gt;heavily&lt;/strong&gt; subsidized by the government, and I hear our president&amp;#39;s not a fan of the environment so..... &lt;/p&gt;\n\n&lt;p&gt;If the subsidies get cut, which is looking definitely possible right now, renewable companies will absolutely take a dive... It&amp;#39;d be absolutely catastrophic as many are leveraged in debt which was issued with the subsidized profits baked in. Total SA could get destroyed in such a scenario, though honestly I know nothing about that company&amp;#39;s particular situation.&lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;d do:&lt;/p&gt;\n\n&lt;p&gt;Your big oil is a decent position IMO, especially look into those which hedge their sales... It&amp;#39;s a huge advantage which allows us to &amp;quot;drill baby drill&amp;quot; unlimited amounts without an oil price drop hitting the balance sheets. I believe that if/when the smaller over-debted renewables go into bankrupcy and need to sell their assets, the big energy companies will gobble them up at a discount, so big upside being long &amp;quot;traditional&amp;quot; energy companies as opposed to pure renewables.\nAn asset sale happened with SunEdison... and apparently the acquired the assets have been doing well for their new companies. &lt;/p&gt;\n\n&lt;p&gt;Also be careful with GE... I&amp;#39;m a huge fan of the company and think the move to Boston will be great for getting talent moving forward, however look into the export-import bank stuff going on right now... GE is a huge beneficiary and could take a hit depending on how Trump and that dept&amp;#39;s new head move forward with that institution.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "investing", "name": "t1_dgaziyn", "score_hidden": false, "stickied": false, "created": 1492309947.0, "created_utc": 1492281147.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]