[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Python", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m an electrical engineer with a handful of years of experience in C firmware development and a couple years of Python. For a while now, I&amp;#39;ve realized that I don&amp;#39;t want to be in the hardware and low-level programming field, but rather into software.&lt;/p&gt;\n\n&lt;p&gt;My dilemma is simply that I don&amp;#39;t have enough &lt;em&gt;work&lt;/em&gt; experience with higher-level software programming. So the solution is either to a) go back to school (which I don&amp;#39;t want to do because I will lose money and not be able to work) or b) to continue building up my portfolio and eventually get enough experience on my own.&lt;/p&gt;\n\n&lt;p&gt;What are some intermediate-level project ideas that would look good on a programming portfolio &lt;em&gt;in general&lt;/em&gt;? I&amp;#39;m not necessarily going to go head-first into Python (Java would be another option) but Python is what I&amp;#39;m most familiar with at the current time. &lt;/p&gt;\n\n&lt;p&gt;I know building web-based stuff with Flask or Django would probably be a good thing to have a working knowledge of, but I&amp;#39;m not terribly interested in web development. Not yet, at least. What other kinds of projects do you think would look good? So far I&amp;#39;ve used Python to build a few things, such as simple web-scrapers, Scrabble (with pygame) and a fairly complex twitch plays program.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s my github. It&amp;#39;s nothing too impressive yet: &lt;a href=\"https://github.com/jdog127\"&gt;https://github.com/jdog127&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm an electrical engineer with a handful of years of experience in C firmware development and a couple years of Python. For a while now, I've realized that I don't want to be in the hardware and low-level programming field, but rather into software.\n\nMy dilemma is simply that I don't have enough *work* experience with higher-level software programming. So the solution is either to a) go back to school (which I don't want to do because I will lose money and not be able to work) or b) to continue building up my portfolio and eventually get enough experience on my own.\n\nWhat are some intermediate-level project ideas that would look good on a programming portfolio *in general*? I'm not necessarily going to go head-first into Python (Java would be another option) but Python is what I'm most familiar with at the current time. \n\nI know building web-based stuff with Flask or Django would probably be a good thing to have a working knowledge of, but I'm not terribly interested in web development. Not yet, at least. What other kinds of projects do you think would look good? So far I've used Python to build a few things, such as simple web-scrapers, Scrabble (with pygame) and a fairly complex twitch plays program.\n\nHere's my github. It's nothing too impressive yet: https://github.com/jdog127", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64r297", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "jdog127", "saved": false, "mod_reports": [], "name": "t3_64r297", "subreddit_name_prefixed": "r/Python", "approved_by": null, "over_18": false, "domain": "self.Python", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh0y", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Python/comments/64r297/project_ideas_to_boost_my_portfolio_in_general/", "num_reports": null, "locked": false, "stickied": false, "created": 1491948843.0, "url": "https://www.reddit.com/r/Python/comments/64r297/project_ideas_to_boost_my_portfolio_in_general/", "author_flair_text": null, "quarantine": false, "title": "Project ideas to boost my portfolio in general?", "created_utc": 1491920043.0, "distinguished": null, "media": null, "upvote_ratio": 0.71, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh0y", "removal_reason": null, "link_id": "t3_64r297", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh0y", "removal_reason": null, "link_id": "t3_64r297", "likes": null, "replies": "", "user_reports": [], "id": "dg4sz03", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jdog127", "parent_id": "t1_dg4qap6", "subreddit_name_prefixed": "r/Python", "controversiality": 0, "body": "Software in general, I guess. That could mean developing desktop applications or mobile stuff as well. I've been experimenting with Java to develop for Android, but I want to continue building my Python skills for desktop stuff as well. \n\nI'm interested in automation and machine learning too, but I don't have the knowledge and expertise to get into that sort of field right now. I mentioned web dev because I know it's a hot area for Python, but since I'm looking for general intermediate project ideas, I wanted to avoid getting that as a suggestion because I want to get better with OOP in general, not necessarily learn one type of framework. \n\nSince I'm also an electrical engineer, I'm open to the idea of using Python to develop testing suites for hardware as well. Although, I generally want to get *away* from hardware-related programming. \n", "edited": 1491940218.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Software in general, I guess. That could mean developing desktop applications or mobile stuff as well. I&amp;#39;ve been experimenting with Java to develop for Android, but I want to continue building my Python skills for desktop stuff as well. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m interested in automation and machine learning too, but I don&amp;#39;t have the knowledge and expertise to get into that sort of field right now. I mentioned web dev because I know it&amp;#39;s a hot area for Python, but since I&amp;#39;m looking for general intermediate project ideas, I wanted to avoid getting that as a suggestion because I want to get better with OOP in general, not necessarily learn one type of framework. &lt;/p&gt;\n\n&lt;p&gt;Since I&amp;#39;m also an electrical engineer, I&amp;#39;m open to the idea of using Python to develop testing suites for hardware as well. Although, I generally want to get &lt;em&gt;away&lt;/em&gt; from hardware-related programming. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Python", "name": "t1_dg4sz03", "score_hidden": false, "stickied": false, "created": 1491968734.0, "created_utc": 1491939934.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4qap6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Joe_Anonimist", "parent_id": "t3_64r297", "subreddit_name_prefixed": "r/Python", "controversiality": 0, "body": "If not in web development, what are you interested in?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If not in web development, what are you interested in?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Python", "name": "t1_dg4qap6", "score_hidden": false, "stickied": false, "created": 1491965871.0, "created_utc": 1491937071.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]