[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueFilm", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This disturbed me way more than it did the first time, so I had to put my thoughts down in order to understand what&amp;#39;s happening to me, what I&amp;#39;m feeling. What did you think of it? How did it make you feel?  &lt;/p&gt;\n\n&lt;p&gt;Spoilers ahead!&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s my second viewing of Persona and I remember now why it became my favorite movie upon watching it the first time. Factually, almost everything makes sense now, except the surreal and fantastic pills that Bergman likes to throw in his movies, that make everything confusing and fascinating at the same time.&lt;/p&gt;\n\n&lt;p&gt;The movie begins with random sequences from the beginning of cinema, as if Bergman would try to set up a timeline where Persona fits, a distinctive moment in time, a statement among others. He also uses visceral and shocking images to get the viewer&amp;#39;s attention, as well as subliminal messages (I&amp;#39;m looking at that erect penis image flash, it&amp;#39;s like he&amp;#39;s trying to implant the idea that he&amp;#39;s going to fuck our brains) and he surely got my attention (not with the subliminal penis though). After the prolonged prologue we see a kid touching a blurry screen featuring images of two women, fascinated by their faces but not capable of fully comprehending what they are about. This could signify the curiosity of a child glazing upon the first moments of a movie, which fits well with what&amp;#39;s about to happen.\nThe plot materializes when Alma, a nurse, is presented the case of Elizabeth Vogler, an actress which suddenly stopped talking, although being a healthy human being, mentally as well as physically.&lt;/p&gt;\n\n&lt;p&gt;Ingmar Bergman&amp;#39;s main subject for his art represents the human face. He is a master of showing emotions, beautifully conveying the struggle of his characters with powerful angles, directing and light. Light is a very strong compositional factor, the director himself calculating each path, intensity and direction of light in order to achieve exactly what he wants. This topic came into my mind right there at the beginning, when Elizabeth watches a man on TV burning alive and she gets terrified. Her feelings are up scaled by that experience and you can see that as she falls asleep, with her eyes open, with the light slowly dimming off her face, only the light sparks in her eyes being visible. This reminded me of the sometimes gruesome process of falling asleep, when dark thoughts cloud your mind. I was fully aware now of the techniques throughout the film which allowed me to enjoy the experience in a more conscious way.&lt;/p&gt;\n\n&lt;p&gt;Upon this second installment I also remembered what felt so &amp;#39;home&amp;#39; the first time. &amp;quot;The hopeless dream of being, not seeming, but being&amp;quot; says the doctor to Elizabeth. The omnipresent feeling of a proximity destruction wave that might hit you and the angst of overcoming it. The decision of Elizabeth not to talk anymore represents her mechanism to cope with the situation. That&amp;#39;s what I do too, I shut myself in. Alma considers this decision of not talking anymore represents mental fortitude and although I think that&amp;#39;s also true, I think that shutting yourself in represents a masochistic way to cope, deepening the darkness. It&amp;#39;s a selfish way to cope, a safe selfish way to cope, a way in which you can&amp;#39;t trust anyone is capable of understanding what&amp;#39;s happening, not even yourself. Apathy takes over everything.&lt;/p&gt;\n\n&lt;p&gt;Following the plot, Alma and Elizabeth move to a beach house where Alma&amp;#39;s the only one who talks, making us feel the uneasiness of the situation exactly how it&amp;#39;s played out. Alma discloses a secret of her first and last episode of Sex Encounters on a Beach, which later on destroyed her relationship with her lover and caused an abortion. Elizabeth, in turn, discloses this to her doctor, through a letter that is read later by Alma.&lt;/p&gt;\n\n&lt;p&gt;Here, we see both sides. Elizabeth studies the side which talks, examining life through conversation and expression. This is what we do most of the time, trying to research and build a Persona that&amp;#39;s fit of what we want to show to the world. On the flipside, we fall in love with the mystery, with the unknown, with interesting personalities which seem different, special, pure or sincere. We&amp;#39;re presented with dreamlike shots, which accurately illustrate the state of dizziness, drunkenness of a long night. This is a gateway to more dreamlike/confusing/weird sequences when Elizabeth&amp;#39;s husband comes to the house and takes Alma as his wife. This could either represent that their personalities are merging, or that they were the same person this whole time, each representing one half of it.&lt;/p&gt;\n\n&lt;p&gt;The most powerful scene in the film, in my opinion, is the monologue at the end. There are two long shots, each time the same words are used, but one time we&amp;#39;re shown the face of Elizabeth and the other time we see Alma&amp;#39;s face. This represents the root of Elizabeth&amp;#39;s downward spiral and we&amp;#39;re shown both perspectives regarding these facts. On one side we have Elizabeth which is reminded of her decisions, her instinctual feelings and decisions, which eventually caught her from behind, and on the other side we have Alma, which ruthlessly and sincerely lays down the ugly truth, the no curtains reality. This is present in all of Bergman&amp;#39;s films, but here the impact, I feel, is greater. We learn of Elizabeth&amp;#39;s condition, her most haunting feelings and decisions that lead to her present, we learn of her being frightened based upon her facial expressions, as Alma turns into some kind of evil entity that enjoys now making her feel, feel alive. On one hand we have one remorseful person, one which tries to hide, run, isolate herself, or even die, even if it means only socially wise and on the other hand we have the apparent weak person which is open about feelings, experiences and lays everything down on the table. These are distinct layers that form a persona, that separate ourselves when we&amp;#39;re with other people from ourselves when we&amp;#39;re alone, these layers form a twisted cake of human being, present in everyone, maybe more prevalent in the haunted. Then their faces merge into a single one, that itself being a very rewarding moment of the movie, ambiguous, yes, but rewarding nonetheless.&lt;/p&gt;\n\n&lt;p&gt;If only we could be truer...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This disturbed me way more than it did the first time, so I had to put my thoughts down in order to understand what's happening to me, what I'm feeling. What did you think of it? How did it make you feel?  \n\nSpoilers ahead!\n\nIt's my second viewing of Persona and I remember now why it became my favorite movie upon watching it the first time. Factually, almost everything makes sense now, except the surreal and fantastic pills that Bergman likes to throw in his movies, that make everything confusing and fascinating at the same time.\n\nThe movie begins with random sequences from the beginning of cinema, as if Bergman would try to set up a timeline where Persona fits, a distinctive moment in time, a statement among others. He also uses visceral and shocking images to get the viewer's attention, as well as subliminal messages (I'm looking at that erect penis image flash, it's like he's trying to implant the idea that he's going to fuck our brains) and he surely got my attention (not with the subliminal penis though). After the prolonged prologue we see a kid touching a blurry screen featuring images of two women, fascinated by their faces but not capable of fully comprehending what they are about. This could signify the curiosity of a child glazing upon the first moments of a movie, which fits well with what's about to happen.\nThe plot materializes when Alma, a nurse, is presented the case of Elizabeth Vogler, an actress which suddenly stopped talking, although being a healthy human being, mentally as well as physically.\n\nIngmar Bergman's main subject for his art represents the human face. He is a master of showing emotions, beautifully conveying the struggle of his characters with powerful angles, directing and light. Light is a very strong compositional factor, the director himself calculating each path, intensity and direction of light in order to achieve exactly what he wants. This topic came into my mind right there at the beginning, when Elizabeth watches a man on TV burning alive and she gets terrified. Her feelings are up scaled by that experience and you can see that as she falls asleep, with her eyes open, with the light slowly dimming off her face, only the light sparks in her eyes being visible. This reminded me of the sometimes gruesome process of falling asleep, when dark thoughts cloud your mind. I was fully aware now of the techniques throughout the film which allowed me to enjoy the experience in a more conscious way.\n\nUpon this second installment I also remembered what felt so 'home' the first time. \"The hopeless dream of being, not seeming, but being\" says the doctor to Elizabeth. The omnipresent feeling of a proximity destruction wave that might hit you and the angst of overcoming it. The decision of Elizabeth not to talk anymore represents her mechanism to cope with the situation. That's what I do too, I shut myself in. Alma considers this decision of not talking anymore represents mental fortitude and although I think that's also true, I think that shutting yourself in represents a masochistic way to cope, deepening the darkness. It's a selfish way to cope, a safe selfish way to cope, a way in which you can't trust anyone is capable of understanding what's happening, not even yourself. Apathy takes over everything.\n\nFollowing the plot, Alma and Elizabeth move to a beach house where Alma's the only one who talks, making us feel the uneasiness of the situation exactly how it's played out. Alma discloses a secret of her first and last episode of Sex Encounters on a Beach, which later on destroyed her relationship with her lover and caused an abortion. Elizabeth, in turn, discloses this to her doctor, through a letter that is read later by Alma.\n\nHere, we see both sides. Elizabeth studies the side which talks, examining life through conversation and expression. This is what we do most of the time, trying to research and build a Persona that's fit of what we want to show to the world. On the flipside, we fall in love with the mystery, with the unknown, with interesting personalities which seem different, special, pure or sincere. We're presented with dreamlike shots, which accurately illustrate the state of dizziness, drunkenness of a long night. This is a gateway to more dreamlike/confusing/weird sequences when Elizabeth's husband comes to the house and takes Alma as his wife. This could either represent that their personalities are merging, or that they were the same person this whole time, each representing one half of it.\n\nThe most powerful scene in the film, in my opinion, is the monologue at the end. There are two long shots, each time the same words are used, but one time we're shown the face of Elizabeth and the other time we see Alma's face. This represents the root of Elizabeth's downward spiral and we're shown both perspectives regarding these facts. On one side we have Elizabeth which is reminded of her decisions, her instinctual feelings and decisions, which eventually caught her from behind, and on the other side we have Alma, which ruthlessly and sincerely lays down the ugly truth, the no curtains reality. This is present in all of Bergman's films, but here the impact, I feel, is greater. We learn of Elizabeth's condition, her most haunting feelings and decisions that lead to her present, we learn of her being frightened based upon her facial expressions, as Alma turns into some kind of evil entity that enjoys now making her feel, feel alive. On one hand we have one remorseful person, one which tries to hide, run, isolate herself, or even die, even if it means only socially wise and on the other hand we have the apparent weak person which is open about feelings, experiences and lays everything down on the table. These are distinct layers that form a persona, that separate ourselves when we're with other people from ourselves when we're alone, these layers form a twisted cake of human being, present in everyone, maybe more prevalent in the haunted. Then their faces merge into a single one, that itself being a very rewarding moment of the movie, ambiguous, yes, but rewarding nonetheless.\n\nIf only we could be truer...", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64pwx9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 75, "report_reasons": null, "author": "visionagainstboredom", "saved": false, "mod_reports": [], "name": "t3_64pwx9", "subreddit_name_prefixed": "r/TrueFilm", "approved_by": null, "over_18": false, "domain": "self.TrueFilm", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2szp0", "edited": 1491920204.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TrueFilm/comments/64pwx9/persona_1966_if_only_we_could_be_truer/", "num_reports": null, "locked": false, "stickied": false, "created": 1491933659.0, "url": "https://www.reddit.com/r/TrueFilm/comments/64pwx9/persona_1966_if_only_we_could_be_truer/", "author_flair_text": null, "quarantine": false, "title": "Persona (1966) - If only we could be truer.", "created_utc": 1491904859.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 75}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64pwx9", "likes": null, "replies": "", "user_reports": [], "id": "dg4zkus", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "tooPrime", "parent_id": "t3_64pwx9", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Only slightly related, but the Persona reference at the end of Woody Allen's Love and Death made my lose my shit when I saw it just because seeing a Persona referenced anywhere is so unexpected.  \n\nThis bit at the end: https://www.youtube.com/watch?v=_QWjpfCjXSI", "edited": 1491947748.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Only slightly related, but the Persona reference at the end of Woody Allen&amp;#39;s Love and Death made my lose my shit when I saw it just because seeing a Persona referenced anywhere is so unexpected.  &lt;/p&gt;\n\n&lt;p&gt;This bit at the end: &lt;a href=\"https://www.youtube.com/watch?v=_QWjpfCjXSI\"&gt;https://www.youtube.com/watch?v=_QWjpfCjXSI&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg4zkus", "score_hidden": false, "stickied": false, "created": 1491976318.0, "created_utc": 1491947518.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64pwx9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64pwx9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64pwx9", "likes": null, "replies": "", "user_reports": [], "id": "dg6fume", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CajunBmbr", "parent_id": "t1_dg6ea9u", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Thanks, I know what you mean, and yes I agree that there are new ones that do come out most years.  Like you say, the key is seeking them out and finding them, which is half the fun.  \n\nEnjoy...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, I know what you mean, and yes I agree that there are new ones that do come out most years.  Like you say, the key is seeking them out and finding them, which is half the fun.  &lt;/p&gt;\n\n&lt;p&gt;Enjoy...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg6fume", "score_hidden": false, "stickied": false, "created": 1492055363.0, "created_utc": 1492026563.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ea9u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RRRrrr2015", "parent_id": "t1_dg5a9ze", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I think there are a lot of great contemporary films that try to become art. Punch Drunk Love, Tree of Life, American Honey, etc. It's not an overwhelming number of art films, but I don't think there's ever been an overwhelming number of art films at any given moment. You just have to find them and cherish them and revisit them as much as possible\n\nYou say there's a few each year that try, but just remember that Persona was not the norm in 1966 at all.\n\nPersona is indeed a gem and should be cherished forever. Happy rewatching!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think there are a lot of great contemporary films that try to become art. Punch Drunk Love, Tree of Life, American Honey, etc. It&amp;#39;s not an overwhelming number of art films, but I don&amp;#39;t think there&amp;#39;s ever been an overwhelming number of art films at any given moment. You just have to find them and cherish them and revisit them as much as possible&lt;/p&gt;\n\n&lt;p&gt;You say there&amp;#39;s a few each year that try, but just remember that Persona was not the norm in 1966 at all.&lt;/p&gt;\n\n&lt;p&gt;Persona is indeed a gem and should be cherished forever. Happy rewatching!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg6ea9u", "score_hidden": false, "stickied": false, "created": 1492053755.0, "created_utc": 1492024955.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5a9ze", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "CajunBmbr", "parent_id": "t3_64pwx9", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Thanks for writing this up. This is one of my overall favorite films and after reading this I can tell it's time for a rewatch. \n\nWhen reading what you wrote, and thinking about other great films that actually try to become art, it makes me sad thinking about the current state of film. There are some each year that try, but nothing like the stuff we have seen before.\n\nLuckily we do have these gems though to revisit from time to time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for writing this up. This is one of my overall favorite films and after reading this I can tell it&amp;#39;s time for a rewatch. &lt;/p&gt;\n\n&lt;p&gt;When reading what you wrote, and thinking about other great films that actually try to become art, it makes me sad thinking about the current state of film. There are some each year that try, but nothing like the stuff we have seen before.&lt;/p&gt;\n\n&lt;p&gt;Luckily we do have these gems though to revisit from time to time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg5a9ze", "score_hidden": false, "stickied": false, "created": 1491990338.0, "created_utc": 1491961538.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}]