[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueFilm", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Being part of the millennials and being French, there’s one film I always found very iconic for my generation which is Cedric Klapisch « Spanish Apartment » (2002). Yet I never see it mentioned so I guess it isn’t well known or successful in english speaking countries (not so surprising when I see how they butchered the trailer). \nIt’s the tale of Xavier, a student driven but kinda indecisive about what, he ends up going for an Erasmus in Barcelone. (for the non-europeans : Erasmus is an exchange student program between EU states)\nThe film was a success and two other came after it : « Russian Dolls » (2005)  and « Chinese Puzzle » (2013)&lt;/p&gt;\n\n&lt;p&gt;Overall, the trilogy follows Xavier’s struggles through life, it’s supposed to be a rom-com but it feels more about youth and growing up at large rather than specially love. The strong points are the great atmosphere, solid characters and character development. It’s close to the Before trilogy with an ensemble cast around one main character. Dialogue rambles less and tries less to go deep to remain more entertaining. The comparaison holds specially since it also leaves breathing room of a few years between each film for characters to evolve before you reunite with them. As for the technical parts, the montage is the strong point of the director and it’s pretty original in the three films, it adds a nice touch. I would compare it to Jeunet’s montage at times (Amélie, Delicatessen). It also uses a narrator in the same way Fight Club does, with the main character commenting on his struggles and sharing his opinions.&lt;/p&gt;\n\n&lt;p&gt;Spoilers ahead, if you haven’t seen it, I think it’s on Netflix, I recommend it specially if you’re a 20-something&lt;/p&gt;\n\n&lt;p&gt;I think the first movie encapsulates a dream of a multicultural Europe. As they all come to Barcelona for a semester, they are awakened to a broader world, one where an Italian, a German, a Dane, an English, a French, a Spanish have to live together despite being very different. The result is messy, rooms are messy, the fridge is organized chaos, but it’s a mess you’re attracted to. It’s a mess that makes them all better people by the end of the film, what they took away from the semester isn’t an academic knowledge rather than an opened mind. But this melting pot is also difficult, some can’t stand disorder, others wish the first ones would let it go a bit more. And the whole melting pot is only possible because they let go of their prejudice against other nationalities, as shown with the character of William, whose immaturity doesn’t respect it. Europe is after all young and millenials are the first generation to feel they have a european identity on top of their national identity&lt;/p&gt;\n\n&lt;p&gt;The film directly touches directly on identity among a bigger whole in the discussion about catalan identity. The conclusion that identity adds up and makes you richer also apply to the other characters whose new-found european identity adds up to their nationality.&lt;/p&gt;\n\n&lt;p&gt;The following two movies build on multiculturalism to shape an adventurous spirit in all characters, they are not afraid to flicker from a country to another. That is true for Xavier but also for Isabelle, Wendy, William, even Martine. The struggles of the following two movies are a bit different, it’s not about broadening your horizons anymore but more about the struggles of settling, now that they learned how big the world was, how do they satisfy themselves with where they are? Wherever you end up, there must be a better place somewhere. This indecisiveness is often something millennials are criticized for in the workplace. It’s true for work when Xavier immediately drops the job he finally got but also translates to their love life. Isabelle also has the same struggles in her love life.&lt;/p&gt;\n\n&lt;p&gt;The whole trilogy is a lot more mature about growing up than your typical teenage rom-com and I think it’s more than worth a watch. What do you think of it? Have you heard of it? What do you think of these themes in it? I personally like the first two better,, what about you?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Being part of the millennials and being French, there’s one film I always found very iconic for my generation which is Cedric Klapisch « Spanish Apartment » (2002). Yet I never see it mentioned so I guess it isn’t well known or successful in english speaking countries (not so surprising when I see how they butchered the trailer). \nIt’s the tale of Xavier, a student driven but kinda indecisive about what, he ends up going for an Erasmus in Barcelone. (for the non-europeans : Erasmus is an exchange student program between EU states)\nThe film was a success and two other came after it : « Russian Dolls » (2005)  and « Chinese Puzzle » (2013)\n\nOverall, the trilogy follows Xavier’s struggles through life, it’s supposed to be a rom-com but it feels more about youth and growing up at large rather than specially love. The strong points are the great atmosphere, solid characters and character development. It’s close to the Before trilogy with an ensemble cast around one main character. Dialogue rambles less and tries less to go deep to remain more entertaining. The comparaison holds specially since it also leaves breathing room of a few years between each film for characters to evolve before you reunite with them. As for the technical parts, the montage is the strong point of the director and it’s pretty original in the three films, it adds a nice touch. I would compare it to Jeunet’s montage at times (Amélie, Delicatessen). It also uses a narrator in the same way Fight Club does, with the main character commenting on his struggles and sharing his opinions.\n\nSpoilers ahead, if you haven’t seen it, I think it’s on Netflix, I recommend it specially if you’re a 20-something\n\nI think the first movie encapsulates a dream of a multicultural Europe. As they all come to Barcelona for a semester, they are awakened to a broader world, one where an Italian, a German, a Dane, an English, a French, a Spanish have to live together despite being very different. The result is messy, rooms are messy, the fridge is organized chaos, but it’s a mess you’re attracted to. It’s a mess that makes them all better people by the end of the film, what they took away from the semester isn’t an academic knowledge rather than an opened mind. But this melting pot is also difficult, some can’t stand disorder, others wish the first ones would let it go a bit more. And the whole melting pot is only possible because they let go of their prejudice against other nationalities, as shown with the character of William, whose immaturity doesn’t respect it. Europe is after all young and millenials are the first generation to feel they have a european identity on top of their national identity\n\nThe film directly touches directly on identity among a bigger whole in the discussion about catalan identity. The conclusion that identity adds up and makes you richer also apply to the other characters whose new-found european identity adds up to their nationality.\n\nThe following two movies build on multiculturalism to shape an adventurous spirit in all characters, they are not afraid to flicker from a country to another. That is true for Xavier but also for Isabelle, Wendy, William, even Martine. The struggles of the following two movies are a bit different, it’s not about broadening your horizons anymore but more about the struggles of settling, now that they learned how big the world was, how do they satisfy themselves with where they are? Wherever you end up, there must be a better place somewhere. This indecisiveness is often something millennials are criticized for in the workplace. It’s true for work when Xavier immediately drops the job he finally got but also translates to their love life. Isabelle also has the same struggles in her love life.\n\nThe whole trilogy is a lot more mature about growing up than your typical teenage rom-com and I think it’s more than worth a watch. What do you think of it? Have you heard of it? What do you think of these themes in it? I personally like the first two better,, what about you?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64qvbu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 46, "report_reasons": null, "author": "BanjoPanda", "saved": false, "mod_reports": [], "name": "t3_64qvbu", "subreddit_name_prefixed": "r/TrueFilm", "approved_by": null, "over_18": false, "domain": "self.TrueFilm", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2szp0", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TrueFilm/comments/64qvbu/spanish_apartment_trilogy_early_millennials_ideal/", "num_reports": null, "locked": false, "stickied": false, "created": 1491946851.0, "url": "https://www.reddit.com/r/TrueFilm/comments/64qvbu/spanish_apartment_trilogy_early_millennials_ideal/", "author_flair_text": "novice", "quarantine": false, "title": "Spanish Apartment trilogy - Early millennial’s ideal of multiculturalism", "created_utc": 1491918051.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 46}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64qvbu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64qvbu", "likes": null, "replies": "", "user_reports": [], "id": "dg6hbdo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BanjoPanda", "parent_id": "t1_dg6efnc", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "The mess changes as kids get into the equation. Xavier is ~40yo in the last film so it should happen about now in term of timeline\n\nIt might be a tad bit less charming but the spirit is the same and it gives closure to the story, hope you'll enjoy it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The mess changes as kids get into the equation. Xavier is ~40yo in the last film so it should happen about now in term of timeline&lt;/p&gt;\n\n&lt;p&gt;It might be a tad bit less charming but the spirit is the same and it gives closure to the story, hope you&amp;#39;ll enjoy it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg6hbdo", "score_hidden": false, "stickied": false, "created": 1492056862.0, "created_utc": 1492028062.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6efnc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "tikitoka", "parent_id": "t3_64qvbu", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I saw Russian Dolls first only knowing that Audrey Tatou was in it, and by the end I was utterly charmed, and actively searching out everything else Romain Duris and Klapisch have made. I finally tracked down a copy of the Spanish Apartment a few years ago, and like you said, it perfectly captured the global growing pains of the late 20th- early 21st centuries. The world's gotten a whole lot smaller, and we all have to share it. I haven't seen Chinese Puzzle yet, but this post has inspired me to track it down. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I saw Russian Dolls first only knowing that Audrey Tatou was in it, and by the end I was utterly charmed, and actively searching out everything else Romain Duris and Klapisch have made. I finally tracked down a copy of the Spanish Apartment a few years ago, and like you said, it perfectly captured the global growing pains of the late 20th- early 21st centuries. The world&amp;#39;s gotten a whole lot smaller, and we all have to share it. I haven&amp;#39;t seen Chinese Puzzle yet, but this post has inspired me to track it down. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg6efnc", "score_hidden": false, "stickied": false, "created": 1492053911.0, "created_utc": 1492025111.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64qvbu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64qvbu", "likes": null, "replies": "", "user_reports": [], "id": "dg6vkqy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BanjoPanda", "parent_id": "t1_dg6ojz6", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Well to be honest if I saw a trailer like that I wouldn't want to watch the film either. The voiceover in it feel so generic it's terrible.\n\nThe atmosphere is what I like the most too, I haven't found many other buddy movies like that, I like Linklater's Dazed and Confused or Everybody Want Some but they don't feel the same to me, maybe as you say it lacks the multiculturalism element. If you have suggestions, I'll take them!\n\nLove is definitely central in the trilogy. It's the driving force of the characters and it pushes them toward adulthood (not only Xavier but also the others like William) but in the film, it feels more like a consequence of the character's state of mind/maturity rather than the goal of the movie. I make a difference between the goal of the movie and the goal of its character because in these films specially, his goals flickers from one to another. In the end, he could have settled for any of the girls he dated. Each time it went wrong, it's not because of a misunderstanding of some sort but only because he let emotions get to his head and fucked it up or because it turned out it simply didn't work after a while. There's no \"destiny\" to reunite with a specific one as the happy ending. Xavier simply got less impulsive with age and found someone who agreed to share his aspirations.\n\nI agree that it's absolutely not a typical rom-com. I only don't really see another genre to describe it, love is too central to call it a buddy movie (first one is maybe a buddy movie but not the 2nd and 3rd)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well to be honest if I saw a trailer like that I wouldn&amp;#39;t want to watch the film either. The voiceover in it feel so generic it&amp;#39;s terrible.&lt;/p&gt;\n\n&lt;p&gt;The atmosphere is what I like the most too, I haven&amp;#39;t found many other buddy movies like that, I like Linklater&amp;#39;s Dazed and Confused or Everybody Want Some but they don&amp;#39;t feel the same to me, maybe as you say it lacks the multiculturalism element. If you have suggestions, I&amp;#39;ll take them!&lt;/p&gt;\n\n&lt;p&gt;Love is definitely central in the trilogy. It&amp;#39;s the driving force of the characters and it pushes them toward adulthood (not only Xavier but also the others like William) but in the film, it feels more like a consequence of the character&amp;#39;s state of mind/maturity rather than the goal of the movie. I make a difference between the goal of the movie and the goal of its character because in these films specially, his goals flickers from one to another. In the end, he could have settled for any of the girls he dated. Each time it went wrong, it&amp;#39;s not because of a misunderstanding of some sort but only because he let emotions get to his head and fucked it up or because it turned out it simply didn&amp;#39;t work after a while. There&amp;#39;s no &amp;quot;destiny&amp;quot; to reunite with a specific one as the happy ending. Xavier simply got less impulsive with age and found someone who agreed to share his aspirations.&lt;/p&gt;\n\n&lt;p&gt;I agree that it&amp;#39;s absolutely not a typical rom-com. I only don&amp;#39;t really see another genre to describe it, love is too central to call it a buddy movie (first one is maybe a buddy movie but not the 2nd and 3rd)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg6vkqy", "score_hidden": false, "stickied": false, "created": 1492073752.0, "created_utc": 1492044952.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ojz6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bloodybloom", "parent_id": "t3_64qvbu", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I loved L'auberge espagnole! Also liked the sequels, but can't remember much about them anymore. Now I have to watch them all again soon.\n\nLiving in a student dorm where Erasmus students move in every semester, I think the film really nailed down the atmosphere of the contemporary Erasmus lifestyle. Especially the inclusion of all those different languages was well done. Imagine an American remake where everyone was speaking English all the time. It just wouldn't work.\n\nPerhaps thats also the reason for its apparent insignificance with American audiences: the film relies much on cultural subtlety that makes it hard to relate to if you're not European yourself.\n\nAlso I agree with your thoughts about the struggle with European identity and the comparison to the Before trilogy. Interestingly you didn't say much about the role of love in the film. The film didn't strike me as a typical rom-com, rather I felt that it often dealt with love in a mature and authenthic matter, despite the many light moments that still never felt cheap or cliché.", "edited": 1492036659.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I loved L&amp;#39;auberge espagnole! Also liked the sequels, but can&amp;#39;t remember much about them anymore. Now I have to watch them all again soon.&lt;/p&gt;\n\n&lt;p&gt;Living in a student dorm where Erasmus students move in every semester, I think the film really nailed down the atmosphere of the contemporary Erasmus lifestyle. Especially the inclusion of all those different languages was well done. Imagine an American remake where everyone was speaking English all the time. It just wouldn&amp;#39;t work.&lt;/p&gt;\n\n&lt;p&gt;Perhaps thats also the reason for its apparent insignificance with American audiences: the film relies much on cultural subtlety that makes it hard to relate to if you&amp;#39;re not European yourself.&lt;/p&gt;\n\n&lt;p&gt;Also I agree with your thoughts about the struggle with European identity and the comparison to the Before trilogy. Interestingly you didn&amp;#39;t say much about the role of love in the film. The film didn&amp;#39;t strike me as a typical rom-com, rather I felt that it often dealt with love in a mature and authenthic matter, despite the many light moments that still never felt cheap or cliché.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg6ojz6", "score_hidden": false, "stickied": false, "created": 1492065161.0, "created_utc": 1492036361.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]