[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueFilm", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Movies are my life and this year was the year that I found myself really researching and watching every film nominated at the Oscar&amp;#39;s on a critical level. To jump to the point, I saw every film nominated in the 2017 Oscar&amp;#39;s and the film I really am trying to wrap my head around is Moonlight which won Best Picture. I saw Moonlight after it won the award so I came into watching it expecting a fantastic film. It was critically acclaimed and won awards so I thought Moonlight would be a very good movie. After watching the movie I was thoroughly disappointed and thought that the movie was truly stupid and bogus. There was no real meat and true depth to the movie (maybe that was the point). The camera work, artistic style, and acting were all without a doubt were wonderful but there was nothing to the story and that made the film feel like it fell short. I could go into more detail and want to but I just want to see what everyone&amp;#39;s opinion on the film was and if they could bring light to me what made this movie truly award worthy. &lt;/p&gt;\n\n&lt;p&gt;Ps. I understand it was a all black cast and focusing on a gay kid growing up in a harsh environment. I respect that and enjoy the uniquiness and showing this side of culture. Maybe my issue is I just can&amp;#39;t relate to the people in the film so I do not know how their lives truly are in reality. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Movies are my life and this year was the year that I found myself really researching and watching every film nominated at the Oscar's on a critical level. To jump to the point, I saw every film nominated in the 2017 Oscar's and the film I really am trying to wrap my head around is Moonlight which won Best Picture. I saw Moonlight after it won the award so I came into watching it expecting a fantastic film. It was critically acclaimed and won awards so I thought Moonlight would be a very good movie. After watching the movie I was thoroughly disappointed and thought that the movie was truly stupid and bogus. There was no real meat and true depth to the movie (maybe that was the point). The camera work, artistic style, and acting were all without a doubt were wonderful but there was nothing to the story and that made the film feel like it fell short. I could go into more detail and want to but I just want to see what everyone's opinion on the film was and if they could bring light to me what made this movie truly award worthy. \n\nPs. I understand it was a all black cast and focusing on a gay kid growing up in a harsh environment. I respect that and enjoy the uniquiness and showing this side of culture. Maybe my issue is I just can't relate to the people in the film so I do not know how their lives truly are in reality. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64veky", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "McCarbomb", "saved": false, "mod_reports": [], "name": "t3_64veky", "subreddit_name_prefixed": "r/TrueFilm", "approved_by": null, "over_18": false, "domain": "self.TrueFilm", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2szp0", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TrueFilm/comments/64veky/moonlight2016_opinion0ver_rated/", "num_reports": null, "locked": false, "stickied": false, "created": 1491991829.0, "url": "https://www.reddit.com/r/TrueFilm/comments/64veky/moonlight2016_opinion0ver_rated/", "author_flair_text": null, "quarantine": false, "title": "Moonlight(2016)- Opinion/0ver Rated?", "created_utc": 1491963029.0, "distinguished": null, "media": null, "upvote_ratio": 0.52, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64veky", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64veky", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64veky", "likes": null, "replies": "", "user_reports": [], "id": "dg8uslm", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MasterBerry", "parent_id": "t1_dg6i8zz", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "You see, this is where I disagree because so many people look at the tropes rather than the whole of the film. These are all mostly standard pieces in a puzzle of complexity that fall into the film's themes, not something the reliably depends on a narrative thread to believe or become invested through some \"fresh idea.\" The forest over the trees.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You see, this is where I disagree because so many people look at the tropes rather than the whole of the film. These are all mostly standard pieces in a puzzle of complexity that fall into the film&amp;#39;s themes, not something the reliably depends on a narrative thread to believe or become invested through some &amp;quot;fresh idea.&amp;quot; The forest over the trees.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg8uslm", "score_hidden": false, "stickied": false, "created": 1492179963.0, "created_utc": 1492151163.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6i8zz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "oadephon", "parent_id": "t1_dg5dbtu", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "&gt; It's a clichè at this point to say that \"the more specific it is, the more universal it becomes\" but I find that to be true of Moonlight\n\nThis is interesting. To me, I felt the exact opposite about Moonlight. I felt like it only ever really dealt with a general archetype for the character of Chiron, and never really delved into the specificity of a situation. The first two acts are mostly just general things you would expect of a black, gay kid growing up in that environment. His mom does drugs. He gets picked on. He explores sexuality with kids when he's younger, and then in high school he has a brief sexual encounter. He eventually snaps after getting bullied too much. In jail, he decides to put on a tough persona and becomes a drug dealer afterward. It's the sort of story somebody who knew nothing about the situation would write, it's so generic, unspecific, undetailed, and shallow. The only really specific and unusual thing to happen to him is Juan, and even there, Juan dies before the relationship can even be explored deeply. I guess him coming back to meet with Kevin is pretty specific as well, but that's just two things in the entire movie that don't feel like they fall in line with the stereotype.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s a clichè at this point to say that &amp;quot;the more specific it is, the more universal it becomes&amp;quot; but I find that to be true of Moonlight&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is interesting. To me, I felt the exact opposite about Moonlight. I felt like it only ever really dealt with a general archetype for the character of Chiron, and never really delved into the specificity of a situation. The first two acts are mostly just general things you would expect of a black, gay kid growing up in that environment. His mom does drugs. He gets picked on. He explores sexuality with kids when he&amp;#39;s younger, and then in high school he has a brief sexual encounter. He eventually snaps after getting bullied too much. In jail, he decides to put on a tough persona and becomes a drug dealer afterward. It&amp;#39;s the sort of story somebody who knew nothing about the situation would write, it&amp;#39;s so generic, unspecific, undetailed, and shallow. The only really specific and unusual thing to happen to him is Juan, and even there, Juan dies before the relationship can even be explored deeply. I guess him coming back to meet with Kevin is pretty specific as well, but that&amp;#39;s just two things in the entire movie that don&amp;#39;t feel like they fall in line with the stereotype.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg6i8zz", "score_hidden": false, "stickied": false, "created": 1492057816.0, "created_utc": 1492029016.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5dbtu", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "alapdugudis", "parent_id": "t3_64veky", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I understand where you're coming from. I love this movie, but I've had a lot of back-and-forth about it (addressing arguments similar to yours) among my close friends.\n\nI'm not sure if you've seen ScreenPrism's breakdown of Moonlight's use of misc. rhetorical devices, but it's a good jumping off point to understanding the filmmakers' vision: https://www.youtube.com/watch?v=Ot9DX5S8aHk.\n\nI agree that the central narrative is fairly simplistic, and for me that's what I love most about this movie. By restricting the scope of Moonlight's plot, Jenkins and McCraney are able to hone in developing the depth and specificity of each scenario that Chrion encounters.\n\nIt's a clichè at this point to say that \"the more specific it is, the more universal it becomes\" but I find that to be true of Moonlight. For me, its impact arrives in the form of coded language, symbols, and archetypes. Obviously, few of the film's viewers are themselves gay, but it's easy to identify with the swept-up passion of a first love (and shortly thereafter, a first heartbreak), finding a mentor that shepherds you in your formative years, watching your parents come face-to-face with their own insecurities and vulnerabilities as they get older, etc.\n\nFor me, the part of Moonlight that hit home the most was Chiron's reunion with Kevin in the final section. There's a very specific emotion that I've felt at various points in my life: coming back home after a few years away, and encountering people, places, and situations that feel both familiar and foreign. You can go out of your way to reconnect with an old friend or an old flame, but the encounter is just so fraught with the weight of time that's passed. Moonlight absolutely nails this, and that entire sequence is insanely well-directed.\n\nSo I'm not sure if you necessarily need to relate to the lives of the characters. I think Moonlight's beauty is in its moments. Which doesn't really fly for people who are looking for a more fleshed-out narrative; I get that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand where you&amp;#39;re coming from. I love this movie, but I&amp;#39;ve had a lot of back-and-forth about it (addressing arguments similar to yours) among my close friends.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if you&amp;#39;ve seen ScreenPrism&amp;#39;s breakdown of Moonlight&amp;#39;s use of misc. rhetorical devices, but it&amp;#39;s a good jumping off point to understanding the filmmakers&amp;#39; vision: &lt;a href=\"https://www.youtube.com/watch?v=Ot9DX5S8aHk\"&gt;https://www.youtube.com/watch?v=Ot9DX5S8aHk&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;I agree that the central narrative is fairly simplistic, and for me that&amp;#39;s what I love most about this movie. By restricting the scope of Moonlight&amp;#39;s plot, Jenkins and McCraney are able to hone in developing the depth and specificity of each scenario that Chrion encounters.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a clichè at this point to say that &amp;quot;the more specific it is, the more universal it becomes&amp;quot; but I find that to be true of Moonlight. For me, its impact arrives in the form of coded language, symbols, and archetypes. Obviously, few of the film&amp;#39;s viewers are themselves gay, but it&amp;#39;s easy to identify with the swept-up passion of a first love (and shortly thereafter, a first heartbreak), finding a mentor that shepherds you in your formative years, watching your parents come face-to-face with their own insecurities and vulnerabilities as they get older, etc.&lt;/p&gt;\n\n&lt;p&gt;For me, the part of Moonlight that hit home the most was Chiron&amp;#39;s reunion with Kevin in the final section. There&amp;#39;s a very specific emotion that I&amp;#39;ve felt at various points in my life: coming back home after a few years away, and encountering people, places, and situations that feel both familiar and foreign. You can go out of your way to reconnect with an old friend or an old flame, but the encounter is just so fraught with the weight of time that&amp;#39;s passed. Moonlight absolutely nails this, and that entire sequence is insanely well-directed.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m not sure if you necessarily need to relate to the lives of the characters. I think Moonlight&amp;#39;s beauty is in its moments. Which doesn&amp;#39;t really fly for people who are looking for a more fleshed-out narrative; I get that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg5dbtu", "score_hidden": false, "stickied": false, "created": 1491994506.0, "created_utc": 1491965706.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64veky", "likes": null, "replies": "", "user_reports": [], "id": "dg5d5sf", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "end_O_the_world_box", "parent_id": "t3_64veky", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "An interesting thing about the movie was it's plodding pace. Almost all of the movie's major developments occurred between acts. I think it's an effective choice because the audience shares the protagonist's sense of being stuck. It's not a pleasant sensation, but I think it's good filmmaking. \n\nOne thing about making the pace so slow is that you give yourself the potential for incredible depth. There are so many incredibly complicated themes to explore in a story centered on a gay kid growing up in an already oppressed community that is especially oppressive of LGBT people, and Moonlight just didn't do a very impressive job. What the film said was good; it just didn't say very much. \n\nI have many other complaints and praises for Moonlight, but I find this one the most interesting.\n\nSo that's my opinion of the movie. It's good, but it has so much unfulfilled potential. It's certainly not best picture material, but this is by no means the first time the academy has fucked that up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;An interesting thing about the movie was it&amp;#39;s plodding pace. Almost all of the movie&amp;#39;s major developments occurred between acts. I think it&amp;#39;s an effective choice because the audience shares the protagonist&amp;#39;s sense of being stuck. It&amp;#39;s not a pleasant sensation, but I think it&amp;#39;s good filmmaking. &lt;/p&gt;\n\n&lt;p&gt;One thing about making the pace so slow is that you give yourself the potential for incredible depth. There are so many incredibly complicated themes to explore in a story centered on a gay kid growing up in an already oppressed community that is especially oppressive of LGBT people, and Moonlight just didn&amp;#39;t do a very impressive job. What the film said was good; it just didn&amp;#39;t say very much. &lt;/p&gt;\n\n&lt;p&gt;I have many other complaints and praises for Moonlight, but I find this one the most interesting.&lt;/p&gt;\n\n&lt;p&gt;So that&amp;#39;s my opinion of the movie. It&amp;#39;s good, but it has so much unfulfilled potential. It&amp;#39;s certainly not best picture material, but this is by no means the first time the academy has fucked that up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg5d5sf", "score_hidden": false, "stickied": false, "created": 1491994272.0, "created_utc": 1491965472.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64veky", "likes": null, "replies": "", "user_reports": [], "id": "dg5efqv", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64veky", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "[removed]", "edited": 1491969860.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg5efqv", "score_hidden": false, "stickied": false, "created": 1491996113.0, "created_utc": 1491967313.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64veky", "likes": null, "replies": "", "user_reports": [], "id": "dg7691j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "cbo_cho_san", "parent_id": "t3_64veky", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I also wasn't a big fan of Moonlight, the way that all my friends were. I personally was not fond of the film's three-act structure, and I just wish that Barry Jenkins picked one specific moment in Chiron's life, rather than three, and I wish that he focused on telling the story of that one specific moment really well. I felt like the movie more or less told the story of three different characters. I couldn't even explain that feeling very well. It was just in the screenwriting and the performances of the three actors who played Chiron. None of these three actors, nor Barry Jenkins, ever seemed to truly strive to understand the man behind Chiron. Are y'all feelin me?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I also wasn&amp;#39;t a big fan of Moonlight, the way that all my friends were. I personally was not fond of the film&amp;#39;s three-act structure, and I just wish that Barry Jenkins picked one specific moment in Chiron&amp;#39;s life, rather than three, and I wish that he focused on telling the story of that one specific moment really well. I felt like the movie more or less told the story of three different characters. I couldn&amp;#39;t even explain that feeling very well. It was just in the screenwriting and the performances of the three actors who played Chiron. None of these three actors, nor Barry Jenkins, ever seemed to truly strive to understand the man behind Chiron. Are y&amp;#39;all feelin me?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg7691j", "score_hidden": false, "stickied": false, "created": 1492088343.0, "created_utc": 1492059543.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64veky", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64veky", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64veky", "likes": null, "replies": "", "user_reports": [], "id": "dgae4lw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "oadephon", "parent_id": "t1_dg7pv29", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I don't know. This psychology is nuanced and complex. He feels the loneliness and the yearning for connection, but he also ignores the pain? That's interesting and uncommon. It seems to me like most people wouldn't be so willing to open up after that kind of betrayal. So what's different about Chiron? Honestly, I couldn't tell you, and I don't see what the film does to explain his psychology at the choice. Was there something there that I missed? Your key point, that loneliness can trump the pain of the past and feeling anything is better than being alone, is a great point, but I'm not so sure that the film is actually making an attempt to say it. I think you can infer that if you want to, but I think that there are other things you can infer as well. You could infer that Chiron is interested in forgiveness, because he forgives his mom. Or you could infer that it's not lonliness, per se, but pure sexual repression that he's feeling because after the call with Kevin he doesn't think about the pain, but he has a wet dream. I think there are plenty of things you could infer if you want, and yours is *probably* the one the filmmakers wanted, but when you look at the contents of the film it can only really be inferred in an abstract way that isn't actually represented.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know. This psychology is nuanced and complex. He feels the loneliness and the yearning for connection, but he also ignores the pain? That&amp;#39;s interesting and uncommon. It seems to me like most people wouldn&amp;#39;t be so willing to open up after that kind of betrayal. So what&amp;#39;s different about Chiron? Honestly, I couldn&amp;#39;t tell you, and I don&amp;#39;t see what the film does to explain his psychology at the choice. Was there something there that I missed? Your key point, that loneliness can trump the pain of the past and feeling anything is better than being alone, is a great point, but I&amp;#39;m not so sure that the film is actually making an attempt to say it. I think you can infer that if you want to, but I think that there are other things you can infer as well. You could infer that Chiron is interested in forgiveness, because he forgives his mom. Or you could infer that it&amp;#39;s not lonliness, per se, but pure sexual repression that he&amp;#39;s feeling because after the call with Kevin he doesn&amp;#39;t think about the pain, but he has a wet dream. I think there are plenty of things you could infer if you want, and yours is &lt;em&gt;probably&lt;/em&gt; the one the filmmakers wanted, but when you look at the contents of the film it can only really be inferred in an abstract way that isn&amp;#39;t actually represented.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgae4lw", "score_hidden": false, "stickied": false, "created": 1492267367.0, "created_utc": 1492238567.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7pv29", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "FrankOceansWildYears", "parent_id": "t1_dg5j633", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I don't know that I agree with the fact that the betrayal was an impediment to the end. Without a doubt that incident is what caused Chiron to suddenly retreat back into a shell build up a wall of aggression and masculinity, to put defenses up, but by that sudden disconnect and repression of himself he also limited any true continuation of self discovery or emotional connection. He just stopped caring and feeling. The ending of the film is the reawakening of some internal yearning and desire to feel and honestly loneliness like that can trump the bitterness of the past. Feeling anything is better than the ache and emptiness of being alone, of not really connecting with anyone. The feelings of betrayal are probably still repressed but the end isn't a description of a relationship between Chiron and Kevin, it's just a momentary and possible beginning to it. It can be a hopeful beginning, sure, but it's haunted by all the pain that came before it. Maybe that's what moved me about the end, that there was a lot of unsaid pain and  you could still feel it permeating the atmosphere in that stare between Kevin and Chiron. and maybe the pain could be forgotten for a night as long as chiron was no longer alone- there was some solidarity in that- the pain was unsaid between them but that doesn't mean it wasn't understood", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know that I agree with the fact that the betrayal was an impediment to the end. Without a doubt that incident is what caused Chiron to suddenly retreat back into a shell build up a wall of aggression and masculinity, to put defenses up, but by that sudden disconnect and repression of himself he also limited any true continuation of self discovery or emotional connection. He just stopped caring and feeling. The ending of the film is the reawakening of some internal yearning and desire to feel and honestly loneliness like that can trump the bitterness of the past. Feeling anything is better than the ache and emptiness of being alone, of not really connecting with anyone. The feelings of betrayal are probably still repressed but the end isn&amp;#39;t a description of a relationship between Chiron and Kevin, it&amp;#39;s just a momentary and possible beginning to it. It can be a hopeful beginning, sure, but it&amp;#39;s haunted by all the pain that came before it. Maybe that&amp;#39;s what moved me about the end, that there was a lot of unsaid pain and  you could still feel it permeating the atmosphere in that stare between Kevin and Chiron. and maybe the pain could be forgotten for a night as long as chiron was no longer alone- there was some solidarity in that- the pain was unsaid between them but that doesn&amp;#39;t mean it wasn&amp;#39;t understood&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg7pv29", "score_hidden": false, "stickied": false, "created": 1492126588.0, "created_utc": 1492097788.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64veky", "likes": null, "replies": "", "user_reports": [], "id": "dg92f2f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Behem", "parent_id": "t1_dg5j633", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "You just put the finger on the thing i really disliked about the movie. I never really had any empathy with most of the characters, mostly because i feel like i never really got what drives them, and how they think. Chiron is just moving, scene after scene and his will is rarely depicted.\nYet he is a character that achieves a lot, and that is changing drastically year after year, but you never really why. Chiron becomes a jacked gangster, but we're only told how by a very short dialog.\n\nWorst than that, i think the movie did an awful job at representing oppression against young gay guys in the movie. We only have a few sentences from the mother, and the stereotype of the school bully.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You just put the finger on the thing i really disliked about the movie. I never really had any empathy with most of the characters, mostly because i feel like i never really got what drives them, and how they think. Chiron is just moving, scene after scene and his will is rarely depicted.\nYet he is a character that achieves a lot, and that is changing drastically year after year, but you never really why. Chiron becomes a jacked gangster, but we&amp;#39;re only told how by a very short dialog.&lt;/p&gt;\n\n&lt;p&gt;Worst than that, i think the movie did an awful job at representing oppression against young gay guys in the movie. We only have a few sentences from the mother, and the stereotype of the school bully.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg92f2f", "score_hidden": false, "stickied": false, "created": 1492201640.0, "created_utc": 1492172840.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5j633", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "oadephon", "parent_id": "t3_64veky", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Moonlight is fairly cheap and manipulative. I don't think you're wrong in calling it bogus. The last act is the clearest example of this:\n\nFor some reason Chiron has been pining for Kevin's love for years even though Kevin betrayed him in a pretty unforgivable way. When the characters meet, they aren't navigating towards mutual understanding and forgiveness, they're just flirting (with the tiniest amount of dissonance/conflict) so the movie can reach its conclusion about sexual identity and sexual fulfillment. I think it's pretty cheap. It's not subverting expectations about the relationship between the two men, it's just ignoring that any negative expectations existed in the first place. I can see why people aren't bothered by this, but to me it's pretty blatantly dishonest and it undermines any potential power the story could have. Also, I don't think it's too much of a stretch to say that this isn't an isolated incident. The story is too occupied with itself to explore any single relationship to an honest depth.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Moonlight is fairly cheap and manipulative. I don&amp;#39;t think you&amp;#39;re wrong in calling it bogus. The last act is the clearest example of this:&lt;/p&gt;\n\n&lt;p&gt;For some reason Chiron has been pining for Kevin&amp;#39;s love for years even though Kevin betrayed him in a pretty unforgivable way. When the characters meet, they aren&amp;#39;t navigating towards mutual understanding and forgiveness, they&amp;#39;re just flirting (with the tiniest amount of dissonance/conflict) so the movie can reach its conclusion about sexual identity and sexual fulfillment. I think it&amp;#39;s pretty cheap. It&amp;#39;s not subverting expectations about the relationship between the two men, it&amp;#39;s just ignoring that any negative expectations existed in the first place. I can see why people aren&amp;#39;t bothered by this, but to me it&amp;#39;s pretty blatantly dishonest and it undermines any potential power the story could have. Also, I don&amp;#39;t think it&amp;#39;s too much of a stretch to say that this isn&amp;#39;t an isolated incident. The story is too occupied with itself to explore any single relationship to an honest depth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg5j633", "score_hidden": false, "stickied": false, "created": 1492004403.0, "created_utc": 1491975603.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_64veky", "likes": null, "replies": "", "user_reports": [], "id": "dg5p5lc", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Luvs2splooge1985", "parent_id": "t3_64veky", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I have to agree with you in a way, it wasn't as good as i thought it would be, the acts felt disjointed and it sort of looked like a cow milking itself and selling the milk... Buuuut on the other hand... It looked really cool and I still liked it a lot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have to agree with you in a way, it wasn&amp;#39;t as good as i thought it would be, the acts felt disjointed and it sort of looked like a cow milking itself and selling the milk... Buuuut on the other hand... It looked really cool and I still liked it a lot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg5p5lc", "score_hidden": false, "stickied": false, "created": 1492021181.0, "created_utc": 1491992381.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]