[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueFilm", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s been a day or so since Coraline was chosen as one of our Films of the Week, so it&amp;#39;s about time to share our reactions and discuss the movie! Anyone who has seen the movie is allowed to react and discuss it, no matter whether you saw it twenty years or twenty minutes ago, it&amp;#39;s all welcome. Discussions about the meaning, or the symbolism, or anything worth discussing about the movie are embraced, while anyone who just wants to share their reaction to a certain scene or plot point are appreciated as well. It&amp;#39;s encouraged that you have comments over 180 characters, and it&amp;#39;s definitely encouraged that you go into detail within your reaction or discussion.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Fun Fact about Coraline:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Initially the film was going to be live action, and Dakota Fanning was actually going to physically portray Coraline. When it was decided instead to make a stop-motion animated film, Fanning was asked if she would still be interested in providing Coraline&amp;#39;s voice. She said yes, as she thought it would be fun to do, and grew even more excited when she saw what Coraline was going to look like.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Thank you and fire away!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It's been a day or so since Coraline was chosen as one of our Films of the Week, so it's about time to share our reactions and discuss the movie! Anyone who has seen the movie is allowed to react and discuss it, no matter whether you saw it twenty years or twenty minutes ago, it's all welcome. Discussions about the meaning, or the symbolism, or anything worth discussing about the movie are embraced, while anyone who just wants to share their reaction to a certain scene or plot point are appreciated as well. It's encouraged that you have comments over 180 characters, and it's definitely encouraged that you go into detail within your reaction or discussion.\n\n**Fun Fact about Coraline:**\n\n*Initially the film was going to be live action, and Dakota Fanning was actually going to physically portray Coraline. When it was decided instead to make a stop-motion animated film, Fanning was asked if she would still be interested in providing Coraline's voice. She said yes, as she thought it would be fun to do, and grew even more excited when she saw what Coraline was going to look like.*\n\nThank you and fire away!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "TFNC", "id": "65239d", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "PulpFiction1232", "saved": false, "mod_reports": [], "name": "t3_65239d", "subreddit_name_prefixed": "r/TrueFilm", "approved_by": null, "over_18": false, "domain": "self.TrueFilm", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2szp0", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TrueFilm/comments/65239d/netflix_club_henry_selicks_coraline_reactions_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492071153.0, "url": "https://www.reddit.com/r/TrueFilm/comments/65239d/netflix_club_henry_selicks_coraline_reactions_and/", "author_flair_text": null, "quarantine": false, "title": "[Netflix Club] Henry Selick's \"Coraline\" Reactions and Discussions Thread", "created_utc": 1492042353.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65239d", "likes": null, "replies": "", "user_reports": [], "id": "dgaotho", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BourbonAndBasketball", "parent_id": "t3_65239d", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I'm late to the thread, BUT:\n\nPersonally, I think this is Laika's best work overall. \n\nThe stop motion is lovely, as always, but I absolutely adore the design of everything. It's still got that gothic-y influence to it, but it's still cheery enough to capture that childlike fascination for the audience that Coraline feels. The soundtrack is nothing to sneeze at, either. \n\nMy criticisms would probably be as such:\n\nThe titular character would've probably been better off with a different VA - I thought Fanning's work was subpar. \n\nAs enjoyable as the film is, I personally can't appreciate the story past a skin-deep level. Sure, there's a \"be careful what you wish for\" vibe, but even that feels surface level. I remember Coraline far more for its art design than the writing. \n\nThe, er, supernatural elements of the film don't feel very properly addressed. Not even in a \"hidden in mystery\" sort of way. They feel more like they exist as a plot vehicle than anything. \n\nOverall, though, a very accessible and enjoyable film, and possibly my favorite feature length stop-motion film. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m late to the thread, BUT:&lt;/p&gt;\n\n&lt;p&gt;Personally, I think this is Laika&amp;#39;s best work overall. &lt;/p&gt;\n\n&lt;p&gt;The stop motion is lovely, as always, but I absolutely adore the design of everything. It&amp;#39;s still got that gothic-y influence to it, but it&amp;#39;s still cheery enough to capture that childlike fascination for the audience that Coraline feels. The soundtrack is nothing to sneeze at, either. &lt;/p&gt;\n\n&lt;p&gt;My criticisms would probably be as such:&lt;/p&gt;\n\n&lt;p&gt;The titular character would&amp;#39;ve probably been better off with a different VA - I thought Fanning&amp;#39;s work was subpar. &lt;/p&gt;\n\n&lt;p&gt;As enjoyable as the film is, I personally can&amp;#39;t appreciate the story past a skin-deep level. Sure, there&amp;#39;s a &amp;quot;be careful what you wish for&amp;quot; vibe, but even that feels surface level. I remember Coraline far more for its art design than the writing. &lt;/p&gt;\n\n&lt;p&gt;The, er, supernatural elements of the film don&amp;#39;t feel very properly addressed. Not even in a &amp;quot;hidden in mystery&amp;quot; sort of way. They feel more like they exist as a plot vehicle than anything. &lt;/p&gt;\n\n&lt;p&gt;Overall, though, a very accessible and enjoyable film, and possibly my favorite feature length stop-motion film. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgaotho", "score_hidden": false, "stickied": false, "created": 1492294809.0, "created_utc": 1492266009.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]