[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueFilm", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My problems with Singin&amp;#39; in the Rain are these:&lt;/p&gt;\n\n&lt;p&gt;First: Singin&amp;#39; in the Rain is a nasty film.  The whole movie turns on a contrast between sweet, virginal and talented Debbie Reynolds, and stupid, gauche and slatternly Jean Hagen.  While Hagen is actually the funniest and perhaps most likable person in the movie, this feels to me to be in spite of Kelly and Donen&amp;#39;s best efforts; Hagen&amp;#39;s winning performance aside, the movie and everyone in it treats her with contempt.  At the end of the movie she&amp;#39;s rather cruelly exposed by three men as a dubbed actress, her career ruined, while Kelly manipulates Reynolds in order to achieve this exposure; this is supposed to be a happy ending but I can&amp;#39;t quite see what&amp;#39;s happy or funny about it.  Narratively it&amp;#39;s supposed to be justified by Hagen trying to make Reynolds dub her for the length of her contract, but whether or not that justifies what&amp;#39;s done to Hagen, this feels to me like the movie&amp;#39;s contrivance to provide some justification for ultimately punishing the slutty blond, rather than a &amp;quot;real&amp;quot; justification, if that makes any sense.&lt;/p&gt;\n\n&lt;p&gt;The Moses Supposes number is also rather cruel.  As with Hagen, Kelly and his sidekick have contempt for their speaking instructor because he lacks their godlike singing and dancing talent and has nothing to offer them; to show him how useless he is and what superior people they are, they sing his stupid pronunciation exercise and perform this virtuosic tap number in between assaulting him and burying him under piles of furniture.  If you haven&amp;#39;t seen it in a while, watch the scene - not just the more obviously abusive bits, but the intense glare Kelly shoots the instructor at 2:08-12, or the bit where he intimidatingly drags him around the room while pointing to O&amp;#39;Connor&amp;#39;s steps:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=tciT9bmCMq8\"&gt;https://www.youtube.com/watch?v=tciT9bmCMq8&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;To me this is perhaps the most interesting scene in the movie for what it says about Kelly, who choreographed it, but the movie/Kelly/Donen seem to be entirely unaware that this is disturbing behavior; the film reveals this to us about Kelly but it doesn&amp;#39;t intend, I don&amp;#39;t think, to criticize it.&lt;/p&gt;\n\n&lt;p&gt;Second: I haven&amp;#39;t read any good criticism on Singin&amp;#39; in the Rain, but it seems to me the movie&amp;#39;s ideas, besides the virgin/slut contrast I&amp;#39;ve already mentioned, are these: in the silent era, actors, even Kelly&amp;#39;s character, just mugged, sound was a crisis that exposed silent-era stars who lacked &amp;quot;real&amp;quot; talent and temporarily creates a moment of inauthenticity where the people we see on screen are (sometimes) dubbed and aren&amp;#39;t &amp;quot;the real stars&amp;quot; of the movies - here I&amp;#39;m quoting Kelly&amp;#39;s last speech when he tells the audience that Reynolds was the &amp;quot;real star&amp;quot; of The Dancing Cavalier - but after Hollywood goes through this crisis, it emerges in a place where the talent we see is &amp;quot;real,&amp;quot; like Kelly and Reynolds, who can &amp;quot;really&amp;quot; sing and talk and dance beautifully and learn to really act, while non-talent like Hagen is expelled from the movies.  This would make Singin&amp;#39; in the Rain a film that&amp;#39;s ripe for deconstruction if it weren&amp;#39;t so obviously reductive and uninteresting and dumb.  Why, one wants to ask, is Hagen not a &amp;quot;real&amp;quot; star when her image and presence is obviously much more interesting and charismatic (in the movie at least) than that of Reynolds and is the reason people went to see her character&amp;#39;s movies?  Why is being able to speak and sing well the mark of a real star - how is Reynolds, rather than Hagen, the real star of the Dancing Cavalier?  In what sense is the actual Gene Kelly, a balding man dancing around in a toupee, or Reynolds, a non-dancer whose on-screen dancing ability, such as it is, was the product of studio training and artifice, more &amp;quot;real&amp;quot; than Hagen&amp;#39;s character?  Compare the un-reflective simplicity of this film&amp;#39;s ideas to that of The Band Wagon, where there is a somewhat similar narrative trajectory in that the traditional American Broadway musical/dance style ultimately triumphs in the end over arty and balletic European attempts to update the musical, but where that trajectory is complicated by the constant reminders that Astaire&amp;#39;s style is dying out, even if he can still make a successful musical, by the on-display aging of the actor himself, by the ending that&amp;#39;s both upbeat and weirdly melancholy at the same time, and so on.  (I would also note that The Band Wagon treats its analogues to the Hagen character much more humanely and with much more affection.)  &lt;/p&gt;\n\n&lt;p&gt;Before someone brings up that opening scene where Kelly gives the entertainment reporter that BS narration of how he got his start while flashbacks show us how it really was, I think that sequence, far from complicating Kelly&amp;#39;s authenticity, bolsters it; the industry may require him to say all this nonsense, but he says it in such an obviously self-mocking way, and the flashbacks, rather than contradicting him, feel like they&amp;#39;re presented to us by him - as he snows the idiotic reporter, he&amp;#39;s telling us the real story.  Ultimately I find that sequence very smug and pat and a kind of self-inoculation against critique of the Kelly character&amp;#39;s star image rather than a real critique. The same is true of all the fan magazines discussed throughout the movie; ultimately Kelly will pierce their veil and tell the world the real story about how much he loves Reynolds/hates Hagen, just as he and his friends will ultimately cleanse their studio of Hagen&amp;#39;s inauthentic acting and replace it with Reynolds&amp;#39;s &amp;quot;real&amp;quot; talent.&lt;/p&gt;\n\n&lt;p&gt;Third: Other than these uninteresting/uninspiring ideas, I don&amp;#39;t see that the film is really expressive of anything much more than the joy of watching great dancing.  &amp;quot;Be a Clown&amp;quot; at the end of The Pirate seems to me to be a genuinely philosophical statement about Minnelli&amp;#39;s outlook on life and film; it&amp;#39;s also a very strange number (Garland dresses up as a man while dancing with her husband, is thereby liberated*).  The same song in Singin&amp;#39; in the Rain remade as &amp;quot;Make &amp;#39;Em Laugh&amp;quot; is just, to me at least, a bunch of silly goofball antics.  I&amp;#39;m not sure what&amp;#39;s truly great in the film outside of: the title number, the virtuosic/sadistic Moses Supposes, Cyd Charisse&amp;#39;s two minutes, and nothing really else, though Good Morning is very charming.&lt;/p&gt;\n\n&lt;p&gt;*See Fred Camper on the ending of The Pirate:  &lt;a href=\"https://groups.yahoo.com/neo/groups/a_film_by/conversations/messages/7281\"&gt;https://groups.yahoo.com/neo/groups/a_film_by/conversations/messages/7281&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My problems with Singin' in the Rain are these:\n\nFirst: Singin' in the Rain is a nasty film.  The whole movie turns on a contrast between sweet, virginal and talented Debbie Reynolds, and stupid, gauche and slatternly Jean Hagen.  While Hagen is actually the funniest and perhaps most likable person in the movie, this feels to me to be in spite of Kelly and Donen's best efforts; Hagen's winning performance aside, the movie and everyone in it treats her with contempt.  At the end of the movie she's rather cruelly exposed by three men as a dubbed actress, her career ruined, while Kelly manipulates Reynolds in order to achieve this exposure; this is supposed to be a happy ending but I can't quite see what's happy or funny about it.  Narratively it's supposed to be justified by Hagen trying to make Reynolds dub her for the length of her contract, but whether or not that justifies what's done to Hagen, this feels to me like the movie's contrivance to provide some justification for ultimately punishing the slutty blond, rather than a \"real\" justification, if that makes any sense.\n\nThe Moses Supposes number is also rather cruel.  As with Hagen, Kelly and his sidekick have contempt for their speaking instructor because he lacks their godlike singing and dancing talent and has nothing to offer them; to show him how useless he is and what superior people they are, they sing his stupid pronunciation exercise and perform this virtuosic tap number in between assaulting him and burying him under piles of furniture.  If you haven't seen it in a while, watch the scene - not just the more obviously abusive bits, but the intense glare Kelly shoots the instructor at 2:08-12, or the bit where he intimidatingly drags him around the room while pointing to O'Connor's steps:\n\nhttps://www.youtube.com/watch?v=tciT9bmCMq8\n\nTo me this is perhaps the most interesting scene in the movie for what it says about Kelly, who choreographed it, but the movie/Kelly/Donen seem to be entirely unaware that this is disturbing behavior; the film reveals this to us about Kelly but it doesn't intend, I don't think, to criticize it.\n\nSecond: I haven't read any good criticism on Singin' in the Rain, but it seems to me the movie's ideas, besides the virgin/slut contrast I've already mentioned, are these: in the silent era, actors, even Kelly's character, just mugged, sound was a crisis that exposed silent-era stars who lacked \"real\" talent and temporarily creates a moment of inauthenticity where the people we see on screen are (sometimes) dubbed and aren't \"the real stars\" of the movies - here I'm quoting Kelly's last speech when he tells the audience that Reynolds was the \"real star\" of The Dancing Cavalier - but after Hollywood goes through this crisis, it emerges in a place where the talent we see is \"real,\" like Kelly and Reynolds, who can \"really\" sing and talk and dance beautifully and learn to really act, while non-talent like Hagen is expelled from the movies.  This would make Singin' in the Rain a film that's ripe for deconstruction if it weren't so obviously reductive and uninteresting and dumb.  Why, one wants to ask, is Hagen not a \"real\" star when her image and presence is obviously much more interesting and charismatic (in the movie at least) than that of Reynolds and is the reason people went to see her character's movies?  Why is being able to speak and sing well the mark of a real star - how is Reynolds, rather than Hagen, the real star of the Dancing Cavalier?  In what sense is the actual Gene Kelly, a balding man dancing around in a toupee, or Reynolds, a non-dancer whose on-screen dancing ability, such as it is, was the product of studio training and artifice, more \"real\" than Hagen's character?  Compare the un-reflective simplicity of this film's ideas to that of The Band Wagon, where there is a somewhat similar narrative trajectory in that the traditional American Broadway musical/dance style ultimately triumphs in the end over arty and balletic European attempts to update the musical, but where that trajectory is complicated by the constant reminders that Astaire's style is dying out, even if he can still make a successful musical, by the on-display aging of the actor himself, by the ending that's both upbeat and weirdly melancholy at the same time, and so on.  (I would also note that The Band Wagon treats its analogues to the Hagen character much more humanely and with much more affection.)  \n\nBefore someone brings up that opening scene where Kelly gives the entertainment reporter that BS narration of how he got his start while flashbacks show us how it really was, I think that sequence, far from complicating Kelly's authenticity, bolsters it; the industry may require him to say all this nonsense, but he says it in such an obviously self-mocking way, and the flashbacks, rather than contradicting him, feel like they're presented to us by him - as he snows the idiotic reporter, he's telling us the real story.  Ultimately I find that sequence very smug and pat and a kind of self-inoculation against critique of the Kelly character's star image rather than a real critique. The same is true of all the fan magazines discussed throughout the movie; ultimately Kelly will pierce their veil and tell the world the real story about how much he loves Reynolds/hates Hagen, just as he and his friends will ultimately cleanse their studio of Hagen's inauthentic acting and replace it with Reynolds's \"real\" talent.\n\nThird: Other than these uninteresting/uninspiring ideas, I don't see that the film is really expressive of anything much more than the joy of watching great dancing.  \"Be a Clown\" at the end of The Pirate seems to me to be a genuinely philosophical statement about Minnelli's outlook on life and film; it's also a very strange number (Garland dresses up as a man while dancing with her husband, is thereby liberated*).  The same song in Singin' in the Rain remade as \"Make 'Em Laugh\" is just, to me at least, a bunch of silly goofball antics.  I'm not sure what's truly great in the film outside of: the title number, the virtuosic/sadistic Moses Supposes, Cyd Charisse's two minutes, and nothing really else, though Good Morning is very charming.\n\n*See Fred Camper on the ending of The Pirate:  https://groups.yahoo.com/neo/groups/a_film_by/conversations/messages/7281", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "653fz4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "chevronrevanchism", "saved": false, "mod_reports": [], "name": "t3_653fz4", "subreddit_name_prefixed": "r/TrueFilm", "approved_by": null, "over_18": false, "domain": "self.TrueFilm", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/rla5oBk-xeyZ5lI1PCDiKibYjZgHQGxjVKUSJ0GY1ls.jpg?s=acce252dce5d03f6625340d85669c967", "width": 480, "height": 360}, "resolutions": [{"url": "https://i.redditmedia.com/rla5oBk-xeyZ5lI1PCDiKibYjZgHQGxjVKUSJ0GY1ls.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=64dc836cf46b50ac2d27b04b0b3c5ddb", "width": 108, "height": 81}, {"url": "https://i.redditmedia.com/rla5oBk-xeyZ5lI1PCDiKibYjZgHQGxjVKUSJ0GY1ls.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=4fca46d7b88bc1a820023000f52059eb", "width": 216, "height": 162}, {"url": "https://i.redditmedia.com/rla5oBk-xeyZ5lI1PCDiKibYjZgHQGxjVKUSJ0GY1ls.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=159404c0c0415bd78f4765bbb0e7a0a0", "width": 320, "height": 240}], "variants": {}, "id": "WEV4NSow34ZwGhuptyeVycVuZVlo9qOzPh8rYrhLk-c"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2szp0", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TrueFilm/comments/653fz4/i_dont_like_singin_in_the_rain/", "num_reports": null, "locked": false, "stickied": false, "created": 1492087586.0, "url": "https://www.reddit.com/r/TrueFilm/comments/653fz4/i_dont_like_singin_in_the_rain/", "author_flair_text": null, "quarantine": false, "title": "I don't like Singin' in the Rain", "created_utc": 1492058786.0, "distinguished": null, "media": null, "upvote_ratio": 0.68, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_653fz4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_653fz4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_653fz4", "likes": null, "replies": "", "user_reports": [], "id": "dgb2hp0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chevronrevanchism", "parent_id": "t1_dg82i77", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I find her likable because she's easily the funniest and funnest person in the movie, but nothing about my objections to the movie turn on whether she's likable.  Indeed, if the movie were more successful at making her uncomplicatedly unlikable, I would like the movie even less.\n\nThe following is also not really important to the point I'm trying to make, but I see nothing wrong with her trying to take credit for Reynolds's voice work.  The whole point of dubbing their famous star is to make the public believe their star can sing.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I find her likable because she&amp;#39;s easily the funniest and funnest person in the movie, but nothing about my objections to the movie turn on whether she&amp;#39;s likable.  Indeed, if the movie were more successful at making her uncomplicatedly unlikable, I would like the movie even less.&lt;/p&gt;\n\n&lt;p&gt;The following is also not really important to the point I&amp;#39;m trying to make, but I see nothing wrong with her trying to take credit for Reynolds&amp;#39;s voice work.  The whole point of dubbing their famous star is to make the public believe their star can sing.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgb2hp0", "score_hidden": false, "stickied": false, "created": 1492313916.0, "created_utc": 1492285116.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82i77", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "anneoftheisland", "parent_id": "t1_dg7c340", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Yeah, the class-based stereotypes the OP mentioned contrasting Lina and Kathie are legit, but Lina isn't punished because she's low-class. She's punished because she tries so hard to take credit for work she hasn't done.\n\nI can understand criticisms that other characters participate in bad behavior and don't get called on it, but I don't really understand how one interprets Lina's character as \"likable.\" She's an asshole. The fact that other characters are also sometimes assholes doesn't undermine her assholishness.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, the class-based stereotypes the OP mentioned contrasting Lina and Kathie are legit, but Lina isn&amp;#39;t punished because she&amp;#39;s low-class. She&amp;#39;s punished because she tries so hard to take credit for work she hasn&amp;#39;t done.&lt;/p&gt;\n\n&lt;p&gt;I can understand criticisms that other characters participate in bad behavior and don&amp;#39;t get called on it, but I don&amp;#39;t really understand how one interprets Lina&amp;#39;s character as &amp;quot;likable.&amp;quot; She&amp;#39;s an asshole. The fact that other characters are also sometimes assholes doesn&amp;#39;t undermine her assholishness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg82i77", "score_hidden": false, "stickied": false, "created": 1492140080.0, "created_utc": 1492111280.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7c340", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "respighi", "parent_id": "t3_653fz4", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Lina may be charismatic but she's also mean and envious and unlikable - unlikable to most, if not to you. She gets Kathy fired for no good reason, and threatens to sue the studio if Kathy gets a credit for her VO, which credit she of course deserves. Lina's a basic bitch, threatened by the young and talented newcomer vying to replace her. Classic female archetype. That's plenty to justify her villain status, such as it is, in this light-hearted musical comedy. No, it's not entirely fair that the \"real\" star is the singer, but in a musical, it kinda makes sense, and anyway it makes sense Don would feel that way, as he's in love with Kathy and not Lina.\n\nAnd you're reading way too much into Moses Supposes. The emotional essence of that scene is: mischievous boys disobeying their stuffy, old-fashioned teacher. It's Bart Simpson vs. Principal Skinner. There is no \"abuse\" or \"cruelty\". The whole scene is playful and harmless.\n\nThe film expresses a joyous sense of life, evident in the title number and several other scenes, and as an undercurrent throughout. That more than anything explains its enduring appeal. It ain't the songs and dances, terrific as they are. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lina may be charismatic but she&amp;#39;s also mean and envious and unlikable - unlikable to most, if not to you. She gets Kathy fired for no good reason, and threatens to sue the studio if Kathy gets a credit for her VO, which credit she of course deserves. Lina&amp;#39;s a basic bitch, threatened by the young and talented newcomer vying to replace her. Classic female archetype. That&amp;#39;s plenty to justify her villain status, such as it is, in this light-hearted musical comedy. No, it&amp;#39;s not entirely fair that the &amp;quot;real&amp;quot; star is the singer, but in a musical, it kinda makes sense, and anyway it makes sense Don would feel that way, as he&amp;#39;s in love with Kathy and not Lina.&lt;/p&gt;\n\n&lt;p&gt;And you&amp;#39;re reading way too much into Moses Supposes. The emotional essence of that scene is: mischievous boys disobeying their stuffy, old-fashioned teacher. It&amp;#39;s Bart Simpson vs. Principal Skinner. There is no &amp;quot;abuse&amp;quot; or &amp;quot;cruelty&amp;quot;. The whole scene is playful and harmless.&lt;/p&gt;\n\n&lt;p&gt;The film expresses a joyous sense of life, evident in the title number and several other scenes, and as an undercurrent throughout. That more than anything explains its enduring appeal. It ain&amp;#39;t the songs and dances, terrific as they are. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg7c340", "score_hidden": false, "stickied": false, "created": 1492102967.0, "created_utc": 1492074167.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_653fz4", "likes": null, "replies": "", "user_reports": [], "id": "dg7ivgl", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "battraman", "parent_id": "t3_653fz4", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Lina is definitely the most funny character in the film but the film isn't really about her. She's a good clown that moves the plot forward. I wouldn't say I'm sympathetic to her character (she can be pretty nasty) but the film definitely needs her.\n\nDon's backstory is pretty typical of the fake publicity that was common in fan magazines and such in the silent era. One doesn't read Photoplay today thinking they are getting a historical account. It was all about marketing. \n\nPersonally I love Singin' in the Rain, even though it is the typical Hollywood bit of fun. My only complaint is that it plays up silent films as being hokey and absurd (which was still the common thought back in the 50s.) \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lina is definitely the most funny character in the film but the film isn&amp;#39;t really about her. She&amp;#39;s a good clown that moves the plot forward. I wouldn&amp;#39;t say I&amp;#39;m sympathetic to her character (she can be pretty nasty) but the film definitely needs her.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;s backstory is pretty typical of the fake publicity that was common in fan magazines and such in the silent era. One doesn&amp;#39;t read Photoplay today thinking they are getting a historical account. It was all about marketing. &lt;/p&gt;\n\n&lt;p&gt;Personally I love Singin&amp;#39; in the Rain, even though it is the typical Hollywood bit of fun. My only complaint is that it plays up silent films as being hokey and absurd (which was still the common thought back in the 50s.) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg7ivgl", "score_hidden": false, "stickied": false, "created": 1492118253.0, "created_utc": 1492089453.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_653fz4", "likes": null, "replies": "", "user_reports": [], "id": "dg9pl9w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "walter_neft", "parent_id": "t3_653fz4", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "&gt;I don't see that the film is really expressive of anything much more than the joy of watching great dancing.\n\nI really fail to see how this is a problem. You can say that there's no point to watching a Rogers/Astaire musical except for the same reason. Or no reason to watch a Busby Berkely musical besides the choreography. Or no reason to watch a Buster Keaton comedy for anything more than to be amazed by his stunts.\n\nA movie doesn't have to express something deeply meaningful to be a great film. It can excel by simply capturing feats of the human body like singing, dancing, choreography, stunts, and other physicality as well as how those are captured and presented through framing, editing, trick shots, special effects, and cinematography. \n\nJust because a Jackie Chan movie doesn't \"express anything\" through narrative, characters, and themes doesn't mean it isn't a great piece of filmmaking that has highly influenced the form.\n\nFilms can be exceptional due to their pure act of spectacle. Singin' in the Rain is one of the prime examples.", "edited": 1492267810.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t see that the film is really expressive of anything much more than the joy of watching great dancing.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I really fail to see how this is a problem. You can say that there&amp;#39;s no point to watching a Rogers/Astaire musical except for the same reason. Or no reason to watch a Busby Berkely musical besides the choreography. Or no reason to watch a Buster Keaton comedy for anything more than to be amazed by his stunts.&lt;/p&gt;\n\n&lt;p&gt;A movie doesn&amp;#39;t have to express something deeply meaningful to be a great film. It can excel by simply capturing feats of the human body like singing, dancing, choreography, stunts, and other physicality as well as how those are captured and presented through framing, editing, trick shots, special effects, and cinematography. &lt;/p&gt;\n\n&lt;p&gt;Just because a Jackie Chan movie doesn&amp;#39;t &amp;quot;express anything&amp;quot; through narrative, characters, and themes doesn&amp;#39;t mean it isn&amp;#39;t a great piece of filmmaking that has highly influenced the form.&lt;/p&gt;\n\n&lt;p&gt;Films can be exceptional due to their pure act of spectacle. Singin&amp;#39; in the Rain is one of the prime examples.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg9pl9w", "score_hidden": false, "stickied": false, "created": 1492230891.0, "created_utc": 1492202091.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_653fz4", "likes": null, "replies": "", "user_reports": [], "id": "dg7lb0o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RyanSmallwood", "parent_id": "t3_653fz4", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I enjoy **Singin' in the Rain** quite a bit, but I agree with your criticisms, and think they hold the film back from being as good as it could be.  I remember in another musical I quite like, **Broadway Melody of 1940**, George Murphy's character becomes increasingly an asshole as the film goes on, but I felt thrilled when the film finally decided to show some sympathy for his character. More complex antagonists almost always work in a films favor to me.  And it doesn't necessarily always have to be in a friendly, everyone gets along kind of way, to use an example from another genre, in a film like **The Westerner** I really like how the villain can totally despicable, but still likeable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I enjoy &lt;strong&gt;Singin&amp;#39; in the Rain&lt;/strong&gt; quite a bit, but I agree with your criticisms, and think they hold the film back from being as good as it could be.  I remember in another musical I quite like, &lt;strong&gt;Broadway Melody of 1940&lt;/strong&gt;, George Murphy&amp;#39;s character becomes increasingly an asshole as the film goes on, but I felt thrilled when the film finally decided to show some sympathy for his character. More complex antagonists almost always work in a films favor to me.  And it doesn&amp;#39;t necessarily always have to be in a friendly, everyone gets along kind of way, to use an example from another genre, in a film like &lt;strong&gt;The Westerner&lt;/strong&gt; I really like how the villain can totally despicable, but still likeable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg7lb0o", "score_hidden": false, "stickied": false, "created": 1492121448.0, "created_utc": 1492092648.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_653fz4", "likes": null, "replies": "", "user_reports": [], "id": "dg9cwoq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DrainTheStain", "parent_id": "t3_653fz4", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I feel like the opening, where Don tells his story. Is indicitive of the struggle celebrities face in balancing being who they are (the visuals of Don's story) and who they want us to believe to be (his actual story).\nAs far as Lina's and Don's ego in the story.You feel like Lina is walked over, and treated badly.There is a power struggle every day between actors-directors,athletes-mangers etc etc.\n\nThe Lina treatment is akin to a star player not realizing they are on the decline. Her ego, which is boosted by the tabloids.Doesn't lend her to being willing to work, or even see her faults. As she constantly reads she doesn't have any.\n\nAs far as Don goes. There are people who politic in any career. He is someone willing to do the work.As well as find avenues to extend his career.Kathy is the avenue he has, to extend his career. \nTo some degree Kathy/Don are the reverse Don/Lina.As far as how the star treats the newcomer.Once the star sees how the studio views the newcomer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like the opening, where Don tells his story. Is indicitive of the struggle celebrities face in balancing being who they are (the visuals of Don&amp;#39;s story) and who they want us to believe to be (his actual story).\nAs far as Lina&amp;#39;s and Don&amp;#39;s ego in the story.You feel like Lina is walked over, and treated badly.There is a power struggle every day between actors-directors,athletes-mangers etc etc.&lt;/p&gt;\n\n&lt;p&gt;The Lina treatment is akin to a star player not realizing they are on the decline. Her ego, which is boosted by the tabloids.Doesn&amp;#39;t lend her to being willing to work, or even see her faults. As she constantly reads she doesn&amp;#39;t have any.&lt;/p&gt;\n\n&lt;p&gt;As far as Don goes. There are people who politic in any career. He is someone willing to do the work.As well as find avenues to extend his career.Kathy is the avenue he has, to extend his career. \nTo some degree Kathy/Don are the reverse Don/Lina.As far as how the star treats the newcomer.Once the star sees how the studio views the newcomer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg9cwoq", "score_hidden": false, "stickied": false, "created": 1492215937.0, "created_utc": 1492187137.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_653fz4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_653fz4", "likes": null, "replies": "", "user_reports": [], "id": "dg84o0p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "danzigismycopilot", "parent_id": "t1_dg7jlbu", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "&gt;  something dislikable about his character in his films\n\nI noticed this. Sort of an underlying something that Astaire lacked. Maybe it's cynicism or the modern \"ironic distance\" thing we all have now that was ushered it - that is different from the hokey, unassuming good natured-ness of Astaire.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;something dislikable about his character in his films&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I noticed this. Sort of an underlying something that Astaire lacked. Maybe it&amp;#39;s cynicism or the modern &amp;quot;ironic distance&amp;quot; thing we all have now that was ushered it - that is different from the hokey, unassuming good natured-ness of Astaire.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg84o0p", "score_hidden": false, "stickied": false, "created": 1492142425.0, "created_utc": 1492113625.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jlbu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rhubarbjelly", "parent_id": "t3_653fz4", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "This post made me laugh! I also find the treatment of Lina in the movie to be excessively cruel. I find the ending where she is 'exposed' uncomfortable viewing. I also agree with you about the speech instructor scene. I have always felt sorry for him - the two male stars are basically assholes. 'Make Em Laugh' is my least favourite scene in the movie - it's the unfunniest thing I've ever seen. Forced entertainment indeed. \n\nI would go further with your take on Kelly's character in that I also find his treatment of Reynolds throughout the film questionable. He makes her feel extremely uncomfortable in some scenes, and is persistant to the point of insensitivity. His stunt at the end could potentially have been deeply humiliating for both women. He's basically a bully. This is mirrored by Kelly's reported treatment of Reynolds during her training for *Singin In The Rain*, when Reynolds was put through some sort of punishing dance boot camp by Kelly which left her a physical and emotional wreck (although Reynolds later spoke of this as a positive experience). Reynolds was 18 - I believe Kelly was 40 at the time. Kelly was a brilliantly tallented performer and an extraordinary dancer. But from a modern perspective there's something dislikable about his character in his films. I'm not sure how sincere I ever find him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This post made me laugh! I also find the treatment of Lina in the movie to be excessively cruel. I find the ending where she is &amp;#39;exposed&amp;#39; uncomfortable viewing. I also agree with you about the speech instructor scene. I have always felt sorry for him - the two male stars are basically assholes. &amp;#39;Make Em Laugh&amp;#39; is my least favourite scene in the movie - it&amp;#39;s the unfunniest thing I&amp;#39;ve ever seen. Forced entertainment indeed. &lt;/p&gt;\n\n&lt;p&gt;I would go further with your take on Kelly&amp;#39;s character in that I also find his treatment of Reynolds throughout the film questionable. He makes her feel extremely uncomfortable in some scenes, and is persistant to the point of insensitivity. His stunt at the end could potentially have been deeply humiliating for both women. He&amp;#39;s basically a bully. This is mirrored by Kelly&amp;#39;s reported treatment of Reynolds during her training for &lt;em&gt;Singin In The Rain&lt;/em&gt;, when Reynolds was put through some sort of punishing dance boot camp by Kelly which left her a physical and emotional wreck (although Reynolds later spoke of this as a positive experience). Reynolds was 18 - I believe Kelly was 40 at the time. Kelly was a brilliantly tallented performer and an extraordinary dancer. But from a modern perspective there&amp;#39;s something dislikable about his character in his films. I&amp;#39;m not sure how sincere I ever find him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg7jlbu", "score_hidden": false, "stickied": false, "created": 1492119237.0, "created_utc": 1492090437.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]