[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueFilm", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The film concerns three stories that unravel across Montana. Despite the title, none of the three central women are certain – as in confident and secure – in themselves. Nor is the film about womanness, but pertains only to &lt;em&gt;certain&lt;/em&gt; women. The degree of certainty, predictability, of the bad life, is ransomed by the freedom of uncertainty, the unknown, the new; which only a certain few wish. The narratives only interrelate in passing, yet the sequence as a whole, as well as the form in which they appear, demand a &lt;em&gt;certain&lt;/em&gt; illumination to achieve justice.  &lt;/p&gt;\n\n&lt;p&gt;The form overall is minimalist without the usual reliance on industrial materials or the individual object, nor excessive cuts or shot procedures. The look of the image contravenes the usual brittleness of social realism, running the picture against the grain of the documentary feel. Instead allowing an image suited to contrasts of light, as well as natural and urban landscapes. The intervention of style both retrieves the narrative from banality whilst quelling the desire for action, activity, movement, speed, which would revoke realism and mute the critique of everyday life. &lt;/p&gt;\n\n&lt;p&gt;The shots are basically medium distance, with no real close-up or long-shots. This saves the form from falling into a false intimacy which the narrative pulls against; or an abstracting distance subverting the pressure on the individual which the narratives takes itself as the measure of. Form thus stays within the bounds of social realism, no shot is more than the eye a present person could muster. We, the watchers, haunt the characters, or weight their backs like Baudelaire&amp;#39;s chimeras, given access to experience, to the primacy of the self that humans as individuals must bare but which all wish to shake off in the Other. &lt;/p&gt;\n\n&lt;p&gt;Diegetic sound dominates, long periods of silence or minimal noise lures us into the monads of the characters that they themselves suffer. Scenes of car travel aren&amp;#39;t obliterated by the heavy-handed soundtrack to occupy the lazy ear of viewers, instead a reality calls in which silence between people or for a person issues much more than the readymade distractions. No caricatures are allowed, no one stands above the real as idol to our aspirations.&lt;/p&gt;\n\n&lt;p&gt;The first story focuses on a lawyer and her desperate client who mounts a comically inept hostage situation. The second on a wife, and the frustrations of building – literally and figuratively – a home in the midst of troubled relations with her husband and daughter. The last and most important, follows a young stable-hand as she seeks companionship. &lt;/p&gt;\n\n&lt;p&gt;Some preliminary issues: the first two women suffer what Beauvoir called woman&amp;#39;s “relative being”, the inescapable orbit of that other-side of the gender-binary against which women get defined. A relativity that unfolds as the inability of a professional women&amp;#39;s advice to be taken seriously by male clients; or the consistent rerouting of a wife opinions through the husband which grants the stamp of law to what could otherwise be the mere offhand interjections of the &amp;#39;sensual sex&amp;#39;. Both these two stories feature womanness caught in the web of success and responsibility, and the persistent lack both of which impose. Both suffer a guilt; the first women for her capitulation to the police when her depressed client mounts a failed hostage situation; the second for a family-friend suffering the onset of dementia who&amp;#39;s purchase of bricks from she feels somehow deceived him.&lt;sup&gt;1&lt;/sup&gt; &lt;/p&gt;\n\n&lt;p&gt;The third story&lt;sup&gt;2&lt;/sup&gt; features a ranch-hand Jamie (Lily Gladstone), and though possessing formal and thematic affinity with the preceding stories, achieves a realm of intimacy and breathlessness in contrast to the previous which saves the whole from an otherwise banality of evil. It tracks a lonely young women who&amp;#39;s only relationship seems to be with the horses in her care. In an attempt to break through her sealed solitude she stumbles into a night-school class lead by intriguingly bumbling graduate Beth Travis – played by Kristen Stewart – whom she befriends. The allure of this girl, and the hurried minutes she eats in town before fleeing across the prairies to another job  next-morning, makes work bearable. Jamie returns each Thursday, setting up a rhythm of short meals after class to counter the rhythm of her work-life. In the repetitions, the twitches of Jamie&amp;#39;s face relay an emergent enthralment; Beth this other lonely outpost, can she redeem Jamie&amp;#39;s empty life? Break the spell of its solitude? &lt;/p&gt;\n\n&lt;p&gt;One Thursday Jamie decides to ride a horse into town, to show Beth Travis and chauffeur them both to their usual cafe before the latter rushes off. Somewhat surprised by this brave yet reserved girls comical offer any confusion is quickly eclipsed by the demands of time tethered to work. The physical intimacy arrange by Jamie seems posed to mutate into something who&amp;#39;s wish has hitherto hung in the background. In their return from the cafe – the methodical pace of the horse a ploy to lengthen their time together – Beth Travis, tentatively leans forward and seems to hold Jamie with more feeling and unknown purpose than mere safety would demand. An embrace that overrides the usual lay division of love/platonic companionship, and bellows a flame who&amp;#39;s ineffable authenticity echoes not only against that image&amp;#39;s heterosexual form in cowboy movies, but against every character in this film. The moment isn&amp;#39;t left to linger for us or the characters, and the uncomfortable clank of hooves on asphalt is replaced by the familiar screech of car-tires as Beth Travis leaves and we and Jamie look-on as bad reality returns again. &lt;/p&gt;\n\n&lt;p&gt;Thursday falls again, and Jamie waits again, at the back of the class, only this time, no Beth. Her replacement briskly informs all that she&amp;#39;s quit apparently finding the long-drive too tortuous. Jamie is certain; she&amp;#39;ll find Beth. Eventually she does, and confronts Beth in a parking-lot. Words, let alone mine, won&amp;#39;t do justice to this moment. A moment of indeterminateness, when sedimented hopes enter the atmosphere and burn-up, giving us fireworks without the bang. It is not overzealous to enter this scene as our era&amp;#39;s contender to the finale of &lt;em&gt;City Lights&lt;/em&gt;; and it speaks more truth today than that scene ever did. As Jamie&amp;#39;s car rolls out of town, the camera is transfixed on her features, the cry of her eyes, the silence, and then the music – the first in the film – slowly begins to chime as Jamie begins the wandering cruise home to the horses.&lt;/p&gt;\n\n&lt;p&gt;At the crucial moment when music does enter, it does so delicately and self-consciously not wishing to override nor monumentalise in a bombastic manner the turmoil of the scene. That a greater emotional depth is achieved without crescendo, as the few words, the shuffles, the contortions of the face and body, do more, transmit more, than even the most febrile orchestral motifs; who&amp;#39;s existence tends to sell the scene to the viewers emotions, substituting immersion with the Other, the art, for immersion in ones own feelings however overwhelming, which the film has only instanced. The form of the film holds off from wallowing in that self despite the narratives focus on it; the quicksand of “relating to the characters” is proposed and admonished in equal measure, as any “relating” would cancel out the very loneliness of relations which is the film substance. &lt;/p&gt;\n\n&lt;p&gt;More than solitude, real horror lies where closeness, the availability of others, provides no antidote to the lack. Distance between people isn&amp;#39;t determined by their own manners, but to that nameless social law to which each owes their self and which arranges them according to its own interests. As the film testifies, the possibility of actually entering mistakes or committing personal mishaps and sin, is denied by the demands of an economy of pure animalistic survival; like Jamie, you have to go out of your way to live, and even then noting&amp;#39;s &lt;em&gt;certain&lt;/em&gt;. How &lt;em&gt;La La Land&lt;/em&gt; demurs on this point whilst moping up the blood and tears to make way for more, transports it into the category of the truly barbaric art. &lt;/p&gt;\n\n&lt;p&gt;The film ends with a close on each characters story. The lawyer is forgiven by her client, who petitions her to send him letters “about anything” while in prison. The wife, performs the labour of that role and doles out burgers to her family and friends, and then sneaks away for a cigarette allowing herself a first smile as she looks upon the reclaimed bricks that will amount to a house [if not a home]. Both propose a pallid reconciliation, which cannot cover for the film&amp;#39;s miasma. Life scars aren&amp;#39;t exited by the puff of nicotine or the chuff “lets get on with it” which only surrenders to the repeated branding. These woman have learnt to negotiate the storm and find solace in the finitude, the mishaps of the everyday which can always be relied upon to end, or in todays jargon “be entertaining”. With the script of their life written they&amp;#39;re free to act their parts with all the flair the role allows without ever breaking the monads&amp;#39; walls, daring to be anything other than a statistic even to themselves. &amp;#39;That freedom is left to youth&amp;#39; they&amp;#39;d undoubtedly say, sure in the lie they tell themselves to ward off that realm of hope and its twin despair, the uncomfortable substance of the freedom most barter away. Though both suffer the consciousness of living unfilled, the kind of experiments in sprit that could recover that are too uncomfortable to broach. Yet formally both are overtaken by the last story, which saves them and the whole from complete weltschmerz and acedia, transforming the weight of their warning into the ballast for the final ship: To New Seas!  &lt;/p&gt;\n\n&lt;p&gt;The closing of the future – so lamented in current discourse – is its predigestion and pre-planning by the &lt;em&gt;ever-present&lt;/em&gt;. In an era where the very survival of the individual is at stake and to which the official dogma of individualism makes a mockery, the final story holds out hope without relapsing into giddy false optimism. It sidesteps empty solace and the temporary fix for the desiccate subjects in who&amp;#39;s image the previous protagonists where made. The final story dares to let suffering speak, and on that condition grants fragmentary access to a realm of human relatedness outside that demanded by the present. A hope it confiscates from chat-show charlatans and ersatz dictators; one which refuses to look away and suffers for it. Though formally enveloped by the film; Jamie, unlike the rest, has refused to make peace with the world. Freedom is what you do with what&amp;#39;s been done to you. Ambiguity survives, the promise of happiness is just that, a promise. Every stage is set against the person, our society favours its own reproduction alone, indifferent to the husks of life dragged in its wake; all humans struggle to be more than their social function, a mere instrument, unconsciously bargained away for a reward that&amp;#39;s always delayed. Jamie misses, but she let herself enter what she is not. Not every flowering blossom blooms. She resists the way of the world, refuses, risks, and in doing so sings hope.   &lt;/p&gt;\n\n&lt;p&gt;Hence the only certain woman is the most uncertain; Jamie, who acts on the certainty of life vacuousness and makes it uncertain, gaining with it the truth and the promise which, forever broken for the rest, survives the world&amp;#39;s catastrophes. The film offers no easy escape, yet its fragmented narrative progresses in the reverse order to life; from the divorcee professional, through homemaker, to youth precariat. Only the last gets music. Missing the closing salutary scenes of sugar-coating, Jamie is treated to the harshness of an unflinchingly static camera as she distributes the horses among the pens, still alone, whilst in the distance the great yonder beckons. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;sup&gt;1&lt;/sup&gt; in both cases the men towards which these women feel guilt are also those over-which they have a degree of power, to which the men repay with offhand misogyny; yet both are inescapably decaying characters – one heading for prison the other evaporation of his self leaving a bodily substrate – helping incur the guilt&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;2&lt;/sup&gt; The trinity of narratives is based on short stories from various Maile Meloy books; I read the third one here, &lt;em&gt;Travis. B&lt;/em&gt; which has several key differences to the filmic version and is not as good. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The film concerns three stories that unravel across Montana. Despite the title, none of the three central women are certain – as in confident and secure – in themselves. Nor is the film about womanness, but pertains only to *certain* women. The degree of certainty, predictability, of the bad life, is ransomed by the freedom of uncertainty, the unknown, the new; which only a certain few wish. The narratives only interrelate in passing, yet the sequence as a whole, as well as the form in which they appear, demand a *certain* illumination to achieve justice.  \n\nThe form overall is minimalist without the usual reliance on industrial materials or the individual object, nor excessive cuts or shot procedures. The look of the image contravenes the usual brittleness of social realism, running the picture against the grain of the documentary feel. Instead allowing an image suited to contrasts of light, as well as natural and urban landscapes. The intervention of style both retrieves the narrative from banality whilst quelling the desire for action, activity, movement, speed, which would revoke realism and mute the critique of everyday life. \n\nThe shots are basically medium distance, with no real close-up or long-shots. This saves the form from falling into a false intimacy which the narrative pulls against; or an abstracting distance subverting the pressure on the individual which the narratives takes itself as the measure of. Form thus stays within the bounds of social realism, no shot is more than the eye a present person could muster. We, the watchers, haunt the characters, or weight their backs like Baudelaire's chimeras, given access to experience, to the primacy of the self that humans as individuals must bare but which all wish to shake off in the Other. \n\nDiegetic sound dominates, long periods of silence or minimal noise lures us into the monads of the characters that they themselves suffer. Scenes of car travel aren't obliterated by the heavy-handed soundtrack to occupy the lazy ear of viewers, instead a reality calls in which silence between people or for a person issues much more than the readymade distractions. No caricatures are allowed, no one stands above the real as idol to our aspirations.\n\nThe first story focuses on a lawyer and her desperate client who mounts a comically inept hostage situation. The second on a wife, and the frustrations of building – literally and figuratively – a home in the midst of troubled relations with her husband and daughter. The last and most important, follows a young stable-hand as she seeks companionship. \n\nSome preliminary issues: the first two women suffer what Beauvoir called woman's “relative being”, the inescapable orbit of that other-side of the gender-binary against which women get defined. A relativity that unfolds as the inability of a professional women's advice to be taken seriously by male clients; or the consistent rerouting of a wife opinions through the husband which grants the stamp of law to what could otherwise be the mere offhand interjections of the 'sensual sex'. Both these two stories feature womanness caught in the web of success and responsibility, and the persistent lack both of which impose. Both suffer a guilt; the first women for her capitulation to the police when her depressed client mounts a failed hostage situation; the second for a family-friend suffering the onset of dementia who's purchase of bricks from she feels somehow deceived him.^1 \n\nThe third story^2 features a ranch-hand Jamie (Lily Gladstone), and though possessing formal and thematic affinity with the preceding stories, achieves a realm of intimacy and breathlessness in contrast to the previous which saves the whole from an otherwise banality of evil. It tracks a lonely young women who's only relationship seems to be with the horses in her care. In an attempt to break through her sealed solitude she stumbles into a night-school class lead by intriguingly bumbling graduate Beth Travis – played by Kristen Stewart – whom she befriends. The allure of this girl, and the hurried minutes she eats in town before fleeing across the prairies to another job  next-morning, makes work bearable. Jamie returns each Thursday, setting up a rhythm of short meals after class to counter the rhythm of her work-life. In the repetitions, the twitches of Jamie's face relay an emergent enthralment; Beth this other lonely outpost, can she redeem Jamie's empty life? Break the spell of its solitude? \n\nOne Thursday Jamie decides to ride a horse into town, to show Beth Travis and chauffeur them both to their usual cafe before the latter rushes off. Somewhat surprised by this brave yet reserved girls comical offer any confusion is quickly eclipsed by the demands of time tethered to work. The physical intimacy arrange by Jamie seems posed to mutate into something who's wish has hitherto hung in the background. In their return from the cafe – the methodical pace of the horse a ploy to lengthen their time together – Beth Travis, tentatively leans forward and seems to hold Jamie with more feeling and unknown purpose than mere safety would demand. An embrace that overrides the usual lay division of love/platonic companionship, and bellows a flame who's ineffable authenticity echoes not only against that image's heterosexual form in cowboy movies, but against every character in this film. The moment isn't left to linger for us or the characters, and the uncomfortable clank of hooves on asphalt is replaced by the familiar screech of car-tires as Beth Travis leaves and we and Jamie look-on as bad reality returns again. \n\nThursday falls again, and Jamie waits again, at the back of the class, only this time, no Beth. Her replacement briskly informs all that she's quit apparently finding the long-drive too tortuous. Jamie is certain; she'll find Beth. Eventually she does, and confronts Beth in a parking-lot. Words, let alone mine, won't do justice to this moment. A moment of indeterminateness, when sedimented hopes enter the atmosphere and burn-up, giving us fireworks without the bang. It is not overzealous to enter this scene as our era's contender to the finale of *City Lights*; and it speaks more truth today than that scene ever did. As Jamie's car rolls out of town, the camera is transfixed on her features, the cry of her eyes, the silence, and then the music – the first in the film – slowly begins to chime as Jamie begins the wandering cruise home to the horses.\n\nAt the crucial moment when music does enter, it does so delicately and self-consciously not wishing to override nor monumentalise in a bombastic manner the turmoil of the scene. That a greater emotional depth is achieved without crescendo, as the few words, the shuffles, the contortions of the face and body, do more, transmit more, than even the most febrile orchestral motifs; who's existence tends to sell the scene to the viewers emotions, substituting immersion with the Other, the art, for immersion in ones own feelings however overwhelming, which the film has only instanced. The form of the film holds off from wallowing in that self despite the narratives focus on it; the quicksand of “relating to the characters” is proposed and admonished in equal measure, as any “relating” would cancel out the very loneliness of relations which is the film substance. \n\nMore than solitude, real horror lies where closeness, the availability of others, provides no antidote to the lack. Distance between people isn't determined by their own manners, but to that nameless social law to which each owes their self and which arranges them according to its own interests. As the film testifies, the possibility of actually entering mistakes or committing personal mishaps and sin, is denied by the demands of an economy of pure animalistic survival; like Jamie, you have to go out of your way to live, and even then noting's *certain*. How *La La Land* demurs on this point whilst moping up the blood and tears to make way for more, transports it into the category of the truly barbaric art. \n\nThe film ends with a close on each characters story. The lawyer is forgiven by her client, who petitions her to send him letters “about anything” while in prison. The wife, performs the labour of that role and doles out burgers to her family and friends, and then sneaks away for a cigarette allowing herself a first smile as she looks upon the reclaimed bricks that will amount to a house [if not a home]. Both propose a pallid reconciliation, which cannot cover for the film's miasma. Life scars aren't exited by the puff of nicotine or the chuff “lets get on with it” which only surrenders to the repeated branding. These woman have learnt to negotiate the storm and find solace in the finitude, the mishaps of the everyday which can always be relied upon to end, or in todays jargon “be entertaining”. With the script of their life written they're free to act their parts with all the flair the role allows without ever breaking the monads' walls, daring to be anything other than a statistic even to themselves. 'That freedom is left to youth' they'd undoubtedly say, sure in the lie they tell themselves to ward off that realm of hope and its twin despair, the uncomfortable substance of the freedom most barter away. Though both suffer the consciousness of living unfilled, the kind of experiments in sprit that could recover that are too uncomfortable to broach. Yet formally both are overtaken by the last story, which saves them and the whole from complete weltschmerz and acedia, transforming the weight of their warning into the ballast for the final ship: To New Seas!  \n\nThe closing of the future – so lamented in current discourse – is its predigestion and pre-planning by the *ever-present*. In an era where the very survival of the individual is at stake and to which the official dogma of individualism makes a mockery, the final story holds out hope without relapsing into giddy false optimism. It sidesteps empty solace and the temporary fix for the desiccate subjects in who's image the previous protagonists where made. The final story dares to let suffering speak, and on that condition grants fragmentary access to a realm of human relatedness outside that demanded by the present. A hope it confiscates from chat-show charlatans and ersatz dictators; one which refuses to look away and suffers for it. Though formally enveloped by the film; Jamie, unlike the rest, has refused to make peace with the world. Freedom is what you do with what's been done to you. Ambiguity survives, the promise of happiness is just that, a promise. Every stage is set against the person, our society favours its own reproduction alone, indifferent to the husks of life dragged in its wake; all humans struggle to be more than their social function, a mere instrument, unconsciously bargained away for a reward that's always delayed. Jamie misses, but she let herself enter what she is not. Not every flowering blossom blooms. She resists the way of the world, refuses, risks, and in doing so sings hope.   \n\nHence the only certain woman is the most uncertain; Jamie, who acts on the certainty of life vacuousness and makes it uncertain, gaining with it the truth and the promise which, forever broken for the rest, survives the world's catastrophes. The film offers no easy escape, yet its fragmented narrative progresses in the reverse order to life; from the divorcee professional, through homemaker, to youth precariat. Only the last gets music. Missing the closing salutary scenes of sugar-coating, Jamie is treated to the harshness of an unflinchingly static camera as she distributes the horses among the pens, still alone, whilst in the distance the great yonder beckons. \n\n*****\n^1 in both cases the men towards which these women feel guilt are also those over-which they have a degree of power, to which the men repay with offhand misogyny; yet both are inescapably decaying characters – one heading for prison the other evaporation of his self leaving a bodily substrate – helping incur the guilt\n\n^2 The trinity of narratives is based on short stories from various Maile Meloy books; I read the third one here, *Travis. B* which has several key differences to the filmic version and is not as good. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "655ebj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "mosestrod", "saved": false, "mod_reports": [], "name": "t3_655ebj", "subreddit_name_prefixed": "r/TrueFilm", "approved_by": null, "over_18": false, "domain": "self.TrueFilm", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2szp0", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TrueFilm/comments/655ebj/certain_women_uncertain_hope/", "num_reports": null, "locked": false, "stickied": false, "created": 1492118229.0, "url": "https://www.reddit.com/r/TrueFilm/comments/655ebj/certain_women_uncertain_hope/", "author_flair_text": "'I say unto all, Watch'", "quarantine": false, "title": "Certain Women – Uncertain Hope", "created_utc": 1492089429.0, "distinguished": null, "media": null, "upvote_ratio": 0.77, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_655ebj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_655ebj", "likes": null, "replies": "", "user_reports": [], "id": "dg8wvl7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mosestrod", "parent_id": "t1_dg84qkj", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "thankyou. I'm not totally satisfied with the post but the film, especially the bit I noted, was worth the effort. In some ways the OP is overly subjective, but sometimes we have to break our own rules to stay true to them!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thankyou. I&amp;#39;m not totally satisfied with the post but the film, especially the bit I noted, was worth the effort. In some ways the OP is overly subjective, but sometimes we have to break our own rules to stay true to them!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg8wvl7", "score_hidden": false, "stickied": false, "created": 1492185576.0, "created_utc": 1492156776.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84qkj", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Jewth", "parent_id": "t3_655ebj", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I don't have anything constructive to say but thank you very much for writing this. The film has stuck with me for some time now, despite not having much to say about it, and you were able to perfectly articulate how I felt while watching.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have anything constructive to say but thank you very much for writing this. The film has stuck with me for some time now, despite not having much to say about it, and you were able to perfectly articulate how I felt while watching.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg84qkj", "score_hidden": false, "stickied": false, "created": 1492142504.0, "created_utc": 1492113704.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_655ebj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_655ebj", "likes": null, "replies": "", "user_reports": [], "id": "dg8wtsv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mosestrod", "parent_id": "t1_dg8lccd", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I watched it illegally online unfortunately, I'm not sure it's still up tbh", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I watched it illegally online unfortunately, I&amp;#39;m not sure it&amp;#39;s still up tbh&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg8wtsv", "score_hidden": false, "stickied": false, "created": 1492185430.0, "created_utc": 1492156630.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8lccd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KJones77", "parent_id": "t3_655ebj", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Sorry this isn't a reply to what you wrote, but how did you watch this movie, if you did so legally? I missed it in theaters, which was clearly a mistake since it has had no home or VOD release. Just curious if you could point me in the right direction.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry this isn&amp;#39;t a reply to what you wrote, but how did you watch this movie, if you did so legally? I missed it in theaters, which was clearly a mistake since it has had no home or VOD release. Just curious if you could point me in the right direction.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg8lccd", "score_hidden": false, "stickied": false, "created": 1492163841.0, "created_utc": 1492135041.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]