[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueFilm", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve watched Baahubali, a South Indian fantasy epic and it intrigued me that the movie uses flashback to tell the story of the hero&amp;#39;s father at the full second half. It took an hour for the hero&amp;#39;s journey until after the rescue of an enslaved queen that we get to that point.&lt;/p&gt;\n\n&lt;p&gt;Actually, I&amp;#39;ve watched almost every Indian movie, and constantly, they used flashbacks for most of its entirety. Usually, the hero has a secret past he doesn&amp;#39;t know, it turns out he has a past life, etc. Then, the second half, we flashback to the hero&amp;#39;s past, usually his father (played by the same actor) and how the hero inherits his badassery. After the revelation, the hero gathers his cojones to fight the bad guys and restore justice.&lt;/p&gt;\n\n&lt;p&gt;The hidden genius of Indian movies is that each movie is actually two or more stories about a hero and his past; the flashbacks mostly about his dad (played by same lead actor); his past life in olden times; etc.&lt;/p&gt;\n\n&lt;p&gt;Beyond that, I&amp;#39;d like to know more about why the use of overlong flashbacks in Indian cinema? &lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s the history and story behind their use of flashbacks?&lt;/p&gt;\n\n&lt;p&gt;What are their significance?&lt;/p&gt;\n\n&lt;p&gt;Are there articles that explore the use of flashbacks in Indian movies?&lt;/p&gt;\n\n&lt;p&gt;Thanks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've watched Baahubali, a South Indian fantasy epic and it intrigued me that the movie uses flashback to tell the story of the hero's father at the full second half. It took an hour for the hero's journey until after the rescue of an enslaved queen that we get to that point.\n\nActually, I've watched almost every Indian movie, and constantly, they used flashbacks for most of its entirety. Usually, the hero has a secret past he doesn't know, it turns out he has a past life, etc. Then, the second half, we flashback to the hero's past, usually his father (played by the same actor) and how the hero inherits his badassery. After the revelation, the hero gathers his cojones to fight the bad guys and restore justice.\n\nThe hidden genius of Indian movies is that each movie is actually two or more stories about a hero and his past; the flashbacks mostly about his dad (played by same lead actor); his past life in olden times; etc.\n\nBeyond that, I'd like to know more about why the use of overlong flashbacks in Indian cinema? \n\nWhat's the history and story behind their use of flashbacks?\n\nWhat are their significance?\n\nAre there articles that explore the use of flashbacks in Indian movies?\n\nThanks.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65bcfe", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 31, "report_reasons": null, "author": "Rebelsuns", "saved": false, "mod_reports": [], "name": "t3_65bcfe", "subreddit_name_prefixed": "r/TrueFilm", "approved_by": null, "over_18": false, "domain": "self.TrueFilm", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2szp0", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TrueFilm/comments/65bcfe/lets_talk_about_the_use_of_overlong_flashbacks_as/", "num_reports": null, "locked": false, "stickied": false, "created": 1492186151.0, "url": "https://www.reddit.com/r/TrueFilm/comments/65bcfe/lets_talk_about_the_use_of_overlong_flashbacks_as/", "author_flair_text": null, "quarantine": false, "title": "Let's talk about the use of overlong flashbacks as narrative devices in mainstream Indian movies", "created_utc": 1492157351.0, "distinguished": null, "media": null, "upvote_ratio": 0.72, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 31}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65bcfe", "likes": null, "replies": "", "user_reports": [], "id": "dg8yn31", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "insigniayellow", "parent_id": "t3_65bcfe", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Contrasting different time periods is quite common in Hindi-language cinema, and what you're noticing in South Indian films seems to be an interesting, genre-specific form of that.\n\nI think there's three major reasons that it's common to have these films split across two time periods in Bollywood cinema: two thematic, and one structural.\n\n1. Family dramas are much more common genre of films in Bollywood than they are in the West, and if the purpose of your film is to examine how the family impacts the individual that clearly can lend itself to following an individual both as a child and an adult.  e.g. **Kabhi Khushi Kabhie Gham...** (2001).  What you're discussing in your post almost sounds like the transposition of this theme into an action setting.\n\n2. Reincarnation can be a popular theme, and almost demands a split timeframe.  One of the earliest examples is Bimal Roy's **Madhumati** (1958), through to big blockbusters in the recent past, such as **Om Shanti Om** (2007).  Some of the most interesting to check out are those from the late-70s (often a bit of a blind spot in Bollywood history), esp. **Mehbooba** (1976) and one of Chetan Anand's last movies, **Kudrat** (1981).\n\n3.  Bollywood films structurally lend themselves to a dramatic contrast between timeframes due to the prevalence of an interval dividing the film into two halves.  That makes at least one transition in time, often just an ellipse in the timeline of the main plot but sometimes more, almost a natural feature, a bit like it is in much stage theater.  You actually see this effect quite commonly in old Hollywood movies with intermissions too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Contrasting different time periods is quite common in Hindi-language cinema, and what you&amp;#39;re noticing in South Indian films seems to be an interesting, genre-specific form of that.&lt;/p&gt;\n\n&lt;p&gt;I think there&amp;#39;s three major reasons that it&amp;#39;s common to have these films split across two time periods in Bollywood cinema: two thematic, and one structural.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Family dramas are much more common genre of films in Bollywood than they are in the West, and if the purpose of your film is to examine how the family impacts the individual that clearly can lend itself to following an individual both as a child and an adult.  e.g. &lt;strong&gt;Kabhi Khushi Kabhie Gham...&lt;/strong&gt; (2001).  What you&amp;#39;re discussing in your post almost sounds like the transposition of this theme into an action setting.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Reincarnation can be a popular theme, and almost demands a split timeframe.  One of the earliest examples is Bimal Roy&amp;#39;s &lt;strong&gt;Madhumati&lt;/strong&gt; (1958), through to big blockbusters in the recent past, such as &lt;strong&gt;Om Shanti Om&lt;/strong&gt; (2007).  Some of the most interesting to check out are those from the late-70s (often a bit of a blind spot in Bollywood history), esp. &lt;strong&gt;Mehbooba&lt;/strong&gt; (1976) and one of Chetan Anand&amp;#39;s last movies, &lt;strong&gt;Kudrat&lt;/strong&gt; (1981).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Bollywood films structurally lend themselves to a dramatic contrast between timeframes due to the prevalence of an interval dividing the film into two halves.  That makes at least one transition in time, often just an ellipse in the timeline of the main plot but sometimes more, almost a natural feature, a bit like it is in much stage theater.  You actually see this effect quite commonly in old Hollywood movies with intermissions too.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg8yn31", "score_hidden": false, "stickied": false, "created": 1492191235.0, "created_utc": 1492162435.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65bcfe", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65bcfe", "likes": null, "replies": "", "user_reports": [], "id": "dga4bkr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rebelsuns", "parent_id": "t1_dg8zkdi", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "The Baahubali ending is one those rare moments in any Indian cinema where the flashback and the entire movie all ended with a dramatic cliffhanger. Reading the response by fans &amp; audience, I feel it's the first Indian movie to invite intrigue &amp; mystery, usually reserved for Hollywood, anime and most other movies. It's also the rarest, if not the first, examples of introducing serial storytelling to Indian cinema.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Baahubali ending is one those rare moments in any Indian cinema where the flashback and the entire movie all ended with a dramatic cliffhanger. Reading the response by fans &amp;amp; audience, I feel it&amp;#39;s the first Indian movie to invite intrigue &amp;amp; mystery, usually reserved for Hollywood, anime and most other movies. It&amp;#39;s also the rarest, if not the first, examples of introducing serial storytelling to Indian cinema.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dga4bkr", "score_hidden": false, "stickied": false, "created": 1492250327.0, "created_utc": 1492221527.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zkdi", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "turtlespace", "parent_id": "t3_65bcfe", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Great to have some discussion of Indian film on here! \n\nI've always really liked this technique, it's an interesting way of re arranging what are otherwise pretty traditional narratives into patterns that feel new. It's a way of recombining familiar parts into an unfamiliar package and can lead to some really odd and unique feeling films - the ending of Baahubali really took me by surprise by placing an origin story at the dramatic climax of the films central story, helping a relatively straightforward version of each of those elements feel new when placed next to each other. \n\nAnother example that comes to mind is the 2015 film Bajrangi Bhaijaan, which initially follows the story of a mute Pakistani girl becoming stranded in India. The film is intended to be overall very heartwarming and funny, and redirects an initially very hopeless opening act into something much more fun by giving us an extended flashback introduction to the films main character, and how he met the woman he loves. \n\nThrough this flashback we're given a big range of emotions in a short period of time, the initial sense of tension and danger flipped around into comedy by breaking it up with a flashback. \n\nI think this is another reason why the flashback is so prevalent in Indian film - they attempt to hit a much bigger variety and range of tones and emotions than a lot of western films go for. Western films are often have a greater focus on being just funny, scary, sentimental, etc or maybe two or three of those feelings at once - and the horror in a horror comedy is rarely actually that scary, the comedy in an action comedy can often take a backseat, etc etc. Indian films try to go fully in many directions at once. They​ want tension, humor, a love story, and genuine drama all in the same movie without any of those elements diminishing the others. Bajrangi Bhaijaan is a good example among many of this. It goes for a lot of emotional notes that could only really coexist if broken up by an extended flashback. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great to have some discussion of Indian film on here! &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always really liked this technique, it&amp;#39;s an interesting way of re arranging what are otherwise pretty traditional narratives into patterns that feel new. It&amp;#39;s a way of recombining familiar parts into an unfamiliar package and can lead to some really odd and unique feeling films - the ending of Baahubali really took me by surprise by placing an origin story at the dramatic climax of the films central story, helping a relatively straightforward version of each of those elements feel new when placed next to each other. &lt;/p&gt;\n\n&lt;p&gt;Another example that comes to mind is the 2015 film Bajrangi Bhaijaan, which initially follows the story of a mute Pakistani girl becoming stranded in India. The film is intended to be overall very heartwarming and funny, and redirects an initially very hopeless opening act into something much more fun by giving us an extended flashback introduction to the films main character, and how he met the woman he loves. &lt;/p&gt;\n\n&lt;p&gt;Through this flashback we&amp;#39;re given a big range of emotions in a short period of time, the initial sense of tension and danger flipped around into comedy by breaking it up with a flashback. &lt;/p&gt;\n\n&lt;p&gt;I think this is another reason why the flashback is so prevalent in Indian film - they attempt to hit a much bigger variety and range of tones and emotions than a lot of western films go for. Western films are often have a greater focus on being just funny, scary, sentimental, etc or maybe two or three of those feelings at once - and the horror in a horror comedy is rarely actually that scary, the comedy in an action comedy can often take a backseat, etc etc. Indian films try to go fully in many directions at once. They​ want tension, humor, a love story, and genuine drama all in the same movie without any of those elements diminishing the others. Bajrangi Bhaijaan is a good example among many of this. It goes for a lot of emotional notes that could only really coexist if broken up by an extended flashback. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dg8zkdi", "score_hidden": false, "stickied": false, "created": 1492194285.0, "created_utc": 1492165485.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65bcfe", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65bcfe", "likes": null, "replies": "", "user_reports": [], "id": "dgaj9ox", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "insigniayellow", "parent_id": "t1_dgagcir", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Which films have you been watching?\n\nFirst thing to note: 'Indian cinema' is a term that's kind of equivalent to saying 'Western cinema.'  It covers a range of different studio systems working in a range of different languages, each producing films in a range of different genres.   The equivalent of 'Hollywood' within that is Hindi-language cinema, often called Bollywood.  My comments are based on Bollywood, maybe others can answer for the other Indian language cinemas.\n\nFirstly, there are plenty of Bollywood movies that don't feature song and dance numbers, although as 'video songs' are the main method of promotion (in the way 'trailers' are in the west) most will still make prominent use of music in other ways.  Try out something like *Pink* (2016).\n\nSecondly, however, song and dance is a much bigger part of Bollywood than it is in Western cinema, and they get used in all different types of styles and ways and to lots of different purposes.  You'll really miss out if you restrict yourself only to films without these pieces.  It's a bit like stating you'll only watch Hollywood movies that don't use CGI, there are still plenty of films to go and see, but you're missing out on plenty of diversity.\n\nIf immersion is the only problem, lots of films only feature dances that are entirely diegetic such as in the drama [*Dev.D*](https://www.youtube.com/watch?v=Vng5mg0iY0Q) (2009).  \n\nThere are also plenty of films that use dance in really novel or quirky ways.  Check out this scene from gritty tragedy [*Haider*](https://www.youtube.com/watch?v=TjHxBdUmR-A).  Tonally, moments such as this can serve to really accentuate the main plot.\n\nFinally, dance really is an art-form, and can be as sheerly enjoyable in its own right as any other type of physical performance, whether it's Keaton's slapstick or Chan's martial arts. [*Devdas*](https://www.youtube.com/watch?v=UFvL_FZt7Qc) in particular heralded in a renaissance of classical dance, but you'll also find everything from traditional regional folk dancing to modern [contemporary](https://www.youtube.com/watch?v=C8kSrkz8Hz8) and everything in between.\n\ntl;dr: there are plenty of Bollywood films without dance, but developing an appreciation of dance gives you access to an even greater diversity of great movies and a great art-form.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Which films have you been watching?&lt;/p&gt;\n\n&lt;p&gt;First thing to note: &amp;#39;Indian cinema&amp;#39; is a term that&amp;#39;s kind of equivalent to saying &amp;#39;Western cinema.&amp;#39;  It covers a range of different studio systems working in a range of different languages, each producing films in a range of different genres.   The equivalent of &amp;#39;Hollywood&amp;#39; within that is Hindi-language cinema, often called Bollywood.  My comments are based on Bollywood, maybe others can answer for the other Indian language cinemas.&lt;/p&gt;\n\n&lt;p&gt;Firstly, there are plenty of Bollywood movies that don&amp;#39;t feature song and dance numbers, although as &amp;#39;video songs&amp;#39; are the main method of promotion (in the way &amp;#39;trailers&amp;#39; are in the west) most will still make prominent use of music in other ways.  Try out something like &lt;em&gt;Pink&lt;/em&gt; (2016).&lt;/p&gt;\n\n&lt;p&gt;Secondly, however, song and dance is a much bigger part of Bollywood than it is in Western cinema, and they get used in all different types of styles and ways and to lots of different purposes.  You&amp;#39;ll really miss out if you restrict yourself only to films without these pieces.  It&amp;#39;s a bit like stating you&amp;#39;ll only watch Hollywood movies that don&amp;#39;t use CGI, there are still plenty of films to go and see, but you&amp;#39;re missing out on plenty of diversity.&lt;/p&gt;\n\n&lt;p&gt;If immersion is the only problem, lots of films only feature dances that are entirely diegetic such as in the drama &lt;a href=\"https://www.youtube.com/watch?v=Vng5mg0iY0Q\"&gt;&lt;em&gt;Dev.D&lt;/em&gt;&lt;/a&gt; (2009).  &lt;/p&gt;\n\n&lt;p&gt;There are also plenty of films that use dance in really novel or quirky ways.  Check out this scene from gritty tragedy &lt;a href=\"https://www.youtube.com/watch?v=TjHxBdUmR-A\"&gt;&lt;em&gt;Haider&lt;/em&gt;&lt;/a&gt;.  Tonally, moments such as this can serve to really accentuate the main plot.&lt;/p&gt;\n\n&lt;p&gt;Finally, dance really is an art-form, and can be as sheerly enjoyable in its own right as any other type of physical performance, whether it&amp;#39;s Keaton&amp;#39;s slapstick or Chan&amp;#39;s martial arts. &lt;a href=\"https://www.youtube.com/watch?v=UFvL_FZt7Qc\"&gt;&lt;em&gt;Devdas&lt;/em&gt;&lt;/a&gt; in particular heralded in a renaissance of classical dance, but you&amp;#39;ll also find everything from traditional regional folk dancing to modern &lt;a href=\"https://www.youtube.com/watch?v=C8kSrkz8Hz8\"&gt;contemporary&lt;/a&gt; and everything in between.&lt;/p&gt;\n\n&lt;p&gt;tl;dr: there are plenty of Bollywood films without dance, but developing an appreciation of dance gives you access to an even greater diversity of great movies and a great art-form.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgaj9ox", "score_hidden": false, "stickied": false, "created": 1492282576.0, "created_utc": 1492253776.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgagcir", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "beeswaxx", "parent_id": "t3_65bcfe", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Unrelated question in Indian film, maybe i'm watching the wrong ones, but the ones suggested to me all had singing and it really breaks the immersion for me. You have this intense/sad/touching film and all of a sudden people all join in and sing/dance for 5 mins then go back to normal. Is this common in all Indian films?\n\nI'm very ignorant of anything Indian film as you can see...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unrelated question in Indian film, maybe i&amp;#39;m watching the wrong ones, but the ones suggested to me all had singing and it really breaks the immersion for me. You have this intense/sad/touching film and all of a sudden people all join in and sing/dance for 5 mins then go back to normal. Is this common in all Indian films?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m very ignorant of anything Indian film as you can see...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgagcir", "score_hidden": false, "stickied": false, "created": 1492273300.0, "created_utc": 1492244500.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65bcfe", "likes": null, "replies": "", "user_reports": [], "id": "dga6sw3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "muddi900", "parent_id": "t3_65bcfe", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "&gt;Actually, I've watched almost every Indian movie, and constantly, they used flashbacks for most of its entirety.\n\nWait wait wait, you've watched All of Hindi, Bangla, Hyderabadi, Telegu, Tamil, and Bhojpuri cinema, among others?\n\nBut the use of Flashbacks has been a staple of Indian Cinema because it was a great way to pad the movie length, which had to be 3 hours, with an intermission. The lowering of run times is a very recent trend, and older audiences in the region still decry it because \"you get less movie for the money\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Actually, I&amp;#39;ve watched almost every Indian movie, and constantly, they used flashbacks for most of its entirety.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Wait wait wait, you&amp;#39;ve watched All of Hindi, Bangla, Hyderabadi, Telegu, Tamil, and Bhojpuri cinema, among others?&lt;/p&gt;\n\n&lt;p&gt;But the use of Flashbacks has been a staple of Indian Cinema because it was a great way to pad the movie length, which had to be 3 hours, with an intermission. The lowering of run times is a very recent trend, and older audiences in the region still decry it because &amp;quot;you get less movie for the money&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dga6sw3", "score_hidden": false, "stickied": false, "created": 1492253911.0, "created_utc": 1492225111.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]