[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueFilm", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Please use this thread to discuss this week&amp;#39;s latest releases. We&amp;#39;re not harsh on the rules here; if it&amp;#39;s new to your neighborhood, this thread considers the movie new.\n- &lt;a href=\"http://www.imdb.com/movies-in-theaters/?ref_=nv_mv_inth_1\"&gt;What IMDb&lt;/a&gt; considers &amp;quot;new.&amp;quot;\n- We also consider new releases to home video &amp;quot;new.&amp;quot; So if all fifty hours of &lt;em&gt;Greed&lt;/em&gt; is discovered and finally released on laserdisc, then yes, definitely let us know what you think about it.\n- This is a discussion about new movies. If you are worried about spoilers, watch the movie first, and only then should you come back here. Spoilers ahead. This thread is filled with spoilers. Spoiler alert.\n- If you want to create a thread about a new movie, talk about it here first. If it does well, consider making a frontpage thread out of it. Please do not jump the gun and make a thread about a new blockbuster without seeing how it fares here. We have a rule; 1 thread per movie per frontpage. Many times, the first thread for a new movie is not the best, and the best get removed. This should help fix that.\nSo tell us; what did you think about the latest fare at the theater?\nSincerely,\nDavid&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Please use this thread to discuss this week's latest releases. We're not harsh on the rules here; if it's new to your neighborhood, this thread considers the movie new.\n- [What IMDb](http://www.imdb.com/movies-in-theaters/?ref_=nv_mv_inth_1) considers \"new.\"\n- We also consider new releases to home video \"new.\" So if all fifty hours of *Greed* is discovered and finally released on laserdisc, then yes, definitely let us know what you think about it.\n- This is a discussion about new movies. If you are worried about spoilers, watch the movie first, and only then should you come back here. Spoilers ahead. This thread is filled with spoilers. Spoiler alert.\n- If you want to create a thread about a new movie, talk about it here first. If it does well, consider making a frontpage thread out of it. Please do not jump the gun and make a thread about a new blockbuster without seeing how it fares here. We have a rule; 1 thread per movie per frontpage. Many times, the first thread for a new movie is not the best, and the best get removed. This should help fix that.\nSo tell us; what did you think about the latest fare at the theater?\nSincerely,\nDavid", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65j7mw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "AutoModerator", "saved": false, "mod_reports": [], "name": "t3_65j7mw", "subreddit_name_prefixed": "r/TrueFilm", "approved_by": null, "over_18": false, "domain": "self.TrueFilm", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/cII5vC3rPk2ICQF7rlR8A-Ihx1UVyl5tauqMzeJNVCk.jpg?s=8e9932e73b527c3333a134fce525942d", "width": 200, "height": 200}, "resolutions": [{"url": "https://i.redditmedia.com/cII5vC3rPk2ICQF7rlR8A-Ihx1UVyl5tauqMzeJNVCk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=1fe9d7d79fa95d2532592ee6c0334b57", "width": 108, "height": 108}], "variants": {}, "id": "ed8l7HVd_B3zK7m5alpZFi42jNGKj-yEeT0S0rlWZpg"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2szp0", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TrueFilm/comments/65j7mw/this_week_in_film_new_releases_discussion_thread/", "num_reports": null, "locked": false, "stickied": false, "created": 1492293777.0, "url": "https://www.reddit.com/r/TrueFilm/comments/65j7mw/this_week_in_film_new_releases_discussion_thread/", "author_flair_text": "David", "quarantine": false, "title": "This Week in Film: New Releases Discussion Thread (Week of April 15, 2017)", "created_utc": 1492264977.0, "distinguished": "moderator", "media": null, "upvote_ratio": 0.68, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65j7mw", "likes": null, "replies": "", "user_reports": [], "id": "dgbe5to", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mokamo01", "parent_id": "t3_65j7mw", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I watched the Lost City of Z yesterday along with My Entire High School Sinking into the Sea. I overall liked both, but came out a little conflicted as to how I felt about them, so I'd absolutely be open to other thoughts etc on each of the films strengths/weaknesses.\n\nMy Entire High School Sinking into the Sea: As I'm sure is obvious, this film's greatest strength to me was its visuals. It' very clearly made by a cartoonist (Mr. Shaw). As a big alt comics buff, alt comics tend to have very striking visuals, innovative layouts etc that all complement the story really well, but the actual story/dialogue usually tends to fall short. The creators are usually better artists than they are writers. In MEHSITS (interesting acronym), there were times when the dialogue/transitions from one thought to another felt kinda clumsy. The resolution, the extended metaphor/message about education were very heavy handed and on the nose. Perhaps in any other movie, these would be damning, but the visuals more than make up for the weak-ish script. The visuals single-handedly create an emotional depth that usually is built up by the combined factors of acting,sfript, cinematography and score in other films. It's incredibly creative and reflects adolescence in a very fitting way. Shaw chooses to focus on certain trivial details in shots (like lungs expanding and contracting when breathing after swimming for extended periods of time) and uses various colors and often overwhelming barrages of visual stimuli to reflect the often confusing, idiosyncratic, overwhelming, deeply emotional yet clouded adolescent experience. The characters themselves are drawn with rudimentary broad strokes to illustrate this transition period (faculty members are drawn with a little more detail). At least that's the interpretation I took, and it certainly made me respect and connect with the film a lot more. Ultimately, I reacted to this film on a more emotional level than an intellectual one\n\nThe Lost City of Z - To start, this film was beautifully executed. Well acted, well shot, well written. My issue with the film is that I'm having a little trouble finding the depth in the narrative. Coming out of the theater, I didn't really sense any deeper point to the work beyond perhaps being a tale of one man's obsession with glory brought about by a flawed class hierarchy and the sacrifices it entails. And it didn't feel particularly well developed with regards to that theme. However, after giving some time for ideas to marinate a bit, I think that the point was to help us viewers understand how a man like Fawcett could give in to his obsession time and time again. I believe Gray tried to use the visuals and his depiction of the jungle to foster in us the same sense of excitement and awe that captured Fawcett. It's like the anti-\"Heart of Darkness\". Instead of using the jungle's horrors to capture man's savagery, it uses the jungle's horrors to capture man's beauty (in the Indian civilizations etc that Fawcett fixates on). It's dreamlike. But we still see all sides of the jungle (the good and the bad), as if Gray is trying to seduce us as Fawcett was and then repudiate the romantic view of adventure/exploration with Fawcett's capture. I think it is an interesting effort that operates at a much subtler level than other films, but I'm not sure if it always hits the mark, as I didn't notice it on a first viewing. But, then, I'm not sure if that matters in the evaluation of the film. Perhaps, though I didn't initially notice it, the attempt was valid and the onus to appreciate it is on myself, the viewer. I also thought the Gray could have explored the sacrifices Fawcett's expeditions entailed a little deeper. Sienna Miller's subplot was kind of present in the beginning but never truly fleshed out. Nonetheless, I thought it was a thought-provoking movie upon reflection, even if it didn't always hit the mark with its intentions. Thoughts?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I watched the Lost City of Z yesterday along with My Entire High School Sinking into the Sea. I overall liked both, but came out a little conflicted as to how I felt about them, so I&amp;#39;d absolutely be open to other thoughts etc on each of the films strengths/weaknesses.&lt;/p&gt;\n\n&lt;p&gt;My Entire High School Sinking into the Sea: As I&amp;#39;m sure is obvious, this film&amp;#39;s greatest strength to me was its visuals. It&amp;#39; very clearly made by a cartoonist (Mr. Shaw). As a big alt comics buff, alt comics tend to have very striking visuals, innovative layouts etc that all complement the story really well, but the actual story/dialogue usually tends to fall short. The creators are usually better artists than they are writers. In MEHSITS (interesting acronym), there were times when the dialogue/transitions from one thought to another felt kinda clumsy. The resolution, the extended metaphor/message about education were very heavy handed and on the nose. Perhaps in any other movie, these would be damning, but the visuals more than make up for the weak-ish script. The visuals single-handedly create an emotional depth that usually is built up by the combined factors of acting,sfript, cinematography and score in other films. It&amp;#39;s incredibly creative and reflects adolescence in a very fitting way. Shaw chooses to focus on certain trivial details in shots (like lungs expanding and contracting when breathing after swimming for extended periods of time) and uses various colors and often overwhelming barrages of visual stimuli to reflect the often confusing, idiosyncratic, overwhelming, deeply emotional yet clouded adolescent experience. The characters themselves are drawn with rudimentary broad strokes to illustrate this transition period (faculty members are drawn with a little more detail). At least that&amp;#39;s the interpretation I took, and it certainly made me respect and connect with the film a lot more. Ultimately, I reacted to this film on a more emotional level than an intellectual one&lt;/p&gt;\n\n&lt;p&gt;The Lost City of Z - To start, this film was beautifully executed. Well acted, well shot, well written. My issue with the film is that I&amp;#39;m having a little trouble finding the depth in the narrative. Coming out of the theater, I didn&amp;#39;t really sense any deeper point to the work beyond perhaps being a tale of one man&amp;#39;s obsession with glory brought about by a flawed class hierarchy and the sacrifices it entails. And it didn&amp;#39;t feel particularly well developed with regards to that theme. However, after giving some time for ideas to marinate a bit, I think that the point was to help us viewers understand how a man like Fawcett could give in to his obsession time and time again. I believe Gray tried to use the visuals and his depiction of the jungle to foster in us the same sense of excitement and awe that captured Fawcett. It&amp;#39;s like the anti-&amp;quot;Heart of Darkness&amp;quot;. Instead of using the jungle&amp;#39;s horrors to capture man&amp;#39;s savagery, it uses the jungle&amp;#39;s horrors to capture man&amp;#39;s beauty (in the Indian civilizations etc that Fawcett fixates on). It&amp;#39;s dreamlike. But we still see all sides of the jungle (the good and the bad), as if Gray is trying to seduce us as Fawcett was and then repudiate the romantic view of adventure/exploration with Fawcett&amp;#39;s capture. I think it is an interesting effort that operates at a much subtler level than other films, but I&amp;#39;m not sure if it always hits the mark, as I didn&amp;#39;t notice it on a first viewing. But, then, I&amp;#39;m not sure if that matters in the evaluation of the film. Perhaps, though I didn&amp;#39;t initially notice it, the attempt was valid and the onus to appreciate it is on myself, the viewer. I also thought the Gray could have explored the sacrifices Fawcett&amp;#39;s expeditions entailed a little deeper. Sienna Miller&amp;#39;s subplot was kind of present in the beginning but never truly fleshed out. Nonetheless, I thought it was a thought-provoking movie upon reflection, even if it didn&amp;#39;t always hit the mark with its intentions. Thoughts?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgbe5to", "score_hidden": false, "stickied": false, "created": 1492330241.0, "created_utc": 1492301441.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]