[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueFilm", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I watched La La Land recently and it got me thinking about the magical realism aspect of the musical genre. Essentially, the scenes where the viewer is expected to take what they are seeing as symbolic rather than literal and which are usually differentiated from the rest of the narrative by the use of song. &lt;/p&gt;\n\n&lt;p&gt;So we watch the observatory scene in La La Land and we know that Mia and Sebastian, to the extent that we take them as &amp;#39;real people&amp;#39;, are not &lt;em&gt;actually&lt;/em&gt; flying around the cosmos, but their flying represents the emotions they feel leading up to their first kiss. When we enter into this type of sequence, rules of physics are temporarily suspended but so are more subtle things: in the song looking over the lights of L.A., even though nothing fantastical happens, we still know that the characters are playing a sort of version of themselves, one where it is usual for them to sing in duet and tapdance and suchlike. Real people, obviously, do not ad lib sing to each other spontaneously in perfect synchronicity, so again we temporarily suspend our sense of the &amp;#39;reality&amp;#39; of the film and accept this alternate reality until we are given some kind of cue that the characters&amp;#39; feet, so to speak, are back on the ground.&lt;/p&gt;\n\n&lt;p&gt;What interests me is the extent to which we can guess the &amp;#39;reality&amp;#39; behind the fantasy in scenes like these. The non-musical Birdman has magical realist fantasy sequences, but normally drops a little &amp;#39;clue&amp;#39; as to what the reality of the scene actually is (the taxi scene, for instance). Amelie has magical realist elements, but these are always so minor that we&amp;#39;re never left wondering what &amp;#39;reality&amp;#39; was behind the fantasy. If Amelie melts into liquid it&amp;#39;s just a reflection of how she feels, or if a photograph talks to someone we know that they&amp;#39;re just talking to themselves.&lt;/p&gt;\n\n&lt;p&gt;But what about La La Land&amp;#39;s audition scene? Mia starts telling her story and transitions into song, and from the lighting change we know that we have entered into the &amp;#39;alternate reality&amp;#39; of the musical sequence. The &amp;#39;real&amp;#39; Mia is not actually &lt;em&gt;singing&lt;/em&gt; to her prospective employers. The &amp;#39;song&amp;#39; is part of the stylised fantasy lens through which we occasionally are invited to look. But what actually &amp;#39;happened&amp;#39; in that audition room? If the song wasn&amp;#39;t what she actually did in that room, then what did she &lt;em&gt;actually&lt;/em&gt; say? Did she deliver a rambling anecdote about her Aunt in Paris living life to the full? Did she wax lyrical about taking creative risks and dreaming big? Somehow that sort of eloquence seems out of character for her. But she must have done &lt;em&gt;something&lt;/em&gt; impressive, because she got the job. The song was impressive, but - as has been established - we can&amp;#39;t take the song as the literal truth of what happened. So what did happen? Or do we break the rules and accept the song into the &amp;#39;canon&amp;#39; of the narrative&amp;#39;s &amp;#39;reality&amp;#39;? If we do that then surely we must accept everything else, too?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I watched La La Land recently and it got me thinking about the magical realism aspect of the musical genre. Essentially, the scenes where the viewer is expected to take what they are seeing as symbolic rather than literal and which are usually differentiated from the rest of the narrative by the use of song. \n\nSo we watch the observatory scene in La La Land and we know that Mia and Sebastian, to the extent that we take them as 'real people', are not *actually* flying around the cosmos, but their flying represents the emotions they feel leading up to their first kiss. When we enter into this type of sequence, rules of physics are temporarily suspended but so are more subtle things: in the song looking over the lights of L.A., even though nothing fantastical happens, we still know that the characters are playing a sort of version of themselves, one where it is usual for them to sing in duet and tapdance and suchlike. Real people, obviously, do not ad lib sing to each other spontaneously in perfect synchronicity, so again we temporarily suspend our sense of the 'reality' of the film and accept this alternate reality until we are given some kind of cue that the characters' feet, so to speak, are back on the ground.\n\nWhat interests me is the extent to which we can guess the 'reality' behind the fantasy in scenes like these. The non-musical Birdman has magical realist fantasy sequences, but normally drops a little 'clue' as to what the reality of the scene actually is (the taxi scene, for instance). Amelie has magical realist elements, but these are always so minor that we're never left wondering what 'reality' was behind the fantasy. If Amelie melts into liquid it's just a reflection of how she feels, or if a photograph talks to someone we know that they're just talking to themselves.\n\nBut what about La La Land's audition scene? Mia starts telling her story and transitions into song, and from the lighting change we know that we have entered into the 'alternate reality' of the musical sequence. The 'real' Mia is not actually *singing* to her prospective employers. The 'song' is part of the stylised fantasy lens through which we occasionally are invited to look. But what actually 'happened' in that audition room? If the song wasn't what she actually did in that room, then what did she *actually* say? Did she deliver a rambling anecdote about her Aunt in Paris living life to the full? Did she wax lyrical about taking creative risks and dreaming big? Somehow that sort of eloquence seems out of character for her. But she must have done *something* impressive, because she got the job. The song was impressive, but - as has been established - we can't take the song as the literal truth of what happened. So what did happen? Or do we break the rules and accept the song into the 'canon' of the narrative's 'reality'? If we do that then surely we must accept everything else, too?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65k03z", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 73, "report_reasons": null, "author": "FaerieStories", "saved": false, "mod_reports": [], "name": "t3_65k03z", "subreddit_name_prefixed": "r/TrueFilm", "approved_by": null, "over_18": false, "domain": "self.TrueFilm", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2szp0", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TrueFilm/comments/65k03z/la_la_land_and_magical_realism/", "num_reports": null, "locked": false, "stickied": false, "created": 1492303136.0, "url": "https://www.reddit.com/r/TrueFilm/comments/65k03z/la_la_land_and_magical_realism/", "author_flair_text": "Blade Runner", "quarantine": false, "title": "La La Land and magical realism", "created_utc": 1492274336.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 73}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": "", "user_reports": [], "id": "dgbuo9w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dgbneju", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Sure: I get what you're saying. But just as it's tempting to speculate what happens to the kid at the end of Blood Meridian, it's also tempting to speculate what happened in that audition room.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure: I get what you&amp;#39;re saying. But just as it&amp;#39;s tempting to speculate what happens to the kid at the end of Blood Meridian, it&amp;#39;s also tempting to speculate what happened in that audition room.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgbuo9w", "score_hidden": false, "stickied": false, "created": 1492360166.0, "created_utc": 1492331366.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbneju", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "chinpokomon", "parent_id": "t3_65k03z", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Consider for a moment any film with a writer, artist, or other creative who is at the top of their game. If the audience is able to witness directly something which this fictional character has created, they will be limited by how well the script writer was able to scribe. The exception to this would be something based on a real person, Picasso, Shakespeare, etc. The other exception worth calling out is something like *Adaptation* or *Moulin Rouge*, where the film is a pseudo-autobiographical account of the lead characters' story telling. *Barton Fink* also straddles this line closely.\n\nMia is like Barton Fink in this respect. We don't know precisely what happens in the audition, but we aren't supposed to know. It happens through a filter and the audience is only given a tantalizing taste of the magnitude of the performance. We know that it is beyond words or anything which could be captured by the script writers because that would destroy the illusion. What we do know is that it was extraordinary because of the doors of opportunity it opened for her.\n\nI think the real contrast has to be with her first audition. I think Emma Stone was masterful in her first performance and the way the casting directors reacted to that performance underscores how amazing she must have been in the one where she was singing.", "edited": 1492315535.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Consider for a moment any film with a writer, artist, or other creative who is at the top of their game. If the audience is able to witness directly something which this fictional character has created, they will be limited by how well the script writer was able to scribe. The exception to this would be something based on a real person, Picasso, Shakespeare, etc. The other exception worth calling out is something like &lt;em&gt;Adaptation&lt;/em&gt; or &lt;em&gt;Moulin Rouge&lt;/em&gt;, where the film is a pseudo-autobiographical account of the lead characters&amp;#39; story telling. &lt;em&gt;Barton Fink&lt;/em&gt; also straddles this line closely.&lt;/p&gt;\n\n&lt;p&gt;Mia is like Barton Fink in this respect. We don&amp;#39;t know precisely what happens in the audition, but we aren&amp;#39;t supposed to know. It happens through a filter and the audience is only given a tantalizing taste of the magnitude of the performance. We know that it is beyond words or anything which could be captured by the script writers because that would destroy the illusion. What we do know is that it was extraordinary because of the doors of opportunity it opened for her.&lt;/p&gt;\n\n&lt;p&gt;I think the real contrast has to be with her first audition. I think Emma Stone was masterful in her first performance and the way the casting directors reacted to that performance underscores how amazing she must have been in the one where she was singing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgbneju", "score_hidden": false, "stickied": false, "created": 1492343869.0, "created_utc": 1492315069.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": "", "user_reports": [], "id": "dgb4y94", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "mosestrod", "parent_id": "t1_dgb3ghb", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "yes I get you. the question is why do you think it matters to the overall film?\n\non magical realism I'd just say that's not how the term is usually used. of course all narrative art must be *real*, it must be in a 'language' we speak to be comprehensible at all. But that's not what the category realism has referred to; just because a story has pots and pans in it and uses the word \"but\" doesn't make it realist. You're referring to allegory which is not the same; in a concrete way, you'll never fight an orc or ride a tree. Also LofTR, a myth? who ever believed it were true? If a story had you leave the office and bump into an orc that'd be magical realist. The *realism* in magical realism cannot be liquidated so easily. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yes I get you. the question is why do you think it matters to the overall film?&lt;/p&gt;\n\n&lt;p&gt;on magical realism I&amp;#39;d just say that&amp;#39;s not how the term is usually used. of course all narrative art must be &lt;em&gt;real&lt;/em&gt;, it must be in a &amp;#39;language&amp;#39; we speak to be comprehensible at all. But that&amp;#39;s not what the category realism has referred to; just because a story has pots and pans in it and uses the word &amp;quot;but&amp;quot; doesn&amp;#39;t make it realist. You&amp;#39;re referring to allegory which is not the same; in a concrete way, you&amp;#39;ll never fight an orc or ride a tree. Also LofTR, a myth? who ever believed it were true? If a story had you leave the office and bump into an orc that&amp;#39;d be magical realist. The &lt;em&gt;realism&lt;/em&gt; in magical realism cannot be liquidated so easily. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgb4y94", "score_hidden": false, "stickied": false, "created": 1492317276.0, "created_utc": 1492288476.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3ghb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dgb3252", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I think you're missing my original point. The observatory scene is moot because it's rather plausible what happened underneath the symbolic visuals. I'm saying that I struggle to imagine what happens 'underneath' the audition.\n\nThe Lord of the Rings, like all myth, is absolutely a blended fantasy and reality world. After all, it's an alternate history for Europe. It obeys much the same rules as our world, with fantasy elements integrated into it. The whole point of high fantasy like Tolkien's work is to imagine what reality would be like if it were different jn various ways.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re missing my original point. The observatory scene is moot because it&amp;#39;s rather plausible what happened underneath the symbolic visuals. I&amp;#39;m saying that I struggle to imagine what happens &amp;#39;underneath&amp;#39; the audition.&lt;/p&gt;\n\n&lt;p&gt;The Lord of the Rings, like all myth, is absolutely a blended fantasy and reality world. After all, it&amp;#39;s an alternate history for Europe. It obeys much the same rules as our world, with fantasy elements integrated into it. The whole point of high fantasy like Tolkien&amp;#39;s work is to imagine what reality would be like if it were different jn various ways.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgb3ghb", "score_hidden": false, "stickied": false, "created": 1492315224.0, "created_utc": 1492286424.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": "", "user_reports": [], "id": "dgc3yke", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Smurphy98", "parent_id": "t1_dgbwpb2", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "In a sense, I am arguing against the entire structure of classification. I accept that they are useful forms of classification (for broad movements) that can help us digest work that deals in certain tropes and precedents, but it seems to me that you're allowing preconceptions of methods of classification to dictate your outlook on an individual work. Dealing in absolutes of classification (\"Magical realism is always clearly of our world\") is just a step away from assigning qualitative attributes to a work based solely on the genre or movement that it belongs to.\n\nThat said, I do agree with your point about searching for narrative beyond what was presented, so I think you're on the right track. I'd just be wary of absolutism where art is concerned. It can lead to painting oneself into a corner. I'm sure you have a reasoned and logical thougjt process, as shown by your articulate and consistent opinions, but there are ways to express it that don't resort to almost arbitrary, divisionist classification.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In a sense, I am arguing against the entire structure of classification. I accept that they are useful forms of classification (for broad movements) that can help us digest work that deals in certain tropes and precedents, but it seems to me that you&amp;#39;re allowing preconceptions of methods of classification to dictate your outlook on an individual work. Dealing in absolutes of classification (&amp;quot;Magical realism is always clearly of our world&amp;quot;) is just a step away from assigning qualitative attributes to a work based solely on the genre or movement that it belongs to.&lt;/p&gt;\n\n&lt;p&gt;That said, I do agree with your point about searching for narrative beyond what was presented, so I think you&amp;#39;re on the right track. I&amp;#39;d just be wary of absolutism where art is concerned. It can lead to painting oneself into a corner. I&amp;#39;m sure you have a reasoned and logical thougjt process, as shown by your articulate and consistent opinions, but there are ways to express it that don&amp;#39;t resort to almost arbitrary, divisionist classification.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgc3yke", "score_hidden": false, "stickied": false, "created": 1492383241.0, "created_utc": 1492354441.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbwpb2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgbuelk", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgbwpb2", "score_hidden": false, "stickied": false, "created": 1492367105.0, "created_utc": 1492338305.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbuelk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Smurphy98", "parent_id": "t1_dgb3252", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I would argue that you're wrong about Terry Pratchett's statement. Sci-fi/fantasy, despite having been dominated in the mainstream by commercial interests, mostly due to the link between high budgets and faithfully realised visions, is not an inherently commercial genre, no more so than any other. To make a distinction between fantasy allegory and more \"realistic\" storytelling is false: all characters and events are totemic and representative of a higher idea. Therefore, all works are equally (that is absolutely) fictional. Fantasy is the default and realism is merely a veneer that obscures this fantasy and tricks consumers into a feeling of familiarity. A world where a single fictional character exists is as fantastical and different from our own as one in which a thousand orcs exist. Is Harry Potter magical realism because it suggests that our own world is as it is in parallel to a fantasy world we cannot see? Is Star Wars realistic because it suggests that we exist in the same universe as the \"galaxy far far away\"? Of course not. Even a world that looks like our own and claims to be our own is a work of highest fantasy. The distinction is false.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would argue that you&amp;#39;re wrong about Terry Pratchett&amp;#39;s statement. Sci-fi/fantasy, despite having been dominated in the mainstream by commercial interests, mostly due to the link between high budgets and faithfully realised visions, is not an inherently commercial genre, no more so than any other. To make a distinction between fantasy allegory and more &amp;quot;realistic&amp;quot; storytelling is false: all characters and events are totemic and representative of a higher idea. Therefore, all works are equally (that is absolutely) fictional. Fantasy is the default and realism is merely a veneer that obscures this fantasy and tricks consumers into a feeling of familiarity. A world where a single fictional character exists is as fantastical and different from our own as one in which a thousand orcs exist. Is Harry Potter magical realism because it suggests that our own world is as it is in parallel to a fantasy world we cannot see? Is Star Wars realistic because it suggests that we exist in the same universe as the &amp;quot;galaxy far far away&amp;quot;? Of course not. Even a world that looks like our own and claims to be our own is a work of highest fantasy. The distinction is false.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgbuelk", "score_hidden": false, "stickied": false, "created": 1492359314.0, "created_utc": 1492330514.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3252", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "mosestrod", "parent_id": "t1_dgb1oe9", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "you would be correct if Mia pointed in some way, \"at it\", making the *it* needing some explanation, but she doesn't imo. The question of what *actually* occurred during the audition, *behind* her singing, is as moot as what did Mia and Sebastian actually say in the observatory. We get the point. With the audition she tells us what we need to know, without pointing at some *beyond* or *behind* that we must discover to fulfil the films potential. If you argue there is a *pointing*, which negatively produces, by absence, you'd need to justify it.\n\nTerry Pratchett once said magical realism was a polite way of saying fantasy. He was wrong. The genre rendered 'sci-fi/fantasy' was done for the commercial arm of art, not derived from aesthetics. It is clear that Lord of the Rings is not a blend, there's practically no realism to it. It's a different world/universe. The classic examples of Magical Realism [a term originating outside the film-form] certainly are a *blending*; it is neither fantasy world-building, nor naive realism/positivism. Magical realism is always clearly of our world, it is the progeny of myth.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you would be correct if Mia pointed in some way, &amp;quot;at it&amp;quot;, making the &lt;em&gt;it&lt;/em&gt; needing some explanation, but she doesn&amp;#39;t imo. The question of what &lt;em&gt;actually&lt;/em&gt; occurred during the audition, &lt;em&gt;behind&lt;/em&gt; her singing, is as moot as what did Mia and Sebastian actually say in the observatory. We get the point. With the audition she tells us what we need to know, without pointing at some &lt;em&gt;beyond&lt;/em&gt; or &lt;em&gt;behind&lt;/em&gt; that we must discover to fulfil the films potential. If you argue there is a &lt;em&gt;pointing&lt;/em&gt;, which negatively produces, by absence, you&amp;#39;d need to justify it.&lt;/p&gt;\n\n&lt;p&gt;Terry Pratchett once said magical realism was a polite way of saying fantasy. He was wrong. The genre rendered &amp;#39;sci-fi/fantasy&amp;#39; was done for the commercial arm of art, not derived from aesthetics. It is clear that Lord of the Rings is not a blend, there&amp;#39;s practically no realism to it. It&amp;#39;s a different world/universe. The classic examples of Magical Realism [a term originating outside the film-form] certainly are a &lt;em&gt;blending&lt;/em&gt;; it is neither fantasy world-building, nor naive realism/positivism. Magical realism is always clearly of our world, it is the progeny of myth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgb3252", "score_hidden": false, "stickied": false, "created": 1492314676.0, "created_utc": 1492285876.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb1oe9", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dgb0wpl", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Coming to a conclusion about what the Mona Lisa's feet look like isn't particularly going to allow us any deeper understanding of that painting. If, however, a figure in a painting points at something out of frame it is fully worth speculating what they are pointing at, and obviously if we're not given any clues then we can only speculate. \n\nI disagree that magical realism is a 'blending' of fantasy and reality. The fantasy genre is a blend. Magical realism is more like oil mixing with water. And though Mia is only 'real' within the confines of the fiction she is a part of, she 'exists' in the world of the film in both her presence and her absence.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Coming to a conclusion about what the Mona Lisa&amp;#39;s feet look like isn&amp;#39;t particularly going to allow us any deeper understanding of that painting. If, however, a figure in a painting points at something out of frame it is fully worth speculating what they are pointing at, and obviously if we&amp;#39;re not given any clues then we can only speculate. &lt;/p&gt;\n\n&lt;p&gt;I disagree that magical realism is a &amp;#39;blending&amp;#39; of fantasy and reality. The fantasy genre is a blend. Magical realism is more like oil mixing with water. And though Mia is only &amp;#39;real&amp;#39; within the confines of the fiction she is a part of, she &amp;#39;exists&amp;#39; in the world of the film in both her presence and her absence.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgb1oe9", "score_hidden": false, "stickied": false, "created": 1492312830.0, "created_utc": 1492284030.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb0wpl", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "mosestrod", "parent_id": "t3_65k03z", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "there is no *real* Mia behind what appears on screen. What was Mia doing before she was introduced in the opening? it is simply irrelevant. There's no ground to answer your question. Maybe we could be meta and argue the scene allowed Mia/Emma Stone to display her acting to us thereby justifying herself for the role she'd auditioned for. That seems both tenuous and banal. This tranche of films staged, in the world of art/entertainment/cinema [Birdman, Gone Girl etc.] - the creative industries - inevitably raise lots of self-conscious question's about the industry and its conditions etc. *The Fools Who Dream* is them, and her, the artists; Mia's paean prefigures everything that will occur afterwards in the narrative. The question is how does this particular arrange itself in the whole of the film? Alternatively a 'counter-factual' that would be perhaps worth asking; what would the film be like without the musical scenes? i.e. a pure realist one in your sense?  \n\nArt has always been sequestrated from reality. What do Mona Lisa's feet look like is unanswerable. \n\nThe relevance of Magic Realism is different, and hard to judge in a musical since any realism must always there be contravened or suspended by, like you say, dancing in the street. Nevertheless magical realism is not instances of fantasy that *interrupt* the *clean emprical* reality, but the 'magicalness' of reality itself [hence you get a *blending* of 'fact and fiction' as the jargon puts it, the 'cues' you note – most obviously here music/singing - pulls in precisely the opposite direction]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;there is no &lt;em&gt;real&lt;/em&gt; Mia behind what appears on screen. What was Mia doing before she was introduced in the opening? it is simply irrelevant. There&amp;#39;s no ground to answer your question. Maybe we could be meta and argue the scene allowed Mia/Emma Stone to display her acting to us thereby justifying herself for the role she&amp;#39;d auditioned for. That seems both tenuous and banal. This tranche of films staged, in the world of art/entertainment/cinema [Birdman, Gone Girl etc.] - the creative industries - inevitably raise lots of self-conscious question&amp;#39;s about the industry and its conditions etc. &lt;em&gt;The Fools Who Dream&lt;/em&gt; is them, and her, the artists; Mia&amp;#39;s paean prefigures everything that will occur afterwards in the narrative. The question is how does this particular arrange itself in the whole of the film? Alternatively a &amp;#39;counter-factual&amp;#39; that would be perhaps worth asking; what would the film be like without the musical scenes? i.e. a pure realist one in your sense?  &lt;/p&gt;\n\n&lt;p&gt;Art has always been sequestrated from reality. What do Mona Lisa&amp;#39;s feet look like is unanswerable. &lt;/p&gt;\n\n&lt;p&gt;The relevance of Magic Realism is different, and hard to judge in a musical since any realism must always there be contravened or suspended by, like you say, dancing in the street. Nevertheless magical realism is not instances of fantasy that &lt;em&gt;interrupt&lt;/em&gt; the &lt;em&gt;clean emprical&lt;/em&gt; reality, but the &amp;#39;magicalness&amp;#39; of reality itself [hence you get a &lt;em&gt;blending&lt;/em&gt; of &amp;#39;fact and fiction&amp;#39; as the jargon puts it, the &amp;#39;cues&amp;#39; you note – most obviously here music/singing - pulls in precisely the opposite direction]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgb0wpl", "score_hidden": false, "stickied": false, "created": 1492311821.0, "created_utc": 1492283021.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": "", "user_reports": [], "id": "dgc1n30", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dgc150n", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "That's a good point. We sort of have to assume she is gifted at ad lib acting but the film never really establishes that. Perhaps it was trying to steer clear of the cliche of characters being undiscovered prodigies at their art: Sebastian and Mia are good at what they do, but they aren't meant to be musical and theatrical geniuses.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a good point. We sort of have to assume she is gifted at ad lib acting but the film never really establishes that. Perhaps it was trying to steer clear of the cliche of characters being undiscovered prodigies at their art: Sebastian and Mia are good at what they do, but they aren&amp;#39;t meant to be musical and theatrical geniuses.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgc1n30", "score_hidden": false, "stickied": false, "created": 1492379528.0, "created_utc": 1492350728.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc150n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "joncrimson", "parent_id": "t1_dgbug7l", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I guess I'd accept the existence of the \"underneath\", but I also have to stress whether or not it is important. The result is the same regardless: they get closer post-party, Mia gets the job. \n\nI guess the film is partly at fault for not developing Mia more. You can critique the lack of attention given to her actual skill, so the audition piece feels off. We can critique the film for not showing us her play, or for not fully representing her talents as being singing-based. There's a difficulty in attempting to examine the \"underneath\" when the façade itself is underdeveloped. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess I&amp;#39;d accept the existence of the &amp;quot;underneath&amp;quot;, but I also have to stress whether or not it is important. The result is the same regardless: they get closer post-party, Mia gets the job. &lt;/p&gt;\n\n&lt;p&gt;I guess the film is partly at fault for not developing Mia more. You can critique the lack of attention given to her actual skill, so the audition piece feels off. We can critique the film for not showing us her play, or for not fully representing her talents as being singing-based. There&amp;#39;s a difficulty in attempting to examine the &amp;quot;underneath&amp;quot; when the façade itself is underdeveloped. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgc150n", "score_hidden": false, "stickied": false, "created": 1492378608.0, "created_utc": 1492349808.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbug7l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dgbng5b", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "&gt;if the director doesn't directly reference that \"truth\", then it doesn't need to be discussed.\n\nI think this is my main point of contention. If we accept your reading that she got the job because she sang, then does that mean that we now have to suppose that Mia and Sebastian really did sing and tap dance to each other after the party? And really did fly around the galaxy inside a planetarium? I do not think this is how musicals (including this musical) work. I think the fantastical bits are meant to be taken as symbolising a reality 'underneath', and I think in almost all situations the reality underneath can be easily guessed. When it can't be easily guessed, that poses a conundrum.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;if the director doesn&amp;#39;t directly reference that &amp;quot;truth&amp;quot;, then it doesn&amp;#39;t need to be discussed.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think this is my main point of contention. If we accept your reading that she got the job because she sang, then does that mean that we now have to suppose that Mia and Sebastian really did sing and tap dance to each other after the party? And really did fly around the galaxy inside a planetarium? I do not think this is how musicals (including this musical) work. I think the fantastical bits are meant to be taken as symbolising a reality &amp;#39;underneath&amp;#39;, and I think in almost all situations the reality underneath can be easily guessed. When it can&amp;#39;t be easily guessed, that poses a conundrum.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgbug7l", "score_hidden": false, "stickied": false, "created": 1492359455.0, "created_utc": 1492330655.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbng5b", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "joncrimson", "parent_id": "t3_65k03z", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "When it comes to magical realism, often I take the magic as being part of that reality. One of the bigger messages of La La Land was that dreams and stories are greater than ourselves, and bring us to higher places. When I watch it, I don't read the magical moments as disguising or representing a real life thing within it, but as the moment and feeling itself. In magical realist literature (novels such as those by Gabriel Garcia Marquez) there is even less space to examine a possible \"reality\" behind the magical elements because the idea of a non-magical reality is not as important as the feelings and decisions of the characters themselves. \n\nPersonally, I would actually put some blame on Birdman and films like it for not going all the way and dropping clues to a purported reality behind it all. It makes the ending feel less ambiguous. Mia got the job in La La Land *because* she sang, just like they do sing in the streets of LA. It doesn't offer too much for analysis to look for a \"hidden truth\", because if the director doesn't directly reference that \"truth\", then it doesn't need to be discussed. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When it comes to magical realism, often I take the magic as being part of that reality. One of the bigger messages of La La Land was that dreams and stories are greater than ourselves, and bring us to higher places. When I watch it, I don&amp;#39;t read the magical moments as disguising or representing a real life thing within it, but as the moment and feeling itself. In magical realist literature (novels such as those by Gabriel Garcia Marquez) there is even less space to examine a possible &amp;quot;reality&amp;quot; behind the magical elements because the idea of a non-magical reality is not as important as the feelings and decisions of the characters themselves. &lt;/p&gt;\n\n&lt;p&gt;Personally, I would actually put some blame on Birdman and films like it for not going all the way and dropping clues to a purported reality behind it all. It makes the ending feel less ambiguous. Mia got the job in La La Land &lt;em&gt;because&lt;/em&gt; she sang, just like they do sing in the streets of LA. It doesn&amp;#39;t offer too much for analysis to look for a &amp;quot;hidden truth&amp;quot;, because if the director doesn&amp;#39;t directly reference that &amp;quot;truth&amp;quot;, then it doesn&amp;#39;t need to be discussed. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgbng5b", "score_hidden": false, "stickied": false, "created": 1492343943.0, "created_utc": 1492315143.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65k03z", "likes": null, "replies": "", "user_reports": [], "id": "dgbur6g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vallco", "parent_id": "t1_dgbuq49", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Huh, that's true. I never thought of that. He certainly is a pretty stiff person overall. I suppose music is his way of loosening up. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Huh, that&amp;#39;s true. I never thought of that. He certainly is a pretty stiff person overall. I suppose music is his way of loosening up. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgbur6g", "score_hidden": false, "stickied": false, "created": 1492360435.0, "created_utc": 1492331635.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbuq49", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dgbn5xx", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "&gt;In other words, it always felt like as soon as they characters broke into song, they changed into entirely different people. If this aspect of it wasn't intentionally done, then I feel that the director and actors have failed on their part to make a grounded musical – in my eyes, unless otherwise intentioned, the characters should always seem like themselves throughout the musical rather than popping in and out of personas like they're trying on clothes every time a song starts.\n\nI think in La La Land - and in most musicals - characters are a bigger version of themselves. 'Musical Sebastian' for example is way more chirpy and upbeat in the musical sections than 'non-musical Sebastian'. I mean, he has to be: his character hates the sort of music he is made to sing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In other words, it always felt like as soon as they characters broke into song, they changed into entirely different people. If this aspect of it wasn&amp;#39;t intentionally done, then I feel that the director and actors have failed on their part to make a grounded musical – in my eyes, unless otherwise intentioned, the characters should always seem like themselves throughout the musical rather than popping in and out of personas like they&amp;#39;re trying on clothes every time a song starts.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think in La La Land - and in most musicals - characters are a bigger version of themselves. &amp;#39;Musical Sebastian&amp;#39; for example is way more chirpy and upbeat in the musical sections than &amp;#39;non-musical Sebastian&amp;#39;. I mean, he has to be: his character hates the sort of music he is made to sing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgbuq49", "score_hidden": false, "stickied": false, "created": 1492360334.0, "created_utc": 1492331534.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbn5xx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "vallco", "parent_id": "t3_65k03z", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Interesting that you bring up this particular aspect of the film – it's a subject that I was discussing with a friend of mine just the other day. What I thought was so marvelously accomplished by Chazelle, Stone, and Gosling was that they made the transitions into song as seamless as possible.\n\nThey have spoken at length about this in interviews: how they always felt that traditional musicals – both onscreen and off – have always seemed like two *different* shows in one. One show is a straight tale told through words and \"normal\" behavior, and the other is a track listing of big production numbers.\n\nIn other words, it always felt like as soon as they characters broke into song, they changed into entirely different people. If this aspect of it wasn't intentionally done, then I feel that the director and actors have failed on their part to make a grounded musical – in my eyes, unless otherwise intentioned, the characters should always seem like themselves throughout the musical rather than popping in and out of personas like they're trying on clothes every time a song starts.\n\nWhether or not the singing that happened in *La La Land* actually took place is up to the individual viewer's own interpretation (everything except the final epilogue, that is; I think that part was pretty clear). It's quite difficult (and perhaps left undone) to dissect each scene with a song and determine whether or not there was actually singing in it.\n\nPersonally, I like to believe that all of the singing really did happen. Even Chazelle himself has stated that the film begins with \"Another Day of Sun\" simply to introduce the viewer to this fantastical realm in which this story exists.\n\nRegardless of all this, *La La Land* is a film that really shook me and made me feel things I hadn't felt before. It is a tour de force on all fronts; an emotional powerhouse and a universal anthem for every struggling artist who ever was, is, and will be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting that you bring up this particular aspect of the film – it&amp;#39;s a subject that I was discussing with a friend of mine just the other day. What I thought was so marvelously accomplished by Chazelle, Stone, and Gosling was that they made the transitions into song as seamless as possible.&lt;/p&gt;\n\n&lt;p&gt;They have spoken at length about this in interviews: how they always felt that traditional musicals – both onscreen and off – have always seemed like two &lt;em&gt;different&lt;/em&gt; shows in one. One show is a straight tale told through words and &amp;quot;normal&amp;quot; behavior, and the other is a track listing of big production numbers.&lt;/p&gt;\n\n&lt;p&gt;In other words, it always felt like as soon as they characters broke into song, they changed into entirely different people. If this aspect of it wasn&amp;#39;t intentionally done, then I feel that the director and actors have failed on their part to make a grounded musical – in my eyes, unless otherwise intentioned, the characters should always seem like themselves throughout the musical rather than popping in and out of personas like they&amp;#39;re trying on clothes every time a song starts.&lt;/p&gt;\n\n&lt;p&gt;Whether or not the singing that happened in &lt;em&gt;La La Land&lt;/em&gt; actually took place is up to the individual viewer&amp;#39;s own interpretation (everything except the final epilogue, that is; I think that part was pretty clear). It&amp;#39;s quite difficult (and perhaps left undone) to dissect each scene with a song and determine whether or not there was actually singing in it.&lt;/p&gt;\n\n&lt;p&gt;Personally, I like to believe that all of the singing really did happen. Even Chazelle himself has stated that the film begins with &amp;quot;Another Day of Sun&amp;quot; simply to introduce the viewer to this fantastical realm in which this story exists.&lt;/p&gt;\n\n&lt;p&gt;Regardless of all this, &lt;em&gt;La La Land&lt;/em&gt; is a film that really shook me and made me feel things I hadn&amp;#39;t felt before. It is a tour de force on all fronts; an emotional powerhouse and a universal anthem for every struggling artist who ever was, is, and will be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgbn5xx", "score_hidden": false, "stickied": false, "created": 1492343480.0, "created_utc": 1492314680.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]