[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueFilm", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There was a nice in-depth discussion on IMDB about this movie, but that chapter is closed. I&amp;#39;ve seen several interesting threads about this movie and Mulholland Dr here, but I cannot seem to be able to take part in these discussions. So, that&amp;#39;s why I start this thread.&lt;/p&gt;\n\n&lt;p&gt;My experience is that by listening to different opinions and looking alongside different angles one picks up interesting new thoughts. I believe that there is such a thing as overanalyzing yet a good rational hold on a movie such as this can enhance the viewing experience. The first time I watched IE I couldn&amp;#39;t watch it all the way through: I found it soooo boring. I was disappointed cause I am a huge admirer of the movies of Lynch. I guess like with most art one has to get a grip on it in order to be able to appreciate it. After many discussions and repeated viewings I think |I get it more now. Yes, there will always be room for interpretation and uncertainty, but that&amp;#39;s just the beauty of it. It&amp;#39;s like the viewing experience is never finished and is begging for reruns. &lt;/p&gt;\n\n&lt;p&gt;Some people approach IE as a complete metaphor and are convinced that the narrative is of minor importance in the overall experience. Others come up with highly original and authentic interpretations. I welcome all sorts of angles. What&amp;#39;s important is that we leave room for each interpretation; it&amp;#39;s very tempting to regard one&amp;#39;s own view as definite, but that just stifles the discussion imo.&lt;/p&gt;\n\n&lt;p&gt;Personally I see IE as the unwinding of a repressive fantasy into reality, while everything we see is on the one hand highly subjective and on the other hand the harsh reality. It will take some time to explain my view on this, but I doný know if anybody here is interested in that. I started this thread to see what sort of ideas about this movie are out there. I hope that this discussion, if any, will be fruitfull and in-depth. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "There was a nice in-depth discussion on IMDB about this movie, but that chapter is closed. I've seen several interesting threads about this movie and Mulholland Dr here, but I cannot seem to be able to take part in these discussions. So, that's why I start this thread.\n\nMy experience is that by listening to different opinions and looking alongside different angles one picks up interesting new thoughts. I believe that there is such a thing as overanalyzing yet a good rational hold on a movie such as this can enhance the viewing experience. The first time I watched IE I couldn't watch it all the way through: I found it soooo boring. I was disappointed cause I am a huge admirer of the movies of Lynch. I guess like with most art one has to get a grip on it in order to be able to appreciate it. After many discussions and repeated viewings I think |I get it more now. Yes, there will always be room for interpretation and uncertainty, but that's just the beauty of it. It's like the viewing experience is never finished and is begging for reruns. \n\nSome people approach IE as a complete metaphor and are convinced that the narrative is of minor importance in the overall experience. Others come up with highly original and authentic interpretations. I welcome all sorts of angles. What's important is that we leave room for each interpretation; it's very tempting to regard one's own view as definite, but that just stifles the discussion imo.\n\nPersonally I see IE as the unwinding of a repressive fantasy into reality, while everything we see is on the one hand highly subjective and on the other hand the harsh reality. It will take some time to explain my view on this, but I doný know if anybody here is interested in that. I started this thread to see what sort of ideas about this movie are out there. I hope that this discussion, if any, will be fruitfull and in-depth. \n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ljs2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "Erniesam", "saved": false, "mod_reports": [], "name": "t3_65ljs2", "subreddit_name_prefixed": "r/TrueFilm", "approved_by": null, "over_18": false, "domain": "self.TrueFilm", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2szp0", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TrueFilm/comments/65ljs2/discussion_of_inland_empire/", "num_reports": null, "locked": false, "stickied": false, "created": 1492320553.0, "url": "https://www.reddit.com/r/TrueFilm/comments/65ljs2/discussion_of_inland_empire/", "author_flair_text": null, "quarantine": false, "title": "Discussion of Inland Empire", "created_utc": 1492291753.0, "distinguished": null, "media": null, "upvote_ratio": 0.7, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65ljs2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65ljs2", "likes": null, "replies": "", "user_reports": [], "id": "dgbferp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Erniesam", "parent_id": "t1_dgbevd9", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Yes, I like to see it that way too. IE is surreal for sure, but like all surreal art there has to be an idea behind it, right? It isn't Dadaism afterall. Like you said many films of Lynch tread this thin line between reality and surrealism / dream. The intricate thing about IE is that one has no starting point; no clinging point to hold on to. One swims in the deep and has to figure out on their own how to get out. It seems to me that Lynch throws us many little clues to drive us into a certain direction, but many metaphors he uses can be interpreted in radical different ways. In some ways it's like a jigsaw puzzle except that one is never certain if their outcome / conclusion is right. The problem is of course that the protagonist (the real actress Dern) cannot be trusted in anyway, but there's nothing else we can go on.  So in the end we have to figure out which interpretation of a metaphor makes the most sense and try to connect them all together eventually. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, I like to see it that way too. IE is surreal for sure, but like all surreal art there has to be an idea behind it, right? It isn&amp;#39;t Dadaism afterall. Like you said many films of Lynch tread this thin line between reality and surrealism / dream. The intricate thing about IE is that one has no starting point; no clinging point to hold on to. One swims in the deep and has to figure out on their own how to get out. It seems to me that Lynch throws us many little clues to drive us into a certain direction, but many metaphors he uses can be interpreted in radical different ways. In some ways it&amp;#39;s like a jigsaw puzzle except that one is never certain if their outcome / conclusion is right. The problem is of course that the protagonist (the real actress Dern) cannot be trusted in anyway, but there&amp;#39;s nothing else we can go on.  So in the end we have to figure out which interpretation of a metaphor makes the most sense and try to connect them all together eventually. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgbferp", "score_hidden": false, "stickied": false, "created": 1492332067.0, "created_utc": 1492303267.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbevd9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Arkanoidal", "parent_id": "t3_65ljs2", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "It's been a while since I've watched it but I remember my impression was that it wasn't rational in the normal sense. In the same way that Eraserhead seemed like the internal dialogue of the main character, this seems to be imagined, it definitely feels more like a nightmare than any film I've seen. \n\nI feel like the best Lynch films tread the line between the real world and the dream world, they carry as much narrative as they have to to maintain the feeling of being in a dream, the way that a dream always feels real, especially a bad dream, and so looking for a narrative is a part of the experience, but ultimately it drifts into surreality.\n\nI feel like there are elements of the film that reflect the reality of the character, I believe she is an actor, maybe she does have a new role, maybe the film she is in is real, but similar to Eraserhead, the bulk of Inland Empire, if not all of it is the character digesting her unease with the reality of her life through a dreamlike state, whether this is all occurring in her dreams or she is drifting into madness, maybe the distinction doesn't matter, the important thing is the blurry line between real and surreal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s been a while since I&amp;#39;ve watched it but I remember my impression was that it wasn&amp;#39;t rational in the normal sense. In the same way that Eraserhead seemed like the internal dialogue of the main character, this seems to be imagined, it definitely feels more like a nightmare than any film I&amp;#39;ve seen. &lt;/p&gt;\n\n&lt;p&gt;I feel like the best Lynch films tread the line between the real world and the dream world, they carry as much narrative as they have to to maintain the feeling of being in a dream, the way that a dream always feels real, especially a bad dream, and so looking for a narrative is a part of the experience, but ultimately it drifts into surreality.&lt;/p&gt;\n\n&lt;p&gt;I feel like there are elements of the film that reflect the reality of the character, I believe she is an actor, maybe she does have a new role, maybe the film she is in is real, but similar to Eraserhead, the bulk of Inland Empire, if not all of it is the character digesting her unease with the reality of her life through a dreamlike state, whether this is all occurring in her dreams or she is drifting into madness, maybe the distinction doesn&amp;#39;t matter, the important thing is the blurry line between real and surreal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgbevd9", "score_hidden": false, "stickied": false, "created": 1492331278.0, "created_utc": 1492302478.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65ljs2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65ljs2", "likes": null, "replies": "", "user_reports": [], "id": "dgbfgta", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Erniesam", "parent_id": "t1_dgbbzqj", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Hmmm, I never thought about that: that it's Nikki's performance that frees Lost Girl. Interesting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmmm, I never thought about that: that it&amp;#39;s Nikki&amp;#39;s performance that frees Lost Girl. Interesting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgbfgta", "score_hidden": false, "stickied": false, "created": 1492332149.0, "created_utc": 1492303349.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbbzqj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Nyg500", "parent_id": "t3_65ljs2", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Maybe I'll expand on this later but very briefly my view on Inland Empire is:\n\nThe story is about actress who takes on the leading role in a cursed movie and has to relive the experiences of the woman who the film is based on. The film is cursed by a benevolent spirit; the Phantom who traps his victims (The Lost Girl) in a kind of purgatory. Through the help of the Lost Girl as well as other spirits (the rabbits, the neighbor and the whores), the actress is able to destroy the phantom and end the curse. \n\nThe subtext of the movie is about the power that a transcendent performance can have on its audience. Nikki's \"performance\" frees the Lost Girl and helps her to reach a powerful state of catharsis. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe I&amp;#39;ll expand on this later but very briefly my view on Inland Empire is:&lt;/p&gt;\n\n&lt;p&gt;The story is about actress who takes on the leading role in a cursed movie and has to relive the experiences of the woman who the film is based on. The film is cursed by a benevolent spirit; the Phantom who traps his victims (The Lost Girl) in a kind of purgatory. Through the help of the Lost Girl as well as other spirits (the rabbits, the neighbor and the whores), the actress is able to destroy the phantom and end the curse. &lt;/p&gt;\n\n&lt;p&gt;The subtext of the movie is about the power that a transcendent performance can have on its audience. Nikki&amp;#39;s &amp;quot;performance&amp;quot; frees the Lost Girl and helps her to reach a powerful state of catharsis. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgbbzqj", "score_hidden": false, "stickied": false, "created": 1492327216.0, "created_utc": 1492298416.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]