[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueFilm", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The Exodus epic is arguably the most iconic &amp;amp; influential myth in all of Western Civilization. Of course it&amp;#39;s no surprise this story has been adapted numerous times in children animated serials, made for TV movies, &amp;amp; major Hollywood films stretching way back into the silent era but today I wanted to go over the 3 most prominent &amp;amp; well known versions of this story &amp;amp; why they are great or lack thereof. &lt;/p&gt;\n\n&lt;p&gt;The 1956 version of &amp;quot;The Ten Commandments&amp;quot; is the perhaps the mother of all biblical epics. No other live action Biblical epic to date has yet surpassed this classic. This movie still represents filmmaking at its most grand, lavish, &amp;amp; engaging. Heston plays Moses with respect towards the character &amp;amp; with a strong commanding gravitas. Notably the villains in this movie are terrific too whether its Yul Brynner as the despot Pharaoh Ramses, Vincent Price as the chief architect, or Edward G. Robinson as the slave overseer. The sets in this film are still an industry best. The raising of the obelisk scene as well as the actual exodus scene as the masses are leaving the towering gates of Egypt lined with sphinxes never fails to make me gasp in awe. Its 4 Hour run time I think is an asset since it really lets the story build to a crescendo. Notable too is the gorgeous costume design. This is a film that had to demonstrate the rich &amp;amp; elite &amp;amp; the literal dirt poor slaves. Ramses&amp;#39;s bronze vulture armor for example is very eye catching piece, and of course Moses&amp;#39;s striped garb has become an iconic costume. Through the score, Elmer Bernstein&amp;#39;s bombastic opening suite immediately conveys the drama &amp;amp; importance of what is about to be shown.  If you were to ask me what I think is one of the greatest moments in cinema I cant think of a more moving, powerful, &amp;amp; fantastical cinematic moment than the exodus from Egypt and Moses parting the Red Sea to lead the Hebrews into the Promised Land after 400 Years of Slavery in Egypt, Pharaohs chariots stopped momentarily by a Pillar of Fire only to follow the Hebrews into a canyon of water to their deaths. Sure some of its elements haven&amp;#39;t aged well, like some of the campy lines &amp;amp; outdated visual effects but what is still as immortal as ever is the powerful &amp;amp; gripping drama that is the story of Moses as he finds his identity &amp;amp; goes on to fulfill his destiny as &amp;quot;the one&amp;quot; to free his fellow from Hebrews from Egypt. &lt;/p&gt;\n\n&lt;p&gt;The 1998 film &amp;quot;The Prince of Egypt&amp;quot; I think still represents the pinnacle of the 2D medium. The Exodus is beautifully &amp;amp; lavishly brought to life in this gorgeous animated musical. Full well knowing what the legacy of Heston&amp;#39;s film was Spielberg&amp;#39;s Dreamworks somehow were able to pull of the same story but with enough changes to the drama that made it a unique retelling of the story of Moses but that still stuck the landing to all the major plot points. The musical opening to this film is still the most hauntingly spellbinding opening I&amp;#39;ve ever seen in any film as in 7 minutes we are shown the plight of the Hebrews &amp;amp; Moses&amp;#39;s mother tearful goodbye to her baby son as she lets him float away. The powerful opening &amp;amp; closing songs are very eloquent &amp;amp; emotionally expressive. Moses&amp;#39;s archetypal hero journey is dramatically satisfying &amp;amp; its genuinely sad to see the rivalry that he grows to have with Ramses who he still loves but is forced to challenge. The main story of slavery, bondage, &amp;amp; freedom is enough to move any human being. This is a film that can appeal to the religious, fans of animated films, fans of historical fantasy &amp;amp; myth, &amp;amp; fans of musicals. IMO it&amp;#39;s one of the best animated movies of all time. Every time I see this film it feels like I&amp;#39;m watching something akin to that of The Lord of The Rings trilogy. The animation is grounded in realism however it contains a vast imaginative power whenever a scene involving magic or fantasy occurs. Egypt is so grand &amp;amp; the monuments drawn with an immortal dominant power. The desert is rendered as harsh &amp;amp; cruel, the Nile a microcosm of life, Pharaohs court worthy of the seat of power it holds, &amp;amp; the iconic climax is a stunning visual marvel, like something out of a fever dream. The most important thing is that the depiction of the human feeling works very well through the facial expressions that are drawn. It is so good it&amp;#39;s as captivating as real actors. I prefer it over the style of the beloved epics from studio Ghibli. It&amp;#39;s quite possibly the most epic animated movie ever made. It&amp;#39;s a masterpiece &amp;amp; a shame that Dreamworks stopped making these type of films. &lt;/p&gt;\n\n&lt;p&gt;What can a contemporary adaptation of Exodus offer that previous adaptations couldn’t? Presumably all of the fantasy, grandeur, and spectacle of the story that hasn’t been able to see the light of the big screen. The classic 1956 “The Ten Commandments” only showed 3 of the plagues, and its Red Sea sequence, though charming and effective, is dated. Perhaps the drama of Moses finding his identity as the Deliverer and the brutality of the enslavement of the Hebrews will be portrayed with more grit and blood than in the terrific 1998 animated musical “The Prince of Egypt”? Perhaps. Perhaps but no. The story of Moses represents the archetypal hero quest. All of the basic elements that make a timeless adventure are present in the story of Exodus: the struggle for the freedom of a nation, a leader who guides them and wields a magical staff, a royal court hell bent on oppression, plagues, a sea being split in two. The script nearly writes itself! All a filmmaker need do is fill in the gaps with artistic license and presto the epic is made and has been. All of the magic, the wonder, the drama has already been lavishly and faithfully portrayed in “The Ten Commandments” and the in “The Prince of Egypt”. Both have served justice to the story by portraying the story with spectacle, emotion, and engaging drama. This is what “Exodus: Gods &amp;amp; Kings&amp;quot; fails to do, on nearly every level. Both TTC and TPoE begin by portraying the massacre of the Hebrew first born by Pharaoh. This is a necessary back story to establish the setting in which events of grand magnitude will unfold. We understand the plight of the Hebrews. We understand that Moses will be saved from this horror and that he will be the Chosen One. “Exodus: Gods &amp;amp; Kings” acts as if this is almost an afterthought. None of this is even shown in the film, merely alluded to in brief moments of dialogue. This is a film that is so hastily cut together that there is little to no exposition of the characters or their intentions. In TTC &amp;amp; TPoE the turning point for Moses is his identity crisis when he learns he is Hebrew. This leads him to kill a slave overseer and then go into exile to find himself. It’s one of the most moving parts of the story. It’s when everything changes and his destiny as the Chosen One will be revealed to him. Appallingly all of this is cut from EGaK. The core heart of the story of his identity crisis is not present &amp;amp; as if that were not bad enough, every magical, supernatural, and stirring dramatic element that makes the story so iconic is eschewed and replaced by lackluster realism.  The most emotional part of the Exodus story is the Exodus itself (The entire point of the story!) TTC does this with a cast of hundreds of extras walking away from a giant live set of the gates of Egypt. TPoE uses this moment for its most emotive and moving musical number. In both films there is joy, jubilation, and elated celebration portrayed. In EGaK the Exdous itself is yet another afterthought. We see a CGI crowd walk in the desert filmed through a bleak grey filter that you may be tempted to imagine they might even be apathetic to their new freedom. When they arrive at the Red Sea, instead of a wall of fire coming from the sky to stop Pharaoh&amp;#39;s chariots from massacring the entrapped Hebrews, Pharaoh&amp;#39;s chariots fall off of a cliff instead. And instead of the fantastical climax of the parting of the Red Sea by Moses&amp;#39; enchanted staff, a comet causes the tide to recede! How dreadfully unsexy.  Out of all the Bible myths to retell in a realistic fashion, they chose the one with the most spectacular fantasy set pieces and took out all of the wonder, majesty, magic and heart out of the story! Yet again the previous adaptations prove superior in nearly every way. Apparently this was supposed to be a 4 hour movie (Its 2.5 hours), which explains a lot. But none the less, the finished product transforms this epic historical fantasy into a bleak, grey, soulless, &amp;amp; joyless exercise. For shame. The reason the recent adaptation of “NOAH” worked so well is that it fully embraced its supernatural ridiculousness and went full throttle with it (and then some!) Simply put, what Exodus: God &amp;amp; Kings could have used was the wizardry of myth instead of boring bleak realism. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The Exodus epic is arguably the most iconic &amp; influential myth in all of Western Civilization. Of course it's no surprise this story has been adapted numerous times in children animated serials, made for TV movies, &amp; major Hollywood films stretching way back into the silent era but today I wanted to go over the 3 most prominent &amp; well known versions of this story &amp; why they are great or lack thereof. \n\nThe 1956 version of \"The Ten Commandments\" is the perhaps the mother of all biblical epics. No other live action Biblical epic to date has yet surpassed this classic. This movie still represents filmmaking at its most grand, lavish, &amp; engaging. Heston plays Moses with respect towards the character &amp; with a strong commanding gravitas. Notably the villains in this movie are terrific too whether its Yul Brynner as the despot Pharaoh Ramses, Vincent Price as the chief architect, or Edward G. Robinson as the slave overseer. The sets in this film are still an industry best. The raising of the obelisk scene as well as the actual exodus scene as the masses are leaving the towering gates of Egypt lined with sphinxes never fails to make me gasp in awe. Its 4 Hour run time I think is an asset since it really lets the story build to a crescendo. Notable too is the gorgeous costume design. This is a film that had to demonstrate the rich &amp; elite &amp; the literal dirt poor slaves. Ramses's bronze vulture armor for example is very eye catching piece, and of course Moses's striped garb has become an iconic costume. Through the score, Elmer Bernstein's bombastic opening suite immediately conveys the drama &amp; importance of what is about to be shown.  If you were to ask me what I think is one of the greatest moments in cinema I cant think of a more moving, powerful, &amp; fantastical cinematic moment than the exodus from Egypt and Moses parting the Red Sea to lead the Hebrews into the Promised Land after 400 Years of Slavery in Egypt, Pharaohs chariots stopped momentarily by a Pillar of Fire only to follow the Hebrews into a canyon of water to their deaths. Sure some of its elements haven't aged well, like some of the campy lines &amp; outdated visual effects but what is still as immortal as ever is the powerful &amp; gripping drama that is the story of Moses as he finds his identity &amp; goes on to fulfill his destiny as \"the one\" to free his fellow from Hebrews from Egypt. \n\n\nThe 1998 film \"The Prince of Egypt\" I think still represents the pinnacle of the 2D medium. The Exodus is beautifully &amp; lavishly brought to life in this gorgeous animated musical. Full well knowing what the legacy of Heston's film was Spielberg's Dreamworks somehow were able to pull of the same story but with enough changes to the drama that made it a unique retelling of the story of Moses but that still stuck the landing to all the major plot points. The musical opening to this film is still the most hauntingly spellbinding opening I've ever seen in any film as in 7 minutes we are shown the plight of the Hebrews &amp; Moses's mother tearful goodbye to her baby son as she lets him float away. The powerful opening &amp; closing songs are very eloquent &amp; emotionally expressive. Moses's archetypal hero journey is dramatically satisfying &amp; its genuinely sad to see the rivalry that he grows to have with Ramses who he still loves but is forced to challenge. The main story of slavery, bondage, &amp; freedom is enough to move any human being. This is a film that can appeal to the religious, fans of animated films, fans of historical fantasy &amp; myth, &amp; fans of musicals. IMO it's one of the best animated movies of all time. Every time I see this film it feels like I'm watching something akin to that of The Lord of The Rings trilogy. The animation is grounded in realism however it contains a vast imaginative power whenever a scene involving magic or fantasy occurs. Egypt is so grand &amp; the monuments drawn with an immortal dominant power. The desert is rendered as harsh &amp; cruel, the Nile a microcosm of life, Pharaohs court worthy of the seat of power it holds, &amp; the iconic climax is a stunning visual marvel, like something out of a fever dream. The most important thing is that the depiction of the human feeling works very well through the facial expressions that are drawn. It is so good it's as captivating as real actors. I prefer it over the style of the beloved epics from studio Ghibli. It's quite possibly the most epic animated movie ever made. It's a masterpiece &amp; a shame that Dreamworks stopped making these type of films. \n\n\n\nWhat can a contemporary adaptation of Exodus offer that previous adaptations couldn’t? Presumably all of the fantasy, grandeur, and spectacle of the story that hasn’t been able to see the light of the big screen. The classic 1956 “The Ten Commandments” only showed 3 of the plagues, and its Red Sea sequence, though charming and effective, is dated. Perhaps the drama of Moses finding his identity as the Deliverer and the brutality of the enslavement of the Hebrews will be portrayed with more grit and blood than in the terrific 1998 animated musical “The Prince of Egypt”? Perhaps. Perhaps but no. The story of Moses represents the archetypal hero quest. All of the basic elements that make a timeless adventure are present in the story of Exodus: the struggle for the freedom of a nation, a leader who guides them and wields a magical staff, a royal court hell bent on oppression, plagues, a sea being split in two. The script nearly writes itself! All a filmmaker need do is fill in the gaps with artistic license and presto the epic is made and has been. All of the magic, the wonder, the drama has already been lavishly and faithfully portrayed in “The Ten Commandments” and the in “The Prince of Egypt”. Both have served justice to the story by portraying the story with spectacle, emotion, and engaging drama. This is what “Exodus: Gods &amp; Kings\" fails to do, on nearly every level. Both TTC and TPoE begin by portraying the massacre of the Hebrew first born by Pharaoh. This is a necessary back story to establish the setting in which events of grand magnitude will unfold. We understand the plight of the Hebrews. We understand that Moses will be saved from this horror and that he will be the Chosen One. “Exodus: Gods &amp; Kings” acts as if this is almost an afterthought. None of this is even shown in the film, merely alluded to in brief moments of dialogue. This is a film that is so hastily cut together that there is little to no exposition of the characters or their intentions. In TTC &amp; TPoE the turning point for Moses is his identity crisis when he learns he is Hebrew. This leads him to kill a slave overseer and then go into exile to find himself. It’s one of the most moving parts of the story. It’s when everything changes and his destiny as the Chosen One will be revealed to him. Appallingly all of this is cut from EGaK. The core heart of the story of his identity crisis is not present &amp; as if that were not bad enough, every magical, supernatural, and stirring dramatic element that makes the story so iconic is eschewed and replaced by lackluster realism.  The most emotional part of the Exodus story is the Exodus itself (The entire point of the story!) TTC does this with a cast of hundreds of extras walking away from a giant live set of the gates of Egypt. TPoE uses this moment for its most emotive and moving musical number. In both films there is joy, jubilation, and elated celebration portrayed. In EGaK the Exdous itself is yet another afterthought. We see a CGI crowd walk in the desert filmed through a bleak grey filter that you may be tempted to imagine they might even be apathetic to their new freedom. When they arrive at the Red Sea, instead of a wall of fire coming from the sky to stop Pharaoh's chariots from massacring the entrapped Hebrews, Pharaoh's chariots fall off of a cliff instead. And instead of the fantastical climax of the parting of the Red Sea by Moses' enchanted staff, a comet causes the tide to recede! How dreadfully unsexy.  Out of all the Bible myths to retell in a realistic fashion, they chose the one with the most spectacular fantasy set pieces and took out all of the wonder, majesty, magic and heart out of the story! Yet again the previous adaptations prove superior in nearly every way. Apparently this was supposed to be a 4 hour movie (Its 2.5 hours), which explains a lot. But none the less, the finished product transforms this epic historical fantasy into a bleak, grey, soulless, &amp; joyless exercise. For shame. The reason the recent adaptation of “NOAH” worked so well is that it fully embraced its supernatural ridiculousness and went full throttle with it (and then some!) Simply put, what Exodus: God &amp; Kings could have used was the wizardry of myth instead of boring bleak realism. \n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65mptp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 52, "report_reasons": null, "author": "GenericReditUserName", "saved": false, "mod_reports": [], "name": "t3_65mptp", "subreddit_name_prefixed": "r/TrueFilm", "approved_by": null, "over_18": false, "domain": "self.TrueFilm", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2szp0", "edited": 1492309126.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TrueFilm/comments/65mptp/the_highs_lows_of_hollywoods_exodus_adaptations/", "num_reports": null, "locked": false, "stickied": false, "created": 1492335307.0, "url": "https://www.reddit.com/r/TrueFilm/comments/65mptp/the_highs_lows_of_hollywoods_exodus_adaptations/", "author_flair_text": null, "quarantine": false, "title": "The highs &amp; lows of Hollywood's Exodus adaptations", "created_utc": 1492306507.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 52}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]