[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueFilm", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There is a penetrative quality about Fat Girl. Catherine Breillat&amp;#39;s film excels in the way it presents its material matter of factly. Breillat chooses to let the camera really linger on certain moments, keeping cuts to a minimum while focusing on the situation at hand, usually at a very objective perspective refraining the audience from becoming thoroughly emotionally invested in any of the characters. This is not really a fault for Fat Girl, as it is a device through which Breillat comments on the nature of love which seems very much to be cynical, at least through the eyes of Anais. However, cynical as Anais may be, perhaps cynical could be exchanged with the word &amp;#39;realistic&amp;#39;. The examples set by her family, specifically her mother and her sister, are poor at best. The females in her life seem to &amp;quot;lead lives of quiet desperation&amp;quot;. In one scene her uninterested mother kisses her husband goodbye. She kisses him tenderly, while it is purely mechanical for him, even a chore. Her sister, a fifteen year old teenage beauty, is coerced into anal sex with a boy she just met. &lt;/p&gt;\n\n&lt;p&gt;As stated earlier, the way in which Breiallat utilizes the camera centrally focusing on dramatic events with minimal cuts is at first a bit overbearing, but ultimately I admire the attempt to let the moment speak for itself without trying to artificially manipulate the audience to feel a certain way, which is where I feel many modern hollywood movies sorely miss the mark. There is minimal use of music, and when it is used, it feels slightly ironic set to the backdrop of this family vacation gone wrong. &lt;/p&gt;\n\n&lt;p&gt;By the end of the film, the viewer can sense that something troubling is brewing. In a car ride where the mother and the two sisters are driving back to Paris, the mother confronts Elena about her sexual experiences with Fernando. Elena retorts, asking her if she had never herself had a &amp;quot;first time&amp;quot; with someone, when she was her age. Her mother&amp;#39;s response, &amp;quot;this isn&amp;#39;t about me.&amp;quot; Later Anais has to get out of the car because she feels sick, and vomits, while her sister comforts her and wishes that her mother was dead. They drive on, semi trucks seemingly closing in on them all around the road. There is a very palatable, claustrophobic quality to these scenes. the viewer themselves are starting to &amp;quot;feel sick&amp;quot; as Anais, about this horribly dysfunctional family unit where Anais feels Elena to be the center of it all, and she simmers with jealously. By the time we get the films shocking ending, we are left almost like we were punched in the gut. I thought it was interesting the way in which Breiallat diverts expectations from the viewer. Even though we knew something bad was around the corner, we never thought it would be this bad. When the three girls park in an interstate rest stop, and Elena steps out of the car to use the bathroom, you are almost immediately sure that this is the moment where something awful will happen. But when Elena comes back to the car unharmed, I was left feeling actually surprised. Then, as suddenly and as forcefully as the scene unfolds, a man with an ax smashes their car window, and immediately kills Elena with a blow to the head, and then strangles her mother. He rapes Anais, and when she is recovered later, states that he didn&amp;#39;t rape her. She had gotten what she wanted, which was to lose her virginity to someone she didn&amp;#39;t love, but at what cost? At the end of the film she is defending her rapist, but how will Anais develop as a woman? Will psychological trauma ensue? We would guess that it would. Maybe she will have kids and end up as apathetic as her mother.&lt;/p&gt;\n\n&lt;p&gt;Good film, although admittedly after my initial first viewing, the film had left me feeling a bit baffled. It handled some really difficult subject matter with grace, and refrains from sentimental indulgence in a way that will, I would guess, leave many viewers feeling cold about it. But still, it is a film that has balls, from a female director with some very interesting views about sex and love in our society, and the pressures it places on people.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "There is a penetrative quality about Fat Girl. Catherine Breillat's film excels in the way it presents its material matter of factly. Breillat chooses to let the camera really linger on certain moments, keeping cuts to a minimum while focusing on the situation at hand, usually at a very objective perspective refraining the audience from becoming thoroughly emotionally invested in any of the characters. This is not really a fault for Fat Girl, as it is a device through which Breillat comments on the nature of love which seems very much to be cynical, at least through the eyes of Anais. However, cynical as Anais may be, perhaps cynical could be exchanged with the word 'realistic'. The examples set by her family, specifically her mother and her sister, are poor at best. The females in her life seem to \"lead lives of quiet desperation\". In one scene her uninterested mother kisses her husband goodbye. She kisses him tenderly, while it is purely mechanical for him, even a chore. Her sister, a fifteen year old teenage beauty, is coerced into anal sex with a boy she just met. \n\nAs stated earlier, the way in which Breiallat utilizes the camera centrally focusing on dramatic events with minimal cuts is at first a bit overbearing, but ultimately I admire the attempt to let the moment speak for itself without trying to artificially manipulate the audience to feel a certain way, which is where I feel many modern hollywood movies sorely miss the mark. There is minimal use of music, and when it is used, it feels slightly ironic set to the backdrop of this family vacation gone wrong. \n\nBy the end of the film, the viewer can sense that something troubling is brewing. In a car ride where the mother and the two sisters are driving back to Paris, the mother confronts Elena about her sexual experiences with Fernando. Elena retorts, asking her if she had never herself had a \"first time\" with someone, when she was her age. Her mother's response, \"this isn't about me.\" Later Anais has to get out of the car because she feels sick, and vomits, while her sister comforts her and wishes that her mother was dead. They drive on, semi trucks seemingly closing in on them all around the road. There is a very palatable, claustrophobic quality to these scenes. the viewer themselves are starting to \"feel sick\" as Anais, about this horribly dysfunctional family unit where Anais feels Elena to be the center of it all, and she simmers with jealously. By the time we get the films shocking ending, we are left almost like we were punched in the gut. I thought it was interesting the way in which Breiallat diverts expectations from the viewer. Even though we knew something bad was around the corner, we never thought it would be this bad. When the three girls park in an interstate rest stop, and Elena steps out of the car to use the bathroom, you are almost immediately sure that this is the moment where something awful will happen. But when Elena comes back to the car unharmed, I was left feeling actually surprised. Then, as suddenly and as forcefully as the scene unfolds, a man with an ax smashes their car window, and immediately kills Elena with a blow to the head, and then strangles her mother. He rapes Anais, and when she is recovered later, states that he didn't rape her. She had gotten what she wanted, which was to lose her virginity to someone she didn't love, but at what cost? At the end of the film she is defending her rapist, but how will Anais develop as a woman? Will psychological trauma ensue? We would guess that it would. Maybe she will have kids and end up as apathetic as her mother.\n\nGood film, although admittedly after my initial first viewing, the film had left me feeling a bit baffled. It handled some really difficult subject matter with grace, and refrains from sentimental indulgence in a way that will, I would guess, leave many viewers feeling cold about it. But still, it is a film that has balls, from a female director with some very interesting views about sex and love in our society, and the pressures it places on people.\n\n\n\n ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65t2sy", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "Drengerous", "saved": false, "mod_reports": [], "name": "t3_65t2sy", "subreddit_name_prefixed": "r/TrueFilm", "approved_by": null, "over_18": false, "domain": "self.TrueFilm", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2szp0", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TrueFilm/comments/65t2sy/some_thoughts_on_fat_girl_for_my_sister/", "num_reports": null, "locked": false, "stickied": false, "created": 1492425879.0, "url": "https://www.reddit.com/r/TrueFilm/comments/65t2sy/some_thoughts_on_fat_girl_for_my_sister/", "author_flair_text": null, "quarantine": false, "title": "Some thoughts on Fat Girl (For My Sister)", "created_utc": 1492397079.0, "distinguished": null, "media": null, "upvote_ratio": 0.69, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65t2sy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65t2sy", "likes": null, "replies": "", "user_reports": [], "id": "dgd4gf3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Drengerous", "parent_id": "t1_dgd3tvl", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "Very good point! Didn't think about it that way, buy you are absolutely right about the way she shows rape. I feel like at the end she actually felt flattered, feeling that the murderer \"chose\" her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very good point! Didn&amp;#39;t think about it that way, buy you are absolutely right about the way she shows rape. I feel like at the end she actually felt flattered, feeling that the murderer &amp;quot;chose&amp;quot; her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgd4gf3", "score_hidden": false, "stickied": false, "created": 1492433086.0, "created_utc": 1492404286.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd3tvl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HejAnton", "parent_id": "t3_65t2sy", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I think Breillat shows us a truth we don't want to see. She shows us a duality of rape, the final scene being the rape that we think of when we hear of it but the first case being far closer to what most rapes are like in our world. \n\nI want to say that it's provocative but it feels too close to reality to call it that. Breillat doesn't attempt to smooth things over or show something that isn't brutally honest reality for a lot of girls all over the world. She does a surprisingly good job with tension to create an uneasy mood that makes us dread whatever is around the corner, much like your example with the car scene but just as much during the scenes in the bed room - we know what's about to happen we just don't want it to.\n\nFat Girl is fascinating to me but such a tough watch that it just churns my stomach thinking about it but I guess that means Breillat succeeded.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think Breillat shows us a truth we don&amp;#39;t want to see. She shows us a duality of rape, the final scene being the rape that we think of when we hear of it but the first case being far closer to what most rapes are like in our world. &lt;/p&gt;\n\n&lt;p&gt;I want to say that it&amp;#39;s provocative but it feels too close to reality to call it that. Breillat doesn&amp;#39;t attempt to smooth things over or show something that isn&amp;#39;t brutally honest reality for a lot of girls all over the world. She does a surprisingly good job with tension to create an uneasy mood that makes us dread whatever is around the corner, much like your example with the car scene but just as much during the scenes in the bed room - we know what&amp;#39;s about to happen we just don&amp;#39;t want it to.&lt;/p&gt;\n\n&lt;p&gt;Fat Girl is fascinating to me but such a tough watch that it just churns my stomach thinking about it but I guess that means Breillat succeeded.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgd3tvl", "score_hidden": false, "stickied": false, "created": 1492431982.0, "created_utc": 1492403182.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65t2sy", "likes": null, "replies": "", "user_reports": [], "id": "dgd8pqt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "agentphelps", "parent_id": "t3_65t2sy", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I haven't seen this movie since it was released (after being banned in Canada - or there was an attempt to, at least), but I think I remember it well enough. My takeaway was that Anais was equating Elena's first time to her own experience, i.e., they were both rape. This is why she says she wasn't raped, because a man forcing himself on a girl is normal as far as she knows. It could be extrapolated to be a more general statement about rape culture - though I am not equipped to make that statement. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t seen this movie since it was released (after being banned in Canada - or there was an attempt to, at least), but I think I remember it well enough. My takeaway was that Anais was equating Elena&amp;#39;s first time to her own experience, i.e., they were both rape. This is why she says she wasn&amp;#39;t raped, because a man forcing himself on a girl is normal as far as she knows. It could be extrapolated to be a more general statement about rape culture - though I am not equipped to make that statement. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgd8pqt", "score_hidden": false, "stickied": false, "created": 1492442195.0, "created_utc": 1492413395.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2szp0", "removal_reason": null, "link_id": "t3_65t2sy", "likes": null, "replies": "", "user_reports": [], "id": "dgdqlu8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rhubarbjelly", "parent_id": "t3_65t2sy", "subreddit_name_prefixed": "r/TrueFilm", "controversiality": 0, "body": "I saw this film years ago but still remember it pretty well - something I would attribute to more than simple shock factor. Having said that, I also remember Breillat's previous film, *Romance*, which I'm pretty sure I remember only for its shock factor. In my opinion *Fat Girl* is by far the superior film. \n\nI've always been curious about the title change for its English language release. The original French title, *A Ma Soeur!* (To My Sister!), contextualises the narrative in a radically different way to the confrontational 'Fat Girl'. It almost becomes a different film. I wonder why this decision was taken? Simply to create controversy? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I saw this film years ago but still remember it pretty well - something I would attribute to more than simple shock factor. Having said that, I also remember Breillat&amp;#39;s previous film, &lt;em&gt;Romance&lt;/em&gt;, which I&amp;#39;m pretty sure I remember only for its shock factor. In my opinion &lt;em&gt;Fat Girl&lt;/em&gt; is by far the superior film. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always been curious about the title change for its English language release. The original French title, &lt;em&gt;A Ma Soeur!&lt;/em&gt; (To My Sister!), contextualises the narrative in a radically different way to the confrontational &amp;#39;Fat Girl&amp;#39;. It almost becomes a different film. I wonder why this decision was taken? Simply to create controversy? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueFilm", "name": "t1_dgdqlu8", "score_hidden": false, "stickied": false, "created": 1492476461.0, "created_utc": 1492447661.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]