[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TinyHouses", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello :) After learning about container homes, how they need insulation I had this idea... I would love to get feedback about potential problems with this approach. Anyone has experiences with foam core construction?&lt;/p&gt;\n\n&lt;p&gt;If you live in an area where you need insulation (from heat, from cold, from sound), foam is pretty much the best since it seals all the nooks and crannies. The savings on heating in colder areas or air conditioning in hot areas would make up for the carbon costs of producing the foam from oil.&lt;/p&gt;\n\n&lt;p&gt;So why not just use the insulation without any wood or whatever frames and laminate it? Like foam core boats are made? Wouldn&amp;#39;t this be the ultimate way of building houses, a few centimeters of insulation and a thin hard layer?&lt;/p&gt;\n\n&lt;p&gt;The result would be a tough, insulated, lightweight house that can be created by a single person and could even be transported somewhere else.&lt;/p&gt;\n\n&lt;p&gt;You could get very creative with shapes and carve accents or reliefs into the wall before laminating. You could even make the floor a little bit thicker and higher to make a flat bottomed boat house!&lt;/p&gt;\n\n&lt;p&gt;For boats you use polyurethane or other closed cell foam blocks, glue them together and carve and sculpt them very easily. Then you lay up multiple layers of fiberglass and epoxy or polyester resin (polyester is cheaper, epoxy is stronger). There are quite a few alternatives to PU foam and there might be more eco friendly (less CO2 / oil during production) or even renewable ecological sources (something like cornstarch packing peanuts). You might also be able to use other more natural fibers as an alternatives to fiberglass.&lt;/p&gt;\n\n&lt;p&gt;For a bungalow you wouldn&amp;#39;t need to worry about floors (although that would be possible using foam core composits as well) or a roof - simply paint it with a weatherproof paint used for boating.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s easy to repair and won&amp;#39;t leak (at least not with PU foam).&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t need any heavy machinery or power tools since the materials are lightweight and can be cut easily by hand. You might need protective clothing, respirator and gloves though.&lt;/p&gt;\n\n&lt;p&gt;The only concern I can think of would be fire safety and fixing it to a foundation so it won&amp;#39;t blow over. And that it isn&amp;#39;t exactly all natural - but it should be more about the ecological balance over it&amp;#39;s lifetime.&lt;/p&gt;\n\n&lt;p&gt;So why haven&amp;#39;t I seen any DIY houses build like this? What is the problem with this approach? Costs?  (Personally I&amp;#39;m having a hard time finding PU closed cell foam board here in europe).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello :) After learning about container homes, how they need insulation I had this idea... I would love to get feedback about potential problems with this approach. Anyone has experiences with foam core construction?\n\nIf you live in an area where you need insulation (from heat, from cold, from sound), foam is pretty much the best since it seals all the nooks and crannies. The savings on heating in colder areas or air conditioning in hot areas would make up for the carbon costs of producing the foam from oil.\n\nSo why not just use the insulation without any wood or whatever frames and laminate it? Like foam core boats are made? Wouldn't this be the ultimate way of building houses, a few centimeters of insulation and a thin hard layer?\n\nThe result would be a tough, insulated, lightweight house that can be created by a single person and could even be transported somewhere else.\n\nYou could get very creative with shapes and carve accents or reliefs into the wall before laminating. You could even make the floor a little bit thicker and higher to make a flat bottomed boat house!\n\nFor boats you use polyurethane or other closed cell foam blocks, glue them together and carve and sculpt them very easily. Then you lay up multiple layers of fiberglass and epoxy or polyester resin (polyester is cheaper, epoxy is stronger). There are quite a few alternatives to PU foam and there might be more eco friendly (less CO2 / oil during production) or even renewable ecological sources (something like cornstarch packing peanuts). You might also be able to use other more natural fibers as an alternatives to fiberglass.\n\nFor a bungalow you wouldn't need to worry about floors (although that would be possible using foam core composits as well) or a roof - simply paint it with a weatherproof paint used for boating.\n\nIt's easy to repair and won't leak (at least not with PU foam).\n\nYou don't need any heavy machinery or power tools since the materials are lightweight and can be cut easily by hand. You might need protective clothing, respirator and gloves though.\n\nThe only concern I can think of would be fire safety and fixing it to a foundation so it won't blow over. And that it isn't exactly all natural - but it should be more about the ecological balance over it's lifetime.\n\nSo why haven't I seen any DIY houses build like this? What is the problem with this approach? Costs?  (Personally I'm having a hard time finding PU closed cell foam board here in europe).\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65p55e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 44, "report_reasons": null, "author": "FarkMcBark", "saved": false, "mod_reports": [], "name": "t3_65p55e", "subreddit_name_prefixed": "r/TinyHouses", "approved_by": null, "over_18": false, "domain": "self.TinyHouses", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rab5", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TinyHouses/comments/65p55e/building_with_closed_cell_foam_and_laminate/", "num_reports": null, "locked": false, "stickied": false, "created": 1492378797.0, "url": "https://www.reddit.com/r/TinyHouses/comments/65p55e/building_with_closed_cell_foam_and_laminate/", "author_flair_text": null, "quarantine": false, "title": "Building with closed cell foam and Laminate?", "created_utc": 1492349997.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 35, "visited": false, "subreddit_type": "public", "ups": 44}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": "", "user_reports": [], "id": "dgdakqp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgd1xsk", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Thanks, I know the framing and shell of the house isn't even the big ticket item. But labour costs stack up real fast, roofs are expensive. And imho it's all overly complicated! Of course that is a stupid thing to say, but that is what it seems like. The lack of truly water and weatherproof and insulating materials is being offset by stacking more and more layers on top. Wood is still cheapest, but you need to protect it. You need to insulate but you have nooks and crannies. The demands on construction have risen and that costs more and more labour. Prices to professionally build a house are unattainable for most people.\n\nOf course this is sci-fi for now, but eventually all those jobs will be made obsolete and unemployed. All the knowledge will be put into the CAD software that designs and plans the construction and plumbing. You add a room and the program automatically suggests where to lay wire, outlets and how to add windows and roofs etc. by simulating virtual inhabitants. Robots will integrate plumbing, electrics and windows as well. There is almost no job I can't imagine automating with coming advances in robots and clever programming.\n\nEventually nobody is going to need to work anymore, money is going to be superfluous and we'll all live in our own homes, permanently studying at VR universities to become a more enlightened society. \n\nOh sorry, that got away from me haha. Yeah of course you still need to consult people who know the ins and out of construction. In my country you need an architect or an structural engineer to file a building permit for you and check your plans. But for tiny houses this seems a very sensible approach. Still need to do a calculation on how much the laminating with fiberglass and resin costs per square meter. Would be interesting to compare that to a shipping container.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, I know the framing and shell of the house isn&amp;#39;t even the big ticket item. But labour costs stack up real fast, roofs are expensive. And imho it&amp;#39;s all overly complicated! Of course that is a stupid thing to say, but that is what it seems like. The lack of truly water and weatherproof and insulating materials is being offset by stacking more and more layers on top. Wood is still cheapest, but you need to protect it. You need to insulate but you have nooks and crannies. The demands on construction have risen and that costs more and more labour. Prices to professionally build a house are unattainable for most people.&lt;/p&gt;\n\n&lt;p&gt;Of course this is sci-fi for now, but eventually all those jobs will be made obsolete and unemployed. All the knowledge will be put into the CAD software that designs and plans the construction and plumbing. You add a room and the program automatically suggests where to lay wire, outlets and how to add windows and roofs etc. by simulating virtual inhabitants. Robots will integrate plumbing, electrics and windows as well. There is almost no job I can&amp;#39;t imagine automating with coming advances in robots and clever programming.&lt;/p&gt;\n\n&lt;p&gt;Eventually nobody is going to need to work anymore, money is going to be superfluous and we&amp;#39;ll all live in our own homes, permanently studying at VR universities to become a more enlightened society. &lt;/p&gt;\n\n&lt;p&gt;Oh sorry, that got away from me haha. Yeah of course you still need to consult people who know the ins and out of construction. In my country you need an architect or an structural engineer to file a building permit for you and check your plans. But for tiny houses this seems a very sensible approach. Still need to do a calculation on how much the laminating with fiberglass and resin costs per square meter. Would be interesting to compare that to a shipping container.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgdakqp", "score_hidden": false, "stickied": false, "created": 1492448092.0, "created_utc": 1492419292.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd1xsk", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "DecayingVacuum", "parent_id": "t1_dgc5e20", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "A couple things come to mind. I think you're greatly overestimating the complexity involved in traditional stick framing. A few skilled framers and a couple laborers, can frame a 2000 sqft house in a few days. I've seen McMansions go from foundation to weather tight shell in less than a week. Which leads to my second observation. Good or bad, there is a huge base of knowledge when it comes to traditional stick framing. From various carpentry tradesmen, plumbers, electricians, HVAC, to the architects, engineers, and even government inspectors. If you completely change the building method, you still need those people. Sure if you're just talking about a DIY thing *you* can fill most or all of those rolls (inspections, if needed, might be tricky). But if you're talking about effectively starting a new industry, then you need those people, you need that knowledge/know-how.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A couple things come to mind. I think you&amp;#39;re greatly overestimating the complexity involved in traditional stick framing. A few skilled framers and a couple laborers, can frame a 2000 sqft house in a few days. I&amp;#39;ve seen McMansions go from foundation to weather tight shell in less than a week. Which leads to my second observation. Good or bad, there is a huge base of knowledge when it comes to traditional stick framing. From various carpentry tradesmen, plumbers, electricians, HVAC, to the architects, engineers, and even government inspectors. If you completely change the building method, you still need those people. Sure if you&amp;#39;re just talking about a DIY thing &lt;em&gt;you&lt;/em&gt; can fill most or all of those rolls (inspections, if needed, might be tricky). But if you&amp;#39;re talking about effectively starting a new industry, then you need those people, you need that knowledge/know-how.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgd1xsk", "score_hidden": false, "stickied": false, "created": 1492428946.0, "created_utc": 1492400146.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc5e20", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgc4rh1", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Ah thanks. I actually just that as well after looking for PUR panels! \n\nBut there is a relatively big difference - in that the panels are glued together using resin and form a continuous and bonded shell and hole. The strength compared to nailing them next to each other and especially water insulation is higher. You get an airtight home without having to layer tons of rafters and plastic sheeting. You safe all the \"superfluous\" layers like OSB and stuff. There is no wood that can get wet and rot through and needs to be protected from the rain.\n\nOf course if you want a nice outside and inside... well you could just add some seashells and leaves into the resin like resin casting :D Well maybe you could get creative with inserting nice cloth as the top layer before the gelcoat of the laminate. I don't know, maybe I'm weird but it seems there is a huge creative potential that requires only very simple skills compared to what usually goes into building a home. It's not much more complex than lego and paper hanging.\n\nInterestingly, pure PU insulation foam boards are incredibly expensive for what they are...\n\nAnd ultimately you'd want to automize the whole process, have a robot  that sprays fast setting foam like a 3D printer, mills the rough walls off and sprays resin and chopped fiberglass at the wall. Way easier to build than with concrete. I've even found a patent describing this idea exactly.\n\nSo I wonder why I can't find any example of this being done on the net. The same process is used for DIY building boats.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah thanks. I actually just that as well after looking for PUR panels! &lt;/p&gt;\n\n&lt;p&gt;But there is a relatively big difference - in that the panels are glued together using resin and form a continuous and bonded shell and hole. The strength compared to nailing them next to each other and especially water insulation is higher. You get an airtight home without having to layer tons of rafters and plastic sheeting. You safe all the &amp;quot;superfluous&amp;quot; layers like OSB and stuff. There is no wood that can get wet and rot through and needs to be protected from the rain.&lt;/p&gt;\n\n&lt;p&gt;Of course if you want a nice outside and inside... well you could just add some seashells and leaves into the resin like resin casting :D Well maybe you could get creative with inserting nice cloth as the top layer before the gelcoat of the laminate. I don&amp;#39;t know, maybe I&amp;#39;m weird but it seems there is a huge creative potential that requires only very simple skills compared to what usually goes into building a home. It&amp;#39;s not much more complex than lego and paper hanging.&lt;/p&gt;\n\n&lt;p&gt;Interestingly, pure PU insulation foam boards are incredibly expensive for what they are...&lt;/p&gt;\n\n&lt;p&gt;And ultimately you&amp;#39;d want to automize the whole process, have a robot  that sprays fast setting foam like a 3D printer, mills the rough walls off and sprays resin and chopped fiberglass at the wall. Way easier to build than with concrete. I&amp;#39;ve even found a patent describing this idea exactly.&lt;/p&gt;\n\n&lt;p&gt;So I wonder why I can&amp;#39;t find any example of this being done on the net. The same process is used for DIY building boats.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgc5e20", "score_hidden": false, "stickied": false, "created": 1492385306.0, "created_utc": 1492356506.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4rh1", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "carpespasm", "parent_id": "t3_65p55e", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "What you are thinking of is more or less Structural Insulated Panels. Normally called SIPs in construction. Basically an ice cream sandwich of OSB and foam, usually with the outward side coated so you don't need to do tyvek vapor barrier. They work well for high R value construction, but you've got to familiarize yourself with their use to avoid some problems that don't come up in normal stick-frame construction. They also come as sheathing panels without structure inside AFAIK.\n\nhttps://www.youtube.com/watch?v=liTV_iLkdl0\n\n\nEdit: to your question about problems with this type of construction, the biggest issues are that if you're using the sheathing product (for roof sheathing over rafters) then you have to be sure to shoot the extra-long screws  that go through the panel very straight so they hit stud, which is way easier on plain OSB than through 16\" of foam. Earlier houses made with it also suffer problems of bad construction when joints didn't meet up well and people just squirted great stuff in the cracks and later water penetration became an issue, properly sealing the joints can be a hassle if they don't meet up flush. Chasing leaks can be harder too since the foam gives leaks more room and time to \"run down\" through the foam before showing up soaked through the OSB. Understanding proper use of this stuff is key to it working well.", "edited": 1492356352.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What you are thinking of is more or less Structural Insulated Panels. Normally called SIPs in construction. Basically an ice cream sandwich of OSB and foam, usually with the outward side coated so you don&amp;#39;t need to do tyvek vapor barrier. They work well for high R value construction, but you&amp;#39;ve got to familiarize yourself with their use to avoid some problems that don&amp;#39;t come up in normal stick-frame construction. They also come as sheathing panels without structure inside AFAIK.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=liTV_iLkdl0\"&gt;https://www.youtube.com/watch?v=liTV_iLkdl0&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Edit: to your question about problems with this type of construction, the biggest issues are that if you&amp;#39;re using the sheathing product (for roof sheathing over rafters) then you have to be sure to shoot the extra-long screws  that go through the panel very straight so they hit stud, which is way easier on plain OSB than through 16&amp;quot; of foam. Earlier houses made with it also suffer problems of bad construction when joints didn&amp;#39;t meet up well and people just squirted great stuff in the cracks and later water penetration became an issue, properly sealing the joints can be a hassle if they don&amp;#39;t meet up flush. Chasing leaks can be harder too since the foam gives leaks more room and time to &amp;quot;run down&amp;quot; through the foam before showing up soaked through the OSB. Understanding proper use of this stuff is key to it working well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgc4rh1", "score_hidden": false, "stickied": false, "created": 1492384432.0, "created_utc": 1492355632.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": "", "user_reports": [], "id": "dgda40x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgcm5xo", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Thanks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgda40x", "score_hidden": false, "stickied": false, "created": 1492446490.0, "created_utc": 1492417690.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcm5xo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "graphictruth", "parent_id": "t1_dgc7fnm", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "It could certainly be a huge component of a tiny home build. Here's some [image galleries](https://insulationcorp.com/photo-gallery/) from a foam company to give some ideas.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It could certainly be a huge component of a tiny home build. Here&amp;#39;s some &lt;a href=\"https://insulationcorp.com/photo-gallery/\"&gt;image galleries&lt;/a&gt; from a foam company to give some ideas.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgcm5xo", "score_hidden": false, "stickied": false, "created": 1492407431.0, "created_utc": 1492378631.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7fnm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgc6lxr", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Thanks!\n\nOh and just to be clear, I actually didn't mean just insulating a container, but putting big 3 inch thing PU foam blocks / boards on the ground and gluing them together using epoxy. Then build your house up like that and laminate to give stability.\n\nYou could build cupboards, tables, benches and weirdly shaped furniture right into the structure of the house with these easy to cut foam blocks.\n\nThe spray foam could be used to add a few shapes or details, then cut / sand it down. Well right now it looks spray can foam is actually cheaper than insulation foam panels lol.\n\n&gt; It doesn't account for air movement, humidity, or (the factor you want to eliminate) thermal shorting. Your system should work if you get maximum resin coverage on the foam surface.\n\nFrom what I've seen, PU closed cell foam is basically water tight in boats. So even if your fiberglass boat surface breaks, the foam can still stop the water and won't rot. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks!&lt;/p&gt;\n\n&lt;p&gt;Oh and just to be clear, I actually didn&amp;#39;t mean just insulating a container, but putting big 3 inch thing PU foam blocks / boards on the ground and gluing them together using epoxy. Then build your house up like that and laminate to give stability.&lt;/p&gt;\n\n&lt;p&gt;You could build cupboards, tables, benches and weirdly shaped furniture right into the structure of the house with these easy to cut foam blocks.&lt;/p&gt;\n\n&lt;p&gt;The spray foam could be used to add a few shapes or details, then cut / sand it down. Well right now it looks spray can foam is actually cheaper than insulation foam panels lol.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It doesn&amp;#39;t account for air movement, humidity, or (the factor you want to eliminate) thermal shorting. Your system should work if you get maximum resin coverage on the foam surface.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;From what I&amp;#39;ve seen, PU closed cell foam is basically water tight in boats. So even if your fiberglass boat surface breaks, the foam can still stop the water and won&amp;#39;t rot. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgc7fnm", "score_hidden": false, "stickied": false, "created": 1492388085.0, "created_utc": 1492359285.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6lxr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "redletterawakening", "parent_id": "t3_65p55e", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "I have been applying puf for 15 years, it is a remarkable material. This material is ideal for a storage container or tiny home. A downside is that it is expensive. The industry runs on r-value code, which is extremely flawed. R-value is tested in a laboratory setting at a mean temp of 75 degrees f. It doesn't account for air movement, humidity, or (the factor you want to eliminate) thermal shorting. Your system should work if you get maximum resin coverage on the foam surface. \n\nFoam isn't a great fuel in and of itself, but it is a great insulator that keeps heat in. If there is fire to sustain it, it will be a very intense fire and fiberglass resin will also contribute. I built my tiny trailer into a haulmark cargo trailer and used spray foam and drywall on the walls. I have towed it about 3000 miles and nothing has fell off yet. I have a lot of shelving installed, though.\n\nSpray foam blowing agents are becoming less harmful for our atmosphere. Original formulations had a global warming payback period of about 80 years, meaning it would have to be in use for 80 years of energy efficient service to counterbalance the damage of freon blowing agents. Modern proprietary blowing agents are getting better. After 8 years of service modern cell foam it will pay itself back. The technology is always improving. I am a huge proponent of putting these oil based materials into solids like insulation, way better than burning it!\n\nSpray foam is difficult for a diy. It is an art to spray a liquid, that raises up 50 times it size, smooth. It can catch fire if applied too heavy in one pass, too. A foam board would work well if you had a solid air barrier to prevent condensation between the steel and foam board. The fear is that it'll rust your walls and allow for things to grow that aren't welcome. Spray foam is sprayed to the wall and can't allow for moisture to pass behind it. Foam board would need an adhesive or mechanical fasteners (thermal shorts). SPF is ideal for your application. It is still a professional's realm, though.\n\nI like your idea. An alternative to fiberglass might be fiberhemp. The natural fibers showing through a clear resin would look awesome! \n\nI wrote this all on my phone, sorry if this is written kinda hastily. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have been applying puf for 15 years, it is a remarkable material. This material is ideal for a storage container or tiny home. A downside is that it is expensive. The industry runs on r-value code, which is extremely flawed. R-value is tested in a laboratory setting at a mean temp of 75 degrees f. It doesn&amp;#39;t account for air movement, humidity, or (the factor you want to eliminate) thermal shorting. Your system should work if you get maximum resin coverage on the foam surface. &lt;/p&gt;\n\n&lt;p&gt;Foam isn&amp;#39;t a great fuel in and of itself, but it is a great insulator that keeps heat in. If there is fire to sustain it, it will be a very intense fire and fiberglass resin will also contribute. I built my tiny trailer into a haulmark cargo trailer and used spray foam and drywall on the walls. I have towed it about 3000 miles and nothing has fell off yet. I have a lot of shelving installed, though.&lt;/p&gt;\n\n&lt;p&gt;Spray foam blowing agents are becoming less harmful for our atmosphere. Original formulations had a global warming payback period of about 80 years, meaning it would have to be in use for 80 years of energy efficient service to counterbalance the damage of freon blowing agents. Modern proprietary blowing agents are getting better. After 8 years of service modern cell foam it will pay itself back. The technology is always improving. I am a huge proponent of putting these oil based materials into solids like insulation, way better than burning it!&lt;/p&gt;\n\n&lt;p&gt;Spray foam is difficult for a diy. It is an art to spray a liquid, that raises up 50 times it size, smooth. It can catch fire if applied too heavy in one pass, too. A foam board would work well if you had a solid air barrier to prevent condensation between the steel and foam board. The fear is that it&amp;#39;ll rust your walls and allow for things to grow that aren&amp;#39;t welcome. Spray foam is sprayed to the wall and can&amp;#39;t allow for moisture to pass behind it. Foam board would need an adhesive or mechanical fasteners (thermal shorts). SPF is ideal for your application. It is still a professional&amp;#39;s realm, though.&lt;/p&gt;\n\n&lt;p&gt;I like your idea. An alternative to fiberglass might be fiberhemp. The natural fibers showing through a clear resin would look awesome! &lt;/p&gt;\n\n&lt;p&gt;I wrote this all on my phone, sorry if this is written kinda hastily. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgc6lxr", "score_hidden": false, "stickied": false, "created": 1492386966.0, "created_utc": 1492358166.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": "", "user_reports": [], "id": "dgcvhas", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tonydiethelm", "parent_id": "t1_dgchteo", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "I don't see mine as a mobile home. It's pretty stationary. :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t see mine as a mobile home. It&amp;#39;s pretty stationary. :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgcvhas", "score_hidden": false, "stickied": false, "created": 1492420016.0, "created_utc": 1492391216.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchteo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgcg8z4", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Well lol true! I meant compared to boats where this construction technique is used most often. It's possible that vibrations will affect PIR differently than PUR. A house on wheels isn't going to experience stresses much different than a boat getting shaken around on waves.\n\nI didn't realize until today that tiny homes are mostly seen as mobile homes. Of course that's what I'm thinking as well.\n\nI would need a rather big car though to drive the tiny house I want to build (2.5m x 12m). Or I just rent a truck and a trailer if I want to move it...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well lol true! I meant compared to boats where this construction technique is used most often. It&amp;#39;s possible that vibrations will affect PIR differently than PUR. A house on wheels isn&amp;#39;t going to experience stresses much different than a boat getting shaken around on waves.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t realize until today that tiny homes are mostly seen as mobile homes. Of course that&amp;#39;s what I&amp;#39;m thinking as well.&lt;/p&gt;\n\n&lt;p&gt;I would need a rather big car though to drive the tiny house I want to build (2.5m x 12m). Or I just rent a truck and a trailer if I want to move it...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgchteo", "score_hidden": false, "stickied": false, "created": 1492401785.0, "created_utc": 1492372985.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcg8z4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tonydiethelm", "parent_id": "t1_dgcd1sk", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Is a Tiny House going down the freeway at 65MPH a static structure? You're basically in an earthquake and a hurricane at the same time. :/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is a Tiny House going down the freeway at 65MPH a static structure? You&amp;#39;re basically in an earthquake and a hurricane at the same time. :/&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgcg8z4", "score_hidden": false, "stickied": false, "created": 1492399745.0, "created_utc": 1492370945.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": "", "user_reports": [], "id": "dgdss9s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgdsg56", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Well racing boats are build this way - it should bear any vertical loads, it's simply a question of how much fiberglass (and resin) you use. Of course, how much vertical load do you need really in a bungalow / tiny house? I would argue almost none, or at least enough for 2-3 people to sit on the roof. Of course it might depend on how curved the walls and corners are - you will probably be better off with slightly curved walls and roof or at least rounded corners.\n\nI also added a bit to my previous comment about wood cladding.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well racing boats are build this way - it should bear any vertical loads, it&amp;#39;s simply a question of how much fiberglass (and resin) you use. Of course, how much vertical load do you need really in a bungalow / tiny house? I would argue almost none, or at least enough for 2-3 people to sit on the roof. Of course it might depend on how curved the walls and corners are - you will probably be better off with slightly curved walls and roof or at least rounded corners.&lt;/p&gt;\n\n&lt;p&gt;I also added a bit to my previous comment about wood cladding.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgdss9s", "score_hidden": false, "stickied": false, "created": 1492478890.0, "created_utc": 1492450090.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdsg56", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rcrracer", "parent_id": "t1_dgdrn4g", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "How strong will a thin shelled SIP be for vertical loads?  They would be fine in the horizontal plane.  How about the vertical plane?  Conventional SIPS have OSB to withstand vertical loads.\n\nIf there are any compressive loads near the surface, something like [these](https://www.amazon.com/Wideskall-Drilling-Drywall-Nylon-Anchors/dp/B01D40M9XS/ref=sr_1_2?m=A3NT3RNEWQU9ZI&amp;s=merchant-items&amp;ie=UTF8&amp;qid=1485100306&amp;sr=1-2&amp;keywords=self%2Bdrilling%2Bdrywall%2Banchors&amp;th=1) might help to distribute the load.  Thought about using these when making surfboards. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How strong will a thin shelled SIP be for vertical loads?  They would be fine in the horizontal plane.  How about the vertical plane?  Conventional SIPS have OSB to withstand vertical loads.&lt;/p&gt;\n\n&lt;p&gt;If there are any compressive loads near the surface, something like &lt;a href=\"https://www.amazon.com/Wideskall-Drilling-Drywall-Nylon-Anchors/dp/B01D40M9XS/ref=sr_1_2?m=A3NT3RNEWQU9ZI&amp;amp;s=merchant-items&amp;amp;ie=UTF8&amp;amp;qid=1485100306&amp;amp;sr=1-2&amp;amp;keywords=self%2Bdrilling%2Bdrywall%2Banchors&amp;amp;th=1\"&gt;these&lt;/a&gt; might help to distribute the load.  Thought about using these when making surfboards. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgdsg56", "score_hidden": false, "stickied": false, "created": 1492478513.0, "created_utc": 1492449713.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrn4g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgdihp4", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Ah thanks. Polyisocyanurate Foam (PIR) with enough density (&gt;72kg/m³) should work more than enough as a structural element (SIP) once you laminate it. My idea would be to specifically not use any framing, and gluing the foam panels next to each other using a 2k resin. My guess is this would have incredible stiffness, much more than framing.\n\nYou don't need any studs or framing and are free to improvise much more organic curves by simply cutting or rasping the foam into shapes.\n\nPIR is a close variant to polyurethane foam but has higher stiffness, less elasticity and high heat resistance. It should not melt like polystyrene does with polyester resin or other solvent based paints.\n\nAnd of course you don't need to use 3 inches (7.62 cm), 2 inches would do, depending on climate. But fully using foam will always be more insulating than using framing and foam in the games, so IF you want to insulate at all you don't really loose space either way.\n\nOf course if you want to use a wooden cladding, you best use SIPs.\n\nBut costs are really the question - calculating the costs of the foam, fiberglass / other maybe more natural fibers (hemp, linen cloth) and resin (polyester is cheapest but need respirator).\n\nPS: Or if you want to use wooden cladding AND organic shapes, you could probably just laminate one cloth to the outside and then glue really thin boards to the outside overlapping. Something like 1/10 inch (2.5 mm) thick boards could contour any curvilinear shapes you made because they bend easily and can overlap. No clue how well any of this works of course. Personally I would embrace a new style and laminate something like patchwork cloth to the outside and seal it with resin. Your tiny house could look like a travelling sack! :D", "edited": 1492449909.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah thanks. Polyisocyanurate Foam (PIR) with enough density (&amp;gt;72kg/m³) should work more than enough as a structural element (SIP) once you laminate it. My idea would be to specifically not use any framing, and gluing the foam panels next to each other using a 2k resin. My guess is this would have incredible stiffness, much more than framing.&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t need any studs or framing and are free to improvise much more organic curves by simply cutting or rasping the foam into shapes.&lt;/p&gt;\n\n&lt;p&gt;PIR is a close variant to polyurethane foam but has higher stiffness, less elasticity and high heat resistance. It should not melt like polystyrene does with polyester resin or other solvent based paints.&lt;/p&gt;\n\n&lt;p&gt;And of course you don&amp;#39;t need to use 3 inches (7.62 cm), 2 inches would do, depending on climate. But fully using foam will always be more insulating than using framing and foam in the games, so IF you want to insulate at all you don&amp;#39;t really loose space either way.&lt;/p&gt;\n\n&lt;p&gt;Of course if you want to use a wooden cladding, you best use SIPs.&lt;/p&gt;\n\n&lt;p&gt;But costs are really the question - calculating the costs of the foam, fiberglass / other maybe more natural fibers (hemp, linen cloth) and resin (polyester is cheapest but need respirator).&lt;/p&gt;\n\n&lt;p&gt;PS: Or if you want to use wooden cladding AND organic shapes, you could probably just laminate one cloth to the outside and then glue really thin boards to the outside overlapping. Something like 1/10 inch (2.5 mm) thick boards could contour any curvilinear shapes you made because they bend easily and can overlap. No clue how well any of this works of course. Personally I would embrace a new style and laminate something like patchwork cloth to the outside and seal it with resin. Your tiny house could look like a travelling sack! :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgdrn4g", "score_hidden": false, "stickied": false, "created": 1492477615.0, "created_utc": 1492448815.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdihp4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rcrracer", "parent_id": "t1_dgcd1sk", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "In the states, polyiso can be bought for cheap.  A Craigslist search north of the 32nd parallel will turn up numerous places selling used polyiso.  I built my house 28 years ago and used polyiso on the exterior with taped seams, with the conventional framed home. Using polyiso in the same way in a tiny home would add up with to much wall thickness.\n\nEdit:  If I was going to build something in the near future:  Used polyiso, 14 1/2\" wide, fiberglass both sides, varnish for resin(no idea if it will work and not melt polyiso). Studs 16\" on center.  Studs and plates made of [fiberglass square tubing](http://www.eplastics.com/fiberglass-frp-round-square-tubing) or maybe [vinyl downspouts](http://www.homedepot.com/p/Amerimax-Home-Products-2-in-x-3-in-White-Vinyl-Downspout-M0593/100095267), or any other square tubing, each filled with foam.  This would maintain insulation values and give standard attachment points.  For more compressive strength, 1/2\" plywood perpendicular strip between the other strips. Would look like a capital 'i' from above. Engineered joist looking. Slight reduction in R value due to thermal bridging.\n\nEdit:  Easier to do and cheaper than above edit: 2\" or &gt; thickness polyiso. glue 1/2\" polyiso on either side of 2\" or greater sheet.  Leave min. 1 1/2\" gap between each 1/2\" sheet.  Glue 1 1/2\" wide, 1/2\" thick plywood into gap created by not butting 1/2\" polyiso sheets together.  Plywood strips will be attachment points.   Plywood strips would be substitutes for studs and top and bottom plates.  Minimal reduction of insulation values.", "edited": 1492447681.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the states, polyiso can be bought for cheap.  A Craigslist search north of the 32nd parallel will turn up numerous places selling used polyiso.  I built my house 28 years ago and used polyiso on the exterior with taped seams, with the conventional framed home. Using polyiso in the same way in a tiny home would add up with to much wall thickness.&lt;/p&gt;\n\n&lt;p&gt;Edit:  If I was going to build something in the near future:  Used polyiso, 14 1/2&amp;quot; wide, fiberglass both sides, varnish for resin(no idea if it will work and not melt polyiso). Studs 16&amp;quot; on center.  Studs and plates made of &lt;a href=\"http://www.eplastics.com/fiberglass-frp-round-square-tubing\"&gt;fiberglass square tubing&lt;/a&gt; or maybe &lt;a href=\"http://www.homedepot.com/p/Amerimax-Home-Products-2-in-x-3-in-White-Vinyl-Downspout-M0593/100095267\"&gt;vinyl downspouts&lt;/a&gt;, or any other square tubing, each filled with foam.  This would maintain insulation values and give standard attachment points.  For more compressive strength, 1/2&amp;quot; plywood perpendicular strip between the other strips. Would look like a capital &amp;#39;i&amp;#39; from above. Engineered joist looking. Slight reduction in R value due to thermal bridging.&lt;/p&gt;\n\n&lt;p&gt;Edit:  Easier to do and cheaper than above edit: 2&amp;quot; or &amp;gt; thickness polyiso. glue 1/2&amp;quot; polyiso on either side of 2&amp;quot; or greater sheet.  Leave min. 1 1/2&amp;quot; gap between each 1/2&amp;quot; sheet.  Glue 1 1/2&amp;quot; wide, 1/2&amp;quot; thick plywood into gap created by not butting 1/2&amp;quot; polyiso sheets together.  Plywood strips will be attachment points.   Plywood strips would be substitutes for studs and top and bottom plates.  Minimal reduction of insulation values.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgdihp4", "score_hidden": false, "stickied": false, "created": 1492466673.0, "created_utc": 1492437873.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcd1sk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgca71e", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "I'm still trying to find something affordable. Even the A and B mixtures are more expensive than spray can foam per resulting volume :/ It's nuts!\n\nI've read Polyisocyanurate Foam (PIR) is apparently advancement of Polyurethane (PUR) and is even stiffer. Should be great for building static structures.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m still trying to find something affordable. Even the A and B mixtures are more expensive than spray can foam per resulting volume :/ It&amp;#39;s nuts!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve read Polyisocyanurate Foam (PIR) is apparently advancement of Polyurethane (PUR) and is even stiffer. Should be great for building static structures.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgcd1sk", "score_hidden": false, "stickied": false, "created": 1492395469.0, "created_utc": 1492366669.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgca71e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rcrracer", "parent_id": "t3_65p55e", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Polyiso is a closed cell foam that comes in sheets.  Surfboards are made using foam with a fiberglass shell.  To keep the weight low, catamarans are built using this type of sandwich construction.\n\nEdit:  Pleasure boats, glider airplanes, Boeing 787 airplane, etc.", "edited": 1492363396.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Polyiso is a closed cell foam that comes in sheets.  Surfboards are made using foam with a fiberglass shell.  To keep the weight low, catamarans are built using this type of sandwich construction.&lt;/p&gt;\n\n&lt;p&gt;Edit:  Pleasure boats, glider airplanes, Boeing 787 airplane, etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgca71e", "score_hidden": false, "stickied": false, "created": 1492391700.0, "created_utc": 1492362900.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": "", "user_reports": [], "id": "dgcqli8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "runvnc", "parent_id": "t1_dgcdsmx", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Not my blog, I just googled 'SIPs tiny house', there are multiple sites.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not my blog, I just googled &amp;#39;SIPs tiny house&amp;#39;, there are multiple sites.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgcqli8", "score_hidden": false, "stickied": false, "created": 1492413440.0, "created_utc": 1492384640.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdsmx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgccfeh", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Hmm... well if you can practically weld them together airtight using epoxy then it's a really fast way to build. And much better of course if you want a traditional look on the walls out of the box. But you are more limited to straight angles and measuring exactly.\n\nYeah ventilation with an airtight house lol... thanks for mentioning HRV/ERV! That makes total sense for a passive house of course, to try to exchange the heat from the cycled air of the house. I've had some ideas for a container house to have both inlets and outlets on the interior and exterior to regulate heat, but this is even more important if you really want to save on energy. Probably something like a heat exchanger would help already!\n\nPS: I guess this is a slight drawback of this foam core for tiny houses then. It only makes sense if you're airtight, and if you want to be airtight you need more \"fancy\" technology like dehumidifiers or HRV/ERVs. Which probably doesn't fit the philosophy of most tiny homers. Or maybe it does? :)\n\nPPS: Is that your blog?", "edited": 1492368588.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmm... well if you can practically weld them together airtight using epoxy then it&amp;#39;s a really fast way to build. And much better of course if you want a traditional look on the walls out of the box. But you are more limited to straight angles and measuring exactly.&lt;/p&gt;\n\n&lt;p&gt;Yeah ventilation with an airtight house lol... thanks for mentioning HRV/ERV! That makes total sense for a passive house of course, to try to exchange the heat from the cycled air of the house. I&amp;#39;ve had some ideas for a container house to have both inlets and outlets on the interior and exterior to regulate heat, but this is even more important if you really want to save on energy. Probably something like a heat exchanger would help already!&lt;/p&gt;\n\n&lt;p&gt;PS: I guess this is a slight drawback of this foam core for tiny houses then. It only makes sense if you&amp;#39;re airtight, and if you want to be airtight you need more &amp;quot;fancy&amp;quot; technology like dehumidifiers or HRV/ERVs. Which probably doesn&amp;#39;t fit the philosophy of most tiny homers. Or maybe it does? :)&lt;/p&gt;\n\n&lt;p&gt;PPS: Is that your blog?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgcdsmx", "score_hidden": false, "stickied": false, "created": 1492396475.0, "created_utc": 1492367675.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgccfeh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "runvnc", "parent_id": "t3_65p55e", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "I think you are on the right track.  Just to add to what carpespam said, it sounds like SIPs and that might be more practical than just laminate on the outside of foam.\n\nIf I ever build a home my current plan is definitely to use SIPs with airtight construction if I can.  The thing you need to know about that though is that if you have that much insulation, you really do want to be airtight otherwise you are kind of wasting it.  And if you are really airtight, you have to have mechanical ventilation.  Ideally HRV/ERV.\n\nhttp://tinysiphouse.blogspot.com/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you are on the right track.  Just to add to what carpespam said, it sounds like SIPs and that might be more practical than just laminate on the outside of foam.&lt;/p&gt;\n\n&lt;p&gt;If I ever build a home my current plan is definitely to use SIPs with airtight construction if I can.  The thing you need to know about that though is that if you have that much insulation, you really do want to be airtight otherwise you are kind of wasting it.  And if you are really airtight, you have to have mechanical ventilation.  Ideally HRV/ERV.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://tinysiphouse.blogspot.com/\"&gt;http://tinysiphouse.blogspot.com/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgccfeh", "score_hidden": false, "stickied": false, "created": 1492394638.0, "created_utc": 1492365838.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": "", "user_reports": [], "id": "dgda1hg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgco9k1", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Oh wow, thanks! You win the thread and the internet, this is officially the worst website and most 1990' videos ever :D But I love the modular concept.\n\nThey used higher density polystyrene and didn't even fiberglass it, just painted or plastered. It definitely proves the concept for \n\nAlthough I know that polystyrene can't be painted or laminated with any polyester resin or paint, it will dissolve the polystyrene. So you can only fiberglass it with more expensive epoxy.\n\nBut polystyrene would certainly work (although it has a little less insulation and stability than Polyurethane I think).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh wow, thanks! You win the thread and the internet, this is officially the worst website and most 1990&amp;#39; videos ever :D But I love the modular concept.&lt;/p&gt;\n\n&lt;p&gt;They used higher density polystyrene and didn&amp;#39;t even fiberglass it, just painted or plastered. It definitely proves the concept for &lt;/p&gt;\n\n&lt;p&gt;Although I know that polystyrene can&amp;#39;t be painted or laminated with any polyester resin or paint, it will dissolve the polystyrene. So you can only fiberglass it with more expensive epoxy.&lt;/p&gt;\n\n&lt;p&gt;But polystyrene would certainly work (although it has a little less insulation and stability than Polyurethane I think).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgda1hg", "score_hidden": false, "stickied": false, "created": 1492446252.0, "created_utc": 1492417452.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgco9k1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "graphictruth", "parent_id": "t3_65p55e", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "I found an example of EPS foam construction of the sort you are speaking of - Foam with a spray coating. \n\nhttp://www.i-domehouse.com/index.html\n\nIt doesn't seem unreasonable to apply this to a tiny home on wheels, either.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I found an example of EPS foam construction of the sort you are speaking of - Foam with a spray coating. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.i-domehouse.com/index.html\"&gt;http://www.i-domehouse.com/index.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t seem unreasonable to apply this to a tiny home on wheels, either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgco9k1", "score_hidden": false, "stickied": false, "created": 1492410209.0, "created_utc": 1492381409.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": "", "user_reports": [], "id": "dgc6h38", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgc54ge", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Yeah I haven't found anything cheap yet. But the foam itself you need anyway to insulate so it's kind of cost neutral to build that way.\n\nI'm sure there are problems with this idea. But I've found no examples or stories about it so far. Just small architectural models build out of foam core (ironically haha). This *can't* be a new idea!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I haven&amp;#39;t found anything cheap yet. But the foam itself you need anyway to insulate so it&amp;#39;s kind of cost neutral to build that way.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure there are problems with this idea. But I&amp;#39;ve found no examples or stories about it so far. Just small architectural models build out of foam core (ironically haha). This &lt;em&gt;can&amp;#39;t&lt;/em&gt; be a new idea!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgc6h38", "score_hidden": false, "stickied": false, "created": 1492386786.0, "created_utc": 1492357986.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc54ge", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "building_community", "parent_id": "t1_dgc30zr", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Oh, gotcha. That makes sense then. In which case, I'm also unsure why nobody uses it. Makes a ton of sense I agree. Though maybe the cost is a reason. I \"think\" foam board is a bit more expensive that fiberglass and everyone is on a budget, usually unrealistically tight in the tiny arena.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, gotcha. That makes sense then. In which case, I&amp;#39;m also unsure why nobody uses it. Makes a ton of sense I agree. Though maybe the cost is a reason. I &amp;quot;think&amp;quot; foam board is a bit more expensive that fiberglass and everyone is on a budget, usually unrealistically tight in the tiny arena.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgc54ge", "score_hidden": false, "stickied": false, "created": 1492384936.0, "created_utc": 1492356136.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc30zr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgc20ip", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Well true, but I would think all tiny houses fall more or less into that category of often not fitting into conventional residential areas.\n\nWhat system you mean though? You mean a spray foam system? I was thinking of using PU / PUR foam insulation board and carving and gluing those together then laminating. Should be very DIYable?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well true, but I would think all tiny houses fall more or less into that category of often not fitting into conventional residential areas.&lt;/p&gt;\n\n&lt;p&gt;What system you mean though? You mean a spray foam system? I was thinking of using PU / PUR foam insulation board and carving and gluing those together then laminating. Should be very DIYable?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgc30zr", "score_hidden": false, "stickied": false, "created": 1492381808.0, "created_utc": 1492353008.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc20ip", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "building_community", "parent_id": "t3_65p55e", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Expensive is all I can figure. Also don't see it much in the conventional, residential construction arena. Lastly, I haven't seen any systems that allow you to DIY, so that would be a big hurdle for a lot of people who would be inclined to post such content.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Expensive is all I can figure. Also don&amp;#39;t see it much in the conventional, residential construction arena. Lastly, I haven&amp;#39;t seen any systems that allow you to DIY, so that would be a big hurdle for a lot of people who would be inclined to post such content.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgc20ip", "score_hidden": false, "stickied": false, "created": 1492380179.0, "created_utc": 1492351379.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": "", "user_reports": [], "id": "dgcavf7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BenTutton", "parent_id": "t1_dgc790q", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "How about using a refrigerated cargo van? That's already insulated! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How about using a refrigerated cargo van? That&amp;#39;s already insulated! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgcavf7", "score_hidden": false, "stickied": false, "created": 1492392593.0, "created_utc": 1492363793.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": "", "user_reports": [], "id": "dgccxjt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgc790q", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Well it depends I guess. If you already have a good waterproof shell it makes sense to use it. And with a van you could drive to a place where they spray foam, should give you a big discount.\n\nBut it should give access to playing around with architectural shapes and forms really easily.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well it depends I guess. If you already have a good waterproof shell it makes sense to use it. And with a van you could drive to a place where they spray foam, should give you a big discount.&lt;/p&gt;\n\n&lt;p&gt;But it should give access to playing around with architectural shapes and forms really easily.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgccxjt", "score_hidden": false, "stickied": false, "created": 1492395314.0, "created_utc": 1492366514.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc790q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "torokunai", "parent_id": "t3_65p55e", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "I'm interested in converting a cargo van but ISTM starting with a cutaway or cab-only and fabricating the house myself (instead of trying to insulate the cargo area) is a more cost-effective and straightforward enterprise.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m interested in converting a cargo van but ISTM starting with a cutaway or cab-only and fabricating the house myself (instead of trying to insulate the cargo area) is a more cost-effective and straightforward enterprise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgc790q", "score_hidden": false, "stickied": false, "created": 1492387840.0, "created_utc": 1492359040.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": "", "user_reports": [], "id": "dge2762", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgduwzp", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Well there is CO2 in the closed cell foam which transmits heat much slower than air - so it simply can't comparable due to physics. From what I've seen denim has R8 for 2\" and closed cell would have R13. \n\nWhich isn't bad but denim still isn't airtight and non conforming to frames etc so it reality it would be much lower than spray foam or walls entirely made of insulation panel. Well if you'd pour loose insulation material into frames just before closing up the top it would conform.\n\nIn general I agree that we should find better insulation foams that are not based on oil. Like the cornstarch / packing peanut stuff. But that is not airtight / water tight. I think we are going to have to genetically engineer organisms to either produce chemicals or plants that grow in rectangular forms that produce cells that have great insulation and structural properties.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well there is CO2 in the closed cell foam which transmits heat much slower than air - so it simply can&amp;#39;t comparable due to physics. From what I&amp;#39;ve seen denim has R8 for 2&amp;quot; and closed cell would have R13. &lt;/p&gt;\n\n&lt;p&gt;Which isn&amp;#39;t bad but denim still isn&amp;#39;t airtight and non conforming to frames etc so it reality it would be much lower than spray foam or walls entirely made of insulation panel. Well if you&amp;#39;d pour loose insulation material into frames just before closing up the top it would conform.&lt;/p&gt;\n\n&lt;p&gt;In general I agree that we should find better insulation foams that are not based on oil. Like the cornstarch / packing peanut stuff. But that is not airtight / water tight. I think we are going to have to genetically engineer organisms to either produce chemicals or plants that grow in rectangular forms that produce cells that have great insulation and structural properties.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dge2762", "score_hidden": false, "stickied": false, "created": 1492489447.0, "created_utc": 1492460647.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgduwzp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheShadyTrader", "parent_id": "t1_dgd9mzt", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Well denim can actually have a higher R value than closed cell foam. Closed cell foam is 6.5 per inch. Whereas denim can go up to R-30. Very large difference.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well denim can actually have a higher R value than closed cell foam. Closed cell foam is 6.5 per inch. Whereas denim can go up to R-30. Very large difference.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgduwzp", "score_hidden": false, "stickied": false, "created": 1492481230.0, "created_utc": 1492452430.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd9mzt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgcu91g", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "True, but I'm proposing to reduce the number of materials you'll use during building. Especially with recycled old building materials you never know. And fiberglass and resin doesn't emit any compounds. Neither does the foam after it has cured, if it wasn't sealed anyways.\n\nYou'll still need flooring of course.\n\nAnd denim and wool not sure if that is ecologically sensible, you want to save wasting energy on heating, so you want it airtight.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;True, but I&amp;#39;m proposing to reduce the number of materials you&amp;#39;ll use during building. Especially with recycled old building materials you never know. And fiberglass and resin doesn&amp;#39;t emit any compounds. Neither does the foam after it has cured, if it wasn&amp;#39;t sealed anyways.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll still need flooring of course.&lt;/p&gt;\n\n&lt;p&gt;And denim and wool not sure if that is ecologically sensible, you want to save wasting energy on heating, so you want it airtight.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgd9mzt", "score_hidden": false, "stickied": false, "created": 1492444921.0, "created_utc": 1492416121.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcu91g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheShadyTrader", "parent_id": "t3_65p55e", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Hey I work in Construction and have good experience with tiny houses and the first thing that comes to my mind are VOC's.\n\nhttps://www.epa.gov/indoor-air-quality-iaq/volatile-organic-compounds-impact-indoor-air-quality\n\nBasically with such a tight, well sealed area, you are going to want to use low or no VOC materials. This is why many tiny house owners tend to lean towards a denim or wool insulation with regular wood and a low-no VOC stain or paint. Also, vinyl flooring is high in VOCs. Its bad for you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey I work in Construction and have good experience with tiny houses and the first thing that comes to my mind are VOC&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.epa.gov/indoor-air-quality-iaq/volatile-organic-compounds-impact-indoor-air-quality\"&gt;https://www.epa.gov/indoor-air-quality-iaq/volatile-organic-compounds-impact-indoor-air-quality&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Basically with such a tight, well sealed area, you are going to want to use low or no VOC materials. This is why many tiny house owners tend to lean towards a denim or wool insulation with regular wood and a low-no VOC stain or paint. Also, vinyl flooring is high in VOCs. Its bad for you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgcu91g", "score_hidden": false, "stickied": false, "created": 1492418392.0, "created_utc": 1492389592.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rab5", "removal_reason": null, "link_id": "t3_65p55e", "likes": null, "replies": "", "user_reports": [], "id": "dgd9okj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FarkMcBark", "parent_id": "t1_dgcvrz8", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "Ah too bad :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah too bad :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgd9okj", "score_hidden": false, "stickied": false, "created": 1492445064.0, "created_utc": 1492416264.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcvrz8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sunflowerfly", "parent_id": "t3_65p55e", "subreddit_name_prefixed": "r/TinyHouses", "controversiality": 0, "body": "I have seen a buildlog someplace of someone that did this. Sorry, no idea where, or how it stood up to use. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have seen a buildlog someplace of someone that did this. Sorry, no idea where, or how it stood up to use. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TinyHouses", "name": "t1_dgcvrz8", "score_hidden": false, "stickied": false, "created": 1492420401.0, "created_utc": 1492391601.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]