[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64p3fm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 74, "report_reasons": null, "author": "FactualNeutronStar", "saved": false, "mod_reports": [], "name": "t3_64p3fm", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/64p3fm/when_did_suicide_bombing_start_becoming/", "num_reports": null, "locked": false, "stickied": false, "created": 1491919220.0, "url": "https://www.reddit.com/r/AskHistorians/comments/64p3fm/when_did_suicide_bombing_start_becoming/", "author_flair_text": null, "quarantine": false, "title": "When did suicide bombing start becoming widespread in the Muslim/Arab world? Other than the Japanese in WWII, were there other groups of people that have used this tactic? Which groups used them most effectively?", "created_utc": 1491890420.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 74}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64p3fm", "likes": null, "replies": "", "user_reports": [], "id": "dg3zggh", "gilded": 0, "archived": false, "score": 59, "report_reasons": null, "author": "Holokyn-kolokyn", "parent_id": "t3_64p3fm", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Suicide attacks have been resorted to sporadically probably for millennia. Suicide *bombings* have been around almost immediately after reliable explosives became available, in form of dynamite, in around 1860s. \n\nThe first terrorist organizations (in a more modern meaning of the word) to use and advocate for suicide bombings were Russian anarchists and nihilists. Previously, they had been performing attacks where the perpetrator didn't have a chance to escape, and would either kill himself, be killed by the guards, or be captured and sentenced to death; the first time they actually used suicide bombing (where the attacker actually blows himself up) was in 1904.\n\nSuicide bombings have been used in many other contexts as well. The Chinese had suicide squads during the revolutionary era and Japanese occupation, and they were often armed with explosives. \n\nThe main source here is Michael Burleigh's *Blood and Rage: A Cultural History of Terrorism.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Suicide attacks have been resorted to sporadically probably for millennia. Suicide &lt;em&gt;bombings&lt;/em&gt; have been around almost immediately after reliable explosives became available, in form of dynamite, in around 1860s. &lt;/p&gt;\n\n&lt;p&gt;The first terrorist organizations (in a more modern meaning of the word) to use and advocate for suicide bombings were Russian anarchists and nihilists. Previously, they had been performing attacks where the perpetrator didn&amp;#39;t have a chance to escape, and would either kill himself, be killed by the guards, or be captured and sentenced to death; the first time they actually used suicide bombing (where the attacker actually blows himself up) was in 1904.&lt;/p&gt;\n\n&lt;p&gt;Suicide bombings have been used in many other contexts as well. The Chinese had suicide squads during the revolutionary era and Japanese occupation, and they were often armed with explosives. &lt;/p&gt;\n\n&lt;p&gt;The main source here is Michael Burleigh&amp;#39;s &lt;em&gt;Blood and Rage: A Cultural History of Terrorism.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg3zggh", "score_hidden": false, "stickied": false, "created": 1491923538.0, "created_utc": 1491894738.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 59}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64p3fm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64p3fm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64p3fm", "likes": null, "replies": "", "user_reports": [], "id": "dg4frdd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Xtacles", "parent_id": "t1_dg4dl14", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "I'm sorry, I don't have an answer for you. All of my classes touching on this subject have been in Middle East history, with the Tamil Tigers mentioned in passing and usually along the lines of \"Hezbollah pioneered suicide bombing in modern terrorism, but the Tamil Tigers far outpaced them in terms of sheer number of attacks\". Beyond that, I know next to nothing about them. I can tell you the first recorded suicide attack from the LTTE was July 12, 1990, predating Hamas by almost four years (April 6, 1994). I got these dates from the Pape article's appendix, cited above. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry, I don&amp;#39;t have an answer for you. All of my classes touching on this subject have been in Middle East history, with the Tamil Tigers mentioned in passing and usually along the lines of &amp;quot;Hezbollah pioneered suicide bombing in modern terrorism, but the Tamil Tigers far outpaced them in terms of sheer number of attacks&amp;quot;. Beyond that, I know next to nothing about them. I can tell you the first recorded suicide attack from the LTTE was July 12, 1990, predating Hamas by almost four years (April 6, 1994). I got these dates from the Pape article&amp;#39;s appendix, cited above. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg4frdd", "score_hidden": false, "stickied": false, "created": 1491954376.0, "created_utc": 1491925576.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4dl14", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "czarnick123", "parent_id": "t1_dg4b4bo", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "I believe I've read that the Tamil Tigers may have sent experts to help fledgling terrorist groups (and may have helped train the bombers of the USS Cole but thats within our 20 year rule). Is there any truth to this? Did their use of suicide bombers predate Hamas' use? Were they influential on Hamas or any other groups in the '90s?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe I&amp;#39;ve read that the Tamil Tigers may have sent experts to help fledgling terrorist groups (and may have helped train the bombers of the USS Cole but thats within our 20 year rule). Is there any truth to this? Did their use of suicide bombers predate Hamas&amp;#39; use? Were they influential on Hamas or any other groups in the &amp;#39;90s?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg4dl14", "score_hidden": false, "stickied": false, "created": 1491951948.0, "created_utc": 1491923148.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64p3fm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64p3fm", "likes": null, "replies": "", "user_reports": [], "id": "dg4ppfg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Xtacles", "parent_id": "t1_dg4j062", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Absolutely, though I would certainly welcome more input from one of the Middle East historians here. \n\nI included the phrase \"martyrdom missions\" to allude to this, but to begin with, Shi'ism has a tradition and veneration of martyrdom similar to Christianity and Judaism. This is distinct from Sunni Islam, which from the time of its inception has been the dominant interpretation of the dominant religion (Islam) of the region. This tradition goes back to the martyrdom of Husayn ibn-Ali, the grandson of the Prophet Mohammed himself. Husayn was killed in battle after contesting the legitimacy of the Ummayad Caliph, Yazid. Thereafter, Husayn has been held as the archetypal martyr in Shi'ism. For the next millennium, more Shia practitioners would also be martyred by Sunni rulers, leading to martyrs holding a special place in Shi'ism that is generally absent in Sunni tradition.\n\nThat's a huge simplification of a massive issue. Flash forward to the Islamic Revolution in Iran (a Shia movement). During the Iran-Iraq War, Ayatollah Khomeini (the leader of Iran) drew upon this history of martyrdom to proclaim those who died fighting the Iraqis would be martyrs, guaranteed a place in heaven. Some are buried in \"Martyrs Cemetery\" in Tehran. This inspired human wave attacks against the Iraqi army and its minefields. Nasr asserts these particularly grim and extreme circumstances bred a \"cult of martyrdom\". It is from this experience and interpretation that Hezbollah justified its suicide bombings.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Absolutely, though I would certainly welcome more input from one of the Middle East historians here. &lt;/p&gt;\n\n&lt;p&gt;I included the phrase &amp;quot;martyrdom missions&amp;quot; to allude to this, but to begin with, Shi&amp;#39;ism has a tradition and veneration of martyrdom similar to Christianity and Judaism. This is distinct from Sunni Islam, which from the time of its inception has been the dominant interpretation of the dominant religion (Islam) of the region. This tradition goes back to the martyrdom of Husayn ibn-Ali, the grandson of the Prophet Mohammed himself. Husayn was killed in battle after contesting the legitimacy of the Ummayad Caliph, Yazid. Thereafter, Husayn has been held as the archetypal martyr in Shi&amp;#39;ism. For the next millennium, more Shia practitioners would also be martyred by Sunni rulers, leading to martyrs holding a special place in Shi&amp;#39;ism that is generally absent in Sunni tradition.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s a huge simplification of a massive issue. Flash forward to the Islamic Revolution in Iran (a Shia movement). During the Iran-Iraq War, Ayatollah Khomeini (the leader of Iran) drew upon this history of martyrdom to proclaim those who died fighting the Iraqis would be martyrs, guaranteed a place in heaven. Some are buried in &amp;quot;Martyrs Cemetery&amp;quot; in Tehran. This inspired human wave attacks against the Iraqi army and its minefields. Nasr asserts these particularly grim and extreme circumstances bred a &amp;quot;cult of martyrdom&amp;quot;. It is from this experience and interpretation that Hezbollah justified its suicide bombings.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg4ppfg", "score_hidden": false, "stickied": false, "created": 1491965255.0, "created_utc": 1491936455.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4j062", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Holokyn-kolokyn", "parent_id": "t1_dg4b4bo", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Burleigh notes in passing that in the early 1980s, most non-Shia islamic scholars saw suicide as a sin and suicide attacks as definitely *unislamic.* He doesn't develop this further, but if you or someone have more info, I'd appreciate it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Burleigh notes in passing that in the early 1980s, most non-Shia islamic scholars saw suicide as a sin and suicide attacks as definitely &lt;em&gt;unislamic.&lt;/em&gt; He doesn&amp;#39;t develop this further, but if you or someone have more info, I&amp;#39;d appreciate it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg4j062", "score_hidden": false, "stickied": false, "created": 1491957934.0, "created_utc": 1491929134.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4b4bo", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "Xtacles", "parent_id": "t3_64p3fm", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Suicide bombings in the Middle East became common in the 1980s. For a decade, they were carried out by Hezbollah, a militant Shia Islamist organization and political party based in Lebanon. In his article \"The Strategic Logic of Suicide Terrorism,\" Robert Pape catalogs suicide terrorism campaigns from 1980 to 2001. Hezbollah is the only terrorist organization using them in the Middle East until 1994, when Hamas and Islamic Jihad start using suicide bombers in their attacks. Notice I said Middle East--the LTTE (\"Tamil Tigers\") made extensive use of suicide bombings in their attacks against the Sri Lankan government.\n\nAs to why Hezbollah was the first, Vali Nasr posits \"willingness to die for the cause has until fairly recently [written in 2007] been seen as a predominantly Shia phenomenon, tied to the myths of Karbala and the Twelfth Imam.\" Hezbollah was and still is tied closely to Iran, and these \"martydom missions\" as they were called \"gave Iran's revolutionary Islamic regime an edge in pursuing its domestic and international goals.\" \n\nSources:\n\nRobert A. Pape, \"The Strategic Logic of Suicide Terrorism,\" American Political Science Review, Vol. 97, No. 3 (Aug. 2003).\n\nVali Nasr, \"The Shia Revival,\" pp. 57, 133, 142 (W.W. Norton &amp; Co., 2007).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Suicide bombings in the Middle East became common in the 1980s. For a decade, they were carried out by Hezbollah, a militant Shia Islamist organization and political party based in Lebanon. In his article &amp;quot;The Strategic Logic of Suicide Terrorism,&amp;quot; Robert Pape catalogs suicide terrorism campaigns from 1980 to 2001. Hezbollah is the only terrorist organization using them in the Middle East until 1994, when Hamas and Islamic Jihad start using suicide bombers in their attacks. Notice I said Middle East--the LTTE (&amp;quot;Tamil Tigers&amp;quot;) made extensive use of suicide bombings in their attacks against the Sri Lankan government.&lt;/p&gt;\n\n&lt;p&gt;As to why Hezbollah was the first, Vali Nasr posits &amp;quot;willingness to die for the cause has until fairly recently [written in 2007] been seen as a predominantly Shia phenomenon, tied to the myths of Karbala and the Twelfth Imam.&amp;quot; Hezbollah was and still is tied closely to Iran, and these &amp;quot;martydom missions&amp;quot; as they were called &amp;quot;gave Iran&amp;#39;s revolutionary Islamic regime an edge in pursuing its domestic and international goals.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Sources:&lt;/p&gt;\n\n&lt;p&gt;Robert A. Pape, &amp;quot;The Strategic Logic of Suicide Terrorism,&amp;quot; American Political Science Review, Vol. 97, No. 3 (Aug. 2003).&lt;/p&gt;\n\n&lt;p&gt;Vali Nasr, &amp;quot;The Shia Revival,&amp;quot; pp. 57, 133, 142 (W.W. Norton &amp;amp; Co., 2007).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg4b4bo", "score_hidden": false, "stickied": false, "created": 1491949054.0, "created_utc": 1491920254.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}]