[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;He called it &amp;quot;the whole Austrian scandal&amp;quot; and threatened the Austrians with &amp;quot;sending Hitler&amp;#39;s remains home to Austria&amp;quot;. Why?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "He called it \"the whole Austrian scandal\" and threatened the Austrians with \"sending Hitler's remains home to Austria\". Why?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64qfg7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 105, "report_reasons": null, "author": "Rakpas", "saved": false, "mod_reports": [], "name": "t3_64qfg7", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/64qfg7/why_was_adenauer_upset_with_the_independence_of/", "num_reports": null, "locked": false, "stickied": false, "created": 1491941511.0, "url": "https://www.reddit.com/r/AskHistorians/comments/64qfg7/why_was_adenauer_upset_with_the_independence_of/", "author_flair_text": null, "quarantine": false, "title": "Why was Adenauer upset with the independence of Austria?", "created_utc": 1491912711.0, "distinguished": null, "media": null, "upvote_ratio": 0.98, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 105}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64qfg7", "likes": null, "replies": "", "user_reports": [], "id": "dg4k9k5", "gilded": 0, "archived": false, "score": 53, "report_reasons": null, "author": "kieslowskifan", "parent_id": "t3_64qfg7", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Adenauer's rather public snit over the Austrian State Treaty came as a surprise to the Anglo-American foreign policy establishment. Both in public and in private, the German chancellor cast aspersions on the Treaty and its ramifications for Central Europe. Such invective included the famous line that if Austria demanded reparations, German would send them Hitler's ashes- if they could be found- in an urn. In hindsight, such surprise at Adeanuer's actions was unwarranted. The State Treaty touched on a number of hot-button issues within FRG politics as well as undercut  Adenauer's own strategy for restoring the FRG's position within Western Europe.\n\nAlthough the Austrian State Treaty was the most successful diplomatic *demarche* of Soviet diplomacy in the post-Stalin period, its success has overshadowed other initiatives sent out after 1953. Soviet diplomats zeroed in on settling the German issue as one of the central planks of a post-Stalin diplomatic order. The initial Soviet feelers on ending the Austrian occupation actually predicated that settlement the German question was a precondition for an Austrian treaty. When Adenauer visited the US in April 1953, that Soviet feelers were aiming at \"German reunification, a State Treaty for Austria, and a peace settlement in Korea and Indochina.\" For his part, Adenauer was skeptical of Soviet intentions and good faith and he told his American hosts that the Soviet feelers were an attempt to torpedo the negotiations for the European Defense Community (EDC) and hamstring the FRG's return to full sovereignty. \n\nAdenauer's skepticism was in line with his earlier experience with Soviet initiatives with regards to Germany. The famous \"Stalin Notes\" of 1952 had held out the prospects of a reunified, neutral Germany, but both Washington and Bonn rejected them as a non-serious ruse to prevent FRG rearmament. Although the Adenauer government had taken a good deal of initiative in rejecting the Soviet offer, Bonn was far from alone in its distrust of Stalin's intent. Washington and London were not very receptive to the Notes ad rejected them with diplomatic niceties. The Adenauer government likely expected a similar united front when rejecting this round of post-Stalin feelers. Internal discussions in Bonn likened Molotov's speeches and other Soviet initiatives as little more than recapitulations of Stalin's earlier attempt to drive a wedge within the Western alliance over Central Europe. Thus it came as a shock to Adenauer when Washington and London were receptive to Soviet offers on Austria. Western allied diplomats simply sidestepped the initial Soviet preconditions for settling the German question first and dove straight into Austrian affairs. This set a dangerous precedent to Adenauer on a number of levels. \n\nFor one thing, the ending of the occupation and a neutral Austria signaled that American popular concerns about defense spending in Europe and the wider Cold War was now impacting actual American foreign policy. There were many signals in the early 1950s that the American public was much less willing or patient to keep large armies overseas, especially after the costly Korean conflict underscored the dangers of overseas commitments. The EDC was only one initiative designed for Europe to \"pay its keep\" in terms of the defense burden. But the EDC inn the 1950s was currently mired over issues of national sovereignty over defense and the question of German rearmament. These issues would eventually kill the EDC in 1954 when France refused to ratify the Treaty because of the issue of German rearmament. The timing of negotiations over Austria thus opened up a potential precedent that the US was going to cut the Gordian knot for European defense and instead of dealing with squabbling Europeans, it would wring a cheap diplomatic solution with the Soviets. \n\nThis possibility, even if remote, was quite frightening for Adenauer and his coalition. The Austrian State Treaty provided for a unified and largely demilitarized Austria. Not only did this create a gap in NATO defenses, weakening the FRG, but it now created the possibility of a united and disarmed Germany in the future. Adenauer's fear was that a naive American foreign policy establishment and public would sell out Germany for an immediate end to its costly occupation and defense commitments. For the deeply anticommunist Adenauer, a disarmed Germany, even if united, would be little different than a Soviet satellite state. Soviet and satellite armies could easily overwhelm or threaten such a weak German state to do its bidding. The favorable terms of the Austrian State Treaty were a ruse according to Adenauer. To his advisors, the Chancellor noted that a peaceful Austria was a diplomatic Potemkin village designed to lull Germans and Western Europeans into believing the same could be applied to Germany. \n\nAdenauer's worst-case scenario thinking on the Austrian *demarche* was likely  encouraged by the fact that the key feature of the Austrian State Treaty- neutrality- was at direct odds with his major foreign policy strategies. Adenauer was quite open about his policy of *Westbindung* in which Germany rejected the Prussian grasp for *Weltmacht* and instead constructively engaged Western Europe. German diplomacy of this period stressed that the \"good Germany\" (ie the anticommunist western half) had seen the errors of its ways and was now a responsible member of the global community. The basic goal of the Adenauer government was to be included in major alliance systems and to be treated as a reliable partner. Bonn also maintained a contingency plan of sorts should the America retreat from Europe as a number of CDU-CSU politicians maintained semi-secret contacts with Gaullist France. Applying the same terms of the Austrian State Treaty to Germany would have sabotaged these open and covert plans for the normalization  of Germany within the postwar state system. One of the overarching goals of Adenauer's foreign policy was to be *included* in Europe's collective decision-making process and now Austrian developments signaled that Germany was still unique and could become a special zone of Europe quarantined from wider political developments. \n\nThis potential marginalization of the FRG also had domestic ramifications even if negotiations stalled on the German question. The FRG opposition party, the SPD, championed a form of left-nationalism which contended that German division was a tragedy that should have been avoided. While this was becoming a somewhat stale talking point by the mid-1950s, the Austrian State Treaty threatened to breath new life into this issue. The SPD leadership held that German rearmament and other initiatives of the Adenauer government's *Westbindung* were counterproductive for the wider issue of reunification and only antagonized Moscow.  The Austrian precedent potentially gave the SPD a chance to make this a major election issue as it could portray the conservative CDU-CSU was stumbling block to German unification through its pursuit of dead-ends like the EDC. Additionally, the prospect of a German form of the Treaty could also energize the German right against Adenauer,   because it offered- from Adenauer's perspective-  an *ersatz* form of national sovereignty in lieu of the more complicated policies of the  Adenauer government. Even without progress on the German question, the Austrian State Treaty's provisions that Austria was a sovereign state and not a German one opened up the possibility that Austria could demand reparations from Germany for its occupation. While the FRG political establishment could stand with parting money and aid to Israel, to extend reparations to Austria was too much. The Israeli aid was controversial enough in some CDU-CSU quarters, but to pay Austria was a step too far since many Germans knew how complicit Austrians were in the *Anschluß* and within the Third Reich.  \n\nAdenauer put a lot of the blame for this state of affairs on the Americans. Going into the 1957 Bundestag elections, Adenauer reportedly said to SACEUR chief General Lauris Norstad \"I will win the elections if the Americans make no mistakes.\" The success of the CDU-CSU in the 1957 elections was a testament to Adenauer's political skills, but also reflected the transient nature of the Austrian State Treaty upon the wider Cold War. Eisenhower would defend the Treaty in a 1955 *Le Monde* interview, asserting that the Treaty created a suitable defense framework for Central Europe and not a \"military vacuum.\" Yet, *pace* Eisenhower's defense of the Treaty, there was a growing consensus in American policy circles that the Austrian State Treaty was a one-off affair. The Treaty became an example of \"Finlandization\" for a number of diplomats in the State Department in which the Soviets made minor concessions to gain a larger strategic prize over the long-term. While the \"Austrian scandal\" may have opened up domestic fissures in FRG politics and underscored the limits of Adenauer's power on the world stage, its long-term impact on the German question and the Cold War were ephemeral. \n\n*Sources*\n\nBrady, Steven. *Eisenhower and Adenauer: Alliance Maintenance Under Pressure, 1953-1960*. Lanham, Md: Lexington Books, 2010. \n\nGranieri, Ronald J. *The Ambivalent Alliance: Konrad Adenauer, the CDU/CSU, and the West, 1949-1966*. New York: Berghahn, 2005. \n\nKramer, Mark, and Vít Smetana. *Imposing, Maintaining, and Tearing Open the Iron Curtain: The Cold War and East-Central Europe, 1945-1989*. Lanhem: Lexington Books, 2014. \n\nSteininger, Rolf. *Austria, Germany, and the Cold War: From the Anschluss to the State Treaty 1938-1955*. New York: Berghahn Books, 2008. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Adenauer&amp;#39;s rather public snit over the Austrian State Treaty came as a surprise to the Anglo-American foreign policy establishment. Both in public and in private, the German chancellor cast aspersions on the Treaty and its ramifications for Central Europe. Such invective included the famous line that if Austria demanded reparations, German would send them Hitler&amp;#39;s ashes- if they could be found- in an urn. In hindsight, such surprise at Adeanuer&amp;#39;s actions was unwarranted. The State Treaty touched on a number of hot-button issues within FRG politics as well as undercut  Adenauer&amp;#39;s own strategy for restoring the FRG&amp;#39;s position within Western Europe.&lt;/p&gt;\n\n&lt;p&gt;Although the Austrian State Treaty was the most successful diplomatic &lt;em&gt;demarche&lt;/em&gt; of Soviet diplomacy in the post-Stalin period, its success has overshadowed other initiatives sent out after 1953. Soviet diplomats zeroed in on settling the German issue as one of the central planks of a post-Stalin diplomatic order. The initial Soviet feelers on ending the Austrian occupation actually predicated that settlement the German question was a precondition for an Austrian treaty. When Adenauer visited the US in April 1953, that Soviet feelers were aiming at &amp;quot;German reunification, a State Treaty for Austria, and a peace settlement in Korea and Indochina.&amp;quot; For his part, Adenauer was skeptical of Soviet intentions and good faith and he told his American hosts that the Soviet feelers were an attempt to torpedo the negotiations for the European Defense Community (EDC) and hamstring the FRG&amp;#39;s return to full sovereignty. &lt;/p&gt;\n\n&lt;p&gt;Adenauer&amp;#39;s skepticism was in line with his earlier experience with Soviet initiatives with regards to Germany. The famous &amp;quot;Stalin Notes&amp;quot; of 1952 had held out the prospects of a reunified, neutral Germany, but both Washington and Bonn rejected them as a non-serious ruse to prevent FRG rearmament. Although the Adenauer government had taken a good deal of initiative in rejecting the Soviet offer, Bonn was far from alone in its distrust of Stalin&amp;#39;s intent. Washington and London were not very receptive to the Notes ad rejected them with diplomatic niceties. The Adenauer government likely expected a similar united front when rejecting this round of post-Stalin feelers. Internal discussions in Bonn likened Molotov&amp;#39;s speeches and other Soviet initiatives as little more than recapitulations of Stalin&amp;#39;s earlier attempt to drive a wedge within the Western alliance over Central Europe. Thus it came as a shock to Adenauer when Washington and London were receptive to Soviet offers on Austria. Western allied diplomats simply sidestepped the initial Soviet preconditions for settling the German question first and dove straight into Austrian affairs. This set a dangerous precedent to Adenauer on a number of levels. &lt;/p&gt;\n\n&lt;p&gt;For one thing, the ending of the occupation and a neutral Austria signaled that American popular concerns about defense spending in Europe and the wider Cold War was now impacting actual American foreign policy. There were many signals in the early 1950s that the American public was much less willing or patient to keep large armies overseas, especially after the costly Korean conflict underscored the dangers of overseas commitments. The EDC was only one initiative designed for Europe to &amp;quot;pay its keep&amp;quot; in terms of the defense burden. But the EDC inn the 1950s was currently mired over issues of national sovereignty over defense and the question of German rearmament. These issues would eventually kill the EDC in 1954 when France refused to ratify the Treaty because of the issue of German rearmament. The timing of negotiations over Austria thus opened up a potential precedent that the US was going to cut the Gordian knot for European defense and instead of dealing with squabbling Europeans, it would wring a cheap diplomatic solution with the Soviets. &lt;/p&gt;\n\n&lt;p&gt;This possibility, even if remote, was quite frightening for Adenauer and his coalition. The Austrian State Treaty provided for a unified and largely demilitarized Austria. Not only did this create a gap in NATO defenses, weakening the FRG, but it now created the possibility of a united and disarmed Germany in the future. Adenauer&amp;#39;s fear was that a naive American foreign policy establishment and public would sell out Germany for an immediate end to its costly occupation and defense commitments. For the deeply anticommunist Adenauer, a disarmed Germany, even if united, would be little different than a Soviet satellite state. Soviet and satellite armies could easily overwhelm or threaten such a weak German state to do its bidding. The favorable terms of the Austrian State Treaty were a ruse according to Adenauer. To his advisors, the Chancellor noted that a peaceful Austria was a diplomatic Potemkin village designed to lull Germans and Western Europeans into believing the same could be applied to Germany. &lt;/p&gt;\n\n&lt;p&gt;Adenauer&amp;#39;s worst-case scenario thinking on the Austrian &lt;em&gt;demarche&lt;/em&gt; was likely  encouraged by the fact that the key feature of the Austrian State Treaty- neutrality- was at direct odds with his major foreign policy strategies. Adenauer was quite open about his policy of &lt;em&gt;Westbindung&lt;/em&gt; in which Germany rejected the Prussian grasp for &lt;em&gt;Weltmacht&lt;/em&gt; and instead constructively engaged Western Europe. German diplomacy of this period stressed that the &amp;quot;good Germany&amp;quot; (ie the anticommunist western half) had seen the errors of its ways and was now a responsible member of the global community. The basic goal of the Adenauer government was to be included in major alliance systems and to be treated as a reliable partner. Bonn also maintained a contingency plan of sorts should the America retreat from Europe as a number of CDU-CSU politicians maintained semi-secret contacts with Gaullist France. Applying the same terms of the Austrian State Treaty to Germany would have sabotaged these open and covert plans for the normalization  of Germany within the postwar state system. One of the overarching goals of Adenauer&amp;#39;s foreign policy was to be &lt;em&gt;included&lt;/em&gt; in Europe&amp;#39;s collective decision-making process and now Austrian developments signaled that Germany was still unique and could become a special zone of Europe quarantined from wider political developments. &lt;/p&gt;\n\n&lt;p&gt;This potential marginalization of the FRG also had domestic ramifications even if negotiations stalled on the German question. The FRG opposition party, the SPD, championed a form of left-nationalism which contended that German division was a tragedy that should have been avoided. While this was becoming a somewhat stale talking point by the mid-1950s, the Austrian State Treaty threatened to breath new life into this issue. The SPD leadership held that German rearmament and other initiatives of the Adenauer government&amp;#39;s &lt;em&gt;Westbindung&lt;/em&gt; were counterproductive for the wider issue of reunification and only antagonized Moscow.  The Austrian precedent potentially gave the SPD a chance to make this a major election issue as it could portray the conservative CDU-CSU was stumbling block to German unification through its pursuit of dead-ends like the EDC. Additionally, the prospect of a German form of the Treaty could also energize the German right against Adenauer,   because it offered- from Adenauer&amp;#39;s perspective-  an &lt;em&gt;ersatz&lt;/em&gt; form of national sovereignty in lieu of the more complicated policies of the  Adenauer government. Even without progress on the German question, the Austrian State Treaty&amp;#39;s provisions that Austria was a sovereign state and not a German one opened up the possibility that Austria could demand reparations from Germany for its occupation. While the FRG political establishment could stand with parting money and aid to Israel, to extend reparations to Austria was too much. The Israeli aid was controversial enough in some CDU-CSU quarters, but to pay Austria was a step too far since many Germans knew how complicit Austrians were in the &lt;em&gt;Anschluß&lt;/em&gt; and within the Third Reich.  &lt;/p&gt;\n\n&lt;p&gt;Adenauer put a lot of the blame for this state of affairs on the Americans. Going into the 1957 Bundestag elections, Adenauer reportedly said to SACEUR chief General Lauris Norstad &amp;quot;I will win the elections if the Americans make no mistakes.&amp;quot; The success of the CDU-CSU in the 1957 elections was a testament to Adenauer&amp;#39;s political skills, but also reflected the transient nature of the Austrian State Treaty upon the wider Cold War. Eisenhower would defend the Treaty in a 1955 &lt;em&gt;Le Monde&lt;/em&gt; interview, asserting that the Treaty created a suitable defense framework for Central Europe and not a &amp;quot;military vacuum.&amp;quot; Yet, &lt;em&gt;pace&lt;/em&gt; Eisenhower&amp;#39;s defense of the Treaty, there was a growing consensus in American policy circles that the Austrian State Treaty was a one-off affair. The Treaty became an example of &amp;quot;Finlandization&amp;quot; for a number of diplomats in the State Department in which the Soviets made minor concessions to gain a larger strategic prize over the long-term. While the &amp;quot;Austrian scandal&amp;quot; may have opened up domestic fissures in FRG politics and underscored the limits of Adenauer&amp;#39;s power on the world stage, its long-term impact on the German question and the Cold War were ephemeral. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Sources&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Brady, Steven. &lt;em&gt;Eisenhower and Adenauer: Alliance Maintenance Under Pressure, 1953-1960&lt;/em&gt;. Lanham, Md: Lexington Books, 2010. &lt;/p&gt;\n\n&lt;p&gt;Granieri, Ronald J. &lt;em&gt;The Ambivalent Alliance: Konrad Adenauer, the CDU/CSU, and the West, 1949-1966&lt;/em&gt;. New York: Berghahn, 2005. &lt;/p&gt;\n\n&lt;p&gt;Kramer, Mark, and Vít Smetana. &lt;em&gt;Imposing, Maintaining, and Tearing Open the Iron Curtain: The Cold War and East-Central Europe, 1945-1989&lt;/em&gt;. Lanhem: Lexington Books, 2014. &lt;/p&gt;\n\n&lt;p&gt;Steininger, Rolf. &lt;em&gt;Austria, Germany, and the Cold War: From the Anschluss to the State Treaty 1938-1955&lt;/em&gt;. New York: Berghahn Books, 2008. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg4k9k5", "score_hidden": false, "stickied": false, "created": 1491959301.0, "created_utc": 1491930501.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 53}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64qfg7", "likes": null, "replies": "", "user_reports": [], "id": "dg4iw2f", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "woodfighter", "parent_id": "t3_64qfg7", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Let's start with the second part, the quote reads „Wenn die etwas von uns wollen, schicken wir ihnen die Gebeine Hitlers.“ (Translation: “If they want something from us, we'll send them Hitler's remains.”) while talking about reparations for WWII (source: &lt;http://www.spiegel.de/spiegel/print/d-46273946.html&gt;), implying the Austrians were themselves voluntary (how much choice there really was in the Anschluss is another question) part of the Reich, that had waged the war.\n\nOn to the scandal: Here the quote reads „die ganze österreichische Schweinerei“ which I would translate to “the whole Austrian mess” instead of scandal, even though mess is inherently less colourful than Schweinerei (lit. swinishness). He was indeed talking about the Austrian State Treaty, in which Austria had agreed to become a neutral state, which was the reason Adenauer said what he did. Adenauer was extremely afraid of a communistic takeover of Western Europe and feared that the neutral (he even called them neutralized instead of neutral) states would fall under Soviet influence sooner rather than later . The first visit of Adenauer to Moskau was already planned for the summer of 1955, when the Austrian treaty was signed quite unexpectedly and Adenauer at the time expected the Soviets to press for an Austrian-style solution for the reunification of Germany, which he was extremely opposed against (the West German-Soviet relations didn't normalize until the government of Wili Brandt). (sources: &lt;http://www.gehler.at/mat/sn_0107_1995.pdf&gt;, &lt;http://derstandard.at/2000015592349/Befreiung-1945-und-nicht-1955&gt;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Let&amp;#39;s start with the second part, the quote reads „Wenn die etwas von uns wollen, schicken wir ihnen die Gebeine Hitlers.“ (Translation: “If they want something from us, we&amp;#39;ll send them Hitler&amp;#39;s remains.”) while talking about reparations for WWII (source: &lt;a href=\"http://www.spiegel.de/spiegel/print/d-46273946.html\"&gt;http://www.spiegel.de/spiegel/print/d-46273946.html&lt;/a&gt;), implying the Austrians were themselves voluntary (how much choice there really was in the Anschluss is another question) part of the Reich, that had waged the war.&lt;/p&gt;\n\n&lt;p&gt;On to the scandal: Here the quote reads „die ganze österreichische Schweinerei“ which I would translate to “the whole Austrian mess” instead of scandal, even though mess is inherently less colourful than Schweinerei (lit. swinishness). He was indeed talking about the Austrian State Treaty, in which Austria had agreed to become a neutral state, which was the reason Adenauer said what he did. Adenauer was extremely afraid of a communistic takeover of Western Europe and feared that the neutral (he even called them neutralized instead of neutral) states would fall under Soviet influence sooner rather than later . The first visit of Adenauer to Moskau was already planned for the summer of 1955, when the Austrian treaty was signed quite unexpectedly and Adenauer at the time expected the Soviets to press for an Austrian-style solution for the reunification of Germany, which he was extremely opposed against (the West German-Soviet relations didn&amp;#39;t normalize until the government of Wili Brandt). (sources: &lt;a href=\"http://www.gehler.at/mat/sn_0107_1995.pdf\"&gt;http://www.gehler.at/mat/sn_0107_1995.pdf&lt;/a&gt;, &lt;a href=\"http://derstandard.at/2000015592349/Befreiung-1945-und-nicht-1955\"&gt;http://derstandard.at/2000015592349/Befreiung-1945-und-nicht-1955&lt;/a&gt;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg4iw2f", "score_hidden": false, "stickied": false, "created": 1491957809.0, "created_utc": 1491929009.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64qfg7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64qfg7", "likes": null, "replies": "", "user_reports": [], "id": "dg4hal5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Rakpas", "parent_id": "t1_dg4gqip", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "https://en.wikipedia.org/wiki/Allied-occupied_Austria#Independence\n\nLast sentence.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Allied-occupied_Austria#Independence\"&gt;https://en.wikipedia.org/wiki/Allied-occupied_Austria#Independence&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Last sentence.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg4hal5", "score_hidden": false, "stickied": false, "created": 1491956062.0, "created_utc": 1491927262.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4gqip", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "circlejerker2000", "parent_id": "t3_64qfg7", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Do you have a source on that? I live in Germany and never heard of that \"whole Austrian scandal\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have a source on that? I live in Germany and never heard of that &amp;quot;whole Austrian scandal&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg4gqip", "score_hidden": false, "stickied": false, "created": 1491955449.0, "created_utc": 1491926649.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}]