[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In Massachusetts, let&amp;#39;s say. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "In Massachusetts, let's say. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64ql2e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 135, "report_reasons": null, "author": "Professor_RJ_Lupin", "saved": false, "mod_reports": [], "name": "t3_64ql2e", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/64ql2e/im_a_farmer_in_north_america_in_the_late_18th/", "num_reports": null, "locked": false, "stickied": false, "created": 1491943525.0, "url": "https://www.reddit.com/r/AskHistorians/comments/64ql2e/im_a_farmer_in_north_america_in_the_late_18th/", "author_flair_text": null, "quarantine": false, "title": "I'm a farmer in North America in the late 18th century. How is my life affected by the American Revolutionary War?", "created_utc": 1491914725.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 17, "visited": false, "subreddit_type": "public", "ups": 135}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64ql2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64ql2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64ql2e", "likes": null, "replies": "", "user_reports": [], "id": "dg60f44", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TRB1783", "parent_id": "t1_dg5mdvk", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg60f44", "score_hidden": false, "stickied": false, "created": 1492039355.0, "created_utc": 1492010555.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mdvk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kagantx", "parent_id": "t1_dg51vcm", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "I love your answer, with the great storytelling.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love your answer, with the great storytelling.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg5mdvk", "score_hidden": false, "stickied": false, "created": 1492012549.0, "created_utc": 1491983749.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64ql2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64ql2e", "likes": null, "replies": "", "user_reports": [], "id": "dg8bhyc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TRB1783", "parent_id": "t1_dg7e0qt", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "My pleasure, truly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My pleasure, truly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8bhyc", "score_hidden": false, "stickied": false, "created": 1492150502.0, "created_utc": 1492121702.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7e0qt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Professor_RJ_Lupin", "parent_id": "t1_dg51vcm", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "What a reply! Thank you very much for taking the time to write this fantastic answer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What a reply! Thank you very much for taking the time to write this fantastic answer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7e0qt", "score_hidden": false, "stickied": false, "created": 1492108799.0, "created_utc": 1492079999.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64ql2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64ql2e", "likes": null, "replies": "", "user_reports": [], "id": "dg61ojj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TRB1783", "parent_id": "t1_dg5ampo", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "North Carolina is actually one of my weaker areas. Again, it would depend on where you were. If you were a backwoodsman of Scottish descent, you might have opposed the Revolution because your family still remembered the failed rising in 1745 back home, and what it had cost your people.  Otherwise, you might have opposed the Revolution  because once again the coastal planter aristocrats had implemented a policy without concern for what it would mean for people like you. Then again, you don't like being told what to do by any outsider, so you happily turned up at King's Mountain to slaughter the British officer who had threatened your community \"with fire and sword\" if they did not swear loyalty to the king.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;North Carolina is actually one of my weaker areas. Again, it would depend on where you were. If you were a backwoodsman of Scottish descent, you might have opposed the Revolution because your family still remembered the failed rising in 1745 back home, and what it had cost your people.  Otherwise, you might have opposed the Revolution  because once again the coastal planter aristocrats had implemented a policy without concern for what it would mean for people like you. Then again, you don&amp;#39;t like being told what to do by any outsider, so you happily turned up at King&amp;#39;s Mountain to slaughter the British officer who had threatened your community &amp;quot;with fire and sword&amp;quot; if they did not swear loyalty to the king.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg61ojj", "score_hidden": false, "stickied": false, "created": 1492040741.0, "created_utc": 1492011941.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ampo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "longrifle", "parent_id": "t1_dg51vcm", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "What about in a poorer colony like North Carolina?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What about in a poorer colony like North Carolina?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg5ampo", "score_hidden": false, "stickied": false, "created": 1491990811.0, "created_utc": 1491962011.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64ql2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64ql2e", "likes": null, "replies": "", "user_reports": [], "id": "dg6gnq9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TRB1783", "parent_id": "t1_dg6fcgy", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Hardly. I could barely keep my tenses straight. Thanks, though!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hardly. I could barely keep my tenses straight. Thanks, though!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6gnq9", "score_hidden": false, "stickied": false, "created": 1492056185.0, "created_utc": 1492027385.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6fcgy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RiceandBeansandChees", "parent_id": "t1_dg51vcm", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Thanks for the answer, this is some grade-A writing BTW. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the answer, this is some grade-A writing BTW. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6fcgy", "score_hidden": false, "stickied": false, "created": 1492054845.0, "created_utc": 1492026045.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg51vcm", "gilded": 0, "archived": false, "score": 57, "report_reasons": null, "author": "TRB1783", "parent_id": "t3_64ql2e", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "This will depend largely on where you are and what you grow. Let's take a few examples, all beginning in 1775:\n\n**Grain farmer, 29, Concord, Massachusetts:** The years leading up to the start of the shooting war were difficult for Concord. Land ownership had reached a crisis point, where young men either had to move to the distant frontiers of Maine or New Hampshire/Vermont or wait until their late 20s or 30s to inherit or launch into business on their own savings. Land uncertainty forced young men into other, more tenuous professions, such as merchant trades or crafts. The various non-importation movements hit people without land to fall back on particularly hard. The resultant frustrations helped drive the rising generation towards Revolution. The economic downturn also affected people in the most intimate ways: birthrates dropped as the marrying age went up. Younger marriages were often done in defiance of parents, either through elopement or by premarital pregnancy.\n\nSo, if you're already a farmer, as per your question, you're one of the lucky ones. You hope that your recently deceased father would have been proud to see you turn out with the militia on April 19, 1775, when the lobsterbacks marched on the town. You were part of the force besieging Boston in the early days of summer (though you missed the action at Breed's Hil). As summer turned to fall, however, you returned home to harvest your crops. Four of your younger friends in town, including your younger brother, take a one-year enlistment in the newly-formed Continental Army.  By the next winter, one has died of camp fever and two have returned home, content to have done their bit. Your brother, however, decides to stay on, having been made a serjeant in his regiment. \n\nThe war years ticked by productively for you. After the British evacuated Boston in early 1776, they never again meaningfully threatened Massachusetts. Instead, they hoped to geographically and politically cut New England off from the rest of the country rather than subject their army to the swarm of numerous, well-armed, well-drilled militiamen they found around your town in 1775. The relative security of geography and reputation means that you can grow your crops in peace, and the presence of the Continental Army a few hundred miles to the south means that you always have a buyer for your crops. In fact, you join in with your neighbor to start a wagon company, shipping both food and imported weapons south to the army.\n\nYour brother is a drain on your resources in two ways. Indirectly, taxes remain high throughout the war to support Massachusetts' \"line\" - all the regiments from that state in the Continental Army. No state sent more men to fight in the war, and the state government made it a point to make sure that their soldiers were as well dressed and equipped as any. More directly, your brother writes you several times to ask that you loan him money after his promotion to ensign in 1778. New rank meant both a new uniform and the necessity to partake in the army's social scene, and his meager savings and barely-existent pay do not allow him to carry himself as an officer and gentleman. The presence of a French army passing through Boston in 1781 lets you recoup some of your money, as you gleefully triple your usual prices when selling to your country's Catholic allies.\n\nAs the war ends, you learn that your brother, now a captain, has received a land grant in western New York, on land formerly claimed by the now-displaced Iroquois. He uses some of the lump-sum cash payment he received for his back-wages at the end of the war to repay some of his debts to you, and promises to send you the rest as he establishes himself out west.\n\n**Flax farmer, 54, Ossining (Westchester Country), New York**: You set the newspaper carrying the news of fighting at Lexington and Concord down with considerable trepidation, placing it a top your well-worn (but often hastily hidden) copy of *Letters from a Westchester Farmer*.  The (ostensibly) anonymous author of the *Letters* succinctly voiced many of your fears about what a rupture with the mother country might bring. Nearly all of your crops are shipped down the Hudson to New York after harvest, where they are bought up and sent to textile mills in Liverpool. In lean years, you've sold lumber from your timber plot in New York as well, where they were purchased by an agent for a Jamaica planter looking to build new slave quarters. Revolt, or worse, independence, would shut you out from these markets, possibly forever. Still, in the weeks and months ahead, you hold your tongue in public. Those more inclined to speak out  find themselves visited by Patriot mobs. Reverend Samuel Seabury, author of the *Letters*, is himself abducted by a raiding party from Connecticut, since they did not think the local Patriots had done enough to silence him. \n\nTo the surprise of no one, the British attacked New York the following year, and to an equal absence of surprise, the Continental Army proved completely incapable of holding the city against the Royal Navy and British army. You enjoyed a brief glimmer of hope that this would all end quickly after the fighting comes within earshot of your house at the Battle of White Plains, where another rebel defeat sent Washington scurrying across New Jersey. Any hopes of a quick peace were dashed when Washington made a daring counterattack that winter, retaking New Jersey and breathing new life into the rebel cause. \n\nThe war years are a disaster for you and your neighbors. Westchester county becomes a no man's land between the British in New York and the rebels in the Hudson Highlands. Your attempts at neutrality earlier on only mean that bandits and raiders from both sides feel comfortable stealing from you and vandalizing your property. Hunger weakens your youngest child, who dies of smallpox in 1777 after the disease hits your community, likely carried by a soldier from one army or the other. Eventually, the Continentals build a line of observation posts on the Croton River, just to the south of your town. This stops some of the raids, though the American soldiers can be just as sticky-fingered. It takes the arrival of the remaining Continental Army in the summer of 1783, to fully restore law and order to the area. Markets be damned; at this point, you're happy just to have peace.\n\n**Tobacco farmer, 42, Northumberland County, Virginia**: Late April brought a swirl of news. While your blood boiled at the reports that royal soldiers had killed American farmers outside of Boston, your more pressing concern was Governor Dunmore's attempts to seize the Williamsburg militia's stockpile of powder and muskets. Rumor had it that Dunmore planned to free and arm slaves to make his own private army, an unspeakably evil plot that could lead only the slaughter of slaveowners great and (like yourself) small, along with the rest of Virginia's white population. As such, you cheered  the news that Dunmore had fled Williamsburg for the safety of a royal warship, and viewed his subsequent effort to raise a regiment of black soldiers as proof that the conspiracies that circled through your community before the war must have been true.\n\nWhile you never served in the army, one of your farmhands did. As if to balance the score, your slave Cato ran off to join Dunmore, though you eventually learned that he may have died of smallpox. His loss was only the first of several impositions by the war onto your life. You are old enough to remember your father's complaints about great planters in the House of Burgesses during the French and Indian War, and their conduct this time seems no better: always eager to start a fight, and just as eager to send someone else to fight it and make someone else pay for it. As the war dragged on, you forbid your son, now 16, from joining the army: with all the help gone, you need his labor. The choice might not be up to you, however. With enlistments sagging, the grandees in the state government have decided to institute a draft.\n\n On draft day, you and nearly 150 of your fellow militiamen turned out to block the government's agents from drawing names for the draft. After some negotiating, both sides reached an agreement to go home. At the last minute, however, your hotheaded neighbor, Joseph Pittman,  traded insults with a Continental captain, and the two exchanged shots. Pitman was only wounded, but he blew off the better part of Captain Hull's head. You spend the next year trying to stay out of the ensuing civil war, which was mostly brought to an end by the British invasion of your state. The stunning victory at Yorktown restores peace to your world more broadly, though you are aware that fighting continues in states to your north and south. That's of little concern to you, since the state government made no more serious efforts to recruit in your county after the 1780 riot.\n\nSources (in order):\n\nRobert A. Gross, *The Minutemen and their World*\n\nPhilip Ranlet, *The New York Loyalists*\n\nSamuel Seabury, *Letters from a Westchester Farmer*\n\nMichael A. McDonnell: *The Politics of War: Race, Class, and Conflict in Revolutionary Virginia*\n\nAlan Taylor, *The Internal Enemy*\n", "edited": 1492011690.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This will depend largely on where you are and what you grow. Let&amp;#39;s take a few examples, all beginning in 1775:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Grain farmer, 29, Concord, Massachusetts:&lt;/strong&gt; The years leading up to the start of the shooting war were difficult for Concord. Land ownership had reached a crisis point, where young men either had to move to the distant frontiers of Maine or New Hampshire/Vermont or wait until their late 20s or 30s to inherit or launch into business on their own savings. Land uncertainty forced young men into other, more tenuous professions, such as merchant trades or crafts. The various non-importation movements hit people without land to fall back on particularly hard. The resultant frustrations helped drive the rising generation towards Revolution. The economic downturn also affected people in the most intimate ways: birthrates dropped as the marrying age went up. Younger marriages were often done in defiance of parents, either through elopement or by premarital pregnancy.&lt;/p&gt;\n\n&lt;p&gt;So, if you&amp;#39;re already a farmer, as per your question, you&amp;#39;re one of the lucky ones. You hope that your recently deceased father would have been proud to see you turn out with the militia on April 19, 1775, when the lobsterbacks marched on the town. You were part of the force besieging Boston in the early days of summer (though you missed the action at Breed&amp;#39;s Hil). As summer turned to fall, however, you returned home to harvest your crops. Four of your younger friends in town, including your younger brother, take a one-year enlistment in the newly-formed Continental Army.  By the next winter, one has died of camp fever and two have returned home, content to have done their bit. Your brother, however, decides to stay on, having been made a serjeant in his regiment. &lt;/p&gt;\n\n&lt;p&gt;The war years ticked by productively for you. After the British evacuated Boston in early 1776, they never again meaningfully threatened Massachusetts. Instead, they hoped to geographically and politically cut New England off from the rest of the country rather than subject their army to the swarm of numerous, well-armed, well-drilled militiamen they found around your town in 1775. The relative security of geography and reputation means that you can grow your crops in peace, and the presence of the Continental Army a few hundred miles to the south means that you always have a buyer for your crops. In fact, you join in with your neighbor to start a wagon company, shipping both food and imported weapons south to the army.&lt;/p&gt;\n\n&lt;p&gt;Your brother is a drain on your resources in two ways. Indirectly, taxes remain high throughout the war to support Massachusetts&amp;#39; &amp;quot;line&amp;quot; - all the regiments from that state in the Continental Army. No state sent more men to fight in the war, and the state government made it a point to make sure that their soldiers were as well dressed and equipped as any. More directly, your brother writes you several times to ask that you loan him money after his promotion to ensign in 1778. New rank meant both a new uniform and the necessity to partake in the army&amp;#39;s social scene, and his meager savings and barely-existent pay do not allow him to carry himself as an officer and gentleman. The presence of a French army passing through Boston in 1781 lets you recoup some of your money, as you gleefully triple your usual prices when selling to your country&amp;#39;s Catholic allies.&lt;/p&gt;\n\n&lt;p&gt;As the war ends, you learn that your brother, now a captain, has received a land grant in western New York, on land formerly claimed by the now-displaced Iroquois. He uses some of the lump-sum cash payment he received for his back-wages at the end of the war to repay some of his debts to you, and promises to send you the rest as he establishes himself out west.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Flax farmer, 54, Ossining (Westchester Country), New York&lt;/strong&gt;: You set the newspaper carrying the news of fighting at Lexington and Concord down with considerable trepidation, placing it a top your well-worn (but often hastily hidden) copy of &lt;em&gt;Letters from a Westchester Farmer&lt;/em&gt;.  The (ostensibly) anonymous author of the &lt;em&gt;Letters&lt;/em&gt; succinctly voiced many of your fears about what a rupture with the mother country might bring. Nearly all of your crops are shipped down the Hudson to New York after harvest, where they are bought up and sent to textile mills in Liverpool. In lean years, you&amp;#39;ve sold lumber from your timber plot in New York as well, where they were purchased by an agent for a Jamaica planter looking to build new slave quarters. Revolt, or worse, independence, would shut you out from these markets, possibly forever. Still, in the weeks and months ahead, you hold your tongue in public. Those more inclined to speak out  find themselves visited by Patriot mobs. Reverend Samuel Seabury, author of the &lt;em&gt;Letters&lt;/em&gt;, is himself abducted by a raiding party from Connecticut, since they did not think the local Patriots had done enough to silence him. &lt;/p&gt;\n\n&lt;p&gt;To the surprise of no one, the British attacked New York the following year, and to an equal absence of surprise, the Continental Army proved completely incapable of holding the city against the Royal Navy and British army. You enjoyed a brief glimmer of hope that this would all end quickly after the fighting comes within earshot of your house at the Battle of White Plains, where another rebel defeat sent Washington scurrying across New Jersey. Any hopes of a quick peace were dashed when Washington made a daring counterattack that winter, retaking New Jersey and breathing new life into the rebel cause. &lt;/p&gt;\n\n&lt;p&gt;The war years are a disaster for you and your neighbors. Westchester county becomes a no man&amp;#39;s land between the British in New York and the rebels in the Hudson Highlands. Your attempts at neutrality earlier on only mean that bandits and raiders from both sides feel comfortable stealing from you and vandalizing your property. Hunger weakens your youngest child, who dies of smallpox in 1777 after the disease hits your community, likely carried by a soldier from one army or the other. Eventually, the Continentals build a line of observation posts on the Croton River, just to the south of your town. This stops some of the raids, though the American soldiers can be just as sticky-fingered. It takes the arrival of the remaining Continental Army in the summer of 1783, to fully restore law and order to the area. Markets be damned; at this point, you&amp;#39;re happy just to have peace.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Tobacco farmer, 42, Northumberland County, Virginia&lt;/strong&gt;: Late April brought a swirl of news. While your blood boiled at the reports that royal soldiers had killed American farmers outside of Boston, your more pressing concern was Governor Dunmore&amp;#39;s attempts to seize the Williamsburg militia&amp;#39;s stockpile of powder and muskets. Rumor had it that Dunmore planned to free and arm slaves to make his own private army, an unspeakably evil plot that could lead only the slaughter of slaveowners great and (like yourself) small, along with the rest of Virginia&amp;#39;s white population. As such, you cheered  the news that Dunmore had fled Williamsburg for the safety of a royal warship, and viewed his subsequent effort to raise a regiment of black soldiers as proof that the conspiracies that circled through your community before the war must have been true.&lt;/p&gt;\n\n&lt;p&gt;While you never served in the army, one of your farmhands did. As if to balance the score, your slave Cato ran off to join Dunmore, though you eventually learned that he may have died of smallpox. His loss was only the first of several impositions by the war onto your life. You are old enough to remember your father&amp;#39;s complaints about great planters in the House of Burgesses during the French and Indian War, and their conduct this time seems no better: always eager to start a fight, and just as eager to send someone else to fight it and make someone else pay for it. As the war dragged on, you forbid your son, now 16, from joining the army: with all the help gone, you need his labor. The choice might not be up to you, however. With enlistments sagging, the grandees in the state government have decided to institute a draft.&lt;/p&gt;\n\n&lt;p&gt;On draft day, you and nearly 150 of your fellow militiamen turned out to block the government&amp;#39;s agents from drawing names for the draft. After some negotiating, both sides reached an agreement to go home. At the last minute, however, your hotheaded neighbor, Joseph Pittman,  traded insults with a Continental captain, and the two exchanged shots. Pitman was only wounded, but he blew off the better part of Captain Hull&amp;#39;s head. You spend the next year trying to stay out of the ensuing civil war, which was mostly brought to an end by the British invasion of your state. The stunning victory at Yorktown restores peace to your world more broadly, though you are aware that fighting continues in states to your north and south. That&amp;#39;s of little concern to you, since the state government made no more serious efforts to recruit in your county after the 1780 riot.&lt;/p&gt;\n\n&lt;p&gt;Sources (in order):&lt;/p&gt;\n\n&lt;p&gt;Robert A. Gross, &lt;em&gt;The Minutemen and their World&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Philip Ranlet, &lt;em&gt;The New York Loyalists&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Samuel Seabury, &lt;em&gt;Letters from a Westchester Farmer&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Michael A. McDonnell: &lt;em&gt;The Politics of War: Race, Class, and Conflict in Revolutionary Virginia&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Alan Taylor, &lt;em&gt;The Internal Enemy&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg51vcm", "score_hidden": false, "stickied": false, "created": 1491979222.0, "created_utc": 1491950422.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 57}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64ql2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64ql2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64ql2e", "likes": null, "replies": "", "user_reports": [], "id": "dgb77xa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lazy_starfish", "parent_id": "t1_dgay6sh", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "A reply worth waiting for. Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A reply worth waiting for. Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgb77xa", "score_hidden": false, "stickied": false, "created": 1492320414.0, "created_utc": 1492291614.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgay6sh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TRB1783", "parent_id": "t1_dg4jadp", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Sorry it's taken me a few days to get to this.\n\nIn short, no. When the Revolutionary governments were first formed in 1775/76 ('74 in Massachusetts outside of Boston), they were met with considerable apathy, or even hostility, by some colonists. The Revolution to a large extent was a civil war, with a minority, estimated at 20-30% of the population, working to undermine or fight back against the revolutionaries. Ultimately, however, a super-majority of the population either actively supported the new governments or were willing to cooperate with them most of the time. By the time the war ended in 1783, loyalist support for the Crown had dwindled to an all-time low, and many former loyalists resigned themselves to living in an independent country.\n\nI think former loyalist Peter Van Schaack says it pretty well. When asked to explain his actions during the war, he responded\nthat, “I repent not what I have done… my Heart condemns me not for any Part of my political Conduct.”  However, he later added, “My attachment to her [Great Britain] (great indeed as it was) was founded in the relation she stood in to America, and the happiness I conceived America derived from it.”\n\nIn a 1785 letter to a States Dyckman, a fellow loyalist living in exile, Van Shaack wrote the following:\n\n\"I really see no change in the country—or if there is any, it is no more than there is in the same man in a change of clothes—the stuff is the same and the cut is the same, nor is there less embroidery, I assure. Society has indeed lost many valuable members, but let us consider this subject upon a large scale and free from prejudice, and how many will there be found who are ornaments to the community and have become so by means of this very Revolution, without which they would perhaps have languished into obscurity? Believe me there is no dearth of merit here. I have now had time to look about me and though the idea of England excites many a tender thought and recalls many a found remembrance, yet nothing but dire necessity could\npersuade me to quit my native country again. I have been treated with great attention by all descriptions and I may say without vanity by all ranks of people here. My time has been spent in one continuous Round of Social Easures, my Friends are numerous, my circumstances better than I expected, and to crown all, my Children!—blessed be God for this the greatest of all his mercies—are good, amiable, and promising.”\n\nIn some places, particularly along the Canadian border, there was considerable flux in people's loyalties between the end of the War of Independence and the War of 1812. The 1780s and 90s saw many loyalists, such as Van Schaack and eventually his friend Dyckman, move back to the US. During times of economic or political uncertainty the young republic, some Americans became \"late loyalists\" and moved to Canada.  For more on this, see Alan Taylor, *The Civil War of 1812*.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry it&amp;#39;s taken me a few days to get to this.&lt;/p&gt;\n\n&lt;p&gt;In short, no. When the Revolutionary governments were first formed in 1775/76 (&amp;#39;74 in Massachusetts outside of Boston), they were met with considerable apathy, or even hostility, by some colonists. The Revolution to a large extent was a civil war, with a minority, estimated at 20-30% of the population, working to undermine or fight back against the revolutionaries. Ultimately, however, a super-majority of the population either actively supported the new governments or were willing to cooperate with them most of the time. By the time the war ended in 1783, loyalist support for the Crown had dwindled to an all-time low, and many former loyalists resigned themselves to living in an independent country.&lt;/p&gt;\n\n&lt;p&gt;I think former loyalist Peter Van Schaack says it pretty well. When asked to explain his actions during the war, he responded\nthat, “I repent not what I have done… my Heart condemns me not for any Part of my political Conduct.”  However, he later added, “My attachment to her [Great Britain] (great indeed as it was) was founded in the relation she stood in to America, and the happiness I conceived America derived from it.”&lt;/p&gt;\n\n&lt;p&gt;In a 1785 letter to a States Dyckman, a fellow loyalist living in exile, Van Shaack wrote the following:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I really see no change in the country—or if there is any, it is no more than there is in the same man in a change of clothes—the stuff is the same and the cut is the same, nor is there less embroidery, I assure. Society has indeed lost many valuable members, but let us consider this subject upon a large scale and free from prejudice, and how many will there be found who are ornaments to the community and have become so by means of this very Revolution, without which they would perhaps have languished into obscurity? Believe me there is no dearth of merit here. I have now had time to look about me and though the idea of England excites many a tender thought and recalls many a found remembrance, yet nothing but dire necessity could\npersuade me to quit my native country again. I have been treated with great attention by all descriptions and I may say without vanity by all ranks of people here. My time has been spent in one continuous Round of Social Easures, my Friends are numerous, my circumstances better than I expected, and to crown all, my Children!—blessed be God for this the greatest of all his mercies—are good, amiable, and promising.”&lt;/p&gt;\n\n&lt;p&gt;In some places, particularly along the Canadian border, there was considerable flux in people&amp;#39;s loyalties between the end of the War of Independence and the War of 1812. The 1780s and 90s saw many loyalists, such as Van Schaack and eventually his friend Dyckman, move back to the US. During times of economic or political uncertainty the young republic, some Americans became &amp;quot;late loyalists&amp;quot; and moved to Canada.  For more on this, see Alan Taylor, &lt;em&gt;The Civil War of 1812&lt;/em&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgay6sh", "score_hidden": false, "stickied": false, "created": 1492308111.0, "created_utc": 1492279311.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4jadp", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "lazy_starfish", "parent_id": "t3_64ql2e", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "A followup question: Did citizens immediately accept the new government? I remember reading a post here about the Civil War and how long it took some remote southern communities to be OK with the outcome (some never were I guess).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A followup question: Did citizens immediately accept the new government? I remember reading a post here about the Civil War and how long it took some remote southern communities to be OK with the outcome (some never were I guess).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg4jadp", "score_hidden": false, "stickied": false, "created": 1491958235.0, "created_utc": 1491929435.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}]