[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64s1oz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 45, "report_reasons": null, "author": "Thucydides1987", "saved": false, "mod_reports": [], "name": "t3_64s1oz", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/64s1oz/approximately_when_did_the_franks_become_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1491958282.0, "url": "https://www.reddit.com/r/AskHistorians/comments/64s1oz/approximately_when_did_the_franks_become_the/", "author_flair_text": null, "quarantine": false, "title": "Approximately when did the \"Franks\" become the \"French\"?", "created_utc": 1491929482.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 45}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64s1oz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64s1oz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64s1oz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64s1oz", "likes": null, "replies": "", "user_reports": [], "id": "dg5ytrj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ICFronk", "parent_id": "t1_dg519rg", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "How multilingual would the Carolingian nobility of this era have been? I imagine they would have been raised speaking the local vernacular, as well as a variation of Latin. Were there important local or regional languages/dialects that they would have needed some instruction in? Or that would have been beneficial to their rule?\n\nYour answer above kind of goes into this, so I hope this doesn't detract too much.", "edited": 1492009057.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How multilingual would the Carolingian nobility of this era have been? I imagine they would have been raised speaking the local vernacular, as well as a variation of Latin. Were there important local or regional languages/dialects that they would have needed some instruction in? Or that would have been beneficial to their rule?&lt;/p&gt;\n\n&lt;p&gt;Your answer above kind of goes into this, so I hope this doesn&amp;#39;t detract too much.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg5ytrj", "score_hidden": false, "stickied": false, "created": 1492037569.0, "created_utc": 1492008769.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg519rg", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "textandtrowel", "parent_id": "t1_dg4rx92", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Per this definition, the transition, then, might be dated to 842 and the [Oaths of Strasbourg](https://en.wikipedia.org/wiki/Oaths_of_Strasbourg). These oaths confirmed an alliance between two of Charlemagne's grandsons, and they each recited their oaths in words that their troops would understand. There was an account of this written very shortly thereafter by a nobleman named Ntihard, in Latin, but he also transcribed the oaths as they had been recited in the vernacular languages. Since Nithard distinguishes between the Latin that he writes in and the derivative language used for one of the oaths, this is sometimes considered to be the earliest example of Old French. Notably, these words were reportedly spoken by a person who claimed to be king of the Franks, *rex francorum*.\n\nThe Wikipedia page (linked above) actually does a very nice job setting the 'Old French' (*romana lingua*) and 'Old High German' (*teudisca lingua*) passages side-by-side with modern French and German translations, which helps show just how different (or how similar, if you prefer) these early medieval languages were from their modern counterparts. As /u/tuesdayoct4 points out, this early version of French was still considered something akin to Latin—although I wouldn't call Merovingian or Carolingian Latin anything at \nall like Cicero's Classical Latin. Nithard calls it *romana lingua*.\n\nOn the one hand, Nithard poses *romana lingua* as a distinct language from Latin. On the other hand, he attributes this language to Charles the Bald, whom he supported. Louis the German was the elder brother, but I think Nithard was trying to suggest that Charles nevertheless had a better claim to his grandfather's title of Holy Roman Emperor, since he could speak to his troops using the Roman language, whereas his elder brother had adopted a barbaric *teudisca lingua* spoken across the Rhine.\n\nI'll let you decide if that counts. [Charles the Bald](https://en.wikipedia.org/wiki/Charles_the_Bald) thought he was a Frank and considered himself the king of the Franks, but he could communicate with at least some of his troops in a language that had grown out of Latin. [Louis the German](https://en.wikipedia.org/wiki/Louis_the_German) probably also spoke this *romana lingua*, but as the King of Bavaria, he opted to speak in a more Germanic language, perhaps reaching more of his troops. Both kings were probably making a linguistic turn away from whatever language they had spoken in their youths—Charles the Bald to something more Romano-centric, and Louis the German to something more east-Germanic. And so, perhaps, the Franks became French, on a late winter's day along the Rhine.\n\n(Just to complicate this one step further, it's worth noting that Nithard didn't have many readers during the middle ages. If he truly did herald the transition from Frankish to French, not many people would have noticed.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Per this definition, the transition, then, might be dated to 842 and the &lt;a href=\"https://en.wikipedia.org/wiki/Oaths_of_Strasbourg\"&gt;Oaths of Strasbourg&lt;/a&gt;. These oaths confirmed an alliance between two of Charlemagne&amp;#39;s grandsons, and they each recited their oaths in words that their troops would understand. There was an account of this written very shortly thereafter by a nobleman named Ntihard, in Latin, but he also transcribed the oaths as they had been recited in the vernacular languages. Since Nithard distinguishes between the Latin that he writes in and the derivative language used for one of the oaths, this is sometimes considered to be the earliest example of Old French. Notably, these words were reportedly spoken by a person who claimed to be king of the Franks, &lt;em&gt;rex francorum&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;The Wikipedia page (linked above) actually does a very nice job setting the &amp;#39;Old French&amp;#39; (&lt;em&gt;romana lingua&lt;/em&gt;) and &amp;#39;Old High German&amp;#39; (&lt;em&gt;teudisca lingua&lt;/em&gt;) passages side-by-side with modern French and German translations, which helps show just how different (or how similar, if you prefer) these early medieval languages were from their modern counterparts. As &lt;a href=\"/u/tuesdayoct4\"&gt;/u/tuesdayoct4&lt;/a&gt; points out, this early version of French was still considered something akin to Latin—although I wouldn&amp;#39;t call Merovingian or Carolingian Latin anything at \nall like Cicero&amp;#39;s Classical Latin. Nithard calls it &lt;em&gt;romana lingua&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;On the one hand, Nithard poses &lt;em&gt;romana lingua&lt;/em&gt; as a distinct language from Latin. On the other hand, he attributes this language to Charles the Bald, whom he supported. Louis the German was the elder brother, but I think Nithard was trying to suggest that Charles nevertheless had a better claim to his grandfather&amp;#39;s title of Holy Roman Emperor, since he could speak to his troops using the Roman language, whereas his elder brother had adopted a barbaric &lt;em&gt;teudisca lingua&lt;/em&gt; spoken across the Rhine.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll let you decide if that counts. &lt;a href=\"https://en.wikipedia.org/wiki/Charles_the_Bald\"&gt;Charles the Bald&lt;/a&gt; thought he was a Frank and considered himself the king of the Franks, but he could communicate with at least some of his troops in a language that had grown out of Latin. &lt;a href=\"https://en.wikipedia.org/wiki/Louis_the_German\"&gt;Louis the German&lt;/a&gt; probably also spoke this &lt;em&gt;romana lingua&lt;/em&gt;, but as the King of Bavaria, he opted to speak in a more Germanic language, perhaps reaching more of his troops. Both kings were probably making a linguistic turn away from whatever language they had spoken in their youths—Charles the Bald to something more Romano-centric, and Louis the German to something more east-Germanic. And so, perhaps, the Franks became French, on a late winter&amp;#39;s day along the Rhine.&lt;/p&gt;\n\n&lt;p&gt;(Just to complicate this one step further, it&amp;#39;s worth noting that Nithard didn&amp;#39;t have many readers during the middle ages. If he truly did herald the transition from Frankish to French, not many people would have noticed.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg519rg", "score_hidden": false, "stickied": false, "created": 1491978456.0, "created_utc": 1491949656.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64s1oz", "likes": null, "replies": "", "user_reports": [], "id": "dg4wtb9", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "tuesdayoct4", "parent_id": "t1_dg4rx92", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Maybe, but that distinction is hampered by the fact that the \"official\" language was neither Frankish nor French: it was Classical Latin. And since Latin was the official language, we don't actually have much written record in Frankish to really pin down its usage. We do know that the usage of Classical Latin waned in the 8th-9th century and church services began to be used in the vernacular (Vulgar Latin and some Frankish) and that this gave way to Old French so that's at least a decent general era to say it started, but as an administrative written language, Latin persisted for centuries afterward. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe, but that distinction is hampered by the fact that the &amp;quot;official&amp;quot; language was neither Frankish nor French: it was Classical Latin. And since Latin was the official language, we don&amp;#39;t actually have much written record in Frankish to really pin down its usage. We do know that the usage of Classical Latin waned in the 8th-9th century and church services began to be used in the vernacular (Vulgar Latin and some Frankish) and that this gave way to Old French so that&amp;#39;s at least a decent general era to say it started, but as an administrative written language, Latin persisted for centuries afterward. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg4wtb9", "score_hidden": false, "stickied": false, "created": 1491973010.0, "created_utc": 1491944210.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4rx92", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "nemtrif", "parent_id": "t1_dg4pitm", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "&gt;  I don't think Charlemagne or Hugh Capet woke up one morning and said, 'Okay boys, today we're French.'\n\nBut there must be a moment when the \"official\" (or at least \"spoken by the king\") language shifts from Frankish - a Germanic language to \"early French\" - a Romanic language. Wouldn't that be a good moment to start talking about France?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t think Charlemagne or Hugh Capet woke up one morning and said, &amp;#39;Okay boys, today we&amp;#39;re French.&amp;#39;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But there must be a moment when the &amp;quot;official&amp;quot; (or at least &amp;quot;spoken by the king&amp;quot;) language shifts from Frankish - a Germanic language to &amp;quot;early French&amp;quot; - a Romanic language. Wouldn&amp;#39;t that be a good moment to start talking about France?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg4rx92", "score_hidden": false, "stickied": false, "created": 1491967601.0, "created_utc": 1491938801.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4pitm", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "textandtrowel", "parent_id": "t3_64s1oz", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "This might be a disciplinary problem, and perhaps a bit of a political one as well. That is, it's my impression that people who study the early middle ages tend to refer to the Franks. The term suggests an emphasis on the fall of Rome and the Germanic background of the tribe, although these are both concepts that modern historians vehemently debate. Scholars of the later middle ages, however, tend to refer to the French, which has connotations of setting up the aristocracy of the ancien regime and connects to modern notions of nationalism.\n\nIn the 1800s and early 1900s, there was a substantial debate about whether modern French civilization (and implicitly the population as well) descended from Germanic Franks or Gallo-Romans. The way we use these terms today still carries echoes of this old debate. Discussion about the Franks resonates with the concerns of bygone German nationalists who wanted to emphasize how new Germanic tribes had moved in and conquered Rome, creating modern European civilization. Discussion about the French in contrast suggests that French civilization emerged after this period and therefore is not indebted to or derivative from a Germanic culture.\n\nAfter two world wars that have pitted German territorial claims over the French, scholars are a lot more careful about how they use and discuss these periods and associated terminology. Nevertheless, we're still often responding to arguments put forward by earlier generations of scholars, so there's a lot of inertia behind our continued use of these terms.\n\nPerhaps one good continuing justification for this division between \"Frankish\" and \"French\" terminology might be that early medieval historians tend to rely more on Latin documents (i.e. referring to the *gens francorum*) whereas late medieval historians are more likely to encounter vernacular documents talking about *les francais*. I'm not an expert of the later middle ages, however, so I can't really say when that begins. Perhaps one of our high medievalists will pitch in their perspective.\n\nAt any rate, unless you've got something specific in mind that separates Frankish from French, I suspect this is much more a question about how we do and discuss history, rather than a question about historical events themselves. I don't think Charlemagne or Hugh Capet woke up one morning and said, 'Okay boys, today we're French.' Periodization and terminology tend to be problems that historians make for themselves, rather than problems that people living in the past actually had to deal with and describe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This might be a disciplinary problem, and perhaps a bit of a political one as well. That is, it&amp;#39;s my impression that people who study the early middle ages tend to refer to the Franks. The term suggests an emphasis on the fall of Rome and the Germanic background of the tribe, although these are both concepts that modern historians vehemently debate. Scholars of the later middle ages, however, tend to refer to the French, which has connotations of setting up the aristocracy of the ancien regime and connects to modern notions of nationalism.&lt;/p&gt;\n\n&lt;p&gt;In the 1800s and early 1900s, there was a substantial debate about whether modern French civilization (and implicitly the population as well) descended from Germanic Franks or Gallo-Romans. The way we use these terms today still carries echoes of this old debate. Discussion about the Franks resonates with the concerns of bygone German nationalists who wanted to emphasize how new Germanic tribes had moved in and conquered Rome, creating modern European civilization. Discussion about the French in contrast suggests that French civilization emerged after this period and therefore is not indebted to or derivative from a Germanic culture.&lt;/p&gt;\n\n&lt;p&gt;After two world wars that have pitted German territorial claims over the French, scholars are a lot more careful about how they use and discuss these periods and associated terminology. Nevertheless, we&amp;#39;re still often responding to arguments put forward by earlier generations of scholars, so there&amp;#39;s a lot of inertia behind our continued use of these terms.&lt;/p&gt;\n\n&lt;p&gt;Perhaps one good continuing justification for this division between &amp;quot;Frankish&amp;quot; and &amp;quot;French&amp;quot; terminology might be that early medieval historians tend to rely more on Latin documents (i.e. referring to the &lt;em&gt;gens francorum&lt;/em&gt;) whereas late medieval historians are more likely to encounter vernacular documents talking about &lt;em&gt;les francais&lt;/em&gt;. I&amp;#39;m not an expert of the later middle ages, however, so I can&amp;#39;t really say when that begins. Perhaps one of our high medievalists will pitch in their perspective.&lt;/p&gt;\n\n&lt;p&gt;At any rate, unless you&amp;#39;ve got something specific in mind that separates Frankish from French, I suspect this is much more a question about how we do and discuss history, rather than a question about historical events themselves. I don&amp;#39;t think Charlemagne or Hugh Capet woke up one morning and said, &amp;#39;Okay boys, today we&amp;#39;re French.&amp;#39; Periodization and terminology tend to be problems that historians make for themselves, rather than problems that people living in the past actually had to deal with and describe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg4pitm", "score_hidden": false, "stickied": false, "created": 1491965062.0, "created_utc": 1491936262.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}]