[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64y7bc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 352, "report_reasons": null, "author": "twosplits", "saved": false, "mod_reports": [], "name": "t3_64y7bc", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/64y7bc/did_ramses_ii_try_to_erase_queen_hatshepsut_from/", "num_reports": null, "locked": false, "stickied": false, "created": 1492033298.0, "url": "https://www.reddit.com/r/AskHistorians/comments/64y7bc/did_ramses_ii_try_to_erase_queen_hatshepsut_from/", "author_flair_text": null, "quarantine": false, "title": "Did Ramses II try to erase Queen Hatshepsut from the record books because she was a successful ruler or because she was a woman (whom depicted herself as male)?", "created_utc": 1492004498.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 352}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64y7bc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64y7bc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64y7bc", "likes": null, "replies": "", "user_reports": [], "id": "dg8fkeu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ungrammaticus", "parent_id": "t1_dg7qeru", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Thank you for this fascinating and comprehensive answer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for this fascinating and comprehensive answer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8fkeu", "score_hidden": false, "stickied": false, "created": 1492155894.0, "created_utc": 1492127094.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7qeru", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "mikedash", "parent_id": "t1_dg7qekp", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "It is interesting, in this context, to consider how Hatshepsut portrayed herself over the course of her reign. Early statuary from her regency period clearly depicts a woman wearing male regalia,  breasts visible on a naked upper body. Later, after her coronation as pharaoh, depictions change; Hatshepsut is now portrayed as a man, with wider shoulders and no breasts. And she was buried as a man, as well, in a king's sarcophagus. As Kara Cooney points out, this can be seen as a matter of convention, not deception; Hatshepsut never changed her - very clearly feminine - name, so it seems unlikely she was trying to pretend to be something she was not. Yet it is difficult to imagine that female rule was simply accepted without any question in the Egypt of her day; its consequences were too stark a departure from religiously-rooted norms. The problem here was one of political philosophy, not simply politics. But, as Cooney notes:\n\n&gt;Given that the king on earth was nothing less than the human embodiment of the creator god’s potentiality, Hatshepsut must have been all too aware that her rule posed a serious existential problem: she could not populate a harem, spread her seed, and fill the royal nurseries with potential heirs; she could not claim to be the strong bull of Egypt. \n\nPerhaps, then, it is better to see \"male\" images of Hatshepsut as nods to a conventional iconography that applied equally to *any* Egyptian ruler, of whatever sex, than it is to imagine them as admissions of serious political weakness.\n\nSo, with all this said, we can turn at last to answering the question posed: why were Hatshepsut's images destroyed after her death, and why was her name removed from so many of the monuments she made?\n\nIt's important, first, to recognise that the new regime was not a complete break with the past. Thuthmosis continued to employ a large proportion of the royal servants who had served his stepmother. And the desecration he ordered – which Cooney estimates accounted for \"hundreds, if not thousands\" of images and inscriptions – was not a campaign of attempted absolute obliteration, as the campaign against Akhenaten seems to have been. Not all of Hatshepsut's statues were destroyed, and not all of her cartouches were hacked away; a significant number survived, not least those representing her as queen, including some that were quite prominently displayed on her tomb, which would surely have been a prime target for any Roman-style campaign of *damnatio memoriae*. The same is true of the desecration that seems to have occurred to the monuments of her prime supporter, her steward Senenmut - whose name was removed from only 9 of his surviving 25 statues. Cooney summarises by saying that the statues that were removed or desecrated were those in public places – the aim, therefore, may have been to \"prevent people from *seeing* and *interacting* with her as king.\" The archaeological record, moreover, strongly suggests that the campaign did not begin immediately on Thuthmosis's accession – Hatshepsut was buried with all honour, for one thing, and works underway at the time of her death were completed, which can only imply that her heir ordered work on them to continue. Something happened later to change this, something that Cooney concludes was probably a shift that took place in the mind of an ageing ruler considering his legacy.\n\nModern consensus is that the desecration of Hatshepsut's monuments cannot have begun earlier than the 42nd year of Thuthmosis's reign, which is 20 years after his aunt's death. We also know that it continued into the reign of his son, Amenhotep II – to a period when few of those responsible would have had any memory of the female pharaoh. Finally, where Hatshepsut's name *was* obliterated, it  was rarely replaced with her stepson-nephew's; more usually, the new name carved was that of her father, his grandfather, Thuthmosis I.\n\nAll of this suggests that the campaign was neither wildly aggressive, nor \"personal\". It seems unlikely to have been carried out on the orders of a man who had spent the 20 years of Hatshepsut's reign boiling with anger at being usurped. \n\nMost modern archaeological interpretations of Hatshepsut's reign, including those of Dorman, Tyldesley and Cooney, prefer instead to see the destruction of her name as a form of reassertion of what would have been seen as the the natural political and theological order - \"an impersonal attempt at retrospective political correctness\" (Tyldesley) aimed at stressing the male prerogative to rule. This would explain why Thuthmosis seems to have ordered the adoption of  distinctive artistic style in sculptures and paintings showing him – one that was very much a break from the old style that had existed in Hatshepsut's style, and which harked back, more importantly, to the styles adopted by his grandfather. Dorman argues that the key intention was to stress Thuthmosis III's royal lineage (and hence legitimacy) while removing signs of female disruption to the approved order, most probably because \"the recently invented phenomenon of a female king had created such conceptual and practical complications that the evidence of it was best erased.\"\n\nFor Cooney, meanwhile,\n\n&gt;\"the Egyptian system of political-religious power simply continued to work for the benefit of male dynasty. Hatshepsut’s kingship was a fantastic and unbelievable aberration. Ancient civilization didn’t suffer a woman to rule, no matter how much she conformed to religious and political systems; no matter how much she ascribed her rule to the will of the gods themselves; no matter how much she changed her womanly form into masculine ideals. Her rule was perceived as a complication by later rulers—praiseworthy yet blameworthy, conservatively pious and yet audaciously innovative—nuances that the two kings who ruled after her reconciled only through the destruction of her public monuments.\n\n**Sources**\n\nKara Cooney, *The Woman Who Would Be King: Hatshepsut's Rise to Power in Ancient Egypt* (Broadway Books, 2015)\n\nVanessa Davies, 'Hatshepsut's use of Tuthmosis III in Her Program of Legitimation,' *Journal of the American Research Center in Egypt* 41 (2004)\n\nPeter F. Dorman, 'The proscription of Hatshepsut,' in Roehrig, Dreyfus &amp; Keller, *Hatshepsut from Queen to Pharaoh* (Yale, 2005)\n\nJoyce Tyldesley, ['Hatshepsut and Tuthmosis: a royal feud?'](http://www.bbc.co.uk/history/ancient/egyptians/hatshepsut_01.shtml) BBC History, 2011", "edited": 1492177974.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is interesting, in this context, to consider how Hatshepsut portrayed herself over the course of her reign. Early statuary from her regency period clearly depicts a woman wearing male regalia,  breasts visible on a naked upper body. Later, after her coronation as pharaoh, depictions change; Hatshepsut is now portrayed as a man, with wider shoulders and no breasts. And she was buried as a man, as well, in a king&amp;#39;s sarcophagus. As Kara Cooney points out, this can be seen as a matter of convention, not deception; Hatshepsut never changed her - very clearly feminine - name, so it seems unlikely she was trying to pretend to be something she was not. Yet it is difficult to imagine that female rule was simply accepted without any question in the Egypt of her day; its consequences were too stark a departure from religiously-rooted norms. The problem here was one of political philosophy, not simply politics. But, as Cooney notes:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Given that the king on earth was nothing less than the human embodiment of the creator god’s potentiality, Hatshepsut must have been all too aware that her rule posed a serious existential problem: she could not populate a harem, spread her seed, and fill the royal nurseries with potential heirs; she could not claim to be the strong bull of Egypt. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Perhaps, then, it is better to see &amp;quot;male&amp;quot; images of Hatshepsut as nods to a conventional iconography that applied equally to &lt;em&gt;any&lt;/em&gt; Egyptian ruler, of whatever sex, than it is to imagine them as admissions of serious political weakness.&lt;/p&gt;\n\n&lt;p&gt;So, with all this said, we can turn at last to answering the question posed: why were Hatshepsut&amp;#39;s images destroyed after her death, and why was her name removed from so many of the monuments she made?&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s important, first, to recognise that the new regime was not a complete break with the past. Thuthmosis continued to employ a large proportion of the royal servants who had served his stepmother. And the desecration he ordered – which Cooney estimates accounted for &amp;quot;hundreds, if not thousands&amp;quot; of images and inscriptions – was not a campaign of attempted absolute obliteration, as the campaign against Akhenaten seems to have been. Not all of Hatshepsut&amp;#39;s statues were destroyed, and not all of her cartouches were hacked away; a significant number survived, not least those representing her as queen, including some that were quite prominently displayed on her tomb, which would surely have been a prime target for any Roman-style campaign of &lt;em&gt;damnatio memoriae&lt;/em&gt;. The same is true of the desecration that seems to have occurred to the monuments of her prime supporter, her steward Senenmut - whose name was removed from only 9 of his surviving 25 statues. Cooney summarises by saying that the statues that were removed or desecrated were those in public places – the aim, therefore, may have been to &amp;quot;prevent people from &lt;em&gt;seeing&lt;/em&gt; and &lt;em&gt;interacting&lt;/em&gt; with her as king.&amp;quot; The archaeological record, moreover, strongly suggests that the campaign did not begin immediately on Thuthmosis&amp;#39;s accession – Hatshepsut was buried with all honour, for one thing, and works underway at the time of her death were completed, which can only imply that her heir ordered work on them to continue. Something happened later to change this, something that Cooney concludes was probably a shift that took place in the mind of an ageing ruler considering his legacy.&lt;/p&gt;\n\n&lt;p&gt;Modern consensus is that the desecration of Hatshepsut&amp;#39;s monuments cannot have begun earlier than the 42nd year of Thuthmosis&amp;#39;s reign, which is 20 years after his aunt&amp;#39;s death. We also know that it continued into the reign of his son, Amenhotep II – to a period when few of those responsible would have had any memory of the female pharaoh. Finally, where Hatshepsut&amp;#39;s name &lt;em&gt;was&lt;/em&gt; obliterated, it  was rarely replaced with her stepson-nephew&amp;#39;s; more usually, the new name carved was that of her father, his grandfather, Thuthmosis I.&lt;/p&gt;\n\n&lt;p&gt;All of this suggests that the campaign was neither wildly aggressive, nor &amp;quot;personal&amp;quot;. It seems unlikely to have been carried out on the orders of a man who had spent the 20 years of Hatshepsut&amp;#39;s reign boiling with anger at being usurped. &lt;/p&gt;\n\n&lt;p&gt;Most modern archaeological interpretations of Hatshepsut&amp;#39;s reign, including those of Dorman, Tyldesley and Cooney, prefer instead to see the destruction of her name as a form of reassertion of what would have been seen as the the natural political and theological order - &amp;quot;an impersonal attempt at retrospective political correctness&amp;quot; (Tyldesley) aimed at stressing the male prerogative to rule. This would explain why Thuthmosis seems to have ordered the adoption of  distinctive artistic style in sculptures and paintings showing him – one that was very much a break from the old style that had existed in Hatshepsut&amp;#39;s style, and which harked back, more importantly, to the styles adopted by his grandfather. Dorman argues that the key intention was to stress Thuthmosis III&amp;#39;s royal lineage (and hence legitimacy) while removing signs of female disruption to the approved order, most probably because &amp;quot;the recently invented phenomenon of a female king had created such conceptual and practical complications that the evidence of it was best erased.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;For Cooney, meanwhile,&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;the Egyptian system of political-religious power simply continued to work for the benefit of male dynasty. Hatshepsut’s kingship was a fantastic and unbelievable aberration. Ancient civilization didn’t suffer a woman to rule, no matter how much she conformed to religious and political systems; no matter how much she ascribed her rule to the will of the gods themselves; no matter how much she changed her womanly form into masculine ideals. Her rule was perceived as a complication by later rulers—praiseworthy yet blameworthy, conservatively pious and yet audaciously innovative—nuances that the two kings who ruled after her reconciled only through the destruction of her public monuments.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;Sources&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Kara Cooney, &lt;em&gt;The Woman Who Would Be King: Hatshepsut&amp;#39;s Rise to Power in Ancient Egypt&lt;/em&gt; (Broadway Books, 2015)&lt;/p&gt;\n\n&lt;p&gt;Vanessa Davies, &amp;#39;Hatshepsut&amp;#39;s use of Tuthmosis III in Her Program of Legitimation,&amp;#39; &lt;em&gt;Journal of the American Research Center in Egypt&lt;/em&gt; 41 (2004)&lt;/p&gt;\n\n&lt;p&gt;Peter F. Dorman, &amp;#39;The proscription of Hatshepsut,&amp;#39; in Roehrig, Dreyfus &amp;amp; Keller, &lt;em&gt;Hatshepsut from Queen to Pharaoh&lt;/em&gt; (Yale, 2005)&lt;/p&gt;\n\n&lt;p&gt;Joyce Tyldesley, &lt;a href=\"http://www.bbc.co.uk/history/ancient/egyptians/hatshepsut_01.shtml\"&gt;&amp;#39;Hatshepsut and Tuthmosis: a royal feud?&amp;#39;&lt;/a&gt; BBC History, 2011&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7qeru", "score_hidden": false, "stickied": false, "created": 1492127169.0, "created_utc": 1492098369.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7qekp", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "mikedash", "parent_id": "t3_64y7bc", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "At its simplest, the answer to your question is that the destruction wrought on Hatshepsut's monuments and memory seems to have occurred explicitly because she was a women – for reasons that I will try to set out for you below. \n\nWe do need to be honest about the problem here: we have no histories, no chronicles from Hatshepsut's time (c.1507-1457 B.C.). The evidence we have is – bar a few late king lists – archaeological, and while it can tell us something of *what* happened during her reign as pharaoh, and after her death, it tells us little – directly at least – about *why* things happened as they did: why so many examples of her cartouche were shaved down and recut in order to ascribe them to some other pharaoh, and why elsewhere \"her entire figure and accompanying inscription were effected and replaced with the image of some innocuous ritual object such as an offering table.\" (Dorman) All answers are speculation; the distinction that we need to draw is that between informed and ill-informed guesswork. \n\nBut, with that said, the following is broadly agreed, by most Egyptologists, to be true: that Hatshepsut was a powerful member of the Egyptian royal family of the 18th dynasty, being the eldest daughter of one of Egypt's greatest warrior-kings, the pharaoh Thuthmosis I (her very name means 'Foremost of Noble Women'); that she was fortunate, in that her parents had no surviving male child, which eventually led her to move close to a position of power – as was commonly the case in ancient Egypt, she was married to a close relative, her half-brother, also Thuthmosis, the son of a high-ranking woman in the royal harem who eventually succeeded to the throne; and that she was also, very probably, ambitious, for when her husband died, leaving her to rule as regent for his infant heir by another woman from the royal harem – her step-son and nephew, the future Tuthmosis III – she was able to manouevre herself (in ways that have, unfortunately, left no clear traces in the archaeological record) into a position of absolute power. Hatshepsut the king's-woman (which is the literal translation of the ancient Egyptian word for 'queen' – rank in this period, even for a woman of Hatshepsut's lineage, was entirely the product of a husband's or a father's status) became Hatshepsut the pharaoh, ruling alone and portraying herself in masculine terms, most famously by overseeing the production of statues that showed hear sporting a full beard.\n\nIt's worth pausing briefly to look at the reign before we consider what happened to Hatshepsut's monuments and to her reputation after she died. One key point to make is that, while she was not actually the first woman to take absolute power in Egypt, she was the first one to do so in a time of peace; the only previous female pharaoh, Sobekneferu of the 12th dynasty (r. c.1800 B.C., at the tail end of the Middle Kingdom period), had taken power at a time of national crisis, and apparently out of necessity, there being no other senior royal males available to rule. Another is that Hatshepsut was apparently not, as she is sometimes portrayed, a ruler with a distinctively \"feminine\" agenda, preferring peace to war. It is true that one of the more notable achievements of her reign was a trading voyage to the land of Punt (far to the south, sometimes identified with modern Somalia), but Egypt did wage war – successfully – in Hatshepsut's time. This, together with her use of standard Egyptian iconography, and her entirely conventional determination to divert vast state resources to the construction of funerary monuments for herself (her magnificent mortuary temple, which survives, is one of the most iconic tourist attractions on the Nile) tend to argue that, whatever the reason for the post-mortem destruction that partially obliterated her name, it was not because she forced through policies or ordered actions that were outrageous or reviled. She was no Akhenaten – the 18th dynasty pharaoh notorious for neglecting the old gods in favour of a quasi-monotheistic new cult focused on the sun god, Aten, whose name was also wiped from Egyptian records after his death.\n\nIt is also very helpful to look at what we know of Hatshepsut's relationship with her stepson, Tuthmosis III, since it was in his reign that much of the destruction wrought on her monuments took place. Two points emerge most clearly here. The first is that there is no direct evidence that Hatshepsut ever did anything to suggest that Tuthmosis was not the rightful heir to the throne. Dating the monuments that survive, it would appear that she ruled in her stepson's stead, as regent, for at least two years before claiming power for herself; thereafter, Tuthmosis was not only allowed to live, but was actually given a solid training for taking power, being not only highly educated by the standards of the time, but also allowed to rise within the ranks of the Egyptian army until he became its commander-in-chief. \n\nIt seems inconceivable that the stepson would have been permitted a distinguished military career, and command over a powerful army, had Hatshepsut viewed him as a direct threat to her rule. Tuthmosis must have accepted – at least on some level - Hatshepsut's right to rule, and we have no evidence that he made any attempt to seize power or prepare any sort of coup while she was still alive. Similarly, it is almost impossible to believe that a woman, who long custom and Egyptian political philosophy alike conceived as having no divine right to rule, could have held onto power for 22 years without the active support of a large portion of the country's elite. There are other examples in Egyptian history of inconvenient heirs meeting suspicious ends, and of elites rising up against unpopular rulers; it has to be significant that neither of these things occurred during Hatshepsut's reign.\n\nSeveral alternatives have been advanced to explain how power may have been wielded during this period. We know that Hatshepsut made an effort to stress the legitimacy she had acquired via her royal parentage, emphasising not only that she was the rightful heir to a powerful king, but also divine, as the product of her father's union with a royal mother from the same family. In this sense, importantly, she was actually more \"royal\" than her half-brother and husband, who was the son of a much lower-status woman. We also know that Hatshepsut was depicted far more commonly than was her stepson, and nominal co-ruler, on monuments constructed during her regency and then reign; surveying her mortuary complex, Vanessa Davies counts 87 occurrences of Hatshepsut's name and figure, compared to 37 of Thuthmosis III. All this suggests that her efforts to portray herself as a worthy ruler, and as a divine monarch, were successful, and perhaps this best explains why she did not feel threatened by her stepson, and why she not only allowed him his army career, but also permitted him to be represented, during her reign, as a figure of considerable power and potency. Davies concludes that he \"was represented as a multi-faceted and powerful figure; thus one might infer that he actually behaved and functioned in this manner, or, at the very least, that Hatshepsut intended for him to be viewed in this light.\" \n\nSo while the Egyptian state may have expected and prefered to be ruled over by a male pharaoh, it seems there was no absolute proscription on female rule; it was highly unusual, but neither blasphemous nor \"impossible.\" Joyce Tyldesley concludes that \n\n&gt;Legally, there was no prohibition on a woman ruling Egypt. Although the ideal pharaoh was male - a handsome, athletic, brave, pious and wise male - it was recognised that occasionally a woman might need to act to preserve the dynastic line. When Sobeknofru ruled as king at the end of the troubled 12th Dynasty she was applauded as a national heroine. Mothers who deputised for their infant sons, and queens who substituted for husbands absent on the battlefield, were totally acceptable. What was never anticipated was that a regent would promote herself to a permanent position of power.\n\nYet this is not to say that Hatshepsut was not aware of the underlying weakness of her position. There are two points to make in this respect. First, let's hear again from Tyldesley:\n\n&gt;Morally Hatshepsut must have known that Tuthmosis was the rightful king. She had, after all, accepted him as such for the first two years of his reign. We must therefore deduce that something happened in year three to upset the status quo and to encourage her to take power. Unfortunately, Hatshepsut never apologises and never explains... Indeed, seen from her own point of view, her actions were entirely acceptable. She had not deposed her stepson, merely created an old fashioned co-regency, possibly in response to some national emergency. The co-regency, or joint reign, had been a feature of Middle Kingdom royal life, when an older king would associate himself with the more junior partner who would share the state rituals and learn his trade. As her intended successor, Tuthmosis had only to wait for his throne; no one could have foreseen that she would reign for over two decades.", "edited": 1492177802.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At its simplest, the answer to your question is that the destruction wrought on Hatshepsut&amp;#39;s monuments and memory seems to have occurred explicitly because she was a women – for reasons that I will try to set out for you below. &lt;/p&gt;\n\n&lt;p&gt;We do need to be honest about the problem here: we have no histories, no chronicles from Hatshepsut&amp;#39;s time (c.1507-1457 B.C.). The evidence we have is – bar a few late king lists – archaeological, and while it can tell us something of &lt;em&gt;what&lt;/em&gt; happened during her reign as pharaoh, and after her death, it tells us little – directly at least – about &lt;em&gt;why&lt;/em&gt; things happened as they did: why so many examples of her cartouche were shaved down and recut in order to ascribe them to some other pharaoh, and why elsewhere &amp;quot;her entire figure and accompanying inscription were effected and replaced with the image of some innocuous ritual object such as an offering table.&amp;quot; (Dorman) All answers are speculation; the distinction that we need to draw is that between informed and ill-informed guesswork. &lt;/p&gt;\n\n&lt;p&gt;But, with that said, the following is broadly agreed, by most Egyptologists, to be true: that Hatshepsut was a powerful member of the Egyptian royal family of the 18th dynasty, being the eldest daughter of one of Egypt&amp;#39;s greatest warrior-kings, the pharaoh Thuthmosis I (her very name means &amp;#39;Foremost of Noble Women&amp;#39;); that she was fortunate, in that her parents had no surviving male child, which eventually led her to move close to a position of power – as was commonly the case in ancient Egypt, she was married to a close relative, her half-brother, also Thuthmosis, the son of a high-ranking woman in the royal harem who eventually succeeded to the throne; and that she was also, very probably, ambitious, for when her husband died, leaving her to rule as regent for his infant heir by another woman from the royal harem – her step-son and nephew, the future Tuthmosis III – she was able to manouevre herself (in ways that have, unfortunately, left no clear traces in the archaeological record) into a position of absolute power. Hatshepsut the king&amp;#39;s-woman (which is the literal translation of the ancient Egyptian word for &amp;#39;queen&amp;#39; – rank in this period, even for a woman of Hatshepsut&amp;#39;s lineage, was entirely the product of a husband&amp;#39;s or a father&amp;#39;s status) became Hatshepsut the pharaoh, ruling alone and portraying herself in masculine terms, most famously by overseeing the production of statues that showed hear sporting a full beard.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s worth pausing briefly to look at the reign before we consider what happened to Hatshepsut&amp;#39;s monuments and to her reputation after she died. One key point to make is that, while she was not actually the first woman to take absolute power in Egypt, she was the first one to do so in a time of peace; the only previous female pharaoh, Sobekneferu of the 12th dynasty (r. c.1800 B.C., at the tail end of the Middle Kingdom period), had taken power at a time of national crisis, and apparently out of necessity, there being no other senior royal males available to rule. Another is that Hatshepsut was apparently not, as she is sometimes portrayed, a ruler with a distinctively &amp;quot;feminine&amp;quot; agenda, preferring peace to war. It is true that one of the more notable achievements of her reign was a trading voyage to the land of Punt (far to the south, sometimes identified with modern Somalia), but Egypt did wage war – successfully – in Hatshepsut&amp;#39;s time. This, together with her use of standard Egyptian iconography, and her entirely conventional determination to divert vast state resources to the construction of funerary monuments for herself (her magnificent mortuary temple, which survives, is one of the most iconic tourist attractions on the Nile) tend to argue that, whatever the reason for the post-mortem destruction that partially obliterated her name, it was not because she forced through policies or ordered actions that were outrageous or reviled. She was no Akhenaten – the 18th dynasty pharaoh notorious for neglecting the old gods in favour of a quasi-monotheistic new cult focused on the sun god, Aten, whose name was also wiped from Egyptian records after his death.&lt;/p&gt;\n\n&lt;p&gt;It is also very helpful to look at what we know of Hatshepsut&amp;#39;s relationship with her stepson, Tuthmosis III, since it was in his reign that much of the destruction wrought on her monuments took place. Two points emerge most clearly here. The first is that there is no direct evidence that Hatshepsut ever did anything to suggest that Tuthmosis was not the rightful heir to the throne. Dating the monuments that survive, it would appear that she ruled in her stepson&amp;#39;s stead, as regent, for at least two years before claiming power for herself; thereafter, Tuthmosis was not only allowed to live, but was actually given a solid training for taking power, being not only highly educated by the standards of the time, but also allowed to rise within the ranks of the Egyptian army until he became its commander-in-chief. &lt;/p&gt;\n\n&lt;p&gt;It seems inconceivable that the stepson would have been permitted a distinguished military career, and command over a powerful army, had Hatshepsut viewed him as a direct threat to her rule. Tuthmosis must have accepted – at least on some level - Hatshepsut&amp;#39;s right to rule, and we have no evidence that he made any attempt to seize power or prepare any sort of coup while she was still alive. Similarly, it is almost impossible to believe that a woman, who long custom and Egyptian political philosophy alike conceived as having no divine right to rule, could have held onto power for 22 years without the active support of a large portion of the country&amp;#39;s elite. There are other examples in Egyptian history of inconvenient heirs meeting suspicious ends, and of elites rising up against unpopular rulers; it has to be significant that neither of these things occurred during Hatshepsut&amp;#39;s reign.&lt;/p&gt;\n\n&lt;p&gt;Several alternatives have been advanced to explain how power may have been wielded during this period. We know that Hatshepsut made an effort to stress the legitimacy she had acquired via her royal parentage, emphasising not only that she was the rightful heir to a powerful king, but also divine, as the product of her father&amp;#39;s union with a royal mother from the same family. In this sense, importantly, she was actually more &amp;quot;royal&amp;quot; than her half-brother and husband, who was the son of a much lower-status woman. We also know that Hatshepsut was depicted far more commonly than was her stepson, and nominal co-ruler, on monuments constructed during her regency and then reign; surveying her mortuary complex, Vanessa Davies counts 87 occurrences of Hatshepsut&amp;#39;s name and figure, compared to 37 of Thuthmosis III. All this suggests that her efforts to portray herself as a worthy ruler, and as a divine monarch, were successful, and perhaps this best explains why she did not feel threatened by her stepson, and why she not only allowed him his army career, but also permitted him to be represented, during her reign, as a figure of considerable power and potency. Davies concludes that he &amp;quot;was represented as a multi-faceted and powerful figure; thus one might infer that he actually behaved and functioned in this manner, or, at the very least, that Hatshepsut intended for him to be viewed in this light.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;So while the Egyptian state may have expected and prefered to be ruled over by a male pharaoh, it seems there was no absolute proscription on female rule; it was highly unusual, but neither blasphemous nor &amp;quot;impossible.&amp;quot; Joyce Tyldesley concludes that &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Legally, there was no prohibition on a woman ruling Egypt. Although the ideal pharaoh was male - a handsome, athletic, brave, pious and wise male - it was recognised that occasionally a woman might need to act to preserve the dynastic line. When Sobeknofru ruled as king at the end of the troubled 12th Dynasty she was applauded as a national heroine. Mothers who deputised for their infant sons, and queens who substituted for husbands absent on the battlefield, were totally acceptable. What was never anticipated was that a regent would promote herself to a permanent position of power.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yet this is not to say that Hatshepsut was not aware of the underlying weakness of her position. There are two points to make in this respect. First, let&amp;#39;s hear again from Tyldesley:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Morally Hatshepsut must have known that Tuthmosis was the rightful king. She had, after all, accepted him as such for the first two years of his reign. We must therefore deduce that something happened in year three to upset the status quo and to encourage her to take power. Unfortunately, Hatshepsut never apologises and never explains... Indeed, seen from her own point of view, her actions were entirely acceptable. She had not deposed her stepson, merely created an old fashioned co-regency, possibly in response to some national emergency. The co-regency, or joint reign, had been a feature of Middle Kingdom royal life, when an older king would associate himself with the more junior partner who would share the state rituals and learn his trade. As her intended successor, Tuthmosis had only to wait for his throne; no one could have foreseen that she would reign for over two decades.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7qekp", "score_hidden": false, "stickied": false, "created": 1492127163.0, "created_utc": 1492098363.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64y7bc", "likes": null, "replies": "", "user_reports": [], "id": "dg69ddv", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64y7bc", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg69ddv", "score_hidden": false, "stickied": false, "created": 1492048695.0, "created_utc": 1492019895.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64y7bc", "likes": null, "replies": "", "user_reports": [], "id": "dg64xji", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64y7bc", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 1, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg64xji", "score_hidden": false, "stickied": false, "created": 1492044194.0, "created_utc": 1492015394.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -6}}], "after": null, "before": null}}]