[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64yd0b", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1577, "report_reasons": null, "author": "Lacturu", "saved": false, "mod_reports": [], "name": "t3_64yd0b", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/64yd0b/in_the_foreword_to_the_gulag_archipleago_anne/", "num_reports": null, "locked": false, "stickied": false, "created": 1492034922.0, "url": "https://www.reddit.com/r/AskHistorians/comments/64yd0b/in_the_foreword_to_the_gulag_archipleago_anne/", "author_flair_text": null, "quarantine": false, "title": "In the foreword to The Gulag Archipleago, Anne Applebaum writes \"In France, it is no exaggeration to say that the book effectively ended the long-standing French intellectual flirtation with Soviet communism.\" How accurate is this statement?", "created_utc": 1492006122.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 30, "visited": false, "subreddit_type": "public", "ups": 1577}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": "", "user_reports": [], "id": "dg6pirk", "gilded": 0, "archived": false, "score": 69, "report_reasons": null, "author": "michaelnoir", "parent_id": "t1_dg6nhze", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "For that you need look no further than the history of the Situationist International, formed in 1957 in the aftermath of the Hungarian Revolution, and taking as their ideal form the workers' councils evidenced in Budapest at that time. \n\nThe idea of the worker's councils was related to the historical examples of council communism and informed the student movement of the 1960's, reaching its peak in the events of May 1968. \n\nA quote from Enragés et situationnistes dans le mouvement des occupations (Paris: Gallimard, 1968) by René Viénet: \"The Stalinists, ideologues of the bureaucratic totalitarian form of exploitation, were reduced in France, as elsewhere, to a purely conservative role. For a long time it had been impossible for them to take power, and the international dislocation of the bureaucratic monolith, which is necessarily their frame of reference, had closed this road to them forever. At the same time, that frame of reference, and the practice it entails, made their return to a purely bourgeois reformist apparatus equally impossible. The Maoist variation, reproducing as illusion the ascendant period of Stalinism by the religious contemplation of a revolutionary orient of fantasy, parroted their translations in a perfect vacuum. The three or four Trotskyite sects fought bitterly amongst themselves for the glory of beginning the revolution of 1917 again, as soon as they had succeeded in reconstituting the appropriate party. These \"resuscitated Bolsheviks\" were too fanatical about the revolutionary past and its worst errors even to look at modern conditions. Some of them mixed this historical exoticism with the geographic exoticism of a more or less Guevarist revolution of underdevelopment. If any of them picked up a militant from time to time this was in no way the result of the truth of their analyses or actions, but simply of the decomposition of the so-called communist bureaucracies.\n\nAs for the modernist pseudo-thinkers of the critique of details, these leftovers of militancy who had established themselves in the so-called Humanities Departments and who were thinking for all the weekly magazines, it's obvious they were incapable of understanding — let alone foreseeing — anything whatsoever, eclectically weighed down as they were with almost every aspect of the old world's camouflages. They found themselves too attached to the bourgeois state, to an exhausted Stalinism, to a revitalized Castro-Bolshevism, to psycho-sociology, and even to their own miserable lives. They respected everything. They lied about everything. And we find them around today, still ready to explain everything to us!\"\n\nRemember of course, that \"the Left\" is not one homogeneous mass but, then as now, is a diverse tendency in political and social affairs, with an authoritarian and libertarian wing as well as a more liberal and more conservative element. It is also plagued by sectarianism and dissension which made reactions to Hungary differ by tendency. \n\nThere are certainly very enthusiastic books written about the Hungarian Revolution by those on the libertarian left, like Andy Anderson's [\"Hungary 56\"](https://libcom.org/library/hungary-56-andy-anderson). For the anarchists, the Hungarian Revolution is almost the most important thing to happen in Europe since the Spanish Revolution 20 years before. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For that you need look no further than the history of the Situationist International, formed in 1957 in the aftermath of the Hungarian Revolution, and taking as their ideal form the workers&amp;#39; councils evidenced in Budapest at that time. &lt;/p&gt;\n\n&lt;p&gt;The idea of the worker&amp;#39;s councils was related to the historical examples of council communism and informed the student movement of the 1960&amp;#39;s, reaching its peak in the events of May 1968. &lt;/p&gt;\n\n&lt;p&gt;A quote from Enragés et situationnistes dans le mouvement des occupations (Paris: Gallimard, 1968) by René Viénet: &amp;quot;The Stalinists, ideologues of the bureaucratic totalitarian form of exploitation, were reduced in France, as elsewhere, to a purely conservative role. For a long time it had been impossible for them to take power, and the international dislocation of the bureaucratic monolith, which is necessarily their frame of reference, had closed this road to them forever. At the same time, that frame of reference, and the practice it entails, made their return to a purely bourgeois reformist apparatus equally impossible. The Maoist variation, reproducing as illusion the ascendant period of Stalinism by the religious contemplation of a revolutionary orient of fantasy, parroted their translations in a perfect vacuum. The three or four Trotskyite sects fought bitterly amongst themselves for the glory of beginning the revolution of 1917 again, as soon as they had succeeded in reconstituting the appropriate party. These &amp;quot;resuscitated Bolsheviks&amp;quot; were too fanatical about the revolutionary past and its worst errors even to look at modern conditions. Some of them mixed this historical exoticism with the geographic exoticism of a more or less Guevarist revolution of underdevelopment. If any of them picked up a militant from time to time this was in no way the result of the truth of their analyses or actions, but simply of the decomposition of the so-called communist bureaucracies.&lt;/p&gt;\n\n&lt;p&gt;As for the modernist pseudo-thinkers of the critique of details, these leftovers of militancy who had established themselves in the so-called Humanities Departments and who were thinking for all the weekly magazines, it&amp;#39;s obvious they were incapable of understanding — let alone foreseeing — anything whatsoever, eclectically weighed down as they were with almost every aspect of the old world&amp;#39;s camouflages. They found themselves too attached to the bourgeois state, to an exhausted Stalinism, to a revitalized Castro-Bolshevism, to psycho-sociology, and even to their own miserable lives. They respected everything. They lied about everything. And we find them around today, still ready to explain everything to us!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Remember of course, that &amp;quot;the Left&amp;quot; is not one homogeneous mass but, then as now, is a diverse tendency in political and social affairs, with an authoritarian and libertarian wing as well as a more liberal and more conservative element. It is also plagued by sectarianism and dissension which made reactions to Hungary differ by tendency. &lt;/p&gt;\n\n&lt;p&gt;There are certainly very enthusiastic books written about the Hungarian Revolution by those on the libertarian left, like Andy Anderson&amp;#39;s &lt;a href=\"https://libcom.org/library/hungary-56-andy-anderson\"&gt;&amp;quot;Hungary 56&amp;quot;&lt;/a&gt;. For the anarchists, the Hungarian Revolution is almost the most important thing to happen in Europe since the Spanish Revolution 20 years before. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6pirk", "score_hidden": false, "stickied": false, "created": 1492066343.0, "created_utc": 1492037543.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 69}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": "", "user_reports": [], "id": "dg6u1eg", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "chocolatepot", "parent_id": "t1_dg6p27d", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Please understand that people come here because they want an informed response from someone capable of engaging with the sources, and providing follow up information. Wikipedia is a great tool, but we don't allow a link or quote to make up the entirety or majority of a response. You can find further discussion of this policy [here](https://www.reddit.com/r/AskHistorians/comments/3yjz53/rules_roundtable_2_explaining_the_rules_regarding/).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please understand that people come here because they want an informed response from someone capable of engaging with the sources, and providing follow up information. Wikipedia is a great tool, but we don&amp;#39;t allow a link or quote to make up the entirety or majority of a response. You can find further discussion of this policy &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/3yjz53/rules_roundtable_2_explaining_the_rules_regarding/\"&gt;here&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6u1eg", "score_hidden": false, "stickied": false, "created": 1492071944.0, "created_utc": 1492043144.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6p27d", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg6nhze", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[removed]", "edited": 1492041687.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6p27d", "score_hidden": false, "stickied": false, "created": 1492065780.0, "created_utc": 1492036980.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6nhze", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "zorba1994", "parent_id": "t1_dg6kvi2", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "&gt;After the Hungarian Revolution of 1956, and the Prague Spring of 1968, the lesson that the Soviet Union was behaving like an imperial power was fully absorbed into the European left, even among those who hadn't previously learned this lesson in the 1930's or before.\n\nCan you provide any sources that support the interpretation that the USSR's response to the Hungarian revolution considerably incited the French (or general European) Left's distancing from the USSR? It was previously my understanding that it was much more the repression of the 1968 Prague Spring that caused this, as the 1956 intervention was seen by many on the Left as being at least partially justified in response to mob violence and the persecution of Jews and other minorities alongside communists by the forces of the uprising.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;After the Hungarian Revolution of 1956, and the Prague Spring of 1968, the lesson that the Soviet Union was behaving like an imperial power was fully absorbed into the European left, even among those who hadn&amp;#39;t previously learned this lesson in the 1930&amp;#39;s or before.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Can you provide any sources that support the interpretation that the USSR&amp;#39;s response to the Hungarian revolution considerably incited the French (or general European) Left&amp;#39;s distancing from the USSR? It was previously my understanding that it was much more the repression of the 1968 Prague Spring that caused this, as the 1956 intervention was seen by many on the Left as being at least partially justified in response to mob violence and the persecution of Jews and other minorities alongside communists by the forces of the uprising.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6nhze", "score_hidden": false, "stickied": false, "created": 1492063839.0, "created_utc": 1492035039.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": "", "user_reports": [], "id": "dg7dwdt", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "michaelnoir", "parent_id": "t1_dg7c0um", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Probably I didn't make it clear enough. \"Critical theory\" is Marxist in origin. Marx and Engels and Trotsky and Gramsci all have something to say about culture, and so do the Frankfurt School. \n\nBut the postmodern branch of critical theory has little or no connection to the old Marxist theory, which is modernist rather than post-modernist, except insofar as almost everyone has been influenced by Marx. \n\nThis distinction is incredibly important to emphasize because \"cultural Marxism\" has now become a meme on the right to criticize tendencies which would be better laid at the door of post-modernism, like identity politics and social constructionism. This has become wedded to traditional American anti-Communism and dog-whistle anti-Semitism, since the Frankfurt School were Jews. But the connection with the Frankfurt School is a pretty spurious one. \n\nThe much-touted concept of \"intersectionality\", for instance, was invented by somebody called Kimberlé Crenshaw, who seems to be a post-modernist rather than a socialist. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Probably I didn&amp;#39;t make it clear enough. &amp;quot;Critical theory&amp;quot; is Marxist in origin. Marx and Engels and Trotsky and Gramsci all have something to say about culture, and so do the Frankfurt School. &lt;/p&gt;\n\n&lt;p&gt;But the postmodern branch of critical theory has little or no connection to the old Marxist theory, which is modernist rather than post-modernist, except insofar as almost everyone has been influenced by Marx. &lt;/p&gt;\n\n&lt;p&gt;This distinction is incredibly important to emphasize because &amp;quot;cultural Marxism&amp;quot; has now become a meme on the right to criticize tendencies which would be better laid at the door of post-modernism, like identity politics and social constructionism. This has become wedded to traditional American anti-Communism and dog-whistle anti-Semitism, since the Frankfurt School were Jews. But the connection with the Frankfurt School is a pretty spurious one. &lt;/p&gt;\n\n&lt;p&gt;The much-touted concept of &amp;quot;intersectionality&amp;quot;, for instance, was invented by somebody called Kimberlé Crenshaw, who seems to be a post-modernist rather than a socialist. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7dwdt", "score_hidden": false, "stickied": false, "created": 1492108451.0, "created_utc": 1492079651.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": "", "user_reports": [], "id": "dg7j7b2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "magnusbe", "parent_id": "t1_dg7dl6r", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "OK, I asked because I found it very interesting that the class used \"Cultural Marxism\" as a term. That term is mostly used as a pejorative or as part of conspiracy theories about the Frankfurt School. So I was wondering what kind of text book or syllabus used the term \"Cultural Marxism\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OK, I asked because I found it very interesting that the class used &amp;quot;Cultural Marxism&amp;quot; as a term. That term is mostly used as a pejorative or as part of conspiracy theories about the Frankfurt School. So I was wondering what kind of text book or syllabus used the term &amp;quot;Cultural Marxism&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7j7b2", "score_hidden": false, "stickied": false, "created": 1492118713.0, "created_utc": 1492089913.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7dl6r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "E-Squid", "parent_id": "t1_dg7ckjm", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "My university doesn't have classes designated as core classes or universal requirements and instead has this series of \"universities studies\" classes that are designed to cover and introduce students to a broad range of topics. The specific class in question was labeled \"Popular Culture\" or something simple like that, and examined popular culture through different lenses, namely that of critical theory.\n\nAs a side note, I don't think anyone in the college likes the university studies classes; not one single person I've taken those classes with looked like they wanted to be there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My university doesn&amp;#39;t have classes designated as core classes or universal requirements and instead has this series of &amp;quot;universities studies&amp;quot; classes that are designed to cover and introduce students to a broad range of topics. The specific class in question was labeled &amp;quot;Popular Culture&amp;quot; or something simple like that, and examined popular culture through different lenses, namely that of critical theory.&lt;/p&gt;\n\n&lt;p&gt;As a side note, I don&amp;#39;t think anyone in the college likes the university studies classes; not one single person I&amp;#39;ve taken those classes with looked like they wanted to be there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7dl6r", "score_hidden": false, "stickied": false, "created": 1492107536.0, "created_utc": 1492078736.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ckjm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "magnusbe", "parent_id": "t1_dg7c0um", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "What class was that?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What class was that?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7ckjm", "score_hidden": false, "stickied": false, "created": 1492104449.0, "created_utc": 1492075649.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7c0um", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "E-Squid", "parent_id": "t1_dg6ovx0", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Is there some sort of concept that reconciles the two? A few years ago I was required to take a class for university that introduced me to \"cultural Marxism\" which seemed to encompass both critical theory and (I assume) Marxism.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is there some sort of concept that reconciles the two? A few years ago I was required to take a class for university that introduced me to &amp;quot;cultural Marxism&amp;quot; which seemed to encompass both critical theory and (I assume) Marxism.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7c0um", "score_hidden": false, "stickied": false, "created": 1492102770.0, "created_utc": 1492073970.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": "", "user_reports": [], "id": "dg7dy15", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "michaelnoir", "parent_id": "t1_dg75r68", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "My personal favourite is a book by Francis Wheen which was published probably about ten years ago, which is called \"How Mumbo-Jumbo Took Over The World\". Good chapters on irrationalism, post-modernism, and the whole challenge to the Enlightenment discourse generally, and a good defence of Enlightenment values. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My personal favourite is a book by Francis Wheen which was published probably about ten years ago, which is called &amp;quot;How Mumbo-Jumbo Took Over The World&amp;quot;. Good chapters on irrationalism, post-modernism, and the whole challenge to the Enlightenment discourse generally, and a good defence of Enlightenment values. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7dy15", "score_hidden": false, "stickied": false, "created": 1492108583.0, "created_utc": 1492079783.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg75r68", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Warbird36", "parent_id": "t1_dg6ovx0", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Do you have any recommendations on good reading for criticism of post-modernism/critical race theory? Really curious about this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have any recommendations on good reading for criticism of post-modernism/critical race theory? Really curious about this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg75r68", "score_hidden": false, "stickied": false, "created": 1492087510.0, "created_utc": 1492058710.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ovx0", "gilded": 0, "archived": false, "score": 42, "report_reasons": null, "author": "michaelnoir", "parent_id": "t1_dg6nt71", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Well by that I mean \"critical theory\", which, as the name suggests, is a critical look at culture from a left point of view, influenced by the Frankfurt School but also with its counterpart among the post-modernists like Foucault et al. In the United States in the 1980's the post-modern strain of critical theory was very popular in the comparative literature departments of universities and was soon adapted for local purposes, and was applied to politics and social phenomena very widely (as, for instance, in \"critical race theory\"). Hence the emphasis in a lot of modern scholarship on critiques of media representation, diversity, and so on. \n\nIt should be emphasized always that post-modernism and Marxism are two different and opposed tendencies, however. If post-modernism is a incredulity toward meta-narratives, then Marxism is just the kind of meta-narrative that post-modernism is incredulous about. Marx is dialectics, class. Post-modernism is \"discontinuity\", identity, eclecticism.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well by that I mean &amp;quot;critical theory&amp;quot;, which, as the name suggests, is a critical look at culture from a left point of view, influenced by the Frankfurt School but also with its counterpart among the post-modernists like Foucault et al. In the United States in the 1980&amp;#39;s the post-modern strain of critical theory was very popular in the comparative literature departments of universities and was soon adapted for local purposes, and was applied to politics and social phenomena very widely (as, for instance, in &amp;quot;critical race theory&amp;quot;). Hence the emphasis in a lot of modern scholarship on critiques of media representation, diversity, and so on. &lt;/p&gt;\n\n&lt;p&gt;It should be emphasized always that post-modernism and Marxism are two different and opposed tendencies, however. If post-modernism is a incredulity toward meta-narratives, then Marxism is just the kind of meta-narrative that post-modernism is incredulous about. Marx is dialectics, class. Post-modernism is &amp;quot;discontinuity&amp;quot;, identity, eclecticism.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6ovx0", "score_hidden": false, "stickied": false, "created": 1492065569.0, "created_utc": 1492036769.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 42}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6nt71", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "IamaspyAMNothing", "parent_id": "t1_dg6kvi2", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "&gt;tends to mitigate against political action in favour of theory and a field called \"criticism\".\n\nWhat exactly is the field of criticism?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;tends to mitigate against political action in favour of theory and a field called &amp;quot;criticism&amp;quot;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What exactly is the field of criticism?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6nt71", "score_hidden": false, "stickied": false, "created": 1492064232.0, "created_utc": 1492035432.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": "", "user_reports": [], "id": "dg6of5q", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "michaelnoir", "parent_id": "t1_dg6n22r", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Well, Michael Scott Christofferson in his book \"French Intellectuals Against the Left: The Antitotalitarian Moment of the 1970s\" has a chapter on the effect of the Gulag Archipelago where he emphasises that its revelations were not really new, but simply a reaffirmation or elaboration of something already known, as I say above. \n\nThe controversy appears to have arisen more from the politics and personality of Solzhenitsyn himself, and a reaction to them from the Parti communiste français (PCF). \n\nSo perhaps it's more accurate to say that the book and its attendant controversy built on already established anti-totalitarian tendencies which were inescapable on the left at that time, and became significant in destroying some of the last lingering Soviet mystique, complicated by the equivocal figure of Solzhenitsyn himself, who is a difficult person to place politically. \n\nInteresting chapter about all this [here](https://books.google.co.uk/books?id=3_AnSRKEak8C&amp;pg=PA89&amp;lpg=PA89&amp;dq=the+gulag+as+a+metaphor+france&amp;source=bl&amp;ots=VaIvnHGkw9&amp;sig=7y1tEcDpbbjX4FclmS1MmyT-z1A&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwj8tvbm-5_TAhUMI8AKHd3CDvwQ6AEILDAC#v=onepage&amp;q=the%20gulag%20as%20a%20metaphor%20france&amp;f=false).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, Michael Scott Christofferson in his book &amp;quot;French Intellectuals Against the Left: The Antitotalitarian Moment of the 1970s&amp;quot; has a chapter on the effect of the Gulag Archipelago where he emphasises that its revelations were not really new, but simply a reaffirmation or elaboration of something already known, as I say above. &lt;/p&gt;\n\n&lt;p&gt;The controversy appears to have arisen more from the politics and personality of Solzhenitsyn himself, and a reaction to them from the Parti communiste français (PCF). &lt;/p&gt;\n\n&lt;p&gt;So perhaps it&amp;#39;s more accurate to say that the book and its attendant controversy built on already established anti-totalitarian tendencies which were inescapable on the left at that time, and became significant in destroying some of the last lingering Soviet mystique, complicated by the equivocal figure of Solzhenitsyn himself, who is a difficult person to place politically. &lt;/p&gt;\n\n&lt;p&gt;Interesting chapter about all this &lt;a href=\"https://books.google.co.uk/books?id=3_AnSRKEak8C&amp;amp;pg=PA89&amp;amp;lpg=PA89&amp;amp;dq=the+gulag+as+a+metaphor+france&amp;amp;source=bl&amp;amp;ots=VaIvnHGkw9&amp;amp;sig=7y1tEcDpbbjX4FclmS1MmyT-z1A&amp;amp;hl=en&amp;amp;sa=X&amp;amp;ved=0ahUKEwj8tvbm-5_TAhUMI8AKHd3CDvwQ6AEILDAC#v=onepage&amp;amp;q=the%20gulag%20as%20a%20metaphor%20france&amp;amp;f=false\"&gt;here&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6of5q", "score_hidden": false, "stickied": false, "created": 1492064997.0, "created_utc": 1492036197.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6n22r", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "kagantx", "parent_id": "t1_dg6kvi2", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Could you describe the effect of the book on French perceptions? You talk about other strands of thought that undermined their flirtation with Soviet communism, but what effect did the book have?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could you describe the effect of the book on French perceptions? You talk about other strands of thought that undermined their flirtation with Soviet communism, but what effect did the book have?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6n22r", "score_hidden": false, "stickied": false, "created": 1492063284.0, "created_utc": 1492034484.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": "", "user_reports": [], "id": "dg6sbtt", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "TrotBot", "parent_id": "t1_dg6kvi2", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "The fact that the Communist party did not take power in May 1968 in France, as De Gaulle believed would happen, further contributed to their decline.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The fact that the Communist party did not take power in May 1968 in France, as De Gaulle believed would happen, further contributed to their decline.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6sbtt", "score_hidden": false, "stickied": false, "created": 1492069816.0, "created_utc": 1492041016.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": "", "user_reports": [], "id": "dg7rf6c", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Johannes_P", "parent_id": "t1_dg6kvi2", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "&gt; By 1956, when the Soviets invaded Hungary, and especially by 1968 when they invaded Prague, it was extremely difficult to sustain belief in the efficacy of the Soviet system of communism on the European left. \n\nAfter the WWII, the P.C.F. (*Parti communiste français*, or French Communist Party) benefited from a great prestige due to Stalingrad and the *Résistance*; several artists and scholars took their membership card, along with former freedom fighters who wanted to keep contact with their fighting comrades.\nThe P.C.F. had a great influence on the progressive milieu, and notably the *philocommunistes*, fellow travellers often members of front or allied organisation such as the *Comité national des écrivains* (Writers' National Commitee, C.N.E.) who saw in the Soviet Union as the harbringer of a more just society.\n\nThese intelectuals interviened to promote ths Soviet Union, such as when Jean-Paul Sartre said the Soviet living standard rose so quickly it would be in 1965 40% higher than France's.\nThey also defenced the U.S.S.R. against accusation of human right violations, such as when they attacked the defector Kravchenko, with Pierre  Daix saying the camps were \"the U.S.S.R.'s pride.\" Some justified repression as a necessary step in the building of socialism.\n\nOn the other hand, others, revendicating a more classical liberal heritage, had anti-Communist leanings; for exemple, the revue *Preuves*, created on 1951 in Paris by German and Swiss thinkers, had Raymond Aron, François Bondy, Arthur Koestler, Thierry Maulnier, Denis de Rougemont, David Rousset, Boris Souvarine and Manès Sperber as collaborators. Funded by Congress for Cultural Freedom, the targeted public was the progressist intellectuals. Albert Camus severed links with Sartre on the question of Stalinism.\n\nEvents such as Tito being denounced by Moscow on 1948 and then reconciliating with Moscow, albeit staying independent, or the Doctors' Plot (French Communist doctors signed peritions against them, before they were rehabilited) tested the fidelity to Moscow of several Communists; even then, the P.C.F. successfully managed to cover away the 1953 East Berlin revolts with the Rosenberg campaign.\n\nThe death of Stalin, along with the release of the Khrushchev report, made some *philocommunistes* hope for a liberalisation in the U.S.S.R., although others asked why the excuses were limited to crimes against fellow C.P.S.U. members and the fact some perpretators stayed in charge and an important member, Aimé Césaire, left the Party over Stalin's crimes.\n\nThen came Budapest: the P.C.F. took the Kremlin interpretation on the events, that is, this revolt was caused by the fascists, the Catholic Church and the \"feodals\" to reestablish Admiral Horthy as leader.\nAs a reaction Jean-Paul Sartre, Claude Roy, Jacques-Francis Rolland, Roger Vailland, Claude Morgan and Jacques Prévert protested in *Le Monde* against the Soviet intervention and Louis Aragon, Elsa Triolet, Maurice Druon, Stanislas Fumet, Jacques Madaule, Claude Morgan et Jean-Paul Sartre asked Kadar to guarantee the life and the liberty of inprisoned intelectuals. Ten communist intellectuals (the *Dix*) sent a public letter to the direction, and some were explled or received a blame.\n\nOne of the first to leave was Emmanuel Le Roy Ladurie; other followed, such as Alain Besançon, François Furet, Annie Kriegel, Jean Bouvier, Michelle Perrot, Denis Richet and Jean Poperen.\nAmong the fellow travellers, the C.N.E. lost its head Vercoes and several others followed such as Stanislas Fumet, Louis Martin-Chauffier, Gérard and Anne Philipe, Yves Montand and Simone Signoret.\n\nSource:\n\n* [*Les intellectuels français et l’insurrection hongroise de 1956*](http://est-et-ouest.fr/revue/HL028_articles/028_007.pdf)  (fall 2006) by Florence Grandsenne\n* [\"Les évènements de Hongrie\"](http://archives.mrap.fr/images/4/4e/Dl56_159opt.pdf), *Droit et Liberté*, November 1956, p. 6\n\nEDIT: Fixed list formatting.", "edited": 1492103853.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;By 1956, when the Soviets invaded Hungary, and especially by 1968 when they invaded Prague, it was extremely difficult to sustain belief in the efficacy of the Soviet system of communism on the European left. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;After the WWII, the P.C.F. (&lt;em&gt;Parti communiste français&lt;/em&gt;, or French Communist Party) benefited from a great prestige due to Stalingrad and the &lt;em&gt;Résistance&lt;/em&gt;; several artists and scholars took their membership card, along with former freedom fighters who wanted to keep contact with their fighting comrades.\nThe P.C.F. had a great influence on the progressive milieu, and notably the &lt;em&gt;philocommunistes&lt;/em&gt;, fellow travellers often members of front or allied organisation such as the &lt;em&gt;Comité national des écrivains&lt;/em&gt; (Writers&amp;#39; National Commitee, C.N.E.) who saw in the Soviet Union as the harbringer of a more just society.&lt;/p&gt;\n\n&lt;p&gt;These intelectuals interviened to promote ths Soviet Union, such as when Jean-Paul Sartre said the Soviet living standard rose so quickly it would be in 1965 40% higher than France&amp;#39;s.\nThey also defenced the U.S.S.R. against accusation of human right violations, such as when they attacked the defector Kravchenko, with Pierre  Daix saying the camps were &amp;quot;the U.S.S.R.&amp;#39;s pride.&amp;quot; Some justified repression as a necessary step in the building of socialism.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, others, revendicating a more classical liberal heritage, had anti-Communist leanings; for exemple, the revue &lt;em&gt;Preuves&lt;/em&gt;, created on 1951 in Paris by German and Swiss thinkers, had Raymond Aron, François Bondy, Arthur Koestler, Thierry Maulnier, Denis de Rougemont, David Rousset, Boris Souvarine and Manès Sperber as collaborators. Funded by Congress for Cultural Freedom, the targeted public was the progressist intellectuals. Albert Camus severed links with Sartre on the question of Stalinism.&lt;/p&gt;\n\n&lt;p&gt;Events such as Tito being denounced by Moscow on 1948 and then reconciliating with Moscow, albeit staying independent, or the Doctors&amp;#39; Plot (French Communist doctors signed peritions against them, before they were rehabilited) tested the fidelity to Moscow of several Communists; even then, the P.C.F. successfully managed to cover away the 1953 East Berlin revolts with the Rosenberg campaign.&lt;/p&gt;\n\n&lt;p&gt;The death of Stalin, along with the release of the Khrushchev report, made some &lt;em&gt;philocommunistes&lt;/em&gt; hope for a liberalisation in the U.S.S.R., although others asked why the excuses were limited to crimes against fellow C.P.S.U. members and the fact some perpretators stayed in charge and an important member, Aimé Césaire, left the Party over Stalin&amp;#39;s crimes.&lt;/p&gt;\n\n&lt;p&gt;Then came Budapest: the P.C.F. took the Kremlin interpretation on the events, that is, this revolt was caused by the fascists, the Catholic Church and the &amp;quot;feodals&amp;quot; to reestablish Admiral Horthy as leader.\nAs a reaction Jean-Paul Sartre, Claude Roy, Jacques-Francis Rolland, Roger Vailland, Claude Morgan and Jacques Prévert protested in &lt;em&gt;Le Monde&lt;/em&gt; against the Soviet intervention and Louis Aragon, Elsa Triolet, Maurice Druon, Stanislas Fumet, Jacques Madaule, Claude Morgan et Jean-Paul Sartre asked Kadar to guarantee the life and the liberty of inprisoned intelectuals. Ten communist intellectuals (the &lt;em&gt;Dix&lt;/em&gt;) sent a public letter to the direction, and some were explled or received a blame.&lt;/p&gt;\n\n&lt;p&gt;One of the first to leave was Emmanuel Le Roy Ladurie; other followed, such as Alain Besançon, François Furet, Annie Kriegel, Jean Bouvier, Michelle Perrot, Denis Richet and Jean Poperen.\nAmong the fellow travellers, the C.N.E. lost its head Vercoes and several others followed such as Stanislas Fumet, Louis Martin-Chauffier, Gérard and Anne Philipe, Yves Montand and Simone Signoret.&lt;/p&gt;\n\n&lt;p&gt;Source:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"http://est-et-ouest.fr/revue/HL028_articles/028_007.pdf\"&gt;&lt;em&gt;Les intellectuels français et l’insurrection hongroise de 1956&lt;/em&gt;&lt;/a&gt;  (fall 2006) by Florence Grandsenne&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"http://archives.mrap.fr/images/4/4e/Dl56_159opt.pdf\"&gt;&amp;quot;Les évènements de Hongrie&amp;quot;&lt;/a&gt;, &lt;em&gt;Droit et Liberté&lt;/em&gt;, November 1956, p. 6&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;EDIT: Fixed list formatting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7rf6c", "score_hidden": false, "stickied": false, "created": 1492128247.0, "created_utc": 1492099447.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6kvi2", "gilded": 0, "archived": false, "score": 391, "report_reasons": null, "author": "michaelnoir", "parent_id": "t3_64yd0b", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "It's perhaps accurate to say that it \"ended\" the French intellectual flirtation with Soviet communism, but that flirtation had been dying out for a long time by the time the book was published in 1973. \n\nBy 1956, when the Soviets invaded Hungary, and especially by 1968 when they invaded Prague, it was extremely difficult to sustain belief in the efficacy of the Soviet system of communism on the European left. \n\nThe Situationist International, for instance, was formed in 1957, partly as a reaction to this realization, which had been recognized by some socialist intellectuals like George Orwell as far back as the 1930's, that the Soviet Union was in effect a tyranny and was not on a path to liberation. \n\nThere had always been left opposition to the Soviet Union, from its beginning. This opposition was at times very strong, and came from mainly from anarchists and Trotskyists. Both had been treated badly by the Soviet authorities in the early days of the Soviet Union, the anarchists sailors of Kronstadt being crushed by the Bolsheviks and Trotsky himself and his followers being exiled from Russia. Thus there were a section of leftists who had become simply the enemies of the USSR. \n\nAfter the Hungarian Revolution of 1956, and the Prague Spring of 1968, the lesson that the Soviet Union was behaving like an imperial power was fully absorbed into the European left, even among those who hadn't previously learned this lesson in the 1930's or before. \n\nSo it was that by 1968, when the May events happened in Paris, a New Left critique of Soviet communism had grown up, and those events were more influenced by other strands in left thought, either the Maoism that was fashionable at the time or the anarchism-influenced Situationism. \n\n\"Too many corpses strew the paths of individualism and collectivism. Under two apparently contradictory rationalities has raged an identical gangsterism, an identical oppression of the isolated man.\" wrote Raoul Vaneigem in 1967, in his book \"Traité de savoir-vivre à l'usage des jeunes générations\" (published in English as The Revolution of Everyday Life).\n\nSo on the radical left, there was already an anti-authoritarian tradition which could be called on to critique Soviet abuses of power. \n\nAnother fashionable trend associated with the French intellectual classes at the same period, of course, was post-structuralism and post-modernism. Post-modernism itself has been defined as \"incredulity towards meta-narratives\" (meta-narratives like international socialism) and tends to mitigate against political action in favour of theory and a field called \"criticism\". Someone like Julia Kristeva (described as a \"flaming Maoist\" by Noam Chomsky when he first met her) by the early seventies had transformed into a full-fledged post-structuralist. \n\nSo, to sum up, the statement is probably accurate but it has to be noted that there were other factors at work at that time which had also caused the French intellectual classes to be disillusioned with Soviet-style communism.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s perhaps accurate to say that it &amp;quot;ended&amp;quot; the French intellectual flirtation with Soviet communism, but that flirtation had been dying out for a long time by the time the book was published in 1973. &lt;/p&gt;\n\n&lt;p&gt;By 1956, when the Soviets invaded Hungary, and especially by 1968 when they invaded Prague, it was extremely difficult to sustain belief in the efficacy of the Soviet system of communism on the European left. &lt;/p&gt;\n\n&lt;p&gt;The Situationist International, for instance, was formed in 1957, partly as a reaction to this realization, which had been recognized by some socialist intellectuals like George Orwell as far back as the 1930&amp;#39;s, that the Soviet Union was in effect a tyranny and was not on a path to liberation. &lt;/p&gt;\n\n&lt;p&gt;There had always been left opposition to the Soviet Union, from its beginning. This opposition was at times very strong, and came from mainly from anarchists and Trotskyists. Both had been treated badly by the Soviet authorities in the early days of the Soviet Union, the anarchists sailors of Kronstadt being crushed by the Bolsheviks and Trotsky himself and his followers being exiled from Russia. Thus there were a section of leftists who had become simply the enemies of the USSR. &lt;/p&gt;\n\n&lt;p&gt;After the Hungarian Revolution of 1956, and the Prague Spring of 1968, the lesson that the Soviet Union was behaving like an imperial power was fully absorbed into the European left, even among those who hadn&amp;#39;t previously learned this lesson in the 1930&amp;#39;s or before. &lt;/p&gt;\n\n&lt;p&gt;So it was that by 1968, when the May events happened in Paris, a New Left critique of Soviet communism had grown up, and those events were more influenced by other strands in left thought, either the Maoism that was fashionable at the time or the anarchism-influenced Situationism. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Too many corpses strew the paths of individualism and collectivism. Under two apparently contradictory rationalities has raged an identical gangsterism, an identical oppression of the isolated man.&amp;quot; wrote Raoul Vaneigem in 1967, in his book &amp;quot;Traité de savoir-vivre à l&amp;#39;usage des jeunes générations&amp;quot; (published in English as The Revolution of Everyday Life).&lt;/p&gt;\n\n&lt;p&gt;So on the radical left, there was already an anti-authoritarian tradition which could be called on to critique Soviet abuses of power. &lt;/p&gt;\n\n&lt;p&gt;Another fashionable trend associated with the French intellectual classes at the same period, of course, was post-structuralism and post-modernism. Post-modernism itself has been defined as &amp;quot;incredulity towards meta-narratives&amp;quot; (meta-narratives like international socialism) and tends to mitigate against political action in favour of theory and a field called &amp;quot;criticism&amp;quot;. Someone like Julia Kristeva (described as a &amp;quot;flaming Maoist&amp;quot; by Noam Chomsky when he first met her) by the early seventies had transformed into a full-fledged post-structuralist. &lt;/p&gt;\n\n&lt;p&gt;So, to sum up, the statement is probably accurate but it has to be noted that there were other factors at work at that time which had also caused the French intellectual classes to be disillusioned with Soviet-style communism.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6kvi2", "score_hidden": false, "stickied": false, "created": 1492060684.0, "created_utc": 1492031884.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 391}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": "", "user_reports": [], "id": "dg6gx5e", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64yd0b", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[removed]", "edited": 1492028182.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6gx5e", "score_hidden": false, "stickied": false, "created": 1492056454.0, "created_utc": 1492027654.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": "", "user_reports": [], "id": "dg6b4bq", "gilded": 0, "archived": false, "score": -17, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64yd0b", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6b4bq", "score_hidden": false, "stickied": false, "created": 1492050492.0, "created_utc": 1492021692.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_64yd0b", "likes": null, "replies": "", "user_reports": [], "id": "dg6enl7", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "jschooltiger", "parent_id": "t1_dg6e65h", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "This comment has been removed because it is [soapboxing](http://www.reddit.com/r/AskHistorians/wiki/rules#wiki_no_.22soapboxing.22_or_loaded_questions.), [promoting a political agenda, or moralizing](http://www.reddit.com/r/AskHistorians/wiki/rules#wiki_no_political_agendas_or_moralising).  We don't allow content that does these things because they are detrimental to unbiased and academic discussion of history.\n\nThis is the second time you've done this in this thread. The next time you do this, you will be banned. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This comment has been removed because it is &lt;a href=\"http://www.reddit.com/r/AskHistorians/wiki/rules#wiki_no_.22soapboxing.22_or_loaded_questions.\"&gt;soapboxing&lt;/a&gt;, &lt;a href=\"http://www.reddit.com/r/AskHistorians/wiki/rules#wiki_no_political_agendas_or_moralising\"&gt;promoting a political agenda, or moralizing&lt;/a&gt;.  We don&amp;#39;t allow content that does these things because they are detrimental to unbiased and academic discussion of history.&lt;/p&gt;\n\n&lt;p&gt;This is the second time you&amp;#39;ve done this in this thread. The next time you do this, you will be banned. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6enl7", "score_hidden": false, "stickied": false, "created": 1492054144.0, "created_utc": 1492025344.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6e65h", "gilded": 0, "archived": false, "score": -21, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg6dkay", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6e65h", "score_hidden": false, "stickied": false, "created": 1492053639.0, "created_utc": 1492024839.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -21}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dkay", "gilded": 0, "archived": false, "score": -9, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64yd0b", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg6dkay", "score_hidden": false, "stickied": false, "created": 1492053017.0, "created_utc": 1492024217.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -9}}], "after": null, "before": null}}]