[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://foreignpolicy.com/2013/05/30/the-bomb-didnt-beat-japan-stalin-did/\"&gt;The article&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[The article](http://foreignpolicy.com/2013/05/30/the-bomb-didnt-beat-japan-stalin-did/)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "652gq2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 772, "report_reasons": null, "author": "Lambert2191", "saved": false, "mod_reports": [], "name": "t3_652gq2", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/652gq2/i_have_always_thought_that_japan_surrendered_in/", "num_reports": null, "locked": false, "stickied": false, "created": 1492075438.0, "url": "https://www.reddit.com/r/AskHistorians/comments/652gq2/i_have_always_thought_that_japan_surrendered_in/", "author_flair_text": null, "quarantine": false, "title": "I have always thought that Japan surrendered in WW2 because of the nuclear bombs dropped on Hiroshima and Nagasaki. Today I read this article, which instead cites Soviet involvement as the primary cause. It makes a very compelling case. Is the article wrong?", "created_utc": 1492046638.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 47, "visited": false, "subreddit_type": "public", "ups": 772}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg7eywl", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "Lambert2191", "parent_id": "t1_dg7bcls", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "This is a fantastically indepth answer, thank you very much.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a fantastically indepth answer, thank you very much.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7eywl", "score_hidden": false, "stickied": false, "created": 1492111266.0, "created_utc": 1492082466.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 28}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7bcls", "gilded": 0, "archived": false, "score": 151, "report_reasons": null, "author": "Themisuel", "parent_id": "t1_dg7bccs", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[2/2]\n\n&gt;One way to gauge whether it was the bombing of Hiroshima or the invasion and declaration of war by the Soviet Union that caused Japan’s surrender is to compare the way in which these two events affected the strategic situation. After Hiroshima was bombed on Aug. 6, both options were still alive. It would still have been possible to ask Stalin to mediate (and Takagi’s diary entries from Aug. 8 show that at least some of Japan’s leaders were still thinking about the effort to get Stalin involved). It would also still have been possible to try to fight one last decisive battle and inflict heavy casualties. The destruction of Hiroshima had done nothing to reduce the preparedness of the troops dug in on the beaches of Japan’s home islands.\n\nWilson is correct to note that it would still have been possible to ask Stalin to mediate, but one must not mis-read this to mean that it was a viable option.  For Stalin, there was no going back on his declaration of war, for a number of reasons that I provide in my linked post.  So to the extent that a mediated peace can be considered an option at all by early August, the possibilities of that option really do end at the point of asking.  \n\nThe argument that it would have been possible for the Japanese to wage a hard-fought battle is more persuasive, especially if America was forced to fight all the way into the Tokyo Plain.  But it should be remembered that choosing countervalue targets for the prospective atomic weapons would have quickly and efficiently reduced the number of targets that the Americans had to capture in the event of an invasion, the total Japanese recruitment pool and accessory make-shift militias, and the production of essential supplies for the country's military and people.  In short, I think calling the options at the time the atomic bomb is dropped 'alive' is generous.\n\n*\n\nI don't have an enormous amount to say in conclusion.  Ward Wilson takes some quite subtle points and it's important not to read too much into the case he presents.  On his final question of what one should think of nuclear weapons if the Hiroshima and Nagasaki bombings were not pivotal in securing a Japanese surrender, I would say the point is moot.  Whether one agrees with Ward Wilson or disagrees with him, the arguments about Hiroshima and Nagasaki are very much rooted in those places and the unique culture and personalities that constituted Imperial Japan at the time.  \n\n*\n\nSources: \n\n\"The Shock of the Atomic Bomb and Japan's Decision to Surrender - A Reconsideration\" by Sadao Asada in Hiroshima in History by Robert James Maddox.  \nThe Atomic Bomb Suppressed by Monica Braw.  \nJapan's Decision to Surrender by J. C. Bustow.  \nFighting to a Finish by Leon V. Sigal.", "edited": 1492085309.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[2/2]&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;One way to gauge whether it was the bombing of Hiroshima or the invasion and declaration of war by the Soviet Union that caused Japan’s surrender is to compare the way in which these two events affected the strategic situation. After Hiroshima was bombed on Aug. 6, both options were still alive. It would still have been possible to ask Stalin to mediate (and Takagi’s diary entries from Aug. 8 show that at least some of Japan’s leaders were still thinking about the effort to get Stalin involved). It would also still have been possible to try to fight one last decisive battle and inflict heavy casualties. The destruction of Hiroshima had done nothing to reduce the preparedness of the troops dug in on the beaches of Japan’s home islands.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Wilson is correct to note that it would still have been possible to ask Stalin to mediate, but one must not mis-read this to mean that it was a viable option.  For Stalin, there was no going back on his declaration of war, for a number of reasons that I provide in my linked post.  So to the extent that a mediated peace can be considered an option at all by early August, the possibilities of that option really do end at the point of asking.  &lt;/p&gt;\n\n&lt;p&gt;The argument that it would have been possible for the Japanese to wage a hard-fought battle is more persuasive, especially if America was forced to fight all the way into the Tokyo Plain.  But it should be remembered that choosing countervalue targets for the prospective atomic weapons would have quickly and efficiently reduced the number of targets that the Americans had to capture in the event of an invasion, the total Japanese recruitment pool and accessory make-shift militias, and the production of essential supplies for the country&amp;#39;s military and people.  In short, I think calling the options at the time the atomic bomb is dropped &amp;#39;alive&amp;#39; is generous.&lt;/p&gt;\n\n&lt;p&gt;*&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have an enormous amount to say in conclusion.  Ward Wilson takes some quite subtle points and it&amp;#39;s important not to read too much into the case he presents.  On his final question of what one should think of nuclear weapons if the Hiroshima and Nagasaki bombings were not pivotal in securing a Japanese surrender, I would say the point is moot.  Whether one agrees with Ward Wilson or disagrees with him, the arguments about Hiroshima and Nagasaki are very much rooted in those places and the unique culture and personalities that constituted Imperial Japan at the time.  &lt;/p&gt;\n\n&lt;p&gt;*&lt;/p&gt;\n\n&lt;p&gt;Sources: &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The Shock of the Atomic Bomb and Japan&amp;#39;s Decision to Surrender - A Reconsideration&amp;quot; by Sadao Asada in Hiroshima in History by Robert James Maddox.&lt;br/&gt;\nThe Atomic Bomb Suppressed by Monica Braw.&lt;br/&gt;\nJapan&amp;#39;s Decision to Surrender by J. C. Bustow.&lt;br/&gt;\nFighting to a Finish by Leon V. Sigal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7bcls", "score_hidden": false, "stickied": false, "created": 1492100714.0, "created_utc": 1492071914.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 151}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg8ny75", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Pashahlis", "parent_id": "t1_dg7bccs", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "So, in short we could say that neither the Atomic Bombs alone nor the Soviet invasion alone persuaded the Japanese to surrender, but both of them combined did?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, in short we could say that neither the Atomic Bombs alone nor the Soviet invasion alone persuaded the Japanese to surrender, but both of them combined did?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8ny75", "score_hidden": false, "stickied": false, "created": 1492167585.0, "created_utc": 1492138785.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg7su2h", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Themisuel", "parent_id": "t1_dg7rlvc", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Thanks.  :-) \n\nIn this instance, I thought it was the best way to approach the question.  It has been asked many times before and there are lots of good answers that attempt to give a comprehensive overview.  As I say, I was unhappy with my previous answer to the question but wanted to chime in again.  Therefore I thought I would attempt to do something more unique to the context in which this question was asked.\n\nI've also noticed myself disagreeing quite strongly with the author of the article but then on closer reading seeing that he's making very specific (and more robust) arguments than I first thought.  So the comment above is essentially informed by my own experience of misreading the author.", "edited": 1492103075.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks.  :-) &lt;/p&gt;\n\n&lt;p&gt;In this instance, I thought it was the best way to approach the question.  It has been asked many times before and there are lots of good answers that attempt to give a comprehensive overview.  As I say, I was unhappy with my previous answer to the question but wanted to chime in again.  Therefore I thought I would attempt to do something more unique to the context in which this question was asked.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve also noticed myself disagreeing quite strongly with the author of the article but then on closer reading seeing that he&amp;#39;s making very specific (and more robust) arguments than I first thought.  So the comment above is essentially informed by my own experience of misreading the author.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7su2h", "score_hidden": false, "stickied": false, "created": 1492129744.0, "created_utc": 1492100944.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7rlvc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "elHuron", "parent_id": "t1_dg7bccs", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Your answers are really thorough and easy to follow.\n\nYour style of \"cite, provide context for citation, comment on citation\" makes for an easy digest.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your answers are really thorough and easy to follow.&lt;/p&gt;\n\n&lt;p&gt;Your style of &amp;quot;cite, provide context for citation, comment on citation&amp;quot; makes for an easy digest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7rlvc", "score_hidden": false, "stickied": false, "created": 1492128448.0, "created_utc": 1492099648.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7bccs", "gilded": 0, "archived": false, "score": 183, "report_reasons": null, "author": "Themisuel", "parent_id": "t1_dg71ztc", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[1/2]\n\nI've edited out a final sentence in my previous post in the linked thread where I said I was unhappy with the answer and would edit.  I never got round to editing it and am still unsure exactly what to do with it, so I decided to write up some more specific objections to Ward Wilson's argument in the linked text.  I will try to show that Ward Wilson takes a very specific line of argument.  To that end, I will leave some open questions rather than trying to give a comprehensive answer to the question asked by both OPs (a comprehensive answer can be found in the links above).  For the same reason, however, I don't think this constitutes a full answer and I will post it as a reply to yours rather than as a standalone post.  \n\n* \n\n&gt;Viewed from the Japanese perspective, the most important day in that second week of August wasn’t Aug. 6 but Aug. 9. That was the day that the Supreme Council met — for the first time in the war — to discuss unconditional surrender. The Supreme Council was a group of six top members of the government — a sort of inner cabinet — that effectively ruled Japan in 1945. Japan’s leaders had not seriously considered surrendering prior to that day.\n\nThe facts of this passage can be admitted.  However, the question broadly stated by Ward Wilson is was the bomb effective in securing surrender?  In this section, 'Timing', the argument seems to follow that because the Supreme War Council convened soon after the Soviet intervention but a while after the detonation of the Hiroshima bomb, the Hiroshima bomb was not effective in securing a Japanese surrender.  Now this is persuasive in the sense that there was a delay of three days and that the Americans (and I should say the Japanese population) would have been much happier if the Supreme War Council had convened sooner than August 9.  However, Ward Wilson entirely avoids the question of whether the Hiroshima bomb was out of mind for the intervening time or whether it was an important factor in the decision to surrender.  In short, he makes an argument about timing but relies *solely* on the passage of time; he does not look at what *happened* during that time.  This is particularly problematic because, as Sadao Asada notes, \"the Soviet entry came on the heels of the Hiroshima bomb, [so] it is hard to separate the impacts of the two events\" (49).\n\nNow according to Robert J. C. Butow the detonation of the Little Boy *was* important in the proceedings on August 9.  According to Butow in *Japan's Decision to Surrender*, the peace faction in the Japanese govenrment \"recognised in the atomic bomb and the Soviet entry into the war not just an imperative need to give in but actuallly a supreme opportunity to turn the tide against the die-hards and to shake the government loose from the yoke of military oppression under which it had been laboring so long\" (158).  Furthermore, Bustow notes how Togo had wanted the Supreme War Council to convene on August 8 - that is, *before* Soviet intervention.\n\nFinally, Bustow corroborates what I said in my previous post: even if the detonation of an atomic bomb over Hiroshima failed to have a \"shock\" effect, the prospect of a protracted campaign of atomic bombardment terrified the Japanese.  Bustow draws on reports from the United States Strategic Bombing Survey and the US Army's Military History Section to show that local governments were terrified of atomic bombing and that this compelled a Supreme War Council meeting before August 12 (160; the Japanese had been led to believe there would be another atomic bomb dropped on August 12).\n\nThe question necessarily is - were the atomic bombs important to the passage of proceedings and were they important in the war faction losing ground?  According to Bustow, yes; in conjunction with the intervention of the Soviet Union, the atomic bomb exposed Japan's powerlessness and this was an argument invoked frequently on the side of the peace faction.\n\nOne must be alert to the fact that Wilson's point about timing is geared very carefully towards the question of whether the atomic bomb was successful in getting the Japanese to *consider* peace.  For the purposes of whether it was effective in *achieving* peace, it should be noted that the Supreme War Council's meeting on August 9 might be a non-essential moment in the surrender of Japan.  For their failure to reach a conclusion led to a convention ordered by Hirohito, and it was this council of ministers and military officials that finally determined the shape of Japan's surrender.  If one answers questions pertaining to Japanese surrender based on the records of the 'Imperial Conference' (which gave its final decision August 15), the only answer can be yes, the atomic bomb was a factor in proceedings.\n\n&gt;It could not have been Nagasaki. The bombing of Nagasaki occurred in the late morning of Aug. 9, after the Supreme Council had already begun meeting to discuss surrender, and word of the bombing only reached Japan’s leaders in the early afternoon — after the meeting of the Supreme Council had been adjourned in deadlock and the full cabinet had been called to take up the discussion.\n\nI believe that this is false.  The bombing of Nagasaki occured (by most estimates) within minutes of the Supreme War Council convening.  The only question remaining is whether the news reached the Council within the 3-4 hours that the meeting lasted.  As far as I know, it did.\n\n&gt;First, Hiroshima’s governor reported to Tokyo on the very day Hiroshima was bombed that about a third of the population had been killed in the attack and that two thirds of the city had been destroyed. This information didn’t change over the next several days. So the outcome — the end result of the bombing — was clear from the beginning. Japan’s leaders knew roughly the outcome of the attack on the first day, yet they still did not act.\n\nThe Japanese knew that Hiroshima had been destroyed.  The government received that information from a variety of independent sources.  Moreover, there were many communication stations in Hiroshima that could not be reached because the atomic bomb had disabled them.  The fact that the Japanese leaders \"knew roughly the outcome of the attack\" is not contested.  However, as I argue in my linked post, this is not the same thing as knowing the importance of the bomb.  In the paper I cited in my previous post, the author follows the progress of the Army's nuclear science team to Hiroshima and their efforts to get a report back to the Supreme War Council.  The Supreme War Council simply did not believe that what they had been hit with was an atomic weapon.  Instead, they thought up many crack-pot alternatives such as the Americans conducting hundreds of flyovers and covering Hiroshima in a combustible material which they then sparked on the morning of the Hiroshima bombing.  Moreover, most of the general populace were unaware.  The editor of one of Japan's largest newspapers at the time said that both the authorities and the public had no clue as to what had hit Nagasaki or what countermeasures could be taken (Braw, 13).  The point is that even if the Japanese Supreme War Council knew the outcome, that is not the same as having the full picture.  One can argue, therefore, that the Hiroshima bomb was not immediately effective in securing surrender, but one must be careful to notice that Ward Wilson is avoiding the words 'They did not act on their knowledge of the atomic bomb'.  This is a common and subtle position that Ward Wilson takes; my concern is that someone might misread it to mean more than it does.\n\n&gt;We often imagine, because of the way the story is told, that the bombing of Hiroshima was far worse. We imagine that the number of people killed was off the charts. But if you graph the number of people killed in all 68 cities bombed in the summer of 1945, you find that Hiroshima was second in terms of civilian deaths. If you chart the number of square miles destroyed, you find that Hiroshima was fourth. If you chart the percentage of the city destroyed, Hiroshima was 17th. Hiroshima was clearly within the parameters of the conventional attacks carried out that summer.\n\nOnce again, Ward is repeating one of his subtler positions.  This argument about casualties is trotted out a lot.  A journalist called Tom Ham recently tabulated the casualty figures for the various bombing raids on Japan to show the unexceptional nature of Hiroshima and Nagasaki taken in terms of their casualty figures.  \n\nIt's important to remember that this is not the only metric by which military effectiveness is measured.  For example, and as I note in my previous post, the use of atomic bombs significantly reduced projected American casualties in the event of a sustained war.  Furthermore, Lawrence Freedman (in his Bible on nuclear weapons *The Evolution of Nuclear Strategy*) notes that an important motivation in developing a nuclear arsenal is that only one bomber has to break the enemy's anti-air defenses.  In short, any time the Americans wanted to carry out an atomic air raid, the Japanese would have one shot to stop it and one shot only.  This is without factoring in other things like the troubles with detecting a lone bomber.  \n\nWhether the Japanese military command did or did not notice the singularity of the atomic bomb as a military weapon is not a question I can answer, but it's also not one that Ward seems to engage with.  I will note in brief that General Anami, who Wilson cites, was perhaps the most fanatical man on the Supreme War Council who denied out of hand the prospect of protracted atomic bombardment. ", "edited": 1492085019.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[1/2]&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve edited out a final sentence in my previous post in the linked thread where I said I was unhappy with the answer and would edit.  I never got round to editing it and am still unsure exactly what to do with it, so I decided to write up some more specific objections to Ward Wilson&amp;#39;s argument in the linked text.  I will try to show that Ward Wilson takes a very specific line of argument.  To that end, I will leave some open questions rather than trying to give a comprehensive answer to the question asked by both OPs (a comprehensive answer can be found in the links above).  For the same reason, however, I don&amp;#39;t think this constitutes a full answer and I will post it as a reply to yours rather than as a standalone post.  &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Viewed from the Japanese perspective, the most important day in that second week of August wasn’t Aug. 6 but Aug. 9. That was the day that the Supreme Council met — for the first time in the war — to discuss unconditional surrender. The Supreme Council was a group of six top members of the government — a sort of inner cabinet — that effectively ruled Japan in 1945. Japan’s leaders had not seriously considered surrendering prior to that day.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The facts of this passage can be admitted.  However, the question broadly stated by Ward Wilson is was the bomb effective in securing surrender?  In this section, &amp;#39;Timing&amp;#39;, the argument seems to follow that because the Supreme War Council convened soon after the Soviet intervention but a while after the detonation of the Hiroshima bomb, the Hiroshima bomb was not effective in securing a Japanese surrender.  Now this is persuasive in the sense that there was a delay of three days and that the Americans (and I should say the Japanese population) would have been much happier if the Supreme War Council had convened sooner than August 9.  However, Ward Wilson entirely avoids the question of whether the Hiroshima bomb was out of mind for the intervening time or whether it was an important factor in the decision to surrender.  In short, he makes an argument about timing but relies &lt;em&gt;solely&lt;/em&gt; on the passage of time; he does not look at what &lt;em&gt;happened&lt;/em&gt; during that time.  This is particularly problematic because, as Sadao Asada notes, &amp;quot;the Soviet entry came on the heels of the Hiroshima bomb, [so] it is hard to separate the impacts of the two events&amp;quot; (49).&lt;/p&gt;\n\n&lt;p&gt;Now according to Robert J. C. Butow the detonation of the Little Boy &lt;em&gt;was&lt;/em&gt; important in the proceedings on August 9.  According to Butow in &lt;em&gt;Japan&amp;#39;s Decision to Surrender&lt;/em&gt;, the peace faction in the Japanese govenrment &amp;quot;recognised in the atomic bomb and the Soviet entry into the war not just an imperative need to give in but actuallly a supreme opportunity to turn the tide against the die-hards and to shake the government loose from the yoke of military oppression under which it had been laboring so long&amp;quot; (158).  Furthermore, Bustow notes how Togo had wanted the Supreme War Council to convene on August 8 - that is, &lt;em&gt;before&lt;/em&gt; Soviet intervention.&lt;/p&gt;\n\n&lt;p&gt;Finally, Bustow corroborates what I said in my previous post: even if the detonation of an atomic bomb over Hiroshima failed to have a &amp;quot;shock&amp;quot; effect, the prospect of a protracted campaign of atomic bombardment terrified the Japanese.  Bustow draws on reports from the United States Strategic Bombing Survey and the US Army&amp;#39;s Military History Section to show that local governments were terrified of atomic bombing and that this compelled a Supreme War Council meeting before August 12 (160; the Japanese had been led to believe there would be another atomic bomb dropped on August 12).&lt;/p&gt;\n\n&lt;p&gt;The question necessarily is - were the atomic bombs important to the passage of proceedings and were they important in the war faction losing ground?  According to Bustow, yes; in conjunction with the intervention of the Soviet Union, the atomic bomb exposed Japan&amp;#39;s powerlessness and this was an argument invoked frequently on the side of the peace faction.&lt;/p&gt;\n\n&lt;p&gt;One must be alert to the fact that Wilson&amp;#39;s point about timing is geared very carefully towards the question of whether the atomic bomb was successful in getting the Japanese to &lt;em&gt;consider&lt;/em&gt; peace.  For the purposes of whether it was effective in &lt;em&gt;achieving&lt;/em&gt; peace, it should be noted that the Supreme War Council&amp;#39;s meeting on August 9 might be a non-essential moment in the surrender of Japan.  For their failure to reach a conclusion led to a convention ordered by Hirohito, and it was this council of ministers and military officials that finally determined the shape of Japan&amp;#39;s surrender.  If one answers questions pertaining to Japanese surrender based on the records of the &amp;#39;Imperial Conference&amp;#39; (which gave its final decision August 15), the only answer can be yes, the atomic bomb was a factor in proceedings.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It could not have been Nagasaki. The bombing of Nagasaki occurred in the late morning of Aug. 9, after the Supreme Council had already begun meeting to discuss surrender, and word of the bombing only reached Japan’s leaders in the early afternoon — after the meeting of the Supreme Council had been adjourned in deadlock and the full cabinet had been called to take up the discussion.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I believe that this is false.  The bombing of Nagasaki occured (by most estimates) within minutes of the Supreme War Council convening.  The only question remaining is whether the news reached the Council within the 3-4 hours that the meeting lasted.  As far as I know, it did.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;First, Hiroshima’s governor reported to Tokyo on the very day Hiroshima was bombed that about a third of the population had been killed in the attack and that two thirds of the city had been destroyed. This information didn’t change over the next several days. So the outcome — the end result of the bombing — was clear from the beginning. Japan’s leaders knew roughly the outcome of the attack on the first day, yet they still did not act.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The Japanese knew that Hiroshima had been destroyed.  The government received that information from a variety of independent sources.  Moreover, there were many communication stations in Hiroshima that could not be reached because the atomic bomb had disabled them.  The fact that the Japanese leaders &amp;quot;knew roughly the outcome of the attack&amp;quot; is not contested.  However, as I argue in my linked post, this is not the same thing as knowing the importance of the bomb.  In the paper I cited in my previous post, the author follows the progress of the Army&amp;#39;s nuclear science team to Hiroshima and their efforts to get a report back to the Supreme War Council.  The Supreme War Council simply did not believe that what they had been hit with was an atomic weapon.  Instead, they thought up many crack-pot alternatives such as the Americans conducting hundreds of flyovers and covering Hiroshima in a combustible material which they then sparked on the morning of the Hiroshima bombing.  Moreover, most of the general populace were unaware.  The editor of one of Japan&amp;#39;s largest newspapers at the time said that both the authorities and the public had no clue as to what had hit Nagasaki or what countermeasures could be taken (Braw, 13).  The point is that even if the Japanese Supreme War Council knew the outcome, that is not the same as having the full picture.  One can argue, therefore, that the Hiroshima bomb was not immediately effective in securing surrender, but one must be careful to notice that Ward Wilson is avoiding the words &amp;#39;They did not act on their knowledge of the atomic bomb&amp;#39;.  This is a common and subtle position that Ward Wilson takes; my concern is that someone might misread it to mean more than it does.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We often imagine, because of the way the story is told, that the bombing of Hiroshima was far worse. We imagine that the number of people killed was off the charts. But if you graph the number of people killed in all 68 cities bombed in the summer of 1945, you find that Hiroshima was second in terms of civilian deaths. If you chart the number of square miles destroyed, you find that Hiroshima was fourth. If you chart the percentage of the city destroyed, Hiroshima was 17th. Hiroshima was clearly within the parameters of the conventional attacks carried out that summer.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Once again, Ward is repeating one of his subtler positions.  This argument about casualties is trotted out a lot.  A journalist called Tom Ham recently tabulated the casualty figures for the various bombing raids on Japan to show the unexceptional nature of Hiroshima and Nagasaki taken in terms of their casualty figures.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s important to remember that this is not the only metric by which military effectiveness is measured.  For example, and as I note in my previous post, the use of atomic bombs significantly reduced projected American casualties in the event of a sustained war.  Furthermore, Lawrence Freedman (in his Bible on nuclear weapons &lt;em&gt;The Evolution of Nuclear Strategy&lt;/em&gt;) notes that an important motivation in developing a nuclear arsenal is that only one bomber has to break the enemy&amp;#39;s anti-air defenses.  In short, any time the Americans wanted to carry out an atomic air raid, the Japanese would have one shot to stop it and one shot only.  This is without factoring in other things like the troubles with detecting a lone bomber.  &lt;/p&gt;\n\n&lt;p&gt;Whether the Japanese military command did or did not notice the singularity of the atomic bomb as a military weapon is not a question I can answer, but it&amp;#39;s also not one that Ward seems to engage with.  I will note in brief that General Anami, who Wilson cites, was perhaps the most fanatical man on the Supreme War Council who denied out of hand the prospect of protracted atomic bombardment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7bccs", "score_hidden": false, "stickied": false, "created": 1492100693.0, "created_utc": 1492071893.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 183}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg88334", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Themisuel", "parent_id": "t1_dg7lvl6", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "I haven't seen that film but will keep an eye out for it.  If I see it, I will try and get back to you.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t seen that film but will keep an eye out for it.  If I see it, I will try and get back to you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg88334", "score_hidden": false, "stickied": false, "created": 1492146266.0, "created_utc": 1492117466.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7lvl6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Oukaria", "parent_id": "t1_dg7c3r8", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Did you see \"an emperor in august\" ? A Japanese movie about this period; of course it's a movie etc.. etc.. but I was wondering how much accurate is the movie on the historic point of view (Army overtaking places etc..) ?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did you see &amp;quot;an emperor in august&amp;quot; ? A Japanese movie about this period; of course it&amp;#39;s a movie etc.. etc.. but I was wondering how much accurate is the movie on the historic point of view (Army overtaking places etc..) ?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7lvl6", "score_hidden": false, "stickied": false, "created": 1492122134.0, "created_utc": 1492093334.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7c3r8", "gilded": 0, "archived": false, "score": 70, "report_reasons": null, "author": "Themisuel", "parent_id": "t1_dg79tkf", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Yes, Hirohito was part of the peace faction.  In my post in the linked thread, I note that he worked (secretly) with several Japanese officials in an attempt for a mediated peace from the spring of 1944 onwards.\n\nThere were two cultural problems with his involvement in the decision to surrender.  Firstly, he was was expected to bear witness to marital decision, but not prosecute any course of action alone.  This meant that he was not actively involved in the Supreme War Council.  \n\nSecondly, he was seen by the war faction (ironically) as a kind of divine being.  Their attempts to pursue the war were so zealous precisely because they thought that they were protecting the Emperor from being dethroned by the Americans.\n\nHe finally gets involved when the Supreme War Council reach a deadlock on August 9.  Togo met with Hirohito frequently from August 8-9.  In these discussions, it is likely they expressed doubts about their ability to continue the war (perhaps in direct relation to the atomic bomb) and looked for ways to find peace.  Constitutionally, the power to convene the an imperial conference was with the Prime Minister, Kantaro Suzuki.  So on August 8, Hirohito had requested that Togo ask Suzuki to do this but Suzuki said there was not a quorum available (Sigal, 237).  The cabinet was instead convened on August 9.  By this point, the War Council had provided signatures confirming their participation and Hirohito had agreed that such a conference should be held.  The Japanese cabinet had to present Hirohito (embarrassingly) with its split decision.  \n\nThroughout this council, the jousting factions invoked the authority of the Emperor in the argument for their cause.  Both peace and war factions were trying to win him over.  The peace faction, at least, was secure in the knowledge that they were secretly favoured.\n\nBustow records the final moments - after Hirohito had been called on for his decision and so given it - as follows:\n\n&gt;As the Emperor turned from the conference table and slowly made his way out of the room, Premier Suzuki flatly declared: \"His Majesty's decision *should* be made the decision of this conference as well.\"  Although each man present kept his counsel and thereby registered his assent, the real fact of the matter is that the so-called imperial decision was not actually a *decision* at all.  Indeed, it was little more than an expression of the Emperor's personal desire - a play upon words whereby the sovereign had said, \"If it were up to me to decide, this is what I would do.\"  The Emperor's admonitions and injunctions were in the nature of a private opinion with no legal authority to bind the will of the state, for which the cabinet alone was responsible.  The councilors to whom he had stated his views, moreover, belonged to an extraconstitutional organ, and like the Emperor they, too, could merely express n opinion.  Whether anything the Supreme Councilors did or the Emperor said ultimately became *a decision of state* would depend entirely upon the pleasure of the cabinet, whose approval alone could impart validity and substance to policies formulated outside its chambers.  Yet in the final analysis, the imperial judgment and the Supreme Council's concurrence possessed a great significance in that both overawed in *influence* what they lacked in authority.  \n\n&gt;At a less critical, chaotic time even this open-sesame might have proved unequal to the occasion.  In spite of the emphasis which had been placed by the ruling elite upon the supremacy of the imperial will, the concept had had very little meaning and very few adherents other than undesirable elements who had used \"imperial sovereignty\" to further their own questionable ends.  By August 9, however, the past had overtaken the present and all that might have been had already raced toward an unavoidable climax - a point of no return.  In such a circumstance, the theories of former times joined with the compelling demands of the moment to give the Emperor's expression of desire the force it needed to swing the pendulum from destruction toward survival.  (176-7)\n\nAnd Sigal:\n\n&gt;It was past two o'clock in the morning when the emperor spoke...  Citing the unreliability of previous military estimates of the course of the war, the still unfinished fortifications at likely sites of an enemy landing, the gap between planning and results in the production of critical materiel, specifically aircraft, Hirohito questioned the likelihood of repelling the invasion.  The intensifying air raids, he noted, were only adding to popular distress.  Addressing himself directly to the conditions proposed by the armed services, he was sympathetic but unyielding.  As unbearable as it might be to have his troops disarmed by the enemy or to have men unswerving in their loyalty to him be punished as responsible for the war, \"now,\" he insisted, \"is the time to bear the unbearable.  \n\n&gt;The decision was still up to the cabinet.  As the Emperor was making his exit, Suzuki gave instructions to reconvene the ministers in his official residence at 3AM.  At this juncture, War Minister Anami and his fellow hawks could have brought down the government by blocking the decision or by resigning.  They did not do so.  It took those in favor of suing for peace just over and hour to prevail upon their colleagues, even the reluctant Home Minister Abe, to affix their seals to the motion: \"Based on the Imperial desire, it is hereby decided that the Potsdam Declaration will be accepted on the one condition [viz. preservation of the Emperor].\"  The emperor's intervention had broken the political deadlock. (242)\n\n", "edited": 1492074449.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, Hirohito was part of the peace faction.  In my post in the linked thread, I note that he worked (secretly) with several Japanese officials in an attempt for a mediated peace from the spring of 1944 onwards.&lt;/p&gt;\n\n&lt;p&gt;There were two cultural problems with his involvement in the decision to surrender.  Firstly, he was was expected to bear witness to marital decision, but not prosecute any course of action alone.  This meant that he was not actively involved in the Supreme War Council.  &lt;/p&gt;\n\n&lt;p&gt;Secondly, he was seen by the war faction (ironically) as a kind of divine being.  Their attempts to pursue the war were so zealous precisely because they thought that they were protecting the Emperor from being dethroned by the Americans.&lt;/p&gt;\n\n&lt;p&gt;He finally gets involved when the Supreme War Council reach a deadlock on August 9.  Togo met with Hirohito frequently from August 8-9.  In these discussions, it is likely they expressed doubts about their ability to continue the war (perhaps in direct relation to the atomic bomb) and looked for ways to find peace.  Constitutionally, the power to convene the an imperial conference was with the Prime Minister, Kantaro Suzuki.  So on August 8, Hirohito had requested that Togo ask Suzuki to do this but Suzuki said there was not a quorum available (Sigal, 237).  The cabinet was instead convened on August 9.  By this point, the War Council had provided signatures confirming their participation and Hirohito had agreed that such a conference should be held.  The Japanese cabinet had to present Hirohito (embarrassingly) with its split decision.  &lt;/p&gt;\n\n&lt;p&gt;Throughout this council, the jousting factions invoked the authority of the Emperor in the argument for their cause.  Both peace and war factions were trying to win him over.  The peace faction, at least, was secure in the knowledge that they were secretly favoured.&lt;/p&gt;\n\n&lt;p&gt;Bustow records the final moments - after Hirohito had been called on for his decision and so given it - as follows:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As the Emperor turned from the conference table and slowly made his way out of the room, Premier Suzuki flatly declared: &amp;quot;His Majesty&amp;#39;s decision &lt;em&gt;should&lt;/em&gt; be made the decision of this conference as well.&amp;quot;  Although each man present kept his counsel and thereby registered his assent, the real fact of the matter is that the so-called imperial decision was not actually a &lt;em&gt;decision&lt;/em&gt; at all.  Indeed, it was little more than an expression of the Emperor&amp;#39;s personal desire - a play upon words whereby the sovereign had said, &amp;quot;If it were up to me to decide, this is what I would do.&amp;quot;  The Emperor&amp;#39;s admonitions and injunctions were in the nature of a private opinion with no legal authority to bind the will of the state, for which the cabinet alone was responsible.  The councilors to whom he had stated his views, moreover, belonged to an extraconstitutional organ, and like the Emperor they, too, could merely express n opinion.  Whether anything the Supreme Councilors did or the Emperor said ultimately became &lt;em&gt;a decision of state&lt;/em&gt; would depend entirely upon the pleasure of the cabinet, whose approval alone could impart validity and substance to policies formulated outside its chambers.  Yet in the final analysis, the imperial judgment and the Supreme Council&amp;#39;s concurrence possessed a great significance in that both overawed in &lt;em&gt;influence&lt;/em&gt; what they lacked in authority.  &lt;/p&gt;\n\n&lt;p&gt;At a less critical, chaotic time even this open-sesame might have proved unequal to the occasion.  In spite of the emphasis which had been placed by the ruling elite upon the supremacy of the imperial will, the concept had had very little meaning and very few adherents other than undesirable elements who had used &amp;quot;imperial sovereignty&amp;quot; to further their own questionable ends.  By August 9, however, the past had overtaken the present and all that might have been had already raced toward an unavoidable climax - a point of no return.  In such a circumstance, the theories of former times joined with the compelling demands of the moment to give the Emperor&amp;#39;s expression of desire the force it needed to swing the pendulum from destruction toward survival.  (176-7)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And Sigal:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It was past two o&amp;#39;clock in the morning when the emperor spoke...  Citing the unreliability of previous military estimates of the course of the war, the still unfinished fortifications at likely sites of an enemy landing, the gap between planning and results in the production of critical materiel, specifically aircraft, Hirohito questioned the likelihood of repelling the invasion.  The intensifying air raids, he noted, were only adding to popular distress.  Addressing himself directly to the conditions proposed by the armed services, he was sympathetic but unyielding.  As unbearable as it might be to have his troops disarmed by the enemy or to have men unswerving in their loyalty to him be punished as responsible for the war, &amp;quot;now,&amp;quot; he insisted, &amp;quot;is the time to bear the unbearable.  &lt;/p&gt;\n\n&lt;p&gt;The decision was still up to the cabinet.  As the Emperor was making his exit, Suzuki gave instructions to reconvene the ministers in his official residence at 3AM.  At this juncture, War Minister Anami and his fellow hawks could have brought down the government by blocking the decision or by resigning.  They did not do so.  It took those in favor of suing for peace just over and hour to prevail upon their colleagues, even the reluctant Home Minister Abe, to affix their seals to the motion: &amp;quot;Based on the Imperial desire, it is hereby decided that the Potsdam Declaration will be accepted on the one condition [viz. preservation of the Emperor].&amp;quot;  The emperor&amp;#39;s intervention had broken the political deadlock. (242)&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7c3r8", "score_hidden": false, "stickied": false, "created": 1492103021.0, "created_utc": 1492074221.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 70}}], "after": null, "before": null}}, "user_reports": [], "id": "dg79tkf", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "medsl", "parent_id": "t1_dg71ztc", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Did anyone ever think of asking Hirohito? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did anyone ever think of asking Hirohito? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg79tkf", "score_hidden": false, "stickied": false, "created": 1492096348.0, "created_utc": 1492067548.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg8nb6n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GTFErinyes", "parent_id": "t1_dg7e2id", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "That is a point oft forgotten in these discussions: the decision making process emonths and months in advance. The simple logistics of shipping the weapon, preparing the bombers, and planning/targeting all spanned weeks and months prior to the actual attack.\n\nThe planning for the invasion of Japan had begun long before the bombs were dropped and the bombing campaign of Japan had been formulated long before. Atomic bombs were now simply added to the list of available weapons", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is a point oft forgotten in these discussions: the decision making process emonths and months in advance. The simple logistics of shipping the weapon, preparing the bombers, and planning/targeting all spanned weeks and months prior to the actual attack.&lt;/p&gt;\n\n&lt;p&gt;The planning for the invasion of Japan had begun long before the bombs were dropped and the bombing campaign of Japan had been formulated long before. Atomic bombs were now simply added to the list of available weapons&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8nb6n", "score_hidden": false, "stickied": false, "created": 1492166643.0, "created_utc": 1492137843.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7e2id", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "Tiddums", "parent_id": "t1_dg7b6vh", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "The decision to drop the bomb was made separately to the knowledge of an impending Soviet attack; the exact date of the Soviet offensive (\"About two or three months after Germany surrenders\" was the deal) and the exact date of the bombs dropping (There's a [primary source for the order to drop available here](http://www.dannen.com/decision/handy.html)) were not known to American planners, but more pertinently, the Americans did not know that either the bombs or the Soviet declaration of war would cause a surrender. \n\nAt the Yalta conference, Roosevelt secured an agreement with the Soviets to declare war on the Empire of Japan, hoping to expedite their defeat. Roosevelt could have chosen not to do this, knowing as he did that victory over Japan was a matter of time, but more importantly, of blood. If the Soviets were willing to deal with large Japanese formations on the ground, then all the better to shorten the war and reduce American casualties. Although Truman did not see eye to eye on all issues with his predecessor, I'm not aware of any indication that he believed this was ultimately a mistake at the time (if somebody does have some info here, please feel free to correct me). \n\nAlthough a lot of ink has been spilled and a lot of classroom debates held over the question of whether the bombs were necessary to prevent a costly (both to attacker, defender, and civilian populations) invasion of mainland Japan, that was not really how the American planners saw it at the time. They had secured Soviet entry to the war, they were lining up the Atomic Bombs, and they were also preparing a full military invasion of the Home Islands. This was not either/or, they were anticipating needing to do all three things. That the Japanese surrendered prior to this invasion was a huge benefit both to the Japanese people and to the American forces, but it was not a surefire thing that American planners were counting on. Some hoped the bombs would cause a Japanese capitulation - but then, some had also hoped that extensive conventional bombing campaigns, total naval supremacy and blockade would have had the same effect of convincing them that a continued war was futile. \n\nOn the \"did they have to drop the bomb\" debates, the topic under consideration is usually how much the American planners knew and when they knew it. Did they know the Japanese were considering surrender, but do it anyway? Did they not take it seriously? That sort of thing. On the \"what caused the Japanese to surrender\" debate, which is related but distinct, the discussion is more about what was going on within the Japanese upper echelons and which specific factors impacted their decision making. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The decision to drop the bomb was made separately to the knowledge of an impending Soviet attack; the exact date of the Soviet offensive (&amp;quot;About two or three months after Germany surrenders&amp;quot; was the deal) and the exact date of the bombs dropping (There&amp;#39;s a &lt;a href=\"http://www.dannen.com/decision/handy.html\"&gt;primary source for the order to drop available here&lt;/a&gt;) were not known to American planners, but more pertinently, the Americans did not know that either the bombs or the Soviet declaration of war would cause a surrender. &lt;/p&gt;\n\n&lt;p&gt;At the Yalta conference, Roosevelt secured an agreement with the Soviets to declare war on the Empire of Japan, hoping to expedite their defeat. Roosevelt could have chosen not to do this, knowing as he did that victory over Japan was a matter of time, but more importantly, of blood. If the Soviets were willing to deal with large Japanese formations on the ground, then all the better to shorten the war and reduce American casualties. Although Truman did not see eye to eye on all issues with his predecessor, I&amp;#39;m not aware of any indication that he believed this was ultimately a mistake at the time (if somebody does have some info here, please feel free to correct me). &lt;/p&gt;\n\n&lt;p&gt;Although a lot of ink has been spilled and a lot of classroom debates held over the question of whether the bombs were necessary to prevent a costly (both to attacker, defender, and civilian populations) invasion of mainland Japan, that was not really how the American planners saw it at the time. They had secured Soviet entry to the war, they were lining up the Atomic Bombs, and they were also preparing a full military invasion of the Home Islands. This was not either/or, they were anticipating needing to do all three things. That the Japanese surrendered prior to this invasion was a huge benefit both to the Japanese people and to the American forces, but it was not a surefire thing that American planners were counting on. Some hoped the bombs would cause a Japanese capitulation - but then, some had also hoped that extensive conventional bombing campaigns, total naval supremacy and blockade would have had the same effect of convincing them that a continued war was futile. &lt;/p&gt;\n\n&lt;p&gt;On the &amp;quot;did they have to drop the bomb&amp;quot; debates, the topic under consideration is usually how much the American planners knew and when they knew it. Did they know the Japanese were considering surrender, but do it anyway? Did they not take it seriously? That sort of thing. On the &amp;quot;what caused the Japanese to surrender&amp;quot; debate, which is related but distinct, the discussion is more about what was going on within the Japanese upper echelons and which specific factors impacted their decision making. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7e2id", "score_hidden": false, "stickied": false, "created": 1492108934.0, "created_utc": 1492080134.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 29}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7b6vh", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "variola_vera", "parent_id": "t1_dg71ztc", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "I always had impression that it was whole other way around. That bombs were dropped because Americans didn't want for Soviets to invade Japan and to rush them into surrender as well as to make show of power to Soviets so that they would back down with aggression in Europe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always had impression that it was whole other way around. That bombs were dropped because Americans didn&amp;#39;t want for Soviets to invade Japan and to rush them into surrender as well as to make show of power to Soviets so that they would back down with aggression in Europe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7b6vh", "score_hidden": false, "stickied": false, "created": 1492100246.0, "created_utc": 1492071446.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg7fzmi", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "whistleridge", "parent_id": "t1_dg71ztc", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "As noted at documented length both further down and in the linked thread, it was a complex situation. \n\nOne detail that is missing: regardless of the final impetus on the Cabinet, it's absolutely true that it was the extraordinary nature of the atomic bombs themselves that created an opening for Hirohito to speak while saving some face. That is to say, the pending Russian conquest of Manchuria and Korea may have weighed more in the Cabinet's decision, but it probably did not in and of itself qualify as enough for Hirohito to act. \n\nInvasions were a known concept in Japanese history, and the successful repulsion of the Mongol invasion (at least as overwhelming then as the looming US invasion was in 1945) made it culturally difficult for him to break protocol. It was 'just' an invasion. The sudden obliteration of two cities was sufficiently unusual that he could speak out without being seen as interfering in temporal matters that were not his proper place. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As noted at documented length both further down and in the linked thread, it was a complex situation. &lt;/p&gt;\n\n&lt;p&gt;One detail that is missing: regardless of the final impetus on the Cabinet, it&amp;#39;s absolutely true that it was the extraordinary nature of the atomic bombs themselves that created an opening for Hirohito to speak while saving some face. That is to say, the pending Russian conquest of Manchuria and Korea may have weighed more in the Cabinet&amp;#39;s decision, but it probably did not in and of itself qualify as enough for Hirohito to act. &lt;/p&gt;\n\n&lt;p&gt;Invasions were a known concept in Japanese history, and the successful repulsion of the Mongol invasion (at least as overwhelming then as the looming US invasion was in 1945) made it culturally difficult for him to break protocol. It was &amp;#39;just&amp;#39; an invasion. The sudden obliteration of two cities was sufficiently unusual that he could speak out without being seen as interfering in temporal matters that were not his proper place. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7fzmi", "score_hidden": false, "stickied": false, "created": 1492113490.0, "created_utc": 1492084690.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg7gv4f", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "smilingkevin", "parent_id": "t1_dg71ztc", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Thanks for my daily reminder that everything is far more complicated than it seems and somewhere there's a group of experts, who know far more about it than I do, who can still disagree about it.\n\nIt's an important lesson that can be applied in many, many areas of life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for my daily reminder that everything is far more complicated than it seems and somewhere there&amp;#39;s a group of experts, who know far more about it than I do, who can still disagree about it.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s an important lesson that can be applied in many, many areas of life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7gv4f", "score_hidden": false, "stickied": false, "created": 1492115116.0, "created_utc": 1492086316.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg7amvw", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "TriceratopsAREreal", "parent_id": "t1_dg79swb", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "They had already had several cities completely destroyed by bombing with horrific casualties throughout the war. The argument is that another 2 cities having been destroyed didn't factor into their decision making as much as the idea of a Russian invasion and occupancy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They had already had several cities completely destroyed by bombing with horrific casualties throughout the war. The argument is that another 2 cities having been destroyed didn&amp;#39;t factor into their decision making as much as the idea of a Russian invasion and occupancy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7amvw", "score_hidden": false, "stickied": false, "created": 1492098617.0, "created_utc": 1492069817.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}, "user_reports": [], "id": "dg79swb", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "BarkinBear", "parent_id": "t1_dg71ztc", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 1, "body": "How can nuclear bombs ever play a small role in decision making? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How can nuclear bombs ever play a small role in decision making? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg79swb", "score_hidden": false, "stickied": false, "created": 1492096300.0, "created_utc": 1492067500.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg71ztc", "gilded": 0, "archived": false, "score": 316, "report_reasons": null, "author": "Tiddums", "parent_id": "t3_652gq2", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "The article may or may not be making mistakes, it doesn't seem to be available to me on my phone. However this is a topic that has been extensively discussed by historians and the Russian attack is recognized as an important factor in the surrender. Some argue that the atomic bombs were the most important, at the other extreme some argue that the  atomic bombs had little or no impact. This is naturally also a topic extensively discussed on AskHistorians.\n\nhttps://www.reddit.com/r/AskHistorians/comments/62743u/ive_heard_people_say_that_the_russian_invasion_of/?ref=search_posts\n\nThat is the most recent question we had on it, 15 days ago, which also links the same source.\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The article may or may not be making mistakes, it doesn&amp;#39;t seem to be available to me on my phone. However this is a topic that has been extensively discussed by historians and the Russian attack is recognized as an important factor in the surrender. Some argue that the atomic bombs were the most important, at the other extreme some argue that the  atomic bombs had little or no impact. This is naturally also a topic extensively discussed on AskHistorians.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/62743u/ive_heard_people_say_that_the_russian_invasion_of/?ref=search_posts\"&gt;https://www.reddit.com/r/AskHistorians/comments/62743u/ive_heard_people_say_that_the_russian_invasion_of/?ref=search_posts&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;That is the most recent question we had on it, 15 days ago, which also links the same source.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg71ztc", "score_hidden": false, "stickied": false, "created": 1492081844.0, "created_utc": 1492053044.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 316}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg7llk3", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "SnowblindAlbino", "parent_id": "t1_dg7fuzc", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "&gt; If you are interested in getting into the details, Hasegawa's Racing the Enemy  does a good job of marshaling the long and drawn-out story of the final days of the war. \n\nThere are also [tremendous caches of U.S. primary sources](http://nsarchive.gwu.edu/NSAEBB/NSAEBB162/) on this topisc available online. The [minutes of the Target Committee](http://nsarchive.gwu.edu/NSAEBB/NSAEBB162/6.pdf) I think are especially enlightening.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If you are interested in getting into the details, Hasegawa&amp;#39;s Racing the Enemy  does a good job of marshaling the long and drawn-out story of the final days of the war. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There are also &lt;a href=\"http://nsarchive.gwu.edu/NSAEBB/NSAEBB162/\"&gt;tremendous caches of U.S. primary sources&lt;/a&gt; on this topisc available online. The &lt;a href=\"http://nsarchive.gwu.edu/NSAEBB/NSAEBB162/6.pdf\"&gt;minutes of the Target Committee&lt;/a&gt; I think are especially enlightening.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7llk3", "score_hidden": false, "stickied": false, "created": 1492121805.0, "created_utc": 1492093005.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7fuzc", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "restricteddata", "parent_id": "t3_652gq2", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "This has been discussed endlessly in other threads on this subreddit (and I need to just make a blog post that I can point people to), but a very short answer:\n\n* in the last 15 years or so historians have become increasingly attentive to the fact that the Soviet invasion of Manchuria had a huge effect on the Japanese high command\n\n* but disentangling the \"effect\" of the atomic bombs vs. the Soviet invasion on the Japanese high command is difficult and potentially impossible\n\n* there are various people, including those from the WWII period, who have argued that Japan would have surrendered without the atomic bombs (and just the Soviet invasion), there are also those who have argued that it would needed both, there are even those who think they would have folded soon without either and without an invasion (this includes the US Strategic Bombing Survey of 1946)\n\n* an even harder question is whether Japan would have surrendered with _just_ the atomic bombs, and not the Soviet invasion — this is rarely asked but sharpens the point much more clearly about causality. \n\n* these counterfactuals are interesting even if they are ultimately unanswerable. They call our attention to aspects that get neglected in the \"orthodox\" and \"revisionist\" narratives.\n\n* For whatever it is worth, my reading of the literature suggests that the Soviet invasion had a big effect on swaying the military forces of the high command towards a surrender, but, again, it is not possible to disentangle the events very easily. It is worth keeping in mind that neither the atomic bombs nor the invasion had an instantaneous effect at getting the Japanese to accept unconditional surrender — the initial Japanese surrender was less than that, and there were several days of negotiation (and even an attempted coup) before the final surrender was achieved. \n\n* In any case, the traditional argument — two atomic bombs and they folded up in fear — is oversimplified and missing a lot. There was a lot more going on at the time on the Japanese side of things, to say nothing of the Soviet and American. \n\nIf you are interested in getting into the details, Hasegawa's _Racing the Enemy_ does a good job of marshaling the long and drawn-out story of the final days of the war. He falls on the side of the Soviet invasion being a key part of the issue, and thinks the Soviet entry alone might have ended the war (prior to invasion) without the atomic bombs. He also thinks that the bombs _without_ the Soviet entry would not have been compelling. But he also believes that the exact result achieved (the Japanese surrendering in mid-August 1945) was the result of _both_. It is worth the read if you are curious about these things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This has been discussed endlessly in other threads on this subreddit (and I need to just make a blog post that I can point people to), but a very short answer:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;in the last 15 years or so historians have become increasingly attentive to the fact that the Soviet invasion of Manchuria had a huge effect on the Japanese high command&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;but disentangling the &amp;quot;effect&amp;quot; of the atomic bombs vs. the Soviet invasion on the Japanese high command is difficult and potentially impossible&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;there are various people, including those from the WWII period, who have argued that Japan would have surrendered without the atomic bombs (and just the Soviet invasion), there are also those who have argued that it would needed both, there are even those who think they would have folded soon without either and without an invasion (this includes the US Strategic Bombing Survey of 1946)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;an even harder question is whether Japan would have surrendered with &lt;em&gt;just&lt;/em&gt; the atomic bombs, and not the Soviet invasion — this is rarely asked but sharpens the point much more clearly about causality. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;these counterfactuals are interesting even if they are ultimately unanswerable. They call our attention to aspects that get neglected in the &amp;quot;orthodox&amp;quot; and &amp;quot;revisionist&amp;quot; narratives.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;For whatever it is worth, my reading of the literature suggests that the Soviet invasion had a big effect on swaying the military forces of the high command towards a surrender, but, again, it is not possible to disentangle the events very easily. It is worth keeping in mind that neither the atomic bombs nor the invasion had an instantaneous effect at getting the Japanese to accept unconditional surrender — the initial Japanese surrender was less than that, and there were several days of negotiation (and even an attempted coup) before the final surrender was achieved. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In any case, the traditional argument — two atomic bombs and they folded up in fear — is oversimplified and missing a lot. There was a lot more going on at the time on the Japanese side of things, to say nothing of the Soviet and American. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;If you are interested in getting into the details, Hasegawa&amp;#39;s &lt;em&gt;Racing the Enemy&lt;/em&gt; does a good job of marshaling the long and drawn-out story of the final days of the war. He falls on the side of the Soviet invasion being a key part of the issue, and thinks the Soviet entry alone might have ended the war (prior to invasion) without the atomic bombs. He also thinks that the bombs &lt;em&gt;without&lt;/em&gt; the Soviet entry would not have been compelling. But he also believes that the exact result achieved (the Japanese surrendering in mid-August 1945) was the result of &lt;em&gt;both&lt;/em&gt;. It is worth the read if you are curious about these things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7fuzc", "score_hidden": false, "stickied": false, "created": 1492113227.0, "created_utc": 1492084427.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg7cubj", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "KholdStare88", "parent_id": "t1_dg7bioy", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "This is a very interesting read, thank you. The part about the atomic bomb being a comparable heavenly power to the emperor was particularly quite a clever PR strategy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a very interesting read, thank you. The part about the atomic bomb being a comparable heavenly power to the emperor was particularly quite a clever PR strategy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7cubj", "score_hidden": false, "stickied": false, "created": 1492105295.0, "created_utc": 1492076495.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7bioy", "gilded": 0, "archived": false, "score": 76, "report_reasons": null, "author": "XinXin2", "parent_id": "t3_652gq2", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[I've commented on this on r/history before](https://www.reddit.com/r/history/comments/5o4jvb/comment/dcha63l?st=1Z141Z3&amp;sh=1d53181d), gonna copy paste the relevant text here plus minor edits for readability.\n\nMost importantly, the news of the atomic bomb did not reach the Japanese leadership until *after* the Emperor had made it clear his intention to surrender in his inner circle on August 9. This was because the communication lines were completely obliterated, therefore they had to send a team to inspect the situation and so the report was only confirmed on August 10 - after the decision was made. Thus, any claim of a causal link is highly tenuous.\n\nSecondly, as many have stated before, the annihilation of cities was nothing new as the incendiary bomb campaign was already devastating. The deaths of the firebombing campaign numbered 100,000 in the Tokyo campaign on March 9, not to mention the fact that sixty-six other cities were either demolished or partially demolished by the bombing campaign. Additionally, as stated above, the report had to be made by a surveying team hastily, meaning the information gathered was likely insufficient to truly comprehend the magnitude of the bomb.\n\nAlternatively, revisionist historians tend to look at the Soviet invasion as the cause of surrender. The communications between the Soviets and Japanese right before their surrender strongly suggest that the Soviet invasion was what really forced their surrender. While the atomic bomb came after the decision was made, there is a strong chronological chain that dictates the events of the Japanese being betrayed by the once-neutral Soviets until they chose surrender based on their communications. \n\nThe reason for this is because the Soviet incursion threatened more than just the lives of the Japanese, it threatened the sovereignty of their land. The Japanese feared that if they did not surrender immediately, they would lose \"not only Manchuria, Korea, and Karafuto, but also Hokkaido\" - a quote by Prime Minister Suzuki during the debate over surrender.\n\nTraditionalist historians like to argue that the atomic bomb had a major impact but one may find that this was fundamentally political in nature - both for Japanese and Americans.\n\nFor the Japanese, it was ultimately the best way for them to surrender while retaining their dignity and land. If they had claimed surrender because of the Soviets, they first admit that they lost the war fairly in military strength. Instead, blaming the atomic bomb allows them to claim it was because of some nearly otherworldly power that was comparable to the celestial might of their Emperor, which is cogent with the narrative of how the bomb was portrayed as a godlike weapon capable of wiping entire cities compared to the firebombing campaign which unarguably achieved far more.\n\nAdditionally, the Soviets would have far less negotiating power in the settlements that follow, benefitting both Japanese and Americans. As the Americans were claimed by the Japanese to be the cause of surrender, they would have first pickings in all negotiations with Japan. The Japanese knew that the Americans were far less pernicious than the Soviets in how they treated sovereign land, and so they opted to have them be their overlords rather than the expansionist Soviets. \n\nLastly, for the Americans, the atomic bomb was a show of force against the Soviets. The atomic bomb was a deterrence tool back then just as much as it is now, even more so as the Soviets had not yet developed their own. The political benefit of showing off their atomic bomb rendered a massive boost to the clout of America in any  negotiations; the bomb was a whiff of the strength of a global superpower. Thus, both sides sang the same tune because it was politically beneficial - and historians in the same vein sang along as well, supported by the governments and the documents they were to release.\n\nI've left out a great deal of the subtle details, but do trust me in echoing the views of the revisionists. The subtleties of the events that spanned that critical week or so leading up to surrender are absolutely damning to any and all implication that the atomic bomb was any cause for surrender.\n\nIf you're interested in further reading, Tsuyoshi Hasegawa is the man. Speaking English, Russian *and* Japanese, he's unmatched in his range of covered sources. What I write in this post is essentially me just summarising part of his narrative as far as I can, so you can consider him my main source (the book is Racing the Enemy, on mobile so it's troublesome to copy-paste the full title)", "edited": 1492072790.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/history/comments/5o4jvb/comment/dcha63l?st=1Z141Z3&amp;amp;sh=1d53181d\"&gt;I&amp;#39;ve commented on this on r/history before&lt;/a&gt;, gonna copy paste the relevant text here plus minor edits for readability.&lt;/p&gt;\n\n&lt;p&gt;Most importantly, the news of the atomic bomb did not reach the Japanese leadership until &lt;em&gt;after&lt;/em&gt; the Emperor had made it clear his intention to surrender in his inner circle on August 9. This was because the communication lines were completely obliterated, therefore they had to send a team to inspect the situation and so the report was only confirmed on August 10 - after the decision was made. Thus, any claim of a causal link is highly tenuous.&lt;/p&gt;\n\n&lt;p&gt;Secondly, as many have stated before, the annihilation of cities was nothing new as the incendiary bomb campaign was already devastating. The deaths of the firebombing campaign numbered 100,000 in the Tokyo campaign on March 9, not to mention the fact that sixty-six other cities were either demolished or partially demolished by the bombing campaign. Additionally, as stated above, the report had to be made by a surveying team hastily, meaning the information gathered was likely insufficient to truly comprehend the magnitude of the bomb.&lt;/p&gt;\n\n&lt;p&gt;Alternatively, revisionist historians tend to look at the Soviet invasion as the cause of surrender. The communications between the Soviets and Japanese right before their surrender strongly suggest that the Soviet invasion was what really forced their surrender. While the atomic bomb came after the decision was made, there is a strong chronological chain that dictates the events of the Japanese being betrayed by the once-neutral Soviets until they chose surrender based on their communications. &lt;/p&gt;\n\n&lt;p&gt;The reason for this is because the Soviet incursion threatened more than just the lives of the Japanese, it threatened the sovereignty of their land. The Japanese feared that if they did not surrender immediately, they would lose &amp;quot;not only Manchuria, Korea, and Karafuto, but also Hokkaido&amp;quot; - a quote by Prime Minister Suzuki during the debate over surrender.&lt;/p&gt;\n\n&lt;p&gt;Traditionalist historians like to argue that the atomic bomb had a major impact but one may find that this was fundamentally political in nature - both for Japanese and Americans.&lt;/p&gt;\n\n&lt;p&gt;For the Japanese, it was ultimately the best way for them to surrender while retaining their dignity and land. If they had claimed surrender because of the Soviets, they first admit that they lost the war fairly in military strength. Instead, blaming the atomic bomb allows them to claim it was because of some nearly otherworldly power that was comparable to the celestial might of their Emperor, which is cogent with the narrative of how the bomb was portrayed as a godlike weapon capable of wiping entire cities compared to the firebombing campaign which unarguably achieved far more.&lt;/p&gt;\n\n&lt;p&gt;Additionally, the Soviets would have far less negotiating power in the settlements that follow, benefitting both Japanese and Americans. As the Americans were claimed by the Japanese to be the cause of surrender, they would have first pickings in all negotiations with Japan. The Japanese knew that the Americans were far less pernicious than the Soviets in how they treated sovereign land, and so they opted to have them be their overlords rather than the expansionist Soviets. &lt;/p&gt;\n\n&lt;p&gt;Lastly, for the Americans, the atomic bomb was a show of force against the Soviets. The atomic bomb was a deterrence tool back then just as much as it is now, even more so as the Soviets had not yet developed their own. The political benefit of showing off their atomic bomb rendered a massive boost to the clout of America in any  negotiations; the bomb was a whiff of the strength of a global superpower. Thus, both sides sang the same tune because it was politically beneficial - and historians in the same vein sang along as well, supported by the governments and the documents they were to release.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve left out a great deal of the subtle details, but do trust me in echoing the views of the revisionists. The subtleties of the events that spanned that critical week or so leading up to surrender are absolutely damning to any and all implication that the atomic bomb was any cause for surrender.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re interested in further reading, Tsuyoshi Hasegawa is the man. Speaking English, Russian &lt;em&gt;and&lt;/em&gt; Japanese, he&amp;#39;s unmatched in his range of covered sources. What I write in this post is essentially me just summarising part of his narrative as far as I can, so you can consider him my main source (the book is Racing the Enemy, on mobile so it&amp;#39;s troublesome to copy-paste the full title)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7bioy", "score_hidden": false, "stickied": false, "created": 1492101221.0, "created_utc": 1492072421.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 76}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg7f9ky", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "DBHT14", "parent_id": "t1_dg7f3dk", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "A few things are wrong with that timeline. 1 is that the timing of Nagasaki was not fixed. And in fact was moved up in time when the original date appeared unusable due to approaching weather. \n\nWhile the US did indeed have another bomb soon ready. The so-called \"3rd shot\" would have been ready by the last week of August. While Los Alamos would have been producing 2-3 bombs per month at that point. However there was debate over using them as they arrived, or saving them to directly support the invasion in November.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A few things are wrong with that timeline. 1 is that the timing of Nagasaki was not fixed. And in fact was moved up in time when the original date appeared unusable due to approaching weather. &lt;/p&gt;\n\n&lt;p&gt;While the US did indeed have another bomb soon ready. The so-called &amp;quot;3rd shot&amp;quot; would have been ready by the last week of August. While Los Alamos would have been producing 2-3 bombs per month at that point. However there was debate over using them as they arrived, or saving them to directly support the invasion in November.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7f9ky", "score_hidden": false, "stickied": false, "created": 1492111946.0, "created_utc": 1492083146.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dgaanpu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SnowblindAlbino", "parent_id": "t1_dgaajt9", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "No *textbooks*, correct, but definately lots of *books*. I've required a dozen or more for many classes in fact, but they don't cost anything like textbook prices so the total generally comes in around $200 at used prices. Over the last few years our library has built a pretty good collection of unlimited circulation ebooks too, so I've moved toward assigning lots of those...this semester I have a class for which I only ordered four books that might cost $75 total, but we are using 40+ other books from the library collections (a chapter or two from each, which I would never do if I required students to pay for the book).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No &lt;em&gt;textbooks&lt;/em&gt;, correct, but definately lots of &lt;em&gt;books&lt;/em&gt;. I&amp;#39;ve required a dozen or more for many classes in fact, but they don&amp;#39;t cost anything like textbook prices so the total generally comes in around $200 at used prices. Over the last few years our library has built a pretty good collection of unlimited circulation ebooks too, so I&amp;#39;ve moved toward assigning lots of those...this semester I have a class for which I only ordered four books that might cost $75 total, but we are using 40+ other books from the library collections (a chapter or two from each, which I would never do if I required students to pay for the book).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgaanpu", "score_hidden": false, "stickied": false, "created": 1492260213.0, "created_utc": 1492231413.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaajt9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Maugabvag", "parent_id": "t1_dg9o51k", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "What?!? No textbooks, that would save me soooo much money ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What?!? No textbooks, that would save me soooo much money &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgaajt9", "score_hidden": false, "stickied": false, "created": 1492260023.0, "created_utc": 1492231223.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9o51k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SnowblindAlbino", "parent_id": "t1_dg8kpc3", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "&gt; Interesting, well the textbook we used was \"Give Me Liberty: An American History\" Vol 2.\n\nWe don't use textbooks at my school, so that's probably part of it; instead the faculty put together readers, assign primary sources, and use monographs that offer more depth. If you're stuck with a textbook for some reason though (many large schools require it) there's no reason not to supplement with more complete materials on critical issues...and this would likely be one. I devote two full class days to the Manhattan Project and the bombing in my 100 level classes, so students would read a couple of articles on the creating of the bomb and the decision to use it, and would work with some of the easily accessible primary sources, like the minutes of the target committee and the testimonies of Hibakusha. If a class is simply a sprint from 1865-2000 using a common textbook with no additional materials I suppose there might not be time to talk about the bomb in any depth, but that's no way to teach a class in my opinion anyway.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Interesting, well the textbook we used was &amp;quot;Give Me Liberty: An American History&amp;quot; Vol 2.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;We don&amp;#39;t use textbooks at my school, so that&amp;#39;s probably part of it; instead the faculty put together readers, assign primary sources, and use monographs that offer more depth. If you&amp;#39;re stuck with a textbook for some reason though (many large schools require it) there&amp;#39;s no reason not to supplement with more complete materials on critical issues...and this would likely be one. I devote two full class days to the Manhattan Project and the bombing in my 100 level classes, so students would read a couple of articles on the creating of the bomb and the decision to use it, and would work with some of the easily accessible primary sources, like the minutes of the target committee and the testimonies of Hibakusha. If a class is simply a sprint from 1865-2000 using a common textbook with no additional materials I suppose there might not be time to talk about the bomb in any depth, but that&amp;#39;s no way to teach a class in my opinion anyway.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg9o51k", "score_hidden": false, "stickied": false, "created": 1492229143.0, "created_utc": 1492200343.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8kpc3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Maugabvag", "parent_id": "t1_dg7lh20", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Interesting, well the textbook we used was \"Give Me Liberty: An American History\" Vol 2.\n\nI thought he was a good professor, now I feel robbed of a history lesson!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting, well the textbook we used was &amp;quot;Give Me Liberty: An American History&amp;quot; Vol 2.&lt;/p&gt;\n\n&lt;p&gt;I thought he was a good professor, now I feel robbed of a history lesson!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8kpc3", "score_hidden": false, "stickied": false, "created": 1492162957.0, "created_utc": 1492134157.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7lh20", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "SnowblindAlbino", "parent_id": "t1_dg7i2uj", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "&gt; I took a college history course in Texas over the summer and learned pretty much the same thing with a few minor differences. There was definitely never a mention of an impending Soviet invasion though\n\nThat's interesting. I teach college history and have covered this topic in my 100-level courses for 25+ years. In every case we go into depth on Russian plans and the intricacies of the motives behind the decisions about if/when/where to use the bomb. I have my students read [primary sources from the US side](http://nsarchive.gwu.edu/NSAEBB/NSAEBB162/), and oral histories from the Japanese. It's standard practice, so if your college professor gave you a high school version of this topic you either got a bad instructor or someone who doesn't know what they're talking about.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I took a college history course in Texas over the summer and learned pretty much the same thing with a few minor differences. There was definitely never a mention of an impending Soviet invasion though&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s interesting. I teach college history and have covered this topic in my 100-level courses for 25+ years. In every case we go into depth on Russian plans and the intricacies of the motives behind the decisions about if/when/where to use the bomb. I have my students read &lt;a href=\"http://nsarchive.gwu.edu/NSAEBB/NSAEBB162/\"&gt;primary sources from the US side&lt;/a&gt;, and oral histories from the Japanese. It&amp;#39;s standard practice, so if your college professor gave you a high school version of this topic you either got a bad instructor or someone who doesn&amp;#39;t know what they&amp;#39;re talking about.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7lh20", "score_hidden": false, "stickied": false, "created": 1492121655.0, "created_utc": 1492092855.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7i2uj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg7f3dk", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 1, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7i2uj", "score_hidden": false, "stickied": false, "created": 1492117074.0, "created_utc": 1492088274.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg7jnwh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg7f3dk", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7jnwh", "score_hidden": false, "stickied": false, "created": 1492119332.0, "created_utc": 1492090532.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7f3dk", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "sweetgreggo", "parent_id": "t3_652gq2", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 1, "body": "Wow, TIL. In high school (Texas, mid-80s) we were taught:\n\n\"We ombed Hiroshima and told the emperor we would drop another one in 3 days if he didn't surrender. \n\n3 days later we bombed Nagasaki and told the emperor we would bomb TOKYO in 3 days if he didn't surrender. \n\n3 days later he surrendered, which was good because we really didn't have another bomb.\"\n\nI don't remember anything about a Russian invasion. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, TIL. In high school (Texas, mid-80s) we were taught:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;We ombed Hiroshima and told the emperor we would drop another one in 3 days if he didn&amp;#39;t surrender. &lt;/p&gt;\n\n&lt;p&gt;3 days later we bombed Nagasaki and told the emperor we would bomb TOKYO in 3 days if he didn&amp;#39;t surrender. &lt;/p&gt;\n\n&lt;p&gt;3 days later he surrendered, which was good because we really didn&amp;#39;t have another bomb.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t remember anything about a Russian invasion. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7f3dk", "score_hidden": false, "stickied": false, "created": 1492111556.0, "created_utc": 1492082756.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg7mdyu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jschooltiger", "parent_id": "t1_dg7lq97", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "We ask that answers in this subreddit be in-depth and comprehensive, and highly suggest that comments include citations for the information. In the future, please take the time to better familiarize yourself with [the rules](http://www.reddit.com/r/AskHistorians/wiki/rules#wiki_write_an_in-depth_answer), and take these key points into account before crafting an answer:\n\n* [Do I have the expertise needed to answer this question?](https://www.reddit.com/r/AskHistorians/comments/1jsabs/what_it_means_to_post_a_good_answer_in/)\n* [Have I done research on this question?](https://www.reddit.com/r/AskHistorians/comments/4kngwh/rules_roundtable_no_11_no_speculation/)\n* [Can I cite my sources?](https://www.reddit.com/r/AskHistorians/comments/3wn71y/rules_roundtable_1_explaining_the_rules_about/)\n* Can I answer follow-up questions?\n\nThank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We ask that answers in this subreddit be in-depth and comprehensive, and highly suggest that comments include citations for the information. In the future, please take the time to better familiarize yourself with &lt;a href=\"http://www.reddit.com/r/AskHistorians/wiki/rules#wiki_write_an_in-depth_answer\"&gt;the rules&lt;/a&gt;, and take these key points into account before crafting an answer:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/1jsabs/what_it_means_to_post_a_good_answer_in/\"&gt;Do I have the expertise needed to answer this question?&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/4kngwh/rules_roundtable_no_11_no_speculation/\"&gt;Have I done research on this question?&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/3wn71y/rules_roundtable_1_explaining_the_rules_about/\"&gt;Can I cite my sources?&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Can I answer follow-up questions?&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7mdyu", "score_hidden": false, "stickied": false, "created": 1492122733.0, "created_utc": 1492093933.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7lq97", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_652gq2", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7lq97", "score_hidden": false, "stickied": false, "created": 1492121960.0, "created_utc": 1492093160.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg7n27g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BobtheBarbarian2112", "parent_id": "t3_652gq2", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "What do the Japanese say about this? I think they might have the definitive answer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What do the Japanese say about this? I think they might have the definitive answer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7n27g", "score_hidden": false, "stickied": false, "created": 1492123515.0, "created_utc": 1492094715.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg7jae7", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Kalarian_Reborn", "parent_id": "t3_652gq2", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Follow up, Japanese and US sources said that Japan was negotiating the surrender and verbally agreed 2 days before Hiroshima but the US dropped the bombs anyway. Why were those documents ignored?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Follow up, Japanese and US sources said that Japan was negotiating the surrender and verbally agreed 2 days before Hiroshima but the US dropped the bombs anyway. Why were those documents ignored?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7jae7", "score_hidden": false, "stickied": false, "created": 1492118829.0, "created_utc": 1492090029.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_652gq2", "likes": null, "replies": "", "user_reports": [], "id": "dg73623", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ThucydidesWasAwesome", "parent_id": "t1_dg71y0z", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "We ask that answers in this subreddit be in-depth and comprehensive, and highly suggest that comments include citations for the information. In the future, please take the time to better familiarize yourself with [the rules](http://www.reddit.com/r/AskHistorians/wiki/rules#wiki_write_an_in-depth_answer), and take these key points into account before crafting an answer:\n\n* [Do I have the expertise needed to answer this question?](https://www.reddit.com/r/AskHistorians/comments/1jsabs/what_it_means_to_post_a_good_answer_in/)\n* [Have I done research on this question?](https://www.reddit.com/r/AskHistorians/comments/4kngwh/rules_roundtable_no_11_no_speculation/)\n* [Can I cite my sources?](https://www.reddit.com/r/AskHistorians/comments/3wn71y/rules_roundtable_1_explaining_the_rules_about/)\n* Can I answer follow-up questions?\n\nThank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We ask that answers in this subreddit be in-depth and comprehensive, and highly suggest that comments include citations for the information. In the future, please take the time to better familiarize yourself with &lt;a href=\"http://www.reddit.com/r/AskHistorians/wiki/rules#wiki_write_an_in-depth_answer\"&gt;the rules&lt;/a&gt;, and take these key points into account before crafting an answer:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/1jsabs/what_it_means_to_post_a_good_answer_in/\"&gt;Do I have the expertise needed to answer this question?&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/4kngwh/rules_roundtable_no_11_no_speculation/\"&gt;Have I done research on this question?&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/3wn71y/rules_roundtable_1_explaining_the_rules_about/\"&gt;Can I cite my sources?&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Can I answer follow-up questions?&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg73623", "score_hidden": false, "stickied": false, "created": 1492083502.0, "created_utc": 1492054702.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg71y0z", "gilded": 0, "archived": false, "score": -11, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_652gq2", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg71y0z", "score_hidden": false, "stickied": false, "created": 1492081779.0, "created_utc": 1492052979.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -11}}], "after": null, "before": null}}]