[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was just reading up on Julius caesar and several other early  Roman emperors and it seems like they rarely had biological children. Caesar had one daughter and a son by cleopatra, Octavian not had one daughter, and so on. Why is that? You think they would&amp;#39;ve put more emphasis on continuing the dynasty. Maybe it&amp;#39;s just that I&amp;#39;ve playing to much ck2 and watching too much game of thrones, I don&amp;#39;t know but it just seems odd that these emperors didn&amp;#39;t really try and have plenty of children to pass the throne onto. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I was just reading up on Julius caesar and several other early  Roman emperors and it seems like they rarely had biological children. Caesar had one daughter and a son by cleopatra, Octavian not had one daughter, and so on. Why is that? You think they would've put more emphasis on continuing the dynasty. Maybe it's just that I've playing to much ck2 and watching too much game of thrones, I don't know but it just seems odd that these emperors didn't really try and have plenty of children to pass the throne onto. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "653l8e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 191, "report_reasons": null, "author": "ImperialxWarlord", "saved": false, "mod_reports": [], "name": "t3_653l8e", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/653l8e/why_did_so_many_roman_emperors_not_have_children/", "num_reports": null, "locked": false, "stickied": false, "created": 1492089629.0, "url": "https://www.reddit.com/r/AskHistorians/comments/653l8e/why_did_so_many_roman_emperors_not_have_children/", "author_flair_text": null, "quarantine": false, "title": "Why did so many Roman emperors not have children", "created_utc": 1492060829.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 191}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_653l8e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_653l8e", "likes": null, "replies": "", "user_reports": [], "id": "dg7y3nu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ImperialxWarlord", "parent_id": "t1_dg7lgwi", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "It's just so wierd that they failed to have many children. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s just so wierd that they failed to have many children. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7y3nu", "score_hidden": false, "stickied": false, "created": 1492135348.0, "created_utc": 1492106548.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7lgwi", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "tinwhiskerSC", "parent_id": "t3_653l8e", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "This previous thread may shed some light here.\nr/AskHistorians/comments/287h6e/why_did_so_many_roman_emperors_adopt_their/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This previous thread may shed some light here.\n&lt;a href=\"/r/AskHistorians/comments/287h6e/why_did_so_many_roman_emperors_adopt_their/\"&gt;r/AskHistorians/comments/287h6e/why_did_so_many_roman_emperors_adopt_their/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7lgwi", "score_hidden": false, "stickied": false, "created": 1492121649.0, "created_utc": 1492092849.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_653l8e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_653l8e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_653l8e", "likes": null, "replies": "", "user_reports": [], "id": "dg8j6ug", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "anax_junius", "parent_id": "t1_dg8hbse", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Yup; I just didn't want to derail too much, since things were getting pretty long. \n\nI have a \"Livia Did It\" shirt in which she's surrounded by murders; Livia Augusta is great.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yup; I just didn&amp;#39;t want to derail too much, since things were getting pretty long. &lt;/p&gt;\n\n&lt;p&gt;I have a &amp;quot;Livia Did It&amp;quot; shirt in which she&amp;#39;s surrounded by murders; Livia Augusta is great.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8j6ug", "score_hidden": false, "stickied": false, "created": 1492160869.0, "created_utc": 1492132069.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8hbse", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Zama174", "parent_id": "t1_dg8cg4u", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Its also important to note in the case of Tiberius that his exile was as much self imposed as forced upon him. His mother had always been the one driving his political career, and of course roman histories write her off as having somehow engineered the deaths of all of Tiberius's rivals for powers. Some accounts even go so far as to say that she poisoned Augusts as well, however it is very important to remember that the \"evil step mother\" was one of the most common tropes in ancient histories and one which historians of the roman era fully endorsed and used numerous times against the women of the royal family who earned their ere. \n\nThat being said, Tiberius refused Augustus and withdrew himself from being Ceaser and co-ruler. The historical record is mixed on if he simply just did not enjoy the task, or if at the time he knew he was only a stop gap measure until Germanicus came of age. The act left Augustus so angry that he vowed to never let Tiberius return, and for several years that was the case and it was only after all his other heirs had died, and with much pressure from Livia that Tiberius was allowed to return. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its also important to note in the case of Tiberius that his exile was as much self imposed as forced upon him. His mother had always been the one driving his political career, and of course roman histories write her off as having somehow engineered the deaths of all of Tiberius&amp;#39;s rivals for powers. Some accounts even go so far as to say that she poisoned Augusts as well, however it is very important to remember that the &amp;quot;evil step mother&amp;quot; was one of the most common tropes in ancient histories and one which historians of the roman era fully endorsed and used numerous times against the women of the royal family who earned their ere. &lt;/p&gt;\n\n&lt;p&gt;That being said, Tiberius refused Augustus and withdrew himself from being Ceaser and co-ruler. The historical record is mixed on if he simply just did not enjoy the task, or if at the time he knew he was only a stop gap measure until Germanicus came of age. The act left Augustus so angry that he vowed to never let Tiberius return, and for several years that was the case and it was only after all his other heirs had died, and with much pressure from Livia that Tiberius was allowed to return. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8hbse", "score_hidden": false, "stickied": false, "created": 1492158329.0, "created_utc": 1492129529.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_653l8e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_653l8e", "likes": null, "replies": "", "user_reports": [], "id": "dg9c0mk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "anax_junius", "parent_id": "t1_dg8v5ja", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Sure. I was trying to shorthand for length, but what I'm referring to is the undiagnosed mental illness of Tiberius (late in his rule), Caligula, and Nero. \n\nAny modern diagnosis would be deeply questionable due to the writing of hostile historians and the general treatment of historic writing at the time. By that I mean that histories were usually written as a form of propaganda, writers were not expected to cite sources or be impartial in a modern manner, and it was common to include heroic/villainous tropes like \"evil stepmother poisoner\" whose historicity is debateable.\n\n(I am specifically not including Claudius in that list because while I know some historians have been hostile to him, I think the evidence supports him being a reasonably capable and sensible ruler. I'm particularly fond of Mike Duncan's \"History of Rome\" series as a secondary source that defends Claudius. I know that the portrayal of Tiberius as a tyrant late in his rule is heavily shaped by Suetonius and Tacitus as well, but because he was the emperor and functionally abdicated his duties when he went to Capri, I believe he bears at least some culpability for the better-supported purges and actions of his Praetorian Prefect, Sejanus.)\n\nI was specifically trying to refer to these emperors' questionable stability and planning, rather than their popularity. So, uh... couldn't think of better phrasing there, that is my doing.\n\nWhile Suetonius and Tacitus's descriptions of character are very much questionable, I think we have some pretty good evidence that Tiberius, Caligula, and Nero were less interested than other Julio-Claudians in maintaining dynastic continuity.\n\n- During each of these emperors' reigns, many members of the imperial family died or were exiled under  suspicious circumstances. This directly undermined possible heirs within the imperial family. (In Tiberius' reign, Agrippina the Elder, Nero Caesar, Drusus Caesar. In Caligula's, Tiberius Gemellus, Antonia Minor, Marcus Junius Silanus, Marcus Lepidus, Agrippina the Younger, Julia Livilla. In Nero's, Nero's mother Agrippina, Claudia Octavia, Poppaea Sabina, as well as Britannicus before he began his rule.)\n\n- Suetonius and Tacitus claim that there were other significant purges during each of these emperors' reigns which undermined the political stability and power structure of the empire, and extravagant spending in Caligula and Nero's reigns which undermined economic stability. Those are somewhat questionable sources, but do suggest a lack of political continuity and stability.\n\n- They did not train an adequate heir. Other Roman emperors designated an adult heir and co-ruled with them, so that by the current emperor's death, the heir was essentially established and had already served as co-emperor for several years. Tiberius, Caligula, and Nero did not follow this pattern; they designated heirs, but these heirs' power and claim to the throne was much more questionable due to this lack.\n\nIt can be argued that Caligula and Nero's early deaths made this lack understandable, but it does indicate a lack of interest in succession during their lives. \n\n(Specifically, Tiberius had only promoted Caligula to quaestorship by Tiberius's death. Caligula designated several heirs, including his sister, but did not promote any of them up through the political ladder that would have established their credentials, nor did he co-rule with them. I don't believe Nero ever designated an heir at all.)\n\nSo while all three emperors did marry and produce biological children, and both Caligula and Nero died much too early to have produced adult blood-heirs, I believe that their failure to create or maintain political stability and their failure to have an heir \"ready to go\" in case of early demise demonstrates less focus on dynastic stability than Julius, Augustus, or Claudius.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure. I was trying to shorthand for length, but what I&amp;#39;m referring to is the undiagnosed mental illness of Tiberius (late in his rule), Caligula, and Nero. &lt;/p&gt;\n\n&lt;p&gt;Any modern diagnosis would be deeply questionable due to the writing of hostile historians and the general treatment of historic writing at the time. By that I mean that histories were usually written as a form of propaganda, writers were not expected to cite sources or be impartial in a modern manner, and it was common to include heroic/villainous tropes like &amp;quot;evil stepmother poisoner&amp;quot; whose historicity is debateable.&lt;/p&gt;\n\n&lt;p&gt;(I am specifically not including Claudius in that list because while I know some historians have been hostile to him, I think the evidence supports him being a reasonably capable and sensible ruler. I&amp;#39;m particularly fond of Mike Duncan&amp;#39;s &amp;quot;History of Rome&amp;quot; series as a secondary source that defends Claudius. I know that the portrayal of Tiberius as a tyrant late in his rule is heavily shaped by Suetonius and Tacitus as well, but because he was the emperor and functionally abdicated his duties when he went to Capri, I believe he bears at least some culpability for the better-supported purges and actions of his Praetorian Prefect, Sejanus.)&lt;/p&gt;\n\n&lt;p&gt;I was specifically trying to refer to these emperors&amp;#39; questionable stability and planning, rather than their popularity. So, uh... couldn&amp;#39;t think of better phrasing there, that is my doing.&lt;/p&gt;\n\n&lt;p&gt;While Suetonius and Tacitus&amp;#39;s descriptions of character are very much questionable, I think we have some pretty good evidence that Tiberius, Caligula, and Nero were less interested than other Julio-Claudians in maintaining dynastic continuity.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;During each of these emperors&amp;#39; reigns, many members of the imperial family died or were exiled under  suspicious circumstances. This directly undermined possible heirs within the imperial family. (In Tiberius&amp;#39; reign, Agrippina the Elder, Nero Caesar, Drusus Caesar. In Caligula&amp;#39;s, Tiberius Gemellus, Antonia Minor, Marcus Junius Silanus, Marcus Lepidus, Agrippina the Younger, Julia Livilla. In Nero&amp;#39;s, Nero&amp;#39;s mother Agrippina, Claudia Octavia, Poppaea Sabina, as well as Britannicus before he began his rule.)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Suetonius and Tacitus claim that there were other significant purges during each of these emperors&amp;#39; reigns which undermined the political stability and power structure of the empire, and extravagant spending in Caligula and Nero&amp;#39;s reigns which undermined economic stability. Those are somewhat questionable sources, but do suggest a lack of political continuity and stability.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;They did not train an adequate heir. Other Roman emperors designated an adult heir and co-ruled with them, so that by the current emperor&amp;#39;s death, the heir was essentially established and had already served as co-emperor for several years. Tiberius, Caligula, and Nero did not follow this pattern; they designated heirs, but these heirs&amp;#39; power and claim to the throne was much more questionable due to this lack.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;It can be argued that Caligula and Nero&amp;#39;s early deaths made this lack understandable, but it does indicate a lack of interest in succession during their lives. &lt;/p&gt;\n\n&lt;p&gt;(Specifically, Tiberius had only promoted Caligula to quaestorship by Tiberius&amp;#39;s death. Caligula designated several heirs, including his sister, but did not promote any of them up through the political ladder that would have established their credentials, nor did he co-rule with them. I don&amp;#39;t believe Nero ever designated an heir at all.)&lt;/p&gt;\n\n&lt;p&gt;So while all three emperors did marry and produce biological children, and both Caligula and Nero died much too early to have produced adult blood-heirs, I believe that their failure to create or maintain political stability and their failure to have an heir &amp;quot;ready to go&amp;quot; in case of early demise demonstrates less focus on dynastic stability than Julius, Augustus, or Claudius.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg9c0mk", "score_hidden": false, "stickied": false, "created": 1492214972.0, "created_utc": 1492186172.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8v5ja", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Miles_Sine_Castrum", "parent_id": "t1_dg8cg4u", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Can you expand a bit on the reasons for including scare-quotes on 'sane' and 'crazy'? I realise that 'crazy' emperors had their reputations shaped very much by hostile historians writing much later (Suetonius/Tacitus), so can we still say that they weren't focused on dynastic continuity?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you expand a bit on the reasons for including scare-quotes on &amp;#39;sane&amp;#39; and &amp;#39;crazy&amp;#39;? I realise that &amp;#39;crazy&amp;#39; emperors had their reputations shaped very much by hostile historians writing much later (Suetonius/Tacitus), so can we still say that they weren&amp;#39;t focused on dynastic continuity?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8v5ja", "score_hidden": false, "stickied": false, "created": 1492180842.0, "created_utc": 1492152042.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8cg4u", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "anax_junius", "parent_id": "t3_653l8e", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "At least as far as the Julio-Claudians, since that sounds like what you're interested in... They did try!\n\nJulius and Augustus both actually promoted \"rewards\" for people who had lots of children, and Augustus made adultery illegal and heavily punished, in order to try to increase the general birthrate.\n\nAll of the Julio-Claudian emperors had at least one child, usually more like three or four. I wouldn't be surprised if there were more stillbirths and miscarriages that weren't recorded; Roman records can be a little dicey.\n\nThe \"sane\" emperors often put *lots* of emphasis on continuing the dynasty; it was just a brutal and unstable time. And it didn't help that the \"crazy\" emperors like Tiberius and Caligula tended to murder whoever looked like a threat - family members were at the top of that list.\n\nFor instance, Augustus planned to have his grandkids, Gaius and Lucius, co-rule. But they died. He then planned to have his grandson Agrippa Postumus rule. But he was exiled and disowned, possibly for treason. Then he planned to have his step-son Tiberius rule, but he was exiled too, possibly for defying Augustus. Then he planned to have his step-son Drusus rule, but he died. Then he planned to have his grandson Germanicus rule, but he died. Then he was basically stuck with begging Tiberius to come back at the last minute, and that ended badly.\n\nIt was also less cemented in the Roman Empire that one's heir must be one's biological issue. The idea that a particular bloodline was divinely ordained didn't exist yet. Emperors tended to favor their own relatives, but what they really emphasized was continuity of governance. They didn't want the country to end up adrift without a captain, so they had to get *some* heir trained and already co-ruling by the time the current emperor died.\n\n(This is also why you don't see pre-teen Roman emperors.)\n\nI can get into the later empire if you're interested, but basically... The Roman Empire was *way* more unstable than you're probably imagining. There were small islands of dynastic rule, punctuated by big floes of \"whoever has the biggest army now, whoops, it's been six months and now you're dead.\" And when you're murdered after six months, you don't really have time to father and raise heirs.\n\nETA: To expand slightly on the last point: The longest dynasty during the (unified) Roman Empire lasted for seven emperors. Compare this to the English Plantagenet dynasty, which had 14 kings and was followed by the semi-related Tudor dynasty. Or the French Capetian dynasty, which had 36.\n\nRome didn't have the same tradition of \"the king is dead, long live the king\" that medieval and early modern Europe did; every transition of power was dangerous and uncertain, and there was no guarantee that the next king would be a blood relative.\n", "edited": 1492188549.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At least as far as the Julio-Claudians, since that sounds like what you&amp;#39;re interested in... They did try!&lt;/p&gt;\n\n&lt;p&gt;Julius and Augustus both actually promoted &amp;quot;rewards&amp;quot; for people who had lots of children, and Augustus made adultery illegal and heavily punished, in order to try to increase the general birthrate.&lt;/p&gt;\n\n&lt;p&gt;All of the Julio-Claudian emperors had at least one child, usually more like three or four. I wouldn&amp;#39;t be surprised if there were more stillbirths and miscarriages that weren&amp;#39;t recorded; Roman records can be a little dicey.&lt;/p&gt;\n\n&lt;p&gt;The &amp;quot;sane&amp;quot; emperors often put &lt;em&gt;lots&lt;/em&gt; of emphasis on continuing the dynasty; it was just a brutal and unstable time. And it didn&amp;#39;t help that the &amp;quot;crazy&amp;quot; emperors like Tiberius and Caligula tended to murder whoever looked like a threat - family members were at the top of that list.&lt;/p&gt;\n\n&lt;p&gt;For instance, Augustus planned to have his grandkids, Gaius and Lucius, co-rule. But they died. He then planned to have his grandson Agrippa Postumus rule. But he was exiled and disowned, possibly for treason. Then he planned to have his step-son Tiberius rule, but he was exiled too, possibly for defying Augustus. Then he planned to have his step-son Drusus rule, but he died. Then he planned to have his grandson Germanicus rule, but he died. Then he was basically stuck with begging Tiberius to come back at the last minute, and that ended badly.&lt;/p&gt;\n\n&lt;p&gt;It was also less cemented in the Roman Empire that one&amp;#39;s heir must be one&amp;#39;s biological issue. The idea that a particular bloodline was divinely ordained didn&amp;#39;t exist yet. Emperors tended to favor their own relatives, but what they really emphasized was continuity of governance. They didn&amp;#39;t want the country to end up adrift without a captain, so they had to get &lt;em&gt;some&lt;/em&gt; heir trained and already co-ruling by the time the current emperor died.&lt;/p&gt;\n\n&lt;p&gt;(This is also why you don&amp;#39;t see pre-teen Roman emperors.)&lt;/p&gt;\n\n&lt;p&gt;I can get into the later empire if you&amp;#39;re interested, but basically... The Roman Empire was &lt;em&gt;way&lt;/em&gt; more unstable than you&amp;#39;re probably imagining. There were small islands of dynastic rule, punctuated by big floes of &amp;quot;whoever has the biggest army now, whoops, it&amp;#39;s been six months and now you&amp;#39;re dead.&amp;quot; And when you&amp;#39;re murdered after six months, you don&amp;#39;t really have time to father and raise heirs.&lt;/p&gt;\n\n&lt;p&gt;ETA: To expand slightly on the last point: The longest dynasty during the (unified) Roman Empire lasted for seven emperors. Compare this to the English Plantagenet dynasty, which had 14 kings and was followed by the semi-related Tudor dynasty. Or the French Capetian dynasty, which had 36.&lt;/p&gt;\n\n&lt;p&gt;Rome didn&amp;#39;t have the same tradition of &amp;quot;the king is dead, long live the king&amp;quot; that medieval and early modern Europe did; every transition of power was dangerous and uncertain, and there was no guarantee that the next king would be a blood relative.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8cg4u", "score_hidden": false, "stickied": false, "created": 1492151763.0, "created_utc": 1492122963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_653l8e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_653l8e", "likes": null, "replies": "", "user_reports": [], "id": "dg7f2nv", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "commiespaceinvader", "parent_id": "t1_dg7e3oc", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "&gt; I am just making a guess\n\nThis reply has been removed for [speculation](http://www.reddit.com/r/AskHistorians/wiki/rules#wiki_no_speculation).  In the future, please be certain of your answer before hitting submit.  This rule is discussed further in [this Rules Roundtable](https://www.reddit.com/r/AskHistorians/comments/4kngwh/rules_roundtable_no_11_no_speculation/). Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I am just making a guess&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This reply has been removed for &lt;a href=\"http://www.reddit.com/r/AskHistorians/wiki/rules#wiki_no_speculation\"&gt;speculation&lt;/a&gt;.  In the future, please be certain of your answer before hitting submit.  This rule is discussed further in &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/4kngwh/rules_roundtable_no_11_no_speculation/\"&gt;this Rules Roundtable&lt;/a&gt;. Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7f2nv", "score_hidden": false, "stickied": false, "created": 1492111510.0, "created_utc": 1492082710.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7e3oc", "gilded": 0, "archived": false, "score": -16, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_653l8e", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7e3oc", "score_hidden": false, "stickied": false, "created": 1492109021.0, "created_utc": 1492080221.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -16}}], "after": null, "before": null}}]