[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The land area of the Balkans is similar to some European countries, but the region is inhabited by a large variety of ethnicities, such as Greeks, Albanians, Turks, Bulgarians, Serbs, Romanians and many others. Why did this happen, and why did it only happen in the Balkans?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The land area of the Balkans is similar to some European countries, but the region is inhabited by a large variety of ethnicities, such as Greeks, Albanians, Turks, Bulgarians, Serbs, Romanians and many others. Why did this happen, and why did it only happen in the Balkans?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Balkans", "id": "654hfa", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 57, "report_reasons": null, "author": "Millero15", "saved": false, "mod_reports": [], "name": "t3_654hfa", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "author_cakeday": true, "edited": false, "link_flair_css_class": "theme", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/654hfa/why_are_the_balkans_a_home_for_so_many_different/", "num_reports": null, "locked": false, "stickied": false, "created": 1492105309.0, "url": "https://www.reddit.com/r/AskHistorians/comments/654hfa/why_are_the_balkans_a_home_for_so_many_different/", "author_flair_text": null, "quarantine": false, "title": "Why are the Balkans a home for so many different ethnic groups?", "created_utc": 1492076509.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 57}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_654hfa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_654hfa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_654hfa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_654hfa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_654hfa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_654hfa", "likes": null, "replies": "", "user_reports": [], "id": "dg8ps6s", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "yodatsracist", "parent_id": "t1_dg8oxwz", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Clearly, different nations ended up with different standards. In France, it was religion then language then existence in a territory. In Spain, it was first religion then language. In Germany, it was language, but then also religion and blood during the Nazi times.  In China, it was written language and now territory. In the New World, it mostly territory, though often with the implicit or explicit caveat against native peoples.  In Pakistan, it was religion. In India, it was officially territory but also sort or religion. \n\nI think Benedict Anderson gives the best definition of nation:\n\n&gt;In an anthropological spirit, then, I propose the following definition of the nation: it is an imagined political community - - and imagined as both inherently limited and sovereign.\n\n&gt;It is *imagined* because the members of even the smallest nation will never know most of their fellow-members, meet them, or even hear of them, yet in the minds of each lives the image of their communion. Renan referred to this imagining in his suavely back-handed way when he wrote that 'Or l’essence d'une nation est que tons les individus aient beaucoup de choses en commun, et aussi que tous aient oublié bien des choses.” With a certain ferocity Gellner makes a comparable point when he rules that 'Nationalism is not the awakening of nations to self-consciousness: it invents nations where they do not exist.' The drawback to this formulation, however, is that Gellner is so anxious to show that nationalism masquerades under false pretences that he assimilates 'invention' to 'fabrication' and 'falsity', rather than to 'imagining' and 'creation'. In this way he implies that 'true' communities exist which can be advantageously juxtaposed to nations. In fact, all communities larger than primordial villages of face-to-face contact (and perhaps even these) are imagined. Communities are to be distinguished, not by their falsity/genuineness, but by the style in which they are imagined. Javanese villagers have always known that they are connected to people they have never seen, but these ties were once imagined particularistically-as indefinitely stretchable nets of kinship and clientship. Until quite recently, the Javanese language had no word meaning the abstraction 'society.' We may today think of the French aristocracy of the ancien régime as a class; but surely it was imagined this way only very late. To the question 'Who is the ‘Comte de X?’ the normal answer would have been, not 'a member of the aristocracy,' but 'the lord of X, 'the uncle of the Baronne de Y,'or 'a client of the Duc de Z.'\n\n&gt;The nation is imagined as *limited* because even the largest of them encompassing perhaps a billion living human beings, has finite, if elastic boundaries, beyond which lie other nations. No nation imagines itself coterminous with mankind. The most messianic nationalists do not dream of a day when all the members of the human race will join their nation in the way that it was possible, in certain epochs, for, say, Christians to dream of a wholly Christian planet.\n\n&gt;It is imagined as *sovereign* because the concept was born in an age in which Enlightenment and Revolution were destorying the legitamcy of the divinely-ordained, hierarchical dynastic realm. Coming to maturity at a stage of human history when even the most devout adherents of any universal religion were inescapably confronted with the living pluralism of such religions, and the allomorphism between each faith's ontological claims and territorial stretch, nations dream of being free, and, if under God, directly so. The gage and emblem of this freedom is the sovereign state.\n\n&gt;Finally, it is imagined as a *community*, because, regardless of the actual inequality and exploitation that may prevail in each, the nation is always conceived as a deep, horizontal comradeship. Ultimately it is this fraternity that makes it possible, over the past two centuries, for so many millions of people, not so much to kill, as willingly to die for such limited imaginings.\n\n&gt;These deaths bring us abruptly face to face with the central problem posed by nationalism: what makes the shrunken imaginings of recent history (scarcely more than two centuries) generate such colossal sacrifices? I believe that the beginnings of an answer lie in the cultural roots of nationalism.\n\nJust for fun, notice that Anderson doesn't define *political* or *limited*, the first of which I wrote a long paper arguing essentially means \"part of the state bureaucracy\" and the second of which gets to the heart of your question, but I argue in his work often means the maximal proposed borders of the state, though that's somewhat circular.  \n\nBut the point here is that the bounds of the imagine community can be very different over time. The United States (or rather, people with power in the United States) long imagined African-Americans and Native Americans outside the political community. Germany Jews were mostly imagined within the German political community (though not universally) after emancipation, but then between 1933-1945 were radically imagined as not only alien to the German political community, but the chief danger to it. Sephardi Jews were expelled from Spain in 1492 as the imagined Spanish community was taken shape, but since 1992, there have been various initiatives in Spain to try and reinclude them, including offering them citizenship or at least an easier path to citizenships. The boundaries of the imagined political community are social constructed. They are contested, they can change. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Clearly, different nations ended up with different standards. In France, it was religion then language then existence in a territory. In Spain, it was first religion then language. In Germany, it was language, but then also religion and blood during the Nazi times.  In China, it was written language and now territory. In the New World, it mostly territory, though often with the implicit or explicit caveat against native peoples.  In Pakistan, it was religion. In India, it was officially territory but also sort or religion. &lt;/p&gt;\n\n&lt;p&gt;I think Benedict Anderson gives the best definition of nation:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In an anthropological spirit, then, I propose the following definition of the nation: it is an imagined political community - - and imagined as both inherently limited and sovereign.&lt;/p&gt;\n\n&lt;p&gt;It is &lt;em&gt;imagined&lt;/em&gt; because the members of even the smallest nation will never know most of their fellow-members, meet them, or even hear of them, yet in the minds of each lives the image of their communion. Renan referred to this imagining in his suavely back-handed way when he wrote that &amp;#39;Or l’essence d&amp;#39;une nation est que tons les individus aient beaucoup de choses en commun, et aussi que tous aient oublié bien des choses.” With a certain ferocity Gellner makes a comparable point when he rules that &amp;#39;Nationalism is not the awakening of nations to self-consciousness: it invents nations where they do not exist.&amp;#39; The drawback to this formulation, however, is that Gellner is so anxious to show that nationalism masquerades under false pretences that he assimilates &amp;#39;invention&amp;#39; to &amp;#39;fabrication&amp;#39; and &amp;#39;falsity&amp;#39;, rather than to &amp;#39;imagining&amp;#39; and &amp;#39;creation&amp;#39;. In this way he implies that &amp;#39;true&amp;#39; communities exist which can be advantageously juxtaposed to nations. In fact, all communities larger than primordial villages of face-to-face contact (and perhaps even these) are imagined. Communities are to be distinguished, not by their falsity/genuineness, but by the style in which they are imagined. Javanese villagers have always known that they are connected to people they have never seen, but these ties were once imagined particularistically-as indefinitely stretchable nets of kinship and clientship. Until quite recently, the Javanese language had no word meaning the abstraction &amp;#39;society.&amp;#39; We may today think of the French aristocracy of the ancien régime as a class; but surely it was imagined this way only very late. To the question &amp;#39;Who is the ‘Comte de X?’ the normal answer would have been, not &amp;#39;a member of the aristocracy,&amp;#39; but &amp;#39;the lord of X, &amp;#39;the uncle of the Baronne de Y,&amp;#39;or &amp;#39;a client of the Duc de Z.&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;The nation is imagined as &lt;em&gt;limited&lt;/em&gt; because even the largest of them encompassing perhaps a billion living human beings, has finite, if elastic boundaries, beyond which lie other nations. No nation imagines itself coterminous with mankind. The most messianic nationalists do not dream of a day when all the members of the human race will join their nation in the way that it was possible, in certain epochs, for, say, Christians to dream of a wholly Christian planet.&lt;/p&gt;\n\n&lt;p&gt;It is imagined as &lt;em&gt;sovereign&lt;/em&gt; because the concept was born in an age in which Enlightenment and Revolution were destorying the legitamcy of the divinely-ordained, hierarchical dynastic realm. Coming to maturity at a stage of human history when even the most devout adherents of any universal religion were inescapably confronted with the living pluralism of such religions, and the allomorphism between each faith&amp;#39;s ontological claims and territorial stretch, nations dream of being free, and, if under God, directly so. The gage and emblem of this freedom is the sovereign state.&lt;/p&gt;\n\n&lt;p&gt;Finally, it is imagined as a &lt;em&gt;community&lt;/em&gt;, because, regardless of the actual inequality and exploitation that may prevail in each, the nation is always conceived as a deep, horizontal comradeship. Ultimately it is this fraternity that makes it possible, over the past two centuries, for so many millions of people, not so much to kill, as willingly to die for such limited imaginings.&lt;/p&gt;\n\n&lt;p&gt;These deaths bring us abruptly face to face with the central problem posed by nationalism: what makes the shrunken imaginings of recent history (scarcely more than two centuries) generate such colossal sacrifices? I believe that the beginnings of an answer lie in the cultural roots of nationalism.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Just for fun, notice that Anderson doesn&amp;#39;t define &lt;em&gt;political&lt;/em&gt; or &lt;em&gt;limited&lt;/em&gt;, the first of which I wrote a long paper arguing essentially means &amp;quot;part of the state bureaucracy&amp;quot; and the second of which gets to the heart of your question, but I argue in his work often means the maximal proposed borders of the state, though that&amp;#39;s somewhat circular.  &lt;/p&gt;\n\n&lt;p&gt;But the point here is that the bounds of the imagine community can be very different over time. The United States (or rather, people with power in the United States) long imagined African-Americans and Native Americans outside the political community. Germany Jews were mostly imagined within the German political community (though not universally) after emancipation, but then between 1933-1945 were radically imagined as not only alien to the German political community, but the chief danger to it. Sephardi Jews were expelled from Spain in 1492 as the imagined Spanish community was taken shape, but since 1992, there have been various initiatives in Spain to try and reinclude them, including offering them citizenship or at least an easier path to citizenships. The boundaries of the imagined political community are social constructed. They are contested, they can change. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8ps6s", "score_hidden": false, "stickied": false, "created": 1492170418.0, "created_utc": 1492141618.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8oxwz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "a-sentient-slav", "parent_id": "t1_dg8nfre", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Thank you so much! I'd love to be able to underestand more: If we say that it was the newly powerful middle class that branded the idea of a nation, and started to include some in it and exclude others, then what were the criteria that made the distinction and separated 'nationals' from 'others'? Was it ethnicity? Religion? Language? Something else?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much! I&amp;#39;d love to be able to underestand more: If we say that it was the newly powerful middle class that branded the idea of a nation, and started to include some in it and exclude others, then what were the criteria that made the distinction and separated &amp;#39;nationals&amp;#39; from &amp;#39;others&amp;#39;? Was it ethnicity? Religion? Language? Something else?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8oxwz", "score_hidden": false, "stickied": false, "created": 1492169090.0, "created_utc": 1492140290.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8nfre", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "yodatsracist", "parent_id": "t1_dg8m4d4", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "The people who most convincingly push back Western European nationalism to the Early Modern Period, rather than just the Modern Era, like Liah Greenfeld, Anthony Marx, and Phil Gorski tend to tie it with state-making, and in Greenfeld's and Gorski's cases a growing middle class which was capable of making claims on the state (particularly in England and the Netherlands). Anthony Hastings, Aviel Roshwald, and some others have tried to push it back even further, but I find they end up talking about national identities more than a national*ism*. Here's a useful paragraph from Greenfeld:\n\n&gt;The inventors of nationalism were members of the new Tudor aristocracy in England in the sixteenth century. Upwardly mobile commoners who reached the top of the social ladder, they found unacceptable the traditional image of society in which social mobility was an anomaly and substituted a new image for it, that of a nation as it came to be understood in modern times. Before this happened, the word \"nation\" meant something entirely different; it referred to a political and cultural elite, rather than to a society as a whole. Tudor aristocrats, however, made the \"nation\" synonymous with the English \"people,\" a concept which previously-in English as in other languages referred specifically to the lower orders of society, the commons (or worse: the rabble or plebs), as members of which so many of the new aristocrats were born. As a result of this redefinition, every member of the people was elevated to the dignity of the elite becoming, in principle, equal to any other member, as well as free, in vested with the right of self-government, or, in other words, sovereignty, and the people or the nation collectively was, in turn, defined as sovereign.\n\nGorski argues the same is true for Holland, but it's important to keep in mind that Anthony Marx and some others argue that exclusionary nationalism dates even earlier and appears to be linked to state centralization in England, Spain, and France. An Ottoman middle class is something we really don't see until the 19th century. And indeed, that rising middle class (they were bureaucrats, not merchants) is the core of Turkish nationalism. \n\nThe Ottoman System had a few key differences: 1) the period of the Ottomans having a strong central state was finite. There was a long period where the Empire decentralized and local elites effectively ruled, particularly from the 17th and 18th centuries. In the 19th centuries, you suddenly see a push for internal colonization (for instance, the crushing of the Kurdish beyliks) and recentralizations. But Ottoman State capacity is highly variable. 2) in *Nations before Nationalism*, John Armstrong argues that before national identies were important, trans-national religious identies were paramount. The during the height of the Empire, Ottomans were never Turks, not until late into the 19th century at least. What Ottomans were was Muslims, and in fact, from 1517 on, Caliphs. However, 3) the Ottomans had the millet system. They did not have equal citizenship, but they allowed for identity pluralism, and indeed, rationalized it into formal institutions. Just as Canada today recognizes effectively three different ways to be Canadian (English-speaking, French-speaking, and First Nation/Métis) so too did the Ottomans have multiple ways of existing in the Empire. The Ottomans allowed assimilation into Islam, and that certainly incurred some advantages, but they only very very rarely tried to force it. Marc Baer's first book is about some of those rare instances. And perhaps most importantly, 4) the Ottomans were always self-consciously an empire. Empires are different from nation-states, and as nation-states formed, were generally one of the main things they defined themselves against (the other being small, scattered states, but that really only applied to German and Italian nationalism).  Empires are by definition multi-cultural, an emperor rules not just one people but is a \"king of kings\". ", "edited": 1492138211.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The people who most convincingly push back Western European nationalism to the Early Modern Period, rather than just the Modern Era, like Liah Greenfeld, Anthony Marx, and Phil Gorski tend to tie it with state-making, and in Greenfeld&amp;#39;s and Gorski&amp;#39;s cases a growing middle class which was capable of making claims on the state (particularly in England and the Netherlands). Anthony Hastings, Aviel Roshwald, and some others have tried to push it back even further, but I find they end up talking about national identities more than a national&lt;em&gt;ism&lt;/em&gt;. Here&amp;#39;s a useful paragraph from Greenfeld:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The inventors of nationalism were members of the new Tudor aristocracy in England in the sixteenth century. Upwardly mobile commoners who reached the top of the social ladder, they found unacceptable the traditional image of society in which social mobility was an anomaly and substituted a new image for it, that of a nation as it came to be understood in modern times. Before this happened, the word &amp;quot;nation&amp;quot; meant something entirely different; it referred to a political and cultural elite, rather than to a society as a whole. Tudor aristocrats, however, made the &amp;quot;nation&amp;quot; synonymous with the English &amp;quot;people,&amp;quot; a concept which previously-in English as in other languages referred specifically to the lower orders of society, the commons (or worse: the rabble or plebs), as members of which so many of the new aristocrats were born. As a result of this redefinition, every member of the people was elevated to the dignity of the elite becoming, in principle, equal to any other member, as well as free, in vested with the right of self-government, or, in other words, sovereignty, and the people or the nation collectively was, in turn, defined as sovereign.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Gorski argues the same is true for Holland, but it&amp;#39;s important to keep in mind that Anthony Marx and some others argue that exclusionary nationalism dates even earlier and appears to be linked to state centralization in England, Spain, and France. An Ottoman middle class is something we really don&amp;#39;t see until the 19th century. And indeed, that rising middle class (they were bureaucrats, not merchants) is the core of Turkish nationalism. &lt;/p&gt;\n\n&lt;p&gt;The Ottoman System had a few key differences: 1) the period of the Ottomans having a strong central state was finite. There was a long period where the Empire decentralized and local elites effectively ruled, particularly from the 17th and 18th centuries. In the 19th centuries, you suddenly see a push for internal colonization (for instance, the crushing of the Kurdish beyliks) and recentralizations. But Ottoman State capacity is highly variable. 2) in &lt;em&gt;Nations before Nationalism&lt;/em&gt;, John Armstrong argues that before national identies were important, trans-national religious identies were paramount. The during the height of the Empire, Ottomans were never Turks, not until late into the 19th century at least. What Ottomans were was Muslims, and in fact, from 1517 on, Caliphs. However, 3) the Ottomans had the millet system. They did not have equal citizenship, but they allowed for identity pluralism, and indeed, rationalized it into formal institutions. Just as Canada today recognizes effectively three different ways to be Canadian (English-speaking, French-speaking, and First Nation/Métis) so too did the Ottomans have multiple ways of existing in the Empire. The Ottomans allowed assimilation into Islam, and that certainly incurred some advantages, but they only very very rarely tried to force it. Marc Baer&amp;#39;s first book is about some of those rare instances. And perhaps most importantly, 4) the Ottomans were always self-consciously an empire. Empires are different from nation-states, and as nation-states formed, were generally one of the main things they defined themselves against (the other being small, scattered states, but that really only applied to German and Italian nationalism).  Empires are by definition multi-cultural, an emperor rules not just one people but is a &amp;quot;king of kings&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8nfre", "score_hidden": false, "stickied": false, "created": 1492166828.0, "created_utc": 1492138028.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8m4d4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "a-sentient-slav", "parent_id": "t1_dg8acmd", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "A follow up question sprang up in my mind if I may; what is it about Western European states that allowed for this proto-nationalism and cultural homogenisation tendencies to take place centuries before anywhere else in the world? Comparing to for example the Ottoman empire, which I'd consider to have equally strong central governance and state power, yet it could assert this authority without any ethnic assimilation efforts and while remaining overall very heterogenous. What made the Western powers different?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A follow up question sprang up in my mind if I may; what is it about Western European states that allowed for this proto-nationalism and cultural homogenisation tendencies to take place centuries before anywhere else in the world? Comparing to for example the Ottoman empire, which I&amp;#39;d consider to have equally strong central governance and state power, yet it could assert this authority without any ethnic assimilation efforts and while remaining overall very heterogenous. What made the Western powers different?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8m4d4", "score_hidden": false, "stickied": false, "created": 1492164939.0, "created_utc": 1492136139.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8acmd", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "yodatsracist", "parent_id": "t1_dg8aca5", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "(continued from above)\n\nWhile Western Europe had more assimilation than ethnic cleansing, Anthony Marx dates modern conceptions of \"nationalism\" to the early modern period when Jews and Muslims were expelled from Spain, Protestants from France, and Catholics from England.  The higher state capacity in Western Europe allowed these early nationalizing states to both \"expel Others\" and assimilate peripheral populations earlier than in the Balkans.  In other parts of Europe, we see a long history of ethnic diversity than eventually got smashed through the emergence of ethnic states and policies of ethnic cleansing to try to match populations to those states.  \n\nPrague, for instance, was historically a mixed German and Czech speaking city that also had a large Jewish population.  Franz Kafka, for instance, was a Jewish lifelong resident of Prague who attended the local German language Charles-Ferdinand University and wrote all his literary and professional works (he worked as an insurance officer) in German, though he could also speak Czech well.  In the interwar period, roughly a quarter of Czechoslovakia spoke German as a native language (likely a decrease from a few years earlier, as many moved to Austria or Germany after Czechoslovakian independence).  At the end of the war, these German-speakers had either been murdered (as with Kafka, many of the German-speakers were Jews), fled, or were expelled.\n\nThis is the common pattern for Eastern Europe.  In addition to the roughly six million Jews and half a million Romani and Sinti killed in the Holocaust, and more Jews ended up emigrating to the New World, South Africa, Australia, New Zealand, and of course Israel.  Before the War, Poland was 10% Jewish. Between 1944-1950, millions of ethnic Germans fled or were expelled.  Most of post-War Western Poland (the \"[Recovered Territories](https://en.wikipedia.org/wiki/Recovered_Territories)\") had been German speaking before the War, and most of pre-War Eastern Poland (east of the [Curzon Line](https://en.wikipedia.org/wiki/Curzon_Line)) was annexed by the Soviet Union.  Populations were expelled accordingly.  Poland was the most dramatic case, but such reengineering of demographics through expulsion and forced assimilation was common in the immediate post-War period.  The borders of the Balkans saw this ([the Czechoslavokian-Hungarian population exchange](https://en.wikipedia.org/wiki/Czechoslovak–Hungarian_population_exchange), the [Italian flight from Istria](https://en.wikipedia.org/wiki/Istrian_exodus), the partial flight of Turkish Bulgarians escaping the \"[Revival Process](https://en.wikipedia.org/wiki/Revival_Process), etc.).  \n\nWhich is to say: not only do the Balkans have geography and a history of invasions that favors ethnic diversity, but they also had more limited impacts from two processes that favored ethnic homogeneity in the rest of Europe: strong states forcing cultural homogeneity on their population and systematized ethnic cleansing reengineering populations through violence, voluntary flight, and population exchange.  Two hundred years ago, the rest of Europe was much \"Balkanized\" than it is today.  Much of the world looks more like the Balkans than it does like Western Europe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(continued from above)&lt;/p&gt;\n\n&lt;p&gt;While Western Europe had more assimilation than ethnic cleansing, Anthony Marx dates modern conceptions of &amp;quot;nationalism&amp;quot; to the early modern period when Jews and Muslims were expelled from Spain, Protestants from France, and Catholics from England.  The higher state capacity in Western Europe allowed these early nationalizing states to both &amp;quot;expel Others&amp;quot; and assimilate peripheral populations earlier than in the Balkans.  In other parts of Europe, we see a long history of ethnic diversity than eventually got smashed through the emergence of ethnic states and policies of ethnic cleansing to try to match populations to those states.  &lt;/p&gt;\n\n&lt;p&gt;Prague, for instance, was historically a mixed German and Czech speaking city that also had a large Jewish population.  Franz Kafka, for instance, was a Jewish lifelong resident of Prague who attended the local German language Charles-Ferdinand University and wrote all his literary and professional works (he worked as an insurance officer) in German, though he could also speak Czech well.  In the interwar period, roughly a quarter of Czechoslovakia spoke German as a native language (likely a decrease from a few years earlier, as many moved to Austria or Germany after Czechoslovakian independence).  At the end of the war, these German-speakers had either been murdered (as with Kafka, many of the German-speakers were Jews), fled, or were expelled.&lt;/p&gt;\n\n&lt;p&gt;This is the common pattern for Eastern Europe.  In addition to the roughly six million Jews and half a million Romani and Sinti killed in the Holocaust, and more Jews ended up emigrating to the New World, South Africa, Australia, New Zealand, and of course Israel.  Before the War, Poland was 10% Jewish. Between 1944-1950, millions of ethnic Germans fled or were expelled.  Most of post-War Western Poland (the &amp;quot;&lt;a href=\"https://en.wikipedia.org/wiki/Recovered_Territories\"&gt;Recovered Territories&lt;/a&gt;&amp;quot;) had been German speaking before the War, and most of pre-War Eastern Poland (east of the &lt;a href=\"https://en.wikipedia.org/wiki/Curzon_Line\"&gt;Curzon Line&lt;/a&gt;) was annexed by the Soviet Union.  Populations were expelled accordingly.  Poland was the most dramatic case, but such reengineering of demographics through expulsion and forced assimilation was common in the immediate post-War period.  The borders of the Balkans saw this (&lt;a href=\"https://en.wikipedia.org/wiki/Czechoslovak%E2%80%93Hungarian_population_exchange\"&gt;the Czechoslavokian-Hungarian population exchange&lt;/a&gt;, the &lt;a href=\"https://en.wikipedia.org/wiki/Istrian_exodus\"&gt;Italian flight from Istria&lt;/a&gt;, the partial flight of Turkish Bulgarians escaping the &amp;quot;&lt;a href=\"https://en.wikipedia.org/wiki/Revival_Process\"&gt;Revival Process&lt;/a&gt;, etc.).  &lt;/p&gt;\n\n&lt;p&gt;Which is to say: not only do the Balkans have geography and a history of invasions that favors ethnic diversity, but they also had more limited impacts from two processes that favored ethnic homogeneity in the rest of Europe: strong states forcing cultural homogeneity on their population and systematized ethnic cleansing reengineering populations through violence, voluntary flight, and population exchange.  Two hundred years ago, the rest of Europe was much &amp;quot;Balkanized&amp;quot; than it is today.  Much of the world looks more like the Balkans than it does like Western Europe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8acmd", "score_hidden": false, "stickied": false, "created": 1492149039.0, "created_utc": 1492120239.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_654hfa", "likes": null, "replies": "", "user_reports": [], "id": "dge3n5e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "metalbox69", "parent_id": "t1_dg8aca5", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Just noticed a little error. \nThe French languages were named after the differences in the way they said \"yes\", I think you accidentally said \"no\". Fantastic answer by the way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just noticed a little error. \nThe French languages were named after the differences in the way they said &amp;quot;yes&amp;quot;, I think you accidentally said &amp;quot;no&amp;quot;. Fantastic answer by the way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dge3n5e", "score_hidden": false, "stickied": false, "created": 1492491057.0, "created_utc": 1492462257.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8aca5", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "yodatsracist", "parent_id": "t3_654hfa", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Geographers and anthropologists have argued that difficult terrain encourages ethnic heterogeneity, or more precisely, that it can preserve diversity from large, agriculturally supported state-based culture complexes which tend to assimilate as they grow.  This is most famously applied to \"[Zomia](https://en.wikipedia.org/wiki/Zomia_(region%29)\" in highland Southeast Asia, and brought to wider attention in the excellent book *The Art of Not Being Governed* by anthropologist and political scientist James C. Scott.  Scott notes that in addition to highlands, deserts, swamps, and dense jungles can also preserve ethnic diversity.  For deserts, we can point to Bedouins in Arabia and the Khoisan in South Africa; for swamps, the Marsh Arabs in Iraq and the Seminole in Florida; for dense jungles, Central African pygmy groups like the Aka or Mbuti or the still minimally contacted groups in the Amazon Rain Forest in Brazil.  So, in a certain sense, we'd expect the mountainous terrain of the Balkan Highlands to preserve regional diversity in resistance to lowland state-based cultures, just as we see in Southeast Asia, the Zargos Mountains (where you have Kurds, Turks, Iranians, etc), Switzerland, etc.\n\nBeyond the Greeks and the Albanians, it seems like all the other groups are the result of some post-Roman expansion.  Slavs, for instance, didn't come into the Balkans (which at the time were under Byzantine control) until roughly 6th century.  The history of the Romanians is very fraught.  Turks obviously arrived with the Ottoman Empire, and part of their policy was to bring in other Muslim minorities, which explains how Tatars ended up a minority in Romania.  Further, single ethnolinguistic groups got split between religions.  Bosniaks, Croats, and Serbs are distinguishable first based on religion.  Pomaks and Bulgarians are similar.  These religions tend to be related to the large empires that fought over the region through the 20th century (notably, the Austro-Hungarian, the Russia, and the Ottoman Empires).  Many regions saw few conquests.\n\nI should note other groups never split based on religion: there are, for instance, Sunni Muslim, Bektashi Muslim, Catholic Christian, and Orthodox Christian Albanians.  Slavic groups in the Balkans are also divided by pretty arbitrary lines: Slavic languages tend to form a \"[dialect continuum](https://en.wikipedia.org/wiki/Dialect_continuum)\" and the difference between these languages tend to be clear from the capital cities.  South Slavic languages are specifically mentioned in that Wikipedia article as one of the classic cases of the phenomenon, though Bulgarian is pretty distinct from the others.\n\nA factor is that we default to thinking about Western Europe, when we rarely think of how much ethnic cleansing and assimilation there has been in recent European history.  Let's use France as an example.  France saw, we think, three or so major conquests: a pre-historic Celtic conquest, the Roman Conquest under Julius Caesar, and the Frankish conquest.\n\nWe see that linguistic traces of conquest in France, too. The only pre-Celtic language is Basque spoken in the (surprise, surprise) Mountainous Pyranees in the Southeast.  Pre-Celtic languages were mostly displaced by Celtic languages.  Actually, all Celtic languages in France were displaced by Romance languages based off Latin.  However, Breton, a Celtic language, was brought to what's now the remote Northwestern French province of Brittany/Bretagne, from the Island of Great Britain.  Its closest relative is the Cornish Language.  The association between Britain and Breton are not coincidental.  \n\nHowever, most of France speaks a Romance language called French, developed from the local dialect of Vulgar Latin.  However, this two was a dialect continuum and until very recently, most French people didn't speak French.  Those who didn't speak Basque or Breton spoke a variety of romance dialects, with at least two literary standards, commonly known by their separate words for \"no\" the Langue d'oïl (oïl being the predecessor to the modern \"oui\") based around Paris and the Langue d'oc/Lenga d'oc based in the South of France, modern version of which might be called Occitan or Provençal.  In the 19th century, Frédéric Mistral even tried to create a literary Provençal nationalism, though this never was elevated to the level of a political nationalism.  We tend to think of think of this Langue d'oc as just \"a southern dialect of French\", but it's probably more similar to Catalan or even some northern Italian \"dialects\" than to the Parisian-standard of French.  The most famous book on this is Eugene Weber's *Peasants into Frenchmen*; he argues that in about 1870, only about 60% of the citizens of France could actually speak French, and that mass education (only in the Parisian standard, and also teaching a French nationalism), the mass army (again teaching the standard language and inculcating nationalism), and a national economy made possibly by roads and railways are what turned diverse peasants into the modern French.  This assimilationist campaign was perhaps most acutely felt in the region of Alsace, which periodic had a German-speaking majority (only being conquered by France in 1689).  One 1999 survey found that 43% of Alsatian adults speak Alsatian German, but this is declining in the younger generations.  Because of its German heritage, Alsace is also unique in France in its strong Protestant minority and historically a strong Jewish minority (this is where Emile Durkheim's and Alfred Dreyfus's families were from, for instance, and according to one theory, the birth place of Yiddish) though its Jewish population is much less pronounced today.\n\nOr compare the Balkans to the British Isles.  There are generally considered to be at least six \"indigenous\" ethnic groups to the British Isles: the English (descended in part Angles, Saxons, and Jutes), Scots, Welsh, Irish, Cornish, and Manx, each with their own native language and in the Scottish case, two (Scots and Scottish Gaelic).  That doesn't count the Romany (\"Gypsies\"), the Jews, the Irish Travelers (\"Pikeys\"), Scottish Travelers, etc. who have long made the  British Isles their home, nor does it recognize the religious diversity (in England alone, you find Anglicans, Quakers, Methodists, Unitarians, Puritans, Baptists, Presbyterians, etc as well as indigenous Anglo-Catholics and, between 1070 and 1290 and again since 1656, Jews).  Much the \"internal colonialism\" of the government based in London, to use Michael Hechter's term, was against England's \"Celtic fringe\".  Likewise, England did a great deal to tolerate non-conforming (non-Anglican) Protestant churches early on, and since the Reformation Scotland had a separate (Presbyterian) established Church.  We tend not to see that diversity today because it's all included in the same country and, for the most part, the same language.\n\n(continued below)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Geographers and anthropologists have argued that difficult terrain encourages ethnic heterogeneity, or more precisely, that it can preserve diversity from large, agriculturally supported state-based culture complexes which tend to assimilate as they grow.  This is most famously applied to &amp;quot;&lt;a href=\"https://en.wikipedia.org/wiki/Zomia_(region%29\"&gt;Zomia&lt;/a&gt;&amp;quot; in highland Southeast Asia, and brought to wider attention in the excellent book &lt;em&gt;The Art of Not Being Governed&lt;/em&gt; by anthropologist and political scientist James C. Scott.  Scott notes that in addition to highlands, deserts, swamps, and dense jungles can also preserve ethnic diversity.  For deserts, we can point to Bedouins in Arabia and the Khoisan in South Africa; for swamps, the Marsh Arabs in Iraq and the Seminole in Florida; for dense jungles, Central African pygmy groups like the Aka or Mbuti or the still minimally contacted groups in the Amazon Rain Forest in Brazil.  So, in a certain sense, we&amp;#39;d expect the mountainous terrain of the Balkan Highlands to preserve regional diversity in resistance to lowland state-based cultures, just as we see in Southeast Asia, the Zargos Mountains (where you have Kurds, Turks, Iranians, etc), Switzerland, etc.&lt;/p&gt;\n\n&lt;p&gt;Beyond the Greeks and the Albanians, it seems like all the other groups are the result of some post-Roman expansion.  Slavs, for instance, didn&amp;#39;t come into the Balkans (which at the time were under Byzantine control) until roughly 6th century.  The history of the Romanians is very fraught.  Turks obviously arrived with the Ottoman Empire, and part of their policy was to bring in other Muslim minorities, which explains how Tatars ended up a minority in Romania.  Further, single ethnolinguistic groups got split between religions.  Bosniaks, Croats, and Serbs are distinguishable first based on religion.  Pomaks and Bulgarians are similar.  These religions tend to be related to the large empires that fought over the region through the 20th century (notably, the Austro-Hungarian, the Russia, and the Ottoman Empires).  Many regions saw few conquests.&lt;/p&gt;\n\n&lt;p&gt;I should note other groups never split based on religion: there are, for instance, Sunni Muslim, Bektashi Muslim, Catholic Christian, and Orthodox Christian Albanians.  Slavic groups in the Balkans are also divided by pretty arbitrary lines: Slavic languages tend to form a &amp;quot;&lt;a href=\"https://en.wikipedia.org/wiki/Dialect_continuum\"&gt;dialect continuum&lt;/a&gt;&amp;quot; and the difference between these languages tend to be clear from the capital cities.  South Slavic languages are specifically mentioned in that Wikipedia article as one of the classic cases of the phenomenon, though Bulgarian is pretty distinct from the others.&lt;/p&gt;\n\n&lt;p&gt;A factor is that we default to thinking about Western Europe, when we rarely think of how much ethnic cleansing and assimilation there has been in recent European history.  Let&amp;#39;s use France as an example.  France saw, we think, three or so major conquests: a pre-historic Celtic conquest, the Roman Conquest under Julius Caesar, and the Frankish conquest.&lt;/p&gt;\n\n&lt;p&gt;We see that linguistic traces of conquest in France, too. The only pre-Celtic language is Basque spoken in the (surprise, surprise) Mountainous Pyranees in the Southeast.  Pre-Celtic languages were mostly displaced by Celtic languages.  Actually, all Celtic languages in France were displaced by Romance languages based off Latin.  However, Breton, a Celtic language, was brought to what&amp;#39;s now the remote Northwestern French province of Brittany/Bretagne, from the Island of Great Britain.  Its closest relative is the Cornish Language.  The association between Britain and Breton are not coincidental.  &lt;/p&gt;\n\n&lt;p&gt;However, most of France speaks a Romance language called French, developed from the local dialect of Vulgar Latin.  However, this two was a dialect continuum and until very recently, most French people didn&amp;#39;t speak French.  Those who didn&amp;#39;t speak Basque or Breton spoke a variety of romance dialects, with at least two literary standards, commonly known by their separate words for &amp;quot;no&amp;quot; the Langue d&amp;#39;oïl (oïl being the predecessor to the modern &amp;quot;oui&amp;quot;) based around Paris and the Langue d&amp;#39;oc/Lenga d&amp;#39;oc based in the South of France, modern version of which might be called Occitan or Provençal.  In the 19th century, Frédéric Mistral even tried to create a literary Provençal nationalism, though this never was elevated to the level of a political nationalism.  We tend to think of think of this Langue d&amp;#39;oc as just &amp;quot;a southern dialect of French&amp;quot;, but it&amp;#39;s probably more similar to Catalan or even some northern Italian &amp;quot;dialects&amp;quot; than to the Parisian-standard of French.  The most famous book on this is Eugene Weber&amp;#39;s &lt;em&gt;Peasants into Frenchmen&lt;/em&gt;; he argues that in about 1870, only about 60% of the citizens of France could actually speak French, and that mass education (only in the Parisian standard, and also teaching a French nationalism), the mass army (again teaching the standard language and inculcating nationalism), and a national economy made possibly by roads and railways are what turned diverse peasants into the modern French.  This assimilationist campaign was perhaps most acutely felt in the region of Alsace, which periodic had a German-speaking majority (only being conquered by France in 1689).  One 1999 survey found that 43% of Alsatian adults speak Alsatian German, but this is declining in the younger generations.  Because of its German heritage, Alsace is also unique in France in its strong Protestant minority and historically a strong Jewish minority (this is where Emile Durkheim&amp;#39;s and Alfred Dreyfus&amp;#39;s families were from, for instance, and according to one theory, the birth place of Yiddish) though its Jewish population is much less pronounced today.&lt;/p&gt;\n\n&lt;p&gt;Or compare the Balkans to the British Isles.  There are generally considered to be at least six &amp;quot;indigenous&amp;quot; ethnic groups to the British Isles: the English (descended in part Angles, Saxons, and Jutes), Scots, Welsh, Irish, Cornish, and Manx, each with their own native language and in the Scottish case, two (Scots and Scottish Gaelic).  That doesn&amp;#39;t count the Romany (&amp;quot;Gypsies&amp;quot;), the Jews, the Irish Travelers (&amp;quot;Pikeys&amp;quot;), Scottish Travelers, etc. who have long made the  British Isles their home, nor does it recognize the religious diversity (in England alone, you find Anglicans, Quakers, Methodists, Unitarians, Puritans, Baptists, Presbyterians, etc as well as indigenous Anglo-Catholics and, between 1070 and 1290 and again since 1656, Jews).  Much the &amp;quot;internal colonialism&amp;quot; of the government based in London, to use Michael Hechter&amp;#39;s term, was against England&amp;#39;s &amp;quot;Celtic fringe&amp;quot;.  Likewise, England did a great deal to tolerate non-conforming (non-Anglican) Protestant churches early on, and since the Reformation Scotland had a separate (Presbyterian) established Church.  We tend not to see that diversity today because it&amp;#39;s all included in the same country and, for the most part, the same language.&lt;/p&gt;\n\n&lt;p&gt;(continued below)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8aca5", "score_hidden": false, "stickied": false, "created": 1492149027.0, "created_utc": 1492120227.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_654hfa", "likes": null, "replies": "", "user_reports": [], "id": "dg7r871", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_654hfa", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[removed]", "edited": 1492099779.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7r871", "score_hidden": false, "stickied": false, "created": 1492128036.0, "created_utc": 1492099236.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}]