[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": ".", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65536x", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 35, "report_reasons": null, "author": "Vyncis", "saved": false, "mod_reports": [], "name": "t3_65536x", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/65536x/prior_to_the_adoption_of_trench_warfare_after_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1492114544.0, "url": "https://www.reddit.com/r/AskHistorians/comments/65536x/prior_to_the_adoption_of_trench_warfare_after_the/", "author_flair_text": null, "quarantine": false, "title": "Prior to the adoption of trench warfare after the Battles of the Frontiers and then Marne, how were Machine Guns used?", "created_utc": 1492085744.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 35}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65536x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65536x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65536x", "likes": null, "replies": "", "user_reports": [], "id": "dgdhzmm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "h-st-ry-19-17", "parent_id": "t1_dg8ixz5", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "I can answer some of these! Yes, the military of the Austro-Hungarian Empire was divided just as the empire was politically. There were three official military bodies within the land portion of the armed forces. First off there was what was called the 'common army' or the 'K.u.k Armee' (*kaiserlich und koniglich*, essentially imperial-royal army) of the empire. This was largest portion of the Imperial forces and it recruited from every land of the monarchy. Next there was the Imperial Austrian Landwehr which recruited from the Austrian half or Cisleithanian half of the monarchy. Thirdly there was the Royal Hungarian *Honved*, which recruited from the Hungarian (Transleithanian) half of the monarchy. Though it must be added technically there was another branch the Royal Croatian Home Guard which existed within the *Honved*. Confused yet? Maybe? Moving on!\n\nAs far as the language situation, soldiers in the Austro-Hungarian empire were sorted into units based upon geography, not ethnicity. The official language of command for the entire armed forces was German, however the language used between units of the *Honved* was Hungarian, the *Landwehr* also used German. Furthermore the Croatian contingent within the *Honved* were allowed to use Croatian as their language of communication between their own respective units. Finally, there was each individual regimental language which was determined based upon the ethnic make up of the particular regiment. Whichever language was spoken by the majority of the soldiers in a regiment would be the language used within the regiment. If there was no clear majority, then there would be two, or even three regimental languages. Officers had three years to learn the regimental languages or else they would be put on probation.\n\nAs for the various fronts the Austro-Hungarian army fought on you are largely correct, it saw combat primarily in the Balkans, the Italian front, and the Eastern front. Any involvement on the western front was minimal, except for in 1914 when the Austrian high command loaned 8 305 mm Skoda artillery pieces to the German army to aid in the reducing of the fortresses around Liege in Belgium. Following the capitulation of the Russians in 1918, there were plans to begin moving Austrian units to support the Germans on the Western Front, but the war ended before these plans could be fully utilized. There was also some minor Austrian involvement in the Dardanelles, again with a small contingent of artillery. \n\nAs far as the demographics of the army following the Brusilov offensive and the war in general I can't say as much, except that the Brusilov offensive seriously crippled the Hapsburg monarchies fighting abilities, which would lead to them being further subordinated to the German high command. \n\nSources:\n\n*A Social History of the Hapsburg Officer Corps, 1848-1918* Istvan Deak\n\n*For God and Kaiser, The Imperial Austrian Army 1619-1918* Richard Basset  \n\n*The Army of Francis Joseph* Gunther Rothenburg ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can answer some of these! Yes, the military of the Austro-Hungarian Empire was divided just as the empire was politically. There were three official military bodies within the land portion of the armed forces. First off there was what was called the &amp;#39;common army&amp;#39; or the &amp;#39;K.u.k Armee&amp;#39; (&lt;em&gt;kaiserlich und koniglich&lt;/em&gt;, essentially imperial-royal army) of the empire. This was largest portion of the Imperial forces and it recruited from every land of the monarchy. Next there was the Imperial Austrian Landwehr which recruited from the Austrian half or Cisleithanian half of the monarchy. Thirdly there was the Royal Hungarian &lt;em&gt;Honved&lt;/em&gt;, which recruited from the Hungarian (Transleithanian) half of the monarchy. Though it must be added technically there was another branch the Royal Croatian Home Guard which existed within the &lt;em&gt;Honved&lt;/em&gt;. Confused yet? Maybe? Moving on!&lt;/p&gt;\n\n&lt;p&gt;As far as the language situation, soldiers in the Austro-Hungarian empire were sorted into units based upon geography, not ethnicity. The official language of command for the entire armed forces was German, however the language used between units of the &lt;em&gt;Honved&lt;/em&gt; was Hungarian, the &lt;em&gt;Landwehr&lt;/em&gt; also used German. Furthermore the Croatian contingent within the &lt;em&gt;Honved&lt;/em&gt; were allowed to use Croatian as their language of communication between their own respective units. Finally, there was each individual regimental language which was determined based upon the ethnic make up of the particular regiment. Whichever language was spoken by the majority of the soldiers in a regiment would be the language used within the regiment. If there was no clear majority, then there would be two, or even three regimental languages. Officers had three years to learn the regimental languages or else they would be put on probation.&lt;/p&gt;\n\n&lt;p&gt;As for the various fronts the Austro-Hungarian army fought on you are largely correct, it saw combat primarily in the Balkans, the Italian front, and the Eastern front. Any involvement on the western front was minimal, except for in 1914 when the Austrian high command loaned 8 305 mm Skoda artillery pieces to the German army to aid in the reducing of the fortresses around Liege in Belgium. Following the capitulation of the Russians in 1918, there were plans to begin moving Austrian units to support the Germans on the Western Front, but the war ended before these plans could be fully utilized. There was also some minor Austrian involvement in the Dardanelles, again with a small contingent of artillery. &lt;/p&gt;\n\n&lt;p&gt;As far as the demographics of the army following the Brusilov offensive and the war in general I can&amp;#39;t say as much, except that the Brusilov offensive seriously crippled the Hapsburg monarchies fighting abilities, which would lead to them being further subordinated to the German high command. &lt;/p&gt;\n\n&lt;p&gt;Sources:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;A Social History of the Hapsburg Officer Corps, 1848-1918&lt;/em&gt; Istvan Deak&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;For God and Kaiser, The Imperial Austrian Army 1619-1918&lt;/em&gt; Richard Basset  &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;The Army of Francis Joseph&lt;/em&gt; Gunther Rothenburg &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgdhzmm", "score_hidden": false, "stickied": false, "created": 1492465931.0, "created_utc": 1492437131.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ixz5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Vyncis", "parent_id": "t1_dg7r5g8", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Thanks for your answer! :D  I do have some other questions though.\n\n* On the Schwarzlose M.7, what is the cone attached to the barrel, and its purpose? It looks quite strange.\n\n* I'm of the understanding that Ausria and Hungary were politically divided within the empire, did that same divide bleed into the military?\n\n* How did Austria-Hungary cope with all the different nationalities/languages in their army? Did they have something dedicated like a 'translation regiment' or did they simply expect people to know multiple languages?\n\n* Which fronts did Austria-Hungary end up fighting on? The Eastern/Italian/Balkan fronts of course, but did they fight on, say, the Western Front?\n\n* How much did the function/structure of Austria-Hungary's army change after the Brusilov offensive? Also: Did either Austria or Hungary suffer the bulk of those losses? Did it affect the internal politics between the two at all?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your answer! :D  I do have some other questions though.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;On the Schwarzlose M.7, what is the cone attached to the barrel, and its purpose? It looks quite strange.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I&amp;#39;m of the understanding that Ausria and Hungary were politically divided within the empire, did that same divide bleed into the military?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;How did Austria-Hungary cope with all the different nationalities/languages in their army? Did they have something dedicated like a &amp;#39;translation regiment&amp;#39; or did they simply expect people to know multiple languages?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Which fronts did Austria-Hungary end up fighting on? The Eastern/Italian/Balkan fronts of course, but did they fight on, say, the Western Front?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;How much did the function/structure of Austria-Hungary&amp;#39;s army change after the Brusilov offensive? Also: Did either Austria or Hungary suffer the bulk of those losses? Did it affect the internal politics between the two at all?&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8ixz5", "score_hidden": false, "stickied": false, "created": 1492160530.0, "created_utc": 1492131730.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65536x", "likes": null, "replies": "", "user_reports": [], "id": "dgdf5xp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tlumacz", "parent_id": "t1_dg7r5g8", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "&gt; there were four machine-gun detachments containing eight pieces\n\nEight pieces each or two each?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;there were four machine-gun detachments containing eight pieces&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Eight pieces each or two each?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgdf5xp", "score_hidden": false, "stickied": false, "created": 1492461133.0, "created_utc": 1492432333.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7r5g8", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "k_hopz", "parent_id": "t3_65536x", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Great question. My particular specialty is the Austro-Hungarian army, so I’ll focus on their use of machine guns in 1914. I’ll be very interested to see whether specialists on the other armies can compare or contrast their armies’ use of MGs. \n\nMachine guns were thought of very differently at the beginning of the First World War than they were at the end. The common image of the machine gun is of a light-weight weapon operated by one or two men which could be transported quickly in order to provide massive firepower at different points. The image usually involves a gunner swinging the gun from side to side into a wall of human flesh. I submit that this image is incorrect and involves transporting the image of the machine gun created during the Second World War *back* into the First World War.\n\nIt’s useful to revise one’s conception of the machine gun to match that of the contemporary armies that went to war in 1914. The machine gun was thought of less as a crew-serviced small arm and more as a miniature artillery piece. The number of machine guns in use with infantry units at the beginning of the war was very small. In the Austro-Hungarian army infantry regiments, numbering roughly 4200 men and officers, there were four machine-gun detachments containing eight pieces. Machine guns in the Austrian army were only integrated with infantry at the battalion level (roughly 1000 men and officers). Machine-gun detachments were commanded by their own commissioned officers and were usually ordered onto the battlefield by battalion- or regimental-level officers. At least in the Austrian army, machine guns were not very integrated with the operation of small units, as we might expect them to be taking into account our images and conceptions of the Second World War and Vietnam. So we can see that machine guns - operated by specially-trained men, commanded by specialist officers, and existing in discrete detachments at the battalion-level – more resembles artillery than another small arm. We can also see this in the way soldiers and officers would talk about machine guns. Often, when Austrian soldiers talked about their units success in battle, they would outline the “booty” captured in the battle; when doing this, they often listed the number of men captured, the number of artillery pieces, and the number of *machine guns,* indicating that they were thought of as heavy machinery to be coordinated with, rather than used by, infantry.\n\nIn terms of use, machine guns were deployed differently than they were later in the war and in subsequent wars. Machine guns prior to and during the early First World War were large and heavy weapons. The service machine-gun used by the Austrian army, the [Schwarzlose M.7](https://en.wikipedia.org/wiki/Schwarzlose_machine_gun), weighed, with the tripod, about 90 pounds, or around 42 kg. With the attached crew shield, the gun weighed even more. All this meant that bringing the gun into battle was a whole endeavor in and of itself. Indeed, the Austrian army’s machine-gun detachments required the use of two or three horses *per gun* for transport: one for the gun and tripod, one for the crew shield, and one for ammunition and support supplies. When bringing the gun up to the line of battle, usually four or so men were required to transport the gun, though sometimes, especially very early in the war, horses themselves were used to bring the guns up to the battle line.\n\nFinally, it’s useful to consider how the guns functioned as weapons. The image of a gunner swinging the gun side to side slaughtering infantrymen may have occurred, but this wasn’t really the primary effect sought after by commanders in the early days of the war. Machine guns were valued for their range, rate of fire, and accuracy. The ability of the machine gun to unite these three advantages made it so valuable on the battlefield. Machine guns in these early days were usually used to fire on a fixed position. The gunners would site the gun and then “lock” it in place, maintaining the gun’s elevation and side-to-side aiming. Then it was simply a matter of pulling the trigger and allowing the gun to “beat” a certain patch of ground. Early models allowed for slight side-to-side adjustments, but this was not seen as the primary function of the gun.\n\nNow, tthe fact that you could, with reasonable accuracy, rain 8mm rounds onto a specific point for extended periods of time made the weapon ideal – in terms of early use – for providing enfilading and flanking fire. Enfilading fire refers to a line of fire which seeks to fire rounds down the entire length of an enemy line, from the side, rather than firing upon a wide front of advancing men. You can see a basic illustration of the concept [here](https://i.redd.it/jq6o41b4irby.gif). As a result, when invading Russian Ukraine and Serbia in 1914, the Austrians often encountered enemy machine guns placed on the flanks of enemy defensive positions. The Russians were especially good at drawing up their defensive positions in a bowed shape, sucking Austrian infantry into the center and then raining machine-gun fire on them from the flanks.\n\nBeyond their defensive use, machine guns in the early days were also recognized for their offensive capabilities (though to a lesser degree, and usually by more experimental officers). In my research to date, I’ve found that the Austrian army generally used machine guns to consolidate offensive gains, first capturing enemy positions, afterward bringing up the machine guns (which had till then been held in the reserve) to fire on fleeing enemy and to defend against counterattacks. One of the Austrian majors I’ve followed, Major Hoppe of II Battalion, 1st Viennese Landwehr Regiment, executed this maneuver perfectly during the battle for the Polish town of Zamosc. After ousting the Russians from their hilltop defensive line, Hoppe called up his machine-gun detachment (dragged up by horses), set up the guns, and had them fire on the road leading from the hill back to the Russian rear. Firing down this road, the Austrian machine guns caught many of the Russian defenders fleeing back to the town of Zamosc. \n\nEDIT: Will add my sources when I get home and have access to the bibliographic information.\n", "edited": 1492099402.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great question. My particular specialty is the Austro-Hungarian army, so I’ll focus on their use of machine guns in 1914. I’ll be very interested to see whether specialists on the other armies can compare or contrast their armies’ use of MGs. &lt;/p&gt;\n\n&lt;p&gt;Machine guns were thought of very differently at the beginning of the First World War than they were at the end. The common image of the machine gun is of a light-weight weapon operated by one or two men which could be transported quickly in order to provide massive firepower at different points. The image usually involves a gunner swinging the gun from side to side into a wall of human flesh. I submit that this image is incorrect and involves transporting the image of the machine gun created during the Second World War &lt;em&gt;back&lt;/em&gt; into the First World War.&lt;/p&gt;\n\n&lt;p&gt;It’s useful to revise one’s conception of the machine gun to match that of the contemporary armies that went to war in 1914. The machine gun was thought of less as a crew-serviced small arm and more as a miniature artillery piece. The number of machine guns in use with infantry units at the beginning of the war was very small. In the Austro-Hungarian army infantry regiments, numbering roughly 4200 men and officers, there were four machine-gun detachments containing eight pieces. Machine guns in the Austrian army were only integrated with infantry at the battalion level (roughly 1000 men and officers). Machine-gun detachments were commanded by their own commissioned officers and were usually ordered onto the battlefield by battalion- or regimental-level officers. At least in the Austrian army, machine guns were not very integrated with the operation of small units, as we might expect them to be taking into account our images and conceptions of the Second World War and Vietnam. So we can see that machine guns - operated by specially-trained men, commanded by specialist officers, and existing in discrete detachments at the battalion-level – more resembles artillery than another small arm. We can also see this in the way soldiers and officers would talk about machine guns. Often, when Austrian soldiers talked about their units success in battle, they would outline the “booty” captured in the battle; when doing this, they often listed the number of men captured, the number of artillery pieces, and the number of &lt;em&gt;machine guns,&lt;/em&gt; indicating that they were thought of as heavy machinery to be coordinated with, rather than used by, infantry.&lt;/p&gt;\n\n&lt;p&gt;In terms of use, machine guns were deployed differently than they were later in the war and in subsequent wars. Machine guns prior to and during the early First World War were large and heavy weapons. The service machine-gun used by the Austrian army, the &lt;a href=\"https://en.wikipedia.org/wiki/Schwarzlose_machine_gun\"&gt;Schwarzlose M.7&lt;/a&gt;, weighed, with the tripod, about 90 pounds, or around 42 kg. With the attached crew shield, the gun weighed even more. All this meant that bringing the gun into battle was a whole endeavor in and of itself. Indeed, the Austrian army’s machine-gun detachments required the use of two or three horses &lt;em&gt;per gun&lt;/em&gt; for transport: one for the gun and tripod, one for the crew shield, and one for ammunition and support supplies. When bringing the gun up to the line of battle, usually four or so men were required to transport the gun, though sometimes, especially very early in the war, horses themselves were used to bring the guns up to the battle line.&lt;/p&gt;\n\n&lt;p&gt;Finally, it’s useful to consider how the guns functioned as weapons. The image of a gunner swinging the gun side to side slaughtering infantrymen may have occurred, but this wasn’t really the primary effect sought after by commanders in the early days of the war. Machine guns were valued for their range, rate of fire, and accuracy. The ability of the machine gun to unite these three advantages made it so valuable on the battlefield. Machine guns in these early days were usually used to fire on a fixed position. The gunners would site the gun and then “lock” it in place, maintaining the gun’s elevation and side-to-side aiming. Then it was simply a matter of pulling the trigger and allowing the gun to “beat” a certain patch of ground. Early models allowed for slight side-to-side adjustments, but this was not seen as the primary function of the gun.&lt;/p&gt;\n\n&lt;p&gt;Now, tthe fact that you could, with reasonable accuracy, rain 8mm rounds onto a specific point for extended periods of time made the weapon ideal – in terms of early use – for providing enfilading and flanking fire. Enfilading fire refers to a line of fire which seeks to fire rounds down the entire length of an enemy line, from the side, rather than firing upon a wide front of advancing men. You can see a basic illustration of the concept &lt;a href=\"https://i.redd.it/jq6o41b4irby.gif\"&gt;here&lt;/a&gt;. As a result, when invading Russian Ukraine and Serbia in 1914, the Austrians often encountered enemy machine guns placed on the flanks of enemy defensive positions. The Russians were especially good at drawing up their defensive positions in a bowed shape, sucking Austrian infantry into the center and then raining machine-gun fire on them from the flanks.&lt;/p&gt;\n\n&lt;p&gt;Beyond their defensive use, machine guns in the early days were also recognized for their offensive capabilities (though to a lesser degree, and usually by more experimental officers). In my research to date, I’ve found that the Austrian army generally used machine guns to consolidate offensive gains, first capturing enemy positions, afterward bringing up the machine guns (which had till then been held in the reserve) to fire on fleeing enemy and to defend against counterattacks. One of the Austrian majors I’ve followed, Major Hoppe of II Battalion, 1st Viennese Landwehr Regiment, executed this maneuver perfectly during the battle for the Polish town of Zamosc. After ousting the Russians from their hilltop defensive line, Hoppe called up his machine-gun detachment (dragged up by horses), set up the guns, and had them fire on the road leading from the hill back to the Russian rear. Firing down this road, the Austrian machine guns caught many of the Russian defenders fleeing back to the town of Zamosc. &lt;/p&gt;\n\n&lt;p&gt;EDIT: Will add my sources when I get home and have access to the bibliographic information.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg7r5g8", "score_hidden": false, "stickied": false, "created": 1492127954.0, "created_utc": 1492099154.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}]