[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As follow-ons:&lt;/p&gt;\n\n&lt;p&gt;How does the demographic picture of victims of demonic possession change when outside the scope of Catholicism or Christianity as a whole?&lt;/p&gt;\n\n&lt;p&gt;Going back to Catholicism, at the time when exorcists were also from among the laity, are the victims of possession mostly female?&lt;/p&gt;\n\n&lt;p&gt;Or are characters like Regan MacNeil stock damsel-in-distress characters? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "As follow-ons:\n\nHow does the demographic picture of victims of demonic possession change when outside the scope of Catholicism or Christianity as a whole?\n\nGoing back to Catholicism, at the time when exorcists were also from among the laity, are the victims of possession mostly female?\n\nOr are characters like Regan MacNeil stock damsel-in-distress characters? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "655bjl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 41, "report_reasons": null, "author": "chikindiner", "saved": false, "mod_reports": [], "name": "t3_655bjl", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "qualitycontributor", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/655bjl/when_exorcisms_are_portrayed_in_film_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1492117381.0, "url": "https://www.reddit.com/r/AskHistorians/comments/655bjl/when_exorcisms_are_portrayed_in_film_the/", "author_flair_text": "Interesting Inquirer", "quarantine": false, "title": "When exorcisms are portrayed in film, the possessed is often (usually) a woman or adolescent girl. Does that line up with possessions recognized by the Catholic Church?", "created_utc": 1492088581.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 41}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_655bjl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_655bjl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_655bjl", "likes": null, "replies": "", "user_reports": [], "id": "dg8labp", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "yodatsracist", "parent_id": "t1_dg8ivjl", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "I always took this to be this a part of a general \"they hate us cause the ain't us\" polemic against the Pharisees, which is one of the big themes of the Gospels. It's interesting because theologically, the Christians are clearly closer to the Pharisees than the Saduccees, but yet spend much more time bashing the Pharisees than the Sadducees presumably exactly because of this closeness. \n\nI also took the gist of their argument to parallel to the one Antonio makes in the *Merchant of Venice*, impugning Shylock,\n\n&gt;The devil can cite Scripture for his purpose.\n\n&gt;An evil soul producing holy witness\n\n&gt;Is like a villain with a smiling cheek,\n\n&gt;A goodly apple rotten at the heart.\n\n&gt;Oh, what a goodly outside falsehood hath!\n\nThe Devil does indeed actual quote scripture in Matthew and Luke's accounts of the [Temptation of Jesus](https://en.wikipedia.org/wiki/Temptation_of_Christ). \n\nAs for the Medieval issue, to paraphrase Amos 7:14, I am neither /u/sunagainstgold nor the son of /u/sunagainstgold, so I'm afraid I can't help you there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always took this to be this a part of a general &amp;quot;they hate us cause the ain&amp;#39;t us&amp;quot; polemic against the Pharisees, which is one of the big themes of the Gospels. It&amp;#39;s interesting because theologically, the Christians are clearly closer to the Pharisees than the Saduccees, but yet spend much more time bashing the Pharisees than the Sadducees presumably exactly because of this closeness. &lt;/p&gt;\n\n&lt;p&gt;I also took the gist of their argument to parallel to the one Antonio makes in the &lt;em&gt;Merchant of Venice&lt;/em&gt;, impugning Shylock,&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The devil can cite Scripture for his purpose.&lt;/p&gt;\n\n&lt;p&gt;An evil soul producing holy witness&lt;/p&gt;\n\n&lt;p&gt;Is like a villain with a smiling cheek,&lt;/p&gt;\n\n&lt;p&gt;A goodly apple rotten at the heart.&lt;/p&gt;\n\n&lt;p&gt;Oh, what a goodly outside falsehood hath!&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The Devil does indeed actual quote scripture in Matthew and Luke&amp;#39;s accounts of the &lt;a href=\"https://en.wikipedia.org/wiki/Temptation_of_Christ\"&gt;Temptation of Jesus&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;As for the Medieval issue, to paraphrase Amos 7:14, I am neither &lt;a href=\"/u/sunagainstgold\"&gt;/u/sunagainstgold&lt;/a&gt; nor the son of &lt;a href=\"/u/sunagainstgold\"&gt;/u/sunagainstgold&lt;/a&gt;, so I&amp;#39;m afraid I can&amp;#39;t help you there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8labp", "score_hidden": false, "stickied": false, "created": 1492163764.0, "created_utc": 1492134964.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ivjl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "chikindiner", "parent_id": "t1_dg8hgpe", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Thank you! I hadn't considered actually opening up the Bible. I'm wondering if the shift toward primarily women (if there was one) was a late medieval development or maybe even when the Dominicans were kicking up shit.\n\nThe Salem Witch Trials were actually one my mind when I asked the question. Specifically, the [physical examination of Sarah Good](http://salem.lib.virginia.edu/texts/tei/swp?term=Sarah%20Good&amp;div_id=n13.20&amp;chapter_id=n13) and how condemning warts near a woman's vagina was.\n\nYour answer led me to a question that may or may not be more appropriate for its own thread, though.\n\n&gt;Two gospels mention Jesus cast a demon out of a mute man, and the Phasisees claimed \"by the ruler of demons he casts out the demons\" (Matthew 9:32-34, Mark 3:20-22). Mark also adds the Pharisees claim he \"has Beelzebul\", echoing the claims that Jesus is demon possessed that we saw in John. Elsewhere, we see that \"this generation\" accused John the Baptist of being possessed (Matthew 11:16-19, Luke 7:31-35).\n\nWhy did the Pharisees believe Jesus's ability to cast out demons implied wickedness on his part? Was that par-for-the-Pharisaic-course or just something that was wrapped up in their greater distrust and hatred of Jesus?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! I hadn&amp;#39;t considered actually opening up the Bible. I&amp;#39;m wondering if the shift toward primarily women (if there was one) was a late medieval development or maybe even when the Dominicans were kicking up shit.&lt;/p&gt;\n\n&lt;p&gt;The Salem Witch Trials were actually one my mind when I asked the question. Specifically, the &lt;a href=\"http://salem.lib.virginia.edu/texts/tei/swp?term=Sarah%20Good&amp;amp;div_id=n13.20&amp;amp;chapter_id=n13\"&gt;physical examination of Sarah Good&lt;/a&gt; and how condemning warts near a woman&amp;#39;s vagina was.&lt;/p&gt;\n\n&lt;p&gt;Your answer led me to a question that may or may not be more appropriate for its own thread, though.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Two gospels mention Jesus cast a demon out of a mute man, and the Phasisees claimed &amp;quot;by the ruler of demons he casts out the demons&amp;quot; (Matthew 9:32-34, Mark 3:20-22). Mark also adds the Pharisees claim he &amp;quot;has Beelzebul&amp;quot;, echoing the claims that Jesus is demon possessed that we saw in John. Elsewhere, we see that &amp;quot;this generation&amp;quot; accused John the Baptist of being possessed (Matthew 11:16-19, Luke 7:31-35).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Why did the Pharisees believe Jesus&amp;#39;s ability to cast out demons implied wickedness on his part? Was that par-for-the-Pharisaic-course or just something that was wrapped up in their greater distrust and hatred of Jesus?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8ivjl", "score_hidden": false, "stickied": false, "created": 1492160437.0, "created_utc": 1492131637.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8hgpe", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "yodatsracist", "parent_id": "t3_655bjl", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "I can only discuss two specific periods of possession: those mentioned in the New Testament, and those mentioned in the records of the Salem Witch Trials.  Those in the New Testament are roughly evenly male and female, with relatively few of them being specifically young (or specifically old).  In the Salem Witch Trials, those who claimed possession were exclusively women, and primarily young.\n\nIn the New Testament, possession is mainly discussed in the [Synoptic Gospels](https://en.wikipedia.org/wiki/Synoptic_Gospels) and Acts.  However, in the Gospel of John, Jesus himself is thrice accused of having a demon (John 7:21, John 8:48, 10:20-21).  \n\n * Two of the Synoptics Gospels discuss a demon-possessed man in the Capernaum synagogue (Mark 1:25-7, Luke 4:31-37).  \n\n * All three Synoptics give an account of an episode of demon possession \"in the country of Gerasenes/Gadarenes\" (Matthew 8:28-34, Mark 5:1-20, Luke 8:26-39) where one (Mark, Luke) or two (Matthew) demon possessed men live in tombs.  This is the famous episode where Jesus asks the demon \"What is your name?\", and the Demon answers, \"My name is Legion, for we are many,\" and Jesus drives the unclear spirits into a herd of swine (Matthew has only an abridged version of this story).\n\n * Two of the Gospels have a story of Jesus healing the demon-possessed daughter of a gentile woman from afar (Matthew 15:21-28, Mark 7:24-50).\n\n * All three Synoptics tell the account of a boy who seemingly has epilepsy (foaming at the mouth, etc) until Jesus cast a demon out of him after his own disciples fail to (Matthew 17:14-21, Mark 9:14-29, Luke 9:37-42), with Mark having a more interesting and extended version.  \n\n * All three also have an account of a Jesus healing a mute, blind, and demon-possessed man (Matthew 12:22-30, Mark 3:20-27, Luke 11:14-23).  If only this man had also been a leper, Jesus could have gone 4/4.  \n\n * Two gospels mention Jesus cast a demon out of a mute man, and the Phasisees claimed \"by the ruler of demons he casts out the demons\" (Matthew 9:32-34, Mark 3:20-22).  Mark also adds the Pharisees claim he \"has Beelzebul\", echoing the claims that Jesus is demon possessed that we saw in John.  Elsewhere, we see that \"this generation\" accused John the Baptist of being possessed (Matthew 11:16-19, Luke 7:31-35).\n\n * Two Gospels claim Jesus at some point cast seven demons out of Mary Magdalene (Mark 16:9, Luke 8:2; this is in the \"Long Ending\" to Mark that many secular scholars doubt was original).  \n\n * He expelled a demon that had been crippling a woman, and the leader of the synagogue got angry at him for doing it on the Sabbath (Luke 13:10-17).\n\n * Jesus casts a demon out of Simon Peter's mother-in-law, curing her fever  along with \"many others\" (Matthew 8:14-17, Mark 1:29-39, Luke 4:38-44).  \n\n * Lastly, two of the Gospels say a demon (Luke) or Satan (John) entered in Judas before he betrayed Jesus (Luke 22:3,   John 13:27).\n\n\nMany others are also talked about in other places without specifics (Matthew 4:23-25, Luke 6:17-19).  There's a story of someone casting demons out in Jesus's name (Mark 9:38-41, there may be parallel texts as well)  Jesus is casting out demons even as Herod is looking for him (Luke 13:31-32).  Jesus tells a parable about the return of an unclear spirit to explain how evil the contemporary generation was (Matthew 12:43-5, Luke 11:24-26).  There's also a general commission that many will drive out demons in Jesus' name (Matthew 7:21-3; 10:1-8; Mark 3:5, 6:7, 6:13, 16:17; Luke 9:1, 10:17, Acts 5:16, Acts 8:7), or at least claim to.  None of these stories contained specifics like age or gender, as far as I could gather.\n\n * In Acts, we have further accounts without identifying detail (Acts 5:16, 8:6-8, 19:11-12, 19:13-20), but the only exorcism where there's a specific age or gender is when Paul and Silas cast a demon who could predict the future out of a slave girl in Philippi (Acts 16:16-24).  \n\n * There is also the failed attempt of the \"seven sons of a Jewish high priest name Sceva\" who were attempting to cast demons out of a man in Jesus's name, but failed and made fools of themselves (Acts 19:13-20).  \n\nBy this reckoning (not including Jesus and John the Baptist who were merely accused of being possessed by demons), we find that seven or eight demon-possessed men (man in synagogue, one or two among the Garasenes, boy who foamed at the mouth, mute and blind man, the mute man, Judas, the man the sevens of Sceva couldn’t heal) and five demon-possessed women (daughter of the gentile woman, Mary Magdalene, crippled woman, Peter’s mother-in-law, the slave girl in Acts) are mentioned in the New Testament by my quick count.  Interestingly, only one of the seven or eight men appear young (the boy who foamed at the mouth) but two of the five women appear young (the daughter of the gentile woman, the slave girl).  In the sense that Mary Madelene was unmarried, she may too have counted as “girl” socially, though I believe she’s referred to as a woman exclusively in the text.  By that token, though, several of the men who have no details about them could also be young--the narratives of most seem to presume they are unmarried.\n\nThe only place I can think to look for further systematic a account of possession claims is the Salem Witch hysteria. The Salem Witch Trials Documentary Archive and Transcription Project at the University of Virginia lists eleven girls “afflicted girls”.  By age, we have: \n\n * Elizabeth Parris (9); \n\n * Abigail Williams (11); \n\n * Ann Putnam, Jr. (12); \n\n * Elizabeth Hubbard (17); \n\n * Elizabeth Booth (no biographical essay, 18 per another source); \n\n * Mary Walcott (18); \n\n * Mercy Lewis (19); \n\n * Mary Warren (20); \n\n * Susanna Sheldon (no biographical essay, 23 per another source); \n\n * Sarah Churchill (25 years old); \n\n * Sarah Bibber (no biographical essay, \"a married woman in her mid-thirties from the neighboring town of Wenham\", the \"most unsavory\" and 'least respectable\" of all the \"afflicted girls\" per Boyer and Nissbaum's *Salem Possessed*).  \n\nThere were other accusers during the trials, but apparently no other accuser claimed possession.  Interestingly, *Salem Possessed* notes that \"six of the eight [afflicted girls who definitely lived in Salem Village; Sarah Bibber lived elsewhere, and it's unclear where Elizabeth Booth and Susanna Sheldon lived] were not living in their parents' households in 1692.\"  I feel like there's something of a \"young woman moves away from home\" trope in some of the films, such as Rosemary's Baby.\n\nWhile the age and gender distribution of New Testament accounts demon possession do not mesh well with demon possession in movies, the age and gender distribution of demon possession during the Salem Witch Hysteria seem to match closer your sense of the popular culture, and consist exclusively of women and primarily of girls and unmarried young women.  ", "edited": 1492130812.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can only discuss two specific periods of possession: those mentioned in the New Testament, and those mentioned in the records of the Salem Witch Trials.  Those in the New Testament are roughly evenly male and female, with relatively few of them being specifically young (or specifically old).  In the Salem Witch Trials, those who claimed possession were exclusively women, and primarily young.&lt;/p&gt;\n\n&lt;p&gt;In the New Testament, possession is mainly discussed in the &lt;a href=\"https://en.wikipedia.org/wiki/Synoptic_Gospels\"&gt;Synoptic Gospels&lt;/a&gt; and Acts.  However, in the Gospel of John, Jesus himself is thrice accused of having a demon (John 7:21, John 8:48, 10:20-21).  &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Two of the Synoptics Gospels discuss a demon-possessed man in the Capernaum synagogue (Mark 1:25-7, Luke 4:31-37).  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;All three Synoptics give an account of an episode of demon possession &amp;quot;in the country of Gerasenes/Gadarenes&amp;quot; (Matthew 8:28-34, Mark 5:1-20, Luke 8:26-39) where one (Mark, Luke) or two (Matthew) demon possessed men live in tombs.  This is the famous episode where Jesus asks the demon &amp;quot;What is your name?&amp;quot;, and the Demon answers, &amp;quot;My name is Legion, for we are many,&amp;quot; and Jesus drives the unclear spirits into a herd of swine (Matthew has only an abridged version of this story).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Two of the Gospels have a story of Jesus healing the demon-possessed daughter of a gentile woman from afar (Matthew 15:21-28, Mark 7:24-50).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;All three Synoptics tell the account of a boy who seemingly has epilepsy (foaming at the mouth, etc) until Jesus cast a demon out of him after his own disciples fail to (Matthew 17:14-21, Mark 9:14-29, Luke 9:37-42), with Mark having a more interesting and extended version.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;All three also have an account of a Jesus healing a mute, blind, and demon-possessed man (Matthew 12:22-30, Mark 3:20-27, Luke 11:14-23).  If only this man had also been a leper, Jesus could have gone 4/4.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Two gospels mention Jesus cast a demon out of a mute man, and the Phasisees claimed &amp;quot;by the ruler of demons he casts out the demons&amp;quot; (Matthew 9:32-34, Mark 3:20-22).  Mark also adds the Pharisees claim he &amp;quot;has Beelzebul&amp;quot;, echoing the claims that Jesus is demon possessed that we saw in John.  Elsewhere, we see that &amp;quot;this generation&amp;quot; accused John the Baptist of being possessed (Matthew 11:16-19, Luke 7:31-35).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Two Gospels claim Jesus at some point cast seven demons out of Mary Magdalene (Mark 16:9, Luke 8:2; this is in the &amp;quot;Long Ending&amp;quot; to Mark that many secular scholars doubt was original).  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;He expelled a demon that had been crippling a woman, and the leader of the synagogue got angry at him for doing it on the Sabbath (Luke 13:10-17).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Jesus casts a demon out of Simon Peter&amp;#39;s mother-in-law, curing her fever  along with &amp;quot;many others&amp;quot; (Matthew 8:14-17, Mark 1:29-39, Luke 4:38-44).  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Lastly, two of the Gospels say a demon (Luke) or Satan (John) entered in Judas before he betrayed Jesus (Luke 22:3,   John 13:27).&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Many others are also talked about in other places without specifics (Matthew 4:23-25, Luke 6:17-19).  There&amp;#39;s a story of someone casting demons out in Jesus&amp;#39;s name (Mark 9:38-41, there may be parallel texts as well)  Jesus is casting out demons even as Herod is looking for him (Luke 13:31-32).  Jesus tells a parable about the return of an unclear spirit to explain how evil the contemporary generation was (Matthew 12:43-5, Luke 11:24-26).  There&amp;#39;s also a general commission that many will drive out demons in Jesus&amp;#39; name (Matthew 7:21-3; 10:1-8; Mark 3:5, 6:7, 6:13, 16:17; Luke 9:1, 10:17, Acts 5:16, Acts 8:7), or at least claim to.  None of these stories contained specifics like age or gender, as far as I could gather.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;In Acts, we have further accounts without identifying detail (Acts 5:16, 8:6-8, 19:11-12, 19:13-20), but the only exorcism where there&amp;#39;s a specific age or gender is when Paul and Silas cast a demon who could predict the future out of a slave girl in Philippi (Acts 16:16-24).  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There is also the failed attempt of the &amp;quot;seven sons of a Jewish high priest name Sceva&amp;quot; who were attempting to cast demons out of a man in Jesus&amp;#39;s name, but failed and made fools of themselves (Acts 19:13-20).  &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;By this reckoning (not including Jesus and John the Baptist who were merely accused of being possessed by demons), we find that seven or eight demon-possessed men (man in synagogue, one or two among the Garasenes, boy who foamed at the mouth, mute and blind man, the mute man, Judas, the man the sevens of Sceva couldn’t heal) and five demon-possessed women (daughter of the gentile woman, Mary Magdalene, crippled woman, Peter’s mother-in-law, the slave girl in Acts) are mentioned in the New Testament by my quick count.  Interestingly, only one of the seven or eight men appear young (the boy who foamed at the mouth) but two of the five women appear young (the daughter of the gentile woman, the slave girl).  In the sense that Mary Madelene was unmarried, she may too have counted as “girl” socially, though I believe she’s referred to as a woman exclusively in the text.  By that token, though, several of the men who have no details about them could also be young--the narratives of most seem to presume they are unmarried.&lt;/p&gt;\n\n&lt;p&gt;The only place I can think to look for further systematic a account of possession claims is the Salem Witch hysteria. The Salem Witch Trials Documentary Archive and Transcription Project at the University of Virginia lists eleven girls “afflicted girls”.  By age, we have: &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Elizabeth Parris (9); &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Abigail Williams (11); &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Ann Putnam, Jr. (12); &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Elizabeth Hubbard (17); &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Elizabeth Booth (no biographical essay, 18 per another source); &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Mary Walcott (18); &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Mercy Lewis (19); &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Mary Warren (20); &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Susanna Sheldon (no biographical essay, 23 per another source); &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Sarah Churchill (25 years old); &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Sarah Bibber (no biographical essay, &amp;quot;a married woman in her mid-thirties from the neighboring town of Wenham&amp;quot;, the &amp;quot;most unsavory&amp;quot; and &amp;#39;least respectable&amp;quot; of all the &amp;quot;afflicted girls&amp;quot; per Boyer and Nissbaum&amp;#39;s &lt;em&gt;Salem Possessed&lt;/em&gt;).  &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;There were other accusers during the trials, but apparently no other accuser claimed possession.  Interestingly, &lt;em&gt;Salem Possessed&lt;/em&gt; notes that &amp;quot;six of the eight [afflicted girls who definitely lived in Salem Village; Sarah Bibber lived elsewhere, and it&amp;#39;s unclear where Elizabeth Booth and Susanna Sheldon lived] were not living in their parents&amp;#39; households in 1692.&amp;quot;  I feel like there&amp;#39;s something of a &amp;quot;young woman moves away from home&amp;quot; trope in some of the films, such as Rosemary&amp;#39;s Baby.&lt;/p&gt;\n\n&lt;p&gt;While the age and gender distribution of New Testament accounts demon possession do not mesh well with demon possession in movies, the age and gender distribution of demon possession during the Salem Witch Hysteria seem to match closer your sense of the popular culture, and consist exclusively of women and primarily of girls and unmarried young women.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8hgpe", "score_hidden": false, "stickied": false, "created": 1492158517.0, "created_utc": 1492129717.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_655bjl", "likes": null, "replies": "", "user_reports": [], "id": "dgc96x6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Llan79", "parent_id": "t3_655bjl", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Oh shit I can actually answer this! The answer, at least in medieval and early modern Europe, is yes. Women were more commonly possessed, both by demons and angels, across Europe. It was widely believed that this was due to their moral failings (they were more easily seduced by the devil) and their biological characteristics. Demons were thought to enter through the victims' orifices, and as women have more than men they were thought to be easier to enter. Women were also thought to have more variation in their humours, allowing demons to manipulate them more easily to cause illness.\n\nSources: \n\nNancy Caciola - Discerning Spirits: Divine and Demonic Possession in the Middle Ages (2003)\n\nNancy Caciola and Moshe Sluhovsky, “Spiritual Physiologies: The Discernment of Spirits in Medieval and Early Modern Europe,” Preternature: Critical and Historical Studies on the Supernatural 1/1 (May, 2012)\n\nStuart Clark - Thinking with Demons (1997)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh shit I can actually answer this! The answer, at least in medieval and early modern Europe, is yes. Women were more commonly possessed, both by demons and angels, across Europe. It was widely believed that this was due to their moral failings (they were more easily seduced by the devil) and their biological characteristics. Demons were thought to enter through the victims&amp;#39; orifices, and as women have more than men they were thought to be easier to enter. Women were also thought to have more variation in their humours, allowing demons to manipulate them more easily to cause illness.&lt;/p&gt;\n\n&lt;p&gt;Sources: &lt;/p&gt;\n\n&lt;p&gt;Nancy Caciola - Discerning Spirits: Divine and Demonic Possession in the Middle Ages (2003)&lt;/p&gt;\n\n&lt;p&gt;Nancy Caciola and Moshe Sluhovsky, “Spiritual Physiologies: The Discernment of Spirits in Medieval and Early Modern Europe,” Preternature: Critical and Historical Studies on the Supernatural 1/1 (May, 2012)&lt;/p&gt;\n\n&lt;p&gt;Stuart Clark - Thinking with Demons (1997)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgc96x6", "score_hidden": false, "stickied": false, "created": 1492390404.0, "created_utc": 1492361604.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]