[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ok so I keep hearing references to his name in media (music, tv shows, movies). And usually it&amp;#39;s a one off name drop. So I watched Bio-dome the other day, and that movie is pretty aggressively terrible, and Pauly Shore isn&amp;#39;t that remarkable... So what happened in the early 90s that still have people making references to Pauly Shore to this day?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Ok so I keep hearing references to his name in media (music, tv shows, movies). And usually it's a one off name drop. So I watched Bio-dome the other day, and that movie is pretty aggressively terrible, and Pauly Shore isn't that remarkable... So what happened in the early 90s that still have people making references to Pauly Shore to this day?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "659zbs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 37, "report_reasons": null, "author": "HuffmanDickings", "saved": false, "mod_reports": [], "name": "t3_659zbs", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/659zbs/why_was_pauly_shore_popular/", "num_reports": null, "locked": false, "stickied": false, "created": 1492165305.0, "url": "https://www.reddit.com/r/AskHistorians/comments/659zbs/why_was_pauly_shore_popular/", "author_flair_text": null, "quarantine": false, "title": "Why was Pauly Shore popular?", "created_utc": 1492136505.0, "distinguished": null, "media": null, "upvote_ratio": 0.74, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 37}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_659zbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_659zbs", "likes": null, "replies": "", "user_reports": [], "id": "dg9f6g7", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "faceintheblue", "parent_id": "t1_dg8sqm1", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Great answer. A further point that might be worth adding? Paulie Shore was the early 90s go-to stoner space cadet casting choice. The Baby Boomers had Cheech and Chong, and Generation X had Paulie Shore. There will always be a place in low brow comedy for the loveable not-all-there man-child. Paulie Shore had that spot for a few years. I don't think it was hard work or innate talent so much as he was well-known in comedic circles at the time. Right place, right time, and he was straight out of central casting for early-20s loveable weirdo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great answer. A further point that might be worth adding? Paulie Shore was the early 90s go-to stoner space cadet casting choice. The Baby Boomers had Cheech and Chong, and Generation X had Paulie Shore. There will always be a place in low brow comedy for the loveable not-all-there man-child. Paulie Shore had that spot for a few years. I don&amp;#39;t think it was hard work or innate talent so much as he was well-known in comedic circles at the time. Right place, right time, and he was straight out of central casting for early-20s loveable weirdo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg9f6g7", "score_hidden": false, "stickied": false, "created": 1492218503.0, "created_utc": 1492189703.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_659zbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_659zbs", "likes": null, "replies": "", "user_reports": [], "id": "dg923fh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MaesterMagoo", "parent_id": "t1_dg91h0k", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "If you want to read a great book that is tangentially about stand-up read Steve Martin's \"Born Standing Up\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you want to read a great book that is tangentially about stand-up read Steve Martin&amp;#39;s &amp;quot;Born Standing Up&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg923fh", "score_hidden": false, "stickied": false, "created": 1492200976.0, "created_utc": 1492172176.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg91h0k", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "chikindiner", "parent_id": "t1_dg8sqm1", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "So I know Pauly Shore was 10ish years old around the time of the picket lines in front of the Comedy Store, but did his reputation get wrapped up in his mother's in the eyes of comics?\n\nTo be clear, I'm not 100% sure of just what Mitzi Shore's reputation is today. I've had [I'm Dying Up Here](http://www.goodreads.com/book/show/1698163.I_m_Dying_Up_Here) collecting dust on a shelf for a while now.\n\nNot sure how much reading on comedy you do, but if you've read it can you recommend it? Or anything else about stand up?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So I know Pauly Shore was 10ish years old around the time of the picket lines in front of the Comedy Store, but did his reputation get wrapped up in his mother&amp;#39;s in the eyes of comics?&lt;/p&gt;\n\n&lt;p&gt;To be clear, I&amp;#39;m not 100% sure of just what Mitzi Shore&amp;#39;s reputation is today. I&amp;#39;ve had &lt;a href=\"http://www.goodreads.com/book/show/1698163.I_m_Dying_Up_Here\"&gt;I&amp;#39;m Dying Up Here&lt;/a&gt; collecting dust on a shelf for a while now.&lt;/p&gt;\n\n&lt;p&gt;Not sure how much reading on comedy you do, but if you&amp;#39;ve read it can you recommend it? Or anything else about stand up?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg91h0k", "score_hidden": false, "stickied": false, "created": 1492199579.0, "created_utc": 1492170779.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_659zbs", "likes": null, "replies": "", "user_reports": [], "id": "dg9izdc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HuffmanDickings", "parent_id": "t1_dg8sqm1", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "this is a great response! thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this is a great response! thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg9izdc", "score_hidden": false, "stickied": false, "created": 1492222937.0, "created_utc": 1492194137.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8sqm1", "gilded": 0, "archived": false, "score": 53, "report_reasons": null, "author": "yodatsracist", "parent_id": "t3_659zbs", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "One issue is that Pauley Shore is the son of [Mitzi Shore](https://en.wikipedia.org/wiki/Mitzi_Shore), who runs the famous [Comedy Store](https://en.wikipedia.org/wiki/The_Comedy_Store), which is certainly the premier venue for up-and-coming stand-up comedians in California, and perhaps in the world. Through performing at the store, many comics have come to personally know Pauley and his mother. He continues to help run the Comedy Store, and in fact there was briefly a reality show about it called *Minding the Store*. This could explain why he is mentioned by comedians more than other comedians of that era, like Andrew Dice Clay or Janeane Garofalo: they know him personally. He also made a movie called *[Pauley Shore is Dead](https://en.wikipedia.org/wiki/Pauly_Shore_Is_Dead)* in 2003 poking fun at his irrelevance, which I think helped return to popular culture, at least among comedians, as a reference for something that's now mostly forgotten but used to be popular.\n\nThat doesn't help explain why Pauley Shore was popular then, but it might start to explain why he's talked about more than you'd expect now. It's also important to remember his actual time in the limelight as an actor  was very short (though he was an MTV VJ before that), going only really five live action films between 1992's *Encino Man* to 1996's *Bio-Dome*. The first of which was a surprise hit grossing more than 40 million on a 7 million dollar budget, and the last two of which lost money domestically, though may have broken even on foreign rights and VHS sales. By 1997, his TV show was cancelled after 5 episodes and he was a bit of a has-been. While people in the 90's may have found him funny, it's clear not enough people found him funny for long. Besides voice work and cameos, the next project he was in was a direct-to-video film called *the Bogus Witch Project*. \n\nAnother way to think of it is that, even at the height of his popularity, he was much less popular then than the much maligned Kevin James is now, in terms of film success with audiences: from 2007 to present, Kevin James starred in nine theatrically-released, live-action movies, eight of which were clearly huge money makers and the ninth broke even.  It's hard to think of other contemporary comedy actors to compare Pauley Shore to in terms of popularity.  The two do enjoy similar low esteem with critics, however: those nine movies averaged a very low 18/100 for critics ratings on Rotten Tomatoes, compared with the even more abysmal 10/100 average for Shore's five (fun facts: Shore's *Jury Duty* has a 0% Fresh rating from critics and James's *Here Comes the Boom* and *Paul Blart: Mall Cop* both managed break 30%).", "edited": 1492156831.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One issue is that Pauley Shore is the son of &lt;a href=\"https://en.wikipedia.org/wiki/Mitzi_Shore\"&gt;Mitzi Shore&lt;/a&gt;, who runs the famous &lt;a href=\"https://en.wikipedia.org/wiki/The_Comedy_Store\"&gt;Comedy Store&lt;/a&gt;, which is certainly the premier venue for up-and-coming stand-up comedians in California, and perhaps in the world. Through performing at the store, many comics have come to personally know Pauley and his mother. He continues to help run the Comedy Store, and in fact there was briefly a reality show about it called &lt;em&gt;Minding the Store&lt;/em&gt;. This could explain why he is mentioned by comedians more than other comedians of that era, like Andrew Dice Clay or Janeane Garofalo: they know him personally. He also made a movie called &lt;em&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Pauly_Shore_Is_Dead\"&gt;Pauley Shore is Dead&lt;/a&gt;&lt;/em&gt; in 2003 poking fun at his irrelevance, which I think helped return to popular culture, at least among comedians, as a reference for something that&amp;#39;s now mostly forgotten but used to be popular.&lt;/p&gt;\n\n&lt;p&gt;That doesn&amp;#39;t help explain why Pauley Shore was popular then, but it might start to explain why he&amp;#39;s talked about more than you&amp;#39;d expect now. It&amp;#39;s also important to remember his actual time in the limelight as an actor  was very short (though he was an MTV VJ before that), going only really five live action films between 1992&amp;#39;s &lt;em&gt;Encino Man&lt;/em&gt; to 1996&amp;#39;s &lt;em&gt;Bio-Dome&lt;/em&gt;. The first of which was a surprise hit grossing more than 40 million on a 7 million dollar budget, and the last two of which lost money domestically, though may have broken even on foreign rights and VHS sales. By 1997, his TV show was cancelled after 5 episodes and he was a bit of a has-been. While people in the 90&amp;#39;s may have found him funny, it&amp;#39;s clear not enough people found him funny for long. Besides voice work and cameos, the next project he was in was a direct-to-video film called &lt;em&gt;the Bogus Witch Project&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;Another way to think of it is that, even at the height of his popularity, he was much less popular then than the much maligned Kevin James is now, in terms of film success with audiences: from 2007 to present, Kevin James starred in nine theatrically-released, live-action movies, eight of which were clearly huge money makers and the ninth broke even.  It&amp;#39;s hard to think of other contemporary comedy actors to compare Pauley Shore to in terms of popularity.  The two do enjoy similar low esteem with critics, however: those nine movies averaged a very low 18/100 for critics ratings on Rotten Tomatoes, compared with the even more abysmal 10/100 average for Shore&amp;#39;s five (fun facts: Shore&amp;#39;s &lt;em&gt;Jury Duty&lt;/em&gt; has a 0% Fresh rating from critics and James&amp;#39;s &lt;em&gt;Here Comes the Boom&lt;/em&gt; and &lt;em&gt;Paul Blart: Mall Cop&lt;/em&gt; both managed break 30%).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg8sqm1", "score_hidden": false, "stickied": false, "created": 1492175568.0, "created_utc": 1492146768.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 53}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_659zbs", "likes": null, "replies": "", "user_reports": [], "id": "dgada3g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EnzoFerrari99", "parent_id": "t3_659zbs", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "I am 36, so I remember when Pauli Shore was unleashed onto the American public. He was not introduced as a movie star, or actor. \n\nHe gained his fame as an MTV VJ. He was a quirky guy who became popular due to his over the top, self-conscious, slightly ironic, persona as a SoCal beach bum. (He essentially ripped off Sean Penn's Jeff Spicoli character from Fast Times at Ridgemont High.) \n\nHe had tan skin, brown curly hair kept off his face by a wide colorful bandanna, and a glazed look in his eyes. He also would constantly giggle while on air (intimating he was high, or dumb, or both.) He just came off as a carefree, fun in the sun loving, charismatic, not too bright, odd, nonthreatening, neo-hippie/surfer beach bum. He wore weird clothes like jorts, or daisy dukes and dashiki like tops. He would pepper his intros with weird, colorful language (using words like \"grindage\") and talk in seemingly regional cadence (to anyone outside of california) by drawing out his vowels in a sing songy way, like, \"hey, buuuudy.\" and \"I'm the weeeeeasel (followed by a weasel sound), or just howl, \"Oooooooooow, ::laugh::\". Oh!! That reminds me, he called himself the Weasel! \n\nSo he quickly became one of MTVs most popular VJs. The stories about his famous father owning the comedy store is true, but I don't think many people outside of entertainment or Hollywood community knew this about him. And his movie career was an attempt to capitalize on the success he had garnered as a video jockey. That is why the movies he stars in are usually vehicles for his Weasel character. It's also why he was allowed to make several movies in spite of never being a very good actor or being in any very critically or commercially successful film. \n\nHe was not the first not last MTV VJ with a cult following on account of his personality. As a matter of fact by decades end MTV hosted a choose the VJ contest where viewers called in and voted for their favorite contestants (like American Idol). And if you want to get an idea of what the taste for VJs were at the time you need look no further than the winner of that contest, someone even weirder than Pauli Shore. A rando by the name of Jesse Camp -- who essentially was a lanky guy with a high cracking falsetto and weird 70s vintage clothing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am 36, so I remember when Pauli Shore was unleashed onto the American public. He was not introduced as a movie star, or actor. &lt;/p&gt;\n\n&lt;p&gt;He gained his fame as an MTV VJ. He was a quirky guy who became popular due to his over the top, self-conscious, slightly ironic, persona as a SoCal beach bum. (He essentially ripped off Sean Penn&amp;#39;s Jeff Spicoli character from Fast Times at Ridgemont High.) &lt;/p&gt;\n\n&lt;p&gt;He had tan skin, brown curly hair kept off his face by a wide colorful bandanna, and a glazed look in his eyes. He also would constantly giggle while on air (intimating he was high, or dumb, or both.) He just came off as a carefree, fun in the sun loving, charismatic, not too bright, odd, nonthreatening, neo-hippie/surfer beach bum. He wore weird clothes like jorts, or daisy dukes and dashiki like tops. He would pepper his intros with weird, colorful language (using words like &amp;quot;grindage&amp;quot;) and talk in seemingly regional cadence (to anyone outside of california) by drawing out his vowels in a sing songy way, like, &amp;quot;hey, buuuudy.&amp;quot; and &amp;quot;I&amp;#39;m the weeeeeasel (followed by a weasel sound), or just howl, &amp;quot;Oooooooooow, ::laugh::&amp;quot;. Oh!! That reminds me, he called himself the Weasel! &lt;/p&gt;\n\n&lt;p&gt;So he quickly became one of MTVs most popular VJs. The stories about his famous father owning the comedy store is true, but I don&amp;#39;t think many people outside of entertainment or Hollywood community knew this about him. And his movie career was an attempt to capitalize on the success he had garnered as a video jockey. That is why the movies he stars in are usually vehicles for his Weasel character. It&amp;#39;s also why he was allowed to make several movies in spite of never being a very good actor or being in any very critically or commercially successful film. &lt;/p&gt;\n\n&lt;p&gt;He was not the first not last MTV VJ with a cult following on account of his personality. As a matter of fact by decades end MTV hosted a choose the VJ contest where viewers called in and voted for their favorite contestants (like American Idol). And if you want to get an idea of what the taste for VJs were at the time you need look no further than the winner of that contest, someone even weirder than Pauli Shore. A rando by the name of Jesse Camp -- who essentially was a lanky guy with a high cracking falsetto and weird 70s vintage clothing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgada3g", "score_hidden": false, "stickied": false, "created": 1492265428.0, "created_utc": 1492236628.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_659zbs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_659zbs", "likes": null, "replies": "", "user_reports": [], "id": "dg95hb6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "chocolatepot", "parent_id": "t1_dg93wji", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Sorry, but this response has been removed because we do not allow [personal anecdotes](http://www.reddit.com/r/AskHistorians/wiki/rules#wiki_no_personal_anecdotes).  While they're sometimes quite interesting, they're unverifiable, impossible to cross-reference, and not of much use without more context.  [This discussion thread](https://www.reddit.com/r/AskHistorians/comments/40mle4/rules_roundtable_3_explaining_the_no_personal/) explains the reasoning behind this rule.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry, but this response has been removed because we do not allow &lt;a href=\"http://www.reddit.com/r/AskHistorians/wiki/rules#wiki_no_personal_anecdotes\"&gt;personal anecdotes&lt;/a&gt;.  While they&amp;#39;re sometimes quite interesting, they&amp;#39;re unverifiable, impossible to cross-reference, and not of much use without more context.  &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/40mle4/rules_roundtable_3_explaining_the_no_personal/\"&gt;This discussion thread&lt;/a&gt; explains the reasoning behind this rule.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg95hb6", "score_hidden": false, "stickied": false, "created": 1492206792.0, "created_utc": 1492177992.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg93wji", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_659zbs", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dg93wji", "score_hidden": false, "stickied": false, "created": 1492204372.0, "created_utc": 1492175572.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]