[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been listening to The History of Rome Podcast and this question popped in my mind. During the Punic wars it surprised me that Rome was defeated several times with huge losses and still was able to have men attack other areas of Carthage. Yet, during the late Empire, it seems to be a recurring theme that Rome (or Ravenna) was always outnumbered, or outmatched, when fighting the Goths and Huns, even after conditions arguably as existentially dire as during the Punic wars.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have been listening to The History of Rome Podcast and this question popped in my mind. During the Punic wars it surprised me that Rome was defeated several times with huge losses and still was able to have men attack other areas of Carthage. Yet, during the late Empire, it seems to be a recurring theme that Rome (or Ravenna) was always outnumbered, or outmatched, when fighting the Goths and Huns, even after conditions arguably as existentially dire as during the Punic wars.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65iv8v", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 536, "report_reasons": null, "author": "PraecorLoth970", "saved": false, "mod_reports": [], "name": "t3_65iv8v", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/65iv8v/during_the_punic_wars_rome_was_apparently_able_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492288559.0, "url": "https://www.reddit.com/r/AskHistorians/comments/65iv8v/during_the_punic_wars_rome_was_apparently_able_to/", "author_flair_text": null, "quarantine": false, "title": "During the Punic Wars, Rome was apparently able to produce army after army to fight the Carthaginians. Yet, during the late empire, when (western) Rome was nominally larger, they had much difficulty in recruiting men and relied a lot on Germanic mercenaries and allies. Why is that?", "created_utc": 1492259759.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 536}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65iv8v", "likes": null, "replies": "", "user_reports": [], "id": "dgashwx", "gilded": 0, "archived": false, "score": 76, "report_reasons": null, "author": "mrleopards", "parent_id": "t3_65iv8v", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "This is a very complex question to answer. There are a lot of possibilities but we don't know precisely why. Many solid and well supported theories are covered in this thread: https://www.reddit.com/r/AskHistorians/comments/470bpp/during_the_punic_wars_rome_and_her_allies_lost/\n\nEdit: at the request of the mods, /u/Goodmorningdave, /u/nihilistsocialist, /u/iguana_on_a_stick all have comprehensive answers covering a variety of factors such as, the crisis of the 3rd century, plagues, economic crises, cultural shifts, and the increased activity required of the military in the late empire. ", "edited": 1492271827.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a very complex question to answer. There are a lot of possibilities but we don&amp;#39;t know precisely why. Many solid and well supported theories are covered in this thread: &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/470bpp/during_the_punic_wars_rome_and_her_allies_lost/\"&gt;https://www.reddit.com/r/AskHistorians/comments/470bpp/during_the_punic_wars_rome_and_her_allies_lost/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Edit: at the request of the mods, &lt;a href=\"/u/Goodmorningdave\"&gt;/u/Goodmorningdave&lt;/a&gt;, &lt;a href=\"/u/nihilistsocialist\"&gt;/u/nihilistsocialist&lt;/a&gt;, &lt;a href=\"/u/iguana_on_a_stick\"&gt;/u/iguana_on_a_stick&lt;/a&gt; all have comprehensive answers covering a variety of factors such as, the crisis of the 3rd century, plagues, economic crises, cultural shifts, and the increased activity required of the military in the late empire. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgashwx", "score_hidden": false, "stickied": false, "created": 1492300265.0, "created_utc": 1492271465.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 76}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65iv8v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65iv8v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65iv8v", "likes": null, "replies": "", "user_reports": [], "id": "dgbvyn4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HP_civ", "parent_id": "t1_dgb5hfr", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Great work! Thank you for your answer", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great work! Thank you for your answer&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgbvyn4", "score_hidden": false, "stickied": false, "created": 1492364517.0, "created_utc": 1492335717.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb5hfr", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "Celebreth", "parent_id": "t1_dgb3mug", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "By the time of the late Empire, when the Goths were a large problem and the capital was moved to Ravenna, the Marian Reforms were a thing of the very distant past. While they certainly had some effect - the event was a step on Rome's path to having a professional army - they were farther removed from the Late Romans than the Revolutionary War is from modern America, for some perspective. If you want to go back a ways, the earliest you could probably reach with any relevance would be Augustus' recruiting problems in the early first century AD, when Italians openly rioted at the prospect of a draft.^1\n\nThe general attitude of the Italian Romans changed after their century of civil war when it came to actually being involved in a war. Augustus was a pretty smart dude, though, and tried to work around this rising issue. Veteran colonies were set up - he settled over 300,000 men in ten years,^2 talk about logistics - across the provinces, though only a small fraction of those were in Italy. These colonies were as militarized as you can get: they followed the same format as their old military life^3, with their officers becoming the civilian leaders of the city. This format gave a huge amount of relief to the Italian peninsula, but it also unfortunately removed its military tradition, which was spread through the provinces - specifically the borders, which is where these veteran colonies were often founded. Veteran colonies stopped being founded sometime in the second century AD (as per that quote from Tacitus, they just used the existing colonies) due to the sheer expense and lack of new land.\n\nIt's a bit of a digression, but the Early Empire and Late Republic were *very* different creatures from the Late Empire - which had a thousand and one different reasons to have a low supply of manpower. Claiming that the civil wars (from centuries prior) were the cause could maaaaybe be used as an argument, but probably not an especially good one. \n\n(translations below are my own)\n\n1. Goldsworthy, *Augustus*, 436-439,455; for the disconnect of these actions from previous eras, see Polybius 6.26.4 (written in the 2nd c. BC): “All men who were registered arrive without fail, since of those mustered there was no excuse which could be created, except for an augury or disabilities.” “*παραγίνονται δὲ πάντες ἀδιαπτώτως οἱ καταγραφέντες, ὡς ἂν μηδεμιᾶς ἄλλης συγχωρουμένης προφάσεως τοῖς ἐξορκισθεῖσι πλὴν ὀρνιθείας καὶ τῶν ἀδυνάτων*.” \n\n Also Cicero's (first century BC) dripping scorn when he touches on those who do not register for the census (draft dodgers): *Pro Caecina*, 99: “When it [the state] sells an unregistered man, it judges in this way: while a man, who was in just slavery, is freed from the census, the man who, although being free, is unwilling to be registered [on the census], deprived himself of his own liberty.” “*cum autem incensum vendit, hoc iudicat, cum ei qui in servitute iusta fuerunt censu liberentur, eum qui, cum liber esset, censeri noluerit, ipsum sibi libertatem abiudicavisse.*” \n\n2. *Res Gestae Divi Augusti* (early first century AD), 3.3. “Those Roman citizens who were bound by an oath to me were around 500,000. Of these I drew down into colonies or removed into their own towns when they had finished their term of service, rather more than 300,000 men, and to all I designated lands or gave money as a reward for military service.” “*Milia civium Romanorum adacta sacramento meo fuerunt circiter quingenta. Ex quibus deduxi in colonias aut remisi in municipia sua stipendis emeritis millia aliquanto plura quam trecenta et iis omnibus agros adsignavi aut pecuniam pro praemis militiae dedi.*”\n\n  These colonies usually averaged about 3,000 men, not including women and children - for example this one (Strabo, *Geography*,  4.6.7): “[Augustus] Caesar sent 3000 Romans who settled the city Augusta, on the place where Varro camped, and now the whole surrounding country is at peace, as far as beyond the peaks of the mountain range.”  “*τρισχιλίους δὲ Ῥωμαίων πέμψας ᾤκισε τὴν πόλιν Αὐγοῦσταν ὁ Καῖσαρ, ἐν ᾧ ἐστρατοπέδευσε χωρίῳ ὁ Ὀυάρρων, καὶ νῦν εἰρήνην ἄγει πᾶσα ἡπλησιόχωρος μέχρι τῶν ἄκρων ὑπερβολῶν τοῦ ὄρους.*” \n\n3. Tacitus, while bitching about the current state of resettlement, says in, *Annals*, 14.27: “For whole legions were not led off, as in old times (He means the time of Augustus here), with their own tribunes and centurions and with soldiers in each rank so that with consensus and esteem they would make a state, but they were strangers among themselves, with different maniples, without a leader, without mutual affection, who were suddenly gathered together, as if any other race of mortals suddenly gathered in one crowd, with a great number of men instead of a colony.” “*non enim, ut olim, universae legiones deducebantur cum tribunis etcenturionibus et sui cuiusque ordinis militibus ut consensu et caritate rem publicam efficerent, sed ignoti inter se, diversis manipulis, sine rectore, sine adfectibus mutuis, quasi ex alio genere mortalium repente in unum collecti, numerus magis quam colonia.*” \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;By the time of the late Empire, when the Goths were a large problem and the capital was moved to Ravenna, the Marian Reforms were a thing of the very distant past. While they certainly had some effect - the event was a step on Rome&amp;#39;s path to having a professional army - they were farther removed from the Late Romans than the Revolutionary War is from modern America, for some perspective. If you want to go back a ways, the earliest you could probably reach with any relevance would be Augustus&amp;#39; recruiting problems in the early first century AD, when Italians openly rioted at the prospect of a draft.&lt;sup&gt;1&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;The general attitude of the Italian Romans changed after their century of civil war when it came to actually being involved in a war. Augustus was a pretty smart dude, though, and tried to work around this rising issue. Veteran colonies were set up - he settled over 300,000 men in ten years,&lt;sup&gt;2&lt;/sup&gt; talk about logistics - across the provinces, though only a small fraction of those were in Italy. These colonies were as militarized as you can get: they followed the same format as their old military life&lt;sup&gt;3,&lt;/sup&gt; with their officers becoming the civilian leaders of the city. This format gave a huge amount of relief to the Italian peninsula, but it also unfortunately removed its military tradition, which was spread through the provinces - specifically the borders, which is where these veteran colonies were often founded. Veteran colonies stopped being founded sometime in the second century AD (as per that quote from Tacitus, they just used the existing colonies) due to the sheer expense and lack of new land.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a bit of a digression, but the Early Empire and Late Republic were &lt;em&gt;very&lt;/em&gt; different creatures from the Late Empire - which had a thousand and one different reasons to have a low supply of manpower. Claiming that the civil wars (from centuries prior) were the cause could maaaaybe be used as an argument, but probably not an especially good one. &lt;/p&gt;\n\n&lt;p&gt;(translations below are my own)&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Goldsworthy, &lt;em&gt;Augustus&lt;/em&gt;, 436-439,455; for the disconnect of these actions from previous eras, see Polybius 6.26.4 (written in the 2nd c. BC): “All men who were registered arrive without fail, since of those mustered there was no excuse which could be created, except for an augury or disabilities.” “&lt;em&gt;παραγίνονται δὲ πάντες ἀδιαπτώτως οἱ καταγραφέντες, ὡς ἂν μηδεμιᾶς ἄλλης συγχωρουμένης προφάσεως τοῖς ἐξορκισθεῖσι πλὴν ὀρνιθείας καὶ τῶν ἀδυνάτων&lt;/em&gt;.” &lt;/p&gt;\n\n&lt;p&gt;Also Cicero&amp;#39;s (first century BC) dripping scorn when he touches on those who do not register for the census (draft dodgers): &lt;em&gt;Pro Caecina&lt;/em&gt;, 99: “When it [the state] sells an unregistered man, it judges in this way: while a man, who was in just slavery, is freed from the census, the man who, although being free, is unwilling to be registered [on the census], deprived himself of his own liberty.” “&lt;em&gt;cum autem incensum vendit, hoc iudicat, cum ei qui in servitute iusta fuerunt censu liberentur, eum qui, cum liber esset, censeri noluerit, ipsum sibi libertatem abiudicavisse.&lt;/em&gt;” &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;Res Gestae Divi Augusti&lt;/em&gt; (early first century AD), 3.3. “Those Roman citizens who were bound by an oath to me were around 500,000. Of these I drew down into colonies or removed into their own towns when they had finished their term of service, rather more than 300,000 men, and to all I designated lands or gave money as a reward for military service.” “&lt;em&gt;Milia civium Romanorum adacta sacramento meo fuerunt circiter quingenta. Ex quibus deduxi in colonias aut remisi in municipia sua stipendis emeritis millia aliquanto plura quam trecenta et iis omnibus agros adsignavi aut pecuniam pro praemis militiae dedi.&lt;/em&gt;”&lt;/p&gt;\n\n&lt;p&gt;These colonies usually averaged about 3,000 men, not including women and children - for example this one (Strabo, &lt;em&gt;Geography&lt;/em&gt;,  4.6.7): “[Augustus] Caesar sent 3000 Romans who settled the city Augusta, on the place where Varro camped, and now the whole surrounding country is at peace, as far as beyond the peaks of the mountain range.”  “&lt;em&gt;τρισχιλίους δὲ Ῥωμαίων πέμψας ᾤκισε τὴν πόλιν Αὐγοῦσταν ὁ Καῖσαρ, ἐν ᾧ ἐστρατοπέδευσε χωρίῳ ὁ Ὀυάρρων, καὶ νῦν εἰρήνην ἄγει πᾶσα ἡπλησιόχωρος μέχρι τῶν ἄκρων ὑπερβολῶν τοῦ ὄρους.&lt;/em&gt;” &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Tacitus, while bitching about the current state of resettlement, says in, &lt;em&gt;Annals&lt;/em&gt;, 14.27: “For whole legions were not led off, as in old times (He means the time of Augustus here), with their own tribunes and centurions and with soldiers in each rank so that with consensus and esteem they would make a state, but they were strangers among themselves, with different maniples, without a leader, without mutual affection, who were suddenly gathered together, as if any other race of mortals suddenly gathered in one crowd, with a great number of men instead of a colony.” “&lt;em&gt;non enim, ut olim, universae legiones deducebantur cum tribunis etcenturionibus et sui cuiusque ordinis militibus ut consensu et caritate rem publicam efficerent, sed ignoti inter se, diversis manipulis, sine rectore, sine adfectibus mutuis, quasi ex alio genere mortalium repente in unum collecti, numerus magis quam colonia.&lt;/em&gt;” &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgb5hfr", "score_hidden": false, "stickied": false, "created": 1492317997.0, "created_utc": 1492289197.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3mug", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "eyob83", "parent_id": "t3_65iv8v", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "I wonder what effect the Marian Reforms had on this subject matter. But I'm guessing the outstretched empire needed more logistical manpower, than fighting men. Logistics never gets enough credit. Basically, there were not enough fighting age men available and willing to be conscripted.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wonder what effect the Marian Reforms had on this subject matter. But I&amp;#39;m guessing the outstretched empire needed more logistical manpower, than fighting men. Logistics never gets enough credit. Basically, there were not enough fighting age men available and willing to be conscripted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgb3mug", "score_hidden": false, "stickied": false, "created": 1492315476.0, "created_utc": 1492286676.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65iv8v", "likes": null, "replies": "", "user_reports": [], "id": "dgbglon", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "manfrin", "parent_id": "t3_65iv8v", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Two piggyback questions: \n\n1. It seems that the armies fielded during the Social/Punic/End of the Republic wars were of much larger size than nearly all armies until the late middle ages. Why is this? Was it that there just weren't players as large as Rome fighting? \n2. In the 500s and the 900s, Western Europe was swarmed by tribes, raiders, invaders, and migrations of people from the North East -- I would think that the warmer West and South would be home to many more people (longer harvest periods, easier living), but the sense I get is that the numbers were on the side of the Germanic tribes/Scandinavian raiders? Is this wrong/am I conflating numbers with 'hardness' of the soldiers?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Two piggyback questions: &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;It seems that the armies fielded during the Social/Punic/End of the Republic wars were of much larger size than nearly all armies until the late middle ages. Why is this? Was it that there just weren&amp;#39;t players as large as Rome fighting? &lt;/li&gt;\n&lt;li&gt;In the 500s and the 900s, Western Europe was swarmed by tribes, raiders, invaders, and migrations of people from the North East -- I would think that the warmer West and South would be home to many more people (longer harvest periods, easier living), but the sense I get is that the numbers were on the side of the Germanic tribes/Scandinavian raiders? Is this wrong/am I conflating numbers with &amp;#39;hardness&amp;#39; of the soldiers?&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgbglon", "score_hidden": false, "stickied": false, "created": 1492333730.0, "created_utc": 1492304930.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65iv8v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65iv8v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65iv8v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65iv8v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65iv8v", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65iv8v", "likes": null, "replies": "", "user_reports": [], "id": "dgc7bmx", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Iphikrates", "parent_id": "t1_dgc6yb9", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "It is relevant because you wrote that \"in the ancient world you were supposed to field armies, have a battle, and the losing side sues for peace\". This clearly isn't true, as the examples I cited in the other post show. You're right that those examples are extreme cases of communities fighting to the last, mostly because that was the specific subject of the question. But it would be even easier to list less desperate occasions in Greek history where the outcome of a single battle utterly failed to determine the outcome of the war. Goldsworthy is simply wrong on this point.\n\nAlso, contrary to what you're saying, there is not a single ancient writer who remarks upon what a \"huge break from traditional warfare\" the Peloponnesian War is supposed to have been. That notion is found exclusively in modern scholarship. Yes, Thucydides brags at the start of his history that the Peloponnesian War was the longest and biggest and most terrible war ever fought - because he was competing with Herodotos to justify his work. But his point is only a matter of scale. He doesn't actually say that either the methods or the violent excesses of the war were new (because he clearly had no grounds to do so).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is relevant because you wrote that &amp;quot;in the ancient world you were supposed to field armies, have a battle, and the losing side sues for peace&amp;quot;. This clearly isn&amp;#39;t true, as the examples I cited in the other post show. You&amp;#39;re right that those examples are extreme cases of communities fighting to the last, mostly because that was the specific subject of the question. But it would be even easier to list less desperate occasions in Greek history where the outcome of a single battle utterly failed to determine the outcome of the war. Goldsworthy is simply wrong on this point.&lt;/p&gt;\n\n&lt;p&gt;Also, contrary to what you&amp;#39;re saying, there is not a single ancient writer who remarks upon what a &amp;quot;huge break from traditional warfare&amp;quot; the Peloponnesian War is supposed to have been. That notion is found exclusively in modern scholarship. Yes, Thucydides brags at the start of his history that the Peloponnesian War was the longest and biggest and most terrible war ever fought - because he was competing with Herodotos to justify his work. But his point is only a matter of scale. He doesn&amp;#39;t actually say that either the methods or the violent excesses of the war were new (because he clearly had no grounds to do so).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgc7bmx", "score_hidden": false, "stickied": false, "created": 1492387935.0, "created_utc": 1492359135.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65iv8v", "likes": null, "replies": "", "user_reports": [], "id": "dgcgssf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MI13", "parent_id": "t1_dgc6yb9", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "The classics are not unique for having disagreements and the existence of disagreement in and of itself does not mean we can't come to conclusions or make real arguments about history. We absolutely can look at the motivations of ancient cultures and at what actions they took based on these motives. That's what doing history is. If you're here, on this sub, discussing history, then you should be prepared to back up your arguments and not resort to hemming and hawing about what, like, does knowledge even mean, maaaaaaan. \n\nOriginally you made this statement: \n\n&gt; In the ancient world you were supposed to field armies, have a battle, and the losing side sues for peace. \n\nYour argument was that the Romans were unique in defying this \"rule\" that never actually existed. Now you're saying that in some conflicts, some societies fought to annihilate their opponents. Do you not see this as a contradiction in your own argument? If they're fighting to annihilate their opponents, they are obviously not adhering to a nonsensical rule about fighting a single battle and then surrendering. How many wars and battles do you need to contradict this \"rule\" before you will agree that it did not exist whatsoever?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The classics are not unique for having disagreements and the existence of disagreement in and of itself does not mean we can&amp;#39;t come to conclusions or make real arguments about history. We absolutely can look at the motivations of ancient cultures and at what actions they took based on these motives. That&amp;#39;s what doing history is. If you&amp;#39;re here, on this sub, discussing history, then you should be prepared to back up your arguments and not resort to hemming and hawing about what, like, does knowledge even mean, maaaaaaan. &lt;/p&gt;\n\n&lt;p&gt;Originally you made this statement: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In the ancient world you were supposed to field armies, have a battle, and the losing side sues for peace. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Your argument was that the Romans were unique in defying this &amp;quot;rule&amp;quot; that never actually existed. Now you&amp;#39;re saying that in some conflicts, some societies fought to annihilate their opponents. Do you not see this as a contradiction in your own argument? If they&amp;#39;re fighting to annihilate their opponents, they are obviously not adhering to a nonsensical rule about fighting a single battle and then surrendering. How many wars and battles do you need to contradict this &amp;quot;rule&amp;quot; before you will agree that it did not exist whatsoever?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgcgssf", "score_hidden": false, "stickied": false, "created": 1492400464.0, "created_utc": 1492371664.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6yb9", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "pauldentonscloset", "parent_id": "t1_dgc4lea", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "I have not read every post on the internet so I hadn't seen that before. As I said, there's disagreement on nearly everything in classics. It's an interesting post, not sure I buy it as a relevant comparison (being willing to fight to the last man when you are facing utter annihilation isn't unusual) but teasing out the motivations of ancient cultures is always conjecture. It's getting pretty far off the question of manpower availability though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have not read every post on the internet so I hadn&amp;#39;t seen that before. As I said, there&amp;#39;s disagreement on nearly everything in classics. It&amp;#39;s an interesting post, not sure I buy it as a relevant comparison (being willing to fight to the last man when you are facing utter annihilation isn&amp;#39;t unusual) but teasing out the motivations of ancient cultures is always conjecture. It&amp;#39;s getting pretty far off the question of manpower availability though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgc6yb9", "score_hidden": false, "stickied": false, "created": 1492387437.0, "created_utc": 1492358637.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4lea", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "MI13", "parent_id": "t1_dgc33wi", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "But the Persians did actually keep raising armies after major defeats. Darius suffered an enormous loss at Issus, yet was still able to assemble more armies and continue fighting for years. Neither did the Greeks always just surrender after a single losing battle. Our very own /u/iphikrates has [written at length](https://www.reddit.com/r/AskHistorians/comments/5la8jr/adrian_goldsworthy_says_that_during_the_punic/dbuqjun/) about how this view of Greek warfare is outdated and does not line up with the source evidence. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But the Persians did actually keep raising armies after major defeats. Darius suffered an enormous loss at Issus, yet was still able to assemble more armies and continue fighting for years. Neither did the Greeks always just surrender after a single losing battle. Our very own &lt;a href=\"/u/iphikrates\"&gt;/u/iphikrates&lt;/a&gt; has &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/5la8jr/adrian_goldsworthy_says_that_during_the_punic/dbuqjun/\"&gt;written at length&lt;/a&gt; about how this view of Greek warfare is outdated and does not line up with the source evidence. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgc4lea", "score_hidden": false, "stickied": false, "created": 1492384184.0, "created_utc": 1492355384.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc33wi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pauldentonscloset", "parent_id": "t1_dgc0mg1", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "It's a common opinion in the field when you study Rome (I am sure there are scholars who disagree), but Adrian Goldsworthy's book Roman Warfare is the most recent one I read that I recall mentioning it. I gave it to a friend so don't have it here to cite directly.\n\nThe Peolponnesian War was not a single conflict but numerous, ending in peace treaties then beginning again. The ancient writers also remark how it was a huge break from traditional Greek warfare and involved the sorts of battles of annihilation that Greeks had never done with each other before.\n\nAlexander is a good example, since once the Persians were decisively defeated they gave up. Had they continued raising armies to resist Alexander, it'd fit. Contrast with later when the Parthians and later Sassanids rise with a similar mindset as the Romans--they just keep coming, and while Rome is able to defeat them in the field sometimes and roll through burning cities, they never really capitulate and always come back. Rome can't defeat them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a common opinion in the field when you study Rome (I am sure there are scholars who disagree), but Adrian Goldsworthy&amp;#39;s book Roman Warfare is the most recent one I read that I recall mentioning it. I gave it to a friend so don&amp;#39;t have it here to cite directly.&lt;/p&gt;\n\n&lt;p&gt;The Peolponnesian War was not a single conflict but numerous, ending in peace treaties then beginning again. The ancient writers also remark how it was a huge break from traditional Greek warfare and involved the sorts of battles of annihilation that Greeks had never done with each other before.&lt;/p&gt;\n\n&lt;p&gt;Alexander is a good example, since once the Persians were decisively defeated they gave up. Had they continued raising armies to resist Alexander, it&amp;#39;d fit. Contrast with later when the Parthians and later Sassanids rise with a similar mindset as the Romans--they just keep coming, and while Rome is able to defeat them in the field sometimes and roll through burning cities, they never really capitulate and always come back. Rome can&amp;#39;t defeat them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgc33wi", "score_hidden": false, "stickied": false, "created": 1492381931.0, "created_utc": 1492353131.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc0mg1", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "MI13", "parent_id": "t1_dgbvruk", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "&gt; One other factor in the Punic Wars, the second particularly, is just that Rome didn't follow the rules. In the ancient world you were supposed to field armies, have a battle, and the losing side sues for peace. \n\nWhat evidence are you using to say that this was an established \"rule\" of warfare in this period? I am not a classical specialist myself, but just off the top of my head, Alexander's conquest of the Persian Empire took years and the Peloponnesian War was a famously grinding, protracted conflict. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;One other factor in the Punic Wars, the second particularly, is just that Rome didn&amp;#39;t follow the rules. In the ancient world you were supposed to field armies, have a battle, and the losing side sues for peace. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What evidence are you using to say that this was an established &amp;quot;rule&amp;quot; of warfare in this period? I am not a classical specialist myself, but just off the top of my head, Alexander&amp;#39;s conquest of the Persian Empire took years and the Peloponnesian War was a famously grinding, protracted conflict. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgc0mg1", "score_hidden": false, "stickied": false, "created": 1492377620.0, "created_utc": 1492348820.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65iv8v", "likes": null, "replies": "", "user_reports": [], "id": "dgc7gap", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Iphikrates", "parent_id": "t1_dgbvruk", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "&gt; it's not a huge force.\n\nIs this true? From what I heard, the late Empire had a standing army of something like 600,000 men. This is a vastly greater army than the c.100,000 militia that were more or less constantly under arms during the Middle Republic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;it&amp;#39;s not a huge force.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Is this true? From what I heard, the late Empire had a standing army of something like 600,000 men. This is a vastly greater army than the c.100,000 militia that were more or less constantly under arms during the Middle Republic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgc7gap", "score_hidden": false, "stickied": false, "created": 1492388108.0, "created_utc": 1492359308.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbvruk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pauldentonscloset", "parent_id": "t3_65iv8v", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "One major factor is being a soldier just became a shitty job.\n\nIn earlier eras, Roman citizenship was quite limited. You had to be a native born Roman, in Rome itself, and no one else in the empire had the same privileges as the citizenry. This limited your options. The military became an attractive job option for many people because of the benefits. I'm going to be general because this is a long period of time and things change, but let's say you decide to join up in like, 50 AD. You serve for 25 years and get the following:\n\nA) Steady pay. Not to be underestimated.\nB) A secure food supply.\nC) The best medical care in the ancient world.\nD) Possibility of advancement to positions of authority and responsibility.\nE) Upon discharge, you get citizenship (as do your children that you're not supposed to have but, let's be realistic), and are supposed to get a lifetime pension and land. This doesn't always happen.\n\nIf you're some random dirt farmer, it's not a bad deal.\n\nAs time progresses, the benefits dry up. Citizenship is first expanded to everyone in Italy, then in the 200s AD it is to the entire empire. The pensions and land grants dry up because there's not much land (usually, veterans were settled on the frontiers but once the empire stops expanding, there aren't new frontiers to settle), so as jobs go being a soldier starts to suck. Fewer and fewer people join the military. The Romans don't appear to have had any sort of conscription until late antiquity, when many jobs become hereditary--including being in the legions.\nSo you have these people who are forced to join the military because their fathers were soldiers, but it's not a huge force. Recruiting beyond that is nearly impossible. However, there are all these Germans who really want to be part of the empire and are happy to fight in exchange for benefits, so a ton of recruiting is done among the Germanic tribes.\n\nOne other factor in the Punic Wars, the second particularly, is just that Rome didn't follow the rules. In the ancient world you were supposed to field armies, have a battle, and the losing side sues for peace. The Romans never, ever stop fighting or agree to unfavorable peace terms after the Gallic sack of Rome in 410 BC. Hannibal can trash Roman armies over and over, but they just won't give up and make peace like they're supposed to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One major factor is being a soldier just became a shitty job.&lt;/p&gt;\n\n&lt;p&gt;In earlier eras, Roman citizenship was quite limited. You had to be a native born Roman, in Rome itself, and no one else in the empire had the same privileges as the citizenry. This limited your options. The military became an attractive job option for many people because of the benefits. I&amp;#39;m going to be general because this is a long period of time and things change, but let&amp;#39;s say you decide to join up in like, 50 AD. You serve for 25 years and get the following:&lt;/p&gt;\n\n&lt;p&gt;A) Steady pay. Not to be underestimated.\nB) A secure food supply.\nC) The best medical care in the ancient world.\nD) Possibility of advancement to positions of authority and responsibility.\nE) Upon discharge, you get citizenship (as do your children that you&amp;#39;re not supposed to have but, let&amp;#39;s be realistic), and are supposed to get a lifetime pension and land. This doesn&amp;#39;t always happen.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re some random dirt farmer, it&amp;#39;s not a bad deal.&lt;/p&gt;\n\n&lt;p&gt;As time progresses, the benefits dry up. Citizenship is first expanded to everyone in Italy, then in the 200s AD it is to the entire empire. The pensions and land grants dry up because there&amp;#39;s not much land (usually, veterans were settled on the frontiers but once the empire stops expanding, there aren&amp;#39;t new frontiers to settle), so as jobs go being a soldier starts to suck. Fewer and fewer people join the military. The Romans don&amp;#39;t appear to have had any sort of conscription until late antiquity, when many jobs become hereditary--including being in the legions.\nSo you have these people who are forced to join the military because their fathers were soldiers, but it&amp;#39;s not a huge force. Recruiting beyond that is nearly impossible. However, there are all these Germans who really want to be part of the empire and are happy to fight in exchange for benefits, so a ton of recruiting is done among the Germanic tribes.&lt;/p&gt;\n\n&lt;p&gt;One other factor in the Punic Wars, the second particularly, is just that Rome didn&amp;#39;t follow the rules. In the ancient world you were supposed to field armies, have a battle, and the losing side sues for peace. The Romans never, ever stop fighting or agree to unfavorable peace terms after the Gallic sack of Rome in 410 BC. Hannibal can trash Roman armies over and over, but they just won&amp;#39;t give up and make peace like they&amp;#39;re supposed to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgbvruk", "score_hidden": false, "stickied": false, "created": 1492363854.0, "created_utc": 1492335054.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]