[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve noticed a large number of civil wars throughout history, especially modern history, have lasted a very long time. Afghanistan has been in a state of civil conflict for nearly 40 years. Sudan has had two civil wars that lasted for more than 20 years. The Algerian Civil war lasted for 11 years.&lt;/p&gt;\n\n&lt;p&gt;The American Civil war lasted for 4 years which is a much shorter time span than 10 or 20 years. So how did the war end so quickly?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've noticed a large number of civil wars throughout history, especially modern history, have lasted a very long time. Afghanistan has been in a state of civil conflict for nearly 40 years. Sudan has had two civil wars that lasted for more than 20 years. The Algerian Civil war lasted for 11 years.\n\nThe American Civil war lasted for 4 years which is a much shorter time span than 10 or 20 years. So how did the war end so quickly?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65kmgz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 56, "report_reasons": null, "author": "roep87", "saved": false, "mod_reports": [], "name": "t3_65kmgz", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/65kmgz/why_did_the_american_civil_war_last_a_short_time/", "num_reports": null, "locked": false, "stickied": false, "created": 1492309899.0, "url": "https://www.reddit.com/r/AskHistorians/comments/65kmgz/why_did_the_american_civil_war_last_a_short_time/", "author_flair_text": null, "quarantine": false, "title": "Why did the American Civil War last a short time compared to other civil wars around the world?", "created_utc": 1492281099.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 56}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65kmgz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65kmgz", "likes": null, "replies": "", "user_reports": [], "id": "dgb7kke", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Georgy_K_Zhukov", "parent_id": "t1_dgb3ijn", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Sharing old answers is great! But if they aren't your own, we ask that you simply share a link to them instead of copy-pasting the whole thing (especially without a link!). Thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sharing old answers is great! But if they aren&amp;#39;t your own, we ask that you simply share a link to them instead of copy-pasting the whole thing (especially without a link!). Thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgb7kke", "score_hidden": false, "stickied": false, "created": 1492320889.0, "created_utc": 1492292089.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3ijn", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65kmgz", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgb3ijn", "score_hidden": false, "stickied": false, "created": 1492315305.0, "created_utc": 1492286505.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65kmgz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65kmgz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65kmgz", "likes": null, "replies": "", "user_reports": [], "id": "dgche28", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Bernardito", "parent_id": "t1_dgcdlro", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Now, the guerilla war phase of the Irish Civil War mimics what is common in other conflicts I've already discussed: a period of conventional warfare followed by guerilla warfare. The guerilla war phase comes after conventional operations not only in Dublin and Killmallock, but also Cork, Limerick, Waterford amongst other. It only goes to show you that the context is incredibly important. The Irish example, coming right after the Irish War for Independence, is contextually unique in as much as the guerrilla warfare in the Trans-Mississippi theatre during the American Civil War was contextually unique.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Now, the guerilla war phase of the Irish Civil War mimics what is common in other conflicts I&amp;#39;ve already discussed: a period of conventional warfare followed by guerilla warfare. The guerilla war phase comes after conventional operations not only in Dublin and Killmallock, but also Cork, Limerick, Waterford amongst other. It only goes to show you that the context is incredibly important. The Irish example, coming right after the Irish War for Independence, is contextually unique in as much as the guerrilla warfare in the Trans-Mississippi theatre during the American Civil War was contextually unique.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgche28", "score_hidden": false, "stickied": false, "created": 1492401235.0, "created_utc": 1492372435.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdlro", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "fusionsc2", "parent_id": "t1_dgcbfab", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Irish civil war was really guerrilla warfare, except for the battle of Dublin and killmallock.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Irish civil war was really guerrilla warfare, except for the battle of Dublin and killmallock.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgcdlro", "score_hidden": false, "stickied": false, "created": 1492396212.0, "created_utc": 1492367412.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbfab", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Bernardito", "parent_id": "t3_65kmgz", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "It's difficult to generalize the average length of a civil war. Even from the period of the mid 1850s until 1997, there is a tremendous variety in lengths of civil wars so I would caution against drawing any generalizations without looking into each conflict in-depth. A second issue with your premise is the fact that the wars you mention take place more than a 100 years after the American Civil War and are quite different conflicts in nature than the American Civil War. Even for late 19th century conflicts, the length of the American Civil War is a big contrast for example to the Chilean Civil War of 1891 that lasted less than a year. Other civil wars in the 20th century, like the famous Spanish Civil War (1936-1939) or the Irish Civil War (1922-1923) were all short as well.\n\nBut why? What do these shorter conflicts have in common that separates them from the longer conflicts you've mentioned?\n\nThe American Civil War was a predominately conventional conflict in which conventional armies faced against each other in direct, conventional battles. The same thing applies to the Spanish Civil War or the Irish Civil War or the Chilean Civil War that were predominately conventional conflicts in which one army defeats another army in one or several decisive battles. This is in stark contrast to the three examples you've mentioned above in which the conflict has a predominantly asymmetrical nature, often involving long periods of low-intensity warfare and insurgency. Conflicts dealing predominately with insurgencies or counterinsurgencies are commonly quite long due to the nature of the warfare and the natural tendencies of insurgents to avoid open and conventional battle. Some of these conflicts might have begun as or ended as a conventional conflict (The 1979 Soviet intervention in Afghanistan and the 1992-1996 Afghan Civil War were conventional in nature), but the majority of the conflict has an asymmetrical nature (the period between 1980 and 1989 as well as the post-1996 period in Afghanistan were all asymmetrical).\n\nEven in these cases, it's hard to generalize and I would once again caution against it. Some conventional conflicts last a long time and some insurgencies are short. The Cuban Revolution lasted 3 years while Iran-Iraq War lasted 8 years. Each conflict has its own particular context, factors and not to mention history which we need to have in mind as to why one conflict lasted longer than the other. Even a claim such as foreign involvement and proxy having an effect on the length of a civil war varies from country to country: the Spanish Civil War lasted 3 years while the Angolan Civil War lasted 27 years, both conflicts had foreign armies fighting for one side or another. \n\nTo summarize it: Military conflicts can not be generalized and when you study them or try and compare it with other conflicts, keep this in mind. The large amount of unique and individual factors that all comes together in a particular historical context even makes conflicts that theoretically looks similar to be quite different. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s difficult to generalize the average length of a civil war. Even from the period of the mid 1850s until 1997, there is a tremendous variety in lengths of civil wars so I would caution against drawing any generalizations without looking into each conflict in-depth. A second issue with your premise is the fact that the wars you mention take place more than a 100 years after the American Civil War and are quite different conflicts in nature than the American Civil War. Even for late 19th century conflicts, the length of the American Civil War is a big contrast for example to the Chilean Civil War of 1891 that lasted less than a year. Other civil wars in the 20th century, like the famous Spanish Civil War (1936-1939) or the Irish Civil War (1922-1923) were all short as well.&lt;/p&gt;\n\n&lt;p&gt;But why? What do these shorter conflicts have in common that separates them from the longer conflicts you&amp;#39;ve mentioned?&lt;/p&gt;\n\n&lt;p&gt;The American Civil War was a predominately conventional conflict in which conventional armies faced against each other in direct, conventional battles. The same thing applies to the Spanish Civil War or the Irish Civil War or the Chilean Civil War that were predominately conventional conflicts in which one army defeats another army in one or several decisive battles. This is in stark contrast to the three examples you&amp;#39;ve mentioned above in which the conflict has a predominantly asymmetrical nature, often involving long periods of low-intensity warfare and insurgency. Conflicts dealing predominately with insurgencies or counterinsurgencies are commonly quite long due to the nature of the warfare and the natural tendencies of insurgents to avoid open and conventional battle. Some of these conflicts might have begun as or ended as a conventional conflict (The 1979 Soviet intervention in Afghanistan and the 1992-1996 Afghan Civil War were conventional in nature), but the majority of the conflict has an asymmetrical nature (the period between 1980 and 1989 as well as the post-1996 period in Afghanistan were all asymmetrical).&lt;/p&gt;\n\n&lt;p&gt;Even in these cases, it&amp;#39;s hard to generalize and I would once again caution against it. Some conventional conflicts last a long time and some insurgencies are short. The Cuban Revolution lasted 3 years while Iran-Iraq War lasted 8 years. Each conflict has its own particular context, factors and not to mention history which we need to have in mind as to why one conflict lasted longer than the other. Even a claim such as foreign involvement and proxy having an effect on the length of a civil war varies from country to country: the Spanish Civil War lasted 3 years while the Angolan Civil War lasted 27 years, both conflicts had foreign armies fighting for one side or another. &lt;/p&gt;\n\n&lt;p&gt;To summarize it: Military conflicts can not be generalized and when you study them or try and compare it with other conflicts, keep this in mind. The large amount of unique and individual factors that all comes together in a particular historical context even makes conflicts that theoretically looks similar to be quite different. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgcbfab", "score_hidden": false, "stickied": false, "created": 1492393320.0, "created_utc": 1492364520.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65kmgz", "likes": null, "replies": "", "user_reports": [], "id": "dgcxoe3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dandan_noodles", "parent_id": "t3_65kmgz", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "In addition to u/Bernardito's great answer, I'd just like to point out that in one of the most common patterns of civil wars, a nation-wide but relatively unorganized group has to gradually build itself up through propaganda, blackmail, assassination, and so on until it's carved out the necessary resources to make itself a state that can carry out guerrilla, and eventually conventional warfare.  These early stages usually take a lot of time, as resources are so short and risks are so hazardous.  \n\nThe Confederacy essentially skipped the first stages of People's War, because the people who led the war were already in de facto control of most of the territory they claimed, and simply took the step of asserting their de jure sovereignty.  Most revolutionary movements spend years just getting to that point, so they began in a really enviable position.  Considering the immense disparity of resources, the more immediate question, when considering the ACW in the context of 19th century wars of nations, is why indeed it lasted as long as it did.  Why did the Union Army not crush the rebellion and march into its capital in one fell swoop?  \n\nOne might have expected the South to continue resisting after its main field armies were defeated, as civil wars often end not with a bang, but with a whimper.  However, the Union leadership was very careful to present no dissonance between honor and defeat; accepting the latter did not mean relinquishing the former, and given the great weight the South attached to the concept of honor, this was crucial in ending the South's war for independence without devolving into a brutal partisan war.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In addition to &lt;a href=\"/u/Bernardito\"&gt;u/Bernardito&lt;/a&gt;&amp;#39;s great answer, I&amp;#39;d just like to point out that in one of the most common patterns of civil wars, a nation-wide but relatively unorganized group has to gradually build itself up through propaganda, blackmail, assassination, and so on until it&amp;#39;s carved out the necessary resources to make itself a state that can carry out guerrilla, and eventually conventional warfare.  These early stages usually take a lot of time, as resources are so short and risks are so hazardous.  &lt;/p&gt;\n\n&lt;p&gt;The Confederacy essentially skipped the first stages of People&amp;#39;s War, because the people who led the war were already in de facto control of most of the territory they claimed, and simply took the step of asserting their de jure sovereignty.  Most revolutionary movements spend years just getting to that point, so they began in a really enviable position.  Considering the immense disparity of resources, the more immediate question, when considering the ACW in the context of 19th century wars of nations, is why indeed it lasted as long as it did.  Why did the Union Army not crush the rebellion and march into its capital in one fell swoop?  &lt;/p&gt;\n\n&lt;p&gt;One might have expected the South to continue resisting after its main field armies were defeated, as civil wars often end not with a bang, but with a whimper.  However, the Union leadership was very careful to present no dissonance between honor and defeat; accepting the latter did not mean relinquishing the former, and given the great weight the South attached to the concept of honor, this was crucial in ending the South&amp;#39;s war for independence without devolving into a brutal partisan war.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgcxoe3", "score_hidden": false, "stickied": false, "created": 1492422916.0, "created_utc": 1492394116.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65kmgz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65kmgz", "likes": null, "replies": "", "user_reports": [], "id": "dgc2n5n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Georgy_K_Zhukov", "parent_id": "t1_dgbz94a", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "We ask that answers in this subreddit be [in-depth and comprehensive](https://www.reddit.com/r/AskHistorians/comments/1jsabs/what_it_means_to_post_a_good_answer_in/), and highly suggest that comments include citations for the information. In the future, please take the time to better familiarize yourself with [the rules](http://www.reddit.com/r/AskHistorians/wiki/rules#wiki_write_an_in-depth_answer) and our [Rules Roundtable](https://www.reddit.com/r/AskHistorians/comments/4kngwh/rules_roundtable_no_11_no_speculation/) on Speculation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We ask that answers in this subreddit be &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/1jsabs/what_it_means_to_post_a_good_answer_in/\"&gt;in-depth and comprehensive&lt;/a&gt;, and highly suggest that comments include citations for the information. In the future, please take the time to better familiarize yourself with &lt;a href=\"http://www.reddit.com/r/AskHistorians/wiki/rules#wiki_write_an_in-depth_answer\"&gt;the rules&lt;/a&gt; and our &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/4kngwh/rules_roundtable_no_11_no_speculation/\"&gt;Rules Roundtable&lt;/a&gt; on Speculation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgc2n5n", "score_hidden": false, "stickied": false, "created": 1492381212.0, "created_utc": 1492352412.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65kmgz", "likes": null, "replies": "", "user_reports": [], "id": "dgc1f9h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgbz94a", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[removed]", "edited": 1492350992.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgc1f9h", "score_hidden": false, "stickied": false, "created": 1492379136.0, "created_utc": 1492350336.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbz94a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65kmgz", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgbz94a", "score_hidden": false, "stickied": false, "created": 1492374650.0, "created_utc": 1492345850.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]