[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a question about Post WW2 Japanese hold outs. Specifically, Japanese holdouts in China.&lt;/p&gt;\n\n&lt;p&gt;I have seen this quoted many times in sites that cover this topic:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;An estimated 10-20,000 well equipped Japanese troops were trapped in the mountains of Manchuria and did not surrender until late in 1948. They were caught in a no man&amp;#39;s land of civil war stuck between the warring Nationalist and Communist forces and were unable to surrender.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I have also seen this presented on many history forums, but the general consensus is that &amp;quot;this could hot have happened&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Operation Beleaguer&amp;quot;, all but forgotten in the annals of US military history, was an effort by US Marines to occupy coastal areas in northeast China to help repatriate Japanese soldiers still in China after the war. After a while, these operations were disrupted by clashes between Chinese Communist forces and the Marines.&lt;/p&gt;\n\n&lt;p&gt;If the quoted statement about 10-20,000 well equipped Japanese troops were trapped in the mountains of Manchuria is true, then I guess the Marines did not manage to get them all. This is a fairly sizable force, and who ever maintained command over this pocket must have had to enforce strict field sanitation and food rationing for his encircled command. The fact that the Russian invading forces did not destroy this pocket in 1945 suggests that this pocket was well fortified in a city or in tough mountainous terrain. Also, it is my understanding that it can get brutally cold in Manchuria during the winter, so they had to protect themselves from the elements for atleast three years. How did they find shelter? Did they build bunkers and seek shelter in these fortifications? Perhaps these Japanese holdouts made an arrangement with the local village populations, who were probably sick of war, and offered to protect them from both the Chinese Communist and Nationalist warring factions, in exchange for allowing them shelter and providing them food?&lt;/p&gt;\n\n&lt;p&gt;However, I did not find any independent book or newspaper sources that could confirm this claim, until I came across this webpage:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.newspapers.com/newspage/54088905/\"&gt;https://www.newspapers.com/newspage/54088905/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This is a newspaper archive site, that you must pay for, that seems to have an article discussing Japanese holdouts in China, and Japanese efforts to bring them back. You can not see the microfiche image, but there is a crude text translation provided.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;In Manchuria Japanese troops are known to be maintaining themselves there. Chinese intelligence reports have variously estimated the total number up to 90,000. About 225,000 troops of the former Japanese [batison] in Manchuria, according to official American estimates, were never repatriated and remain unaccounted for. Others are said serving with the Chinese Communists. Some are believed operating independently and particularly in two large pockets, in Northwestern Manchuria and in Klrln Province near the Korean border. Okamura is said to be employed in an attempt to effect the &amp;quot;neutralization&amp;quot; of the Japanese forces and prevent them from going over to the Communists.The reported pocket of Japanese troops lie within what is at least nominally regarded as Communist held territory. The Chinese Communists charge that Okamura its being retained by the National government as a...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So I guess we have a more of a clue: &amp;quot;Northwestern Manchuria&amp;quot; and &amp;quot;Kirin province near the Korean border&amp;quot;. The blurb also suggests that the number of Japanese holdouts was much bigger than what the first -and most quoted- source suggests.&lt;/p&gt;\n\n&lt;p&gt;I guess it is worth a shot; are there any advanced historians here who know more details of these Japanese holdouts in Manchuria? Were they ever &amp;quot;repatriated&amp;quot; to Japan, did they just fight both Chinese factions to the death, or surrender to one of them?&lt;/p&gt;\n\n&lt;p&gt;Probably the most authoritative source of information would come from a Japanese or Chinese military history source. Do any exist? If they do exist, I doubt they are in English...&lt;/p&gt;\n\n&lt;p&gt;Thanks for your input.&lt;/p&gt;\n\n&lt;p&gt;Brian Ghilliotti&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is a question about Post WW2 Japanese hold outs. Specifically, Japanese holdouts in China.\n\nI have seen this quoted many times in sites that cover this topic:\n\n\"An estimated 10-20,000 well equipped Japanese troops were trapped in the mountains of Manchuria and did not surrender until late in 1948. They were caught in a no man's land of civil war stuck between the warring Nationalist and Communist forces and were unable to surrender.\"\n\nI have also seen this presented on many history forums, but the general consensus is that \"this could hot have happened\".\n\n\"Operation Beleaguer\", all but forgotten in the annals of US military history, was an effort by US Marines to occupy coastal areas in northeast China to help repatriate Japanese soldiers still in China after the war. After a while, these operations were disrupted by clashes between Chinese Communist forces and the Marines.\n\nIf the quoted statement about 10-20,000 well equipped Japanese troops were trapped in the mountains of Manchuria is true, then I guess the Marines did not manage to get them all. This is a fairly sizable force, and who ever maintained command over this pocket must have had to enforce strict field sanitation and food rationing for his encircled command. The fact that the Russian invading forces did not destroy this pocket in 1945 suggests that this pocket was well fortified in a city or in tough mountainous terrain. Also, it is my understanding that it can get brutally cold in Manchuria during the winter, so they had to protect themselves from the elements for atleast three years. How did they find shelter? Did they build bunkers and seek shelter in these fortifications? Perhaps these Japanese holdouts made an arrangement with the local village populations, who were probably sick of war, and offered to protect them from both the Chinese Communist and Nationalist warring factions, in exchange for allowing them shelter and providing them food?\n\nHowever, I did not find any independent book or newspaper sources that could confirm this claim, until I came across this webpage:\n\nhttps://www.newspapers.com/newspage/54088905/\n\nThis is a newspaper archive site, that you must pay for, that seems to have an article discussing Japanese holdouts in China, and Japanese efforts to bring them back. You can not see the microfiche image, but there is a crude text translation provided.\n\n\"In Manchuria Japanese troops are known to be maintaining themselves there. Chinese intelligence reports have variously estimated the total number up to 90,000. About 225,000 troops of the former Japanese [batison] in Manchuria, according to official American estimates, were never repatriated and remain unaccounted for. Others are said serving with the Chinese Communists. Some are believed operating independently and particularly in two large pockets, in Northwestern Manchuria and in Klrln Province near the Korean border. Okamura is said to be employed in an attempt to effect the \"neutralization\" of the Japanese forces and prevent them from going over to the Communists.The reported pocket of Japanese troops lie within what is at least nominally regarded as Communist held territory. The Chinese Communists charge that Okamura its being retained by the National government as a...\"\n\nSo I guess we have a more of a clue: \"Northwestern Manchuria\" and \"Kirin province near the Korean border\". The blurb also suggests that the number of Japanese holdouts was much bigger than what the first -and most quoted- source suggests.\n\nI guess it is worth a shot; are there any advanced historians here who know more details of these Japanese holdouts in Manchuria? Were they ever \"repatriated\" to Japan, did they just fight both Chinese factions to the death, or surrender to one of them?\n\nProbably the most authoritative source of information would come from a Japanese or Chinese military history source. Do any exist? If they do exist, I doubt they are in English...\n\nThanks for your input.\n\nBrian Ghilliotti", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65on37", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 75, "report_reasons": null, "author": "Brian-Ghilliotti", "saved": false, "mod_reports": [], "name": "t3_65on37", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/65on37/questions_regarding_japanese_ww2_holdouts_in/", "num_reports": null, "locked": false, "stickied": false, "created": 1492370179.0, "url": "https://www.reddit.com/r/AskHistorians/comments/65on37/questions_regarding_japanese_ww2_holdouts_in/", "author_flair_text": null, "quarantine": false, "title": "Questions regarding Japanese WW2 holdouts in Manchuria (long)", "created_utc": 1492341379.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 75}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65on37", "likes": null, "replies": "", "user_reports": [], "id": "dgddkve", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cckerberos", "parent_id": "t3_65on37", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "&gt;I have also seen this presented on many history forums, but the general consensus is that \"this could not have happened\".\n\nIs there a reason that this seems unlikely to be the correct answer? \n\nI mean, even if you set aside all the logistical issues you raise (which I think we would agree are formidable), this is not the kind of thing that should be difficult to find references to. If I can easily find information (albeit in Japanese) on similar but smaller scale topics such as the warlord Yan Xishan's postwar recruitment of a couple thousand Japanese soldiers to fight the communists or the continued fighting by elements of the IJA 107th Division for a short time following the Japanese surrender, a division-sized force holding out for *years* would definitely get coverage. Despite this, I can't find anything in Japanese.\n\nThe most authoritative source on this would likely be the Senshi Sōsho, the 102-volume official Japanese military history of the war compiled in the 50s and 60s. I don't have ready access to it, unfortunately, and very little of it has been translated into English (the Japanese government's National Institute for Defense Studies is planning to digitize and put the volumes online as their copyrights expire, but that will take some time.)\n\nThe scenario as presented is also odd, as it's hard to imagine why the Japanese would be unable to surrender to the Nationalists in such a situation. Additionally, the areas suggested in the newspaper article (northwestern Manchuria and southeast Jilin) were both communist strongholds as they border the USSR and North Korea, respectively. AFAIK, there was no significant fighting between the Nationalists and Communists in these areas.\n\nBut as the local newspaper you provide shows, there were evidently at least some rumors about this. So where did these come from if no such Japanese force existed? \n\nThis is just speculation, but there were initially large numbers of Japanese soldiers unaccounted for in the period immediately after the war. This was not only due to the kind of chaos that would be expected in such a situation, but also because the Soviets transported more than half a million Japanese prisoners to Siberia for forced labor (and weren't always forthcoming with details about who they had). To me at least, this seems like the kind of situation that could lead to wild rumors.\n\n(Incidentally, the newspaper article is about Okamura Yasuji, a Japanese general who served as a military advisor to the Nationalist government after the war.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have also seen this presented on many history forums, but the general consensus is that &amp;quot;this could not have happened&amp;quot;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Is there a reason that this seems unlikely to be the correct answer? &lt;/p&gt;\n\n&lt;p&gt;I mean, even if you set aside all the logistical issues you raise (which I think we would agree are formidable), this is not the kind of thing that should be difficult to find references to. If I can easily find information (albeit in Japanese) on similar but smaller scale topics such as the warlord Yan Xishan&amp;#39;s postwar recruitment of a couple thousand Japanese soldiers to fight the communists or the continued fighting by elements of the IJA 107th Division for a short time following the Japanese surrender, a division-sized force holding out for &lt;em&gt;years&lt;/em&gt; would definitely get coverage. Despite this, I can&amp;#39;t find anything in Japanese.&lt;/p&gt;\n\n&lt;p&gt;The most authoritative source on this would likely be the Senshi Sōsho, the 102-volume official Japanese military history of the war compiled in the 50s and 60s. I don&amp;#39;t have ready access to it, unfortunately, and very little of it has been translated into English (the Japanese government&amp;#39;s National Institute for Defense Studies is planning to digitize and put the volumes online as their copyrights expire, but that will take some time.)&lt;/p&gt;\n\n&lt;p&gt;The scenario as presented is also odd, as it&amp;#39;s hard to imagine why the Japanese would be unable to surrender to the Nationalists in such a situation. Additionally, the areas suggested in the newspaper article (northwestern Manchuria and southeast Jilin) were both communist strongholds as they border the USSR and North Korea, respectively. AFAIK, there was no significant fighting between the Nationalists and Communists in these areas.&lt;/p&gt;\n\n&lt;p&gt;But as the local newspaper you provide shows, there were evidently at least some rumors about this. So where did these come from if no such Japanese force existed? &lt;/p&gt;\n\n&lt;p&gt;This is just speculation, but there were initially large numbers of Japanese soldiers unaccounted for in the period immediately after the war. This was not only due to the kind of chaos that would be expected in such a situation, but also because the Soviets transported more than half a million Japanese prisoners to Siberia for forced labor (and weren&amp;#39;t always forthcoming with details about who they had). To me at least, this seems like the kind of situation that could lead to wild rumors.&lt;/p&gt;\n\n&lt;p&gt;(Incidentally, the newspaper article is about Okamura Yasuji, a Japanese general who served as a military advisor to the Nationalist government after the war.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgddkve", "score_hidden": false, "stickied": false, "created": 1492457588.0, "created_utc": 1492428788.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]