[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65p0a7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 93, "report_reasons": null, "author": "Brickie78", "saved": false, "mod_reports": [], "name": "t3_65p0a7", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/65p0a7/when_and_why_did_movies_move_the_full_credits/", "num_reports": null, "locked": false, "stickied": false, "created": 1492376725.0, "url": "https://www.reddit.com/r/AskHistorians/comments/65p0a7/when_and_why_did_movies_move_the_full_credits/", "author_flair_text": null, "quarantine": false, "title": "When and why did movies move the full credits from the start to the end of the film?", "created_utc": 1492347925.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 93}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65p0a7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65p0a7", "likes": null, "replies": "", "user_reports": [], "id": "dgcywa9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "threefiftyseven", "parent_id": "t1_dgcjg9s", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "To follow up, is there a historical reason that certain crew members make it into the credits and others do not? My dad works in Hollywood as a set construction laborer and unless you make it to a certain level, you aren't in the credits and that level is set pretty high. Yet, the personal/admin assistant to someone important get's their name on it. I know it bugs him a lot since he is in set construction and most of what people see on screen behind the actors are made by people that don't get credit - so just curious. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To follow up, is there a historical reason that certain crew members make it into the credits and others do not? My dad works in Hollywood as a set construction laborer and unless you make it to a certain level, you aren&amp;#39;t in the credits and that level is set pretty high. Yet, the personal/admin assistant to someone important get&amp;#39;s their name on it. I know it bugs him a lot since he is in set construction and most of what people see on screen behind the actors are made by people that don&amp;#39;t get credit - so just curious. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgcywa9", "score_hidden": false, "stickied": false, "created": 1492424618.0, "created_utc": 1492395818.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65p0a7", "likes": null, "replies": "", "user_reports": [], "id": "dgdbrx0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "j1375625", "parent_id": "t1_dgcjg9s", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "&gt; I would argue that it started a slow march to dominance around 1977 when George Lucas opened Star Wars this way\n\nGood answer, though I would argue it really started with Stanley Kubrick. Both *2001: A Space Odyssey* and *A Clockwork Orange* have opening credit sequences that are just \"Warner Brothers\", then Kubrick's name, then the name of the movie. *Barry Lyndon* is the same way except it also adds in the names of the two top-billed actors, and nothing more.\n\nOther filmmakers quickly began following suit. You can see it in Best Picture nominees such as *The French Connection* (1971), *The Exorcist* (1973), and *Rocky* (1976), all of which had less than 30 seconds of credits before getting to the action. *The Exorcist* just has the name of the director and the title, and *Rocky* has the title only (though it does have more credits after the first couple scenes of the movie). \n\nKubrick's late 60s/1970s films also had more elaborate closing credits than were typical of the time--well, by the time *Barry Lyndon* came out, many \"New Hollywood\" directors had begun shifting most of the credits to the end. You can see it in movies like *Jaws* and *One Flew Over the Cuckoo's Nest* which have more \"modern\" closing credit sequences. A bunch of those disaster movies from the mid-70s like *The Towering Inferno* and *Airport '75* have those longer closing credits, probably due to the fact that they made heavy use of special effects.\n\nBy 1975-76, all the Best Picture winners had shorter opening credit sequences and much longer closing credit sequences. Lucas was certainly instrumental in helping popularize this, but he was following a trend that he and his \"New Hollywood\" contemporaries were all following in the early to mid-1970s.", "edited": 1492424158.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I would argue that it started a slow march to dominance around 1977 when George Lucas opened Star Wars this way&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Good answer, though I would argue it really started with Stanley Kubrick. Both &lt;em&gt;2001: A Space Odyssey&lt;/em&gt; and &lt;em&gt;A Clockwork Orange&lt;/em&gt; have opening credit sequences that are just &amp;quot;Warner Brothers&amp;quot;, then Kubrick&amp;#39;s name, then the name of the movie. &lt;em&gt;Barry Lyndon&lt;/em&gt; is the same way except it also adds in the names of the two top-billed actors, and nothing more.&lt;/p&gt;\n\n&lt;p&gt;Other filmmakers quickly began following suit. You can see it in Best Picture nominees such as &lt;em&gt;The French Connection&lt;/em&gt; (1971), &lt;em&gt;The Exorcist&lt;/em&gt; (1973), and &lt;em&gt;Rocky&lt;/em&gt; (1976), all of which had less than 30 seconds of credits before getting to the action. &lt;em&gt;The Exorcist&lt;/em&gt; just has the name of the director and the title, and &lt;em&gt;Rocky&lt;/em&gt; has the title only (though it does have more credits after the first couple scenes of the movie). &lt;/p&gt;\n\n&lt;p&gt;Kubrick&amp;#39;s late 60s/1970s films also had more elaborate closing credits than were typical of the time--well, by the time &lt;em&gt;Barry Lyndon&lt;/em&gt; came out, many &amp;quot;New Hollywood&amp;quot; directors had begun shifting most of the credits to the end. You can see it in movies like &lt;em&gt;Jaws&lt;/em&gt; and &lt;em&gt;One Flew Over the Cuckoo&amp;#39;s Nest&lt;/em&gt; which have more &amp;quot;modern&amp;quot; closing credit sequences. A bunch of those disaster movies from the mid-70s like &lt;em&gt;The Towering Inferno&lt;/em&gt; and &lt;em&gt;Airport &amp;#39;75&lt;/em&gt; have those longer closing credits, probably due to the fact that they made heavy use of special effects.&lt;/p&gt;\n\n&lt;p&gt;By 1975-76, all the Best Picture winners had shorter opening credit sequences and much longer closing credit sequences. Lucas was certainly instrumental in helping popularize this, but he was following a trend that he and his &amp;quot;New Hollywood&amp;quot; contemporaries were all following in the early to mid-1970s.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgdbrx0", "score_hidden": false, "stickied": false, "created": 1492452246.0, "created_utc": 1492423446.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjg9s", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "domestic_dog", "parent_id": "t3_65p0a7", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "There's no exact date - just a slow and jerky shift spurred by different events.    \nSilent-era and early talkie films had opening credits that would generally either be the only credits, or be mirrored at the end of the film. The total cast could be ten to 20 actors, and ten to 20 others (director, screenwriter, editor, photographer, costumer, titles, conductor of the orchestra and a few others). Total time to present these people on title cards would be 30 seconds or so, and if the title sequence was longer it was often to show credited actors on stage as they were credited. A complete opening title sequence, then, could be over with in a minute, certainly less than two, and would not be \"full\" credits in today's sense.  You can see this style in The Jazz Singer (1927) and 42nd street (1933), but it was still in use much later - e.g. in Roman Holiday (1953) or Rio Bravo (1954). \n\nAs more and more people became necessary to make a film, credits slowly developed into what might be called the \"modern\" format - where only top billed actors, and certain more distinguished crew (e.g. director, producer and screenwriter) were given opening credits, and some of the rest of the cast are shown at the end. For decades, this crediting style would still omit many of the people who worked on the film - cameramen, production managers, script supervisors, assistants, gaffers, stylists, set dressers and so on, but it made the opening of the film more immediate and created room at the end for as many credits as desired. To increase the immediacy, more films started using title sequences, either live-action or animated. You can see this style in His Girl Friday (1940), The Longest Day (1962), and Gattaca (1997). It's still in some use today - the most recent example I can think of is Wes Andersson's Moonrise Kingdom (2012), although I'm sure there are newer films that use it.\n\nFinally you have the \"postmodern\" format, which shows only the film title, or perhaps not even that, as opening credits. Plenty of older films, notably Fantasia (1940) and Citizen Kane (1941) used it, but I would argue that it started a slow march to dominance around 1977 when George Lucas opened Star Wars this way. Francis Ford Coppola had the same idea, opening Apocalypse Now with no credits at all, but he wasn't able to get that film out the door until 1979. Lucas was [infamously fined by the Directors Guild of America for having a nonstandard title sequence](http://www.rogerebert.com/reviews/great-movie-star-wars-episode-iv-a-new-hope-1977), and left over it - which opened the door for others. I would estimate that it became more common than the \"modern\" format by the early 1990s.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s no exact date - just a slow and jerky shift spurred by different events.&lt;br/&gt;\nSilent-era and early talkie films had opening credits that would generally either be the only credits, or be mirrored at the end of the film. The total cast could be ten to 20 actors, and ten to 20 others (director, screenwriter, editor, photographer, costumer, titles, conductor of the orchestra and a few others). Total time to present these people on title cards would be 30 seconds or so, and if the title sequence was longer it was often to show credited actors on stage as they were credited. A complete opening title sequence, then, could be over with in a minute, certainly less than two, and would not be &amp;quot;full&amp;quot; credits in today&amp;#39;s sense.  You can see this style in The Jazz Singer (1927) and 42nd street (1933), but it was still in use much later - e.g. in Roman Holiday (1953) or Rio Bravo (1954). &lt;/p&gt;\n\n&lt;p&gt;As more and more people became necessary to make a film, credits slowly developed into what might be called the &amp;quot;modern&amp;quot; format - where only top billed actors, and certain more distinguished crew (e.g. director, producer and screenwriter) were given opening credits, and some of the rest of the cast are shown at the end. For decades, this crediting style would still omit many of the people who worked on the film - cameramen, production managers, script supervisors, assistants, gaffers, stylists, set dressers and so on, but it made the opening of the film more immediate and created room at the end for as many credits as desired. To increase the immediacy, more films started using title sequences, either live-action or animated. You can see this style in His Girl Friday (1940), The Longest Day (1962), and Gattaca (1997). It&amp;#39;s still in some use today - the most recent example I can think of is Wes Andersson&amp;#39;s Moonrise Kingdom (2012), although I&amp;#39;m sure there are newer films that use it.&lt;/p&gt;\n\n&lt;p&gt;Finally you have the &amp;quot;postmodern&amp;quot; format, which shows only the film title, or perhaps not even that, as opening credits. Plenty of older films, notably Fantasia (1940) and Citizen Kane (1941) used it, but I would argue that it started a slow march to dominance around 1977 when George Lucas opened Star Wars this way. Francis Ford Coppola had the same idea, opening Apocalypse Now with no credits at all, but he wasn&amp;#39;t able to get that film out the door until 1979. Lucas was &lt;a href=\"http://www.rogerebert.com/reviews/great-movie-star-wars-episode-iv-a-new-hope-1977\"&gt;infamously fined by the Directors Guild of America for having a nonstandard title sequence&lt;/a&gt;, and left over it - which opened the door for others. I would estimate that it became more common than the &amp;quot;modern&amp;quot; format by the early 1990s.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgcjg9s", "score_hidden": false, "stickied": false, "created": 1492403892.0, "created_utc": 1492375092.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 30}}], "after": null, "before": null}}]