[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AskHistorians", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am mostly getting this from the 1984 movie &amp;quot;Amadeus&amp;quot;, but I am just wondering if there is a grain of truth to it? If not, what is the true story of Mozart?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am mostly getting this from the 1984 movie \"Amadeus\", but I am just wondering if there is a grain of truth to it? If not, what is the true story of Mozart?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65uebo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 57, "report_reasons": null, "author": "saddetective87", "saved": false, "mod_reports": [], "name": "t3_65uebo", "subreddit_name_prefixed": "r/AskHistorians", "approved_by": null, "over_18": false, "domain": "self.AskHistorians", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssp3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AskHistorians/comments/65uebo/why_was_mozart_so_financially_unsuccessful_in_his/", "num_reports": null, "locked": false, "stickied": false, "created": 1492446855.0, "url": "https://www.reddit.com/r/AskHistorians/comments/65uebo/why_was_mozart_so_financially_unsuccessful_in_his/", "author_flair_text": null, "quarantine": false, "title": "Why was Mozart so financially unsuccessful in his life? Was it poor money management, or is there evidence that the court and music establishment of Vienna did their best to make sure that his operas and other works did not become popular?", "created_utc": 1492418055.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 57}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65uebo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65uebo", "likes": null, "replies": "", "user_reports": [], "id": "dgdq42e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ugsley", "parent_id": "t1_dgdiior", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "Superb answer!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Superb answer!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgdq42e", "score_hidden": false, "stickied": false, "created": 1492475920.0, "created_utc": 1492447120.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ssp3", "removal_reason": null, "link_id": "t3_65uebo", "likes": null, "replies": "", "user_reports": [], "id": "dgdwpar", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "saddetective87", "parent_id": "t1_dgdiior", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "What was Mozart's stable job? And couldn't he work for a patron and sell some of his work on the side as a part-time freelancer on top of a full-time position?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What was Mozart&amp;#39;s stable job? And couldn&amp;#39;t he work for a patron and sell some of his work on the side as a part-time freelancer on top of a full-time position?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgdwpar", "score_hidden": false, "stickied": false, "created": 1492483241.0, "created_utc": 1492454441.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdiior", "gilded": 0, "archived": false, "score": 53, "report_reasons": null, "author": "DGBD", "parent_id": "t3_65uebo", "subreddit_name_prefixed": "r/AskHistorians", "controversiality": 0, "body": "The true story of Mozart is by and large not what you see in the movie. He did not, in fact, have a cabal led by Salieri tring to undermine him, although he did note with frustration that people at the time seemed to prefer the Italian composers' music to his own. Salieri was a friend and even ended up teaching Mozart's son.\n\nBut more to your point, Mozart was financially unstable because of the way musicians and composers were employed and because of his own personality quirks. \n\nUp until the 19th century or so, composers were usually employees of a noble person or a church. They were thought of more as craftsmen than artists, and would write and play music for whatever events their employer needed music for. For example, if you look through Mozart's catalog you'll find a lot of serenades, which were meant to played at evening banquets.\n\nOne thing the movie captures well is Mozart's irreverence and playfulness. This didn't quite suit the idea of serious high society music, and many people took issue with what they saw as a frivolous streak in his music. The famous complaint of \"too many notes,\" supposedly said by the Emperor after seeing Mozart's Marriage of Figaro, is a great example of the sentiments many had for Mozart: his imagination ran away with him, his music was too unfocused, he needed editing.\n\nFor his part, he took issue with people telling him how he should and shouldn't go about things. Eventually, he left a stable job with an employer and started working mainly on commissions. The problem was that he already had a taste for the finer things in life, especially clothes, and ran up huge debts even during times when he didn't have many commissions to work on. There's evidence as well that he wasn't great about keeping up with his commissions, either, and his patrons weren't great about paying him. For example, he was commissioned by an amateur flute player named Ferdinand de Jean to write some flute quartets and concertos, but he only finished about half of them (some of which reused material from his other works) and de Jean only paid him a fraction of what he was supposed to.\n\nSo a combination of overspending and not being a great businessman is mainly to blame. Had he not died when he did, his hugely popular The Magic Flute would have been a big boost to his finances, and probably led to much more work. But he died shortly after the premier, and was in pretty dire financial straits at the time.\n\nIn the 19th century, commissions and music publishing became the main source of income for composers, making them more independent, but also increasing the need for them to be good businessmen. Who knows whether Mozart would have thrived in this environment, but he would probably have preferred the freedom to compose what he wanted.", "edited": 1492438302.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The true story of Mozart is by and large not what you see in the movie. He did not, in fact, have a cabal led by Salieri tring to undermine him, although he did note with frustration that people at the time seemed to prefer the Italian composers&amp;#39; music to his own. Salieri was a friend and even ended up teaching Mozart&amp;#39;s son.&lt;/p&gt;\n\n&lt;p&gt;But more to your point, Mozart was financially unstable because of the way musicians and composers were employed and because of his own personality quirks. &lt;/p&gt;\n\n&lt;p&gt;Up until the 19th century or so, composers were usually employees of a noble person or a church. They were thought of more as craftsmen than artists, and would write and play music for whatever events their employer needed music for. For example, if you look through Mozart&amp;#39;s catalog you&amp;#39;ll find a lot of serenades, which were meant to played at evening banquets.&lt;/p&gt;\n\n&lt;p&gt;One thing the movie captures well is Mozart&amp;#39;s irreverence and playfulness. This didn&amp;#39;t quite suit the idea of serious high society music, and many people took issue with what they saw as a frivolous streak in his music. The famous complaint of &amp;quot;too many notes,&amp;quot; supposedly said by the Emperor after seeing Mozart&amp;#39;s Marriage of Figaro, is a great example of the sentiments many had for Mozart: his imagination ran away with him, his music was too unfocused, he needed editing.&lt;/p&gt;\n\n&lt;p&gt;For his part, he took issue with people telling him how he should and shouldn&amp;#39;t go about things. Eventually, he left a stable job with an employer and started working mainly on commissions. The problem was that he already had a taste for the finer things in life, especially clothes, and ran up huge debts even during times when he didn&amp;#39;t have many commissions to work on. There&amp;#39;s evidence as well that he wasn&amp;#39;t great about keeping up with his commissions, either, and his patrons weren&amp;#39;t great about paying him. For example, he was commissioned by an amateur flute player named Ferdinand de Jean to write some flute quartets and concertos, but he only finished about half of them (some of which reused material from his other works) and de Jean only paid him a fraction of what he was supposed to.&lt;/p&gt;\n\n&lt;p&gt;So a combination of overspending and not being a great businessman is mainly to blame. Had he not died when he did, his hugely popular The Magic Flute would have been a big boost to his finances, and probably led to much more work. But he died shortly after the premier, and was in pretty dire financial straits at the time.&lt;/p&gt;\n\n&lt;p&gt;In the 19th century, commissions and music publishing became the main source of income for composers, making them more independent, but also increasing the need for them to be good businessmen. Who knows whether Mozart would have thrived in this environment, but he would probably have preferred the freedom to compose what he wanted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskHistorians", "name": "t1_dgdiior", "score_hidden": false, "stickied": false, "created": 1492466712.0, "created_utc": 1492437912.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 53}}], "after": null, "before": null}}]