[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "seduction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For those of you have seen the &lt;em&gt;Flawless Natural&lt;/em&gt; with RSD Tim, you will be very familiar with this mentality. For those of you have not seen the &lt;em&gt;Flawless Natural&lt;/em&gt;, I would recommend giving it a once over as there is a lot of helpful material provided. &lt;/p&gt;\n\n&lt;p&gt;So some of you may be wondering as to what my title means. This is honestly the best thing I learned from watching Tim&amp;#39;s Video, and its simply this: &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Strong Intention&lt;/strong&gt; (Escalating kino, showing sexual desire etc.) + &lt;strong&gt;Awesome Attitude&lt;/strong&gt;= The kind of guy &amp;quot;she&amp;quot; is interested in, emotionally and physically. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Strong Intention&lt;/strong&gt; + &lt;strong&gt;sub-par attitude&lt;/strong&gt; (not having fun, out of sync body language) = &lt;strong&gt;Creepy/uncomfortable&lt;/strong&gt;, and makes everyone uncomfortable. This is what I am referring to in my title. Strong intention is awesome as long as your intention is to bring value to the situation, rather than just finding out what you can get out of it (i.e. sex). The reason why girls define a guy as creepy rather “sexy” or “charming” is because how would you feel if someone who’s acting like they’re selling you something (something you know nothing about) were to all of a sudden touch your knee, or thigh, nervously compliment you. You would probably feel very uncomfortable and turned off to their “pitch”. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;weak intention&lt;/strong&gt; + &lt;strong&gt;awesome attitude&lt;/strong&gt;= The &lt;strong&gt;&amp;quot;Entertainer&amp;quot;&lt;/strong&gt;, being the entertainer is all well and good sometimes, and I think it&amp;#39;s the category that a lot of guys end up finding themselves in. Occasionally one can get laid being the entertainer, but unfortunately, most of the time women will categorize you as the &amp;quot;the joker&amp;quot;, essentially the guy that makes her laugh but doesn&amp;#39;t go home with her either. &lt;/p&gt;\n\n&lt;p&gt;• This is why Tim urges men to become confident in their mentality rather than a rehearsed technique. I would have to say that for the most part, I agree with this line of thinking. I know that we have all been around beautiful women and sometimes when you&amp;#39;re chatting them up, you can become so focused on just keeping the conversation going that you&amp;#39;ve forgotten the second critical aspect, which is showing your intention. I remember when I was first starting out, I would approach a girl at X location; I would introduce myself, build some rapport (make them laugh and what not) but I never really bridged that physical gap. I&amp;#39;ve learned that If I am in the mindset of providing my own entertainment, that gets me in the positive attitude I need to be in. &lt;/p&gt;\n\n&lt;p&gt;• For example, one thing I do in order to get &amp;quot;Into state&amp;quot; as Tyler refers to it, is say I&amp;#39;m in a bar and it&amp;#39;s super busy and it seems like I&amp;#39;m &amp;quot;breaking in&amp;quot; to the environment (feeling like you&amp;#39;re an outsider to current developments) I&amp;#39;ll go up to a group of people and introduce myself and because this is my idea of having fun, I will go up to them and ask them the tried and proven question &amp;quot;Do you think men and women can be friends if they are attracted to one another&amp;quot;. Almost 100% of the time Girls will answer Yes and guys will answer No. I&amp;#39;ve had 20-30 minute conversations about this topic alone and I personally just love what people have to say about the subject. remember though, this is something I personally like doing and it gets me to have fun and interactive conversation. It is also has the benefit of possibly starting a more escalated conversation with a woman who might be with group already. &lt;/p&gt;\n\n&lt;p&gt;• So after you have possibly had some fun going around and just being social, you&amp;#39;ll notice that you probably feel a bit lighter, like you can feel more of a presence within yourself. That&amp;#39;s exactly what you want. As soon as your initial social interactions are over and you feel good, use that energy and go talk to the first girl that strikes your eye. The important thing to remember while you&amp;#39;re &amp;quot;getting ready&amp;quot; is you should still be practicing your kino. My definition of kino is a little different then I suppose the typical seddit edition. I consider it more as a physical touch to establish a further bond regardless of gender. So, go in for a high five, a bro hug, anything that you feel in the moment would build and cross that physical barrier of human connection. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;ideally once you&amp;#39;ve approached a girl you&amp;#39;ll be loose, you&amp;#39;ll be confident and excited in your verbiage, you&amp;#39;ll get that great mindset + this allows your Kino to come off seamlessly which.... also happens to show strong intention. It’s a beautiful pin pong game of showing intention and getting better feedback and further interaction. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;So to Wrap up, I&amp;#39;ve left you with two very large pieces of the puzzle and all you have left is a few and minor pieces to find for yourself. Just remember that we all like watching and interacting with people that are having a great time. It&amp;#39;s infectious, it&amp;#39;s exciting and as long you showing that you&amp;#39;re more than an unpaid comedian or a bruiting sex hog out for the kill, the rest will be your decisions at each moment, but if you begin this mentality, your decisions will come from a place of assurance and confidence rather than performance. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "For those of you have seen the *Flawless Natural* with RSD Tim, you will be very familiar with this mentality. For those of you have not seen the *Flawless Natural*, I would recommend giving it a once over as there is a lot of helpful material provided. \n\nSo some of you may be wondering as to what my title means. This is honestly the best thing I learned from watching Tim's Video, and its simply this: \n\n**Strong Intention** (Escalating kino, showing sexual desire etc.) + **Awesome Attitude**= The kind of guy \"she\" is interested in, emotionally and physically. \n\n**Strong Intention** + **sub-par attitude** (not having fun, out of sync body language) = **Creepy/uncomfortable**, and makes everyone uncomfortable. This is what I am referring to in my title. Strong intention is awesome as long as your intention is to bring value to the situation, rather than just finding out what you can get out of it (i.e. sex). The reason why girls define a guy as creepy rather “sexy” or “charming” is because how would you feel if someone who’s acting like they’re selling you something (something you know nothing about) were to all of a sudden touch your knee, or thigh, nervously compliment you. You would probably feel very uncomfortable and turned off to their “pitch”. \n\n**weak intention** + **awesome attitude**= The **\"Entertainer\"**, being the entertainer is all well and good sometimes, and I think it's the category that a lot of guys end up finding themselves in. Occasionally one can get laid being the entertainer, but unfortunately, most of the time women will categorize you as the \"the joker\", essentially the guy that makes her laugh but doesn't go home with her either. \n\n•\tThis is why Tim urges men to become confident in their mentality rather than a rehearsed technique. I would have to say that for the most part, I agree with this line of thinking. I know that we have all been around beautiful women and sometimes when you're chatting them up, you can become so focused on just keeping the conversation going that you've forgotten the second critical aspect, which is showing your intention. I remember when I was first starting out, I would approach a girl at X location; I would introduce myself, build some rapport (make them laugh and what not) but I never really bridged that physical gap. I've learned that If I am in the mindset of providing my own entertainment, that gets me in the positive attitude I need to be in. \n\n•\tFor example, one thing I do in order to get \"Into state\" as Tyler refers to it, is say I'm in a bar and it's super busy and it seems like I'm \"breaking in\" to the environment (feeling like you're an outsider to current developments) I'll go up to a group of people and introduce myself and because this is my idea of having fun, I will go up to them and ask them the tried and proven question \"Do you think men and women can be friends if they are attracted to one another\". Almost 100% of the time Girls will answer Yes and guys will answer No. I've had 20-30 minute conversations about this topic alone and I personally just love what people have to say about the subject. remember though, this is something I personally like doing and it gets me to have fun and interactive conversation. It is also has the benefit of possibly starting a more escalated conversation with a woman who might be with group already. \n\n•\tSo after you have possibly had some fun going around and just being social, you'll notice that you probably feel a bit lighter, like you can feel more of a presence within yourself. That's exactly what you want. As soon as your initial social interactions are over and you feel good, use that energy and go talk to the first girl that strikes your eye. The important thing to remember while you're \"getting ready\" is you should still be practicing your kino. My definition of kino is a little different then I suppose the typical seddit edition. I consider it more as a physical touch to establish a further bond regardless of gender. So, go in for a high five, a bro hug, anything that you feel in the moment would build and cross that physical barrier of human connection. \n\n* ideally once you've approached a girl you'll be loose, you'll be confident and excited in your verbiage, you'll get that great mindset + this allows your Kino to come off seamlessly which.... also happens to show strong intention. It’s a beautiful pin pong game of showing intention and getting better feedback and further interaction. \n\n\nSo to Wrap up, I've left you with two very large pieces of the puzzle and all you have left is a few and minor pieces to find for yourself. Just remember that we all like watching and interacting with people that are having a great time. It's infectious, it's exciting and as long you showing that you're more than an unpaid comedian or a bruiting sex hog out for the kill, the rest will be your decisions at each moment, but if you begin this mentality, your decisions will come from a place of assurance and confidence rather than performance. \n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64xw9o", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 76, "report_reasons": null, "author": "jimmycone", "saved": false, "mod_reports": [], "name": "t3_64xw9o", "subreddit_name_prefixed": "r/seduction", "approved_by": null, "over_18": false, "domain": "self.seduction", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhrv", "edited": 1492007054.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/seduction/comments/64xw9o/strong_intention_why_its_important_and_how_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492029731.0, "url": "https://www.reddit.com/r/seduction/comments/64xw9o/strong_intention_why_its_important_and_how_to/", "author_flair_text": null, "quarantine": false, "title": "Strong Intention. Why it's important and how to show it.", "created_utc": 1492000931.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 76}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64xw9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64xw9o", "likes": null, "replies": "", "user_reports": [], "id": "dg62da6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jimmycone", "parent_id": "t1_dg61u5a", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I fully agree with you, that's why I refraine from clickbait titles like \"The secret to the game\" or whatever other nonsense gets posted here sometimes. I'm pretty logic orientated and I found this to be a simple and logical explanation of how your behaviors categorize you. There's no guarantee In life or in this game of dating &amp; mating. Like you said, get the best hand possible and use it to the best of your abilities.... But yes, nobody wins every hand.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I fully agree with you, that&amp;#39;s why I refraine from clickbait titles like &amp;quot;The secret to the game&amp;quot; or whatever other nonsense gets posted here sometimes. I&amp;#39;m pretty logic orientated and I found this to be a simple and logical explanation of how your behaviors categorize you. There&amp;#39;s no guarantee In life or in this game of dating &amp;amp; mating. Like you said, get the best hand possible and use it to the best of your abilities.... But yes, nobody wins every hand.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg62da6", "score_hidden": false, "stickied": false, "created": 1492041488.0, "created_utc": 1492012688.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg61u5a", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "recyclablebanthas", "parent_id": "t3_64xw9o", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt; Strong Intention (Escalating kino, showing sexual desire etc.) + Awesome Attitude= The kind of guy \"she\" is interested in, emotionally and physically.\n\nNot quite.  While a good attitude and confidence are necessary, these things do **not** guarantee that she'll be interested in a guy.  Much of that is completely out of the guy's control.\n\n**If she's not interested and you combine that with strong intention, that IS creepy.**\n\nCreepy is not just because the guy is uncomfortable or something else is off with his mindset.  It's when the girl is putting off signals that she isn't interested or wants to slow down or what have you, and the guy **keeps doing he wants** with no regard for the feedback the girl is giving.\n\nConfidence and all that inner game stuff, is vitally important.  But it just ensures that one has the best chance with the cards one is dealt.  It doesn't ensure you have a winning hand.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Strong Intention (Escalating kino, showing sexual desire etc.) + Awesome Attitude= The kind of guy &amp;quot;she&amp;quot; is interested in, emotionally and physically.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not quite.  While a good attitude and confidence are necessary, these things do &lt;strong&gt;not&lt;/strong&gt; guarantee that she&amp;#39;ll be interested in a guy.  Much of that is completely out of the guy&amp;#39;s control.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;If she&amp;#39;s not interested and you combine that with strong intention, that IS creepy.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Creepy is not just because the guy is uncomfortable or something else is off with his mindset.  It&amp;#39;s when the girl is putting off signals that she isn&amp;#39;t interested or wants to slow down or what have you, and the guy &lt;strong&gt;keeps doing he wants&lt;/strong&gt; with no regard for the feedback the girl is giving.&lt;/p&gt;\n\n&lt;p&gt;Confidence and all that inner game stuff, is vitally important.  But it just ensures that one has the best chance with the cards one is dealt.  It doesn&amp;#39;t ensure you have a winning hand.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg61u5a", "score_hidden": false, "stickied": false, "created": 1492040911.0, "created_utc": 1492012111.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64xw9o", "likes": null, "replies": "", "user_reports": [], "id": "dg64o58", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chewbacaflocka", "parent_id": "t3_64xw9o", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Flawless was great and still contains relevant info, but I would definitely recommend \"Shift\" by RSD Julien. I know a lot of guys have trouble figuring out internal game enough to gain the strong attitude to align with strong intention. It has really helped me a lot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Flawless was great and still contains relevant info, but I would definitely recommend &amp;quot;Shift&amp;quot; by RSD Julien. I know a lot of guys have trouble figuring out internal game enough to gain the strong attitude to align with strong intention. It has really helped me a lot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg64o58", "score_hidden": false, "stickied": false, "created": 1492043931.0, "created_utc": 1492015131.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64xw9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64xw9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64xw9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64xw9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64xw9o", "likes": null, "replies": "", "user_reports": [], "id": "dg6dbbl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jimmycone", "parent_id": "t1_dg68dwq", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "EASY PEASY", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;EASY PEASY&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6dbbl", "score_hidden": false, "stickied": false, "created": 1492052755.0, "created_utc": 1492023955.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64xw9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64xw9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64xw9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64xw9o", "likes": null, "replies": "", "user_reports": [], "id": "dg6pvgz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MonkeyMannnn", "parent_id": "t1_dg6k51d", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "How do you mean safe? If you mean to keep it friendly, then just keep touches light and short to accentuate your points in conversation or show appreciation for hers. If you mean to escalate sexually, then just progress as far as you can while maintaining the necessary respect for the location.\n\nEye contact is the biggest thing. When she's looking at you just stare straight into the depths of her soul lol. Look away when she does, but when she looks back at you continue it. Kino, obviously. Light, short touches: arms, shoulders, small of her back, legs. Longer touches in those same places if there's no resistance to the lighter things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How do you mean safe? If you mean to keep it friendly, then just keep touches light and short to accentuate your points in conversation or show appreciation for hers. If you mean to escalate sexually, then just progress as far as you can while maintaining the necessary respect for the location.&lt;/p&gt;\n\n&lt;p&gt;Eye contact is the biggest thing. When she&amp;#39;s looking at you just stare straight into the depths of her soul lol. Look away when she does, but when she looks back at you continue it. Kino, obviously. Light, short touches: arms, shoulders, small of her back, legs. Longer touches in those same places if there&amp;#39;s no resistance to the lighter things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6pvgz", "score_hidden": false, "stickied": false, "created": 1492066782.0, "created_utc": 1492037982.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6k51d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Departments", "parent_id": "t1_dg6jut5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "What are some safe ways that I can show intent? \n\nThe women I've talked to usually put their hands on me first, which then I put my arm around them or return the kino. \n\nI'm not active anymore, but I still like learning. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What are some safe ways that I can show intent? &lt;/p&gt;\n\n&lt;p&gt;The women I&amp;#39;ve talked to usually put their hands on me first, which then I put my arm around them or return the kino. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not active anymore, but I still like learning. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6k51d", "score_hidden": false, "stickied": false, "created": 1492059846.0, "created_utc": 1492031046.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jut5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MonkeyMannnn", "parent_id": "t1_dg6imut", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "That's not exactly what I'm saying, but close. Attraction is not a choice. It's not for us men and you better believe it's not for women. Think about any girl you've ever found attractive...did you have to consciously convince yourself that you are attracted to her? No, you just felt it because she is attractive to you. It's the same for women. Their attraction is based on traits like confidence, status, etc...but it's still just a natural reaction to what they find attractive.\n\nBack to intent, though. Men \"friend zone\" themselves because they actively try to hide their intent to be sexual with a woman. Women always know, they're not stupid and any man who thinks they can hide their intent is an idiot. However, if you're not confident enough to show her that you desire her, then why the hell would she ever want to be with you even if she was initially attracted?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s not exactly what I&amp;#39;m saying, but close. Attraction is not a choice. It&amp;#39;s not for us men and you better believe it&amp;#39;s not for women. Think about any girl you&amp;#39;ve ever found attractive...did you have to consciously convince yourself that you are attracted to her? No, you just felt it because she is attractive to you. It&amp;#39;s the same for women. Their attraction is based on traits like confidence, status, etc...but it&amp;#39;s still just a natural reaction to what they find attractive.&lt;/p&gt;\n\n&lt;p&gt;Back to intent, though. Men &amp;quot;friend zone&amp;quot; themselves because they actively try to hide their intent to be sexual with a woman. Women always know, they&amp;#39;re not stupid and any man who thinks they can hide their intent is an idiot. However, if you&amp;#39;re not confident enough to show her that you desire her, then why the hell would she ever want to be with you even if she was initially attracted?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6jut5", "score_hidden": false, "stickied": false, "created": 1492059523.0, "created_utc": 1492030723.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6imut", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Departments", "parent_id": "t1_dg68dwq", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "In that case what you're saying is intention never matters. She'll like you or not if she wants to/there's chemistry\n\nThat doesn't seem right, since through social experience a person can build and manipulate their own chemistry...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In that case what you&amp;#39;re saying is intention never matters. She&amp;#39;ll like you or not if she wants to/there&amp;#39;s chemistry&lt;/p&gt;\n\n&lt;p&gt;That doesn&amp;#39;t seem right, since through social experience a person can build and manipulate their own chemistry...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6imut", "score_hidden": false, "stickied": false, "created": 1492058222.0, "created_utc": 1492029422.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg68dwq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MonkeyMannnn", "parent_id": "t1_dg67bpm", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Your intention in that situation boils down to \"you're really cute and I'm curious to know more about you\". Introduce yourself if you haven't already and if you two have the kind of vibe you're looking for, then make plans with her and go from there. There's no magic line that's gonna make it happen, you just gotta show up as a man and if the vibe is there, then great. If it's not, then you've made a new friend. Easy peasy lemon squeazy ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your intention in that situation boils down to &amp;quot;you&amp;#39;re really cute and I&amp;#39;m curious to know more about you&amp;quot;. Introduce yourself if you haven&amp;#39;t already and if you two have the kind of vibe you&amp;#39;re looking for, then make plans with her and go from there. There&amp;#39;s no magic line that&amp;#39;s gonna make it happen, you just gotta show up as a man and if the vibe is there, then great. If it&amp;#39;s not, then you&amp;#39;ve made a new friend. Easy peasy lemon squeazy &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg68dwq", "score_hidden": false, "stickied": false, "created": 1492047702.0, "created_utc": 1492018902.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67bpm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Snazzy_Serval", "parent_id": "t1_dg66a0z", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt; So if you want a girlfriend or a lay, you have to make sure your intentions are understood clearly\n\nHonestly I'm confused how do do that. I'll try to explain my way of thinking.\n\nRight now my main goal is to have a girlfriend. But in the mean time I'll settle with banging a few chicks.\n\nI frequently go Swing Dancing and lets say there is a girl I've seen a couple of times and I think she's really cute. What would my intention be? I guess my intention would be to get to know her better, but not as a friend. What would be the best intention to have and how would one show it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;So if you want a girlfriend or a lay, you have to make sure your intentions are understood clearly&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Honestly I&amp;#39;m confused how do do that. I&amp;#39;ll try to explain my way of thinking.&lt;/p&gt;\n\n&lt;p&gt;Right now my main goal is to have a girlfriend. But in the mean time I&amp;#39;ll settle with banging a few chicks.&lt;/p&gt;\n\n&lt;p&gt;I frequently go Swing Dancing and lets say there is a girl I&amp;#39;ve seen a couple of times and I think she&amp;#39;s really cute. What would my intention be? I guess my intention would be to get to know her better, but not as a friend. What would be the best intention to have and how would one show it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg67bpm", "score_hidden": false, "stickied": false, "created": 1492046641.0, "created_utc": 1492017841.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66a0z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jimmycone", "parent_id": "t1_dg63ki6", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "* Intention is where everything starts. you came to this sub **intending** to find out how to have better interactions with women.\n\n* Why did you wanna become better with women? maybe you want a girlfriend, maybe you want to sleep with 100 women. But you probably have an idea of some future **intentional results**\n\n* So if you want a girlfriend or a lay, you have to make sure your **intentions** are understood clearly, without being aggressive and ideally though a lot of non-verbal communication. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Intention is where everything starts. you came to this sub &lt;strong&gt;intending&lt;/strong&gt; to find out how to have better interactions with women.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Why did you wanna become better with women? maybe you want a girlfriend, maybe you want to sleep with 100 women. But you probably have an idea of some future &lt;strong&gt;intentional results&lt;/strong&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;So if you want a girlfriend or a lay, you have to make sure your &lt;strong&gt;intentions&lt;/strong&gt; are understood clearly, without being aggressive and ideally though a lot of non-verbal communication. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg66a0z", "score_hidden": false, "stickied": false, "created": 1492045585.0, "created_utc": 1492016785.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg63ki6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Snazzy_Serval", "parent_id": "t3_64xw9o", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Is there any trick to having a strong intent? Or what is a strong intent?\n\nWhen I make conversation with a pretty girl I'm not actually thinking about bending her over. Is that bad?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is there any trick to having a strong intent? Or what is a strong intent?&lt;/p&gt;\n\n&lt;p&gt;When I make conversation with a pretty girl I&amp;#39;m not actually thinking about bending her over. Is that bad?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg63ki6", "score_hidden": false, "stickied": false, "created": 1492042777.0, "created_utc": 1492013977.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]