[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "seduction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I hate it when people try to oversimplify pick-up, but if I had to boil down pick up into one principle every man should understand, it is this: The woman must be more emotionally invested in you than you are in her at every stage of the relationship. I call this the IRON LAW OF SEDUCTION. &lt;/p&gt;\n\n&lt;p&gt;Understanding and correctly applying this law will solve 99% of the problems men have with women. She’s not responsive to your advances? Not emotionally invested enough. Not returning your calls? Not emotionally invested enough. Flaking? Not emotionally invested enough. On the flipside, as a man, if you emotionally divest yourself from girls, you solve most your own problems. Outcome dependent? You are too emotionally invested in getting laid. Approach anxiety? You are too emotionally invested in the success of the interaction. Neediness and desperation? You are emotionally invested in getting girls. Suck at conversations? You are too emotionally invested in getting laid and can’t just have a regular conversation. &lt;/p&gt;\n\n&lt;p&gt;Emotional investment is subconsciously communicated and women evolved to sense it. One guy can talk to a girl all night without her feeling like he is emotionally invested, but another can talk to her for 2 seconds and get auto-rejected for being too invested. Of course, a woman may talk to you, hang out with you, fuck you, or even date you for a long time if she’s not emotionally invested because she’s horny, crazy, lonely, desperate, drunk, bored, want something from you, etc.... But if she’s not emotionally invested, you are on thin ice and vulnerable at any time to flaking or going cold.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What is emotional investment?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Emotional investment is occupying one’s thoughts and emotions. It is not the same as being interested or “liking” somebody. I “like” a lot of people but I don’t “feel” anything for them and it wouldn’t hurt my feelings if they rejected me or even died.  This distinction is why women flake. Women “like,” get “interested,” and give their numbers to lots of guys, but if she is not at least a little emotionally invested she will not be motivated to get out of bed, put on her make-up, and come somewhere to meet you. Unlike men, women get invited to shit all the time by guys they “like” so they are not going to care about meeting you unless there is some emotional investment.  &lt;/p&gt;\n\n&lt;p&gt;Think about emotional investment like this: like most men, you probably like Lamborghinis. But like most men, you probably don’t have one, and you probably don’t spend all day thinking about Lamborghinis and being sad because you don’t have one. But if I lent you a Lamborghini for two months and you drove it around, took care of it, showed it off to your friends, and got laid because of it, you would be sad when I take it back. It’s irrational, but you would get emotionally invested in the Lambo even if you weren’t sad when you never had one. Because you became attached to it and it gave you a sense of identity and power, the Lambo took up space in your thoughts and emotions, making you emotionally invested. &lt;/p&gt;\n\n&lt;p&gt;Emotional investment in people is similar. Being around somebody awesome and feeling like they “belong” to you  becomes addictive like crack. An awesome man makes a woman feel special, loved, important, powerful, and cool. An awesome man is also fun, positive, confident, carefree, and dominant, easing the woman’s anxieties and insecurities. Being around an awesome guy is literally like a drug to women, and if they are around you long enough, they become hooked. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Ben Franklin Theory&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Ben Franklin, one of America’s founding fathers and greatest poonhounds, famously and counterintuitively discovered that if person A does something for person B, person A will like person B more. Most people would assume the opposite – if you want people to like you, you should do things for them, so person B should like person B more! Right? Wrong!&lt;/p&gt;\n\n&lt;p&gt;Person A “likes” person B more because person A has become emotionally invested. Maybe person A subconsciously expects person B to do something nice back. Maybe person A subconsciously see themselves as “beneath” person B in the ape hierarchy. Maybe person A is protecting their own ego – person B must be somebody special if even I did something for them! Or maybe the simple act of doing something for person B caused person B to enter person A’s thoughts and emotions.&lt;/p&gt;\n\n&lt;p&gt;Whatever the psychological mechanism, when a woman really likes you, she will WANT to do stuff for you, sometimes even aggressively, and she will WANT to emotionally invest while you fantasize about other things. When a woman really likes you is when you realize that needy, supplicating, validating behavior is not necessary. I have friends that are strippers, and their job is basically to hustle men out of money and to trick guys into buying shit for them. I don’t buy girls things, ever, (and I never, ever visit my friends at work) and I notice that when these strippers start to like me they buy me shit, clean my house, do me favors, etc... One night I even got into an argument with a stripper because she bought me 5 drinks in a row and she wouldn’t let me buy her a drink in return. That’s emotional investment.    &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Woujo Theory&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;According to my corollary of the Franklin theory, supplicating to a woman, validating yourself to a woman, buying a woman things, following a woman around, allowing a woman to treat you like shit, and spending too much time trying to “help” a woman who doesn’t deserve it subconsciously will cause you to become emotionally invested in her and feel “beneath” her.&lt;/p&gt;\n\n&lt;p&gt;Sometimes guys will do loserish things, like let a girl treat them badly or repeatedly pursue a girl who doesn’t care about them, and justify it by saying “I don’t really care about her, I just want to fuck.” This is a bad idea, because even though you consciously think you “don’t give a fuck,” by pursuing her, you become emotionally invested, and by allowing her treat you like shit, you subconsciously re-wire your brain to feel like a beta male. Even if you didn&amp;#39;t give a fuck before, now you do. &lt;/p&gt;\n\n&lt;p&gt;You can’t control how you feel, but you can control what you do. Where your actions go, your feelings will follow, and where feelings go, your thoughts will follow. If you do loser things, you will eventually feel like a loser, even if you consciously tell yourself you “don’t give a fuck.” If a hot girl tries to strike a Faustian bargain with you and let you fuck her in return for treating you like shit, you must reject that deal out of respect for your own mental health. &lt;/p&gt;\n\n&lt;p&gt;Your brain works by making connections, and when you focus your thoughts and emotions on something, your brain starts connecting that thing to other things in your brain, and that thing becomes “enmeshed” in your wiring, creating a deeper web that is hard to untangle. For example, if you date a really hot girl, your brain will start to associate her with sexual pleasure, or ego, or fun times, and other things you like, so when she dumps you, you will think of her constantly. &lt;/p&gt;\n\n&lt;p&gt;The definition of “not giving a fuck” is only keeping positive thoughts and emotions in your head, and cutting out people, places, activities, thoughts, media, etc... that are negative. “Not giving a fuck” is not about being cold, aloof, an asshole, or stupid, but by filing your thoughts and emotions only with positive things that deserve to be there. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Why is emotional investment unattractive?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Emotional investment is an immediate turn-off. It doesn’t matter why, but I can guess some reasons. &lt;/p&gt;\n\n&lt;p&gt;First, emotional investment is unattractive because people are attracted to lives that are more interesting, exciting, higher, and better than our own. We just assume that somebody living a better life than us is going to be thinking and feeling about their awesome life, not us. If a woman knows she occupies your thoughts and emotions, she will assume your life sucks. She wants to fixate her thoughts and emotions on something higher, but if your thoughts and emotions are fixated on her, she’s back where she started. &lt;/p&gt;\n\n&lt;p&gt;For example, a girl that plays soccer will be attracted to guys that are better at soccer than her because they will appeal to the part of her thoughts and emotions that are invested in soccer. I&amp;#39;m not saying she will never become emotionally invested in a guy who is worse at soccer than she is - she may invest in a guy for other reasons - but the guy is playing with a disadvantage. &lt;/p&gt;\n\n&lt;p&gt;Second, emotional investment is unattractive because, simply put, emotions are bad and scary. Our society acts like “love” is an emotion and “our true selves” are our emotions, but that’s bullshit. Our value lies in what we can do when we are rational, what we’ve learned in our life, what we know how to do, and what we strive to achieve and be when we are clear-headed. Emotions are temporary and fleeting; but true love is a rational, credible commitment to your beloved’s well-being. In his dialogue the Phaedrus, the Greek philosopher Plato said that emotional love is a kind of madness – when things are going well, you are irrationally nice to the person out of proportion to what they deserve. When things are going badly, you are irrationally nasty to the person out of proportion to what they deserve. Women know that when you are irrationally nice to them you will eventually be irrationally shitty. &lt;/p&gt;\n\n&lt;p&gt;Most of our emotions are selfish, irrational, unrealistic, uncontrollable, and oftentimes downright evil. Emotions are fundamentally needy: they always want something, even if the “want” is to help somebody. If you see a beautiful woman and think “I like her, and I want to make her happy and do nice things for her,” you’re lying to yourself. You want things FROM her. You want to fuck her, use her for an ego boost, have your friends see you with her, and make yourself feel better for being a “good person.” You don’t want to see her run off and be happy with another guy, you want her to be unhappy with you. When you show emotion women subconsciously know you want something and that puts pressure on them, and they run away. Women sometimes will hang out with guys they don’t like or aren’t attracted to in any way, just because those guys are not emotionally invested and are not putting any pressure on them.  &lt;/p&gt;\n\n&lt;p&gt;When you become extremely emotional, you fantasize about getting your beloved back or hurting them for the wrongs they did to you, you stalk them, you act weird, you feel depressed, you can’t function, etc… Love songs glorify these feelings, but these are not healthy feelings. They are signs of weakness. Women have these feelings things too (oftentimes much more deeply than men), and they know it’s a scary pit to be in, so if they sense for even a second that a man is feeling these things (or is even just slightly beginning to feel these things), they run away immediately. Women want an emotional rock. They want the lifeguard on the edge of the pool pulling them out, not somebody drowning with them. &lt;/p&gt;\n\n&lt;p&gt;Women also take longer to get emotionally invested in men than men take to get emotionally invested in women. Men evolved to seek “fertile” women (big ass, big tits, healthy face) to impregnate as soon as possible. Women, on the other hand, evolved to find the strongest man in the tribe that could protect her and her baby, so they seek a larger group of traits, many of which are long-term traits (confidence, dominance, emotional stability, intelligence, etc…). It takes a woman time to figure out if a guy has these traits but a man can immediately be attracted to a hot girl. In every man-woman relationship there is a period of time where the man is emotionally invested, but the woman is still “rational” and feeling the guy out. Many men fuck it up here – they start acting creepy, or weird, overly nice, overly fixated, and the woman, who feels nothing, thinks the guy isweird or worse. &lt;/p&gt;\n\n&lt;p&gt;Of course, emotions are a part of life and can be beautiful if channeled correctly. But you shouldn’t show your emotions to a woman until she has also developed those emotions. &lt;/p&gt;\n\n&lt;p&gt;Third, emotional investment makes you stupid and saps you of your vitality and awesomeness. Tons interesting, smart, funny, cool, successful guys become vacant shells of their normal selves around women, partly because their thoughts and emotions are empty of everything that makes them awesome. If you are deep in a game of chess and I try to have a conversation with you about quantum physics you will sound stupid because your thoughts and emotions are full of chess. Seduction requires intelligence and creativity, but if your thoughts and emotions are just “durr, she’s a pretty woman” you’re going to fail. Because women are “rational” longer than men, they want to have rational, intelligent conversations about interesting shit. &lt;/p&gt;\n\n&lt;p&gt;Another reason is power. It’s a sad fact of life, but humans are wired to look at relationships in power terms. We subconsciously rank everybody in a particular social situation from least to most powerful. Women are much more aware of the power dynamic because they are generally less powerful than men. And unfortunately, we subconsciously see emotional people as lower in the power hierarchy. The German philosopher Friedrich Nietzsche said, correctly in my opinion, that individuals higher in the social hierarchy do not feel emotions for people lower than them. The lower ranked apes evolved to obey and be obsessed with the alpha male because they need his protection and resources, but the alpha male feels nothing for the lower ranked apes because he does not need them for anything. &lt;/p&gt;\n\n&lt;p&gt;Most importantly, women are not attracted to emotionally invested men because women are attracted to RESILIENCE. Resilience here means “the ability to confidently pursue your goals and not let anything or anybody perturb you.” &lt;/p&gt;\n\n&lt;p&gt;Women are attracted to resilience because they naturally want a protector, and a protector’s commitment is only credible if he cannot be thrown off of his mission, whatever that mission is. If a protector becomes emotional, dishonest, distracted, or submissive, he can no longer be trusted to protect. We subconsciously see emotional people as weak because they can be easily controlled. If a guy is emotional about a girl, he is likely to agree with whatever she says, let her get away with bad behavior, etc… &lt;/p&gt;\n\n&lt;p&gt;If a protector wavers for even a second, the woman becomes anxious and fearful, but a confident man with boundaries is not scared and cannot be thrown off of his mission. You must be a brick wall that cannot be moved or affected: if you approach her or escalate with her, it is purely based on your own desire, not her cajoling. At every moment you should think to yourself “am I doing this because I want to or because I am trying to impress her”? Sometimes you need to monitor her emotional investment on a moment-by-moment basis. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Subconscious communication&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;Women can quickly sense by your body language, words, demeanor, tone of voice and actions whether you are emotionally invested. Neither you nor her may consciously know you’re invested, but you will just “feel” unattractive to her. Sometimes very subtle changes in behavior (staring too long, asking a question that is too intrusive too early) can tip off that you are too invested. &lt;/p&gt;\n\n&lt;p&gt;I use the “gravity theory” to gauge emotional investment. In social settings, high-value people are “bigger” and therefore “draw” lower-value people to them. If you look at any party, you will see hot girls usually in the center, relaxing and having fun, and guys literally surrounding them like planets around the sun. There is a reason these guys are called “orbiters.” If the girl gets up to leave, the guys may play it cool for a while, but they then get up to follow her. Your ultimate goal is to become the center of gravity so women are drawn to you, not vice versa, which is hard, because as a man you must approach. But even if you approach your demeanor and body language can exude the message of “I am the center of gravity, and I create a rip in space-time that compels you to come to me.” &lt;/p&gt;\n\n&lt;p&gt;The subconscious subtext of an interaction is 99%. For example, the sentence “can I buy you a drink” can have a wide range of subconscious meanings depending on the tone, body language, context and emotion I deliver them in. “Can I buy you a drink” can mean “I want to fuck you,” “I feel like I owe you something and I want to pay you back,” “I’m a generous guy and I like to just people free things,” “you’re a good friend, and I want to show my appreciation,” “I’m a loser and I want to make you like me by buying you things,” etc… What matters is not your superficial words, but your subconscious context. &lt;/p&gt;\n\n&lt;p&gt;Because seduction is mostly subconscious, I can’t teach you every detail of the walk, speaking style, body language, demeanor, etc… of a guy who is not emotionally invested. Even if I did, it’s too much for you to remember and process. I even doubted the efficacy of writing this article because it’s incredibly hard to “fake” an emotional state for a long period of time and most people will go back to behaving like what they feel they are.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The paradox of escalation&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;So far it sounds like the right solution to get girls would be to just ignore them completely. You won’t look emotionally invested, right? Unfortunately, that doesn’t work. It is the man’s responsibility to approach and escalate because women do not get emotionally invested quickly and are afraid of rejection. &lt;/p&gt;\n\n&lt;p&gt;To get a girl attracted to you, you must show at least some initial interest and escalate, luring her into becoming emotionally invested in you. Magicians use a technique called “forcing,” where they trick the person into thinking they are picking a random card out of the deck when the person is really picking the card the magician wanted them to pick. Seduction is similar: she should feel like she is picking you, not vice-versa. You are just opening the door to her. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The challenge of seduction&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Seducing a woman while you appear not emotionally invested is incredibly challenging. First, women’s aversion to emotional investment is mostly subconscious – consciously, women want the guy to show at least some interest. And it’s naturally hard to hang around a woman you like for a long period of time and not become invested to at least some degree. Beautiful women create a reality distortion field where men lose all concept of rationality, truth, normal standards of right and wrong, etc… You can say “you’re overthinking this, just be yourself,”, but women touch men’s strongest emotion, so many men literally forget how be themselves. When a beautiful woman walks into a nightclub a swarm of otherwise successful, rational, manly men immediately lose their fucking minds. They start begging for her approval, trying to buy her things, acting stupid, etc… &lt;/p&gt;\n\n&lt;p&gt;And like I said earlier, men emotionally invest quicker than women, so we must be patient because our emotions push us to jump the gun and get right into lovey-dovey mode. And in non-romantic contexts, people become emotionally invested at the same rate, so you are used to the other person feeling the same as you if the interaction is going well. And when we feel emotionally invested in somebody, we naturally are going to want to elicit a positive emotional response. But trying to make a woman happy that is not emotionally invested comes off as validation-seeking, supplicating, bitch behavior. You must instead do what is RIGHT. A woman may seem cold, and we may think we can “warm her up” by being “nice” to her, but we should really just pursue our mission and have faith that she will emotionally invest even though she appears on the surface to not be attracted or care about you. Remember: women are constantly sizing you up, so even if they don’t look like they are attracted or paying attention, they are. &lt;/p&gt;\n\n&lt;p&gt;Seduction is a gamble because you must have faith that eventually the woman will start to emotionally invest, knowing she might not. Sometimes she just won’t like you. Sometimes she just wants attention. Sometimes she is in love with you but won’t let it on. Some women are damaged and never emotionally invest in anybody – they see all men as objects to be used. This is why you must assume attraction – because you DON’T KNOW. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;How to not be emotionally invested&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If you take away one thing from this article, it is this: a woman who is not yet invested in you must not occupy a big part of your thoughts and emotions. You must have your mind and heart on other things when interacting with women. Period. If she hasn’t made room for you in her head and heart yet, you shouldn’t make space for her in your head and heart. If you make this change right now, I promise your results will instantly improve. Women are the dessert to a good life, not the main course, and that’s how women should feel when you are talking to them. WOMEN WANT TO BE DESSERT.&lt;/p&gt;\n\n&lt;p&gt;Here are my main steps to not becoming emotionally invested:&lt;/p&gt;\n\n&lt;p&gt;1)      Realize you don’t need to emotionally invest&lt;/p&gt;\n\n&lt;p&gt;2)      Have an interesting and awesome life that occupies your thoughts and emotions.&lt;/p&gt;\n\n&lt;p&gt;3)      Have “abundance mentality” with respect to women.&lt;/p&gt;\n\n&lt;p&gt;4)      Have boundaries and be unperturbable.&lt;/p&gt;\n\n&lt;p&gt;5)      Focus on your own fun first.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Realize you don’t need to emotionally invest&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This may be the most important step. I think a lot of guys emotionally invest in girls because society and pop culture subconsciously make us think that for a man to get a girl, he must supplicate to her and emotionally invest in her. In the movies, the confident, successful guy living his own life never gets the girl; instead the winner is the loser who falls in love with her from afar, and then spends the rest of the movie trying to “get” her, enduring multiple rejections and humiliations. These movies also teach that women are delicate flowers that need constant coddling and lovey dovey bullshit. That’s not how it works in the real world. &lt;/p&gt;\n\n&lt;p&gt;Men also misunderstand women’s aversion to rejection. Women have a strong need to be “accepted” and therefore are often much more sensitive to rejection than men. The phrase “hell hath no fury like a woman scorned” is true. Dread game and “ignoring” women only works if she is ignoring you first. But if you outright reject her, or if she makes a move on you, or asks for acceptance, and you say “no” or she feels like you are ignoring her there is a strong chance she will emotionally “un-invest.” Because women have this strong need for constant acceptance and validation, men mistakenly think they must emotionally invest. But all you really need to do is not reject her or make her feel excluded. It’s a thin line between keeping a woman “accepted” and emotionally investing in her. &lt;/p&gt;\n\n&lt;p&gt;To win this game, you should only do something for a woman if the woman would do it for you. If you want to buy her a drink, think about whether she would buy you a drink. If she wouldn’t, don’t. If she wants you to wait for her, think about whether she would wait for you. If she wouldn’t, don’t. If there is a girl you always say hi to, but she never says hi to you, stop saying hi to her. She knows who you are, she can say hi to you. It’s ok to “win” in relationships. &lt;/p&gt;\n\n&lt;p&gt;Again, this is easier said than done. Society and your emotions team up to make you feel like you need to follow girls around, wait for them, put up with their bullshit, buy them drinks, etc… You must fight your feelingss and social training and have faith that if you stay the course women will become attracted. This requires the ability to say “no” to a woman (saying “no” is different than rejecting her) and the ability to walk away from her, even permanently. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Have an interesting and awesome life that occupies your thoughts and emotions&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Humans are wired to seek good feelings. If the main part of our life is not making us happy (job, school, our hobbies), we get those good feelings from other sources: drugs, trashy TV, women, food, etc… All those things are not bad by themselves, but if your regular life doesn’t make you happy, you will overly emotionally invest in bad things and become addicted and depressed. If your life is miserable, you will subconsciously and unknowingly immediately start overly investing in women.&lt;/p&gt;\n\n&lt;p&gt;I use the “cheese pizza method.” Whenever I feel like I’m getting too emotional, I fill my thoughts and emotions with something I love – cheese pizza, Oreo cheesecake, the day I did mushrooms at the beach, reading about dinosaurs stoned, etc... This clears my head and allows me to act “normal” around women. When I am thinking about doing something for a girl I ask myself “what has she done to dislodge cheese pizza out of my heart and mind?” You can replace cheese pizza with anything, ideally an incredible, thrilling life that she would want to join. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Have abundance mentality with respect to girls&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;No matter how awesome your life is, it is hard to not emotionally invest in girls. Abundance mentality is when your thoughts and emotions are full of other women, so you don’t need this one girl. If you don’t have other girls, you need to delude yourself. I recall times when I did have abundance and put myself back in that mental space. If you’ve never had abundance, imagine you are Brad Pitt or some other celebrity and think about how he would feel and act.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Have boundaries and be unperturbable&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Women want you to be an immovable wall that confidently and joyfully pursues his mission. She will try to perturb you from that mission, not because she wants to see you fail, but because she wants to test whether you are actually a brick wall or a façade for something softer. The same way you knock on a desk at the furniture store to see if it is real wood, a woman shit tests you to see if you are actually confident enough to pursue your mission or if you will be perturbed. And the more confident and immovable you are, the stronger the shit tests become. This is true even if the mission is getting her! As long as she is into it, you need to escalate as if you already know she will say yes.&lt;/p&gt;\n\n&lt;p&gt;Your mission, when out, should be maximum fun. She should sense that your emotional investment is “where’s the party? Where’s the next fun thing?” You should have a plan for the entire night: I’m going to X, then I’m going to Y , etc… You should not let the woman hijack your plans and take the lead. Your primary mission (career, hobbies, etc…) should also be in your head. Remember the song “girls just wanna have fun?” In truth, everybody just wants to have fun but boys are wracked with anxiety because they are trying to impress girls. Whenever you are feeling nervous, scared, anxious or like you are emotionally investing too much in a girl, just say to yourself “I’m here to have fun. If you contribute, great. If not, you are dismissed.” Fun and positivity always win. &lt;/p&gt;\n\n&lt;p&gt;Example: If a beautiful woman is talking about something incredibly boring most men pretend to be interested. Wrong! Women know when they are being boring and it is sometimes a subtle shit test to see if you will let her get away with it. Women are not desperate for sex and they do not need to hang around if a guy is being boring, stupid or mean, and they cannot respect or empathize with a guy who would put up with bullshit from her. Men let women be boring when they lose their vision of the good life. A good life involves beautiful women, but it also involves interesting conversations. If you aren’t getting interesting conversations from her, you would leave because you have options. Whenever a woman is being boring, I change the subject just to let her know I don’t tolerate bullshit.  &lt;/p&gt;\n\n&lt;p&gt;By having a vision of the good life, boundaries, and confidence that your life, thoughts and emotions are interesting and valuable, you can challenge and stimulate a woman. Women want a man that will help them grow and introduce them to a better life and more interesting world than the one they currently inhabit. They don’t want some a that agrees with everything they say, a pushover, or a simple-minded conformist.  Women want a guy who is willing to walk away at any time, not because he is some cold-hearted psychopath, but because once a man shows that is he NOT willing to walk away at any time, there is no challenge or growth. &lt;/p&gt;\n\n&lt;p&gt;Of course, for most of you, this is very difficult. Many of you have uninteresting lives so a beautiful woman would instantly become the most interesting and important thing your life or you are so sex starved and desperate that you don’t care if a woman is being boring, or mean, or uninterested, or whatever. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Focus on your own fun first&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Imagine you paid $500,000 to spend a week with Leonardo DiCaprio (or whatever celebrity you think lives an awesome life) and when you get there Leonardo says “tell us what we should do?” You would say “I don’t know, what are the options?” and Leo goes “I don’t have anything planned – let’s just do what you were gonna do.” You would be pissed! You want to become part of Leo’s awesome life, not make your own plan. That’s how girls feel when men don’t have a plan. They want to join your life, not lead you around in their life. That’s why you need to focus on your own fun first. You may like you are being rude or selfish, but you’re not, because women are more attracted to the act of leading than the destination necessarily. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;How to make her emotionally invest in you&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;For a woman to emotionally invest in you, certain shit must happen: &lt;/p&gt;\n\n&lt;p&gt;1)  She must “like” you – i.e., she must find you pleasant, friendly, good-looking, compatible with her values and interests. &lt;/p&gt;\n\n&lt;p&gt;2)  She must feel an emotional connection with you.&lt;/p&gt;\n\n&lt;p&gt;3)  She must feel accepted by you. If she you are rejecting her, ignoring her, or being hostile, she will not emotionally invest. &lt;/p&gt;\n\n&lt;p&gt;4)  She must watch you be confident and resilient. &lt;/p&gt;\n\n&lt;p&gt;5)  She needs to spend time around you. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;She must like you&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This one is self-explanatory. Women are usually not going to invest in you if you don’t share their interests, values, goals, etc… Some girls want a rapper covered in tattoos, others want a nerdy guy who watches Star Wars. If you’re a versatile guy with lots of interests, a lot more women will like you, but some people just aren’t compatible. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;She must feel an emotional connection with you&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The key to developing an emotional connection with a girl is experiencing emotionally exciting things together. The ultimate is of course, passionate sex, but a good concert, a deep conversation, even a beer pong game you guys play together can help build an emotional connection. &lt;/p&gt;\n\n&lt;p&gt;Another way to build an emotional connection is for her to vicariously experience your confidence. She wants you to be her emotional rock, so she would like to project her insecurities and fears onto you, and watch you brush them off as if they were nothing. She also wants to watch you take the lead and make the night fun. &lt;/p&gt;\n\n&lt;p&gt;A woman has emotional energy, and that energy must be directed towards something or somebody. You want that energy to be directed to you. The easiest way to do this is just by spending time around her. Just “being around” will help build attraction as long as you are not fucking it up by being needy or making her feel bad. The best way to get women to like you is to be “forced” to be around them, such as work or a group hangout, where you do not supplicate to them or validate yourself to them. My friend used to take girls out on his boat, and these girls would usually end up liking me by the end of the day because we would have spent all day together. Celebrities get so much tang because women watch them in movies or listen to their music and become emotionally invested, whereas the celebrity shows the women no emotional investment in all. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;She must feel accepted by you.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Again, hell hath no fury like a woman scorned, so it must feel like the door to you is open. As she invests in you more, you must escalate more. You can fuck this up by being an asshole, not being sensitive to her emotions, and not reading her advances correctly. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;She must watch you confidently pursue your goals&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The word confidence comes from the Latin con (with) + fidens (faith). A man with confidence has faith that he will succeed in whatever he does and cannot be stopped by anybody. Women get turned by watching a man confidently pursue his mission. Why are women w so attracted to DJs, promoters, and drug dealers in the club? Those guys aren’t exactly the “cream” of society. It’s because those guys are the only people at the club actually doing something. All the other guys are just sitting there drooling over the girls, instantly reducing their attractiveness. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Putting it all together&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;To apply all this knowledge, my strategy is to adopt a rational, almost businesslike demeanor, at least in the early stages of the interaction. As I said earlier, women are “rational” at the beginning before they are emotionally invested, so you should also be rational. A man must act almost like he is a woman: he is interested in a relationship (or maybe even just sex) but he has high standards and must evaluate the woman thoroughly first and make sure she is suitable before he gets emotionally invested. You should act like your actions are guided by a seduction computer that makes all the decisions based on the available information, not your emotions. &lt;/p&gt;\n\n&lt;p&gt;One technique is called “disinterested interest.” Your rational words should show interest and enthusiasm but you must communicate the “emotion” of “I’m just talking to you to be nice, I am not totally emotionally invested in you yet and I could walk away at any moment.” The best way to do this is by keeping your thoughts and emotions focused on something else, other than her. &lt;/p&gt;\n\n&lt;p&gt;You should not, however, stay completely rational. You must allow yourself to show your emotions about things that are not her: your passions, your interests, your friends, etc… And you can show emotion towards her if she deserves it: laugh if she says something funny, thank her if she does something nice, sympathize with her if she says something sad: just don’t let on that you feel emotional about “her” unconnected to anything she is or has done. &lt;/p&gt;\n\n&lt;p&gt;And of course, escalate sexually. Paradoxically, it is possible to escalate sexually and not appear emotionally invested. In fact, a lot of women (especially damaged ones) are looking for emotionless sex. You must touch her, you must turn the conversation sexual, you must do “seductive” things like look into her eyes and whisper in her ear, etc… And you must confidently take the lead in the conversation and the situation in general, leading her from place to place, getting intimate with her, etc… And when she starts to emotionally invest, make her feel like you MIGHT emotionally invest too (but not as much as her). Sometimes if you play it “too” cool she will think you just like her platonically or that you lost interest. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;A broader view&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This article is obviously about getting girls, but the principles are applicable in all areas of your life. Simply put, you should not invest your thoughts and emotions into people, places, institutions, and activities that do not give a fuck about you and/or do not produce a return that equals the investment you put into them. One of the biggest mistakes people make is investing too much in their job, friendship, hobbies, etc..., and getting 0 out of it. &lt;/p&gt;\n\n&lt;p&gt;Additionally, whatever you do becomes your emotional investment. If you spend every weekend hanging out with piece of shit people that just do drugs, complain and make bad decisions, guess what, you are now becoming a piece of shit person. You are what you do. &lt;/p&gt;\n\n&lt;p&gt;Follow me on twitter: &lt;a href=\"http://www.twitter.com/woujo3\"&gt;http://www.twitter.com/woujo3&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Go to my website: &lt;a href=\"http://www.woujo.com\"&gt;http://www.woujo.com&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I hate it when people try to oversimplify pick-up, but if I had to boil down pick up into one principle every man should understand, it is this: The woman must be more emotionally invested in you than you are in her at every stage of the relationship. I call this the IRON LAW OF SEDUCTION. \n\nUnderstanding and correctly applying this law will solve 99% of the problems men have with women. She’s not responsive to your advances? Not emotionally invested enough. Not returning your calls? Not emotionally invested enough. Flaking? Not emotionally invested enough. On the flipside, as a man, if you emotionally divest yourself from girls, you solve most your own problems. Outcome dependent? You are too emotionally invested in getting laid. Approach anxiety? You are too emotionally invested in the success of the interaction. Neediness and desperation? You are emotionally invested in getting girls. Suck at conversations? You are too emotionally invested in getting laid and can’t just have a regular conversation. \n\nEmotional investment is subconsciously communicated and women evolved to sense it. One guy can talk to a girl all night without her feeling like he is emotionally invested, but another can talk to her for 2 seconds and get auto-rejected for being too invested. Of course, a woman may talk to you, hang out with you, fuck you, or even date you for a long time if she’s not emotionally invested because she’s horny, crazy, lonely, desperate, drunk, bored, want something from you, etc.... But if she’s not emotionally invested, you are on thin ice and vulnerable at any time to flaking or going cold.  \n\n**What is emotional investment?**\n\nEmotional investment is occupying one’s thoughts and emotions. It is not the same as being interested or “liking” somebody. I “like” a lot of people but I don’t “feel” anything for them and it wouldn’t hurt my feelings if they rejected me or even died.  This distinction is why women flake. Women “like,” get “interested,” and give their numbers to lots of guys, but if she is not at least a little emotionally invested she will not be motivated to get out of bed, put on her make-up, and come somewhere to meet you. Unlike men, women get invited to shit all the time by guys they “like” so they are not going to care about meeting you unless there is some emotional investment.  \n\nThink about emotional investment like this: like most men, you probably like Lamborghinis. But like most men, you probably don’t have one, and you probably don’t spend all day thinking about Lamborghinis and being sad because you don’t have one. But if I lent you a Lamborghini for two months and you drove it around, took care of it, showed it off to your friends, and got laid because of it, you would be sad when I take it back. It’s irrational, but you would get emotionally invested in the Lambo even if you weren’t sad when you never had one. Because you became attached to it and it gave you a sense of identity and power, the Lambo took up space in your thoughts and emotions, making you emotionally invested. \n\nEmotional investment in people is similar. Being around somebody awesome and feeling like they “belong” to you  becomes addictive like crack. An awesome man makes a woman feel special, loved, important, powerful, and cool. An awesome man is also fun, positive, confident, carefree, and dominant, easing the woman’s anxieties and insecurities. Being around an awesome guy is literally like a drug to women, and if they are around you long enough, they become hooked. \n\n**The Ben Franklin Theory**\n \nBen Franklin, one of America’s founding fathers and greatest poonhounds, famously and counterintuitively discovered that if person A does something for person B, person A will like person B more. Most people would assume the opposite – if you want people to like you, you should do things for them, so person B should like person B more! Right? Wrong!\n\nPerson A “likes” person B more because person A has become emotionally invested. Maybe person A subconsciously expects person B to do something nice back. Maybe person A subconsciously see themselves as “beneath” person B in the ape hierarchy. Maybe person A is protecting their own ego – person B must be somebody special if even I did something for them! Or maybe the simple act of doing something for person B caused person B to enter person A’s thoughts and emotions.\n \nWhatever the psychological mechanism, when a woman really likes you, she will WANT to do stuff for you, sometimes even aggressively, and she will WANT to emotionally invest while you fantasize about other things. When a woman really likes you is when you realize that needy, supplicating, validating behavior is not necessary. I have friends that are strippers, and their job is basically to hustle men out of money and to trick guys into buying shit for them. I don’t buy girls things, ever, (and I never, ever visit my friends at work) and I notice that when these strippers start to like me they buy me shit, clean my house, do me favors, etc... One night I even got into an argument with a stripper because she bought me 5 drinks in a row and she wouldn’t let me buy her a drink in return. That’s emotional investment.    \n \n**The Woujo Theory**\n \nAccording to my corollary of the Franklin theory, supplicating to a woman, validating yourself to a woman, buying a woman things, following a woman around, allowing a woman to treat you like shit, and spending too much time trying to “help” a woman who doesn’t deserve it subconsciously will cause you to become emotionally invested in her and feel “beneath” her.\n \nSometimes guys will do loserish things, like let a girl treat them badly or repeatedly pursue a girl who doesn’t care about them, and justify it by saying “I don’t really care about her, I just want to fuck.” This is a bad idea, because even though you consciously think you “don’t give a fuck,” by pursuing her, you become emotionally invested, and by allowing her treat you like shit, you subconsciously re-wire your brain to feel like a beta male. Even if you didn't give a fuck before, now you do. \n\nYou can’t control how you feel, but you can control what you do. Where your actions go, your feelings will follow, and where feelings go, your thoughts will follow. If you do loser things, you will eventually feel like a loser, even if you consciously tell yourself you “don’t give a fuck.” If a hot girl tries to strike a Faustian bargain with you and let you fuck her in return for treating you like shit, you must reject that deal out of respect for your own mental health. \n\nYour brain works by making connections, and when you focus your thoughts and emotions on something, your brain starts connecting that thing to other things in your brain, and that thing becomes “enmeshed” in your wiring, creating a deeper web that is hard to untangle. For example, if you date a really hot girl, your brain will start to associate her with sexual pleasure, or ego, or fun times, and other things you like, so when she dumps you, you will think of her constantly. \n\nThe definition of “not giving a fuck” is only keeping positive thoughts and emotions in your head, and cutting out people, places, activities, thoughts, media, etc... that are negative. “Not giving a fuck” is not about being cold, aloof, an asshole, or stupid, but by filing your thoughts and emotions only with positive things that deserve to be there. \n\n**Why is emotional investment unattractive?**\n\nEmotional investment is an immediate turn-off. It doesn’t matter why, but I can guess some reasons. \n\nFirst, emotional investment is unattractive because people are attracted to lives that are more interesting, exciting, higher, and better than our own. We just assume that somebody living a better life than us is going to be thinking and feeling about their awesome life, not us. If a woman knows she occupies your thoughts and emotions, she will assume your life sucks. She wants to fixate her thoughts and emotions on something higher, but if your thoughts and emotions are fixated on her, she’s back where she started. \n\nFor example, a girl that plays soccer will be attracted to guys that are better at soccer than her because they will appeal to the part of her thoughts and emotions that are invested in soccer. I'm not saying she will never become emotionally invested in a guy who is worse at soccer than she is - she may invest in a guy for other reasons - but the guy is playing with a disadvantage. \n\nSecond, emotional investment is unattractive because, simply put, emotions are bad and scary. Our society acts like “love” is an emotion and “our true selves” are our emotions, but that’s bullshit. Our value lies in what we can do when we are rational, what we’ve learned in our life, what we know how to do, and what we strive to achieve and be when we are clear-headed. Emotions are temporary and fleeting; but true love is a rational, credible commitment to your beloved’s well-being. In his dialogue the Phaedrus, the Greek philosopher Plato said that emotional love is a kind of madness – when things are going well, you are irrationally nice to the person out of proportion to what they deserve. When things are going badly, you are irrationally nasty to the person out of proportion to what they deserve. Women know that when you are irrationally nice to them you will eventually be irrationally shitty. \n\nMost of our emotions are selfish, irrational, unrealistic, uncontrollable, and oftentimes downright evil. Emotions are fundamentally needy: they always want something, even if the “want” is to help somebody. If you see a beautiful woman and think “I like her, and I want to make her happy and do nice things for her,” you’re lying to yourself. You want things FROM her. You want to fuck her, use her for an ego boost, have your friends see you with her, and make yourself feel better for being a “good person.” You don’t want to see her run off and be happy with another guy, you want her to be unhappy with you. When you show emotion women subconsciously know you want something and that puts pressure on them, and they run away. Women sometimes will hang out with guys they don’t like or aren’t attracted to in any way, just because those guys are not emotionally invested and are not putting any pressure on them.  \n\nWhen you become extremely emotional, you fantasize about getting your beloved back or hurting them for the wrongs they did to you, you stalk them, you act weird, you feel depressed, you can’t function, etc… Love songs glorify these feelings, but these are not healthy feelings. They are signs of weakness. Women have these feelings things too (oftentimes much more deeply than men), and they know it’s a scary pit to be in, so if they sense for even a second that a man is feeling these things (or is even just slightly beginning to feel these things), they run away immediately. Women want an emotional rock. They want the lifeguard on the edge of the pool pulling them out, not somebody drowning with them. \n\nWomen also take longer to get emotionally invested in men than men take to get emotionally invested in women. Men evolved to seek “fertile” women (big ass, big tits, healthy face) to impregnate as soon as possible. Women, on the other hand, evolved to find the strongest man in the tribe that could protect her and her baby, so they seek a larger group of traits, many of which are long-term traits (confidence, dominance, emotional stability, intelligence, etc…). It takes a woman time to figure out if a guy has these traits but a man can immediately be attracted to a hot girl. In every man-woman relationship there is a period of time where the man is emotionally invested, but the woman is still “rational” and feeling the guy out. Many men fuck it up here – they start acting creepy, or weird, overly nice, overly fixated, and the woman, who feels nothing, thinks the guy isweird or worse. \n\nOf course, emotions are a part of life and can be beautiful if channeled correctly. But you shouldn’t show your emotions to a woman until she has also developed those emotions. \n\nThird, emotional investment makes you stupid and saps you of your vitality and awesomeness. Tons interesting, smart, funny, cool, successful guys become vacant shells of their normal selves around women, partly because their thoughts and emotions are empty of everything that makes them awesome. If you are deep in a game of chess and I try to have a conversation with you about quantum physics you will sound stupid because your thoughts and emotions are full of chess. Seduction requires intelligence and creativity, but if your thoughts and emotions are just “durr, she’s a pretty woman” you’re going to fail. Because women are “rational” longer than men, they want to have rational, intelligent conversations about interesting shit. \n\nAnother reason is power. It’s a sad fact of life, but humans are wired to look at relationships in power terms. We subconsciously rank everybody in a particular social situation from least to most powerful. Women are much more aware of the power dynamic because they are generally less powerful than men. And unfortunately, we subconsciously see emotional people as lower in the power hierarchy. The German philosopher Friedrich Nietzsche said, correctly in my opinion, that individuals higher in the social hierarchy do not feel emotions for people lower than them. The lower ranked apes evolved to obey and be obsessed with the alpha male because they need his protection and resources, but the alpha male feels nothing for the lower ranked apes because he does not need them for anything. \n\nMost importantly, women are not attracted to emotionally invested men because women are attracted to RESILIENCE. Resilience here means “the ability to confidently pursue your goals and not let anything or anybody perturb you.” \n\nWomen are attracted to resilience because they naturally want a protector, and a protector’s commitment is only credible if he cannot be thrown off of his mission, whatever that mission is. If a protector becomes emotional, dishonest, distracted, or submissive, he can no longer be trusted to protect. We subconsciously see emotional people as weak because they can be easily controlled. If a guy is emotional about a girl, he is likely to agree with whatever she says, let her get away with bad behavior, etc… \n\nIf a protector wavers for even a second, the woman becomes anxious and fearful, but a confident man with boundaries is not scared and cannot be thrown off of his mission. You must be a brick wall that cannot be moved or affected: if you approach her or escalate with her, it is purely based on your own desire, not her cajoling. At every moment you should think to yourself “am I doing this because I want to or because I am trying to impress her”? Sometimes you need to monitor her emotional investment on a moment-by-moment basis. \n\n**Subconscious communication** \n\nWomen can quickly sense by your body language, words, demeanor, tone of voice and actions whether you are emotionally invested. Neither you nor her may consciously know you’re invested, but you will just “feel” unattractive to her. Sometimes very subtle changes in behavior (staring too long, asking a question that is too intrusive too early) can tip off that you are too invested. \n\nI use the “gravity theory” to gauge emotional investment. In social settings, high-value people are “bigger” and therefore “draw” lower-value people to them. If you look at any party, you will see hot girls usually in the center, relaxing and having fun, and guys literally surrounding them like planets around the sun. There is a reason these guys are called “orbiters.” If the girl gets up to leave, the guys may play it cool for a while, but they then get up to follow her. Your ultimate goal is to become the center of gravity so women are drawn to you, not vice versa, which is hard, because as a man you must approach. But even if you approach your demeanor and body language can exude the message of “I am the center of gravity, and I create a rip in space-time that compels you to come to me.” \n\nThe subconscious subtext of an interaction is 99%. For example, the sentence “can I buy you a drink” can have a wide range of subconscious meanings depending on the tone, body language, context and emotion I deliver them in. “Can I buy you a drink” can mean “I want to fuck you,” “I feel like I owe you something and I want to pay you back,” “I’m a generous guy and I like to just people free things,” “you’re a good friend, and I want to show my appreciation,” “I’m a loser and I want to make you like me by buying you things,” etc… What matters is not your superficial words, but your subconscious context. \n\nBecause seduction is mostly subconscious, I can’t teach you every detail of the walk, speaking style, body language, demeanor, etc… of a guy who is not emotionally invested. Even if I did, it’s too much for you to remember and process. I even doubted the efficacy of writing this article because it’s incredibly hard to “fake” an emotional state for a long period of time and most people will go back to behaving like what they feel they are.  \n\n**The paradox of escalation**\n\nSo far it sounds like the right solution to get girls would be to just ignore them completely. You won’t look emotionally invested, right? Unfortunately, that doesn’t work. It is the man’s responsibility to approach and escalate because women do not get emotionally invested quickly and are afraid of rejection. \n\nTo get a girl attracted to you, you must show at least some initial interest and escalate, luring her into becoming emotionally invested in you. Magicians use a technique called “forcing,” where they trick the person into thinking they are picking a random card out of the deck when the person is really picking the card the magician wanted them to pick. Seduction is similar: she should feel like she is picking you, not vice-versa. You are just opening the door to her. \n\n**The challenge of seduction**\n\nSeducing a woman while you appear not emotionally invested is incredibly challenging. First, women’s aversion to emotional investment is mostly subconscious – consciously, women want the guy to show at least some interest. And it’s naturally hard to hang around a woman you like for a long period of time and not become invested to at least some degree. Beautiful women create a reality distortion field where men lose all concept of rationality, truth, normal standards of right and wrong, etc… You can say “you’re overthinking this, just be yourself,”, but women touch men’s strongest emotion, so many men literally forget how be themselves. When a beautiful woman walks into a nightclub a swarm of otherwise successful, rational, manly men immediately lose their fucking minds. They start begging for her approval, trying to buy her things, acting stupid, etc… \n\nAnd like I said earlier, men emotionally invest quicker than women, so we must be patient because our emotions push us to jump the gun and get right into lovey-dovey mode. And in non-romantic contexts, people become emotionally invested at the same rate, so you are used to the other person feeling the same as you if the interaction is going well. And when we feel emotionally invested in somebody, we naturally are going to want to elicit a positive emotional response. But trying to make a woman happy that is not emotionally invested comes off as validation-seeking, supplicating, bitch behavior. You must instead do what is RIGHT. A woman may seem cold, and we may think we can “warm her up” by being “nice” to her, but we should really just pursue our mission and have faith that she will emotionally invest even though she appears on the surface to not be attracted or care about you. Remember: women are constantly sizing you up, so even if they don’t look like they are attracted or paying attention, they are. \n\nSeduction is a gamble because you must have faith that eventually the woman will start to emotionally invest, knowing she might not. Sometimes she just won’t like you. Sometimes she just wants attention. Sometimes she is in love with you but won’t let it on. Some women are damaged and never emotionally invest in anybody – they see all men as objects to be used. This is why you must assume attraction – because you DON’T KNOW. \n\n**How to not be emotionally invested**\n\nIf you take away one thing from this article, it is this: a woman who is not yet invested in you must not occupy a big part of your thoughts and emotions. You must have your mind and heart on other things when interacting with women. Period. If she hasn’t made room for you in her head and heart yet, you shouldn’t make space for her in your head and heart. If you make this change right now, I promise your results will instantly improve. Women are the dessert to a good life, not the main course, and that’s how women should feel when you are talking to them. WOMEN WANT TO BE DESSERT.\n\nHere are my main steps to not becoming emotionally invested:\n\n1)      Realize you don’t need to emotionally invest\n\n2)      Have an interesting and awesome life that occupies your thoughts and emotions.\n\n3)      Have “abundance mentality” with respect to women.\n\n4)      Have boundaries and be unperturbable.\n\n5)      Focus on your own fun first.\n\n**Realize you don’t need to emotionally invest**\n \nThis may be the most important step. I think a lot of guys emotionally invest in girls because society and pop culture subconsciously make us think that for a man to get a girl, he must supplicate to her and emotionally invest in her. In the movies, the confident, successful guy living his own life never gets the girl; instead the winner is the loser who falls in love with her from afar, and then spends the rest of the movie trying to “get” her, enduring multiple rejections and humiliations. These movies also teach that women are delicate flowers that need constant coddling and lovey dovey bullshit. That’s not how it works in the real world. \n \nMen also misunderstand women’s aversion to rejection. Women have a strong need to be “accepted” and therefore are often much more sensitive to rejection than men. The phrase “hell hath no fury like a woman scorned” is true. Dread game and “ignoring” women only works if she is ignoring you first. But if you outright reject her, or if she makes a move on you, or asks for acceptance, and you say “no” or she feels like you are ignoring her there is a strong chance she will emotionally “un-invest.” Because women have this strong need for constant acceptance and validation, men mistakenly think they must emotionally invest. But all you really need to do is not reject her or make her feel excluded. It’s a thin line between keeping a woman “accepted” and emotionally investing in her. \n\nTo win this game, you should only do something for a woman if the woman would do it for you. If you want to buy her a drink, think about whether she would buy you a drink. If she wouldn’t, don’t. If she wants you to wait for her, think about whether she would wait for you. If she wouldn’t, don’t. If there is a girl you always say hi to, but she never says hi to you, stop saying hi to her. She knows who you are, she can say hi to you. It’s ok to “win” in relationships. \n \nAgain, this is easier said than done. Society and your emotions team up to make you feel like you need to follow girls around, wait for them, put up with their bullshit, buy them drinks, etc… You must fight your feelingss and social training and have faith that if you stay the course women will become attracted. This requires the ability to say “no” to a woman (saying “no” is different than rejecting her) and the ability to walk away from her, even permanently. \n  \n**Have an interesting and awesome life that occupies your thoughts and emotions**\n \nHumans are wired to seek good feelings. If the main part of our life is not making us happy (job, school, our hobbies), we get those good feelings from other sources: drugs, trashy TV, women, food, etc… All those things are not bad by themselves, but if your regular life doesn’t make you happy, you will overly emotionally invest in bad things and become addicted and depressed. If your life is miserable, you will subconsciously and unknowingly immediately start overly investing in women.\n\nI use the “cheese pizza method.” Whenever I feel like I’m getting too emotional, I fill my thoughts and emotions with something I love – cheese pizza, Oreo cheesecake, the day I did mushrooms at the beach, reading about dinosaurs stoned, etc... This clears my head and allows me to act “normal” around women. When I am thinking about doing something for a girl I ask myself “what has she done to dislodge cheese pizza out of my heart and mind?” You can replace cheese pizza with anything, ideally an incredible, thrilling life that she would want to join. \n \n**Have abundance mentality with respect to girls**\n \nNo matter how awesome your life is, it is hard to not emotionally invest in girls. Abundance mentality is when your thoughts and emotions are full of other women, so you don’t need this one girl. If you don’t have other girls, you need to delude yourself. I recall times when I did have abundance and put myself back in that mental space. If you’ve never had abundance, imagine you are Brad Pitt or some other celebrity and think about how he would feel and act.\n\n**Have boundaries and be unperturbable**\n\nWomen want you to be an immovable wall that confidently and joyfully pursues his mission. She will try to perturb you from that mission, not because she wants to see you fail, but because she wants to test whether you are actually a brick wall or a façade for something softer. The same way you knock on a desk at the furniture store to see if it is real wood, a woman shit tests you to see if you are actually confident enough to pursue your mission or if you will be perturbed. And the more confident and immovable you are, the stronger the shit tests become. This is true even if the mission is getting her! As long as she is into it, you need to escalate as if you already know she will say yes.\n\nYour mission, when out, should be maximum fun. She should sense that your emotional investment is “where’s the party? Where’s the next fun thing?” You should have a plan for the entire night: I’m going to X, then I’m going to Y , etc… You should not let the woman hijack your plans and take the lead. Your primary mission (career, hobbies, etc…) should also be in your head. Remember the song “girls just wanna have fun?” In truth, everybody just wants to have fun but boys are wracked with anxiety because they are trying to impress girls. Whenever you are feeling nervous, scared, anxious or like you are emotionally investing too much in a girl, just say to yourself “I’m here to have fun. If you contribute, great. If not, you are dismissed.” Fun and positivity always win. \n\nExample: If a beautiful woman is talking about something incredibly boring most men pretend to be interested. Wrong! Women know when they are being boring and it is sometimes a subtle shit test to see if you will let her get away with it. Women are not desperate for sex and they do not need to hang around if a guy is being boring, stupid or mean, and they cannot respect or empathize with a guy who would put up with bullshit from her. Men let women be boring when they lose their vision of the good life. A good life involves beautiful women, but it also involves interesting conversations. If you aren’t getting interesting conversations from her, you would leave because you have options. Whenever a woman is being boring, I change the subject just to let her know I don’t tolerate bullshit.  \n\nBy having a vision of the good life, boundaries, and confidence that your life, thoughts and emotions are interesting and valuable, you can challenge and stimulate a woman. Women want a man that will help them grow and introduce them to a better life and more interesting world than the one they currently inhabit. They don’t want some a that agrees with everything they say, a pushover, or a simple-minded conformist.  Women want a guy who is willing to walk away at any time, not because he is some cold-hearted psychopath, but because once a man shows that is he NOT willing to walk away at any time, there is no challenge or growth. \n\nOf course, for most of you, this is very difficult. Many of you have uninteresting lives so a beautiful woman would instantly become the most interesting and important thing your life or you are so sex starved and desperate that you don’t care if a woman is being boring, or mean, or uninterested, or whatever. \n\n**Focus on your own fun first**\n\nImagine you paid $500,000 to spend a week with Leonardo DiCaprio (or whatever celebrity you think lives an awesome life) and when you get there Leonardo says “tell us what we should do?” You would say “I don’t know, what are the options?” and Leo goes “I don’t have anything planned – let’s just do what you were gonna do.” You would be pissed! You want to become part of Leo’s awesome life, not make your own plan. That’s how girls feel when men don’t have a plan. They want to join your life, not lead you around in their life. That’s why you need to focus on your own fun first. You may like you are being rude or selfish, but you’re not, because women are more attracted to the act of leading than the destination necessarily. \n\n**How to make her emotionally invest in you**\n\nFor a woman to emotionally invest in you, certain shit must happen: \n\n1)\tShe must “like” you – i.e., she must find you pleasant, friendly, good-looking, compatible with her values and interests. \n\n2)\tShe must feel an emotional connection with you.\n\n3)\tShe must feel accepted by you. If she you are rejecting her, ignoring her, or being hostile, she will not emotionally invest. \n\n4)\tShe must watch you be confident and resilient. \n\n5)\tShe needs to spend time around you. \n\n**She must like you**\n\nThis one is self-explanatory. Women are usually not going to invest in you if you don’t share their interests, values, goals, etc… Some girls want a rapper covered in tattoos, others want a nerdy guy who watches Star Wars. If you’re a versatile guy with lots of interests, a lot more women will like you, but some people just aren’t compatible. \n\n**She must feel an emotional connection with you**\n\nThe key to developing an emotional connection with a girl is experiencing emotionally exciting things together. The ultimate is of course, passionate sex, but a good concert, a deep conversation, even a beer pong game you guys play together can help build an emotional connection. \n\nAnother way to build an emotional connection is for her to vicariously experience your confidence. She wants you to be her emotional rock, so she would like to project her insecurities and fears onto you, and watch you brush them off as if they were nothing. She also wants to watch you take the lead and make the night fun. \n\nA woman has emotional energy, and that energy must be directed towards something or somebody. You want that energy to be directed to you. The easiest way to do this is just by spending time around her. Just “being around” will help build attraction as long as you are not fucking it up by being needy or making her feel bad. The best way to get women to like you is to be “forced” to be around them, such as work or a group hangout, where you do not supplicate to them or validate yourself to them. My friend used to take girls out on his boat, and these girls would usually end up liking me by the end of the day because we would have spent all day together. Celebrities get so much tang because women watch them in movies or listen to their music and become emotionally invested, whereas the celebrity shows the women no emotional investment in all. \n\n**She must feel accepted by you.**\n\nAgain, hell hath no fury like a woman scorned, so it must feel like the door to you is open. As she invests in you more, you must escalate more. You can fuck this up by being an asshole, not being sensitive to her emotions, and not reading her advances correctly. \n\n**She must watch you confidently pursue your goals**\n\nThe word confidence comes from the Latin con (with) + fidens (faith). A man with confidence has faith that he will succeed in whatever he does and cannot be stopped by anybody. Women get turned by watching a man confidently pursue his mission. Why are women w so attracted to DJs, promoters, and drug dealers in the club? Those guys aren’t exactly the “cream” of society. It’s because those guys are the only people at the club actually doing something. All the other guys are just sitting there drooling over the girls, instantly reducing their attractiveness. \n\n**Putting it all together**\n\nTo apply all this knowledge, my strategy is to adopt a rational, almost businesslike demeanor, at least in the early stages of the interaction. As I said earlier, women are “rational” at the beginning before they are emotionally invested, so you should also be rational. A man must act almost like he is a woman: he is interested in a relationship (or maybe even just sex) but he has high standards and must evaluate the woman thoroughly first and make sure she is suitable before he gets emotionally invested. You should act like your actions are guided by a seduction computer that makes all the decisions based on the available information, not your emotions. \n\nOne technique is called “disinterested interest.” Your rational words should show interest and enthusiasm but you must communicate the “emotion” of “I’m just talking to you to be nice, I am not totally emotionally invested in you yet and I could walk away at any moment.” The best way to do this is by keeping your thoughts and emotions focused on something else, other than her. \n\nYou should not, however, stay completely rational. You must allow yourself to show your emotions about things that are not her: your passions, your interests, your friends, etc… And you can show emotion towards her if she deserves it: laugh if she says something funny, thank her if she does something nice, sympathize with her if she says something sad: just don’t let on that you feel emotional about “her” unconnected to anything she is or has done. \n\nAnd of course, escalate sexually. Paradoxically, it is possible to escalate sexually and not appear emotionally invested. In fact, a lot of women (especially damaged ones) are looking for emotionless sex. You must touch her, you must turn the conversation sexual, you must do “seductive” things like look into her eyes and whisper in her ear, etc… And you must confidently take the lead in the conversation and the situation in general, leading her from place to place, getting intimate with her, etc… And when she starts to emotionally invest, make her feel like you MIGHT emotionally invest too (but not as much as her). Sometimes if you play it “too” cool she will think you just like her platonically or that you lost interest. \n\n**A broader view**\n\nThis article is obviously about getting girls, but the principles are applicable in all areas of your life. Simply put, you should not invest your thoughts and emotions into people, places, institutions, and activities that do not give a fuck about you and/or do not produce a return that equals the investment you put into them. One of the biggest mistakes people make is investing too much in their job, friendship, hobbies, etc..., and getting 0 out of it. \n\nAdditionally, whatever you do becomes your emotional investment. If you spend every weekend hanging out with piece of shit people that just do drugs, complain and make bad decisions, guess what, you are now becoming a piece of shit person. You are what you do. \n\nFollow me on twitter: http://www.twitter.com/woujo3\n\nGo to my website: http://www.woujo.com", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64zv67", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 602, "report_reasons": null, "author": "Woujo", "saved": false, "mod_reports": [], "name": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "approved_by": null, "over_18": false, "domain": "self.seduction", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhrv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/seduction/comments/64zv67/the_most_important_thing_about_seduction_is_not/", "num_reports": null, "locked": false, "stickied": false, "created": 1492049156.0, "url": "https://www.reddit.com/r/seduction/comments/64zv67/the_most_important_thing_about_seduction_is_not/", "author_flair_text": null, "quarantine": false, "title": "The most important thing about seduction is not being more emotionally invested in her than she is in you.", "created_utc": 1492020356.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 76, "visited": false, "subreddit_type": "public", "ups": 602}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7diy6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EatTheRichNZ", "parent_id": "t1_dg6weij", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Keep being awesome &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Keep being awesome &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7diy6", "score_hidden": false, "stickied": false, "created": 1492107351.0, "created_utc": 1492078551.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6weij", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "SigmaCronos", "parent_id": "t1_dg6plkx", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "It's also the girthiest.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s also the girthiest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6weij", "score_hidden": false, "stickied": false, "created": 1492074774.0, "created_utc": 1492045974.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg6xsu9", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "xarthass", "parent_id": "t1_dg6plkx", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I had to scroll for an hour to get here!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had to scroll for an hour to get here!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6xsu9", "score_hidden": false, "stickied": false, "created": 1492076507.0, "created_utc": 1492047707.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg6yjc6", "gilded": 0, "archived": false, "score": -13, "report_reasons": null, "author": "19RomeoQuebec", "parent_id": "t1_dg6plkx", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "There are plenty of articles of this length and caliber, on the sub TRP.  Seduction is only an abstract portion of the bigger picture.  You cant be good at seduction if you cant reach that point with the opposite sex.  You need to build up to that, so keep reading up.\n\nI include myself in that, I'm always in search of knowledge  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are plenty of articles of this length and caliber, on the sub TRP.  Seduction is only an abstract portion of the bigger picture.  You cant be good at seduction if you cant reach that point with the opposite sex.  You need to build up to that, so keep reading up.&lt;/p&gt;\n\n&lt;p&gt;I include myself in that, I&amp;#39;m always in search of knowledge  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6yjc6", "score_hidden": false, "stickied": false, "created": 1492077422.0, "created_utc": 1492048622.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6plkx", "gilded": 0, "archived": false, "score": 88, "report_reasons": null, "author": "Qazwery", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You can say a lot about this article, but it's for sure the longest reddit article I have ever seen! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can say a lot about this article, but it&amp;#39;s for sure the longest reddit article I have ever seen! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6plkx", "score_hidden": false, "stickied": false, "created": 1492066439.0, "created_utc": 1492037639.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 88}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7kqa1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "unknown_poo", "parent_id": "t1_dg6gcjz", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Honestly, what I have learned over the years is that it's all about connection. Without connection there is no such thing as a relationship, of any sort really. Connection can only be achieved through being genuine and authentic, which means taking a deep interest in somebody else and yourself and exploring it and bringing it out. It's hard to be like that with people that are toxic because if you were to express yourself authentically then it may not be such a pleasant interaction. I like Ken Page's idea of everyone having core gifts, things about them that make them who they are, but are also those things that are our pain points. For example, a person who has anger issues may also be a very passionate person. Or a person who has a lot of built up guilt and shame is also someone that is very empathic. So if you're able to mature and become more disciplined, then we tend towards the positive side of our core gifts. For me, I'm at a point where I'm interested in just exploring people's core gifts and knowing them as a human being. Being a conscious creature with subjective experiences, a mind, is the most fascinating thing to me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, what I have learned over the years is that it&amp;#39;s all about connection. Without connection there is no such thing as a relationship, of any sort really. Connection can only be achieved through being genuine and authentic, which means taking a deep interest in somebody else and yourself and exploring it and bringing it out. It&amp;#39;s hard to be like that with people that are toxic because if you were to express yourself authentically then it may not be such a pleasant interaction. I like Ken Page&amp;#39;s idea of everyone having core gifts, things about them that make them who they are, but are also those things that are our pain points. For example, a person who has anger issues may also be a very passionate person. Or a person who has a lot of built up guilt and shame is also someone that is very empathic. So if you&amp;#39;re able to mature and become more disciplined, then we tend towards the positive side of our core gifts. For me, I&amp;#39;m at a point where I&amp;#39;m interested in just exploring people&amp;#39;s core gifts and knowing them as a human being. Being a conscious creature with subjective experiences, a mind, is the most fascinating thing to me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7kqa1", "score_hidden": false, "stickied": false, "created": 1492120717.0, "created_utc": 1492091917.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6gcjz", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "failatsomething", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "This is the best article that I've read on seddit. Great job, Woujo. \n\nHere's one of so many gold nuggets from the post:\n\n&gt; An awesome man makes a woman feel special, loved, important, powerful, and cool. An awesome man is also fun, positive, confident, carefree, and dominant, easing the woman’s anxieties and insecurities. Being around an awesome guy is literally like a drug to women, and if they are around you long enough, they become hooked.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the best article that I&amp;#39;ve read on seddit. Great job, Woujo. &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s one of so many gold nuggets from the post:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;An awesome man makes a woman feel special, loved, important, powerful, and cool. An awesome man is also fun, positive, confident, carefree, and dominant, easing the woman’s anxieties and insecurities. Being around an awesome guy is literally like a drug to women, and if they are around you long enough, they become hooked.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6gcjz", "score_hidden": false, "stickied": false, "created": 1492055863.0, "created_utc": 1492027063.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 58}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg754uz", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "recyclablebanthas", "parent_id": "t1_dg7299e", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "If you're both acting \"aloof\" then you're both allowing fear to lead you.  This will kill connection.  You might have a superficial interaction at that point.  Maybe sex, etc.  \n\nBut anything deeper, no.  A serious relationship that's healthy?  No.\n\nThe flaw in reasoning in this post is lumping together *over-investing* emotionally with any kind of emotional investment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re both acting &amp;quot;aloof&amp;quot; then you&amp;#39;re both allowing fear to lead you.  This will kill connection.  You might have a superficial interaction at that point.  Maybe sex, etc.  &lt;/p&gt;\n\n&lt;p&gt;But anything deeper, no.  A serious relationship that&amp;#39;s healthy?  No.&lt;/p&gt;\n\n&lt;p&gt;The flaw in reasoning in this post is lumping together &lt;em&gt;over-investing&lt;/em&gt; emotionally with any kind of emotional investment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg754uz", "score_hidden": false, "stickied": false, "created": 1492086482.0, "created_utc": 1492057682.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7iqi9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Woujo", "parent_id": "t1_dg7299e", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You shouldn't \"act\" aloof. You should be engaged and enthusiastic. But you just can't let your actual emotions fall for her until she has shown interest. Feeling like you need to \"act\" some way around her is the definition of emotional investment. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You shouldn&amp;#39;t &amp;quot;act&amp;quot; aloof. You should be engaged and enthusiastic. But you just can&amp;#39;t let your actual emotions fall for her until she has shown interest. Feeling like you need to &amp;quot;act&amp;quot; some way around her is the definition of emotional investment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7iqi9", "score_hidden": false, "stickied": false, "created": 1492118051.0, "created_utc": 1492089251.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg76q2x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ninjamuffin", "parent_id": "t1_dg7299e", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You dont put effort in if it would compromise your position within the relationship.  What effort are you talking about?  showing her how much you love her and care for her?  You shouldn't have to go out of your way to prove that to her, she should assume you spending time with her means she is of value to you.  Are you in this stalemate because you are afraid to break up?  Usually if a girl is aloof it means she isn't that invested and is testing you to see if you will lower your standards to be with her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You dont put effort in if it would compromise your position within the relationship.  What effort are you talking about?  showing her how much you love her and care for her?  You shouldn&amp;#39;t have to go out of your way to prove that to her, she should assume you spending time with her means she is of value to you.  Are you in this stalemate because you are afraid to break up?  Usually if a girl is aloof it means she isn&amp;#39;t that invested and is testing you to see if you will lower your standards to be with her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg76q2x", "score_hidden": false, "stickied": false, "created": 1492089175.0, "created_utc": 1492060375.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7299e", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "hrgrimer", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Question to the thread: if you're acting aloof because you want her to put effort in, and she's acting aloof because she wants you to put effort in, at what point does anything happen? Are we supposed to just stare at each other and wait until one of us breaks down? Perhaps play checkers to see who has to put effort in first?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Question to the thread: if you&amp;#39;re acting aloof because you want her to put effort in, and she&amp;#39;s acting aloof because she wants you to put effort in, at what point does anything happen? Are we supposed to just stare at each other and wait until one of us breaks down? Perhaps play checkers to see who has to put effort in first?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7299e", "score_hidden": false, "stickied": false, "created": 1492082204.0, "created_utc": 1492053404.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7sn42", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zipplesdownthestairs", "parent_id": "t1_dg757e9", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "To add to this models is just one step of Mark Mansons journey and if you follow it through to his latest book alot of models is intrinsically ties to his ideology of just being more comfortable and emotionally in tune with yourself. The subtle art of not giving a fuck is basically a book on inner game and models i find is a book based on having that inner game and going out and just being a genuine person.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To add to this models is just one step of Mark Mansons journey and if you follow it through to his latest book alot of models is intrinsically ties to his ideology of just being more comfortable and emotionally in tune with yourself. The subtle art of not giving a fuck is basically a book on inner game and models i find is a book based on having that inner game and going out and just being a genuine person.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7sn42", "score_hidden": false, "stickied": false, "created": 1492129538.0, "created_utc": 1492100738.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg757e9", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "recyclablebanthas", "parent_id": "t1_dg718gu", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Not at all.  Mark Manson pushes emotional vulnerability.  Not playing the game of trying to make sure that the woman invests more.  Not saying that emotional investment as a whole, is bad.\n\nI think we all agree that **over**investing emotionally is bad.  Like investing so much in a person that you fail to have your own life.  That's awful and should be avoided by men and women.  \n\nBut being invested at all is not bad, in itself.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not at all.  Mark Manson pushes emotional vulnerability.  Not playing the game of trying to make sure that the woman invests more.  Not saying that emotional investment as a whole, is bad.&lt;/p&gt;\n\n&lt;p&gt;I think we all agree that &lt;strong&gt;over&lt;/strong&gt;investing emotionally is bad.  Like investing so much in a person that you fail to have your own life.  That&amp;#39;s awful and should be avoided by men and women.  &lt;/p&gt;\n\n&lt;p&gt;But being invested at all is not bad, in itself.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg757e9", "score_hidden": false, "stickied": false, "created": 1492086595.0, "created_utc": 1492057795.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7ipbn", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Woujo", "parent_id": "t1_dg73syv", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "that's what she said", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;that&amp;#39;s what she said&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7ipbn", "score_hidden": false, "stickied": false, "created": 1492118002.0, "created_utc": 1492089202.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg73syv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "xarthass", "parent_id": "t1_dg718gu", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Agreed. I actually just read it for the first time over the weekend. I probably blasted through it too fast lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed. I actually just read it for the first time over the weekend. I probably blasted through it too fast lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg73syv", "score_hidden": false, "stickied": false, "created": 1492084446.0, "created_utc": 1492055646.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg718gu", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "WerkinAndDerpin", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "This is the main point in Models by Mark Manson I think too", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the main point in Models by Mark Manson I think too&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg718gu", "score_hidden": false, "stickied": false, "created": 1492080833.0, "created_utc": 1492052033.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7fdgf", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "recyclablebanthas", "parent_id": "t1_dg79k8u", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt;1) I'm not against emotional investment. I think it's a natural, inevitable and good thing. I'm just saying that men should not be more invested in the girl, at least in the early stages in the relationship. \n\nOh, definitely. We seem to agree then. \n\n&gt; So I think we generally agree here.\n\nDefinitely. \n \n&gt; 2) ......I think our society places too much emphasis on emotions, and I think it harms a lot of people, especially in relationships. \n\nOh this..... Like the Disney bullshit, right? We agree on this, then. \n\n&gt; Emotions are natural, of course, but they should be carefully guarded and controlled by rationality. \n\nBut I'm not sure about what the right level of \"guarded\" is. \n\nOf course things out there can hurt a person and it's not smart to just let one's emotions run wild all the time. I think we agree on this. \n\nBut on the other hand, it's just as bad to take it too far and be so overprotective of one's emotions that they push people away. Or get too controlling. \n\nSo I think the answer is somewhere in the middle. Being vulnerable as Mark Manson puts it. Exposing oneself to being hurt but not being afraid to walk if someone proves unworthy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;1) I&amp;#39;m not against emotional investment. I think it&amp;#39;s a natural, inevitable and good thing. I&amp;#39;m just saying that men should not be more invested in the girl, at least in the early stages in the relationship. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Oh, definitely. We seem to agree then. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So I think we generally agree here.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Definitely. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;2) ......I think our society places too much emphasis on emotions, and I think it harms a lot of people, especially in relationships. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Oh this..... Like the Disney bullshit, right? We agree on this, then. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Emotions are natural, of course, but they should be carefully guarded and controlled by rationality. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But I&amp;#39;m not sure about what the right level of &amp;quot;guarded&amp;quot; is. &lt;/p&gt;\n\n&lt;p&gt;Of course things out there can hurt a person and it&amp;#39;s not smart to just let one&amp;#39;s emotions run wild all the time. I think we agree on this. &lt;/p&gt;\n\n&lt;p&gt;But on the other hand, it&amp;#39;s just as bad to take it too far and be so overprotective of one&amp;#39;s emotions that they push people away. Or get too controlling. &lt;/p&gt;\n\n&lt;p&gt;So I think the answer is somewhere in the middle. Being vulnerable as Mark Manson puts it. Exposing oneself to being hurt but not being afraid to walk if someone proves unworthy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7fdgf", "score_hidden": false, "stickied": false, "created": 1492112190.0, "created_utc": 1492083390.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7u55a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zipplesdownthestairs", "parent_id": "t1_dg7trfh", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Agreed. Emotional investment is a thing that gradually builds with getting to know a person and build trust.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed. Emotional investment is a thing that gradually builds with getting to know a person and build trust.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7u55a", "score_hidden": false, "stickied": false, "created": 1492131150.0, "created_utc": 1492102350.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7trfh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Woujo", "parent_id": "t1_dg7taov", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt; I think it's perfectly normal to be emotionally invested in dating someone after say 3rd or 4th date and be disappointed if it doesn't work out.\n\nEmotional investment is not a binary on-off switch. It exists on a spectrum. If you go on 4 dates with somebody it makes sense to be a little annoyed if they don't like you. Similarly, if you are dating somebody for 3 years it makes sense to get mad they cheated on you. But it doesn't make sense to call somebody 12 times because they didn't agree to go on date 1 with you. You have to constantly calibrate your emotional investment. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I think it&amp;#39;s perfectly normal to be emotionally invested in dating someone after say 3rd or 4th date and be disappointed if it doesn&amp;#39;t work out.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Emotional investment is not a binary on-off switch. It exists on a spectrum. If you go on 4 dates with somebody it makes sense to be a little annoyed if they don&amp;#39;t like you. Similarly, if you are dating somebody for 3 years it makes sense to get mad they cheated on you. But it doesn&amp;#39;t make sense to call somebody 12 times because they didn&amp;#39;t agree to go on date 1 with you. You have to constantly calibrate your emotional investment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7trfh", "score_hidden": false, "stickied": false, "created": 1492130744.0, "created_utc": 1492101944.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7taov", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "zipplesdownthestairs", "parent_id": "t1_dg79k8u", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt;I have 2 responses to the stuff you're saying: \n&gt;\n&gt;1) I'm not against emotional investment. I think it's a natural, inevitable and good thing. I'm just saying that men should not be more invested in the girl, at least in the early stages in the relationship. After you've been dating somebody for a while, the emotions go deep and tangle in complex ways, so it's hard to tell who is \"more\" invested, but the main thing I am trying to prevent is the guy who is immediately \"all in\" while the girl isn't. So I think we generally agree here. \n&gt;\n\nI definitely agree here but I think your context of emotionally invested i view as over invested and just having shitty boundaries and self view.\n\n&gt;2) I disagree with you on the role of emotions. I think our society places too much emphasis on emotions, and I think it harms a lot of people, especially in relationships. Emotions are natural, of course, but they should be carefully guarded and controlled by rationality. There is nothing more \"emotional\" than doing a bunch of cocaine, but if you're going to do cocaine, you need to plan your adventure out so that you don't hurt yourself, etc... Emotions are like swimming. Swimming is fun and good ... but if you can't find your way back to shore, you are fucked.  \n\nI disagree here being that in psychology there are a few views on relationship attachment styles. One is over attachment with insecurity which I feel you view as being emotional, one is secure and one is avoidance type relationships. The only healthy one is secure but no one falls directly on that line.\n\nI think it's perfectly normal to be emotionally invested in dating someone after say 3rd or 4th date and be disappointed if it doesn't work out. I think the problem is when you are unable to process it properly and lay blame to it not working or their choices as your fault. That's just being selfish and not actually viewing someone as a individual and just as an  extension of your need. And I think we both agree that this is where being too invested is an issue. This is the point where people come across needy and low value. \n\nTo sum it up I think you can be invested in someone but still carry enough self worth and value that you easily can see others decisions and actions have no actual​ bearing on your personal value. Not everyone is going to be a good match and other people have other things going on in their lives that affect their decisions and often this has nothing to do with how well you game.\n\nI hope this actually doesn't sound too convoluted.\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have 2 responses to the stuff you&amp;#39;re saying: &lt;/p&gt;\n\n&lt;p&gt;1) I&amp;#39;m not against emotional investment. I think it&amp;#39;s a natural, inevitable and good thing. I&amp;#39;m just saying that men should not be more invested in the girl, at least in the early stages in the relationship. After you&amp;#39;ve been dating somebody for a while, the emotions go deep and tangle in complex ways, so it&amp;#39;s hard to tell who is &amp;quot;more&amp;quot; invested, but the main thing I am trying to prevent is the guy who is immediately &amp;quot;all in&amp;quot; while the girl isn&amp;#39;t. So I think we generally agree here. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I definitely agree here but I think your context of emotionally invested i view as over invested and just having shitty boundaries and self view.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;2) I disagree with you on the role of emotions. I think our society places too much emphasis on emotions, and I think it harms a lot of people, especially in relationships. Emotions are natural, of course, but they should be carefully guarded and controlled by rationality. There is nothing more &amp;quot;emotional&amp;quot; than doing a bunch of cocaine, but if you&amp;#39;re going to do cocaine, you need to plan your adventure out so that you don&amp;#39;t hurt yourself, etc... Emotions are like swimming. Swimming is fun and good ... but if you can&amp;#39;t find your way back to shore, you are fucked.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I disagree here being that in psychology there are a few views on relationship attachment styles. One is over attachment with insecurity which I feel you view as being emotional, one is secure and one is avoidance type relationships. The only healthy one is secure but no one falls directly on that line.&lt;/p&gt;\n\n&lt;p&gt;I think it&amp;#39;s perfectly normal to be emotionally invested in dating someone after say 3rd or 4th date and be disappointed if it doesn&amp;#39;t work out. I think the problem is when you are unable to process it properly and lay blame to it not working or their choices as your fault. That&amp;#39;s just being selfish and not actually viewing someone as a individual and just as an  extension of your need. And I think we both agree that this is where being too invested is an issue. This is the point where people come across needy and low value. &lt;/p&gt;\n\n&lt;p&gt;To sum it up I think you can be invested in someone but still carry enough self worth and value that you easily can see others decisions and actions have no actual​ bearing on your personal value. Not everyone is going to be a good match and other people have other things going on in their lives that affect their decisions and often this has nothing to do with how well you game.&lt;/p&gt;\n\n&lt;p&gt;I hope this actually doesn&amp;#39;t sound too convoluted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7taov", "score_hidden": false, "stickied": false, "created": 1492130246.0, "created_utc": 1492101446.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg79k8u", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Woujo", "parent_id": "t1_dg74xoz", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I have 2 responses to the stuff you're saying: \n\n1) I'm not against emotional investment. I think it's a natural, inevitable and good thing. I'm just saying that men should not be more invested in the girl, at least in the early stages in the relationship. After you've been dating somebody for a while, the emotions go deep and tangle in complex ways, so it's hard to tell who is \"more\" invested, but the main thing I am trying to prevent is the guy who is immediately \"all in\" while the girl isn't. So I think we generally agree here. \n\n2) I disagree with you on the role of emotions. I think our society places too much emphasis on emotions, and I think it harms a lot of people, especially in relationships. Emotions are natural, of course, but they should be carefully guarded and controlled by rationality. There is nothing more \"emotional\" than doing a bunch of cocaine, but if you're going to do cocaine, you need to plan your adventure out so that you don't hurt yourself, etc... Emotions are like swimming. Swimming is fun and good ... but if you can't find your way back to shore, you are fucked. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have 2 responses to the stuff you&amp;#39;re saying: &lt;/p&gt;\n\n&lt;p&gt;1) I&amp;#39;m not against emotional investment. I think it&amp;#39;s a natural, inevitable and good thing. I&amp;#39;m just saying that men should not be more invested in the girl, at least in the early stages in the relationship. After you&amp;#39;ve been dating somebody for a while, the emotions go deep and tangle in complex ways, so it&amp;#39;s hard to tell who is &amp;quot;more&amp;quot; invested, but the main thing I am trying to prevent is the guy who is immediately &amp;quot;all in&amp;quot; while the girl isn&amp;#39;t. So I think we generally agree here. &lt;/p&gt;\n\n&lt;p&gt;2) I disagree with you on the role of emotions. I think our society places too much emphasis on emotions, and I think it harms a lot of people, especially in relationships. Emotions are natural, of course, but they should be carefully guarded and controlled by rationality. There is nothing more &amp;quot;emotional&amp;quot; than doing a bunch of cocaine, but if you&amp;#39;re going to do cocaine, you need to plan your adventure out so that you don&amp;#39;t hurt yourself, etc... Emotions are like swimming. Swimming is fun and good ... but if you can&amp;#39;t find your way back to shore, you are fucked. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg79k8u", "score_hidden": false, "stickied": false, "created": 1492095654.0, "created_utc": 1492066854.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7983m", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "zipplesdownthestairs", "parent_id": "t1_dg74xoz", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Thanks. As I agree with some of this post from wuojo other aspects fall flat for me. You seem to have captured what I myself disagree with.\n\nEmotional investment is how you build a relationship. Investment does not mean neglecting self it just means being vulnerable and interested emotionally. \n\nPeople are all going to move a different paces and I think what is attractive to people is just being healthy emotionally and self confident but that doesn't mean not being emotionally invested. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. As I agree with some of this post from wuojo other aspects fall flat for me. You seem to have captured what I myself disagree with.&lt;/p&gt;\n\n&lt;p&gt;Emotional investment is how you build a relationship. Investment does not mean neglecting self it just means being vulnerable and interested emotionally. &lt;/p&gt;\n\n&lt;p&gt;People are all going to move a different paces and I think what is attractive to people is just being healthy emotionally and self confident but that doesn&amp;#39;t mean not being emotionally invested. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7983m", "score_hidden": false, "stickied": false, "created": 1492094764.0, "created_utc": 1492065964.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg74xoz", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "recyclablebanthas", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "_______0: There's a lot of good in this article_______\n\nI see stuff like this:\n\n&gt; An awesome man makes a woman feel special, loved, important, powerful, and cool. An awesome man is also fun, positive, confident, carefree, and dominant, easing the woman’s anxieties and insecurities.\n\nAnd it's something we can all agree with.  It's even something that would apply to women and the people they date, also. \n\n&gt; Being around an awesome guy is literally like a drug to women, and if they are around you long enough, they become hooked.\n\nThe problem is that a lot of the good here, is next to problematic stuff like this, which appears to be pushing the idea of creating codependency another person.  \n\nIf we were talking about two awesome people feeling special, loved, important, etc., and dating each other while also taking care of their own lives, that would sound 100% great. But creating codependency/addiction in another person, encourages the other person to be less than awesome. \n\n_______1: Over-investment is the issue, not investment_______\n\n&gt; Emotional investment is an immediate turn-off.\n\nA fling or casual relationship is certainly focused on the physical and everyone who is just after sex, certainly finds emotional attachment to be a turn-off.  \n\nBut in a healthy relationship about vulnerability, communication, &amp; sharing feelings..... emotional investment is part of that, within moderation.\n\n**The problem is not emotionally investing in each other.  It's when either the man *or* the woman are investing too much, and losing their identities, neglecting their lives, or not taking care of themselves.**  If either side does that, it's going to be a fucking horrible time whether one is in a fling or a serious relationship.\n\n_______2: Different value systems_______\n\n&gt; For example, a girl that plays soccer will be attracted to guys that are better at soccer than her.....a guy who is worse at soccer than she is.....is playing with a disadvantage.\n\nIf we assume that a girl:\n\n* Has interests, like soccer or even something like a partner dance.\n\n* Has values she considers important within the area of relationships, dating, and the people she wants around her in life. \n\nThese two things aren't the same.  So while it might be nice if a guy is good at something the girl is interested in, that often has absolutely ZERO to do with how he lines up with her values and priorities for relationships.  \n\nFor example, if the guy in your example is a good lover with healthy confidence and a good handle on his professional work, and the girl values those things, then it won't matter at all to her that this guy doesn't also possess the bonus feat of being good at soccer.\n\n_______3: Just because some people have baggage....._______\n\n&gt; Second, emotional investment is unattractive because, simply put, emotions are bad and scary. \n\nPeople with certain kinds of pasts certainly find emotions scary and bad.  But not everyone does.  Not everyone is afraid of being hurt or exposing themselves to being hurt.  Some see the risk as worth it because it can lead to some awesome connections.\n\n_______4: Emotions ≠ rationality_______\n\n&gt; Our society acts like “love” is an emotion and “our true selves” are our emotions, but that’s bullshit. Our value lies in what we can do when we are rational, what we’ve learned in our life, what we know how to do, and what we strive to achieve and be when we are clear-headed. \n\nIt's problematic at BEST, to try to boil down emotions into something of rational value.\n\n_______5: Check back with Plato again_______\n\n&gt; In his dialogue the Phaedrus, the Greek philosopher Plato said that emotional love is a kind of madness.....\n\nYep.  He talked about a few madnesses in that dialogue that come from the divine.\n\n* From Apollo = prophecy\n* From Dionysus = relief from hardship\n* From the Muses = poetry\n* From Aphrodite = love\n\nSo then are we going to argue against the other madnesses Plato described as blessings?  I guess prophecy doesn't fly these days.  Poetry?  Chilling out with a glass of wine?  *You're missing the point that he called them \"madnesses\" because they weren't rational.......* **and he was arguing that the BEST things in life come from what he defined as \"divine madness.\"**  Love, prophecy, relief from hardship, poetry, and love were all blessings in his book.     ", "edited": 1492066891.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;____&lt;strong&gt;&lt;em&gt;0: There&amp;#39;s a lot of good in this article&lt;/em&gt;&lt;/strong&gt;____&lt;/p&gt;\n\n&lt;p&gt;I see stuff like this:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;An awesome man makes a woman feel special, loved, important, powerful, and cool. An awesome man is also fun, positive, confident, carefree, and dominant, easing the woman’s anxieties and insecurities.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And it&amp;#39;s something we can all agree with.  It&amp;#39;s even something that would apply to women and the people they date, also. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Being around an awesome guy is literally like a drug to women, and if they are around you long enough, they become hooked.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The problem is that a lot of the good here, is next to problematic stuff like this, which appears to be pushing the idea of creating codependency another person.  &lt;/p&gt;\n\n&lt;p&gt;If we were talking about two awesome people feeling special, loved, important, etc., and dating each other while also taking care of their own lives, that would sound 100% great. But creating codependency/addiction in another person, encourages the other person to be less than awesome. &lt;/p&gt;\n\n&lt;p&gt;____&lt;strong&gt;&lt;em&gt;1: Over-investment is the issue, not investment&lt;/em&gt;&lt;/strong&gt;____&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Emotional investment is an immediate turn-off.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A fling or casual relationship is certainly focused on the physical and everyone who is just after sex, certainly finds emotional attachment to be a turn-off.  &lt;/p&gt;\n\n&lt;p&gt;But in a healthy relationship about vulnerability, communication, &amp;amp; sharing feelings..... emotional investment is part of that, within moderation.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The problem is not emotionally investing in each other.  It&amp;#39;s when either the man &lt;em&gt;or&lt;/em&gt; the woman are investing too much, and losing their identities, neglecting their lives, or not taking care of themselves.&lt;/strong&gt;  If either side does that, it&amp;#39;s going to be a fucking horrible time whether one is in a fling or a serious relationship.&lt;/p&gt;\n\n&lt;p&gt;____&lt;strong&gt;&lt;em&gt;2: Different value systems&lt;/em&gt;&lt;/strong&gt;____&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;For example, a girl that plays soccer will be attracted to guys that are better at soccer than her.....a guy who is worse at soccer than she is.....is playing with a disadvantage.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If we assume that a girl:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Has interests, like soccer or even something like a partner dance.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Has values she considers important within the area of relationships, dating, and the people she wants around her in life. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;These two things aren&amp;#39;t the same.  So while it might be nice if a guy is good at something the girl is interested in, that often has absolutely ZERO to do with how he lines up with her values and priorities for relationships.  &lt;/p&gt;\n\n&lt;p&gt;For example, if the guy in your example is a good lover with healthy confidence and a good handle on his professional work, and the girl values those things, then it won&amp;#39;t matter at all to her that this guy doesn&amp;#39;t also possess the bonus feat of being good at soccer.&lt;/p&gt;\n\n&lt;p&gt;____&lt;strong&gt;&lt;em&gt;3: Just because some people have baggage.....&lt;/em&gt;&lt;/strong&gt;____&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Second, emotional investment is unattractive because, simply put, emotions are bad and scary. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;People with certain kinds of pasts certainly find emotions scary and bad.  But not everyone does.  Not everyone is afraid of being hurt or exposing themselves to being hurt.  Some see the risk as worth it because it can lead to some awesome connections.&lt;/p&gt;\n\n&lt;p&gt;____&lt;strong&gt;&lt;em&gt;4: Emotions ≠ rationality&lt;/em&gt;&lt;/strong&gt;____&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Our society acts like “love” is an emotion and “our true selves” are our emotions, but that’s bullshit. Our value lies in what we can do when we are rational, what we’ve learned in our life, what we know how to do, and what we strive to achieve and be when we are clear-headed. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s problematic at BEST, to try to boil down emotions into something of rational value.&lt;/p&gt;\n\n&lt;p&gt;____&lt;strong&gt;&lt;em&gt;5: Check back with Plato again&lt;/em&gt;&lt;/strong&gt;____&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In his dialogue the Phaedrus, the Greek philosopher Plato said that emotional love is a kind of madness.....&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yep.  He talked about a few madnesses in that dialogue that come from the divine.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;From Apollo = prophecy&lt;/li&gt;\n&lt;li&gt;From Dionysus = relief from hardship&lt;/li&gt;\n&lt;li&gt;From the Muses = poetry&lt;/li&gt;\n&lt;li&gt;From Aphrodite = love&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;So then are we going to argue against the other madnesses Plato described as blessings?  I guess prophecy doesn&amp;#39;t fly these days.  Poetry?  Chilling out with a glass of wine?  &lt;em&gt;You&amp;#39;re missing the point that he called them &amp;quot;madnesses&amp;quot; because they weren&amp;#39;t rational.......&lt;/em&gt; &lt;strong&gt;and he was arguing that the BEST things in life come from what he defined as &amp;quot;divine madness.&amp;quot;&lt;/strong&gt;  Love, prophecy, relief from hardship, poetry, and love were all blessings in his book.     &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg74xoz", "score_hidden": false, "stickied": false, "created": 1492086163.0, "created_utc": 1492057363.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg72ddv", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "BLOOFU_19", "parent_id": "t1_dg70tmv", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "This is pretty much true even into the LTR phase and on to being married.\n\nIt does not mean that you do not care for or do things for the woman you are in a relationship with. It just means you are never more invested than she is.\n\nWomen are generally attracted to men who are strong and independent. This dynamic does not change because you have been dating for X months, or because you put a ring on it, or even once you have kids together. \n\nThis is a mistake many men make once they get to these 'relationship milestones': they figure they can relax, because some intangible thing is keeping them together with their partner.\n\nThis also applies to being funny, charming, and giving her a sense of adventure. Never relax or become a lazy partner, and always remain confident, adventurous, and the kind of man she fell for when you first met. This is how relationships last the test of time.\n\nHave you ever seen what couples are like who have been together for 30, 40 years? Generally speaking (in healthy relationships, anyway) they are very caring for each other, but the man usually has his own shit going on, and isn't doting on every need of his wife. He still has fire inside him, and usually there is still a lot of sarcasm and witty back and forth, even at that age. My grandma still shit tests my grandpa on a regular basis. Even at 60+, he is still alpha as fuck.\n\nTake a look at the divorce rate and understand that most men do not understand this. They get married, relax, become a beta pussy, and generally the fire fades. Often times their wife will be fucking around without them knowing it long before they get divorced or things start to break down.\n\nIf never being able to just relax and become a beta male sounds \"bleak\" to you, imagine how bleak that would sound to a woman who puts her trust and life in your hands by marrying you or investing in a LTR, only to find out you were \"acting\" like an alpha male for the first few months you dated.\n\nUltimately, you can seduce women short term by pretending to be alpha, and pretending you aren't more invested than she is. If you want things to work out long term with a *quality* woman, you need to BE those things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is pretty much true even into the LTR phase and on to being married.&lt;/p&gt;\n\n&lt;p&gt;It does not mean that you do not care for or do things for the woman you are in a relationship with. It just means you are never more invested than she is.&lt;/p&gt;\n\n&lt;p&gt;Women are generally attracted to men who are strong and independent. This dynamic does not change because you have been dating for X months, or because you put a ring on it, or even once you have kids together. &lt;/p&gt;\n\n&lt;p&gt;This is a mistake many men make once they get to these &amp;#39;relationship milestones&amp;#39;: they figure they can relax, because some intangible thing is keeping them together with their partner.&lt;/p&gt;\n\n&lt;p&gt;This also applies to being funny, charming, and giving her a sense of adventure. Never relax or become a lazy partner, and always remain confident, adventurous, and the kind of man she fell for when you first met. This is how relationships last the test of time.&lt;/p&gt;\n\n&lt;p&gt;Have you ever seen what couples are like who have been together for 30, 40 years? Generally speaking (in healthy relationships, anyway) they are very caring for each other, but the man usually has his own shit going on, and isn&amp;#39;t doting on every need of his wife. He still has fire inside him, and usually there is still a lot of sarcasm and witty back and forth, even at that age. My grandma still shit tests my grandpa on a regular basis. Even at 60+, he is still alpha as fuck.&lt;/p&gt;\n\n&lt;p&gt;Take a look at the divorce rate and understand that most men do not understand this. They get married, relax, become a beta pussy, and generally the fire fades. Often times their wife will be fucking around without them knowing it long before they get divorced or things start to break down.&lt;/p&gt;\n\n&lt;p&gt;If never being able to just relax and become a beta male sounds &amp;quot;bleak&amp;quot; to you, imagine how bleak that would sound to a woman who puts her trust and life in your hands by marrying you or investing in a LTR, only to find out you were &amp;quot;acting&amp;quot; like an alpha male for the first few months you dated.&lt;/p&gt;\n\n&lt;p&gt;Ultimately, you can seduce women short term by pretending to be alpha, and pretending you aren&amp;#39;t more invested than she is. If you want things to work out long term with a &lt;em&gt;quality&lt;/em&gt; woman, you need to BE those things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg72ddv", "score_hidden": false, "stickied": false, "created": 1492082364.0, "created_utc": 1492053564.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg758vr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "recyclablebanthas", "parent_id": "t1_dg70tmv", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "It is bleak.  It is also [a flawed argument.](https://www.reddit.com/r/seduction/comments/64zv67/the_most_important_thing_about_seduction_is_not/dg74xoz/)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is bleak.  It is also &lt;a href=\"https://www.reddit.com/r/seduction/comments/64zv67/the_most_important_thing_about_seduction_is_not/dg74xoz/\"&gt;a flawed argument.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg758vr", "score_hidden": false, "stickied": false, "created": 1492086663.0, "created_utc": 1492057863.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg70tmv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "paddywacknack", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Does this only apply to the seduction process? This seems pretty bleak for a long-term relationship...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does this only apply to the seduction process? This seems pretty bleak for a long-term relationship...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg70tmv", "score_hidden": false, "stickied": false, "created": 1492080289.0, "created_utc": 1492051489.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg75fwr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "haeral", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I'm very skeptical about this type of articles, even this sub in general, but I read the whole thing. I have to say, you're a great communicator, and you have made some very valid points. \n\nGeneral advice like this is the best way to guide people, pickup artists can't teach anything useful because their aim is too narrow. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m very skeptical about this type of articles, even this sub in general, but I read the whole thing. I have to say, you&amp;#39;re a great communicator, and you have made some very valid points. &lt;/p&gt;\n\n&lt;p&gt;General advice like this is the best way to guide people, pickup artists can&amp;#39;t teach anything useful because their aim is too narrow. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg75fwr", "score_hidden": false, "stickied": false, "created": 1492086986.0, "created_utc": 1492058186.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg6n6pq", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "zerogravityii", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Yeah I love it. You should always be able to walk away.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I love it. You should always be able to walk away.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6n6pq", "score_hidden": false, "stickied": false, "created": 1492063443.0, "created_utc": 1492034643.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7apps", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "thehill6984", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I can't believe I just read this whole post.. At 4am. \nI needed to hear exactly everything you said exactly right now in my life, so thank you", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t believe I just read this whole post.. At 4am. \nI needed to hear exactly everything you said exactly right now in my life, so thank you&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7apps", "score_hidden": false, "stickied": false, "created": 1492098843.0, "created_utc": 1492070043.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7a2t4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "whatever000012345678", "parent_id": "t1_dg6vz1g", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I was about to comment and ask you the same thing!! Please seriously consider!! There's a wealth of information for men, and a scarcity of equivalent information for women other than to be skinny and focus on their appearance. \n\nYou're a great writer and very intelligent. I imagine you'd get a good response to an article directed to women.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was about to comment and ask you the same thing!! Please seriously consider!! There&amp;#39;s a wealth of information for men, and a scarcity of equivalent information for women other than to be skinny and focus on their appearance. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re a great writer and very intelligent. I imagine you&amp;#39;d get a good response to an article directed to women.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7a2t4", "score_hidden": false, "stickied": false, "created": 1492097048.0, "created_utc": 1492068248.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg749nb", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Rreptillian", "parent_id": "t1_dg6ynor", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "My experience from my own life is quite limited, but I can offer my opinion. For me, my most healthy and enjoyable relationships have been based upon equivalent levels of mutual interest. Both physical and emotional. I think going for emotional investment imbalance is probably a good way to get laid a lot but may also lead to inconsistent quality of relationships if that is what you are interested in.\n\nI think ultimately a lot of this comes down to what you are really looking for. Spend a good deal of time determining the ideal type of person you would like to be with and begin building yourself into a very similar person. I believe people of sound mind who are capable of building healthy relationships know to look for people of like mind and with similar priorities. Whether you are looking for something serious or not it seems to me that you are always best off not trying to attract a specific individual but rather building yourself to be attractive to the class of people who are attractive to you and then seeing who takes the proverbial bait. And in my opinion the best way to do that is to be similar to these people.\n\nHope my youngster opinion actually helps you in some way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My experience from my own life is quite limited, but I can offer my opinion. For me, my most healthy and enjoyable relationships have been based upon equivalent levels of mutual interest. Both physical and emotional. I think going for emotional investment imbalance is probably a good way to get laid a lot but may also lead to inconsistent quality of relationships if that is what you are interested in.&lt;/p&gt;\n\n&lt;p&gt;I think ultimately a lot of this comes down to what you are really looking for. Spend a good deal of time determining the ideal type of person you would like to be with and begin building yourself into a very similar person. I believe people of sound mind who are capable of building healthy relationships know to look for people of like mind and with similar priorities. Whether you are looking for something serious or not it seems to me that you are always best off not trying to attract a specific individual but rather building yourself to be attractive to the class of people who are attractive to you and then seeing who takes the proverbial bait. And in my opinion the best way to do that is to be similar to these people.&lt;/p&gt;\n\n&lt;p&gt;Hope my youngster opinion actually helps you in some way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg749nb", "score_hidden": false, "stickied": false, "created": 1492085143.0, "created_utc": 1492056343.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7lbfq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blueskyblond", "parent_id": "t1_dg78ipy", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I think support is a great word. I really appreciate this, thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think support is a great word. I really appreciate this, thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7lbfq", "score_hidden": false, "stickied": false, "created": 1492121462.0, "created_utc": 1492092662.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg78ipy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "EntropyDream", "parent_id": "t1_dg6ynor", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Heterosexual man here. Like the OP, I think my advice on how to pick up men is fundamentally unreliable. That said, I've given this question some thought and discussed it at length with a female friend who definitely knows how to pull. Here's my theory.\n\nA man wants a woman who sees the ideal form of himself he has in his head and supports that version of him.\n\n\"Support\" is the best single word I could come up with for what I mean, but I really mean \"share in, encourage, and inspire\". To make this more concrete, I'll invert things commonly said of women:\n\n* A man doesn't want to be taken on adventures, he wants a woman who will add a new dimension of meaning and enjoyment to *his* adventures.\n\n* A man doesn't want to have love songs written about him, he wants to meet a woman who can inspire him to write songs.\n\n* Men don't want to be protected, they want a woman who makes them feel valued by rewarding protection with warmth.\n\nWhat does this mean practically for picking up men? Figure out what they consider their ideal form. Participate in that reality.\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Heterosexual man here. Like the OP, I think my advice on how to pick up men is fundamentally unreliable. That said, I&amp;#39;ve given this question some thought and discussed it at length with a female friend who definitely knows how to pull. Here&amp;#39;s my theory.&lt;/p&gt;\n\n&lt;p&gt;A man wants a woman who sees the ideal form of himself he has in his head and supports that version of him.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Support&amp;quot; is the best single word I could come up with for what I mean, but I really mean &amp;quot;share in, encourage, and inspire&amp;quot;. To make this more concrete, I&amp;#39;ll invert things commonly said of women:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;A man doesn&amp;#39;t want to be taken on adventures, he wants a woman who will add a new dimension of meaning and enjoyment to &lt;em&gt;his&lt;/em&gt; adventures.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A man doesn&amp;#39;t want to have love songs written about him, he wants to meet a woman who can inspire him to write songs.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Men don&amp;#39;t want to be protected, they want a woman who makes them feel valued by rewarding protection with warmth.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;What does this mean practically for picking up men? Figure out what they consider their ideal form. Participate in that reality.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg78ipy", "score_hidden": false, "stickied": false, "created": 1492093013.0, "created_utc": 1492064213.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ynor", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "blueskyblond", "parent_id": "t1_dg6vz1g", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Excellent, thank you. I think women often get the advice \"you're a woman, it's easy for you\" which is true to an extent but doesn't help when wanting a particular man - we get anxious and weird all the same. However, I'd be curious about your thoughts in regards to motivators. Women look for power and to be protected so men should therefore try their best to come off as independent, put together, etc. What does a man ultimately want from a woman? To feel validated? Important? That contradicts the emotional investment part then. Just curious. Really well written article and I'm impressed. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Excellent, thank you. I think women often get the advice &amp;quot;you&amp;#39;re a woman, it&amp;#39;s easy for you&amp;quot; which is true to an extent but doesn&amp;#39;t help when wanting a particular man - we get anxious and weird all the same. However, I&amp;#39;d be curious about your thoughts in regards to motivators. Women look for power and to be protected so men should therefore try their best to come off as independent, put together, etc. What does a man ultimately want from a woman? To feel validated? Important? That contradicts the emotional investment part then. Just curious. Really well written article and I&amp;#39;m impressed. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6ynor", "score_hidden": false, "stickied": false, "created": 1492077573.0, "created_utc": 1492048773.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg6yqga", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "cmatute", "parent_id": "t1_dg6vz1g", "subreddit_name_prefixed": "r/seduction", "controversiality": 1, "body": "have you tried being a woman?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;have you tried being a woman?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6yqga", "score_hidden": false, "stickied": false, "created": 1492077672.0, "created_utc": 1492048872.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6vz1g", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Woujo", "parent_id": "t1_dg6vvy0", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I've never considered that. It will be different because I've never been a woman. I think a lot of it will be the same. Let me think about it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve never considered that. It will be different because I&amp;#39;ve never been a woman. I think a lot of it will be the same. Let me think about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6vz1g", "score_hidden": false, "stickied": false, "created": 1492074244.0, "created_utc": 1492045444.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6vvy0", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "blueskyblond", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "As a woman, this is fantastic. Would you consider doing an article about a woman seducing a man? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a woman, this is fantastic. Would you consider doing an article about a woman seducing a man? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6vvy0", "score_hidden": false, "stickied": false, "created": 1492074135.0, "created_utc": 1492045335.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7kv7j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "eddybrah", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "\"You can’t control how you feel, but you can control what you do. Where your actions go, your feelings will follow, and where feelings go, your thoughts will follow\".... the antidote for oneitis!! very well written post", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;You can’t control how you feel, but you can control what you do. Where your actions go, your feelings will follow, and where feelings go, your thoughts will follow&amp;quot;.... the antidote for oneitis!! very well written post&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7kv7j", "score_hidden": false, "stickied": false, "created": 1492120896.0, "created_utc": 1492092096.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7s8gy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bugxter", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I like most of this, but I feel like vulnerability is missing in most of it too.\n\nWhen you feel like you want to give something to a girl (a drink, a compliment, attention) but fear you won't get anything in return, so you don't, aren't you giving too many fucks?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like most of this, but I feel like vulnerability is missing in most of it too.&lt;/p&gt;\n\n&lt;p&gt;When you feel like you want to give something to a girl (a drink, a compliment, attention) but fear you won&amp;#39;t get anything in return, so you don&amp;#39;t, aren&amp;#39;t you giving too many fucks?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7s8gy", "score_hidden": false, "stickied": false, "created": 1492129112.0, "created_utc": 1492100312.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dgbx03s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "broccoli49", "parent_id": "t1_dg8guyd", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You are right", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are right&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgbx03s", "score_hidden": false, "stickied": false, "created": 1492368130.0, "created_utc": 1492339330.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8guyd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jamesy69", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "For anyone having trouble resonating with this concept, I'd say it's not really something you have to actively work toward but maybe just an idea to keep in the back of your head. You will naturally become less emotionally invested in girls as you gain more and more experience with new ones", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For anyone having trouble resonating with this concept, I&amp;#39;d say it&amp;#39;s not really something you have to actively work toward but maybe just an idea to keep in the back of your head. You will naturally become less emotionally invested in girls as you gain more and more experience with new ones&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg8guyd", "score_hidden": false, "stickied": false, "created": 1492157674.0, "created_utc": 1492128874.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg77btn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "tragichero24", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "How does all this tie into the idea of vulnerability?\n\nThis reads a lot like a false dichotomy between being stoic and being a complete pushover. In reality it's a spectrum. PEOPLE (both men and women) make mistakes and feel emotions because of it. The key is to be able to express your emotions in a healthy way (i.e expressing emotion without being overly emotional) and not let it consume you.\n\nDon't get me wrong I think your overall message about being less emotionally invested is great but aren't you being a bit too extreme in your examples?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How does all this tie into the idea of vulnerability?&lt;/p&gt;\n\n&lt;p&gt;This reads a lot like a false dichotomy between being stoic and being a complete pushover. In reality it&amp;#39;s a spectrum. PEOPLE (both men and women) make mistakes and feel emotions because of it. The key is to be able to express your emotions in a healthy way (i.e expressing emotion without being overly emotional) and not let it consume you.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t get me wrong I think your overall message about being less emotionally invested is great but aren&amp;#39;t you being a bit too extreme in your examples?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg77btn", "score_hidden": false, "stickied": false, "created": 1492090364.0, "created_utc": 1492061564.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg79gjp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dirtylittlesecret88", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Patrice O'Neal said it perfectly in one of his stand ups: \" The perfect relationship is when a girl loves the guy and the guy likes the girl.\" ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Patrice O&amp;#39;Neal said it perfectly in one of his stand ups: &amp;quot; The perfect relationship is when a girl loves the guy and the guy likes the girl.&amp;quot; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg79gjp", "score_hidden": false, "stickied": false, "created": 1492095373.0, "created_utc": 1492066573.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg8la5y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "swiftp", "parent_id": "t1_dg84y1c", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Same here brotha, I just literally answered your question but I know it's not that easy", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same here brotha, I just literally answered your question but I know it&amp;#39;s not that easy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg8la5y", "score_hidden": false, "stickied": false, "created": 1492163758.0, "created_utc": 1492134958.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84y1c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Actionbrenner", "parent_id": "t1_dg82nts", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "That would be the most logically explanation. Unfortunately it isn't that black and white. I definitely have a wholesome and exciting life but I'm also super busy😬 Dating multiple people just isn't realistic for me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That would be the most logically explanation. Unfortunately it isn&amp;#39;t that black and white. I definitely have a wholesome and exciting life but I&amp;#39;m also super busy😬 Dating multiple people just isn&amp;#39;t realistic for me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg84y1c", "score_hidden": false, "stickied": false, "created": 1492142738.0, "created_utc": 1492113938.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82nts", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "swiftp", "parent_id": "t1_dg7adme", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Abundance mentality and having more important/exciting things in life than the girl.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Abundance mentality and having more important/exciting things in life than the girl.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg82nts", "score_hidden": false, "stickied": false, "created": 1492140251.0, "created_utc": 1492111451.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7adme", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Actionbrenner", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I completely agree. This is my problem. I have a really hard time not becoming emotionally invested. It's really just part of who I am. I don't know how to change it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I completely agree. This is my problem. I have a really hard time not becoming emotionally invested. It&amp;#39;s really just part of who I am. I don&amp;#39;t know how to change it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7adme", "score_hidden": false, "stickied": false, "created": 1492097891.0, "created_utc": 1492069091.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7elm2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "iAmARookie", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Great article. One question I have though is how do you make the conversation turn sexual, and when you do, what should you talk about? This is one thing I can't seem to get to grips with. Thanks ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great article. One question I have though is how do you make the conversation turn sexual, and when you do, what should you talk about? This is one thing I can&amp;#39;t seem to get to grips with. Thanks &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7elm2", "score_hidden": false, "stickied": false, "created": 1492110370.0, "created_utc": 1492081570.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7rsgp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Giveyourlifepurpose", "parent_id": "t1_dg7he4o", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Just read it, all of it is useful", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just read it, all of it is useful&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7rsgp", "score_hidden": false, "stickied": false, "created": 1492128642.0, "created_utc": 1492099842.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7he4o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "clicketybooboo", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "So erm ... tl;dr", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So erm ... tl;dr&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7he4o", "score_hidden": false, "stickied": false, "created": 1492116001.0, "created_utc": 1492087201.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7qr0f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheCaptainUnderwear", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Fuck u/Woujo,what an excellent post,congrats! \n\n&gt;You can fuck this up by being an asshole, not being sensitive to her emotions, and not reading her advances correctly\n\nWhat would those advances look like? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck &lt;a href=\"/u/Woujo\"&gt;u/Woujo&lt;/a&gt;,what an excellent post,congrats! &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You can fuck this up by being an asshole, not being sensitive to her emotions, and not reading her advances correctly&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What would those advances look like? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7qr0f", "score_hidden": false, "stickied": false, "created": 1492127532.0, "created_utc": 1492098732.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg80hot", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheMortar93", "parent_id": "t1_dg7ybj5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "It's an It's always sunny reference. This was a fantastic article though. I learned a lot about self and realized a lot of past mistakes. Thank you a lot. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s an It&amp;#39;s always sunny reference. This was a fantastic article though. I learned a lot about self and realized a lot of past mistakes. Thank you a lot. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg80hot", "score_hidden": false, "stickied": false, "created": 1492137895.0, "created_utc": 1492109095.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ybj5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Woujo", "parent_id": "t1_dg7w1pv", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I don't know what that is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know what that is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7ybj5", "score_hidden": false, "stickied": false, "created": 1492135581.0, "created_utc": 1492106781.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7w1pv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheMortar93", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "This covers the first two Letters in the 'DENNIS' system. What about the others?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This covers the first two Letters in the &amp;#39;DENNIS&amp;#39; system. What about the others?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7w1pv", "score_hidden": false, "stickied": false, "created": 1492133167.0, "created_utc": 1492104367.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7xrkk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "unknown_poo", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Alright, I read all of this. I find my own personal insights to be in line with yours. And I think you explained things in an amazing way that was helpful. Great insights, and I loved your references to Plato and Nietzsche. \n\n\nI have been working on this for years now and I feel like I am at a pretty good place, and about to have a great breakthrough. You kind of alluded to it, but I find most articles and advice about this to be missing this, and that is how to do it. I mean, there are the more outward and pragmatic things you can do, and I like you say to fill your mind with things that you're passionate about and interested in. A higher goal is a reflection of a self-concept that is becoming more self-actualized. I believe that the more self-actualized you are then the more this stuff becomes natural. But self-actualization pertains to self-concept, how we view ourselves, which determines how we perceive the world, both phenomenally as well as semantically. I believe being able to see yourself in more spiritual and metaphysical terms is the solution to this, which is the solution in all world religions and spiritual traditions. When we fall under the delusion of viewing ourselves as purely material creatures, then we define ourselves by the material. In defining ourselves by the material we seek to validate our lives by the material, so that especially means beautiful women, status, etc. That leads to attachment, craving, and non-attainment, leading to suffering. That is where all of these negative emotions you described come from. \n\n\nThe sense of purpose, meaning, and having a goal in the abstract sense, is metaphysical. Erikson calls this \"self-identified\", so they are intertwined with your Being. I believe that you need to have this transcendent sense of self and self-concept, which can help you to be grounded. It causes you to see others in a more metaphysical way, that there is something amazingly fascinating and miraculous about this individual and you just want to know what exactly it is. I find from this comes deeper interactions and authenticity. \n\n\nThinking about death and non-existence really helped ground myself as well. In a sense, everyone and everything has already vanished. We are experiencing the world as it vanishes, and so the idea of being attached is absurd. It helps us deal with anxiety related to abandonment, and to eventually overcome it. Thich Nhat Hanh talks about that in his book \"Fear\", calling this the seed of fear which is at the root of our ego. It's interesting because the Prophet Muhammad in one quote said how the biggest trials in life for each other are men and women, because of everything you said; how we bring out from each other the deepest questions of our own lives existentially. ", "edited": 1492106474.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Alright, I read all of this. I find my own personal insights to be in line with yours. And I think you explained things in an amazing way that was helpful. Great insights, and I loved your references to Plato and Nietzsche. &lt;/p&gt;\n\n&lt;p&gt;I have been working on this for years now and I feel like I am at a pretty good place, and about to have a great breakthrough. You kind of alluded to it, but I find most articles and advice about this to be missing this, and that is how to do it. I mean, there are the more outward and pragmatic things you can do, and I like you say to fill your mind with things that you&amp;#39;re passionate about and interested in. A higher goal is a reflection of a self-concept that is becoming more self-actualized. I believe that the more self-actualized you are then the more this stuff becomes natural. But self-actualization pertains to self-concept, how we view ourselves, which determines how we perceive the world, both phenomenally as well as semantically. I believe being able to see yourself in more spiritual and metaphysical terms is the solution to this, which is the solution in all world religions and spiritual traditions. When we fall under the delusion of viewing ourselves as purely material creatures, then we define ourselves by the material. In defining ourselves by the material we seek to validate our lives by the material, so that especially means beautiful women, status, etc. That leads to attachment, craving, and non-attainment, leading to suffering. That is where all of these negative emotions you described come from. &lt;/p&gt;\n\n&lt;p&gt;The sense of purpose, meaning, and having a goal in the abstract sense, is metaphysical. Erikson calls this &amp;quot;self-identified&amp;quot;, so they are intertwined with your Being. I believe that you need to have this transcendent sense of self and self-concept, which can help you to be grounded. It causes you to see others in a more metaphysical way, that there is something amazingly fascinating and miraculous about this individual and you just want to know what exactly it is. I find from this comes deeper interactions and authenticity. &lt;/p&gt;\n\n&lt;p&gt;Thinking about death and non-existence really helped ground myself as well. In a sense, everyone and everything has already vanished. We are experiencing the world as it vanishes, and so the idea of being attached is absurd. It helps us deal with anxiety related to abandonment, and to eventually overcome it. Thich Nhat Hanh talks about that in his book &amp;quot;Fear&amp;quot;, calling this the seed of fear which is at the root of our ego. It&amp;#39;s interesting because the Prophet Muhammad in one quote said how the biggest trials in life for each other are men and women, because of everything you said; how we bring out from each other the deepest questions of our own lives existentially. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7xrkk", "score_hidden": false, "stickied": false, "created": 1492134994.0, "created_utc": 1492106194.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg85hpb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CibrecaNA", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Great article.  Thanks a lot!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great article.  Thanks a lot!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg85hpb", "score_hidden": false, "stickied": false, "created": 1492143345.0, "created_utc": 1492114545.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg8a138", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WilliamThomson", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "To put it simply, if she's giving you 6/10 amount of attention, you give her 5.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To put it simply, if she&amp;#39;s giving you 6/10 amount of attention, you give her 5.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg8a138", "score_hidden": false, "stickied": false, "created": 1492148640.0, "created_utc": 1492119840.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg9p6wh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "broccoli49", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Seriously, this is the best thread on Reddit, thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seriously, this is the best thread on Reddit, thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9p6wh", "score_hidden": false, "stickied": false, "created": 1492230410.0, "created_utc": 1492201610.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg6lhhz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Albatrots71", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Very well written article. Thanks for sharing!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very well written article. Thanks for sharing!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6lhhz", "score_hidden": false, "stickied": false, "created": 1492061403.0, "created_utc": 1492032603.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg6zvsn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "brucewainnn", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Amazing read.\n\nI was wondering what your school of thought was in regard to approaching woman without being or seen as needy? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Amazing read.&lt;/p&gt;\n\n&lt;p&gt;I was wondering what your school of thought was in regard to approaching woman without being or seen as needy? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg6zvsn", "score_hidden": false, "stickied": false, "created": 1492079098.0, "created_utc": 1492050298.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg76h5o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "selux", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Oh boy. Nice write up ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh boy. Nice write up &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg76h5o", "score_hidden": false, "stickied": false, "created": 1492088729.0, "created_utc": 1492059929.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg79lfp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "h6d", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Dude your the best", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude your the best&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg79lfp", "score_hidden": false, "stickied": false, "created": 1492095742.0, "created_utc": 1492066942.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg7am4v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DLC_88", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Great article! This is a huge eye opener!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great article! This is a huge eye opener!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7am4v", "score_hidden": false, "stickied": false, "created": 1492098556.0, "created_utc": 1492069756.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg8ryvd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spore2012", "parent_id": "t1_dg8m56m", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You are missing the point. The point is that whatever the opinion of the mods is, is the only thing allowed to be posted in that sub. I dont give a shit about being banned.\n\nIts just as bad as /r/askwomen or any of the other ridiculously biased terrible subreddits. \n\n\"If you don't assimilate into our doctrine, we silence you.\" Any modality like that is immediately suspect for starters. Because like you said, they don't allow the free flow of knowledge and ideas for power, as you said. Which is false empowerment, I mean you basically sound like a women's rights group. Just change all the nouns and it's the same.\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are missing the point. The point is that whatever the opinion of the mods is, is the only thing allowed to be posted in that sub. I dont give a shit about being banned.&lt;/p&gt;\n\n&lt;p&gt;Its just as bad as &lt;a href=\"/r/askwomen\"&gt;/r/askwomen&lt;/a&gt; or any of the other ridiculously biased terrible subreddits. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;If you don&amp;#39;t assimilate into our doctrine, we silence you.&amp;quot; Any modality like that is immediately suspect for starters. Because like you said, they don&amp;#39;t allow the free flow of knowledge and ideas for power, as you said. Which is false empowerment, I mean you basically sound like a women&amp;#39;s rights group. Just change all the nouns and it&amp;#39;s the same.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg8ryvd", "score_hidden": false, "stickied": false, "created": 1492174097.0, "created_utc": 1492145297.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8m56m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "19RomeoQuebec", "parent_id": "t1_dg8j5dt", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "How many times do you think I have been banned? I was banned several times, but the information outweighs any personal feelings I have about the sub.  Knowledge is power, and the right knowledge is empowerment.  \n\n\nJust cause you were banned once or twice doesn't mean you should give up.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How many times do you think I have been banned? I was banned several times, but the information outweighs any personal feelings I have about the sub.  Knowledge is power, and the right knowledge is empowerment.  &lt;/p&gt;\n\n&lt;p&gt;Just cause you were banned once or twice doesn&amp;#39;t mean you should give up.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg8m56m", "score_hidden": false, "stickied": false, "created": 1492164970.0, "created_utc": 1492136170.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8j5dt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spore2012", "parent_id": "t1_dg8dn0k", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "yea i know all about trp, i been lurking there ever since i was banned aka censored, for not conforming to their circlejerk. like i said, its not the healthiest way to live and the basic level human behavior psychology understanding is pretty obvious. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yea i know all about trp, i been lurking there ever since i was banned aka censored, for not conforming to their circlejerk. like i said, its not the healthiest way to live and the basic level human behavior psychology understanding is pretty obvious. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg8j5dt", "score_hidden": false, "stickied": false, "created": 1492160813.0, "created_utc": 1492132013.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8dn0k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "19RomeoQuebec", "parent_id": "t1_dg8cu3m", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": " &gt; While it is true, you can apply generalizations and be accurate most of the time, its not always the case and a lot of what is preached in TRP is not healthy long term and not going to lead to a satisfactory life.\n\n\n\nTRP is about being a man, it is about **LEADERSHIP** in a world full of feminist propaganda.  The articles, ideas, and philosophies in TRP are guides to produce better men.  A man who is a leader, in all aspects of his life.  PUA and Seduction do not accomplish that.  TRP does, because it encompasses PUA, Seduction and everything in between.\n\n\nTRP gives you the knowledge to deal with current male and female issues.\n\n\n\nTRP is not for certain dudes to be better with certain women.  It is a bastion of knowledge for all men to better with all women. \n\n\n\nI wish for all to see the comments and debate that is currently happening in this post.   This is probably the most debated and talked about post in seduction at the moment.  Because that is what TRP does, it creates a platform of discussion, a substance to debate about.  It is not meant to be shoved down your throat it is used to increase your knowledge and open up your mind.", "edited": 1492124752.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;While it is true, you can apply generalizations and be accurate most of the time, its not always the case and a lot of what is preached in TRP is not healthy long term and not going to lead to a satisfactory life.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;TRP is about being a man, it is about &lt;strong&gt;LEADERSHIP&lt;/strong&gt; in a world full of feminist propaganda.  The articles, ideas, and philosophies in TRP are guides to produce better men.  A man who is a leader, in all aspects of his life.  PUA and Seduction do not accomplish that.  TRP does, because it encompasses PUA, Seduction and everything in between.&lt;/p&gt;\n\n&lt;p&gt;TRP gives you the knowledge to deal with current male and female issues.&lt;/p&gt;\n\n&lt;p&gt;TRP is not for certain dudes to be better with certain women.  It is a bastion of knowledge for all men to better with all women. &lt;/p&gt;\n\n&lt;p&gt;I wish for all to see the comments and debate that is currently happening in this post.   This is probably the most debated and talked about post in seduction at the moment.  Because that is what TRP does, it creates a platform of discussion, a substance to debate about.  It is not meant to be shoved down your throat it is used to increase your knowledge and open up your mind.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg8dn0k", "score_hidden": false, "stickied": false, "created": 1492153338.0, "created_utc": 1492124538.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8cu3m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spore2012", "parent_id": "t1_dg850oi", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "For the kinda reasons the other big reply in this thread stated. \n\nTRP is similar to seduction, only that the dudes there are certain kinds of dudes and dating certain kinds of women. And they believe that all women and all dudes are always black and white. While it is true, you can apply generalizations and be accurate most of the time, its not always the case and a lot of what is preached in TRP is not healthy long term and not going to lead to a satisfactory life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For the kinda reasons the other big reply in this thread stated. &lt;/p&gt;\n\n&lt;p&gt;TRP is similar to seduction, only that the dudes there are certain kinds of dudes and dating certain kinds of women. And they believe that all women and all dudes are always black and white. While it is true, you can apply generalizations and be accurate most of the time, its not always the case and a lot of what is preached in TRP is not healthy long term and not going to lead to a satisfactory life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg8cu3m", "score_hidden": false, "stickied": false, "created": 1492152274.0, "created_utc": 1492123474.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg850oi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "19RomeoQuebec", "parent_id": "t1_dg7f6t8", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I don't understand why the seduction peeps aren't diving in head first into the TRP SUB.  Its a complete game changer, for all neckbeards.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t understand why the seduction peeps aren&amp;#39;t diving in head first into the TRP SUB.  Its a complete game changer, for all neckbeards.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg850oi", "score_hidden": false, "stickied": false, "created": 1492142819.0, "created_utc": 1492114019.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg8cw8l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Woujo", "parent_id": "t1_dg8cjva", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "no", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;no&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg8cw8l", "score_hidden": false, "stickied": false, "created": 1492152351.0, "created_utc": 1492123551.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8cjva", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spore2012", "parent_id": "t1_dg7iipm", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "did you modify it to post here?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;did you modify it to post here?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg8cjva", "score_hidden": false, "stickied": false, "created": 1492151897.0, "created_utc": 1492123097.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7iipm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Woujo", "parent_id": "t1_dg7f6t8", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "yeah I wrote it and posted it there too", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeah I wrote it and posted it there too&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7iipm", "score_hidden": false, "stickied": false, "created": 1492117737.0, "created_utc": 1492088937.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7f6t8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spore2012", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "This is a repost from TRP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a repost from TRP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7f6t8", "score_hidden": false, "stickied": false, "created": 1492111775.0, "created_utc": 1492082975.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_64zv67", "likes": null, "replies": "", "user_reports": [], "id": "dg87uhg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "futmut", "parent_id": "t1_dg87k59", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You are too emotionally invested.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are too emotionally invested.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg87uhg", "score_hidden": false, "stickied": false, "created": 1492145988.0, "created_utc": 1492117188.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87k59", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Woujo", "parent_id": "t1_dg86k9i", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt; you think you got whatever game and you know women but your plain wrong.\n\nyou're", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;you think you got whatever game and you know women but your plain wrong.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;you&amp;#39;re&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg87k59", "score_hidden": false, "stickied": false, "created": 1492145670.0, "created_utc": 1492116870.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86k9i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "futmut", "parent_id": "t3_64zv67", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "TlDr so much crap into this really...prolly some random chode who got casually laid and thinks he got everything...sorry to break it to you budy but you wrote a lot of bs and i couldnt finish reading all the crap you write down..you think you got whatever game and you know women but your plain wrong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;TlDr so much crap into this really...prolly some random chode who got casually laid and thinks he got everything...sorry to break it to you budy but you wrote a lot of bs and i couldnt finish reading all the crap you write down..you think you got whatever game and you know women but your plain wrong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg86k9i", "score_hidden": false, "stickied": false, "created": 1492144532.0, "created_utc": 1492115732.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]