[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "seduction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am at a point where I am old enough to share my experiences. A lot of you who came on to this sub came on here with one purpose and that is &lt;strong&gt;to fuck lots and lots of different women&lt;/strong&gt;. The reason most guys learn &amp;quot;game&amp;quot; is because they want to be &amp;quot;the man&amp;quot;. These guys want to get the hottest girls, have tons of sex with lots of different women, and have some fun stories to tell as they look back on their youth. I made this post for the readers of seddit and other places like it, it speaks a lot of truths which some people may not like.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Attractive women don&amp;#39;t disappear after college, in fact they become a lot more common depending on what city you&amp;#39;re in.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;It seems to be a common notion around here that you will never be around a lot of hot women after college, that is simply false. I went to a party school that at one point was known for having a lot of hot girls, still met a lot more hot girls in a lot of big cities. Hot girls do not disappear after college, anyone who tells you that is a loser. Speaking of hot girls, lets talk about what a lot of you want to do with hot girls...&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Getting hot girls, getting laid, and hooking up isn&amp;#39;t as enjoyable when you&amp;#39;re older. I will say that after the age of 25 it tends to lose its magic because you are no longer a part of something bigger than yourself anymore.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Getting laid and sleeping with that hot girl was fun in high school and even in college, because &lt;em&gt;every&lt;/em&gt; guy (or at least the vast majority) was trying to do it. You could brag about it, other guys respected you for it, and you felt like a celebrity if you slept with a hot girl on campus. You two were going through the same things in life and you felt like you were a part of something big whether it was a college or high school student.&lt;/p&gt;\n\n&lt;p&gt;You were a part of a student body where thousands were going through the same thing as you, there was a community, and everyone loosely knew each other. It was fun to get laid, have sex, and hook up on prom nights, formals, and in dorms because so many other people were doing it. Sex was more than sex, it was magic.&lt;/p&gt;\n\n&lt;p&gt;Well after school no one gives a fuck about you. People don&amp;#39;t place much value on sex or how much you get laid.&lt;/p&gt;\n\n&lt;p&gt;To put it differently, getting with a hot 20 year old is a lot more fun when you are 20 yourself as opposed to getting with her when you are 30 and in different stages of life.&lt;/p&gt;\n\n&lt;p&gt;It isn&amp;#39;t as enjoyable fucking randoms when most guys your age are getting married and becoming dads.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;You missed out because you were a misfit but thankfully women become more objective as you get older.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;When you&amp;#39;re younger, it&amp;#39;s not even about how handsome you are or how much game you have, it&amp;#39;s all about how cool you are. Overweight guy who is down with the cool kids gets more pussy than handsome guy who is a social outcast, that is the way it is in school settings. To an extent, it is like that in the real world but women become more independent and they choose objectively better guys. &lt;/p&gt;\n\n&lt;p&gt;In college she would have picked the overweight alcoholic over a handsome guy because he was in a fraternity, in the real world she will pick the handsome guy because he is handsome.&lt;/p&gt;\n\n&lt;p&gt;In college, the overweight guy could beat the handsome guy because he happened to be in a fraternity but the real world is much more objective, the better man on paper tends to win more often.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The internet makes it look easy but do not underestimate how tough it is to live the life full of lots of sex and fun, especially after 30.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;It is in a word highly difficult. &lt;/p&gt;\n\n&lt;p&gt;Sorry but making it to 30 as someone that isn&amp;#39;t fat, has a job, and has game &lt;em&gt;isn&amp;#39;t enough&lt;/em&gt; to live that sort of a life. If you want to live that life, you better be bringing something to the table that brings hot girls in. Club owner is one of the examples but not every guy can make it to that point. My point being, living that life is way more difficult than the internet makes it seem. Whatever you do, don&amp;#39;t be that creepy old guy trying to pick up younger women at the gym, parties, or the bar; it will rarely work unless you really lower your standards.&lt;/p&gt;\n\n&lt;p&gt;So if you are young and have aspirations of being that guy in adulthood, you better have a serious plan.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am at a point where I am old enough to share my experiences. A lot of you who came on to this sub came on here with one purpose and that is **to fuck lots and lots of different women**. The reason most guys learn \"game\" is because they want to be \"the man\". These guys want to get the hottest girls, have tons of sex with lots of different women, and have some fun stories to tell as they look back on their youth. I made this post for the readers of seddit and other places like it, it speaks a lot of truths which some people may not like.\n\n**Attractive women don't disappear after college, in fact they become a lot more common depending on what city you're in.**\n\nIt seems to be a common notion around here that you will never be around a lot of hot women after college, that is simply false. I went to a party school that at one point was known for having a lot of hot girls, still met a lot more hot girls in a lot of big cities. Hot girls do not disappear after college, anyone who tells you that is a loser. Speaking of hot girls, lets talk about what a lot of you want to do with hot girls...\n\n**Getting hot girls, getting laid, and hooking up isn't as enjoyable when you're older. I will say that after the age of 25 it tends to lose its magic because you are no longer a part of something bigger than yourself anymore.**\n\nGetting laid and sleeping with that hot girl was fun in high school and even in college, because *every* guy (or at least the vast majority) was trying to do it. You could brag about it, other guys respected you for it, and you felt like a celebrity if you slept with a hot girl on campus. You two were going through the same things in life and you felt like you were a part of something big whether it was a college or high school student.\n\nYou were a part of a student body where thousands were going through the same thing as you, there was a community, and everyone loosely knew each other. It was fun to get laid, have sex, and hook up on prom nights, formals, and in dorms because so many other people were doing it. Sex was more than sex, it was magic.\n\nWell after school no one gives a fuck about you. People don't place much value on sex or how much you get laid.\n\nTo put it differently, getting with a hot 20 year old is a lot more fun when you are 20 yourself as opposed to getting with her when you are 30 and in different stages of life.\n\nIt isn't as enjoyable fucking randoms when most guys your age are getting married and becoming dads.\n\n**You missed out because you were a misfit but thankfully women become more objective as you get older.**\n\nWhen you're younger, it's not even about how handsome you are or how much game you have, it's all about how cool you are. Overweight guy who is down with the cool kids gets more pussy than handsome guy who is a social outcast, that is the way it is in school settings. To an extent, it is like that in the real world but women become more independent and they choose objectively better guys. \n\nIn college she would have picked the overweight alcoholic over a handsome guy because he was in a fraternity, in the real world she will pick the handsome guy because he is handsome.\n\nIn college, the overweight guy could beat the handsome guy because he happened to be in a fraternity but the real world is much more objective, the better man on paper tends to win more often.\n\n**The internet makes it look easy but do not underestimate how tough it is to live the life full of lots of sex and fun, especially after 30.**\n\nIt is in a word highly difficult. \n\nSorry but making it to 30 as someone that isn't fat, has a job, and has game *isn't enough* to live that sort of a life. If you want to live that life, you better be bringing something to the table that brings hot girls in. Club owner is one of the examples but not every guy can make it to that point. My point being, living that life is way more difficult than the internet makes it seem. Whatever you do, don't be that creepy old guy trying to pick up younger women at the gym, parties, or the bar; it will rarely work unless you really lower your standards.\n\nSo if you are young and have aspirations of being that guy in adulthood, you better have a serious plan.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "652npj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "enjoyeddublin", "saved": false, "mod_reports": [], "name": "t3_652npj", "subreddit_name_prefixed": "r/seduction", "approved_by": null, "over_18": false, "domain": "self.seduction", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhrv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/seduction/comments/652npj/life_lessons_from_an_older_guy/", "num_reports": null, "locked": false, "stickied": false, "created": 1492077670.0, "url": "https://www.reddit.com/r/seduction/comments/652npj/life_lessons_from_an_older_guy/", "author_flair_text": null, "quarantine": false, "title": "Life lessons from an older guy.", "created_utc": 1492048870.0, "distinguished": null, "media": null, "upvote_ratio": 0.73, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_652npj", "likes": null, "replies": "", "user_reports": [], "id": "dg79vqc", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "SkatingOnThinIce", "parent_id": "t3_652npj", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I disagree on most of this but particularly on \"banging a 20yr old at 30 is not as much fun\".  It is always great fun.  I had the luck of sleeping with a 22yr old when I was 40 and it was great and better cos I knew all the tricks to make her cum like she never did before.   She slept with me because she wanted somebody that could teach her. That's a dream right there.  She just gave me card Blanc to do whatever I wanted.  \n\nI'm not particularly good looking but pleasant. I'm not in great shape but not fat. It's all in the confidence.\n\nGo out and enjoy as many women as you can.\n\nRight now. Stop reading.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I disagree on most of this but particularly on &amp;quot;banging a 20yr old at 30 is not as much fun&amp;quot;.  It is always great fun.  I had the luck of sleeping with a 22yr old when I was 40 and it was great and better cos I knew all the tricks to make her cum like she never did before.   She slept with me because she wanted somebody that could teach her. That&amp;#39;s a dream right there.  She just gave me card Blanc to do whatever I wanted.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not particularly good looking but pleasant. I&amp;#39;m not in great shape but not fat. It&amp;#39;s all in the confidence.&lt;/p&gt;\n\n&lt;p&gt;Go out and enjoy as many women as you can.&lt;/p&gt;\n\n&lt;p&gt;Right now. Stop reading.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg79vqc", "score_hidden": false, "stickied": false, "created": 1492096504.0, "created_utc": 1492067704.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_652npj", "likes": null, "replies": "", "user_reports": [], "id": "dg7069n", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AngeloMacon", "parent_id": "t3_652npj", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Well into my 30s, good looking and solid game, and I agree that it loses it charm.  If I'm banging a hot chick on the regular, I basically am only interested in other attractive women when I genuinely like them and lose possible bangs left and right just because of a why bother attitude.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well into my 30s, good looking and solid game, and I agree that it loses it charm.  If I&amp;#39;m banging a hot chick on the regular, I basically am only interested in other attractive women when I genuinely like them and lose possible bangs left and right just because of a why bother attitude.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7069n", "score_hidden": false, "stickied": false, "created": 1492079457.0, "created_utc": 1492050657.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_652npj", "likes": null, "replies": "", "user_reports": [], "id": "dg7hnc8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Xanarxses", "parent_id": "t3_652npj", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Well regardless it's good to know I don't have to worry.\n\n\nI'm so far out of the realm of game it's hilarious.\n\n\nBut s'all good, man.\n\n\nAin't gonna die without women.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well regardless it&amp;#39;s good to know I don&amp;#39;t have to worry.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m so far out of the realm of game it&amp;#39;s hilarious.&lt;/p&gt;\n\n&lt;p&gt;But s&amp;#39;all good, man.&lt;/p&gt;\n\n&lt;p&gt;Ain&amp;#39;t gonna die without women.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7hnc8", "score_hidden": false, "stickied": false, "created": 1492116411.0, "created_utc": 1492087611.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_652npj", "likes": null, "replies": "", "user_reports": [], "id": "dg89p2a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "iammrwill", "parent_id": "t3_652npj", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "It's not even about how hot a girl is anymore when you reach this age. Sure, physical looks are important and it feels good to be with a girl who's attractive but I really don't mind being with an above average girl if they have a good amount of character. I have gone through a bunch of 7's lately because they have a more down to earth personality and are way less high maintenance than a 9. They have proper priorities and are more focused on a having a drama free life.\n\n8.5+ girls are such a headache because society just bows down to them and it really impacts their overall view on life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not even about how hot a girl is anymore when you reach this age. Sure, physical looks are important and it feels good to be with a girl who&amp;#39;s attractive but I really don&amp;#39;t mind being with an above average girl if they have a good amount of character. I have gone through a bunch of 7&amp;#39;s lately because they have a more down to earth personality and are way less high maintenance than a 9. They have proper priorities and are more focused on a having a drama free life.&lt;/p&gt;\n\n&lt;p&gt;8.5+ girls are such a headache because society just bows down to them and it really impacts their overall view on life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg89p2a", "score_hidden": false, "stickied": false, "created": 1492148221.0, "created_utc": 1492119421.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_652npj", "likes": null, "replies": "", "user_reports": [], "id": "dg7mcgj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Jack__Knife", "parent_id": "t3_652npj", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "This is crap. \n\n-It gets easier.\n-Younger women are into older guys.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is crap. &lt;/p&gt;\n\n&lt;p&gt;-It gets easier.\n-Younger women are into older guys.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7mcgj", "score_hidden": false, "stickied": false, "created": 1492122683.0, "created_utc": 1492093883.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_652npj", "likes": null, "replies": "", "user_reports": [], "id": "dg70nsi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sceptersc", "parent_id": "t3_652npj", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You get better with women when you go out. Go out as often as possible. Hit on women you think are hot as much as possible. You don't have to be a club owner man. You just have to hone those skills. And if you are above 30 you might be more selective. It might not be enough that she's got a nice ass and a nice face. It might be something else. But no matter what age you are. If you are lazy and don't go out meeting women you will suck with seduction. Being a club owner only helps because you are used to talking to a bunch of people/women on a regular basis. You are used to being in that environment. I refuse to believe to you have to be a millionaire to be with tens. You just have to have good game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You get better with women when you go out. Go out as often as possible. Hit on women you think are hot as much as possible. You don&amp;#39;t have to be a club owner man. You just have to hone those skills. And if you are above 30 you might be more selective. It might not be enough that she&amp;#39;s got a nice ass and a nice face. It might be something else. But no matter what age you are. If you are lazy and don&amp;#39;t go out meeting women you will suck with seduction. Being a club owner only helps because you are used to talking to a bunch of people/women on a regular basis. You are used to being in that environment. I refuse to believe to you have to be a millionaire to be with tens. You just have to have good game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg70nsi", "score_hidden": false, "stickied": false, "created": 1492080078.0, "created_utc": 1492051278.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_652npj", "likes": null, "replies": "", "user_reports": [], "id": "dg7s84q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "failatsomething", "parent_id": "t3_652npj", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Dude. The whole purpose of sex is not to get high fives from your bros. You seem to be disappointed that bros aren't around anymore to hand out high fives. \n\n&gt; When you're younger, it's not even about how handsome you are or how much game you have, it's all about how cool you are.\n\nCool = game. \n\n&gt; Overweight guy who is down with the cool kids gets more pussy than handsome guy who is a social outcast, that is the way it is in school settings. To an extent, it is like that in the real world but women become more independent and they choose objectively better guys.\n\nDudes with high status get more puss. In college and in post-grad life. Being down with the cool kids = high status due to access to parties, fun activities. \n\n&gt; In college she would have picked the overweight alcoholic over a handsome guy because he was in a fraternity, in the real world she will pick the handsome guy because he is handsome.\n\nWrong again. Value and status win out over everything. A strong jaw line is just one very small factor that is a sign of potential value. Fat boss is more attractive than good-looking mailboy when all else is equal.\n\n&gt; In college, the overweight guy could beat the handsome guy because he happened to be in a fraternity but the real world is much more objective, the better man on paper tends to win more often.\n\nThe guy with a full social schedule who's hanging around girls constantly is more attractive than a better looking man without the rest of his life in order. In college and after.\n\n&gt; The internet makes it look easy but do not underestimate how tough it is to live the life full of lots of sex and fun, especially after 30.\n\nYou become more attractive to women as you age because you bring more wisdom and experience to the table. Women value wisdom and experience, where dudes don't. So ya, this statement is also false. \n\n&gt;It is in a word highly difficult.\n\n2 words. \n\n&gt; Sorry but making it to 30 as someone that isn't fat, has a job, and has game isn't enough to live that sort of a life. \n\nActually, it's more than enough. All you need is game :) \n\nThere's a lot that goes into having game, but it's the only thing you need to have a busy sex life. \n\n&gt; If you want to live that life, you better be bringing something to the table that brings hot girls in. Club owner is one of the examples but not every guy can make it to that point. My point being, living that life is way more difficult than the internet makes it seem.\n\nThe club owner = the fraternity brother. High status member of his community that surrounds himself with chicks. Learn from both. \n\nToo hard for you? Don't want to be a club owner but still want to slay like one? Become his friend. Owning a boat sucks but I like going sailing lol. \n\n&gt; Whatever you do, don't be that creepy old guy trying to pick up younger women at the gym, parties, or the bar; it will rarely work unless you really lower your standards.\n\nlol you're telling dudes to lower their standards by dating older women.\n\nAnd again, women are attracted to older dudes.\n\n&gt; So if you are young and have aspirations of being that guy in adulthood, you better have a serious plan.\n\nYa. You should have a plan. I don't disagree with you on this. \n\nIn summary, this sounds like it was written by a chick, or the guy who had a strong sex life in high school (probably an athlete) and clings to those memories in a selfish and unhealthy way instead of choosing to adapt to new environments, and instead of learning game. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude. The whole purpose of sex is not to get high fives from your bros. You seem to be disappointed that bros aren&amp;#39;t around anymore to hand out high fives. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;When you&amp;#39;re younger, it&amp;#39;s not even about how handsome you are or how much game you have, it&amp;#39;s all about how cool you are.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Cool = game. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Overweight guy who is down with the cool kids gets more pussy than handsome guy who is a social outcast, that is the way it is in school settings. To an extent, it is like that in the real world but women become more independent and they choose objectively better guys.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Dudes with high status get more puss. In college and in post-grad life. Being down with the cool kids = high status due to access to parties, fun activities. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In college she would have picked the overweight alcoholic over a handsome guy because he was in a fraternity, in the real world she will pick the handsome guy because he is handsome.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Wrong again. Value and status win out over everything. A strong jaw line is just one very small factor that is a sign of potential value. Fat boss is more attractive than good-looking mailboy when all else is equal.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In college, the overweight guy could beat the handsome guy because he happened to be in a fraternity but the real world is much more objective, the better man on paper tends to win more often.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The guy with a full social schedule who&amp;#39;s hanging around girls constantly is more attractive than a better looking man without the rest of his life in order. In college and after.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The internet makes it look easy but do not underestimate how tough it is to live the life full of lots of sex and fun, especially after 30.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You become more attractive to women as you age because you bring more wisdom and experience to the table. Women value wisdom and experience, where dudes don&amp;#39;t. So ya, this statement is also false. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It is in a word highly difficult.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;2 words. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Sorry but making it to 30 as someone that isn&amp;#39;t fat, has a job, and has game isn&amp;#39;t enough to live that sort of a life. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Actually, it&amp;#39;s more than enough. All you need is game :) &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a lot that goes into having game, but it&amp;#39;s the only thing you need to have a busy sex life. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If you want to live that life, you better be bringing something to the table that brings hot girls in. Club owner is one of the examples but not every guy can make it to that point. My point being, living that life is way more difficult than the internet makes it seem.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The club owner = the fraternity brother. High status member of his community that surrounds himself with chicks. Learn from both. &lt;/p&gt;\n\n&lt;p&gt;Too hard for you? Don&amp;#39;t want to be a club owner but still want to slay like one? Become his friend. Owning a boat sucks but I like going sailing lol. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Whatever you do, don&amp;#39;t be that creepy old guy trying to pick up younger women at the gym, parties, or the bar; it will rarely work unless you really lower your standards.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;lol you&amp;#39;re telling dudes to lower their standards by dating older women.&lt;/p&gt;\n\n&lt;p&gt;And again, women are attracted to older dudes.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So if you are young and have aspirations of being that guy in adulthood, you better have a serious plan.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ya. You should have a plan. I don&amp;#39;t disagree with you on this. &lt;/p&gt;\n\n&lt;p&gt;In summary, this sounds like it was written by a chick, or the guy who had a strong sex life in high school (probably an athlete) and clings to those memories in a selfish and unhealthy way instead of choosing to adapt to new environments, and instead of learning game. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7s84q", "score_hidden": false, "stickied": false, "created": 1492129102.0, "created_utc": 1492100302.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_652npj", "likes": null, "replies": "", "user_reports": [], "id": "dg8mnvx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BloodNinja45", "parent_id": "t3_652npj", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Everyone is different.\n\nIt seems like the guys who were successful in high school and college in sleeping with hot girls get tired of it in their old age.\n\nBut that's like the rich kid telling everyone that being rich isn't a big deal.\n\nSorry, but if a poor guy wins the lottery in his 30s, it's going to be awesome.\n\nIt's all about perspective.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everyone is different.&lt;/p&gt;\n\n&lt;p&gt;It seems like the guys who were successful in high school and college in sleeping with hot girls get tired of it in their old age.&lt;/p&gt;\n\n&lt;p&gt;But that&amp;#39;s like the rich kid telling everyone that being rich isn&amp;#39;t a big deal.&lt;/p&gt;\n\n&lt;p&gt;Sorry, but if a poor guy wins the lottery in his 30s, it&amp;#39;s going to be awesome.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s all about perspective.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg8mnvx", "score_hidden": false, "stickied": false, "created": 1492165703.0, "created_utc": 1492136903.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]