[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "seduction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;And I know it&amp;#39;s my fault because I&amp;#39;m so quiet. Even when I do speak up there&amp;#39;s a silence, followed by a head glance or two, then people go back to conversing about their dogs and how they saved up so much for a vanity. I speak loudly and clearly and try to get a conversation going amongst the group but no one gives a fuck about what I say. &lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t matter if I join a dodgeball League, a social anxiety group, or salsa dance class and we go out for a drink after for all 3 activities. None of these people have an interest in a word I have to say and each group is dominated by 1 or 2 people talking about themselves and their dog and how dating sucks. All these people avoid contact like the plague when I try to look them in the eyes. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s like I&amp;#39;m a ghost. I walk around with great posture and positive body language and maximize my appearance. I value myself very highly and have high self esteem and feel like I project positive energy. The only problem I have is that I have aspergers, and paranoid schizophrenia and I feel people treat me like I&amp;#39;m retarded. I&amp;#39;ve even had people the last few days tell me to &amp;quot;stop staring at them&amp;quot; when I often zone out and get lost in a train of thought. I politely tell them to fuck off because it&amp;#39;s a free country and I can look wherever I want. &lt;/p&gt;\n\n&lt;p&gt;I do not plan on going out again with any of these people outside of the activities. &lt;/p&gt;\n\n&lt;p&gt;Where can I go from here? It&amp;#39;d be nice just to make a single friend and go from there. I&amp;#39;m not even worried about pick up at this point. I just want people to vibe well with me and enjoy my company. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "And I know it's my fault because I'm so quiet. Even when I do speak up there's a silence, followed by a head glance or two, then people go back to conversing about their dogs and how they saved up so much for a vanity. I speak loudly and clearly and try to get a conversation going amongst the group but no one gives a fuck about what I say. \n\nIt doesn't matter if I join a dodgeball League, a social anxiety group, or salsa dance class and we go out for a drink after for all 3 activities. None of these people have an interest in a word I have to say and each group is dominated by 1 or 2 people talking about themselves and their dog and how dating sucks. All these people avoid contact like the plague when I try to look them in the eyes. \n\nIt's like I'm a ghost. I walk around with great posture and positive body language and maximize my appearance. I value myself very highly and have high self esteem and feel like I project positive energy. The only problem I have is that I have aspergers, and paranoid schizophrenia and I feel people treat me like I'm retarded. I've even had people the last few days tell me to \"stop staring at them\" when I often zone out and get lost in a train of thought. I politely tell them to fuck off because it's a free country and I can look wherever I want. \n\nI do not plan on going out again with any of these people outside of the activities. \n\nWhere can I go from here? It'd be nice just to make a single friend and go from there. I'm not even worried about pick up at this point. I just want people to vibe well with me and enjoy my company. \n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "653cdq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "Austonmatthews345", "saved": false, "mod_reports": [], "name": "t3_653cdq", "subreddit_name_prefixed": "r/seduction", "approved_by": null, "over_18": false, "domain": "self.seduction", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhrv", "edited": 1492057788.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/seduction/comments/653cdq/nobody_likes_me_no_matter_how_hard_i_try/", "num_reports": null, "locked": false, "stickied": false, "created": 1492086201.0, "url": "https://www.reddit.com/r/seduction/comments/653cdq/nobody_likes_me_no_matter_how_hard_i_try/", "author_flair_text": null, "quarantine": false, "title": "Nobody likes me no matter how hard I try", "created_utc": 1492057401.0, "distinguished": null, "media": null, "upvote_ratio": 0.63, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_653cdq", "likes": null, "replies": "", "user_reports": [], "id": "dg7gepg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "_TurnuptheSun_", "parent_id": "t3_653cdq", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "What will improve your social and dating life is taking massive action and getting out of your comfort zone. There is no greater satisfaction than shattering limiting self-beliefs through action.\nIf things aren't working, you need to double down, or adjust approach, no wallowing in self-pity. Is there any sport/activity that you're even half interested in trying? Go do it. Don't have anyone to go with? Even better, you can practice your social skills there. If things get awkward, ask people why they're doing said activity, that always gets interesting answers.Keep going to events until you find like-minded people, and then invite them to do something; bowling, d&amp;d party, satan worshipping, doesn't matter -- just no more waiting around for people to come to you, okay? Remember, we \"build\" a social circle, we don't \"acquire\" one.\n\nYou can incorporate meeting girls into this social project too. Talk to girls in your course after class. Fuck it, talk to everyone, be social and don't judge yourself when you're starting out. It doesn't matter what the content is, as long as you're making the effort to talk to people and get to know them. If you do what I've listed above, no excuses, I guarantee you will make friends and find girls who are into you for you. This video is pretty useful on this subject; he talks in depth about how to build a social circle and meet girls in college: https://www.youtube.com/watch?v=5h4LuoNnEKA&amp;t=441s\n\nAlong with making the effort to get out more, continue working on your mental health. Try meditating. Sit in a chair, hands on your lap, focusing on trying to stay present to the moment -- it's a lot harder than it sounds! When I started, I could barely do a minute, now I'm at something like 10. It's really helped me manage anxiety and focus on managing one thing at a time, rather than just getting overwhelmed by the enormity of all my responsibilities. Other than that, the only thing is to make a conscious effort to stay positive. This might sound overly simple, but having a positive mindset regardless of your life situation is vital. Accept that life is going to suck sometimes, that you're going to have periods of uncertainty and stress, and that oftentimes things won't work out the way you had hoped. At the same time take steps to improve your situation and trust that if you work hard, you will get to a point where you you're happier in yourself. The means to adapting these mindsets are explored in-depth here: https://www.youtube.com/watch?v=QxonYxj3pdE", "edited": 1492088188.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What will improve your social and dating life is taking massive action and getting out of your comfort zone. There is no greater satisfaction than shattering limiting self-beliefs through action.\nIf things aren&amp;#39;t working, you need to double down, or adjust approach, no wallowing in self-pity. Is there any sport/activity that you&amp;#39;re even half interested in trying? Go do it. Don&amp;#39;t have anyone to go with? Even better, you can practice your social skills there. If things get awkward, ask people why they&amp;#39;re doing said activity, that always gets interesting answers.Keep going to events until you find like-minded people, and then invite them to do something; bowling, d&amp;amp;d party, satan worshipping, doesn&amp;#39;t matter -- just no more waiting around for people to come to you, okay? Remember, we &amp;quot;build&amp;quot; a social circle, we don&amp;#39;t &amp;quot;acquire&amp;quot; one.&lt;/p&gt;\n\n&lt;p&gt;You can incorporate meeting girls into this social project too. Talk to girls in your course after class. Fuck it, talk to everyone, be social and don&amp;#39;t judge yourself when you&amp;#39;re starting out. It doesn&amp;#39;t matter what the content is, as long as you&amp;#39;re making the effort to talk to people and get to know them. If you do what I&amp;#39;ve listed above, no excuses, I guarantee you will make friends and find girls who are into you for you. This video is pretty useful on this subject; he talks in depth about how to build a social circle and meet girls in college: &lt;a href=\"https://www.youtube.com/watch?v=5h4LuoNnEKA&amp;amp;t=441s\"&gt;https://www.youtube.com/watch?v=5h4LuoNnEKA&amp;amp;t=441s&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Along with making the effort to get out more, continue working on your mental health. Try meditating. Sit in a chair, hands on your lap, focusing on trying to stay present to the moment -- it&amp;#39;s a lot harder than it sounds! When I started, I could barely do a minute, now I&amp;#39;m at something like 10. It&amp;#39;s really helped me manage anxiety and focus on managing one thing at a time, rather than just getting overwhelmed by the enormity of all my responsibilities. Other than that, the only thing is to make a conscious effort to stay positive. This might sound overly simple, but having a positive mindset regardless of your life situation is vital. Accept that life is going to suck sometimes, that you&amp;#39;re going to have periods of uncertainty and stress, and that oftentimes things won&amp;#39;t work out the way you had hoped. At the same time take steps to improve your situation and trust that if you work hard, you will get to a point where you you&amp;#39;re happier in yourself. The means to adapting these mindsets are explored in-depth here: &lt;a href=\"https://www.youtube.com/watch?v=QxonYxj3pdE\"&gt;https://www.youtube.com/watch?v=QxonYxj3pdE&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7gepg", "score_hidden": false, "stickied": false, "created": 1492114299.0, "created_utc": 1492085499.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_653cdq", "likes": null, "replies": "", "user_reports": [], "id": "dg77lwo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "omg_giraffe", "parent_id": "t3_653cdq", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Pickup in the club is a great playground to experiment in and try new things and calibrate with very little repercussions.\n\nI would recommend finding a newbie wing you vibe well with (who takes lots of action) on an RSD inner circle group and just spam approach girls in the club with him.\n\nIn the club you can play around with polarising, eye contact, negs etc with very little negative consequences.\n\nAlso, girls give very rapid and accurate feedback!\n\nI know you say you're not even worried about pickup, but the club is the best playground to advance and calibrate your social personality!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pickup in the club is a great playground to experiment in and try new things and calibrate with very little repercussions.&lt;/p&gt;\n\n&lt;p&gt;I would recommend finding a newbie wing you vibe well with (who takes lots of action) on an RSD inner circle group and just spam approach girls in the club with him.&lt;/p&gt;\n\n&lt;p&gt;In the club you can play around with polarising, eye contact, negs etc with very little negative consequences.&lt;/p&gt;\n\n&lt;p&gt;Also, girls give very rapid and accurate feedback!&lt;/p&gt;\n\n&lt;p&gt;I know you say you&amp;#39;re not even worried about pickup, but the club is the best playground to advance and calibrate your social personality!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg77lwo", "score_hidden": false, "stickied": false, "created": 1492090962.0, "created_utc": 1492062162.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_653cdq", "likes": null, "replies": "", "user_reports": [], "id": "dg7nmby", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Jack__Knife", "parent_id": "t3_653cdq", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "It's probably your mothers fault. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s probably your mothers fault. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7nmby", "score_hidden": false, "stickied": false, "created": 1492124153.0, "created_utc": 1492095353.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_653cdq", "likes": null, "replies": "", "user_reports": [], "id": "dg7dxke", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mitsigan", "parent_id": "t3_653cdq", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I am the same. Many times I am in a group and people around me talk about a subject I am very familiar with and even though I know many things on the subject I just stand there silent.\n\nI used to think it was my voice. It's too deep and others with higher voice cover mine. But now I believe it's confidence. I wasn't talking with enough confidence. The volume of my voice was below the volumes of the others and this was because I wasn't sure people would like what I would say. \n\nNowadays I don't care if I am too loud. I say what I have to say and people have to hear me so I speak louder.\n\nAlso a thing I accepted about myself is that I prefer hanging with smaller groups of people than bigger, or even on person.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am the same. Many times I am in a group and people around me talk about a subject I am very familiar with and even though I know many things on the subject I just stand there silent.&lt;/p&gt;\n\n&lt;p&gt;I used to think it was my voice. It&amp;#39;s too deep and others with higher voice cover mine. But now I believe it&amp;#39;s confidence. I wasn&amp;#39;t talking with enough confidence. The volume of my voice was below the volumes of the others and this was because I wasn&amp;#39;t sure people would like what I would say. &lt;/p&gt;\n\n&lt;p&gt;Nowadays I don&amp;#39;t care if I am too loud. I say what I have to say and people have to hear me so I speak louder.&lt;/p&gt;\n\n&lt;p&gt;Also a thing I accepted about myself is that I prefer hanging with smaller groups of people than bigger, or even on person.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg7dxke", "score_hidden": false, "stickied": false, "created": 1492108546.0, "created_utc": 1492079746.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]