[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "seduction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;24th March 2017. I was with my friend in a club, my friend opened her friend and got physical a little bit on the dance floor, I opened this Middle-Eastern-looking Australian girl. She said she&amp;#39;s of Italian descent. I told her I find her so exotic and she laughed. After chatting briefly, some dude she interacted with earlier took her away.&lt;/p&gt;\n\n&lt;p&gt;Later outside the club, I saw them again, they&amp;#39;re leaving the club, so I re-approached them. The one I talked to instantly took and held my hand and asked if we could get them some food and take them to their villa. They&amp;#39;re on holiday on this island and renting a big luxurious villa. Ok, so we walked with them to McD, quite a long walk, 15 minutes. And our mistake was that from McD we gotta take another 15-20 minutes to get back to the initial place where we parked our motorbike. But I thought it was good since we had more time to build comfort and trust. We were 4 people alone walking on a dark street at 4.30AM, bounced them around to create time distortion. I wasn&amp;#39;t entirely wrong, I was holding hands with my girl the entire journey. She threw some statement of intents to me, &amp;quot;You&amp;#39;re so cute&amp;quot; while touching my cheek, &amp;quot;Your accent is so different&amp;quot;, etc. We had some sexual conversation such as the one where she said to her friend jokingly that we could rape them in dark alley and put babies on them and it was actually a really good sign that she brought up sex out of the blue.&lt;/p&gt;\n\n&lt;p&gt;In McD, I continued to vibe more and exchange contacts. She had neither Facebook nor WhatsApp, but I got her Instagram and her friend&amp;#39;s Facebook. She wanted to order one more burger after finishing her first one and asked my friend if I would judge her. I liked it. But then her boyfriend called her from Australia and she looked stressed. &lt;/p&gt;\n\n&lt;p&gt;So after the meal, my friend tried to persuade her friend to walk with us all the way back to get our motorbikes so that we could take them home. But my girl said to her friend &amp;quot;We got to get up early tomorrow, Jen.&amp;quot; or something along that line. They wanted to just get a cab and stated they will be around for a few days. So we walked out, she became different after her boyfriend called her but still took the initiative to take and hold my hand again when we&amp;#39;re walking out of the restaurant. We went to the beach briefly when I was trying to get them an Uber taxi, my girl looked happy and ethusiastic about the beach. Then we got them a cab. Before she got into the cab, we held hands, hugged and I kissed her. It was a very brief 2-second make out. I believed I did a mistake her saying &amp;quot;So I&amp;#39;m gonna see you again?&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;It was 5AM and I had to work in the morning by 7AM. I almost didn&amp;#39;t go out but decided to push myself and apparently turned out to be the best night I ever had during my pickup journey and and the farthest I ever went at that time. I was beat at work but it was totally worth it. Haha. If it wasn&amp;#39;t my work, I probably would have suggested that we go into the cab with them.&lt;/p&gt;\n\n&lt;p&gt;Then I texted her on Instagram about 20 minutes after we parted ways and let me break down.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://i.imgur.com/l6Xilzc.png\"&gt;http://i.imgur.com/l6Xilzc.png&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The general rule that I learn is that &lt;strong&gt;don&amp;#39;t flood the girl with text conversation, only contact them to set up a date&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&amp;quot;Hey, you&amp;#39;re home safe&amp;quot;&lt;/strong&gt; -&amp;gt; I texted her right away so that she didn&amp;#39;t forget who I was.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&amp;quot;&lt;em&gt;kiss&lt;/em&gt; Where are you?&amp;quot;&lt;/strong&gt; -&amp;gt; The next message was sent 10 hours later to show that I had something else to do and didn&amp;#39;t give her all my attention. She didn&amp;#39;t reply.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&amp;quot;...?&amp;quot;&lt;/strong&gt; -&amp;gt; I sent it 3 hours later when I didn&amp;#39;t get replied. Maybe at first glance looking a little needy, it&amp;#39;s a specific technique I learned from RSD Todd to assert that I deserve her and I demand a response&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&amp;quot;I&amp;#39;ll take you to a good club later in Seminyak. What time will you get home?&amp;quot;&lt;/strong&gt; -&amp;gt; Simply assumed that she&amp;#39;s gonna go with me and not being permission seeking. But as you see, it didn&amp;#39;t work that well.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&amp;quot;What&amp;#39;s happening tonight&amp;quot;&lt;/strong&gt; followed by another &lt;strong&gt;&amp;quot;...?&amp;quot;&lt;/strong&gt; -&amp;gt; Another attempt to show her that I demand a response and an explanation of why she refused to meet me tonight and she stopped replying.&lt;/p&gt;\n\n&lt;p&gt;I wonder how it would have ended if her boyfriend didn&amp;#39;t call her that time. though.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "24th March 2017. I was with my friend in a club, my friend opened her friend and got physical a little bit on the dance floor, I opened this Middle-Eastern-looking Australian girl. She said she's of Italian descent. I told her I find her so exotic and she laughed. After chatting briefly, some dude she interacted with earlier took her away.\n\nLater outside the club, I saw them again, they're leaving the club, so I re-approached them. The one I talked to instantly took and held my hand and asked if we could get them some food and take them to their villa. They're on holiday on this island and renting a big luxurious villa. Ok, so we walked with them to McD, quite a long walk, 15 minutes. And our mistake was that from McD we gotta take another 15-20 minutes to get back to the initial place where we parked our motorbike. But I thought it was good since we had more time to build comfort and trust. We were 4 people alone walking on a dark street at 4.30AM, bounced them around to create time distortion. I wasn't entirely wrong, I was holding hands with my girl the entire journey. She threw some statement of intents to me, \"You're so cute\" while touching my cheek, \"Your accent is so different\", etc. We had some sexual conversation such as the one where she said to her friend jokingly that we could rape them in dark alley and put babies on them and it was actually a really good sign that she brought up sex out of the blue.\n\nIn McD, I continued to vibe more and exchange contacts. She had neither Facebook nor WhatsApp, but I got her Instagram and her friend's Facebook. She wanted to order one more burger after finishing her first one and asked my friend if I would judge her. I liked it. But then her boyfriend called her from Australia and she looked stressed. \n\nSo after the meal, my friend tried to persuade her friend to walk with us all the way back to get our motorbikes so that we could take them home. But my girl said to her friend \"We got to get up early tomorrow, Jen.\" or something along that line. They wanted to just get a cab and stated they will be around for a few days. So we walked out, she became different after her boyfriend called her but still took the initiative to take and hold my hand again when we're walking out of the restaurant. We went to the beach briefly when I was trying to get them an Uber taxi, my girl looked happy and ethusiastic about the beach. Then we got them a cab. Before she got into the cab, we held hands, hugged and I kissed her. It was a very brief 2-second make out. I believed I did a mistake her saying \"So I'm gonna see you again?\".\n\nIt was 5AM and I had to work in the morning by 7AM. I almost didn't go out but decided to push myself and apparently turned out to be the best night I ever had during my pickup journey and and the farthest I ever went at that time. I was beat at work but it was totally worth it. Haha. If it wasn't my work, I probably would have suggested that we go into the cab with them.\n\nThen I texted her on Instagram about 20 minutes after we parted ways and let me break down.\n\nhttp://i.imgur.com/l6Xilzc.png\n\nThe general rule that I learn is that **don't flood the girl with text conversation, only contact them to set up a date**.\n\n**\"Hey, you're home safe\"** -&gt; I texted her right away so that she didn't forget who I was.\n\n**\"*kiss* Where are you?\"** -&gt; The next message was sent 10 hours later to show that I had something else to do and didn't give her all my attention. She didn't reply.\n\n**\"...?\"** -&gt; I sent it 3 hours later when I didn't get replied. Maybe at first glance looking a little needy, it's a specific technique I learned from RSD Todd to assert that I deserve her and I demand a response\n\n**\"I'll take you to a good club later in Seminyak. What time will you get home?\"** -&gt; Simply assumed that she's gonna go with me and not being permission seeking. But as you see, it didn't work that well.\n\n**\"What's happening tonight\"** followed by another **\"...?\"** -&gt; Another attempt to show her that I demand a response and an explanation of why she refused to meet me tonight and she stopped replying.\n\nI wonder how it would have ended if her boyfriend didn't call her that time. though.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "655uuu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1, "report_reasons": null, "author": "wannabemanwhore", "saved": false, "mod_reports": [], "name": "t3_655uuu", "subreddit_name_prefixed": "r/seduction", "approved_by": null, "over_18": false, "domain": "self.seduction", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhrv", "edited": 1492281361.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/seduction/comments/655uuu/fr_pulling_an_aussie_girl_kclosed_but_failed_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492123058.0, "url": "https://www.reddit.com/r/seduction/comments/655uuu/fr_pulling_an_aussie_girl_kclosed_but_failed_to/", "author_flair_text": null, "quarantine": false, "title": "[FR] Pulling an Aussie girl, k-closed but failed to take her home.", "created_utc": 1492094258.0, "distinguished": null, "media": null, "upvote_ratio": 0.56, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_655uuu", "likes": null, "replies": "", "user_reports": [], "id": "dg8n82n", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "JUST_WANTTOBEHAPPY", "parent_id": "t3_655uuu", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I'm bothered by post like this, what makes you think bedding a girl who has a boyfriend is a good thing?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m bothered by post like this, what makes you think bedding a girl who has a boyfriend is a good thing?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg8n82n", "score_hidden": false, "stickied": false, "created": 1492166520.0, "created_utc": 1492137720.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_655uuu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_655uuu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_655uuu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_655uuu", "likes": null, "replies": "", "user_reports": [], "id": "dg9ovv6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wannabemanwhore", "parent_id": "t1_dg9o0ah", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt; The constant texting. Suggesting plans when she didn't even respond is a great sign of neediness. You've gotta accept the fact that its over man. Just move on.\n\nYeah, on texting, but prior to that when gaming her that night, I don't think I acted that needy. I know it's over, like I mentioned it happened 3 weeks ago and she left anyway. I posted it for educational purpose.\n\n&gt; From your FR, it sounds like she just wanted one good night of being naughty.\n\nI wonder how it would have ended if her boyfriend didn't call her that time. though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The constant texting. Suggesting plans when she didn&amp;#39;t even respond is a great sign of neediness. You&amp;#39;ve gotta accept the fact that its over man. Just move on.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah, on texting, but prior to that when gaming her that night, I don&amp;#39;t think I acted that needy. I know it&amp;#39;s over, like I mentioned it happened 3 weeks ago and she left anyway. I posted it for educational purpose.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;From your FR, it sounds like she just wanted one good night of being naughty.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I wonder how it would have ended if her boyfriend didn&amp;#39;t call her that time. though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9ovv6", "score_hidden": false, "stickied": false, "created": 1492230040.0, "created_utc": 1492201240.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9o0ah", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "galactic_fury", "parent_id": "t1_dg9fn0r", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt; Besides \"..?\", what else are the things I did that showed neediness?\n\nThe constant texting. Suggesting plans when she didn't even respond is a great sign of neediness. You've gotta accept the fact that its over man. Just move on.\n\n&gt; Actually I believe that she really doesn't have Facebook after checking her best friend's Facebook. But I got her Instagram.\n\nDoesn't matter. You have to understand different relationships for what they are. Sometimes you meet girls who want to marry you/have your kids. Others just want to fuck you one time and go back to leading their otherwise comfortable life. Others want something in between: a fwb, or a guy she can call when she just wants sex. From your FR, it sounds like she just wanted one good night of being naughty.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Besides &amp;quot;..?&amp;quot;, what else are the things I did that showed neediness?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The constant texting. Suggesting plans when she didn&amp;#39;t even respond is a great sign of neediness. You&amp;#39;ve gotta accept the fact that its over man. Just move on.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Actually I believe that she really doesn&amp;#39;t have Facebook after checking her best friend&amp;#39;s Facebook. But I got her Instagram.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Doesn&amp;#39;t matter. You have to understand different relationships for what they are. Sometimes you meet girls who want to marry you/have your kids. Others just want to fuck you one time and go back to leading their otherwise comfortable life. Others want something in between: a fwb, or a guy she can call when she just wants sex. From your FR, it sounds like she just wanted one good night of being naughty.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9o0ah", "score_hidden": false, "stickied": false, "created": 1492228983.0, "created_utc": 1492200183.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9fn0r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wannabemanwhore", "parent_id": "t1_dg8d1wj", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt; You acted too needy.\n\nBesides \"..?\", what else are the things I did that showed neediness?\n\n&gt; Her reluctance to give you social media information is a great indication that she wanted you to be just that one guy she had fun with that night.\n\nActually I believe that she really doesn't have Facebook after checking her best friend's Facebook. But I got her Instagram.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You acted too needy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Besides &amp;quot;..?&amp;quot;, what else are the things I did that showed neediness?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Her reluctance to give you social media information is a great indication that she wanted you to be just that one guy she had fun with that night.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Actually I believe that she really doesn&amp;#39;t have Facebook after checking her best friend&amp;#39;s Facebook. But I got her Instagram.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9fn0r", "score_hidden": false, "stickied": false, "created": 1492219031.0, "created_utc": 1492190231.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8d1wj", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "galactic_fury", "parent_id": "t3_655uuu", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You acted too needy. Once you guys started holding hands you could have like, sped up, or slowed down walking to get some isolation and then made out a little more. First mistake... subconsciously, she is conflicted. If she has a bf, she's just looking for fun.\n\n\nNext, NEVER text with \"..?\". It shows you are incredibly needy and have nothing else going on in your life. If she hasn't replied ... you just have to accept it and move on. There's no \"saving\" this set, its dead and buried.\n\nFinally, she might have been drunk and all loosey goosey after drinking but after sobering up she will most likely be much more protective about not cheating on her bf. Its one thing when things \"just happen\" in a nightclub/bar; quite another when you actively make plans. Her reluctance to give you social media information is a great indication that she wanted you to be just that one guy she had fun with that night.\n\nAll in all, great work with approaching and then re-approaching later, that was a pretty slick move. You gotta work more on logistics. Have some idea of how you will go from club -&gt; food -&gt; home.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You acted too needy. Once you guys started holding hands you could have like, sped up, or slowed down walking to get some isolation and then made out a little more. First mistake... subconsciously, she is conflicted. If she has a bf, she&amp;#39;s just looking for fun.&lt;/p&gt;\n\n&lt;p&gt;Next, NEVER text with &amp;quot;..?&amp;quot;. It shows you are incredibly needy and have nothing else going on in your life. If she hasn&amp;#39;t replied ... you just have to accept it and move on. There&amp;#39;s no &amp;quot;saving&amp;quot; this set, its dead and buried.&lt;/p&gt;\n\n&lt;p&gt;Finally, she might have been drunk and all loosey goosey after drinking but after sobering up she will most likely be much more protective about not cheating on her bf. Its one thing when things &amp;quot;just happen&amp;quot; in a nightclub/bar; quite another when you actively make plans. Her reluctance to give you social media information is a great indication that she wanted you to be just that one guy she had fun with that night.&lt;/p&gt;\n\n&lt;p&gt;All in all, great work with approaching and then re-approaching later, that was a pretty slick move. You gotta work more on logistics. Have some idea of how you will go from club -&amp;gt; food -&amp;gt; home.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg8d1wj", "score_hidden": false, "stickied": false, "created": 1492152556.0, "created_utc": 1492123756.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}]