[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "seduction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s hard to admit but I can&amp;#39;t believe it. I feel like at times that I don&amp;#39;t have someone to cuddle with, to know what it feels like to experience intimacy and companionship when life gets too stressful. Or to experience what it feels like to have someone genuinely interested in you. Whether I&amp;#39;m stressed from exams or just loneliness, I realized there was no one out there. I feel like an unattractive man. I feel like a failure.&lt;/p&gt;\n\n&lt;p&gt;I realize looking through my Facebook messages, my Snapchat, my text messages, there is not one girl that pops up that would date me, it&amp;#39;s pretty much a sausage fest of guys that I talk to nowadays. Not even a girl to just be friends with to talk to. All guys. Some of these guys, I used to go out with them but not anymore.&lt;/p&gt;\n\n&lt;p&gt;According to this article from the Atlantic, I am the minority of males around my age to be a virgin. Kinda fucked.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://archive.is/mZ4pF#selection-1447.0-1455.225\"&gt;http://archive.is/mZ4pF#selection-1447.0-1455.225&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;According to the Centers for Disease Control and Prevention, the average age Americans lose their virginities (defined here as vaginal sexual intercourse) is 17.1 for both men and women. The CDC also reports that virgins make up 12.3 percent of females and 14.3 percent of males aged 20 to 24. That number drops below 5 percent for both male and female virgins aged 25 to 29 and goes as low as 0.3 percent for virgins aged 40 to 44.&lt;/p&gt;\n\n&lt;p&gt;Statistically, if you didn’t have sex in your teen years, you’re in the minority.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Men have it hard. &lt;/p&gt;\n\n&lt;p&gt;I know the guys have to initiate everything.&lt;/p&gt;\n\n&lt;p&gt;Years ago I stumbled upon this subreddit, in my high school days, near the end of 2012 to be exact.&lt;/p&gt;\n\n&lt;p&gt;I read the side bar, read the top posts of this subreddit whether it was top posts of all time, month, or week. I read the good posts here and there. I lurked, learning what I can. I tried to apply the concepts. I tried to go for many girls, and I got rejected by all of them, only a few past the first date. &lt;/p&gt;\n\n&lt;p&gt;My two years in college, no girl has ever made the first move with me, no girl initiated, no girl complimented on my looks, and no girl ever showed interest in me. Felt like I was invisible on campus. Walking past attractive women everyday being a ghost. I feel like no girl will ever want to be with me after all the rejections I have experienced and realizing this. I went for countless girls, rejected so many times. Guys, it&amp;#39;s all up to us to initiate. We will be alone forever if we don&amp;#39;t do anything to improve ourselves. If you&amp;#39;re in college, you will never have the same concentration of the same girls around your age in such a small area again. Seems like the real world has a range of 20-40 year old in various workplaces and it doesn&amp;#39;t get easier. And yet I didn&amp;#39;t experience most of what guys around my age, to express love with someone, to have sex, to have fun.&lt;/p&gt;\n\n&lt;p&gt;I know for girls it&amp;#39;s as easy as visual cues to be attractive. But for guys, it seems like it&amp;#39;s years of study trying to increase the probability to be attractive through social status, resources, behaviour, body language, fitness, clothes and style. We guys have to actually try to convince ourselves that we have abundance and look in the mirror saying &amp;quot;I am the prize&amp;quot;, and &amp;quot;I have abundance&amp;quot; trying to be outcome independent even if you are a virgin. And it&amp;#39;s damn hard when you are someone who never had that much luck with dating in their life. Girls just has guys approaching them everyday, validating them through liking their Instagram photos and giving compliments/showing sexual interest in them multiple times per day. But for guys, it&amp;#39;s different. We don&amp;#39;t experience that.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/seduction/comments/5q6upn/anyone_tell_me_why_women_are_typically_alot_less/dcxdu7x/\"&gt;https://www.reddit.com/r/seduction/comments/5q6upn/anyone_tell_me_why_women_are_typically_alot_less/dcxdu7x/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/seduction/comments/5q6upn/anyone_tell_me_why_women_are_typically_alot_less/\"&gt;https://www.reddit.com/r/seduction/comments/5q6upn/anyone_tell_me_why_women_are_typically_alot_less/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Some time ago, I have been recommended to read Models by Mark Manson, and been seeing it being recommended throughout this subreddit over the years. I started reading it a year ago but never finished. School work piled up. I put off self improvement for college. &lt;/p&gt;\n\n&lt;p&gt;Then I realized that I gave up a lot of things for college. I used to work out, but stopped for a midterm a year ago, now I haven&amp;#39;t been in the gym since. I stopped going out with friends and realizing I just spent most of my weekends playing video games and on reddit to de stress from all the college work, being too tired to go out. I used to meditate but told myself I need every minute I can get to study for exams. I quit my job. I gave up dating in the name of monk mode and improving myself. I need to have a career in order to have the money to live the life I want on my own terms.&lt;/p&gt;\n\n&lt;p&gt;I told myself to read Models. To read No More Mr. Nice Guy. To read How to Win Friends and Influence People to build friendships to have a healthy fulfilled lifestyle. To read The Way of The Superior Man to make myself better if I ever get into a relationship. Even Feeling Good by David Burns for my depression. Inner game. But my studies are rigorous, and I have not gotten around to reading these books yet. And every time I see an attractive woman, I told myself I am in monk mode, I am not ready. I&amp;#39;ve been telling myself this every time I want to see a girl I want to talk to. It&amp;#39;s true I am not ready, but maybe I am holding myself back making excuses on why not to approach.&lt;/p&gt;\n\n&lt;p&gt;But I feel like I&amp;#39;m missing out. I feel like I am missing out because I am not in a frat, no clubs, I don&amp;#39;t get invited out to the clubs and bars, I don&amp;#39;t even have groups of friends to go out partying. I can&amp;#39;t believe I have to admit that. Fuck, I deleted Snapchat and Instagram on my phone because I didn&amp;#39;t want to compare myself to all my peers partying and having the time of their lives. Fuck, some days I walk past some couples on campus and I feel so jealous and it brings me down. Sometimes I insult the boyfriends that I walk past with to make myself feel better. I feel so anxious in the idea of going to a meetup or a club event to meet new people. Too anxious to even go to the gym.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been feeling a lot like this lately too &lt;a href=\"https://www.reddit.com/r/seduction/comments/5cdv1x/is_it_okay_to_cry/\"&gt;https://www.reddit.com/r/seduction/comments/5cdv1x/is_it_okay_to_cry/&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I just feel like all of this is incredibly hard. Really hard. Working on yourself is hard. Coping with failure is hard. Trying to be happy is hard. Existing is actually damned hard.&lt;/p&gt;\n\n&lt;p&gt;I thought I changed. I worked hard for it. I read every book, I forced myself to go out and socialize, I practiced talking to strangers and talking to girls, I try to act and actually be confident. I went to therapy for this. I changed my lifestyle. I dress well, I eat well, I got new hobbies, I met new people. I even moved to another country. And here I am, feeling like I&amp;#39;m back at nothing. Making the same old mistakes again, getting the same old results, experiencing the same old depressing feelings. knowing fully well that it&amp;#39;s all my fault. And it hurts. It freaking hurts. I want to cry but I feel like I shouldn&amp;#39;t. I don&amp;#39;t want to be this way, I don&amp;#39;t want everything to affect me so much. But I just don&amp;#39;t know how to go on anymore.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I noticed a lonely girl in class two weeks ago.&lt;/p&gt;\n\n&lt;p&gt;I was thinking of approaching her and seeing what she&amp;#39;s like, and to also date her. Someone to get to know. It&amp;#39;s been 17 months since my last date. But I&amp;#39;ve actually never cold approached a girl. I went for a lot of girls from social circles and mutual friends but not out of the blue cold approach. The whole time I said &amp;quot;Nah I&amp;#39;m improving myself, need to make myself into the best I could be, work out again, meditate again, get new hobbies and more friends etc etc.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I thought of just not approaching her at all. I was scared. I was needy. I felt like I wasn&amp;#39;t ready. I didn&amp;#39;t have a &amp;quot;amazing, exciting, full life&amp;quot; that someone else wants to join. I felt like I was missing this &lt;a href=\"https://www.reddit.com/r/seduction/comments/5g7yd6/she_confirmed_it_the_truth_in_one_sentence/\"&gt;https://www.reddit.com/r/seduction/comments/5g7yd6/she_confirmed_it_the_truth_in_one_sentence/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;But then I remember this video &lt;a href=\"https://www.youtube.com/watch?v=AdymCQ5PXrs\"&gt;https://www.youtube.com/watch?v=AdymCQ5PXrs&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/seduction/comments/zrsfd/this_is_why_you_should_say_hi_incredible_short/\"&gt;https://www.reddit.com/r/seduction/comments/zrsfd/this_is_why_you_should_say_hi_incredible_short/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I had to approach her. To remove the what if scenario. I can&amp;#39;t miss out. Maybe we will have a adventure together.&lt;/p&gt;\n\n&lt;p&gt;I went for it. I told myself fuck it. I told myself instead of wondering &amp;quot;I hope she&amp;#39;ll like me&amp;quot;, I instead said to myself: &amp;quot;I wonder what is she like?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;The feeling of walking down the stairs to sit beside her was fucking wild. I experienced a exhilarating sort of emotions because I wasn&amp;#39;t used to this. It&amp;#39;s been a long time since my last date 17 months ago. I was rusty.&lt;/p&gt;\n\n&lt;p&gt;Then bam, I asked if the seat beside her was taken. &lt;/p&gt;\n\n&lt;p&gt;It wasn&amp;#39;t. Here we go. &lt;/p&gt;\n\n&lt;p&gt;Then I told her &amp;quot;Hey I thought you&amp;#39;re cute and wanted to come say hi&amp;quot;.  Her faced turned red, laughing. &lt;/p&gt;\n\n&lt;p&gt;Then I introduced myself. Oh boy. &lt;/p&gt;\n\n&lt;p&gt;Shook her hand firmly. I felt like I was at the top of the world. It was surreal.&lt;/p&gt;\n\n&lt;p&gt;All the positive vibes were there. Body language, she admitted she was awkward while we were talking, she was laughing at everything I said, smiles, her face turns red again, positive signs. &lt;/p&gt;\n\n&lt;p&gt;I number closed right after class ended saying &amp;quot;I&amp;#39;ll get your number, we should go out together some time&amp;quot; stating my intentions very clearly. &lt;/p&gt;\n\n&lt;p&gt;She never said she had a boyfriend. I couldn&amp;#39;t wait to text the next day to meet up with her the next week. Hell, after class I got excited that I started experiencing some forms of oneitis that I have to admit where maybe we will have an adventure together, road trips together, hiking together, seeing museums and experiencing life together. I am aware of oneitis, experienced it many times before. &lt;a href=\"https://www.youtube.com/watch?v=GdnYedTpToA\"&gt;https://www.youtube.com/watch?v=GdnYedTpToA&lt;/a&gt;  I tried to tell myself that I have abundance, and no matter what happens, happens. &lt;/p&gt;\n\n&lt;p&gt;I texted her up the next day. I told myself who I am.&lt;/p&gt;\n\n&lt;p&gt;Then she said this&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hey it&amp;#39;s _, sorry I should have mentioned this earlier but I have a boyfriend if you were thinking of being more than friends xD. Thanks for being brave and approaching me though.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t think she had a boyfriend at first, I thought she was lying, because I had a girl lie to me that she had a boyfriend but is still single to this day, even alone for this years Valentine&amp;#39;s day. However, she showed up with her boyfriend the next day and I knew it was true.&lt;/p&gt;\n\n&lt;p&gt;At first I shrugged it off, I was fucking proud of myself to approach someone like that right in front of my friends. Proud to have the courage to go for it. Proud I went for it. Proud I didn&amp;#39;t play games and made myself as assertive as I could be, stating my intentions as early as possible and knowing within a day if we are going to go out together. My curiosity was fulfilled and I was almost ready to move on. I told myself it was just an incompatibility like what Mark Manson said in Models. Maybe our demographics of who we are didn&amp;#39;t match up. It was all factors outside of my control, and it was never my fault.&lt;/p&gt;\n\n&lt;p&gt;But then, I experienced doubt within a span of meeting her one day to the next day after of being rejected. That maybe I won&amp;#39;t experience love. Maybe something is wrong with me. The loneliness crushed me. After some time later that I got that message, I binge drinked. Pissed off. Sad feelings. I broke things around my dorm room, yelled shit out, punched things, realizing maybe I&amp;#39;m worthless, thinking of all my failures in life and with girls until I passed out on the couch until my roommate woke me up wondering what the fuck happened.&lt;/p&gt;\n\n&lt;p&gt;All the girls I went for... the most recent one, has a boyfriend, then the one before, has a boyfriend, then the one before &amp;quot;Thank you, I am very flattered and you seem like a very nice guy but unfortunately I don&amp;#39;t feel the same way, thanks for the fun dates though!&amp;quot; then the one before she says &amp;quot;I have a thing with someone else&amp;quot;, then the one before she says she doesn&amp;#39;t want to be in a relationship, then she goes after the asian guy that has a Mustang. Then the one before her was a lesbian. Then the one before she flaked on the date, no reply, no contact ever again. Then the one before her... Damn. And there were more girls before her that I experienced rejection. I have tried many times with multiple girls in my life. All the girls I asked out, all the dates, all that effort blown by the wind.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what to feel. Feels like the universe hates me. I know the universe owes me nothing. I am entitled to nothing. Society exists to fill other people&amp;#39;s needs &lt;a href=\"https://www.reddit.com/r/seduction/comments/14zyof/6_harsh_truths_that_will_make_you_a_better_person/\"&gt;https://www.reddit.com/r/seduction/comments/14zyof/6_harsh_truths_that_will_make_you_a_better_person/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Some days I read this to tell myself that I am the prize and girls are lucky to be in the glory of my company. Something to read when I feel really down &lt;a href=\"https://www.reddit.com/r/seduction/comments/1gg9zv/i_am_the_prize/\"&gt;https://www.reddit.com/r/seduction/comments/1gg9zv/i_am_the_prize/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;But still, I feel like a failure. I feel like I can never be with someone, to experience love, intimacy, to have someone genuinely interested in you. &lt;/p&gt;\n\n&lt;p&gt;Is this normal for my age? To be a kissless virgin around this age? Is the Atlantic article above fake news?&lt;/p&gt;\n\n&lt;p&gt;What can I do from here on out? What are my next steps? I am lost, I feel like there is no hope. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;EDIT:&lt;/strong&gt; I am overwhelmed by all the responses here. I am at a loss for words, and I have no idea what to say to each and every one of you. This is a lot to take in. I really appreciate all the responses on here and for everyone taking their time out of their day helping me out. Thank you. I&amp;#39;ve never posted a thread on here before, I hesitated posting this that maybe I was too desperate or too needy. But I just wanted to let it all out from what I built up over the years on what I think about myself, and my perspective. I  just posted few comments here and there in Seddit helping out others from my experiences over the years. I was hoping by posting on what I&amp;#39;ve been going through this whole time in college, I might help somebody out with the advice I would get and have someone else out there relate to me that they are not alone. I realize that I am too needy worrying about my virginity and I give myself too much negative talk, putting pussy on the pedestal. I really need to get some interesting hobbies instead of being just a guy that masturbates to porn over the weekends, playing video games and surfing Reddit feeling sorry for myself. I really need to start working out again, to make myself proud, and to seek happiness within instead of seeking external validation from others.&lt;/p&gt;\n\n&lt;p&gt;Thank you Seddit, I don&amp;#39;t know how to give back to this community. It&amp;#39;s all up to me. This is my life. This journey is going to be hard. But that&amp;#39;s just what life is.&lt;/p&gt;\n\n&lt;p&gt;This is the first day of the rest of my life.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It's hard to admit but I can't believe it. I feel like at times that I don't have someone to cuddle with, to know what it feels like to experience intimacy and companionship when life gets too stressful. Or to experience what it feels like to have someone genuinely interested in you. Whether I'm stressed from exams or just loneliness, I realized there was no one out there. I feel like an unattractive man. I feel like a failure.\n\n\nI realize looking through my Facebook messages, my Snapchat, my text messages, there is not one girl that pops up that would date me, it's pretty much a sausage fest of guys that I talk to nowadays. Not even a girl to just be friends with to talk to. All guys. Some of these guys, I used to go out with them but not anymore.\n\n\n\nAccording to this article from the Atlantic, I am the minority of males around my age to be a virgin. Kinda fucked.\n\n\nhttp://archive.is/mZ4pF#selection-1447.0-1455.225\n\n\n&gt;According to the Centers for Disease Control and Prevention, the average age Americans lose their virginities (defined here as vaginal sexual intercourse) is 17.1 for both men and women. The CDC also reports that virgins make up 12.3 percent of females and 14.3 percent of males aged 20 to 24. That number drops below 5 percent for both male and female virgins aged 25 to 29 and goes as low as 0.3 percent for virgins aged 40 to 44.\n\n\n&gt;Statistically, if you didn’t have sex in your teen years, you’re in the minority.\n\n\nMen have it hard. \n\n\nI know the guys have to initiate everything.\n\n\nYears ago I stumbled upon this subreddit, in my high school days, near the end of 2012 to be exact.\n\n\nI read the side bar, read the top posts of this subreddit whether it was top posts of all time, month, or week. I read the good posts here and there. I lurked, learning what I can. I tried to apply the concepts. I tried to go for many girls, and I got rejected by all of them, only a few past the first date. \n\n\nMy two years in college, no girl has ever made the first move with me, no girl initiated, no girl complimented on my looks, and no girl ever showed interest in me. Felt like I was invisible on campus. Walking past attractive women everyday being a ghost. I feel like no girl will ever want to be with me after all the rejections I have experienced and realizing this. I went for countless girls, rejected so many times. Guys, it's all up to us to initiate. We will be alone forever if we don't do anything to improve ourselves. If you're in college, you will never have the same concentration of the same girls around your age in such a small area again. Seems like the real world has a range of 20-40 year old in various workplaces and it doesn't get easier. And yet I didn't experience most of what guys around my age, to express love with someone, to have sex, to have fun.\n\n\nI know for girls it's as easy as visual cues to be attractive. But for guys, it seems like it's years of study trying to increase the probability to be attractive through social status, resources, behaviour, body language, fitness, clothes and style. We guys have to actually try to convince ourselves that we have abundance and look in the mirror saying \"I am the prize\", and \"I have abundance\" trying to be outcome independent even if you are a virgin. And it's damn hard when you are someone who never had that much luck with dating in their life. Girls just has guys approaching them everyday, validating them through liking their Instagram photos and giving compliments/showing sexual interest in them multiple times per day. But for guys, it's different. We don't experience that.\n\nhttps://www.reddit.com/r/seduction/comments/5q6upn/anyone_tell_me_why_women_are_typically_alot_less/dcxdu7x/\n\n\nhttps://www.reddit.com/r/seduction/comments/5q6upn/anyone_tell_me_why_women_are_typically_alot_less/\n\n\nSome time ago, I have been recommended to read Models by Mark Manson, and been seeing it being recommended throughout this subreddit over the years. I started reading it a year ago but never finished. School work piled up. I put off self improvement for college. \n\n\nThen I realized that I gave up a lot of things for college. I used to work out, but stopped for a midterm a year ago, now I haven't been in the gym since. I stopped going out with friends and realizing I just spent most of my weekends playing video games and on reddit to de stress from all the college work, being too tired to go out. I used to meditate but told myself I need every minute I can get to study for exams. I quit my job. I gave up dating in the name of monk mode and improving myself. I need to have a career in order to have the money to live the life I want on my own terms.\n\n\nI told myself to read Models. To read No More Mr. Nice Guy. To read How to Win Friends and Influence People to build friendships to have a healthy fulfilled lifestyle. To read The Way of The Superior Man to make myself better if I ever get into a relationship. Even Feeling Good by David Burns for my depression. Inner game. But my studies are rigorous, and I have not gotten around to reading these books yet. And every time I see an attractive woman, I told myself I am in monk mode, I am not ready. I've been telling myself this every time I want to see a girl I want to talk to. It's true I am not ready, but maybe I am holding myself back making excuses on why not to approach.\n\n\nBut I feel like I'm missing out. I feel like I am missing out because I am not in a frat, no clubs, I don't get invited out to the clubs and bars, I don't even have groups of friends to go out partying. I can't believe I have to admit that. Fuck, I deleted Snapchat and Instagram on my phone because I didn't want to compare myself to all my peers partying and having the time of their lives. Fuck, some days I walk past some couples on campus and I feel so jealous and it brings me down. Sometimes I insult the boyfriends that I walk past with to make myself feel better. I feel so anxious in the idea of going to a meetup or a club event to meet new people. Too anxious to even go to the gym.\n\n\nI've been feeling a lot like this lately too https://www.reddit.com/r/seduction/comments/5cdv1x/is_it_okay_to_cry/\n\n\n&gt;I just feel like all of this is incredibly hard. Really hard. Working on yourself is hard. Coping with failure is hard. Trying to be happy is hard. Existing is actually damned hard.\n\n\n&gt;I thought I changed. I worked hard for it. I read every book, I forced myself to go out and socialize, I practiced talking to strangers and talking to girls, I try to act and actually be confident. I went to therapy for this. I changed my lifestyle. I dress well, I eat well, I got new hobbies, I met new people. I even moved to another country. And here I am, feeling like I'm back at nothing. Making the same old mistakes again, getting the same old results, experiencing the same old depressing feelings. knowing fully well that it's all my fault. And it hurts. It freaking hurts. I want to cry but I feel like I shouldn't. I don't want to be this way, I don't want everything to affect me so much. But I just don't know how to go on anymore.\n\n\nI noticed a lonely girl in class two weeks ago.\n\n\nI was thinking of approaching her and seeing what she's like, and to also date her. Someone to get to know. It's been 17 months since my last date. But I've actually never cold approached a girl. I went for a lot of girls from social circles and mutual friends but not out of the blue cold approach. The whole time I said \"Nah I'm improving myself, need to make myself into the best I could be, work out again, meditate again, get new hobbies and more friends etc etc.\"\n\n\nI thought of just not approaching her at all. I was scared. I was needy. I felt like I wasn't ready. I didn't have a \"amazing, exciting, full life\" that someone else wants to join. I felt like I was missing this https://www.reddit.com/r/seduction/comments/5g7yd6/she_confirmed_it_the_truth_in_one_sentence/\n\n\nBut then I remember this video https://www.youtube.com/watch?v=AdymCQ5PXrs\n\n\nhttps://www.reddit.com/r/seduction/comments/zrsfd/this_is_why_you_should_say_hi_incredible_short/\n\n\nI had to approach her. To remove the what if scenario. I can't miss out. Maybe we will have a adventure together.\n\n\n\nI went for it. I told myself fuck it. I told myself instead of wondering \"I hope she'll like me\", I instead said to myself: \"I wonder what is she like?\" \n\n\nThe feeling of walking down the stairs to sit beside her was fucking wild. I experienced a exhilarating sort of emotions because I wasn't used to this. It's been a long time since my last date 17 months ago. I was rusty.\n\n\nThen bam, I asked if the seat beside her was taken. \n\n\nIt wasn't. Here we go. \n\n\nThen I told her \"Hey I thought you're cute and wanted to come say hi\".  Her faced turned red, laughing. \n\n\nThen I introduced myself. Oh boy. \n\n\nShook her hand firmly. I felt like I was at the top of the world. It was surreal.\n\n\nAll the positive vibes were there. Body language, she admitted she was awkward while we were talking, she was laughing at everything I said, smiles, her face turns red again, positive signs. \n\n\nI number closed right after class ended saying \"I'll get your number, we should go out together some time\" stating my intentions very clearly. \n\n\nShe never said she had a boyfriend. I couldn't wait to text the next day to meet up with her the next week. Hell, after class I got excited that I started experiencing some forms of oneitis that I have to admit where maybe we will have an adventure together, road trips together, hiking together, seeing museums and experiencing life together. I am aware of oneitis, experienced it many times before. https://www.youtube.com/watch?v=GdnYedTpToA  I tried to tell myself that I have abundance, and no matter what happens, happens. \n\n\nI texted her up the next day. I told myself who I am.\n\n\nThen she said this\n\n\n\"Hey it's _, sorry I should have mentioned this earlier but I have a boyfriend if you were thinking of being more than friends xD. Thanks for being brave and approaching me though.\"\n\n\nI didn't think she had a boyfriend at first, I thought she was lying, because I had a girl lie to me that she had a boyfriend but is still single to this day, even alone for this years Valentine's day. However, she showed up with her boyfriend the next day and I knew it was true.\n\n\nAt first I shrugged it off, I was fucking proud of myself to approach someone like that right in front of my friends. Proud to have the courage to go for it. Proud I went for it. Proud I didn't play games and made myself as assertive as I could be, stating my intentions as early as possible and knowing within a day if we are going to go out together. My curiosity was fulfilled and I was almost ready to move on. I told myself it was just an incompatibility like what Mark Manson said in Models. Maybe our demographics of who we are didn't match up. It was all factors outside of my control, and it was never my fault.\n\n\nBut then, I experienced doubt within a span of meeting her one day to the next day after of being rejected. That maybe I won't experience love. Maybe something is wrong with me. The loneliness crushed me. After some time later that I got that message, I binge drinked. Pissed off. Sad feelings. I broke things around my dorm room, yelled shit out, punched things, realizing maybe I'm worthless, thinking of all my failures in life and with girls until I passed out on the couch until my roommate woke me up wondering what the fuck happened.\n\n\nAll the girls I went for... the most recent one, has a boyfriend, then the one before, has a boyfriend, then the one before \"Thank you, I am very flattered and you seem like a very nice guy but unfortunately I don't feel the same way, thanks for the fun dates though!\" then the one before she says \"I have a thing with someone else\", then the one before she says she doesn't want to be in a relationship, then she goes after the asian guy that has a Mustang. Then the one before her was a lesbian. Then the one before she flaked on the date, no reply, no contact ever again. Then the one before her... Damn. And there were more girls before her that I experienced rejection. I have tried many times with multiple girls in my life. All the girls I asked out, all the dates, all that effort blown by the wind.\n\n\nI don't know what to feel. Feels like the universe hates me. I know the universe owes me nothing. I am entitled to nothing. Society exists to fill other people's needs https://www.reddit.com/r/seduction/comments/14zyof/6_harsh_truths_that_will_make_you_a_better_person/\n\n\nSome days I read this to tell myself that I am the prize and girls are lucky to be in the glory of my company. Something to read when I feel really down https://www.reddit.com/r/seduction/comments/1gg9zv/i_am_the_prize/\n\n\nBut still, I feel like a failure. I feel like I can never be with someone, to experience love, intimacy, to have someone genuinely interested in you. \n\n\nIs this normal for my age? To be a kissless virgin around this age? Is the Atlantic article above fake news?\n\n\nWhat can I do from here on out? What are my next steps? I am lost, I feel like there is no hope. \n\n\n**EDIT:** I am overwhelmed by all the responses here. I am at a loss for words, and I have no idea what to say to each and every one of you. This is a lot to take in. I really appreciate all the responses on here and for everyone taking their time out of their day helping me out. Thank you. I've never posted a thread on here before, I hesitated posting this that maybe I was too desperate or too needy. But I just wanted to let it all out from what I built up over the years on what I think about myself, and my perspective. I  just posted few comments here and there in Seddit helping out others from my experiences over the years. I was hoping by posting on what I've been going through this whole time in college, I might help somebody out with the advice I would get and have someone else out there relate to me that they are not alone. I realize that I am too needy worrying about my virginity and I give myself too much negative talk, putting pussy on the pedestal. I really need to get some interesting hobbies instead of being just a guy that masturbates to porn over the weekends, playing video games and surfing Reddit feeling sorry for myself. I really need to start working out again, to make myself proud, and to seek happiness within instead of seeking external validation from others.\n\n\nThank you Seddit, I don't know how to give back to this community. It's all up to me. This is my life. This journey is going to be hard. But that's just what life is.\n\n\nThis is the first day of the rest of my life.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65bkc5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 211, "report_reasons": null, "author": "idunnowhattofeel", "saved": false, "mod_reports": [], "name": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "approved_by": null, "over_18": false, "domain": "self.seduction", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhrv", "edited": 1492203451.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/seduction/comments/65bkc5/i_just_turned_20_about_to_finish_my_sophomore/", "num_reports": null, "locked": false, "stickied": false, "created": 1492190454.0, "url": "https://www.reddit.com/r/seduction/comments/65bkc5/i_just_turned_20_about_to_finish_my_sophomore/", "author_flair_text": null, "quarantine": false, "title": "I just turned 20. About to finish my sophomore year in college. Virgin. Haven't kissed or had a girlfriend. A perspective from a lurker for years here. What am I doing wrong.", "created_utc": 1492161654.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 97, "visited": false, "subreddit_type": "public", "ups": 211}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9jekq", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Snazzy_Serval", "parent_id": "t1_dg9ivri", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Same exactly problem I'm having now.\n\nI keep seeing the book mentioned and I'm going through it. I'm 63% done and only a fraction of it applies to me. \n\nYes I'm angry. Yes I feel like I need a woman's approval to be happy. Nothing else fits.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same exactly problem I&amp;#39;m having now.&lt;/p&gt;\n\n&lt;p&gt;I keep seeing the book mentioned and I&amp;#39;m going through it. I&amp;#39;m 63% done and only a fraction of it applies to me. &lt;/p&gt;\n\n&lt;p&gt;Yes I&amp;#39;m angry. Yes I feel like I need a woman&amp;#39;s approval to be happy. Nothing else fits.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9jekq", "score_hidden": false, "stickied": false, "created": 1492223439.0, "created_utc": 1492194639.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ivri", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "threewawway", "parent_id": "t1_dg9cxxb", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "That's a problem I had with No More Mr Nice Guy, he seemed to continually reference or talk about people who were already in relationships, not people who've struggled to get one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a problem I had with No More Mr Nice Guy, he seemed to continually reference or talk about people who were already in relationships, not people who&amp;#39;ve struggled to get one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9ivri", "score_hidden": false, "stickied": false, "created": 1492222818.0, "created_utc": 1492194018.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9cxxb", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Snazzy_Serval", "parent_id": "t1_dg9b3gt", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I've read it, and listened to the audio book which is Mark reading it to you. \n\nDidn't really find it that helpful. It's not really meant for guys who have no experience with women.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve read it, and listened to the audio book which is Mark reading it to you. &lt;/p&gt;\n\n&lt;p&gt;Didn&amp;#39;t really find it that helpful. It&amp;#39;s not really meant for guys who have no experience with women.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9cxxb", "score_hidden": false, "stickied": false, "created": 1492215975.0, "created_utc": 1492187175.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9b3gt", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "WisdomModifier", "parent_id": "t1_dg98g6p", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Models by Mark Manson is probably *the* book to read, if you're gonna read a book.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Models by Mark Manson is probably &lt;em&gt;the&lt;/em&gt; book to read, if you&amp;#39;re gonna read a book.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9b3gt", "score_hidden": false, "stickied": false, "created": 1492213928.0, "created_utc": 1492185128.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dga9wj6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ninja_possum", "parent_id": "t1_dg98g6p", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "THANK YOU\n\nFrustrates me to know end that people don't realise this.  The Game is not a manual on how to pick up women, its the account of a Rolling Stone journalist following around a group of pickup artists and eventually becoming one himself.  He did write a separate 'how to' manual' ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;THANK YOU&lt;/p&gt;\n\n&lt;p&gt;Frustrates me to know end that people don&amp;#39;t realise this.  The Game is not a manual on how to pick up women, its the account of a Rolling Stone journalist following around a group of pickup artists and eventually becoming one himself.  He did write a separate &amp;#39;how to&amp;#39; manual&amp;#39; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dga9wj6", "score_hidden": false, "stickied": false, "created": 1492258895.0, "created_utc": 1492230095.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg98g6p", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "ThrowawayPUA", "parent_id": "t1_dg95qrr", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "It's a semi-autobiographical novel, not an instruction manual. Strauss published a separate instructional manual.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a semi-autobiographical novel, not an instruction manual. Strauss published a separate instructional manual.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg98g6p", "score_hidden": false, "stickied": false, "created": 1492210764.0, "created_utc": 1492181964.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dgabnoq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "syntaxocs", "parent_id": "t1_dg95qrr", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I really liked mode one. Another book everyone should read. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really liked mode one. Another book everyone should read. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgabnoq", "score_hidden": false, "stickied": false, "created": 1492262026.0, "created_utc": 1492233226.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg95qrr", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "saxoriko", "parent_id": "t1_dg92mhw", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt; \"The Game\" was the book to read\n\nI would say; \"The Game\" still **is** the book to read. It's nice written, enjoyable to read and the routines in the book can really help you to get started.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;The Game&amp;quot; was the book to read&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I would say; &amp;quot;The Game&amp;quot; still &lt;strong&gt;is&lt;/strong&gt; the book to read. It&amp;#39;s nice written, enjoyable to read and the routines in the book can really help you to get started.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg95qrr", "score_hidden": false, "stickied": false, "created": 1492207168.0, "created_utc": 1492178368.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9rik8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ohboyohboyohboy1985", "parent_id": "t1_dg92mhw", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Vegas or Canada, ehwherever is legal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Vegas or Canada, ehwherever is legal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9rik8", "score_hidden": false, "stickied": false, "created": 1492233261.0, "created_utc": 1492204461.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dga4qum", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Flash-64", "parent_id": "t1_dg92mhw", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "That was painful to read. Seriously, that was like War and Peace. For the love of God, cut to the chase. If that's how you talk to girls, I think we've found the problem. Stop playing video games and go to the gym. Stop being outcome dependent and start amusing yourself. And dont be a pussy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was painful to read. Seriously, that was like War and Peace. For the love of God, cut to the chase. If that&amp;#39;s how you talk to girls, I think we&amp;#39;ve found the problem. Stop playing video games and go to the gym. Stop being outcome dependent and start amusing yourself. And dont be a pussy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dga4qum", "score_hidden": false, "stickied": false, "created": 1492250944.0, "created_utc": 1492222144.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg92mhw", "gilded": 0, "archived": false, "score": 77, "report_reasons": null, "author": "szukai", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "When I first learned about PUA/seddit, \"The Game\" was the book to read, and Strauss himself said that the tools he picked up (picked up, lol /dadjoke) on that path didn't lead him to a \"happily ever after\" relationship. Even if he did get a girl, he still had problems to deal with, and sometimes they (the problems, or himself) got in the way.\n\nJust imagine: You could always just get any old job, save up anything from 200 to 1000 bucks and go get a hooker somewhere. No longer a virgin!\n\nOr you could just keep approaching like the PUAs of yore and complain about flaky girls and bad relationships unless you get lucky.\n\nIt could be awesome, or just plain awkward and terrible. Or you could just go from an extreme high to some kind weird low and become bitter like most TRP or more extreme PUA people.\n\nOr you could just put the whole single and virgin thing aside, and work on self improvement, specifically - things that make you happy, other than girls (for now).\n\nThen, go work out. Go learn things, go contribute to things you care about and help good people around you.\n\nI mean this post was just 2 posts above yours on (my) reddit front page: http://i.imgur.com/goBPdmU.jpg, I'll stand by your complaints and worries once you achieve an incredible feat like his. It's not going to be easy, but if you really want to throw in the towel... well, life's never been fair, and there's a lot of others in the long line for the goodies.\n\nIf you want to go against statistics, you're going to get depressed man, it's like guys who go around measuring their dicks vs the national average (or porno avg) and complaining about size queens, it's just not going to help you.\n\nEveryone has their challenges, but if you want to get serious, get down and get gritty. Observe, reflect, and keep a positive attitude while you push ahead. Engage with people, make friends, get comfortable with yourself and with others.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I first learned about PUA/seddit, &amp;quot;The Game&amp;quot; was the book to read, and Strauss himself said that the tools he picked up (picked up, lol /dadjoke) on that path didn&amp;#39;t lead him to a &amp;quot;happily ever after&amp;quot; relationship. Even if he did get a girl, he still had problems to deal with, and sometimes they (the problems, or himself) got in the way.&lt;/p&gt;\n\n&lt;p&gt;Just imagine: You could always just get any old job, save up anything from 200 to 1000 bucks and go get a hooker somewhere. No longer a virgin!&lt;/p&gt;\n\n&lt;p&gt;Or you could just keep approaching like the PUAs of yore and complain about flaky girls and bad relationships unless you get lucky.&lt;/p&gt;\n\n&lt;p&gt;It could be awesome, or just plain awkward and terrible. Or you could just go from an extreme high to some kind weird low and become bitter like most TRP or more extreme PUA people.&lt;/p&gt;\n\n&lt;p&gt;Or you could just put the whole single and virgin thing aside, and work on self improvement, specifically - things that make you happy, other than girls (for now).&lt;/p&gt;\n\n&lt;p&gt;Then, go work out. Go learn things, go contribute to things you care about and help good people around you.&lt;/p&gt;\n\n&lt;p&gt;I mean this post was just 2 posts above yours on (my) reddit front page: &lt;a href=\"http://i.imgur.com/goBPdmU.jpg\"&gt;http://i.imgur.com/goBPdmU.jpg&lt;/a&gt;, I&amp;#39;ll stand by your complaints and worries once you achieve an incredible feat like his. It&amp;#39;s not going to be easy, but if you really want to throw in the towel... well, life&amp;#39;s never been fair, and there&amp;#39;s a lot of others in the long line for the goodies.&lt;/p&gt;\n\n&lt;p&gt;If you want to go against statistics, you&amp;#39;re going to get depressed man, it&amp;#39;s like guys who go around measuring their dicks vs the national average (or porno avg) and complaining about size queens, it&amp;#39;s just not going to help you.&lt;/p&gt;\n\n&lt;p&gt;Everyone has their challenges, but if you want to get serious, get down and get gritty. Observe, reflect, and keep a positive attitude while you push ahead. Engage with people, make friends, get comfortable with yourself and with others.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg92mhw", "score_hidden": false, "stickied": false, "created": 1492202048.0, "created_utc": 1492173248.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 77}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9b7rt", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "A_Good_Soul", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Interesting people attract new people in their life. To become interesting, by definition, you need interests. \n\nYou're a good person. You a likeable.\n\nWhen you think about a girl, you imagine doing new and interesting things together like going on a trip, having her tell you about art and that she wants to see a new gallery exhibit, or her favorite musician is in town and you should go see it together, right?\n\nThey want that, too.\n\nIf all you (mostly) do is read theoretical dating books, play video games, and watch Reddit, what's the benefit someone receives by adding you to their social circle-- guy or gal? Don't take that as \"you aren't good enough, you're boring,\" take it as \"you have an opportunity to expand your interests.\"\n\nPeople want to be around people who have passions and interests. Video games is one, but even a gamer can expand to MMA, Basketball, horseback riding, DJing, philanthropy, etc.\n\nDon't fixate on outcomes. Easy to say, hard to do. Your approach stated you started thinking about dating her before even approaching. You were sad when she said she had a boyfriend (who cares if it's true or not). What you just did is make a potential friend. Tell her it's all good and if she wants to study together-- tell her to bring her boyfriend. An hang out and study just to hang out and study.\n\nNow you've made a friend. And you have the same studying stress to connect on and help each other out with. And now her boyfriend gets to know you. And her boyfriend has three friends that come to join him, one is another cool looking chick you get along with. And then you discover she's actually a bit bizarre and has really polar political views that piss you off. But they all talk about going out to a party that night and tell you \"yeah man come if you want.\" So now you're at a party and you go there and talk to your new friends a bit, have a weak conversation with two other people. Mostly dudes. One cool chick but you never quite ended up talking to her before you left. Two days later you have class and sit next to your friend and laugh about a thing that happened and go study again...\n\nTHAT is how you improve your social circle. Improving your social circle, without any sense of outcome, will offer you the opportunities you're trying to create.\n\nAdd in a new hobby. Working out. Travel. Music history. Gardening. \n\nNow, when you go to a party or meet a new person you have a knowledge they likely don't have. You can talk about gardening and how damn awesome it is. Say it with enough conviction and even the stupidest sounding stuff can be cool if you're passionate about it.\n\nNow you just increased your social value, taught someone something new, and became interesting.\n\nAnd you just attracted someone into your life, guy or gal.\n\nAnd one of them will turn into something more.\n\nWhat you need to do is put yourself out into the world. Pickup strategy wont help you right now, expanding your social reach and skills.\n\nGo.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting people attract new people in their life. To become interesting, by definition, you need interests. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re a good person. You a likeable.&lt;/p&gt;\n\n&lt;p&gt;When you think about a girl, you imagine doing new and interesting things together like going on a trip, having her tell you about art and that she wants to see a new gallery exhibit, or her favorite musician is in town and you should go see it together, right?&lt;/p&gt;\n\n&lt;p&gt;They want that, too.&lt;/p&gt;\n\n&lt;p&gt;If all you (mostly) do is read theoretical dating books, play video games, and watch Reddit, what&amp;#39;s the benefit someone receives by adding you to their social circle-- guy or gal? Don&amp;#39;t take that as &amp;quot;you aren&amp;#39;t good enough, you&amp;#39;re boring,&amp;quot; take it as &amp;quot;you have an opportunity to expand your interests.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;People want to be around people who have passions and interests. Video games is one, but even a gamer can expand to MMA, Basketball, horseback riding, DJing, philanthropy, etc.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t fixate on outcomes. Easy to say, hard to do. Your approach stated you started thinking about dating her before even approaching. You were sad when she said she had a boyfriend (who cares if it&amp;#39;s true or not). What you just did is make a potential friend. Tell her it&amp;#39;s all good and if she wants to study together-- tell her to bring her boyfriend. An hang out and study just to hang out and study.&lt;/p&gt;\n\n&lt;p&gt;Now you&amp;#39;ve made a friend. And you have the same studying stress to connect on and help each other out with. And now her boyfriend gets to know you. And her boyfriend has three friends that come to join him, one is another cool looking chick you get along with. And then you discover she&amp;#39;s actually a bit bizarre and has really polar political views that piss you off. But they all talk about going out to a party that night and tell you &amp;quot;yeah man come if you want.&amp;quot; So now you&amp;#39;re at a party and you go there and talk to your new friends a bit, have a weak conversation with two other people. Mostly dudes. One cool chick but you never quite ended up talking to her before you left. Two days later you have class and sit next to your friend and laugh about a thing that happened and go study again...&lt;/p&gt;\n\n&lt;p&gt;THAT is how you improve your social circle. Improving your social circle, without any sense of outcome, will offer you the opportunities you&amp;#39;re trying to create.&lt;/p&gt;\n\n&lt;p&gt;Add in a new hobby. Working out. Travel. Music history. Gardening. &lt;/p&gt;\n\n&lt;p&gt;Now, when you go to a party or meet a new person you have a knowledge they likely don&amp;#39;t have. You can talk about gardening and how damn awesome it is. Say it with enough conviction and even the stupidest sounding stuff can be cool if you&amp;#39;re passionate about it.&lt;/p&gt;\n\n&lt;p&gt;Now you just increased your social value, taught someone something new, and became interesting.&lt;/p&gt;\n\n&lt;p&gt;And you just attracted someone into your life, guy or gal.&lt;/p&gt;\n\n&lt;p&gt;And one of them will turn into something more.&lt;/p&gt;\n\n&lt;p&gt;What you need to do is put yourself out into the world. Pickup strategy wont help you right now, expanding your social reach and skills.&lt;/p&gt;\n\n&lt;p&gt;Go.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9b7rt", "score_hidden": false, "stickied": false, "created": 1492214064.0, "created_utc": 1492185264.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dgb7t9i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PlayLikeNeverB4", "parent_id": "t1_dga88fs", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Does that realistically happen though?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does that realistically happen though?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgb7t9i", "score_hidden": false, "stickied": false, "created": 1492321210.0, "created_utc": 1492292410.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga88fs", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "MartianImmigrant", "parent_id": "t1_dg93mgf", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "This dude's got it.\n\nAnd women have it so much harder. That's a big part of why I flirt and play with girls. If I don't, they will just sit in the bar/at home, lonely, wondering what's wrong with them. There's nothing wrong with them. They don't deserve that. Do them a favor.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This dude&amp;#39;s got it.&lt;/p&gt;\n\n&lt;p&gt;And women have it so much harder. That&amp;#39;s a big part of why I flirt and play with girls. If I don&amp;#39;t, they will just sit in the bar/at home, lonely, wondering what&amp;#39;s wrong with them. There&amp;#39;s nothing wrong with them. They don&amp;#39;t deserve that. Do them a favor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dga88fs", "score_hidden": false, "stickied": false, "created": 1492256121.0, "created_utc": 1492227321.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg93mgf", "gilded": 0, "archived": false, "score": 48, "report_reasons": null, "author": "btiz", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "First of all, your biggest problem is your perspective. \n\nI'm no super pick up artists by any means, but what really \"changed my game\" was when I began taking myself out of the equation...with women and life.\n\nWhen you frame everything you want out of life through your opinions, past experiences, etc. you will NEVER be anything more than you were.\n\nHave you heard of the \"rule\" where if you see a girl you like approach her within seconds? That's to prevent you from having enough time to frame the experience from your perspective and over thinking it.\n\nIf you approach women with the mindset of \"This interaction is going to be fun\" you will have much more of a positive response. Obsessing over YOU getting laid, YOU saying the right thing, what she's going to think of YOU will ultimately all translate into your tone, body language, etc. and not only cock block you, but also stop you from enjoying the experience.\n\nWhen you want anything in life, don't think about the possibility of attaining it, don't let yourself day dream of what it might be like if you attained it...take yourself out of the equation and just go for it. There is always more to gain if you go for an opportunity. Whether you realize it or not, you're learning how to better interact, read people, be more comfortable in your skin, and most importantly how to push yourselves.\n\nAnd men don't have it any harder. You can be below average height, attractiveness, or intelligence, and still have plenty of success with women.\n\nDO NOT pity yourself. You're alive, chase your dreams.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First of all, your biggest problem is your perspective. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m no super pick up artists by any means, but what really &amp;quot;changed my game&amp;quot; was when I began taking myself out of the equation...with women and life.&lt;/p&gt;\n\n&lt;p&gt;When you frame everything you want out of life through your opinions, past experiences, etc. you will NEVER be anything more than you were.&lt;/p&gt;\n\n&lt;p&gt;Have you heard of the &amp;quot;rule&amp;quot; where if you see a girl you like approach her within seconds? That&amp;#39;s to prevent you from having enough time to frame the experience from your perspective and over thinking it.&lt;/p&gt;\n\n&lt;p&gt;If you approach women with the mindset of &amp;quot;This interaction is going to be fun&amp;quot; you will have much more of a positive response. Obsessing over YOU getting laid, YOU saying the right thing, what she&amp;#39;s going to think of YOU will ultimately all translate into your tone, body language, etc. and not only cock block you, but also stop you from enjoying the experience.&lt;/p&gt;\n\n&lt;p&gt;When you want anything in life, don&amp;#39;t think about the possibility of attaining it, don&amp;#39;t let yourself day dream of what it might be like if you attained it...take yourself out of the equation and just go for it. There is always more to gain if you go for an opportunity. Whether you realize it or not, you&amp;#39;re learning how to better interact, read people, be more comfortable in your skin, and most importantly how to push yourselves.&lt;/p&gt;\n\n&lt;p&gt;And men don&amp;#39;t have it any harder. You can be below average height, attractiveness, or intelligence, and still have plenty of success with women.&lt;/p&gt;\n\n&lt;p&gt;DO NOT pity yourself. You&amp;#39;re alive, chase your dreams.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg93mgf", "score_hidden": false, "stickied": false, "created": 1492203892.0, "created_utc": 1492175092.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 48}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9jxbq", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Blueeyesboi", "parent_id": "t1_dg9jjp9", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Talk to people?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talk to people?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9jxbq", "score_hidden": false, "stickied": false, "created": 1492224069.0, "created_utc": 1492195269.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dga8lmf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MartianImmigrant", "parent_id": "t1_dg9jjp9", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Remove the word \"alone\" from your response and the last clause, and reread what you wrote.\n\nThen you'll start to get answers instead of self-pity.\n\nI like to dance, shoot pool, talk to people, flirt, drink, and talk shit. Careful with the shit-taking though or I might have to beat your ass.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Remove the word &amp;quot;alone&amp;quot; from your response and the last clause, and reread what you wrote.&lt;/p&gt;\n\n&lt;p&gt;Then you&amp;#39;ll start to get answers instead of self-pity.&lt;/p&gt;\n\n&lt;p&gt;I like to dance, shoot pool, talk to people, flirt, drink, and talk shit. Careful with the shit-taking though or I might have to beat your ass.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dga8lmf", "score_hidden": false, "stickied": false, "created": 1492256721.0, "created_utc": 1492227921.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9jjp9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "purplepilled2", "parent_id": "t1_dg8zvux", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "What can you do at bars alone? I literally live next to one. Waiting in line alone, ordering a drink alone, walking around in laps alone, just makes me feel self concious. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What can you do at bars alone? I literally live next to one. Waiting in line alone, ordering a drink alone, walking around in laps alone, just makes me feel self concious. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9jjp9", "score_hidden": false, "stickied": false, "created": 1492223618.0, "created_utc": 1492194818.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zvux", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "Blueeyesboi", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Most of us have been at that point. The feeling that i am the only one who can't get girls, who can't talk to them and who gets scared.\n\nDont get me wrong; i am no pick up expert. Im still a virgin at 18. But. I have realised that women are human beings, just like us. They sleep eat, drink, shit, have favorite movies, have goals, get insecure etc.\n\nIf you approach them, you have nothing to lose and all to gain.What would be the worst thing that could happen?\n\n I think you got oneitis from that girl because she was the only girl that gave you attention this time. It happened to me too.\n\n I have a list of things i want you to do :\n\n1 : Stop fapping\n2 : Go out to clubs and bars (solo or with friends doesnt matter.)\n3 : Approach a girl that you find attractive (remember nothing to lose, she could be finding you attractive too and you can't know)\n4 : If you are on self improvement mode, keep up with it\n5 : STAY THE FUCK POSITIVE, NO MATTER WHAT.\n\nI hope this helps you. Again, i am no expert but i think that if you start doing these things your game will improve. Best of luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most of us have been at that point. The feeling that i am the only one who can&amp;#39;t get girls, who can&amp;#39;t talk to them and who gets scared.&lt;/p&gt;\n\n&lt;p&gt;Dont get me wrong; i am no pick up expert. Im still a virgin at 18. But. I have realised that women are human beings, just like us. They sleep eat, drink, shit, have favorite movies, have goals, get insecure etc.&lt;/p&gt;\n\n&lt;p&gt;If you approach them, you have nothing to lose and all to gain.What would be the worst thing that could happen?&lt;/p&gt;\n\n&lt;p&gt;I think you got oneitis from that girl because she was the only girl that gave you attention this time. It happened to me too.&lt;/p&gt;\n\n&lt;p&gt;I have a list of things i want you to do :&lt;/p&gt;\n\n&lt;p&gt;1 : Stop fapping\n2 : Go out to clubs and bars (solo or with friends doesnt matter.)\n3 : Approach a girl that you find attractive (remember nothing to lose, she could be finding you attractive too and you can&amp;#39;t know)\n4 : If you are on self improvement mode, keep up with it\n5 : STAY THE FUCK POSITIVE, NO MATTER WHAT.&lt;/p&gt;\n\n&lt;p&gt;I hope this helps you. Again, i am no expert but i think that if you start doing these things your game will improve. Best of luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg8zvux", "score_hidden": false, "stickied": false, "created": 1492195276.0, "created_utc": 1492166476.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg96i14", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "anon1moos", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You are under no obligation to be the same person you were five minutes ago.  You're really hung up on being a virgin, and you need to get out of your head.  It's making you sound needy as fuck.  Do you have any hobbies?  \n\n\"I have a boyfriend\" or \"I'm a lesbian\" might just be an excuse.  The girls you think are easy marks probably aren't because they aren't used to getting hit on.  \n\nIt also sounds like you're getting hung up on a small number of individual rejections.  It happens, even to professionals.  Learn from them and move on.  There are no failures, only information, analyze them enough to figure out what you could have done better, then move on. \n\nI know this is heresy to say here, but I'm not a big fan of \"Models\".  The central truth in game is \"there is no reason you're not enough\" which is from Alex (formerly RSDAlex, I think it's \"alexSocial\" now but can't remember).  You seem to be a PUA superfan, so I think you'd enjoy his \"manifesto\" video.  I'm on mobile now so I'm not going to post the link. \n\nIf there is some reason you think you're not enough, fix that before you start trying to get with women, or they'll see right through you.  \n\nFinally, I'd like to say, I know plenty of well adjusted interesting people (men and women) who lost their virginity in their 20's.\n\nTL:DR being needy and weird, not approaching enough.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are under no obligation to be the same person you were five minutes ago.  You&amp;#39;re really hung up on being a virgin, and you need to get out of your head.  It&amp;#39;s making you sound needy as fuck.  Do you have any hobbies?  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I have a boyfriend&amp;quot; or &amp;quot;I&amp;#39;m a lesbian&amp;quot; might just be an excuse.  The girls you think are easy marks probably aren&amp;#39;t because they aren&amp;#39;t used to getting hit on.  &lt;/p&gt;\n\n&lt;p&gt;It also sounds like you&amp;#39;re getting hung up on a small number of individual rejections.  It happens, even to professionals.  Learn from them and move on.  There are no failures, only information, analyze them enough to figure out what you could have done better, then move on. &lt;/p&gt;\n\n&lt;p&gt;I know this is heresy to say here, but I&amp;#39;m not a big fan of &amp;quot;Models&amp;quot;.  The central truth in game is &amp;quot;there is no reason you&amp;#39;re not enough&amp;quot; which is from Alex (formerly RSDAlex, I think it&amp;#39;s &amp;quot;alexSocial&amp;quot; now but can&amp;#39;t remember).  You seem to be a PUA superfan, so I think you&amp;#39;d enjoy his &amp;quot;manifesto&amp;quot; video.  I&amp;#39;m on mobile now so I&amp;#39;m not going to post the link. &lt;/p&gt;\n\n&lt;p&gt;If there is some reason you think you&amp;#39;re not enough, fix that before you start trying to get with women, or they&amp;#39;ll see right through you.  &lt;/p&gt;\n\n&lt;p&gt;Finally, I&amp;#39;d like to say, I know plenty of well adjusted interesting people (men and women) who lost their virginity in their 20&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;TL:DR being needy and weird, not approaching enough.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg96i14", "score_hidden": false, "stickied": false, "created": 1492208233.0, "created_utc": 1492179433.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dgb5mdl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Austonmatthews345", "parent_id": "t1_dg9nbrf", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I disagree. Why have sex with someone who isn't attractive to you? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I disagree. Why have sex with someone who isn&amp;#39;t attractive to you? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgb5mdl", "score_hidden": false, "stickied": false, "created": 1492318180.0, "created_utc": 1492289380.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dgb8zz1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PlayLikeNeverB4", "parent_id": "t1_dg9nbrf", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Is the girls' attractiveness that big of a factor? I'm kind of skeptic on this. The less attractive girls have lots of options too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is the girls&amp;#39; attractiveness that big of a factor? I&amp;#39;m kind of skeptic on this. The less attractive girls have lots of options too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgb8zz1", "score_hidden": false, "stickied": false, "created": 1492322867.0, "created_utc": 1492294067.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9nbrf", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Jaereth", "parent_id": "t1_dg99wlq", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt; My advice for you: start low. Meet some girls below your standards. Get some experience. As you keep improving and the neediness evaporates, level up until you hit your limit.\n \n\nYup. Upset you can't date? Fucking lower your standards and date for a while. Move up when you feel comfortable. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;My advice for you: start low. Meet some girls below your standards. Get some experience. As you keep improving and the neediness evaporates, level up until you hit your limit.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yup. Upset you can&amp;#39;t date? Fucking lower your standards and date for a while. Move up when you feel comfortable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9nbrf", "score_hidden": false, "stickied": false, "created": 1492228167.0, "created_utc": 1492199367.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg99wlq", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "ingenjor", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Dude. You have anger issues and you are needy. My advice for you: start low. Meet some girls below your standards. Get some experience. As you keep improving and the neediness evaporates, level up until you hit your limit. You'll have a better shot at your peers once you're secure in yourself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude. You have anger issues and you are needy. My advice for you: start low. Meet some girls below your standards. Get some experience. As you keep improving and the neediness evaporates, level up until you hit your limit. You&amp;#39;ll have a better shot at your peers once you&amp;#39;re secure in yourself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg99wlq", "score_hidden": false, "stickied": false, "created": 1492212534.0, "created_utc": 1492183734.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9ws3u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ThisTimeImTheAsshole", "parent_id": "t1_dg9unpe", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9ws3u", "score_hidden": false, "stickied": false, "created": 1492240181.0, "created_utc": 1492211381.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9unpe", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "WarIsPeeps", "parent_id": "t1_dg9mip6", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "OP this is the best comment in this thread, take this mans advice and boof it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP this is the best comment in this thread, take this mans advice and boof it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9unpe", "score_hidden": false, "stickied": false, "created": 1492237327.0, "created_utc": 1492208527.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dgaeld5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ThisTimeImTheAsshole", "parent_id": "t1_dgaamhe", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Haha. Thanks! Sometimes when I tell it like it is, it is not well received.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha. Thanks! Sometimes when I tell it like it is, it is not well received.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgaeld5", "score_hidden": false, "stickied": false, "created": 1492268515.0, "created_utc": 1492239715.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaamhe", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheCaptainUnderwear", "parent_id": "t1_dg9mip6", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Username does not check out", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Username does not check out&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgaamhe", "score_hidden": false, "stickied": false, "created": 1492260154.0, "created_utc": 1492231354.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dgba8fc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ThisTimeImTheAsshole", "parent_id": "t1_dgb9a7k", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "No specific life in mind because everyone has their thing. And that being said, there are others who enjoy the same thing. So at some point you are bound to find people who would like to be part of that life.\n\n&gt; Because someone might enjoy their life, but that does not necessarily mean others will want to join in.\n\nAbsolutely a possibility. At least the person is enjoying the life they pursued", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No specific life in mind because everyone has their thing. And that being said, there are others who enjoy the same thing. So at some point you are bound to find people who would like to be part of that life.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Because someone might enjoy their life, but that does not necessarily mean others will want to join in.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Absolutely a possibility. At least the person is enjoying the life they pursued&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgba8fc", "score_hidden": false, "stickied": false, "created": 1492324640.0, "created_utc": 1492295840.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb9a7k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PlayLikeNeverB4", "parent_id": "t1_dg9mip6", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt; Create the life you want and enjoy the hell out of it. People will want to be a part of that.\n\nI think you may have some specific \"life\" in mind when saying this. Because someone might enjoy their life, but that does not necessarily mean others will want to join in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Create the life you want and enjoy the hell out of it. People will want to be a part of that.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think you may have some specific &amp;quot;life&amp;quot; in mind when saying this. Because someone might enjoy their life, but that does not necessarily mean others will want to join in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgb9a7k", "score_hidden": false, "stickied": false, "created": 1492323262.0, "created_utc": 1492294462.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9mip6", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ThisTimeImTheAsshole", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Life is challenging. Period. Challenging is what makes it interesting too.\n\nTwo things I see.\n\n1. Stop the negative self-talk.\n\n2. Stop looking to external validation.\n\nA person tends to create what they think about a lot. You are all bummed out about what you don't have and aren't getting. You think about that more and more and everything you see is what you lack. Do you see that? Your whole post is about what is not happening in your life. When your focus is on what you lack, you put everyone (friend, lover, etc.) in the position of filling what your life lacks. You **need** them. When you don't get it, you see what you lost (but never had). This creates a cycle of self-fulfilling negativity. Stop being be your own obstacle.\n\nThe people you invite into your life don't want the responsibility of filling your life's holes. Plus that particular life cycle is not enjoyable for them.\n\nCreate the life you want and enjoy the hell out of it. People will want to be a part of that.\n\nYou are focusing on external validation instead of focusing on your own triumphs. When the external validation isn't there you internalize the failure compounding the *my-life-lacks perspective*. When the external validation is there, you minimize it so you don't fully benefit from it. Either way external validation has little to do with you directly and most everything about what others think -which is too subjective to matter to you.\n\n&gt; I was fucking proud of myself \n\nWhen you focus on your own growth and triumphs, you see yourself for you - independent of people's wonky behaviors and unpredictable opinions. When you see yourself, you can recognize the weaknesses so you can evolve them. You can feel good about the strengths and keep the momentum of personal growth. You can see what you have and be grateful for it. You build the positive aspects of you and continually minimize the negative aspects of you. People dig positivity.\n\nYou need to answer this for yourself: If you cannot be grateful &amp; happy for what you have now, how the fuck can you get more and expect to be grateful &amp; happy later? Happiness is an internal dynamic and a choice.\n\n&gt; maybe I won't experience love.\n\n*Maybe. Maybe. Maybe.* Fuck it. Who cares. Maybe you won't. Maybe you will. Stop trying to predict the future and live today.\n\n&gt; I had to approach her. I went for it. I told myself fuck it. \n\nKeep doing this. Learn from it every fucking time and not one of those opportunities will be wasted.\n\nEDIT: Happiness Side Note: Imagine you can only live in a tiny room with a window, a bed, and a tiny bathroom. You are fed enough to live. What can you be grateful for? Can you choose be happy with what you have? If you can imagine happiness and gratitude with this scenario, what can you do with everything you have now?", "edited": 1492199663.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Life is challenging. Period. Challenging is what makes it interesting too.&lt;/p&gt;\n\n&lt;p&gt;Two things I see.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Stop the negative self-talk.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Stop looking to external validation.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;A person tends to create what they think about a lot. You are all bummed out about what you don&amp;#39;t have and aren&amp;#39;t getting. You think about that more and more and everything you see is what you lack. Do you see that? Your whole post is about what is not happening in your life. When your focus is on what you lack, you put everyone (friend, lover, etc.) in the position of filling what your life lacks. You &lt;strong&gt;need&lt;/strong&gt; them. When you don&amp;#39;t get it, you see what you lost (but never had). This creates a cycle of self-fulfilling negativity. Stop being be your own obstacle.&lt;/p&gt;\n\n&lt;p&gt;The people you invite into your life don&amp;#39;t want the responsibility of filling your life&amp;#39;s holes. Plus that particular life cycle is not enjoyable for them.&lt;/p&gt;\n\n&lt;p&gt;Create the life you want and enjoy the hell out of it. People will want to be a part of that.&lt;/p&gt;\n\n&lt;p&gt;You are focusing on external validation instead of focusing on your own triumphs. When the external validation isn&amp;#39;t there you internalize the failure compounding the &lt;em&gt;my-life-lacks perspective&lt;/em&gt;. When the external validation is there, you minimize it so you don&amp;#39;t fully benefit from it. Either way external validation has little to do with you directly and most everything about what others think -which is too subjective to matter to you.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I was fucking proud of myself &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;When you focus on your own growth and triumphs, you see yourself for you - independent of people&amp;#39;s wonky behaviors and unpredictable opinions. When you see yourself, you can recognize the weaknesses so you can evolve them. You can feel good about the strengths and keep the momentum of personal growth. You can see what you have and be grateful for it. You build the positive aspects of you and continually minimize the negative aspects of you. People dig positivity.&lt;/p&gt;\n\n&lt;p&gt;You need to answer this for yourself: If you cannot be grateful &amp;amp; happy for what you have now, how the fuck can you get more and expect to be grateful &amp;amp; happy later? Happiness is an internal dynamic and a choice.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;maybe I won&amp;#39;t experience love.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;em&gt;Maybe. Maybe. Maybe.&lt;/em&gt; Fuck it. Who cares. Maybe you won&amp;#39;t. Maybe you will. Stop trying to predict the future and live today.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I had to approach her. I went for it. I told myself fuck it. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Keep doing this. Learn from it every fucking time and not one of those opportunities will be wasted.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Happiness Side Note: Imagine you can only live in a tiny room with a window, a bed, and a tiny bathroom. You are fed enough to live. What can you be grateful for? Can you choose be happy with what you have? If you can imagine happiness and gratitude with this scenario, what can you do with everything you have now?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9mip6", "score_hidden": false, "stickied": false, "created": 1492227197.0, "created_utc": 1492198397.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg91n7r", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "samiamari", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Man keep going. Trust me I have experienced the same thing. The thing is I stopped caring. You just got to keep going. I hope u find someone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man keep going. Trust me I have experienced the same thing. The thing is I stopped caring. You just got to keep going. I hope u find someone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg91n7r", "score_hidden": false, "stickied": false, "created": 1492199979.0, "created_utc": 1492171179.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9n5l4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "reecewagner", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You're 20. You're exactly where I was when I was 20 in fact, and now I'm 32 and have fucked 50+ women. Some of this stuff just comes with time, but the self improvement is no joke. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re 20. You&amp;#39;re exactly where I was when I was 20 in fact, and now I&amp;#39;m 32 and have fucked 50+ women. Some of this stuff just comes with time, but the self improvement is no joke. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9n5l4", "score_hidden": false, "stickied": false, "created": 1492227962.0, "created_utc": 1492199162.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9bfys", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "saya999", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "The art of seduction by Robert Greene book can help you a bit. \nPlease try this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The art of seduction by Robert Greene book can help you a bit. \nPlease try this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9bfys", "score_hidden": false, "stickied": false, "created": 1492214327.0, "created_utc": 1492185527.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9nbti", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "threewawway", "parent_id": "t1_dg99nwu", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Work and Gain Self Confidence\n\nGet Tinder\n\nSwipe \n\nNo Matches\n\nLose Self Confidence\n\nDelete Tinder\n\nRepeat step one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Work and Gain Self Confidence&lt;/p&gt;\n\n&lt;p&gt;Get Tinder&lt;/p&gt;\n\n&lt;p&gt;Swipe &lt;/p&gt;\n\n&lt;p&gt;No Matches&lt;/p&gt;\n\n&lt;p&gt;Lose Self Confidence&lt;/p&gt;\n\n&lt;p&gt;Delete Tinder&lt;/p&gt;\n\n&lt;p&gt;Repeat step one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9nbti", "score_hidden": false, "stickied": false, "created": 1492228169.0, "created_utc": 1492199369.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9wi5v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LeonardWoods", "parent_id": "t1_dg99nwu", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I get some matches from time to time, but NO GIRL EVER actually answered to my texts.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get some matches from time to time, but NO GIRL EVER actually answered to my texts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9wi5v", "score_hidden": false, "stickied": false, "created": 1492239811.0, "created_utc": 1492211011.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg99nwu", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "anotherthrowawayad22", "parent_id": "t1_dg95i74", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Lol  I haven't had a single match on tinder ever. It destroys your confidence. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol  I haven&amp;#39;t had a single match on tinder ever. It destroys your confidence. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg99nwu", "score_hidden": false, "stickied": false, "created": 1492212244.0, "created_utc": 1492183444.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dgb5og8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Austonmatthews345", "parent_id": "t1_dg95i74", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Tinder lol. If you're not a 8/10 good luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tinder lol. If you&amp;#39;re not a 8/10 good luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgb5og8", "score_hidden": false, "stickied": false, "created": 1492318259.0, "created_utc": 1492289459.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg95i74", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "IM_STEVE_STIFLER", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "If you're looking for a simple hookup, go on tinder and find a girl off there. Otherwise, Just keep doing what you're doing. Stop being in your head soo much. Self doubt and worrying about your future and your future with these girls will kill you. If you're in college, find people that host parties, girls will be there haha. I didn't have sex till i was 20 actually on my 20th birthday haha.  Don't go say hi to a girl with the intention of having sex or getting her number. Just be yourself and see if you click, look for red flags.  Especially if you're at college, there will be plenty of girls. Plenty of them have boyfriends, plenty of them don't. Some girls are shitty, deal with it. Start working out when you can, there's always girls on the fucking elyptical or the treadmill. Furthermore, you'll get muscles. Also, a lot of my girlfriends have been introduced to me by my friends or it just happened in an social setting. Don't feel like your situation is do or die. Just live my friend!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re looking for a simple hookup, go on tinder and find a girl off there. Otherwise, Just keep doing what you&amp;#39;re doing. Stop being in your head soo much. Self doubt and worrying about your future and your future with these girls will kill you. If you&amp;#39;re in college, find people that host parties, girls will be there haha. I didn&amp;#39;t have sex till i was 20 actually on my 20th birthday haha.  Don&amp;#39;t go say hi to a girl with the intention of having sex or getting her number. Just be yourself and see if you click, look for red flags.  Especially if you&amp;#39;re at college, there will be plenty of girls. Plenty of them have boyfriends, plenty of them don&amp;#39;t. Some girls are shitty, deal with it. Start working out when you can, there&amp;#39;s always girls on the fucking elyptical or the treadmill. Furthermore, you&amp;#39;ll get muscles. Also, a lot of my girlfriends have been introduced to me by my friends or it just happened in an social setting. Don&amp;#39;t feel like your situation is do or die. Just live my friend!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg95i74", "score_hidden": false, "stickied": false, "created": 1492206829.0, "created_utc": 1492178029.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9hej8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Elite-hacks", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "OP, I know you think that if a girl came up to you, and asked YOU out, and you lost your v card to her, you'd be happy right? Well that literally happened to me, and a year later I was back to square 1. \n\nSo this girl who had known me for years confesses her love to me, kissless virgin at 20. Fuck yea! We dated for the past 5 years. Shit has been eye opening. Let me tell you, being with one girl is a lot like being with zero girls. I still felt like a virgin. I still wanted to go out and try pickup and even though this girl was and is absolutely flawless, i still resented her over personal issues.\n\nTHE PERSONAL ISSUES you have right now wont go away!!! You will feel the exact same way after one girl, two girls, three girls. You need to get into a healthy exercise and diet routine. Drop all bad habbits, start making money on the side. Personal improvement, key word, personal. I lived with my girlfriend after dating for 2 months, that is NOT the correct way to do it. Trust me.\n\nThe personal issues you have right now are up to you to solve individually. You THINK the problem is you are lonely, but happiness comes from within. Think about it. I had a girl literally sit on my dick without me doing anything, and I was still depressed, unhappy, even started abusimg her emotionally. The issues are inside YOUR BRAIN. No pussy is going to fix it. Its not an overnight change like the second you stick your dick in her, your life will be fixed (yeah it will feel that way for a few months, which will trap you in that codependent relationship). \n\nChange is a gradual long BORING process. You have to put in the effort!!! You have to do the work yourself!!! No girl can solve your own personal issues.\n\nSorry for repeating myself a lot. This is all true and the situations I found myself in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP, I know you think that if a girl came up to you, and asked YOU out, and you lost your v card to her, you&amp;#39;d be happy right? Well that literally happened to me, and a year later I was back to square 1. &lt;/p&gt;\n\n&lt;p&gt;So this girl who had known me for years confesses her love to me, kissless virgin at 20. Fuck yea! We dated for the past 5 years. Shit has been eye opening. Let me tell you, being with one girl is a lot like being with zero girls. I still felt like a virgin. I still wanted to go out and try pickup and even though this girl was and is absolutely flawless, i still resented her over personal issues.&lt;/p&gt;\n\n&lt;p&gt;THE PERSONAL ISSUES you have right now wont go away!!! You will feel the exact same way after one girl, two girls, three girls. You need to get into a healthy exercise and diet routine. Drop all bad habbits, start making money on the side. Personal improvement, key word, personal. I lived with my girlfriend after dating for 2 months, that is NOT the correct way to do it. Trust me.&lt;/p&gt;\n\n&lt;p&gt;The personal issues you have right now are up to you to solve individually. You THINK the problem is you are lonely, but happiness comes from within. Think about it. I had a girl literally sit on my dick without me doing anything, and I was still depressed, unhappy, even started abusimg her emotionally. The issues are inside YOUR BRAIN. No pussy is going to fix it. Its not an overnight change like the second you stick your dick in her, your life will be fixed (yeah it will feel that way for a few months, which will trap you in that codependent relationship). &lt;/p&gt;\n\n&lt;p&gt;Change is a gradual long BORING process. You have to put in the effort!!! You have to do the work yourself!!! No girl can solve your own personal issues.&lt;/p&gt;\n\n&lt;p&gt;Sorry for repeating myself a lot. This is all true and the situations I found myself in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9hej8", "score_hidden": false, "stickied": false, "created": 1492221079.0, "created_utc": 1492192279.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9ub5y", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "stillworkin", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I didn't read your post, just the title.  I was 21 before I had my first kiss and gf.  But I didn't care too much -- in fact, the gf was willing to have sex within the first few weeks of dating, but I contemplated it for about a week or so, then finally gave in (I wasn't *too* into her and wanted to make sure I didn't regret her being my first).\n\nI was average looking back then, but was interesting.  Over the next few years, I became way more attractive at large -- got into a top grad school, started travelling for fun internationally, back packing in cool, crazy places that most Americans would never consider going.  I had long-term partner after long-term partner, which spanned the next 10 years.  By the age of 28 actually I had only had 2 sexual partners though.  (Some long-term partners didn't want sex before marriage.  Crazy, I know, and I didn't complain).  \n\nIn the last 2 years, I've had something like 25 new sexual partners.  My point is, don't worry about your \"return\" right now.  Just work on you and enjoying life and figuring out what you enjoy.  Romantic interest will come once you build a foundation of an interesting life.  Sure, there's definitely an art to dating and SOO much to learn but work on the main ingredients first -- you.  It's liek field of dreams: \"if you build it**, they will come\"  pun intended.\n\n** it being you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t read your post, just the title.  I was 21 before I had my first kiss and gf.  But I didn&amp;#39;t care too much -- in fact, the gf was willing to have sex within the first few weeks of dating, but I contemplated it for about a week or so, then finally gave in (I wasn&amp;#39;t &lt;em&gt;too&lt;/em&gt; into her and wanted to make sure I didn&amp;#39;t regret her being my first).&lt;/p&gt;\n\n&lt;p&gt;I was average looking back then, but was interesting.  Over the next few years, I became way more attractive at large -- got into a top grad school, started travelling for fun internationally, back packing in cool, crazy places that most Americans would never consider going.  I had long-term partner after long-term partner, which spanned the next 10 years.  By the age of 28 actually I had only had 2 sexual partners though.  (Some long-term partners didn&amp;#39;t want sex before marriage.  Crazy, I know, and I didn&amp;#39;t complain).  &lt;/p&gt;\n\n&lt;p&gt;In the last 2 years, I&amp;#39;ve had something like 25 new sexual partners.  My point is, don&amp;#39;t worry about your &amp;quot;return&amp;quot; right now.  Just work on you and enjoying life and figuring out what you enjoy.  Romantic interest will come once you build a foundation of an interesting life.  Sure, there&amp;#39;s definitely an art to dating and SOO much to learn but work on the main ingredients first -- you.  It&amp;#39;s liek field of dreams: &amp;quot;if you build it**, they will come&amp;quot;  pun intended.&lt;/p&gt;\n\n&lt;p&gt;** it being you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9ub5y", "score_hidden": false, "stickied": false, "created": 1492236869.0, "created_utc": 1492208069.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dga2fco", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "John-doesnt-exist", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You obviously think about it too much. I'll be honest I only read the first \"paragraph.\" I was like this, since I'm an ugly looking bastard. Thing is, my brain makes up for it sometimes. I had the stupid notion that I could play out a scenerio, and prepare my approach to women in a methotical and prepared kind of way. It never worked. Looking at numbers, success rates, technoques, to be honest, it's all crap. I realized I wasn't special, and my circumstances weren't so different from any one else's. What held me back was joining late. I never cared about actively getting girls in HS. Once I did, it was super hard to wrap my head around just going out and just talking to them as if they are human, and as if they share insecurities, and interests of their own. Radical I know. The only thing that can really help people out is carrying conversations, or probing the target with intriguing thoights. Keep the conversation fun, interesting without it becoming a lecture and that's about it. I used to browse this sub a lot. Now I don't. You can't \"learn\" this from other people with stats, people are more than numbers. And even with the most ridiculous of odds \"99.9999% a girl likes this\" well shit, what about the .0001. That's where anyone can get lucky, of you just go out there and try. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You obviously think about it too much. I&amp;#39;ll be honest I only read the first &amp;quot;paragraph.&amp;quot; I was like this, since I&amp;#39;m an ugly looking bastard. Thing is, my brain makes up for it sometimes. I had the stupid notion that I could play out a scenerio, and prepare my approach to women in a methotical and prepared kind of way. It never worked. Looking at numbers, success rates, technoques, to be honest, it&amp;#39;s all crap. I realized I wasn&amp;#39;t special, and my circumstances weren&amp;#39;t so different from any one else&amp;#39;s. What held me back was joining late. I never cared about actively getting girls in HS. Once I did, it was super hard to wrap my head around just going out and just talking to them as if they are human, and as if they share insecurities, and interests of their own. Radical I know. The only thing that can really help people out is carrying conversations, or probing the target with intriguing thoights. Keep the conversation fun, interesting without it becoming a lecture and that&amp;#39;s about it. I used to browse this sub a lot. Now I don&amp;#39;t. You can&amp;#39;t &amp;quot;learn&amp;quot; this from other people with stats, people are more than numbers. And even with the most ridiculous of odds &amp;quot;99.9999% a girl likes this&amp;quot; well shit, what about the .0001. That&amp;#39;s where anyone can get lucky, of you just go out there and try. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dga2fco", "score_hidden": false, "stickied": false, "created": 1492247711.0, "created_utc": 1492218911.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg957h3", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "widdlyscudsandbacon", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You can't put the pussy on a pedestal", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can&amp;#39;t put the pussy on a pedestal&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg957h3", "score_hidden": false, "stickied": false, "created": 1492206401.0, "created_utc": 1492177601.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg915pv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ErnieJohn", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You've got a good pattern of action started, keep building.  Open everyone. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ve got a good pattern of action started, keep building.  Open everyone. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg915pv", "score_hidden": false, "stickied": false, "created": 1492198832.0, "created_utc": 1492170032.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg93ynq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "OrangeNinja22", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "A good place to start might be to get a job at a local bar/club. \n\nI started working at one for around a year and a half now and i can see a serious improvement in my game.\n\nYou have to overcome boundries you would normally take. You have to approach people and have a conversation with them, no matter the sex.\n\nGirls will also look up to you in this sector, as you are the person helping them to a drink. Escalating is also easy, I.E having eye contact when they are ordering can be a sign of dominance.\n\nOh, and remember to keep smiling", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A good place to start might be to get a job at a local bar/club. &lt;/p&gt;\n\n&lt;p&gt;I started working at one for around a year and a half now and i can see a serious improvement in my game.&lt;/p&gt;\n\n&lt;p&gt;You have to overcome boundries you would normally take. You have to approach people and have a conversation with them, no matter the sex.&lt;/p&gt;\n\n&lt;p&gt;Girls will also look up to you in this sector, as you are the person helping them to a drink. Escalating is also easy, I.E having eye contact when they are ordering can be a sign of dominance.&lt;/p&gt;\n\n&lt;p&gt;Oh, and remember to keep smiling&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg93ynq", "score_hidden": false, "stickied": false, "created": 1492204470.0, "created_utc": 1492175670.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg95zay", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ThrowawayPUA", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt;The CDC also reports that virgins make up 12.3 percent of females and 14.3 percent of males aged 20 to 24. That number drops below 5 percent for both male and female virgins aged 25 to 29 and goes as low as 0.3 percent for virgins aged 40 to 44.\n\nYou should probably check out [the CDC statistics](https://www.cdc.gov/nchs/data/nhsr/nhsr088.pdf) directly, that isn't quite what I remember from the last time I looked at them.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The CDC also reports that virgins make up 12.3 percent of females and 14.3 percent of males aged 20 to 24. That number drops below 5 percent for both male and female virgins aged 25 to 29 and goes as low as 0.3 percent for virgins aged 40 to 44.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You should probably check out &lt;a href=\"https://www.cdc.gov/nchs/data/nhsr/nhsr088.pdf\"&gt;the CDC statistics&lt;/a&gt; directly, that isn&amp;#39;t quite what I remember from the last time I looked at them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg95zay", "score_hidden": false, "stickied": false, "created": 1492207505.0, "created_utc": 1492178705.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9aq2f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "britian988", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "The idea that your post is so long means you're inside your head too much. I didn't even read it to know you have to not let it affect you, rather fake it until you make it. Keep a calm mind, read models, talk slow and with your diaphragm, and connect with women on a emotional level during conversation. You could be talking about how cows like orange cream and you could have a good conversation. React with emotion, whatever she says respond with short responses, and use subliminal emotional response. New to the game and it has worked wonders for me.\n\nEDIT: add on. For conversation, whatever she says, send back a warm response that relates to the conversation. Do it slow, take deep breaths, and just unwind and be calm. You're done ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The idea that your post is so long means you&amp;#39;re inside your head too much. I didn&amp;#39;t even read it to know you have to not let it affect you, rather fake it until you make it. Keep a calm mind, read models, talk slow and with your diaphragm, and connect with women on a emotional level during conversation. You could be talking about how cows like orange cream and you could have a good conversation. React with emotion, whatever she says respond with short responses, and use subliminal emotional response. New to the game and it has worked wonders for me.&lt;/p&gt;\n\n&lt;p&gt;EDIT: add on. For conversation, whatever she says, send back a warm response that relates to the conversation. Do it slow, take deep breaths, and just unwind and be calm. You&amp;#39;re done &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9aq2f", "score_hidden": false, "stickied": false, "created": 1492213494.0, "created_utc": 1492184694.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9dfcx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rock2Rock", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Seriously, from the length of your post the answer to your question is incredibly simple...you are over thinking it. Just try to relax around women and it will happen naturally, they want it as bad as you do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seriously, from the length of your post the answer to your question is incredibly simple...you are over thinking it. Just try to relax around women and it will happen naturally, they want it as bad as you do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9dfcx", "score_hidden": false, "stickied": false, "created": 1492216523.0, "created_utc": 1492187723.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9eshw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ackilles", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "So I was in a similar situation - though mine broke at the beginning of sophomore year.  It is very possible to become good with girls even if you are currently clueless.\n\n\n\nI was in decent shape, but kicked my workout routines up a notch.  I started with appearance (though that is less important than i realized at the time) and revamped everything.  I read as much as I could on the topic and edited everything from how I got my hair cut to dressing more \"adult\" - meaning less of the t-shirts i had from high school.\n\n\n\n\nI also started studying the PUA community pretty heavily and trying to emulate how they perceive the world and interact with others.  I'm not a fan of the one night stand thing - but if you learn the \"system\" you can simply choose to not do that.  The concepts will help you get and keep a girlfriend.\n\n\n\nIf you don't have confidence, fake it.  Fake confidence can lead to wins, which lead to real confidence.\n\n\n\nIf you want to really kick it up a notch... I made a game for myself later on.  If I left my house and was gone for more than 2 hours, I couldn't go home until I met someone new.  That could mean a 2 minute chat about the weather with a random person on the transit (no parking on campus) or making a new permanent friend in a class.  That was a total game changer for my social awareness, but it is a bit harder to force oneself to do", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So I was in a similar situation - though mine broke at the beginning of sophomore year.  It is very possible to become good with girls even if you are currently clueless.&lt;/p&gt;\n\n&lt;p&gt;I was in decent shape, but kicked my workout routines up a notch.  I started with appearance (though that is less important than i realized at the time) and revamped everything.  I read as much as I could on the topic and edited everything from how I got my hair cut to dressing more &amp;quot;adult&amp;quot; - meaning less of the t-shirts i had from high school.&lt;/p&gt;\n\n&lt;p&gt;I also started studying the PUA community pretty heavily and trying to emulate how they perceive the world and interact with others.  I&amp;#39;m not a fan of the one night stand thing - but if you learn the &amp;quot;system&amp;quot; you can simply choose to not do that.  The concepts will help you get and keep a girlfriend.&lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t have confidence, fake it.  Fake confidence can lead to wins, which lead to real confidence.&lt;/p&gt;\n\n&lt;p&gt;If you want to really kick it up a notch... I made a game for myself later on.  If I left my house and was gone for more than 2 hours, I couldn&amp;#39;t go home until I met someone new.  That could mean a 2 minute chat about the weather with a random person on the transit (no parking on campus) or making a new permanent friend in a class.  That was a total game changer for my social awareness, but it is a bit harder to force oneself to do&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9eshw", "score_hidden": false, "stickied": false, "created": 1492218058.0, "created_utc": 1492189258.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9g41t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Treecki", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I'm mostly a lurker on this sub and honestly not much of a PUA but I find this sub in general has led me to understand and react to social situations better and have a better time flirting with girls. I'm your age and I've slept with a decent number of girls and it began during the early years of my college experience, but I completely understand the position you are coming from. It is difficult to be able to push past a lot of the anxiety that comes from the pick up game when you are a kissless virgin, but in order to push past this you have to shift your focus and anxiety away from sex so you can stop keeping it on such a high pedestal.\n\n\nThis first thing I would so to do is read \"Models\" by Mark Manson. I know people say that a lot here, but there is a reason for that. Mark helps to break down a path for self-improvement and then puts sexual attraction and interaction in a realistic perspective. I know you are busy with college courses, but you need to find the time for self-improvement and to read the book. Section out a half an hour to  an hour to just read and fully understand the book.\n\nThis brings me to my second point, you need to improve yourself and your self-esteem. Telling yourself you are amazing and confident doesn't bring confidence if you still know in the back of your mind that you don't like who you currently are. Go to the gym and begin weightlifting again, or even running. Just get back into regular exercise 3 days a week for an hour each and you can check r/fitness for a basic routine to start. Begin to update your wardrobe to a style you can find in r/malefashionadvice that YOU like. It's easy to try to fit a certain style to look better, but you don't want to dress for other people. You should try to dress for yourself so when you are wearing you favorite shirt or outfit you feel confident and proud of it. Finally, begin to try out new hobbies and learn new things. I know your college has extracurriculars and clubs, join a couple and try out new things. Try Salsa Dancing, or Pottery, or Yoga, or anything you might be interested. This will give you the opportunity to become a more well rounded person while meeting new people and branching your social circle out.\n\nOnce you have improved on those three things and read Models you will feel a confidence boost because you improved yourself for the sake of yourself. Instead of trying to improve yourself to be able to go after girls, you realize you did it because you genuinely wanted to become a better person. People will see this and enjoy being in your company if you generally have confidence and fun with who you are as a person (as cheesy as that is). This will give you the opportunity to begin to get to know people better and establish a stronger relationship with them because you like who they are. Be flirtatious when establishing these relationships (platonic or not) but also have a genuine interest in getting to know these people around you. People love to talk about themselves, and the stories people have about their lives are fascinating. Everyone has a deep story to who they are and the struggles they have gone through, and simply listening and genuine having an interest makes them appreciate you (whether guy or girl). When you approach, don't go in with an intention to date or fuck but genuinely become interested in who they are. Once you are talking with them, like the personality and looks, then begin to escalate kino and polarize and see if they respond receptively as well. If they do then awesome, continue escalation, banter, and take charge. If they don't, accept that but don't drop them like they are nothing. For example, the girl you hit on who turned out to have a boyfriend, if she was a genuinely interesting person why not become friends with her? You could get a possibly really good friend plus the opportunity to meet her friends as well. I honestly think if you stop focusing on sex so much (which is difficult I understand that) you will see a huge improvement with girls and escalation.\n\n\nI think one of the biggest problems I had when I was a virgin is that I put sex on such a high pedestal and such a miraculous and incredible thing. Don't get me wrong sex is fun, but it's just sex. Your first time may suck and the girl you are with may just be bad at it. If I had the choice between okay sex or a good night with close friends I'd take the good night. Understanding this will help to take away the neediness factor that may be hurting you when approaching girls.\n\nI hope this helped. I'm the same age as you and although I'm not an expert, I've been in your shoes and this is what helped me improve. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m mostly a lurker on this sub and honestly not much of a PUA but I find this sub in general has led me to understand and react to social situations better and have a better time flirting with girls. I&amp;#39;m your age and I&amp;#39;ve slept with a decent number of girls and it began during the early years of my college experience, but I completely understand the position you are coming from. It is difficult to be able to push past a lot of the anxiety that comes from the pick up game when you are a kissless virgin, but in order to push past this you have to shift your focus and anxiety away from sex so you can stop keeping it on such a high pedestal.&lt;/p&gt;\n\n&lt;p&gt;This first thing I would so to do is read &amp;quot;Models&amp;quot; by Mark Manson. I know people say that a lot here, but there is a reason for that. Mark helps to break down a path for self-improvement and then puts sexual attraction and interaction in a realistic perspective. I know you are busy with college courses, but you need to find the time for self-improvement and to read the book. Section out a half an hour to  an hour to just read and fully understand the book.&lt;/p&gt;\n\n&lt;p&gt;This brings me to my second point, you need to improve yourself and your self-esteem. Telling yourself you are amazing and confident doesn&amp;#39;t bring confidence if you still know in the back of your mind that you don&amp;#39;t like who you currently are. Go to the gym and begin weightlifting again, or even running. Just get back into regular exercise 3 days a week for an hour each and you can check &lt;a href=\"/r/fitness\"&gt;r/fitness&lt;/a&gt; for a basic routine to start. Begin to update your wardrobe to a style you can find in &lt;a href=\"/r/malefashionadvice\"&gt;r/malefashionadvice&lt;/a&gt; that YOU like. It&amp;#39;s easy to try to fit a certain style to look better, but you don&amp;#39;t want to dress for other people. You should try to dress for yourself so when you are wearing you favorite shirt or outfit you feel confident and proud of it. Finally, begin to try out new hobbies and learn new things. I know your college has extracurriculars and clubs, join a couple and try out new things. Try Salsa Dancing, or Pottery, or Yoga, or anything you might be interested. This will give you the opportunity to become a more well rounded person while meeting new people and branching your social circle out.&lt;/p&gt;\n\n&lt;p&gt;Once you have improved on those three things and read Models you will feel a confidence boost because you improved yourself for the sake of yourself. Instead of trying to improve yourself to be able to go after girls, you realize you did it because you genuinely wanted to become a better person. People will see this and enjoy being in your company if you generally have confidence and fun with who you are as a person (as cheesy as that is). This will give you the opportunity to begin to get to know people better and establish a stronger relationship with them because you like who they are. Be flirtatious when establishing these relationships (platonic or not) but also have a genuine interest in getting to know these people around you. People love to talk about themselves, and the stories people have about their lives are fascinating. Everyone has a deep story to who they are and the struggles they have gone through, and simply listening and genuine having an interest makes them appreciate you (whether guy or girl). When you approach, don&amp;#39;t go in with an intention to date or fuck but genuinely become interested in who they are. Once you are talking with them, like the personality and looks, then begin to escalate kino and polarize and see if they respond receptively as well. If they do then awesome, continue escalation, banter, and take charge. If they don&amp;#39;t, accept that but don&amp;#39;t drop them like they are nothing. For example, the girl you hit on who turned out to have a boyfriend, if she was a genuinely interesting person why not become friends with her? You could get a possibly really good friend plus the opportunity to meet her friends as well. I honestly think if you stop focusing on sex so much (which is difficult I understand that) you will see a huge improvement with girls and escalation.&lt;/p&gt;\n\n&lt;p&gt;I think one of the biggest problems I had when I was a virgin is that I put sex on such a high pedestal and such a miraculous and incredible thing. Don&amp;#39;t get me wrong sex is fun, but it&amp;#39;s just sex. Your first time may suck and the girl you are with may just be bad at it. If I had the choice between okay sex or a good night with close friends I&amp;#39;d take the good night. Understanding this will help to take away the neediness factor that may be hurting you when approaching girls.&lt;/p&gt;\n\n&lt;p&gt;I hope this helped. I&amp;#39;m the same age as you and although I&amp;#39;m not an expert, I&amp;#39;ve been in your shoes and this is what helped me improve. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9g41t", "score_hidden": false, "stickied": false, "created": 1492219577.0, "created_utc": 1492190777.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9gk5m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "santereality", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You're right. Men have it hard.\n\nIt's hard to be alone. It's hard to make the first move. It's hard to experience failure and brush it off like nothing happened. It's hard to see this mounting pile of evidence telling you how worthless you are, and not be cynical about it. But that's the measure of a man.\n\nYou have to stay positive if you want to take control of your life, to achieve your goals, and to get what you want. You have to overcome your struggles. And the hardest part is that for guys who aren't tall or classically handsome, romantically fulfilling experiences are often the result of hard work and a long term positive outlook.\n\nThe nice thing is, men actually have it easier as time goes on. Women are constantly subverted by the next pretty young thing to make it to her 18th birthday. Men have the opposite experience, because women value status and wealth over looks. The longer time goes on, the more value you earn. But you only earn it by working, and by cultivating a healthy attitude towards women and relationships.\n\nSo I'm not here to tell you to hit the gym, or to join a club, or even to approach women at all. I'm here to tell you to wait (and maybe do those things on the side), because that's the hard part. Most guys can't wake up the morning after a bad first date and say, \"Today's the day I make it work.\" Most guys can't look at a shitty year and say, \"This is the year I make it work.\" Revel in the challenge, and in the time spent. Women will respect you for it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right. Men have it hard.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s hard to be alone. It&amp;#39;s hard to make the first move. It&amp;#39;s hard to experience failure and brush it off like nothing happened. It&amp;#39;s hard to see this mounting pile of evidence telling you how worthless you are, and not be cynical about it. But that&amp;#39;s the measure of a man.&lt;/p&gt;\n\n&lt;p&gt;You have to stay positive if you want to take control of your life, to achieve your goals, and to get what you want. You have to overcome your struggles. And the hardest part is that for guys who aren&amp;#39;t tall or classically handsome, romantically fulfilling experiences are often the result of hard work and a long term positive outlook.&lt;/p&gt;\n\n&lt;p&gt;The nice thing is, men actually have it easier as time goes on. Women are constantly subverted by the next pretty young thing to make it to her 18th birthday. Men have the opposite experience, because women value status and wealth over looks. The longer time goes on, the more value you earn. But you only earn it by working, and by cultivating a healthy attitude towards women and relationships.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m not here to tell you to hit the gym, or to join a club, or even to approach women at all. I&amp;#39;m here to tell you to wait (and maybe do those things on the side), because that&amp;#39;s the hard part. Most guys can&amp;#39;t wake up the morning after a bad first date and say, &amp;quot;Today&amp;#39;s the day I make it work.&amp;quot; Most guys can&amp;#39;t look at a shitty year and say, &amp;quot;This is the year I make it work.&amp;quot; Revel in the challenge, and in the time spent. Women will respect you for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9gk5m", "score_hidden": false, "stickied": false, "created": 1492220096.0, "created_utc": 1492191296.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9hh9i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "anon1moos", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Also, good job approaching though.  \n\nFurthermore, even though it sounds like you've read a lot of PUA, it doesn't sound like you have any sort of framework for understanding what you're doing wrong or how to improve.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, good job approaching though.  &lt;/p&gt;\n\n&lt;p&gt;Furthermore, even though it sounds like you&amp;#39;ve read a lot of PUA, it doesn&amp;#39;t sound like you have any sort of framework for understanding what you&amp;#39;re doing wrong or how to improve.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9hh9i", "score_hidden": false, "stickied": false, "created": 1492221166.0, "created_utc": 1492192366.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9hszg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "agcameo", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You're doing great my man.  I lost my virginity at 22.  And I was really anxious about losing it \"so late.\"  What if I didn't even lose it by then?  Was I really that weird?\n\nAs someone who's been in your shoes - don't worry about it.  You're not doing anything wrong. You're on your path.  Keep exploring and learning about yourself.  Don't worry too much about pick up - whether it worked with one girl or another.  Just ask yourself - are you 1% better today than you were yesterday.  If not - what can you do?\n\nIf you're at a university - you might have access to some free or very cheap therapy.  It seems odd to go to a therapist and ask about \"love\".  But I found it very helpful when I was your age (and I still didn't lose my virginity for a couple years).\n\nDeep breaths my man. Life is long. You're doing fine. Even having the awareness that you want to make changes in your life is something that many men don't get to.\n\nCheers bro.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re doing great my man.  I lost my virginity at 22.  And I was really anxious about losing it &amp;quot;so late.&amp;quot;  What if I didn&amp;#39;t even lose it by then?  Was I really that weird?&lt;/p&gt;\n\n&lt;p&gt;As someone who&amp;#39;s been in your shoes - don&amp;#39;t worry about it.  You&amp;#39;re not doing anything wrong. You&amp;#39;re on your path.  Keep exploring and learning about yourself.  Don&amp;#39;t worry too much about pick up - whether it worked with one girl or another.  Just ask yourself - are you 1% better today than you were yesterday.  If not - what can you do?&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re at a university - you might have access to some free or very cheap therapy.  It seems odd to go to a therapist and ask about &amp;quot;love&amp;quot;.  But I found it very helpful when I was your age (and I still didn&amp;#39;t lose my virginity for a couple years).&lt;/p&gt;\n\n&lt;p&gt;Deep breaths my man. Life is long. You&amp;#39;re doing fine. Even having the awareness that you want to make changes in your life is something that many men don&amp;#39;t get to.&lt;/p&gt;\n\n&lt;p&gt;Cheers bro.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9hszg", "score_hidden": false, "stickied": false, "created": 1492221541.0, "created_utc": 1492192741.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9irmr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NTSpike", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I read through most of your post but I won't go into specifics.\n\nI read The Game when I was 14-15. Didn't implement anything, got to college and got wrecked. Super introvert, barely could talk to anybody. On my 20th birthday I decided I would do whatever it took. I approached 100+ girls a month the first 3-4 months. I slowed down after and I didn't get laid until 10 months after I started doing this with intention. Nowadays I sleep with a new girl or two every month if that's what I'm trying to do. I don't think too much about this anymore.\n\nI read your post and can guess at where you're at based on how much you're analyzing just a single approach which ended in a \"I have a boyfriend.\" You're doing a lot of thinking. Analyzing. Reading. I did the same. I read everything. Every three months I would journal a recap that would take almost 5 pages to get out.\n\nStop thinking so much and start doing. How many approaches are you doing? Like really doing? I didn't get laid until I had about 400 approaches in, and not because the numbers game is that shitty, but it took that long for my IDENTITY to shift and become somebody who could move things forward. What are you doing to improve your appearance? Are you in the gym? Are you improving your fashion? You're 20. JOIN A FRAT. Don't make the excuse that you're too old. This is a PIVOTAL moment where it's still okay to rush. JOIN A FRAT.\n\nThis is a numbers game, don't let anyone tell you anything else. Improve your odds by becoming as attractive as possible with your style and fitness and compliment it with as much confidence as you can, but ultimately you're going to have to churn the numbers. I don't do much daygame anymore, but even now I wouldn't expect having to do less than 15 approaches to meet somebody who would want to sleep with me, outside of luck and choosing girls who invite the approach.\n\nJust take action and document. Course correct. Your writing reminds me of my own. You can make it there, it'll just take time. Coming from a dude out of college, that time passes by faster than you think.\n\nAnd by the way, I've gotten laid more that I'm GRADUATED than when I was in college. With hotter girls (granted they're college girls, but still). Just depends on what you do with your life.", "edited": 1492194073.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read through most of your post but I won&amp;#39;t go into specifics.&lt;/p&gt;\n\n&lt;p&gt;I read The Game when I was 14-15. Didn&amp;#39;t implement anything, got to college and got wrecked. Super introvert, barely could talk to anybody. On my 20th birthday I decided I would do whatever it took. I approached 100+ girls a month the first 3-4 months. I slowed down after and I didn&amp;#39;t get laid until 10 months after I started doing this with intention. Nowadays I sleep with a new girl or two every month if that&amp;#39;s what I&amp;#39;m trying to do. I don&amp;#39;t think too much about this anymore.&lt;/p&gt;\n\n&lt;p&gt;I read your post and can guess at where you&amp;#39;re at based on how much you&amp;#39;re analyzing just a single approach which ended in a &amp;quot;I have a boyfriend.&amp;quot; You&amp;#39;re doing a lot of thinking. Analyzing. Reading. I did the same. I read everything. Every three months I would journal a recap that would take almost 5 pages to get out.&lt;/p&gt;\n\n&lt;p&gt;Stop thinking so much and start doing. How many approaches are you doing? Like really doing? I didn&amp;#39;t get laid until I had about 400 approaches in, and not because the numbers game is that shitty, but it took that long for my IDENTITY to shift and become somebody who could move things forward. What are you doing to improve your appearance? Are you in the gym? Are you improving your fashion? You&amp;#39;re 20. JOIN A FRAT. Don&amp;#39;t make the excuse that you&amp;#39;re too old. This is a PIVOTAL moment where it&amp;#39;s still okay to rush. JOIN A FRAT.&lt;/p&gt;\n\n&lt;p&gt;This is a numbers game, don&amp;#39;t let anyone tell you anything else. Improve your odds by becoming as attractive as possible with your style and fitness and compliment it with as much confidence as you can, but ultimately you&amp;#39;re going to have to churn the numbers. I don&amp;#39;t do much daygame anymore, but even now I wouldn&amp;#39;t expect having to do less than 15 approaches to meet somebody who would want to sleep with me, outside of luck and choosing girls who invite the approach.&lt;/p&gt;\n\n&lt;p&gt;Just take action and document. Course correct. Your writing reminds me of my own. You can make it there, it&amp;#39;ll just take time. Coming from a dude out of college, that time passes by faster than you think.&lt;/p&gt;\n\n&lt;p&gt;And by the way, I&amp;#39;ve gotten laid more that I&amp;#39;m GRADUATED than when I was in college. With hotter girls (granted they&amp;#39;re college girls, but still). Just depends on what you do with your life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9irmr", "score_hidden": false, "stickied": false, "created": 1492222682.0, "created_utc": 1492193882.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9j85t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sergeant_flem", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I was a virgin until 23, even though I had done kissing by age 20, and I felt the exact same when I was that age. We place so much emphasis on virginity as being a rite of passage from boyhood to manhood but when it finally happened to me it really wasn't the earth shattering experience that I thought it would be. However, I did learn that at the end of the day it's really not that big of a deal.\n\nIt sounds cliche but don't think about the negatives and think about the positives. You had the guts to approach that girl and ask her out on the spot, she was clearly impressed with your attempt. Most guys who are more experienced than you still have trouble doing something like that. You just have to hold your head high and keep trying, the more you put yourself out there the more likely something will eventually happen.\n\nYou've already been on dates, but what's actually happening on those dates? Do you escalate and make further moves? Do you break the touch barrier? Do you go in for a kiss at the end of the night?\n\nAlso keep in mind that there's no real secret magic method to convince a girl to take it further with you, it's all just about meeting the right person at the right time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was a virgin until 23, even though I had done kissing by age 20, and I felt the exact same when I was that age. We place so much emphasis on virginity as being a rite of passage from boyhood to manhood but when it finally happened to me it really wasn&amp;#39;t the earth shattering experience that I thought it would be. However, I did learn that at the end of the day it&amp;#39;s really not that big of a deal.&lt;/p&gt;\n\n&lt;p&gt;It sounds cliche but don&amp;#39;t think about the negatives and think about the positives. You had the guts to approach that girl and ask her out on the spot, she was clearly impressed with your attempt. Most guys who are more experienced than you still have trouble doing something like that. You just have to hold your head high and keep trying, the more you put yourself out there the more likely something will eventually happen.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve already been on dates, but what&amp;#39;s actually happening on those dates? Do you escalate and make further moves? Do you break the touch barrier? Do you go in for a kiss at the end of the night?&lt;/p&gt;\n\n&lt;p&gt;Also keep in mind that there&amp;#39;s no real secret magic method to convince a girl to take it further with you, it&amp;#39;s all just about meeting the right person at the right time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9j85t", "score_hidden": false, "stickied": false, "created": 1492223226.0, "created_utc": 1492194426.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9milc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "12555", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You keep talking about being too busy to work out, go to clubs, or do much of anything.\n\nI call bullshit. I was premed in college taking some extremely difficult course loads and I STILL had time to rock climb, go out most weekends, and go to clubs. All were important in making friends and expanding my social circle.\n\nI would examine your life and see where your time is disappearing. Unless you're double majoring two different engineering majors you shouldn't be this short of time. And if you are, why?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You keep talking about being too busy to work out, go to clubs, or do much of anything.&lt;/p&gt;\n\n&lt;p&gt;I call bullshit. I was premed in college taking some extremely difficult course loads and I STILL had time to rock climb, go out most weekends, and go to clubs. All were important in making friends and expanding my social circle.&lt;/p&gt;\n\n&lt;p&gt;I would examine your life and see where your time is disappearing. Unless you&amp;#39;re double majoring two different engineering majors you shouldn&amp;#39;t be this short of time. And if you are, why?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9milc", "score_hidden": false, "stickied": false, "created": 1492227193.0, "created_utc": 1492198393.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9ul8l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "WarIsPeeps", "parent_id": "t1_dg9nuu0", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "The real secret is that fear never goes away you just learn that fear is meaningless. It never aligns to the actual risk of a situation so its just mental trash to be discarded. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The real secret is that fear never goes away you just learn that fear is meaningless. It never aligns to the actual risk of a situation so its just mental trash to be discarded. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9ul8l", "score_hidden": false, "stickied": false, "created": 1492237237.0, "created_utc": 1492208437.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9nuu0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "crazycritter87", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Honestly. Confidence is it. Quit whining and lurking and just talk. Dont take this to mean being overly forward either. Get a feel for being social and reading vibes. If they're there pay a compliment but try to see women as people and not sexual objects. Dick pics are almost always a bad idea. Joke, talk about life, show interest in theirs. Its not going to be easy but this will get you alot further than where you're at. Don't think for a minute that any one of us never feel awkward or afraid of rejection. The trick is to hide it as best you can and take that risk of asking someone out to coffee, ice cream, ect. Once you do don't go into it with expectations. Just treat it as getting to know one another. If you like her, ask questions and show that you're eager to know more about her. If she's interested the date will last and she may make a move.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly. Confidence is it. Quit whining and lurking and just talk. Dont take this to mean being overly forward either. Get a feel for being social and reading vibes. If they&amp;#39;re there pay a compliment but try to see women as people and not sexual objects. Dick pics are almost always a bad idea. Joke, talk about life, show interest in theirs. Its not going to be easy but this will get you alot further than where you&amp;#39;re at. Don&amp;#39;t think for a minute that any one of us never feel awkward or afraid of rejection. The trick is to hide it as best you can and take that risk of asking someone out to coffee, ice cream, ect. Once you do don&amp;#39;t go into it with expectations. Just treat it as getting to know one another. If you like her, ask questions and show that you&amp;#39;re eager to know more about her. If she&amp;#39;s interested the date will last and she may make a move.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9nuu0", "score_hidden": false, "stickied": false, "created": 1492228800.0, "created_utc": 1492200000.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9wshu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "eyesopen1111", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "If there are any dating coaches around you, or even guys who get laid a lot, then beg or pay them to come watch you pick up chicks. You are doing important things wrong, my friend, and good advice will help a bunch. \n\nI have read Models and you should, too. It sounds like you are still deciding whether to be authentic or a performer or a bit of both. Lose your over-investment ASAP, though. It’s killing your vibe. \n\nSome practical advice: take an on-campus dancing course (I like ballroom dance for the fancy moves). Always more girls than guys at dance class. Socially approved kino. Males (you) lead the dance. Girls love being made the star of the show, which you will be able to make them on any dance floor now. You get to talk to the girls, too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If there are any dating coaches around you, or even guys who get laid a lot, then beg or pay them to come watch you pick up chicks. You are doing important things wrong, my friend, and good advice will help a bunch. &lt;/p&gt;\n\n&lt;p&gt;I have read Models and you should, too. It sounds like you are still deciding whether to be authentic or a performer or a bit of both. Lose your over-investment ASAP, though. It’s killing your vibe. &lt;/p&gt;\n\n&lt;p&gt;Some practical advice: take an on-campus dancing course (I like ballroom dance for the fancy moves). Always more girls than guys at dance class. Socially approved kino. Males (you) lead the dance. Girls love being made the star of the show, which you will be able to make them on any dance floor now. You get to talk to the girls, too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9wshu", "score_hidden": false, "stickied": false, "created": 1492240194.0, "created_utc": 1492211394.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9zwxb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Kibitz117", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Please, not just for girls, but for your life in general read The 50th law. If you don't want to buy it just read the first chapter ( you can prob find it online).it will change your mindset.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please, not just for girls, but for your life in general read The 50th law. If you don&amp;#39;t want to buy it just read the first chapter ( you can prob find it online).it will change your mindset.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9zwxb", "score_hidden": false, "stickied": false, "created": 1492244339.0, "created_utc": 1492215539.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dga0bs7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aceshighsays", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt;The CDC also reports that virgins make up 12.3 percent of females and 14.3 percent of males aged 20 to 24.\n\nHuh, that's interesting. Does that mean girls are sluttier than guys or that the girls have significantly more opportunities to shag?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The CDC also reports that virgins make up 12.3 percent of females and 14.3 percent of males aged 20 to 24.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Huh, that&amp;#39;s interesting. Does that mean girls are sluttier than guys or that the girls have significantly more opportunities to shag?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dga0bs7", "score_hidden": false, "stickied": false, "created": 1492244883.0, "created_utc": 1492216083.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dga39f6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "joniuk", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I don't have a wall of text answer for you but I just wanted to say, hang in there kid. It will happen and the fact it hasn't yet in the grand scheme of things means nothing real\nGood luck", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have a wall of text answer for you but I just wanted to say, hang in there kid. It will happen and the fact it hasn&amp;#39;t yet in the grand scheme of things means nothing real\nGood luck&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dga39f6", "score_hidden": false, "stickied": false, "created": 1492248875.0, "created_utc": 1492220075.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dga7glx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kimyungill", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Do you look like a hatchet face? go get some exercise and start being comfortable with yrself...be comfortable with yr virginity even. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you look like a hatchet face? go get some exercise and start being comfortable with yrself...be comfortable with yr virginity even. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dga7glx", "score_hidden": false, "stickied": false, "created": 1492254905.0, "created_utc": 1492226105.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dga84oc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Stop whining about being a virgin and enjoy life. Doe it kill to be a virgin? Why does society put so much pressure on virgins to loose it? Just go out and talk to more girls. Have fun doing it. Be your most confident seIf .If a girl doesn't like you, it doesn't matter, you just don't click. If she likes you, great! Ask her out. If she flakes, fuck her. If she doesn't flake, great! BE YOUR CONFIDENT SELF!!!  Escalate physically ! Maintain that eye contact! Loose your virginity ! If you fuck up , it just wasn't meant to be. MOVE ON!!! \n\nTALK TO ALL THE GIRLS YOU KNOW OR DON'T KNOW, SOME WILL LIKE YOU!!!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stop whining about being a virgin and enjoy life. Doe it kill to be a virgin? Why does society put so much pressure on virgins to loose it? Just go out and talk to more girls. Have fun doing it. Be your most confident seIf .If a girl doesn&amp;#39;t like you, it doesn&amp;#39;t matter, you just don&amp;#39;t click. If she likes you, great! Ask her out. If she flakes, fuck her. If she doesn&amp;#39;t flake, great! BE YOUR CONFIDENT SELF!!!  Escalate physically ! Maintain that eye contact! Loose your virginity ! If you fuck up , it just wasn&amp;#39;t meant to be. MOVE ON!!! &lt;/p&gt;\n\n&lt;p&gt;TALK TO ALL THE GIRLS YOU KNOW OR DON&amp;#39;T KNOW, SOME WILL LIKE YOU!!!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dga84oc", "score_hidden": false, "stickied": false, "created": 1492255955.0, "created_utc": 1492227155.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dga8hzo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Just talk to every girl who seems interesting. Maybe you'll just loose your virginity to your wife. What's wrong with that? Just enjoy life because one day you'll grow old and or die.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just talk to every girl who seems interesting. Maybe you&amp;#39;ll just loose your virginity to your wife. What&amp;#39;s wrong with that? Just enjoy life because one day you&amp;#39;ll grow old and or die.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dga8hzo", "score_hidden": false, "stickied": false, "created": 1492256553.0, "created_utc": 1492227753.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dgabh8y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DominicanFury", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "dude i'm 29 was addicted to porn and fapping.I realized something was wrong have not dated a girl ever,i was depressed a lot and still a virgin besides a blow job i had once. Right now i'm on 58 days of nofap and i feel amazing i just don't give a fuck about sex and looking at girls sexually i had a huge problem with that. I enjoy music much more specially bachata which is dominican music. I feel a lot more energy for anything i do. Just focus on yourself your young don't pay attention to other couples that's just temptation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;dude i&amp;#39;m 29 was addicted to porn and fapping.I realized something was wrong have not dated a girl ever,i was depressed a lot and still a virgin besides a blow job i had once. Right now i&amp;#39;m on 58 days of nofap and i feel amazing i just don&amp;#39;t give a fuck about sex and looking at girls sexually i had a huge problem with that. I enjoy music much more specially bachata which is dominican music. I feel a lot more energy for anything i do. Just focus on yourself your young don&amp;#39;t pay attention to other couples that&amp;#39;s just temptation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgabh8y", "score_hidden": false, "stickied": false, "created": 1492261689.0, "created_utc": 1492232889.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dgbytr5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ShartsRuinDays", "parent_id": "t1_dgbym3b", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Lol, of course you would ask for a picture of my dick over anything else. Why am I not surprised. No wonder you're getting so worked up, you're fighting deep seeded homosexuality issues. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol, of course you would ask for a picture of my dick over anything else. Why am I not surprised. No wonder you&amp;#39;re getting so worked up, you&amp;#39;re fighting deep seeded homosexuality issues. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgbytr5", "score_hidden": false, "stickied": false, "created": 1492373588.0, "created_utc": 1492344788.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbym3b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "futmut", "parent_id": "t1_dgby9ke", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I want the pic of the dick that fills your wife hole's while you're working on a great job making well over 6 figures...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want the pic of the dick that fills your wife hole&amp;#39;s while you&amp;#39;re working on a great job making well over 6 figures...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgbym3b", "score_hidden": false, "stickied": false, "created": 1492373014.0, "created_utc": 1492344214.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgby9ke", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgbxy1n", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgby9ke", "score_hidden": false, "stickied": false, "created": 1492372075.0, "created_utc": 1492343275.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbxy1n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "futmut", "parent_id": "t1_dgbwqg0", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "English is not my mother language you piece of shit...why you get mad over it instead of discussing the topic? LMAO dumb kids these days..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;English is not my mother language you piece of shit...why you get mad over it instead of discussing the topic? LMAO dumb kids these days..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgbxy1n", "score_hidden": false, "stickied": false, "created": 1492371147.0, "created_utc": 1492342347.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbwqg0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgaitdz", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgbwqg0", "score_hidden": false, "stickied": false, "created": 1492367218.0, "created_utc": 1492338418.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaitdz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "futmut", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Pretty sure you arent approaching enough..your just finding excuses about your few approaches who obviously failed...\nI dont know about you but if you approach and get rejected that makes you stronger....you can easily do more then 20 approaches per day if you live in a big city...thats what i did...\n\nYes it is hard but after the first approaches you get used to it...i also got scarce result only 5 numbers out of 300 approaches in 2 weeks, managed to kiss 2 of them...not that abd after all...\n\nNow i have 3 girls which want a long relationship but i just tell them a lot of bs to have sex with them and thats about it...i work now so dont have time to do daygame anymore only some saturday night but its not the same thing, you lose a lot when you dont practice everyday..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pretty sure you arent approaching enough..your just finding excuses about your few approaches who obviously failed...\nI dont know about you but if you approach and get rejected that makes you stronger....you can easily do more then 20 approaches per day if you live in a big city...thats what i did...&lt;/p&gt;\n\n&lt;p&gt;Yes it is hard but after the first approaches you get used to it...i also got scarce result only 5 numbers out of 300 approaches in 2 weeks, managed to kiss 2 of them...not that abd after all...&lt;/p&gt;\n\n&lt;p&gt;Now i have 3 girls which want a long relationship but i just tell them a lot of bs to have sex with them and thats about it...i work now so dont have time to do daygame anymore only some saturday night but its not the same thing, you lose a lot when you dont practice everyday..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgaitdz", "score_hidden": false, "stickied": false, "created": 1492281148.0, "created_utc": 1492252348.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg92nn6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "project_nl", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Oh boy... I am 18 years old and I am not a virgin but I was just so lucky enough to gain a girlfriend and have sex and all without any effort because the girl was just mad crazy. But still I fucking feel like a virgin because I have never approached a girl!!!\n\nWhile you are a virgin and I am not, I fucking wish I was you though. You have already WAY more experience than me. Keep fucking going. You've already done the hard part multiple times. REMEMBER it can only get better from here on.\n\nI doubt that you even realise your own progress you've made so far!!! In your head you sound just like me and I can relate to you. Getting all nervous and anxious and shit when only thinking about approaching woman. But you have done it multiple times. I would suggest to just start acting more alpha and watch 'Based Zeus' on youtube WHILE you keep going.\n\nYou have a wonderful thing going on right now, approaching is a learning experience. And the more you fail, the more you learn. Think about your goal but dont get too greedy and take it slow.\n\n'Game' feels a lot like fitness IMO. You start of without anything and you build your way from there. The first lessons are the hardest but you learn the most, then later it becomes easier and easier but it will always take some effort. I actually feel like you're almost there yet. Just keep going with what you're doing!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh boy... I am 18 years old and I am not a virgin but I was just so lucky enough to gain a girlfriend and have sex and all without any effort because the girl was just mad crazy. But still I fucking feel like a virgin because I have never approached a girl!!!&lt;/p&gt;\n\n&lt;p&gt;While you are a virgin and I am not, I fucking wish I was you though. You have already WAY more experience than me. Keep fucking going. You&amp;#39;ve already done the hard part multiple times. REMEMBER it can only get better from here on.&lt;/p&gt;\n\n&lt;p&gt;I doubt that you even realise your own progress you&amp;#39;ve made so far!!! In your head you sound just like me and I can relate to you. Getting all nervous and anxious and shit when only thinking about approaching woman. But you have done it multiple times. I would suggest to just start acting more alpha and watch &amp;#39;Based Zeus&amp;#39; on youtube WHILE you keep going.&lt;/p&gt;\n\n&lt;p&gt;You have a wonderful thing going on right now, approaching is a learning experience. And the more you fail, the more you learn. Think about your goal but dont get too greedy and take it slow.&lt;/p&gt;\n\n&lt;p&gt;&amp;#39;Game&amp;#39; feels a lot like fitness IMO. You start of without anything and you build your way from there. The first lessons are the hardest but you learn the most, then later it becomes easier and easier but it will always take some effort. I actually feel like you&amp;#39;re almost there yet. Just keep going with what you&amp;#39;re doing!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg92nn6", "score_hidden": false, "stickied": false, "created": 1492202112.0, "created_utc": 1492173312.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9bc0h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Elite-hacks", "parent_id": "t1_dg9abt5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "He's not doing anything wrong is the thing, hes going through the exact same learning process everyone goes through. But it can be hard being a late bloomer because it can seem like everyone shames beginners. \n\nNot only that but I guarantee none of his \"sausage fest\" friends on his contact list are actual friends he would keep after college. They obviously dont care enough to help him out or the are incapable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s not doing anything wrong is the thing, hes going through the exact same learning process everyone goes through. But it can be hard being a late bloomer because it can seem like everyone shames beginners. &lt;/p&gt;\n\n&lt;p&gt;Not only that but I guarantee none of his &amp;quot;sausage fest&amp;quot; friends on his contact list are actual friends he would keep after college. They obviously dont care enough to help him out or the are incapable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9bc0h", "score_hidden": false, "stickied": false, "created": 1492214197.0, "created_utc": 1492185397.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dgb2aoe", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kalolilo", "parent_id": "t1_dgapy7h", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "In short,\n\n1. Build rapport\n2. Tease her\n3. Make her chase you\n4. Tell her that he's thinking if she should take her number with a smirk\n\nwhile being really friendly. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In short,&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Build rapport&lt;/li&gt;\n&lt;li&gt;Tease her&lt;/li&gt;\n&lt;li&gt;Make her chase you&lt;/li&gt;\n&lt;li&gt;Tell her that he&amp;#39;s thinking if she should take her number with a smirk&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;while being really friendly. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgb2aoe", "score_hidden": false, "stickied": false, "created": 1492313655.0, "created_utc": 1492284855.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgapy7h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mrfunnyman21", "parent_id": "t1_dgaeq5p", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Based on your experience what specifically would you recommend he do when asking someone out?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Based on your experience what specifically would you recommend he do when asking someone out?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgapy7h", "score_hidden": false, "stickied": false, "created": 1492296594.0, "created_utc": 1492267794.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaeq5p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kalolilo", "parent_id": "t1_dg9abt5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "He's tried 3 times and was rejected. That is not trying. He has to try 100 times. This is the only thing he has to do.\n\nAll of us had to go through the same valley of rejection, that's what I'm telling him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s tried 3 times and was rejected. That is not trying. He has to try 100 times. This is the only thing he has to do.&lt;/p&gt;\n\n&lt;p&gt;All of us had to go through the same valley of rejection, that&amp;#39;s what I&amp;#39;m telling him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgaeq5p", "score_hidden": false, "stickied": false, "created": 1492268861.0, "created_utc": 1492240061.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9abt5", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "mrfunnyman21", "parent_id": "t1_dg96786", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "This isn't very good advice though. OP is feeling depressed because he can't get past the early stages of female interaction. If he was making out with 20 girls he wouldn't be on here. He's on here because despite his efforts, he hasn't even gotten one kiss. The problem he's facing is that he's tried and has only faced rejection. Even guys who are bad with women get lucky sometimes. What we really need to know is what he's doing wrong and how to help him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t very good advice though. OP is feeling depressed because he can&amp;#39;t get past the early stages of female interaction. If he was making out with 20 girls he wouldn&amp;#39;t be on here. He&amp;#39;s on here because despite his efforts, he hasn&amp;#39;t even gotten one kiss. The problem he&amp;#39;s facing is that he&amp;#39;s tried and has only faced rejection. Even guys who are bad with women get lucky sometimes. What we really need to know is what he&amp;#39;s doing wrong and how to help him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9abt5", "score_hidden": false, "stickied": false, "created": 1492213036.0, "created_utc": 1492184236.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9n8o4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jaereth", "parent_id": "t1_dg9d45b", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Eh... perhaps.\n\nRegardless though, you learn to talk to girls. If you start cold approaching 5 girls a day, it's not going to take long before you really DO get the mentality that bitches aren't shit, and you know it's true. \n\nThis guy says \"Before I called her I told myself I have abundance and it's true\" but it's not true and he knows it's true. He knew that girl was his ONLY fucking prospect. Having one prospect is failure. Having 10 prospects increases your odds greatly of getting laid. Getting laid once shows you how easy it is to get laid 10 times.\n\nApproaching isn't a magic crystal that will get you there, but it sure as hell helps. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh... perhaps.&lt;/p&gt;\n\n&lt;p&gt;Regardless though, you learn to talk to girls. If you start cold approaching 5 girls a day, it&amp;#39;s not going to take long before you really DO get the mentality that bitches aren&amp;#39;t shit, and you know it&amp;#39;s true. &lt;/p&gt;\n\n&lt;p&gt;This guy says &amp;quot;Before I called her I told myself I have abundance and it&amp;#39;s true&amp;quot; but it&amp;#39;s not true and he knows it&amp;#39;s true. He knew that girl was his ONLY fucking prospect. Having one prospect is failure. Having 10 prospects increases your odds greatly of getting laid. Getting laid once shows you how easy it is to get laid 10 times.&lt;/p&gt;\n\n&lt;p&gt;Approaching isn&amp;#39;t a magic crystal that will get you there, but it sure as hell helps. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9n8o4", "score_hidden": false, "stickied": false, "created": 1492228063.0, "created_utc": 1492199263.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dgaggf4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kalolilo", "parent_id": "t1_dg9y8hp", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Which is also approaching. Approaching isn't only cold approaching.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Which is also approaching. Approaching isn&amp;#39;t only cold approaching.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgaggf4", "score_hidden": false, "stickied": false, "created": 1492273627.0, "created_utc": 1492244827.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9y8hp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Snazzy_Serval", "parent_id": "t1_dg9wq9c", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Meeting women while doing your hobbies.\n\nMeeting women in your classes\n\nMeeting women at work\n\nMeeting women through your social circle\n\nMeeting women online", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Meeting women while doing your hobbies.&lt;/p&gt;\n\n&lt;p&gt;Meeting women in your classes&lt;/p&gt;\n\n&lt;p&gt;Meeting women at work&lt;/p&gt;\n\n&lt;p&gt;Meeting women through your social circle&lt;/p&gt;\n\n&lt;p&gt;Meeting women online&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9y8hp", "score_hidden": false, "stickied": false, "created": 1492242096.0, "created_utc": 1492213296.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9wq9c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "uberafc", "parent_id": "t1_dg9d45b", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "What are the alternatives to progress with women? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What are the alternatives to progress with women? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9wq9c", "score_hidden": false, "stickied": false, "created": 1492240112.0, "created_utc": 1492211312.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9d45b", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Snazzy_Serval", "parent_id": "t1_dg96786", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I hate how the mentality of everybody here is approach approach approach. \n\nCold approaching random girls is not the only way to progress with women.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hate how the mentality of everybody here is approach approach approach. &lt;/p&gt;\n\n&lt;p&gt;Cold approaching random girls is not the only way to progress with women.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9d45b", "score_hidden": false, "stickied": false, "created": 1492216170.0, "created_utc": 1492187370.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg96786", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kalolilo", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 1, "body": "Blablabla. This is what you're doing wrong\n\n&gt; My two years in college, no girl has ever made the first move with me, no girl initiated, no girl complimented on my looks, and no girl ever showed interest in me\n\nA woman never initiates, it is very rare. It's your job as a man. \n\nYou said you have read this sub for 4 years, but you seem to not do what every guy here says. Approach, approach approach.\n\nOnce you have approached 300 girls, gone on 60 dates, made out with 20, and slept with a few, but still haven't found the right girl, then you can complain. However, before you have done that you have no right to complain or to do any self-loathing.\n\nIt's a numbers game, so play the numbers and stop complaining.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Blablabla. This is what you&amp;#39;re doing wrong&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;My two years in college, no girl has ever made the first move with me, no girl initiated, no girl complimented on my looks, and no girl ever showed interest in me&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A woman never initiates, it is very rare. It&amp;#39;s your job as a man. &lt;/p&gt;\n\n&lt;p&gt;You said you have read this sub for 4 years, but you seem to not do what every guy here says. Approach, approach approach.&lt;/p&gt;\n\n&lt;p&gt;Once you have approached 300 girls, gone on 60 dates, made out with 20, and slept with a few, but still haven&amp;#39;t found the right girl, then you can complain. However, before you have done that you have no right to complain or to do any self-loathing.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a numbers game, so play the numbers and stop complaining.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg96786", "score_hidden": false, "stickied": false, "created": 1492207818.0, "created_utc": 1492179018.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg91h9j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "giggity23", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Everything you want can be accomplished by just doing this one thing: TAKE ACTION. Change your hair, go get a tan, work out, stop giving a fuck around people about their opninions about you. Approach girls like you wouldnt give a fuck about them walking away. Believe me, even if you are ugly you can accomplish to get a girl. Just stop caring about it too much and give your own life and goals priorities. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everything you want can be accomplished by just doing this one thing: TAKE ACTION. Change your hair, go get a tan, work out, stop giving a fuck around people about their opninions about you. Approach girls like you wouldnt give a fuck about them walking away. Believe me, even if you are ugly you can accomplish to get a girl. Just stop caring about it too much and give your own life and goals priorities. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg91h9j", "score_hidden": false, "stickied": false, "created": 1492199597.0, "created_utc": 1492170797.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg96g37", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AceTrillsWont", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Not going to lie, your post is very long. I read the title, and the first paragraph or so and then realized. Honestly, don't sweat over it. Who cares what other people are doing? You're not doing anything wrong. Just be yourself. Be genuine. If you start trying to be someone your not, you may find it easier to find someone to be with, but then is it really you who is with them? Or the fraudulent alter ego you created to attract them. I understand it can get lonely, while I do consider myself a decently good looking guy, and don't have much issue attracting someone, I'm socially awkward/quiet/think differently and am kind of weird - but I love who I am. Usually once people realize how I am, they tend to lose interest, but in my mind, that's their loss. Just be yourself, with time you'll find the right person who can appreciate you for who you are and you'll be so happy and grateful for that. Now, it never hurts to step outside of your box a little and try new things - whether it's hobbies, or just how you approach talking to people you don't know - that's a good way to try to broaden your horizons and learn through trial and error. Maybe you'll discover a hobby you enjoy that you never thought you would have before. Or maybe the person you tried talking to is a total dick, and makes you feel bad for trying to be nice - guess what? You don't know them and the chances of seeing them again are slim, so just forget about them. To fail, is the First Attempt In Learning. There's nothing wrong with you, you're perfect at being yourself. You're beautiful the way you are. Just listen to yourself, your heart, what you think is right - but keep your mind open to other ideas and thoughts.\n\nIn terms of talking to people - Dale Carnegie's book, \"How to Win Friends and Influence People\" has helped me deal with my social awkwardness a little bit. You can find general summaries and key points from the book online if you don't feel like reading the entire thing. But to sum it up very briefly, people's names are the most beautiful thing for an individual to hear. And showing interest in them, and why they do things, or what they think, makes them more interested in you.\n\nKeep your head up, it gets better. I had a girlfriend for years, and hindsight 20/20, that's time I wish I had focused on myself instead of putting her needs and desires before my own - end result, she's doing great, which I'm happy for her but now I'm a 23 year old college freshman haha focus on bettering yourself, how you want to be, and the right people will come into your life.\n\nAlways here to talk, give some feedback, or thoughts if you need it. I know I'm just another \"dude,\" but outside thoughts or perspectives can never hurt. \n\nStay cool, brotha ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not going to lie, your post is very long. I read the title, and the first paragraph or so and then realized. Honestly, don&amp;#39;t sweat over it. Who cares what other people are doing? You&amp;#39;re not doing anything wrong. Just be yourself. Be genuine. If you start trying to be someone your not, you may find it easier to find someone to be with, but then is it really you who is with them? Or the fraudulent alter ego you created to attract them. I understand it can get lonely, while I do consider myself a decently good looking guy, and don&amp;#39;t have much issue attracting someone, I&amp;#39;m socially awkward/quiet/think differently and am kind of weird - but I love who I am. Usually once people realize how I am, they tend to lose interest, but in my mind, that&amp;#39;s their loss. Just be yourself, with time you&amp;#39;ll find the right person who can appreciate you for who you are and you&amp;#39;ll be so happy and grateful for that. Now, it never hurts to step outside of your box a little and try new things - whether it&amp;#39;s hobbies, or just how you approach talking to people you don&amp;#39;t know - that&amp;#39;s a good way to try to broaden your horizons and learn through trial and error. Maybe you&amp;#39;ll discover a hobby you enjoy that you never thought you would have before. Or maybe the person you tried talking to is a total dick, and makes you feel bad for trying to be nice - guess what? You don&amp;#39;t know them and the chances of seeing them again are slim, so just forget about them. To fail, is the First Attempt In Learning. There&amp;#39;s nothing wrong with you, you&amp;#39;re perfect at being yourself. You&amp;#39;re beautiful the way you are. Just listen to yourself, your heart, what you think is right - but keep your mind open to other ideas and thoughts.&lt;/p&gt;\n\n&lt;p&gt;In terms of talking to people - Dale Carnegie&amp;#39;s book, &amp;quot;How to Win Friends and Influence People&amp;quot; has helped me deal with my social awkwardness a little bit. You can find general summaries and key points from the book online if you don&amp;#39;t feel like reading the entire thing. But to sum it up very briefly, people&amp;#39;s names are the most beautiful thing for an individual to hear. And showing interest in them, and why they do things, or what they think, makes them more interested in you.&lt;/p&gt;\n\n&lt;p&gt;Keep your head up, it gets better. I had a girlfriend for years, and hindsight 20/20, that&amp;#39;s time I wish I had focused on myself instead of putting her needs and desires before my own - end result, she&amp;#39;s doing great, which I&amp;#39;m happy for her but now I&amp;#39;m a 23 year old college freshman haha focus on bettering yourself, how you want to be, and the right people will come into your life.&lt;/p&gt;\n\n&lt;p&gt;Always here to talk, give some feedback, or thoughts if you need it. I know I&amp;#39;m just another &amp;quot;dude,&amp;quot; but outside thoughts or perspectives can never hurt. &lt;/p&gt;\n\n&lt;p&gt;Stay cool, brotha &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg96g37", "score_hidden": false, "stickied": false, "created": 1492208161.0, "created_utc": 1492179361.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg99wtq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DrSpartyingXB1", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Focus on improving yourself. Money and looks. They'll magically stop saying they have a boyfriend when you do this", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Focus on improving yourself. Money and looks. They&amp;#39;ll magically stop saying they have a boyfriend when you do this&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg99wtq", "score_hidden": false, "stickied": false, "created": 1492212540.0, "created_utc": 1492183740.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9h100", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Th3DoCtA", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Stop reading. Join a frat. Learn from your brothers. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stop reading. Join a frat. Learn from your brothers. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9h100", "score_hidden": false, "stickied": false, "created": 1492220641.0, "created_utc": 1492191841.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9toe9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "WarIsPeeps", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "There is no such thing as \"friends who are girls\". There are girls who are into you, girls youre into, and acquaintances. But in my experience a friend is someone  you can depend on when your life goes to shit and relying on a chick to do that who either isnt your sister or you arent already ploughing is a recipe for becoming a misogynist. Cuz modern society makes chicks think that its always ok to follow their instincts and their instinctswill cause them to lose empathy/attraction for you the moment shit starts to go south. In my experience the most selfish members of society are actually women. Im not sure its technically a bad thing tho cuz its their highly solipsistic nature that keeps the human gene pool relatively well cared for. \n\nAlso, if you have a girl that is just your \"friend\" theres basically a 100% chance she wants to fuck you unless shes using you as an emotional sponge. But tbh Im not actually convinced that most girls have the kind of deep friendships even with other girls that men like to cultivate. But thats cuz men need to have deep trust to do war and build shit. But theyre also super weird cuz often chicks wont even realize theyre into you to fuck you until theyre actually fucking you, and the \"like\" they have for you can totally evaporate if you act wrong and theyll act like they were never down to fuck you. But thats all backwards rationalization and lack of insight into their own behavior and motivations rather than born out by actual facts and the behavior Ive seen. \n\nBut since I meet rule #1 most the girls Ive tried to be friends w are really hot so it might be that its just the hot chicks who are assholes. But Im absolutely serious when I say that, in my opinion, objectification is mostly womens fault. They offer nothing to a man but ass and are otherwise like the equivalent of super unreliable and selfish guy friends you wouldnt want around, so why bother to care about anything but ass? If shes not your girlfriend caring more than that is a recipe for getting figuratively stabbed in the chest. All of that said tho you MUST come off as if you arent a pig who only wants sex, cuz that will get you laid but will off put more girls than not. Learn to lie to them and never trust them, thats my advice. Turn your heart to stone and only need your own love or that of your brothers and youll become much more attractive to flighty hos. \n\nDont take my word for it tho, I may be too jaded. \n\nBut I aint the first to say it, italian poets said it centuries ago, la donna e mobile, cual piume al vento, muta de accento, e di pensiero. Sempre un amabile, leggiadro viso. En pianto en riso..e mensongiero. ", "edited": 1492208141.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is no such thing as &amp;quot;friends who are girls&amp;quot;. There are girls who are into you, girls youre into, and acquaintances. But in my experience a friend is someone  you can depend on when your life goes to shit and relying on a chick to do that who either isnt your sister or you arent already ploughing is a recipe for becoming a misogynist. Cuz modern society makes chicks think that its always ok to follow their instincts and their instinctswill cause them to lose empathy/attraction for you the moment shit starts to go south. In my experience the most selfish members of society are actually women. Im not sure its technically a bad thing tho cuz its their highly solipsistic nature that keeps the human gene pool relatively well cared for. &lt;/p&gt;\n\n&lt;p&gt;Also, if you have a girl that is just your &amp;quot;friend&amp;quot; theres basically a 100% chance she wants to fuck you unless shes using you as an emotional sponge. But tbh Im not actually convinced that most girls have the kind of deep friendships even with other girls that men like to cultivate. But thats cuz men need to have deep trust to do war and build shit. But theyre also super weird cuz often chicks wont even realize theyre into you to fuck you until theyre actually fucking you, and the &amp;quot;like&amp;quot; they have for you can totally evaporate if you act wrong and theyll act like they were never down to fuck you. But thats all backwards rationalization and lack of insight into their own behavior and motivations rather than born out by actual facts and the behavior Ive seen. &lt;/p&gt;\n\n&lt;p&gt;But since I meet rule #1 most the girls Ive tried to be friends w are really hot so it might be that its just the hot chicks who are assholes. But Im absolutely serious when I say that, in my opinion, objectification is mostly womens fault. They offer nothing to a man but ass and are otherwise like the equivalent of super unreliable and selfish guy friends you wouldnt want around, so why bother to care about anything but ass? If shes not your girlfriend caring more than that is a recipe for getting figuratively stabbed in the chest. All of that said tho you MUST come off as if you arent a pig who only wants sex, cuz that will get you laid but will off put more girls than not. Learn to lie to them and never trust them, thats my advice. Turn your heart to stone and only need your own love or that of your brothers and youll become much more attractive to flighty hos. &lt;/p&gt;\n\n&lt;p&gt;Dont take my word for it tho, I may be too jaded. &lt;/p&gt;\n\n&lt;p&gt;But I aint the first to say it, italian poets said it centuries ago, la donna e mobile, cual piume al vento, muta de accento, e di pensiero. Sempre un amabile, leggiadro viso. En pianto en riso..e mensongiero. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9toe9", "score_hidden": false, "stickied": false, "created": 1492236030.0, "created_utc": 1492207230.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9q2vm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ill_silent_lasagna", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Just read The Game by Neil Strauss. Don't think too much...it's in your biology, everything you need to get laid (reproduce).\n\nTry taking a break from porn. Probably will help a lot. Don't masturbate too much\n\nThe first time I got laid wasn't till I kind of \"surrendered\", gave up in a sense. Stopped trying/obsessing over getting laid. How's that for philosophical. Also ties into the biology aspect. Does that make sense?", "edited": 1492204773.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just read The Game by Neil Strauss. Don&amp;#39;t think too much...it&amp;#39;s in your biology, everything you need to get laid (reproduce).&lt;/p&gt;\n\n&lt;p&gt;Try taking a break from porn. Probably will help a lot. Don&amp;#39;t masturbate too much&lt;/p&gt;\n\n&lt;p&gt;The first time I got laid wasn&amp;#39;t till I kind of &amp;quot;surrendered&amp;quot;, gave up in a sense. Stopped trying/obsessing over getting laid. How&amp;#39;s that for philosophical. Also ties into the biology aspect. Does that make sense?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9q2vm", "score_hidden": false, "stickied": false, "created": 1492231482.0, "created_utc": 1492202682.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dgbtizf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thefinaldestillation", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "xD\r\n\r\n\r\nGood decision.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;xD&lt;/p&gt;\n\n&lt;p&gt;Good decision.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgbtizf", "score_hidden": false, "stickied": false, "created": 1492356694.0, "created_utc": 1492327894.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dgcizqd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jeffthehat", "parent_id": "t1_dgbbo3u", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Nah. The point is that you stop giving a fuck about whether you're getting women or not, because your life is fun and interesting as is. In turn, you'll become more attractive. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah. The point is that you stop giving a fuck about whether you&amp;#39;re getting women or not, because your life is fun and interesting as is. In turn, you&amp;#39;ll become more attractive. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgcizqd", "score_hidden": false, "stickied": false, "created": 1492403288.0, "created_utc": 1492374488.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbbo3u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PlayLikeNeverB4", "parent_id": "t1_dg9awtb", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt; Have fun and work on your goals. The rest will follow.\n\nSo while working on your hobbies the girls will just magically appear?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Have fun and work on your goals. The rest will follow.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So while working on your hobbies the girls will just magically appear?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgbbo3u", "score_hidden": false, "stickied": false, "created": 1492326747.0, "created_utc": 1492297947.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9awtb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jeffthehat", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt; What can I do from here on out? What are my next steps? I am lost, I feel like there is no hope.\n\nJust gonna be honest. It's gonna be hard to get laid at college if you don't have a tight social circle. That's just how it works. \n\nFor now, ask yourself these questions: \n\nDo you like what you're studying? What are your hobbies outside of class? Do you dress well? How often do you go the gym? \n\nWhen you're not studying, you need to fill up your days with hobbies that you enjoy.  Forget about \"game.\" Have fun and work on your goals. The rest will follow. \n\nAlso, these positive affirmations that you're linking are bullshit mate. You're not \"the prize.\" You're just a dude. Sometimes you rock and sometimes you suck. Quit giving a fuck about it and work on you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What can I do from here on out? What are my next steps? I am lost, I feel like there is no hope.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Just gonna be honest. It&amp;#39;s gonna be hard to get laid at college if you don&amp;#39;t have a tight social circle. That&amp;#39;s just how it works. &lt;/p&gt;\n\n&lt;p&gt;For now, ask yourself these questions: &lt;/p&gt;\n\n&lt;p&gt;Do you like what you&amp;#39;re studying? What are your hobbies outside of class? Do you dress well? How often do you go the gym? &lt;/p&gt;\n\n&lt;p&gt;When you&amp;#39;re not studying, you need to fill up your days with hobbies that you enjoy.  Forget about &amp;quot;game.&amp;quot; Have fun and work on your goals. The rest will follow. &lt;/p&gt;\n\n&lt;p&gt;Also, these positive affirmations that you&amp;#39;re linking are bullshit mate. You&amp;#39;re not &amp;quot;the prize.&amp;quot; You&amp;#39;re just a dude. Sometimes you rock and sometimes you suck. Quit giving a fuck about it and work on you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9awtb", "score_hidden": false, "stickied": false, "created": 1492213712.0, "created_utc": 1492184912.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9uqxc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "WarIsPeeps", "parent_id": "t1_dg9k9ro", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Hold. Up. Who cares if its selfish? I have yet to meet a single girl who wasnt almost entirely selfish. Im not even sure there are non selfish humans.......anywhere. Doesnt mean selfishness is a virtue but its certainly not a bad thing. Its just the way people are. \n\nIts bad thinking cuz it will lead him into a negative spiral, not cuz its selfish. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hold. Up. Who cares if its selfish? I have yet to meet a single girl who wasnt almost entirely selfish. Im not even sure there are non selfish humans.......anywhere. Doesnt mean selfishness is a virtue but its certainly not a bad thing. Its just the way people are. &lt;/p&gt;\n\n&lt;p&gt;Its bad thinking cuz it will lead him into a negative spiral, not cuz its selfish. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9uqxc", "score_hidden": false, "stickied": false, "created": 1492237445.0, "created_utc": 1492208645.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9k9ro", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "PhillyLyft", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Stop looking for validation and reciprocation from women. \n\n&gt;I feel like at times that I don't have someone to cuddle with, to know what it feels like to experience intimacy and companionship when life gets too stressful.\n\nThis is extremely selfish, and to be frank, no women will ever provide this for you. You need to be able to look at yourself in the mirror, and know your own faults, and actively work on them without doing it strictly so you can get a girl. \n\nThe most seductive you can be is when you are self confident, which you clearly are not. Make your own path to success, and women will follow you there. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stop looking for validation and reciprocation from women. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I feel like at times that I don&amp;#39;t have someone to cuddle with, to know what it feels like to experience intimacy and companionship when life gets too stressful.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is extremely selfish, and to be frank, no women will ever provide this for you. You need to be able to look at yourself in the mirror, and know your own faults, and actively work on them without doing it strictly so you can get a girl. &lt;/p&gt;\n\n&lt;p&gt;The most seductive you can be is when you are self confident, which you clearly are not. Make your own path to success, and women will follow you there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9k9ro", "score_hidden": false, "stickied": false, "created": 1492224482.0, "created_utc": 1492195682.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dg9uiw3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "WarIsPeeps", "parent_id": "t1_dg9rg0m", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "No dont join redpill theyre like the equivalent of christians: 70% good ideas, 30% completely wrong bullshit thatll make it even harder to be a normie. Just go pirate all of rsdnations products. Watch all that shit once thru and then go out and approach a thousand girls and you will be george mothafuckin clooney ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No dont join redpill theyre like the equivalent of christians: 70% good ideas, 30% completely wrong bullshit thatll make it even harder to be a normie. Just go pirate all of rsdnations products. Watch all that shit once thru and then go out and approach a thousand girls and you will be george mothafuckin clooney &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9uiw3", "score_hidden": false, "stickied": false, "created": 1492237152.0, "created_utc": 1492208352.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9rg0m", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "3rdLion", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "/r/theredpill", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/theredpill\"&gt;/r/theredpill&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9rg0m", "score_hidden": false, "stickied": false, "created": 1492233172.0, "created_utc": 1492204372.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65bkc5", "likes": null, "replies": "", "user_reports": [], "id": "dga44f1", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "bighi", "parent_id": "t3_65bkc5", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt; But for guys, it seems like it's years of study trying to increase the probability to be attractive through social status, resources, behaviour, body language, fitness, clothes and style.\n\nMaybe here is your problem? Or part of it.\n\nThere's no official statistics, but I'd guess that less than 10% of guys actually study seduction. It's not needed at all.\n\nAnd maybe, maybe... you've been reading about it for so long that you're trying too hard?\n\n&gt; Is this normal for my age? To be a kissless virgin around this age?\n\nIt's not the majority, but not rare either. You're 20, your life has barely started.\n\nI'm not pretty, I'm not extroverted, I'm not a party guy. And I can get girls. So maybe, just be fun. Forget seduction tips, forget all the books you read, forget PUA. Just be someone fun to be around.\n\nInstead of approaching random girls, try Tinder (or any similar app). Using Tinder, you only start talking to the girl after you know she's interested in you. You might use online dating to meet a lot of girls and be more comfortable before cold approaching random girls around you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But for guys, it seems like it&amp;#39;s years of study trying to increase the probability to be attractive through social status, resources, behaviour, body language, fitness, clothes and style.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Maybe here is your problem? Or part of it.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s no official statistics, but I&amp;#39;d guess that less than 10% of guys actually study seduction. It&amp;#39;s not needed at all.&lt;/p&gt;\n\n&lt;p&gt;And maybe, maybe... you&amp;#39;ve been reading about it for so long that you&amp;#39;re trying too hard?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Is this normal for my age? To be a kissless virgin around this age?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s not the majority, but not rare either. You&amp;#39;re 20, your life has barely started.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not pretty, I&amp;#39;m not extroverted, I&amp;#39;m not a party guy. And I can get girls. So maybe, just be fun. Forget seduction tips, forget all the books you read, forget PUA. Just be someone fun to be around.&lt;/p&gt;\n\n&lt;p&gt;Instead of approaching random girls, try Tinder (or any similar app). Using Tinder, you only start talking to the girl after you know she&amp;#39;s interested in you. You might use online dating to meet a lot of girls and be more comfortable before cold approaching random girls around you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dga44f1", "score_hidden": false, "stickied": false, "created": 1492250049.0, "created_utc": 1492221249.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]