[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "seduction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Most women reject me and it&amp;#39;s lowering my confidence every time. I&amp;#39;m a decent looking guy and I don&amp;#39;t act awkward. I just get a little nervous at times. Many people say I&amp;#39;m attractive so I doubt it&amp;#39;s looks. I stopped for a couple of months and I just started approaching again. I got rejected 5 times in a row. I&amp;#39;m black and I&amp;#39;ve been approaching white women. They&amp;#39;re just my type. Also the women I approach are really attractive 8-10/10. I&amp;#39;m guessing another problem is that I take long gaps in approaching women? Like after this I&amp;#39;d take a couple of months off approaching to recover from the rejections. I don&amp;#39;t know if I need to keep practicing. Approach less attractive women?&lt;/p&gt;\n\n&lt;p&gt;I keep it simple. I introduce myself and ask for their name. I&amp;#39;d give them a compliment about something they&amp;#39;re wearing or say, &amp;quot;I just thought you look really cute.&amp;quot; I mostly approach at my college so I&amp;#39;d ask them what&amp;#39;s their major and keep the subject about school. Questions like, &amp;quot;How are you liking it so far?&amp;quot; &amp;quot;What was your favorite class?&amp;quot; And I always seem interested in what they&amp;#39;re saying. When the conversation starts to die I ask them if I can get their number to hang out sometimes. A user once told me that sounds boring. I&amp;#39;d appreciate any help. What should I be talking about with women I want to date or sleep with?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Most women reject me and it's lowering my confidence every time. I'm a decent looking guy and I don't act awkward. I just get a little nervous at times. Many people say I'm attractive so I doubt it's looks. I stopped for a couple of months and I just started approaching again. I got rejected 5 times in a row. I'm black and I've been approaching white women. They're just my type. Also the women I approach are really attractive 8-10/10. I'm guessing another problem is that I take long gaps in approaching women? Like after this I'd take a couple of months off approaching to recover from the rejections. I don't know if I need to keep practicing. Approach less attractive women?\n\nI keep it simple. I introduce myself and ask for their name. I'd give them a compliment about something they're wearing or say, \"I just thought you look really cute.\" I mostly approach at my college so I'd ask them what's their major and keep the subject about school. Questions like, \"How are you liking it so far?\" \"What was your favorite class?\" And I always seem interested in what they're saying. When the conversation starts to die I ask them if I can get their number to hang out sometimes. A user once told me that sounds boring. I'd appreciate any help. What should I be talking about with women I want to date or sleep with?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65cnib", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "Johnronaldpot", "saved": false, "mod_reports": [], "name": "t3_65cnib", "subreddit_name_prefixed": "r/seduction", "approved_by": null, "over_18": false, "domain": "self.seduction", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhrv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/seduction/comments/65cnib/how_do_not_sound_boring_when_you_approach_a_woman/", "num_reports": null, "locked": false, "stickied": false, "created": 1492207068.0, "url": "https://www.reddit.com/r/seduction/comments/65cnib/how_do_not_sound_boring_when_you_approach_a_woman/", "author_flair_text": null, "quarantine": false, "title": "How do not sound boring when you approach a woman? What do you talk about?", "created_utc": 1492178268.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65cnib", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65cnib", "likes": null, "replies": "", "user_reports": [], "id": "dg9ekbx", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "iammrwill", "parent_id": "t1_dg974wl", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Also, there are so many times where I see a girl from a bit further away. Can't really tell how cute she is but initially looks like a 7. As I'm walking towards her, I see that she's more like a 5-6. I then think to myself, \"Oh well, I walked this way already. Might as well still say hi.\" Just now with even less pressure on myself because I REALLY don't care about the outcome.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, there are so many times where I see a girl from a bit further away. Can&amp;#39;t really tell how cute she is but initially looks like a 7. As I&amp;#39;m walking towards her, I see that she&amp;#39;s more like a 5-6. I then think to myself, &amp;quot;Oh well, I walked this way already. Might as well still say hi.&amp;quot; Just now with even less pressure on myself because I REALLY don&amp;#39;t care about the outcome.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9ekbx", "score_hidden": false, "stickied": false, "created": 1492217803.0, "created_utc": 1492189003.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65cnib", "likes": null, "replies": "", "user_reports": [], "id": "dgb25n8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Austonmatthews345", "parent_id": "t1_dg974wl", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Do not waste your time approaching women YOU are not attracted to. Nobody benefits and you aren't going to learn much. If you she's someone you wouldn't see yourself having sex with, then why waste time on her. The only situation I'd be talking to an uglier girl is if I open a group of friends and the attractive girl has that ugly fat best friend that you have to be nice to in order to help build rapport with the girl you really want. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do not waste your time approaching women YOU are not attracted to. Nobody benefits and you aren&amp;#39;t going to learn much. If you she&amp;#39;s someone you wouldn&amp;#39;t see yourself having sex with, then why waste time on her. The only situation I&amp;#39;d be talking to an uglier girl is if I open a group of friends and the attractive girl has that ugly fat best friend that you have to be nice to in order to help build rapport with the girl you really want. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgb25n8", "score_hidden": false, "stickied": false, "created": 1492313468.0, "created_utc": 1492284668.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg974wl", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "saxoriko", "parent_id": "t3_65cnib", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt; the women I approach are really attractive    \n\nYou don't have to sleep with every women that you approach. Try out approaching **more** (and maybe less attractive) girls, just do it for the reference experiences and to get \"into state\". At the end of the night, escalate on the attractive ones.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;the women I approach are really attractive    &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You don&amp;#39;t have to sleep with every women that you approach. Try out approaching &lt;strong&gt;more&lt;/strong&gt; (and maybe less attractive) girls, just do it for the reference experiences and to get &amp;quot;into state&amp;quot;. At the end of the night, escalate on the attractive ones.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg974wl", "score_hidden": false, "stickied": false, "created": 1492209078.0, "created_utc": 1492180278.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65cnib", "likes": null, "replies": "", "user_reports": [], "id": "dg9l10m", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "the_christian_grey", "parent_id": "t3_65cnib", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Your conversation is boring as fuck. For talking to a guy it would be fine, but for flirting it's terrible. Every attractive girl you're talking to has heard exactly the same thing a thousand times from other guys. From her perspective, you have absolutely nothing to offer that she couldn't have already gotten from the million other guys who are trying to get into her pants. \n\nThat said, having the balls to approach is half the battle, so kudos for that. But you need to make the conversation fun and interesting. Starting out with a light compliment is fine. But then you have to making conversation in a way that's fun for girls. Tease them, make up silly fanciful stories about them, tell them they look like they're up to no good, etc. Then the best indicator that you've gotten her interest is when she starts asking you questions. At that point, share a bit about yourself and then get the number.\n\nA great resource for learning this in more detail is a podcast called Conversation Ninja by Tom Torero.\n\nAlso the fact that you're a black guy going for white girls does mean you're fighting an uphill battle, that doesn't mean you can't be successful. And really it doesn't make much sense to focus on things you can't change when there is a lot that you can change.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your conversation is boring as fuck. For talking to a guy it would be fine, but for flirting it&amp;#39;s terrible. Every attractive girl you&amp;#39;re talking to has heard exactly the same thing a thousand times from other guys. From her perspective, you have absolutely nothing to offer that she couldn&amp;#39;t have already gotten from the million other guys who are trying to get into her pants. &lt;/p&gt;\n\n&lt;p&gt;That said, having the balls to approach is half the battle, so kudos for that. But you need to make the conversation fun and interesting. Starting out with a light compliment is fine. But then you have to making conversation in a way that&amp;#39;s fun for girls. Tease them, make up silly fanciful stories about them, tell them they look like they&amp;#39;re up to no good, etc. Then the best indicator that you&amp;#39;ve gotten her interest is when she starts asking you questions. At that point, share a bit about yourself and then get the number.&lt;/p&gt;\n\n&lt;p&gt;A great resource for learning this in more detail is a podcast called Conversation Ninja by Tom Torero.&lt;/p&gt;\n\n&lt;p&gt;Also the fact that you&amp;#39;re a black guy going for white girls does mean you&amp;#39;re fighting an uphill battle, that doesn&amp;#39;t mean you can&amp;#39;t be successful. And really it doesn&amp;#39;t make much sense to focus on things you can&amp;#39;t change when there is a lot that you can change.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9l10m", "score_hidden": false, "stickied": false, "created": 1492225394.0, "created_utc": 1492196594.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65cnib", "likes": null, "replies": "", "user_reports": [], "id": "dg9l5rn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "almondbutter1", "parent_id": "t3_65cnib", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You're in straight interview mode. \n\nInstead of asking questions make assumptions. \"I bet you're a bio major\" or \"you look you're majoring in forensics or something\"\n\nThen they either say yes or no and ask why you thought that or how you knew and it's really easy to bullshit reasons like \"you seemed like a nice girl but with like a dark side to you\" for forensics then that gets them into \"what do you mean dark side\" etc. \n\nIf anything you want to get them off talking about college cause that's what everyone talks about. There is *nothing* wrong with starting a conversation that way but you want to transition typically. Easy way is by delving into life goals. As always, you want to steer away from facts toward feelings. So premed? \"Oh yeah I have a few friends who want to be doctors. They really feel for people and want to do the whole Doctors Without Borders volunteer stuff. Are you the same way?\" \n\nEtc. I'm not the best at this but my advice is also pretty standard and is a good place to start. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re in straight interview mode. &lt;/p&gt;\n\n&lt;p&gt;Instead of asking questions make assumptions. &amp;quot;I bet you&amp;#39;re a bio major&amp;quot; or &amp;quot;you look you&amp;#39;re majoring in forensics or something&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Then they either say yes or no and ask why you thought that or how you knew and it&amp;#39;s really easy to bullshit reasons like &amp;quot;you seemed like a nice girl but with like a dark side to you&amp;quot; for forensics then that gets them into &amp;quot;what do you mean dark side&amp;quot; etc. &lt;/p&gt;\n\n&lt;p&gt;If anything you want to get them off talking about college cause that&amp;#39;s what everyone talks about. There is &lt;em&gt;nothing&lt;/em&gt; wrong with starting a conversation that way but you want to transition typically. Easy way is by delving into life goals. As always, you want to steer away from facts toward feelings. So premed? &amp;quot;Oh yeah I have a few friends who want to be doctors. They really feel for people and want to do the whole Doctors Without Borders volunteer stuff. Are you the same way?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Etc. I&amp;#39;m not the best at this but my advice is also pretty standard and is a good place to start. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9l5rn", "score_hidden": false, "stickied": false, "created": 1492225555.0, "created_utc": 1492196755.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65cnib", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65cnib", "likes": null, "replies": "", "user_reports": [], "id": "dg9cguf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Johnronaldpot", "parent_id": "t1_dg98dv1", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "It really did help. Thank you very much. You stated to talk about something that interests me. But will a random girl want to hear about what interests me when I first approach. Shouldn't the conversation be about them? And she might ask some questions in return but I don't see how I'd jump to my interests. I really love the, \"You seem interesting.\" I cant wait to use that one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It really did help. Thank you very much. You stated to talk about something that interests me. But will a random girl want to hear about what interests me when I first approach. Shouldn&amp;#39;t the conversation be about them? And she might ask some questions in return but I don&amp;#39;t see how I&amp;#39;d jump to my interests. I really love the, &amp;quot;You seem interesting.&amp;quot; I cant wait to use that one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9cguf", "score_hidden": false, "stickied": false, "created": 1492215455.0, "created_utc": 1492186655.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg98dv1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MadMan001", "parent_id": "t3_65cnib", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Okay mate! It's good that you approach, but taking that long of a hiatus from game can really kill your skill. 5 rejections when you haven't been out for a long time is nothing! \nYou need to remember that rejections happen all the time, it's a part of game, and you will get more thick skinned, try to smile after every interaction even though you got rejected. \n\n\nYou should probably also approach not so good looking women, you should be able to have just as much fun in a set with a 5 as with a 10. You are just out socializing and that's okay, so talk with EVERYBODY! Guys, girls, dogs. We need to get you into a social mood, and when a 10 sees you laughing with a not so attractive girl, and then 15 minutes later with another 10, she cant help be get attracted. \n\nOkay, then onto what to talk about. From what I gathered from your responds it sounds like you talk about very flatline talk, nothing exciting. Here is the trick, it doesn't have to some crazy shit, but the vibe you are giving off is very important! Talk about something you really enjoy doing, you will get that spark in your eye, and that is what matters. Shit, I like gaming and heavy metal music, and when I talk about fat bearded men on stage in viking costumes singing about raping and plundering you bet she will get attracted! :-) Don't speak in a monotone voice, try to make your tones go up and down, that way it wont be boring. \n\n\n\nAs for getting the number: Firstly I wouldn't use the line \"I just thought you look really cute.\", it gives your power away and she already knows verbally whats up, it should already show in your body language and the way that you carry yourself. \nI would normally use something like \"You seem interesting, let's exchange details\" or \"I have to go now, lets continue this sometime\". \n\nAnd NEVER ask for the number on a low note, like when the conversation is dying down, don't ask for the number, ask when you had her laughing at one of your jokes or something. And then STAY IN SET AFTER GETTING THE NUMBER, that way it doesn't look like you just wanted the number, but actually you are interested in her. \n\nAight, hope it helps man :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay mate! It&amp;#39;s good that you approach, but taking that long of a hiatus from game can really kill your skill. 5 rejections when you haven&amp;#39;t been out for a long time is nothing! \nYou need to remember that rejections happen all the time, it&amp;#39;s a part of game, and you will get more thick skinned, try to smile after every interaction even though you got rejected. &lt;/p&gt;\n\n&lt;p&gt;You should probably also approach not so good looking women, you should be able to have just as much fun in a set with a 5 as with a 10. You are just out socializing and that&amp;#39;s okay, so talk with EVERYBODY! Guys, girls, dogs. We need to get you into a social mood, and when a 10 sees you laughing with a not so attractive girl, and then 15 minutes later with another 10, she cant help be get attracted. &lt;/p&gt;\n\n&lt;p&gt;Okay, then onto what to talk about. From what I gathered from your responds it sounds like you talk about very flatline talk, nothing exciting. Here is the trick, it doesn&amp;#39;t have to some crazy shit, but the vibe you are giving off is very important! Talk about something you really enjoy doing, you will get that spark in your eye, and that is what matters. Shit, I like gaming and heavy metal music, and when I talk about fat bearded men on stage in viking costumes singing about raping and plundering you bet she will get attracted! :-) Don&amp;#39;t speak in a monotone voice, try to make your tones go up and down, that way it wont be boring. &lt;/p&gt;\n\n&lt;p&gt;As for getting the number: Firstly I wouldn&amp;#39;t use the line &amp;quot;I just thought you look really cute.&amp;quot;, it gives your power away and she already knows verbally whats up, it should already show in your body language and the way that you carry yourself. \nI would normally use something like &amp;quot;You seem interesting, let&amp;#39;s exchange details&amp;quot; or &amp;quot;I have to go now, lets continue this sometime&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;And NEVER ask for the number on a low note, like when the conversation is dying down, don&amp;#39;t ask for the number, ask when you had her laughing at one of your jokes or something. And then STAY IN SET AFTER GETTING THE NUMBER, that way it doesn&amp;#39;t look like you just wanted the number, but actually you are interested in her. &lt;/p&gt;\n\n&lt;p&gt;Aight, hope it helps man :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg98dv1", "score_hidden": false, "stickied": false, "created": 1492210683.0, "created_utc": 1492181883.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65cnib", "likes": null, "replies": "", "user_reports": [], "id": "dg9dtog", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mrfunnyman21", "parent_id": "t3_65cnib", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Dude I felt like I wrote this. I'm going through the same thing right now. Press on man I hope you find her. Do you go to UMD I could really use a wingman?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude I felt like I wrote this. I&amp;#39;m going through the same thing right now. Press on man I hope you find her. Do you go to UMD I could really use a wingman?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9dtog", "score_hidden": false, "stickied": false, "created": 1492216970.0, "created_utc": 1492188170.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65cnib", "likes": null, "replies": "", "user_reports": [], "id": "dg9kxrs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rangercoffee", "parent_id": "t3_65cnib", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Don't be \"just another guy\" when you're talking to women. Be interesting! Try and \"Breach the surface\" of the conversation, instead of sticking to topical level stuff. Show off your wit, make a few jokes, mess with her (in a way that doesn't scream \"I'm planning on murdering you later\") if you like. \n\nCultivating interest and wit are some of the most important parts, I think. If you wouldn't find yourself interesting to talk to if you were to have a random conversation with yourself (from an outside perspective), chances are, neither will the ladies. \n\nAlso, talk to more girls, more often. Its entirely possible you're just really unlucky with who you're picking to talk to, but either way, (more girls) = (a higher chance of finding a girl that'll take a liking to you).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t be &amp;quot;just another guy&amp;quot; when you&amp;#39;re talking to women. Be interesting! Try and &amp;quot;Breach the surface&amp;quot; of the conversation, instead of sticking to topical level stuff. Show off your wit, make a few jokes, mess with her (in a way that doesn&amp;#39;t scream &amp;quot;I&amp;#39;m planning on murdering you later&amp;quot;) if you like. &lt;/p&gt;\n\n&lt;p&gt;Cultivating interest and wit are some of the most important parts, I think. If you wouldn&amp;#39;t find yourself interesting to talk to if you were to have a random conversation with yourself (from an outside perspective), chances are, neither will the ladies. &lt;/p&gt;\n\n&lt;p&gt;Also, talk to more girls, more often. Its entirely possible you&amp;#39;re just really unlucky with who you&amp;#39;re picking to talk to, but either way, (more girls) = (a higher chance of finding a girl that&amp;#39;ll take a liking to you).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9kxrs", "score_hidden": false, "stickied": false, "created": 1492225286.0, "created_utc": 1492196486.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65cnib", "likes": null, "replies": "", "user_reports": [], "id": "dg9r4if", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sh0nuff", "parent_id": "t3_65cnib", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Take a look at the FORD technique ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take a look at the FORD technique &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dg9r4if", "score_hidden": false, "stickied": false, "created": 1492232767.0, "created_utc": 1492203967.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]