[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "seduction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys. I am a 20 y/o college student. Thats all the background I need to give.&lt;/p&gt;\n\n&lt;p&gt;My friend&amp;#39;s birthday was about a week ago. There was also a local festival that week so we decided we would go hang out there on his birthday. A few people from my department also showed up. There was 2 girls. Say, Alice and Hannah. We hadn&amp;#39;t really met before. Anyway, we started drinking and dancing and singing. After a while I started talking with Hannah. She seemed cool. She said &amp;quot;we need to go grab an &amp;#39;x&amp;#39; &amp;quot; to Alice. I dont really remember what that was nor did I care. I said &amp;quot;I want one too lets go together.&amp;quot; So we went, grabbed whatever we did. Alice wanted to take pic with me(we weren&amp;#39;t really in a sexual interaction with her, she just wanted to a pic with a friend and I was into Hannah). Hannah wanted to jump in the picture so I gently grabbed her by the waist and pulled her towards me. She didn&amp;#39;t mind or she loved it I have no idea. As we walked back towards our table, Hannah took my arm(or whatever that&amp;#39;s called. I am not a native speaker and that&amp;#39;s what google translate gave me). We talked just a little bit more at the table and she said she had to leave. &lt;/p&gt;\n\n&lt;p&gt;Now long story short, there was something on my mind that took me from taking things forward. Now it&amp;#39;s not on my mind anymore but it feels like whatever we had wore off. We talked after the festival a few times but it was like 2 friends(even though I dont ever want this to end up in friendship). I couldn&amp;#39;t take the interaction forward. Now I wanna build that little sexual tension we had again because I really fuckin like her. Appreciate any help.Oh btw, since we&amp;#39;re teenagers, the ideal way(apparently that&amp;#39;s what teenagers do) to interact is via text. Thanks in advance.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey guys. I am a 20 y/o college student. Thats all the background I need to give.\n\nMy friend's birthday was about a week ago. There was also a local festival that week so we decided we would go hang out there on his birthday. A few people from my department also showed up. There was 2 girls. Say, Alice and Hannah. We hadn't really met before. Anyway, we started drinking and dancing and singing. After a while I started talking with Hannah. She seemed cool. She said \"we need to go grab an 'x' \" to Alice. I dont really remember what that was nor did I care. I said \"I want one too lets go together.\" So we went, grabbed whatever we did. Alice wanted to take pic with me(we weren't really in a sexual interaction with her, she just wanted to a pic with a friend and I was into Hannah). Hannah wanted to jump in the picture so I gently grabbed her by the waist and pulled her towards me. She didn't mind or she loved it I have no idea. As we walked back towards our table, Hannah took my arm(or whatever that's called. I am not a native speaker and that's what google translate gave me). We talked just a little bit more at the table and she said she had to leave. \n\nNow long story short, there was something on my mind that took me from taking things forward. Now it's not on my mind anymore but it feels like whatever we had wore off. We talked after the festival a few times but it was like 2 friends(even though I dont ever want this to end up in friendship). I couldn't take the interaction forward. Now I wanna build that little sexual tension we had again because I really fuckin like her. Appreciate any help.Oh btw, since we're teenagers, the ideal way(apparently that's what teenagers do) to interact is via text. Thanks in advance.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65lv5p", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "waytogorabbit", "saved": false, "mod_reports": [], "name": "t3_65lv5p", "subreddit_name_prefixed": "r/seduction", "approved_by": null, "over_18": false, "domain": "self.seduction", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhrv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/seduction/comments/65lv5p/i_might_have_friendzoned_myself_need_help_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492324367.0, "url": "https://www.reddit.com/r/seduction/comments/65lv5p/i_might_have_friendzoned_myself_need_help_to/", "author_flair_text": null, "quarantine": false, "title": "I might have friendzoned myself. Need help to recover from this point", "created_utc": 1492295567.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65lv5p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65lv5p", "likes": null, "replies": "", "user_reports": [], "id": "dgbbj5q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "waytogorabbit", "parent_id": "t1_dgbaww9", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "wow I was really in my head I didn't even realize I wrote that. It is really embedded isn't it? Thank for pointing that one out.\n\nSo anyway what feels right to me is that I should try to be alone with her and start over with kino. I dont wanna get too technical about his. I just wanna know if she feels the same and I should be clear in my intent. Oh and god knows it will a lot better even if she says \"wow fuck you loser\" when I tell her that I would love to take her out. Does this plan look solid?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;wow I was really in my head I didn&amp;#39;t even realize I wrote that. It is really embedded isn&amp;#39;t it? Thank for pointing that one out.&lt;/p&gt;\n\n&lt;p&gt;So anyway what feels right to me is that I should try to be alone with her and start over with kino. I dont wanna get too technical about his. I just wanna know if she feels the same and I should be clear in my intent. Oh and god knows it will a lot better even if she says &amp;quot;wow fuck you loser&amp;quot; when I tell her that I would love to take her out. Does this plan look solid?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgbbj5q", "score_hidden": false, "stickied": false, "created": 1492326549.0, "created_utc": 1492297749.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbaww9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DaygameCoach", "parent_id": "t3_65lv5p", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "But you are not the average teenager and you want to be more successful...so you will text less and get girls out in person more (and sooner), and be clear in your intent. You will also never again say that \"this is what (average people in) society  do, so I will do it\"...especially texting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But you are not the average teenager and you want to be more successful...so you will text less and get girls out in person more (and sooner), and be clear in your intent. You will also never again say that &amp;quot;this is what (average people in) society  do, so I will do it&amp;quot;...especially texting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgbaww9", "score_hidden": false, "stickied": false, "created": 1492325642.0, "created_utc": 1492296842.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]