[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "seduction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s my rant.  How would you HONESTLY have handled this?  Keep in mind I use to consider this guy cool and a good friend.  &lt;/p&gt;\n\n&lt;p&gt;Last night I met this woman at the bar.  My &amp;quot;friends&amp;quot; had gone out for a smoke and I was bored so I approached her.  The convo was flowing, we were getting touchy with each other, and it was looking good.  Yes, the attraction was escalating really well in the small amount of time they were out smoking.  Until my friends came back.  My one bud IS cool, he realized what was going on and opted to hit up another bar with bud #2.  Bud #2 immediately starts talking to this girl and ignoring me.  Trying really hard to spit game, to the point where it was obvious to everyone what he was doing.  I don&amp;#39;t do the try hard thing, so I let him try.  I ignore her a little, chatted up the bar tender, and when they looked like they were in deep convo I would interrupt and pretend like I didn&amp;#39;t notice.  Fuck me?  Fuck you.  Lol.  Anyway, he keeps trying for the rest of the evening!  The entire time she was pinching my ass and touching my thigh so I knew I already had it.  But he dragged the whole situation out until basically closing.  He also was making snyde comments and trying to socially put me down.  But it backfired because I made him look dumb for trying hard to make me look dumb.  He came across as desperate and try hard.  Anyway, I still got the number and we made out for a while.  Fuck man, I know it could have been more if it wasn&amp;#39;t so late.  I would have asked her to leave much earlier but the whole situation was weird.  My &amp;quot;friend&amp;quot; was having a convo with the same girl that I was.  She had family shit to do the next day and I think us competing ruined the vibe a bit.  The vibe we had originally was strong.  Fuck.  He&amp;#39;s cut off.  If you don&amp;#39;t have the balls to approach women, then fuck off.  Don&amp;#39;t come trying to steal the women I approach.  It&amp;#39;s more of the principle that wings are there to assist one another...  if/when needed.  I basically brought the worst kind of competition with me to the bar.  His only success was making sure no one got laid...  yet.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Here's my rant.  How would you HONESTLY have handled this?  Keep in mind I use to consider this guy cool and a good friend.  \n\nLast night I met this woman at the bar.  My \"friends\" had gone out for a smoke and I was bored so I approached her.  The convo was flowing, we were getting touchy with each other, and it was looking good.  Yes, the attraction was escalating really well in the small amount of time they were out smoking.  Until my friends came back.  My one bud IS cool, he realized what was going on and opted to hit up another bar with bud #2.  Bud #2 immediately starts talking to this girl and ignoring me.  Trying really hard to spit game, to the point where it was obvious to everyone what he was doing.  I don't do the try hard thing, so I let him try.  I ignore her a little, chatted up the bar tender, and when they looked like they were in deep convo I would interrupt and pretend like I didn't notice.  Fuck me?  Fuck you.  Lol.  Anyway, he keeps trying for the rest of the evening!  The entire time she was pinching my ass and touching my thigh so I knew I already had it.  But he dragged the whole situation out until basically closing.  He also was making snyde comments and trying to socially put me down.  But it backfired because I made him look dumb for trying hard to make me look dumb.  He came across as desperate and try hard.  Anyway, I still got the number and we made out for a while.  Fuck man, I know it could have been more if it wasn't so late.  I would have asked her to leave much earlier but the whole situation was weird.  My \"friend\" was having a convo with the same girl that I was.  She had family shit to do the next day and I think us competing ruined the vibe a bit.  The vibe we had originally was strong.  Fuck.  He's cut off.  If you don't have the balls to approach women, then fuck off.  Don't come trying to steal the women I approach.  It's more of the principle that wings are there to assist one another...  if/when needed.  I basically brought the worst kind of competition with me to the bar.  His only success was making sure no one got laid...  yet.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65pgfo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 24, "report_reasons": null, "author": "jp3217", "saved": false, "mod_reports": [], "name": "t3_65pgfo", "subreddit_name_prefixed": "r/seduction", "approved_by": null, "over_18": false, "domain": "self.seduction", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhrv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/seduction/comments/65pgfo/rant_fuck_wingmen_its_solo_from_here_on/", "num_reports": null, "locked": false, "stickied": false, "created": 1492382919.0, "url": "https://www.reddit.com/r/seduction/comments/65pgfo/rant_fuck_wingmen_its_solo_from_here_on/", "author_flair_text": null, "quarantine": false, "title": "Rant: Fuck wingmen... it's solo from here on", "created_utc": 1492354119.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65pgfo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65pgfo", "likes": null, "replies": "", "user_reports": [], "id": "dgc5t65", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "jp3217", "parent_id": "t1_dgc4qs2", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Thanks.  Great advice.  Since I considered him a friend, he actually managed to get under my skin and throw off my vibe.  I'm normally laid back and couldn't care less.  In hindsight I don't know why I didn't just leave with her.  It seems like an obvious move now.  I shouldn't have let it get to me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks.  Great advice.  Since I considered him a friend, he actually managed to get under my skin and throw off my vibe.  I&amp;#39;m normally laid back and couldn&amp;#39;t care less.  In hindsight I don&amp;#39;t know why I didn&amp;#39;t just leave with her.  It seems like an obvious move now.  I shouldn&amp;#39;t have let it get to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgc5t65", "score_hidden": false, "stickied": false, "created": 1492385881.0, "created_utc": 1492357081.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4qs2", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "Woujo", "parent_id": "t3_65pgfo", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "First off, bud #2 is no longer your friend. What he did was super disrespectful. Either that, or he has absolutely no self control around women and couldn't resist trying to fuck any woman he thought he had access to. It's probably a combination of both. Even if he's a good friend in other contexts, cut him off. \n\nSecond, the way to deal with this situation is the following: First, figure out if the girl is actually into you. It sounds like she was. I would have interrupted their convo at one point and said \"hey I need to tell her something real quick\" and then whisper in her ear \"sorry my friend's being a douche, let's go somewhere else.\" And somewhere else is somewhere friend #2 can't come (another bar, your house, etc...). \n\nThird, you sound mad, but shit like this is sometimes good. Having a beta friend \"entertain\" the girl you are gaming is helpful because it takes the pressure off of you to perform all night and makes you look all the more alpha. At the end of the day, you \"won\" this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First off, bud #2 is no longer your friend. What he did was super disrespectful. Either that, or he has absolutely no self control around women and couldn&amp;#39;t resist trying to fuck any woman he thought he had access to. It&amp;#39;s probably a combination of both. Even if he&amp;#39;s a good friend in other contexts, cut him off. &lt;/p&gt;\n\n&lt;p&gt;Second, the way to deal with this situation is the following: First, figure out if the girl is actually into you. It sounds like she was. I would have interrupted their convo at one point and said &amp;quot;hey I need to tell her something real quick&amp;quot; and then whisper in her ear &amp;quot;sorry my friend&amp;#39;s being a douche, let&amp;#39;s go somewhere else.&amp;quot; And somewhere else is somewhere friend #2 can&amp;#39;t come (another bar, your house, etc...). &lt;/p&gt;\n\n&lt;p&gt;Third, you sound mad, but shit like this is sometimes good. Having a beta friend &amp;quot;entertain&amp;quot; the girl you are gaming is helpful because it takes the pressure off of you to perform all night and makes you look all the more alpha. At the end of the day, you &amp;quot;won&amp;quot; this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgc4qs2", "score_hidden": false, "stickied": false, "created": 1492384405.0, "created_utc": 1492355605.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65pgfo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65pgfo", "likes": null, "replies": "", "user_reports": [], "id": "dgc692u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jp3217", "parent_id": "t1_dgc55ms", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Lol, thanks man.  Yeah, I shouldn't have let it get to me.  I lost focus on the girl and I was focusing on why he was being a dick.  I contemplated decking him when he was making his snyde comments.  Bad move on my part.  I just use to consider him a friend so I was thinking to myself \"WTF are you doing?\".  If it was another random dude I wouldn't have let it distract me.  Been there.  But a friend.  He threw me for a loop.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol, thanks man.  Yeah, I shouldn&amp;#39;t have let it get to me.  I lost focus on the girl and I was focusing on why he was being a dick.  I contemplated decking him when he was making his snyde comments.  Bad move on my part.  I just use to consider him a friend so I was thinking to myself &amp;quot;WTF are you doing?&amp;quot;.  If it was another random dude I wouldn&amp;#39;t have let it distract me.  Been there.  But a friend.  He threw me for a loop.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgc692u", "score_hidden": false, "stickied": false, "created": 1492386487.0, "created_utc": 1492357687.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc55ms", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "bjlmag", "parent_id": "t3_65pgfo", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I'm with /u/Woujo on this one. You made it sound like she was clearly into you even while your friend was there. You totally could have pulled had you simply maintained subtle kino while your friend was entertaining her and eventually whispered to her an invitation to leave. Sounds like she would have enjoyed that and it would have demonstrated you taking even more control. \n\nTrust me. Subtle kino and body connection will drive her crazy even if she's listening to another guy run his mouth trying to shut you out. Pulling her from that conversation is the equivalent of standing up, patting the little kid on the head, and walking out with his candy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m with &lt;a href=\"/u/Woujo\"&gt;/u/Woujo&lt;/a&gt; on this one. You made it sound like she was clearly into you even while your friend was there. You totally could have pulled had you simply maintained subtle kino while your friend was entertaining her and eventually whispered to her an invitation to leave. Sounds like she would have enjoyed that and it would have demonstrated you taking even more control. &lt;/p&gt;\n\n&lt;p&gt;Trust me. Subtle kino and body connection will drive her crazy even if she&amp;#39;s listening to another guy run his mouth trying to shut you out. Pulling her from that conversation is the equivalent of standing up, patting the little kid on the head, and walking out with his candy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgc55ms", "score_hidden": false, "stickied": false, "created": 1492384980.0, "created_utc": 1492356180.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65pgfo", "likes": null, "replies": "", "user_reports": [], "id": "dgceuh0", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "recyclablebanthas", "parent_id": "t3_65pgfo", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "*[EDIT: Late to the thread and pretty much agree with everyone here, but adding some specific information and elaborating on a few things.]*\n\n__________1: The obvious: He's not a friend____________\n\n&gt; I use to consider this guy cool and a good friend.\n\n&gt; ....we were getting touchy with each other......Bud #2 immediately starts talking to this girl and ignoring me. Trying really hard to spit game, to the point where it was obvious to everyone what he was doing. \n\nFriend?  Sounds like you were wrong.  \n\nIf you were already touchy with her and in her physical space, and he responds to that by walking over and ignoring you to talk to her, then this alone is a **dick move.**\n\n&gt; He also was making snyde comments and trying to socially put me down. But it backfired because I made him look dumb for trying hard to make me look dumb. He came across as desperate and try hard. \n\nHe was already a DICK for ignoring you in his approach to the girl.  But this?  **He is not a friend.  At all.  Also not cool.  Someone who's a friend and a cool guy, doesn't need to bring others down around him.**\n\n__________2: You started killing your own flow____________\n\n&gt; I don't do the try hard thing, so I let him try. I ignore her a little, chatted up the bar tender, and when they looked like they were in deep convo I would interrupt and pretend like I didn't notice. \n\nNick Sparks did [a speech on this very subject.](https://youtu.be/b-a1jXgAsQI?t=4m35s)  And what stands out to me there is that you made a few mistakes here in your reaction.\n\n* Ignoring her was self-defeating.  \n\n* Ignoring ***him*** was **really** unnecessary and self-defeating.  So what if he ignores you?  He walks up to join YOUR interaction and doesn't address you, then you address him.  Interrupting him later on, was better than leaving the interaction entirely, but **the best thing you could have done would have been to open *him* as soon as he tried to enter the conversation.**  Like he says hello to her, you say hello and introduce them, while holding your position.\n\n______________________\n\n&gt; Anyway, he keeps trying for the rest of the evening! The entire time she was pinching my ass and touching my thigh so I knew I already had it. But he dragged the whole situation out until basically closing. \n\nAgain, the mistake here was kicking back just because this guy was trying for her.  It's unclear if you were physically stepping away from her, but in any case, **this ass-pinching stuff and thigh touching stuff was an indication that she wanted your attention and was possibly open to leaving with you long before closing.  And instead you let it die off.**  You could have interrupted at ANY time and did your thing.  \n\n*It was kind of a dick move to leave her to him like you did.*\n\n__________3: As long as you didn't directly compete, you're probably fine____________\n\n&gt; She had family shit to do the next day and I think us competing ruined the vibe a bit. The vibe we had originally was strong. \n\nLook, as long as you didn't let him draw you into directly competing with him, you were fine.  If anything, it sounds like you pulled away TOO much, and let his very presence kill your flow when it didn't need to.\n\n__________4: There is no \"stealing\" of women____________\n\n&gt; If you don't have the balls to approach women, then fuck off. Don't come trying to steal the women I approach. \n\nYou're missing the point.  If it's on, then there is no \"stealing\" possible.  You **just** witnessed that.  This guy was a dick, but in the end, you stole it from yourself, basically.  The women choose just as much as the men do.  She was trying to choose you and you kept ignoring her.  \n\n**Now make it up to her by calling/texting her and inviting her out.**  You don't need to apologize for your friend.  You don't need to bring him up at all unless she does.", "edited": 1492369489.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;[EDIT: Late to the thread and pretty much agree with everyone here, but adding some specific information and elaborating on a few things.]&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;_______&lt;strong&gt;&lt;em&gt;1: The obvious: He&amp;#39;s not a friend&lt;/em&gt;&lt;/strong&gt;_________&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I use to consider this guy cool and a good friend.&lt;/p&gt;\n\n&lt;p&gt;....we were getting touchy with each other......Bud #2 immediately starts talking to this girl and ignoring me. Trying really hard to spit game, to the point where it was obvious to everyone what he was doing. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Friend?  Sounds like you were wrong.  &lt;/p&gt;\n\n&lt;p&gt;If you were already touchy with her and in her physical space, and he responds to that by walking over and ignoring you to talk to her, then this alone is a &lt;strong&gt;dick move.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;He also was making snyde comments and trying to socially put me down. But it backfired because I made him look dumb for trying hard to make me look dumb. He came across as desperate and try hard. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He was already a DICK for ignoring you in his approach to the girl.  But this?  &lt;strong&gt;He is not a friend.  At all.  Also not cool.  Someone who&amp;#39;s a friend and a cool guy, doesn&amp;#39;t need to bring others down around him.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;_______&lt;strong&gt;&lt;em&gt;2: You started killing your own flow&lt;/em&gt;&lt;/strong&gt;_________&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t do the try hard thing, so I let him try. I ignore her a little, chatted up the bar tender, and when they looked like they were in deep convo I would interrupt and pretend like I didn&amp;#39;t notice. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Nick Sparks did &lt;a href=\"https://youtu.be/b-a1jXgAsQI?t=4m35s\"&gt;a speech on this very subject.&lt;/a&gt;  And what stands out to me there is that you made a few mistakes here in your reaction.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Ignoring her was self-defeating.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Ignoring &lt;strong&gt;&lt;em&gt;him&lt;/em&gt;&lt;/strong&gt; was &lt;strong&gt;really&lt;/strong&gt; unnecessary and self-defeating.  So what if he ignores you?  He walks up to join YOUR interaction and doesn&amp;#39;t address you, then you address him.  Interrupting him later on, was better than leaving the interaction entirely, but &lt;strong&gt;the best thing you could have done would have been to open &lt;em&gt;him&lt;/em&gt; as soon as he tried to enter the conversation.&lt;/strong&gt;  Like he says hello to her, you say hello and introduce them, while holding your position.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Anyway, he keeps trying for the rest of the evening! The entire time she was pinching my ass and touching my thigh so I knew I already had it. But he dragged the whole situation out until basically closing. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Again, the mistake here was kicking back just because this guy was trying for her.  It&amp;#39;s unclear if you were physically stepping away from her, but in any case, &lt;strong&gt;this ass-pinching stuff and thigh touching stuff was an indication that she wanted your attention and was possibly open to leaving with you long before closing.  And instead you let it die off.&lt;/strong&gt;  You could have interrupted at ANY time and did your thing.  &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;It was kind of a dick move to leave her to him like you did.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;_______&lt;strong&gt;&lt;em&gt;3: As long as you didn&amp;#39;t directly compete, you&amp;#39;re probably fine&lt;/em&gt;&lt;/strong&gt;_________&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She had family shit to do the next day and I think us competing ruined the vibe a bit. The vibe we had originally was strong. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Look, as long as you didn&amp;#39;t let him draw you into directly competing with him, you were fine.  If anything, it sounds like you pulled away TOO much, and let his very presence kill your flow when it didn&amp;#39;t need to.&lt;/p&gt;\n\n&lt;p&gt;_______&lt;strong&gt;&lt;em&gt;4: There is no &amp;quot;stealing&amp;quot; of women&lt;/em&gt;&lt;/strong&gt;_________&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If you don&amp;#39;t have the balls to approach women, then fuck off. Don&amp;#39;t come trying to steal the women I approach. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re missing the point.  If it&amp;#39;s on, then there is no &amp;quot;stealing&amp;quot; possible.  You &lt;strong&gt;just&lt;/strong&gt; witnessed that.  This guy was a dick, but in the end, you stole it from yourself, basically.  The women choose just as much as the men do.  She was trying to choose you and you kept ignoring her.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Now make it up to her by calling/texting her and inviting her out.&lt;/strong&gt;  You don&amp;#39;t need to apologize for your friend.  You don&amp;#39;t need to bring him up at all unless she does.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgceuh0", "score_hidden": false, "stickied": false, "created": 1492397896.0, "created_utc": 1492369096.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65pgfo", "likes": null, "replies": "", "user_reports": [], "id": "dgc485n", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Trumppbuh", "parent_id": "t3_65pgfo", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "You should have told him to fuck off", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should have told him to fuck off&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgc485n", "score_hidden": false, "stickied": false, "created": 1492383641.0, "created_utc": 1492354841.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65pgfo", "likes": null, "replies": "", "user_reports": [], "id": "dgc7jmw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Blueeyesboi", "parent_id": "t3_65pgfo", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I had this shit once. I made out with a chick i met from befriending some guys. After we made out those guys grinded on her and cockblocked me. Felt like smashing their heads but kept my cool. After all its a random club chick. But notice. I was solo. Solo is probably the best solution but you can also get cockblocked by the guys you meet there (if you meet any)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had this shit once. I made out with a chick i met from befriending some guys. After we made out those guys grinded on her and cockblocked me. Felt like smashing their heads but kept my cool. After all its a random club chick. But notice. I was solo. Solo is probably the best solution but you can also get cockblocked by the guys you meet there (if you meet any)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgc7jmw", "score_hidden": false, "stickied": false, "created": 1492388235.0, "created_utc": 1492359435.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65pgfo", "likes": null, "replies": "", "user_reports": [], "id": "dgdk6c8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MonkeyFist4150", "parent_id": "t3_65pgfo", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "i hear ya.  My best friend is a natural cockblocker.  He doesn't even realize what he's doing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i hear ya.  My best friend is a natural cockblocker.  He doesn&amp;#39;t even realize what he&amp;#39;s doing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgdk6c8", "score_hidden": false, "stickied": false, "created": 1492468964.0, "created_utc": 1492440164.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65pgfo", "likes": null, "replies": "", "user_reports": [], "id": "dgdlikv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_valtiel_", "parent_id": "t3_65pgfo", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Learning to isolate is a vital skill, I had to learn this the hard way.\n\nWhenever a woman approaches me, another girl who also likes me but I'm not interested in does and tries to steer the convo her way.\n\nWith guy's it's easier, you can ask him pointedly if he has something better to do (or whisper to him discretely in the ear to fuck off). With girls you'll look like a dick.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Learning to isolate is a vital skill, I had to learn this the hard way.&lt;/p&gt;\n\n&lt;p&gt;Whenever a woman approaches me, another girl who also likes me but I&amp;#39;m not interested in does and tries to steer the convo her way.&lt;/p&gt;\n\n&lt;p&gt;With guy&amp;#39;s it&amp;#39;s easier, you can ask him pointedly if he has something better to do (or whisper to him discretely in the ear to fuck off). With girls you&amp;#39;ll look like a dick.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgdlikv", "score_hidden": false, "stickied": false, "created": 1492470650.0, "created_utc": 1492441850.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65pgfo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65pgfo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65pgfo", "likes": null, "replies": "", "user_reports": [], "id": "dgc4z56", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jp3217", "parent_id": "t1_dgc4m4w", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Lmao", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lmao&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgc4z56", "score_hidden": false, "stickied": false, "created": 1492384729.0, "created_utc": 1492355929.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4m4w", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Woujo", "parent_id": "t1_dgc434k", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "There is no point in talking with guys like this. He is either an insanely disrespectful asshole or he has absolutely no control over his emotions and just went \"Girrrrrrrrrrrrrrrrrl.\" ", "edited": 1492355629.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is no point in talking with guys like this. He is either an insanely disrespectful asshole or he has absolutely no control over his emotions and just went &amp;quot;Girrrrrrrrrrrrrrrrrl.&amp;quot; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgc4m4w", "score_hidden": false, "stickied": false, "created": 1492384216.0, "created_utc": 1492355416.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65pgfo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65pgfo", "likes": null, "replies": "", "user_reports": [], "id": "dgc4t6c", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Woujo", "parent_id": "t1_dgc4b78", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "&gt;  I'll still be his friend and hang out but I will never bring him to the bar again. \n\nHonestly dude, a friend who will do some low-key douchey like this doesn't respect you, and will do bigger douchey shit later. I would either cut him off completely or, if he hangs out with your other friends, just ignore him. If he tries to make a thing out of it, point to this night but don't argue with him. Just be like \"you're not a good dude, that's all.\" Nothing straightens out a shitty friend like ignoring them and making feel the consequences of being shitty. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;ll still be his friend and hang out but I will never bring him to the bar again. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Honestly dude, a friend who will do some low-key douchey like this doesn&amp;#39;t respect you, and will do bigger douchey shit later. I would either cut him off completely or, if he hangs out with your other friends, just ignore him. If he tries to make a thing out of it, point to this night but don&amp;#39;t argue with him. Just be like &amp;quot;you&amp;#39;re not a good dude, that&amp;#39;s all.&amp;quot; Nothing straightens out a shitty friend like ignoring them and making feel the consequences of being shitty. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgc4t6c", "score_hidden": false, "stickied": false, "created": 1492384498.0, "created_utc": 1492355698.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4b78", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jp3217", "parent_id": "t1_dgc434k", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Oh, I'm going to.  My buds left the bar together, I walked her out.  I just had to vent and get random ppls perspectives.  I'll still be his friend and hang out but I will never bring him to the bar again.  He knew what he was doing.  We locked eyes multiple times.  I gave him multiple head nods, like get lost!  Lol.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, I&amp;#39;m going to.  My buds left the bar together, I walked her out.  I just had to vent and get random ppls perspectives.  I&amp;#39;ll still be his friend and hang out but I will never bring him to the bar again.  He knew what he was doing.  We locked eyes multiple times.  I gave him multiple head nods, like get lost!  Lol.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgc4b78", "score_hidden": false, "stickied": false, "created": 1492383770.0, "created_utc": 1492354970.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc434k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mukituki123", "parent_id": "t3_65pgfo", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "did you talk with him about it afterwards?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;did you talk with him about it afterwards?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgc434k", "score_hidden": false, "stickied": false, "created": 1492383431.0, "created_utc": 1492354631.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]