[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "seduction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;2 friends and I went to a rave last night. 1 primary did game with me and the other was just a friend. We warmed up by dancing around like crazy and obnoxiously screaming to the hardcore dubstep. I open this short girl with black hair, pretty hot. She was receptive and outgoing, but her friend and my friend didn&amp;#39;t go along well so she cockblocked super hard. Second set was with this amazingly tall blond girl that kept coming back to us. I knew she was outgoing and social, we hit it off pretty well and i kiss closed with number because she was jumping everywhere. Everywhere we went was her friends. Im not sure if i should try to fuck her or keep her around as wing girl or friend because she has social status, like a lot. Third set i opened with &amp;quot;are you a disney princess&amp;quot; from the front (never tap tap from behind) and she was extremely receptive. We bantered about how shes sleeping beauty with the 10 little midgets. I high fived her hand and held it there while she locked on to them. Then i put her arm around my neck and it looked like she was gaming me. Her friends kept coming in to tell her to go with them, but i introduced myself and they seem fine with it. She keeps telling me she has a boyfriend but i just say &amp;quot;cool. Me too&amp;quot; and she laughs it off. She wanted to go back to her friends so i told her to kiss me on the cheek, and then the other cheek. And then lip to lip. I got her number. At this point of the night my social momentum was super fucking high. I havent felt like this ever since I got into a relationship. I opened about 3 sets after this but it was bad because they simply wasnt interested. I think what rsd didnt teach us is that there will be a lot of bitchy wierd girls who simply doesnt want to talk to you. But confidence in these approaches were 50% of what kept the interactions going. At one point of the night, someone who disliked me told the security that i carried &amp;quot;drugs&amp;quot;. Funny thing is that the guys who did it were jealous that I gamed their friend so they wanted me kicked out. The night goes on and I got 1 more solid interaction with number close. Half of the girls were not interested in talking and just wanted to have fun. I noticed that if im there to take, the girls walk away. But if im simply there just to talk, they stay and dont find me as a threat. But this doesnt always happen, some girls even dislike you approaching them for whatever reason. My approaches were both direct and indirect. I always approached from the front and followed the 5 rules, eye contact, proximity, squared shoulder, speaking up, and smiling. The whole time i kept a grin on the face and never full on big smiles. &lt;/p&gt;\n\n&lt;p&gt;I left half way because the friend was in a rush. He got in trouble for being out late (we&amp;#39;re 17 y/o&amp;#39;s). Im going to hit up the girls for a day 2 or hang out simply for social proof. It was a blast and one if my best nights. But still someone where in there, i miss my ex. &lt;/p&gt;\n\n&lt;p&gt;What i could of done better: &lt;/p&gt;\n\n&lt;p&gt;Eye contact, more kino, sexual talk, and escalating more.\nThis is typed from my phone, my apologies if there are spelling mistakes  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "2 friends and I went to a rave last night. 1 primary did game with me and the other was just a friend. We warmed up by dancing around like crazy and obnoxiously screaming to the hardcore dubstep. I open this short girl with black hair, pretty hot. She was receptive and outgoing, but her friend and my friend didn't go along well so she cockblocked super hard. Second set was with this amazingly tall blond girl that kept coming back to us. I knew she was outgoing and social, we hit it off pretty well and i kiss closed with number because she was jumping everywhere. Everywhere we went was her friends. Im not sure if i should try to fuck her or keep her around as wing girl or friend because she has social status, like a lot. Third set i opened with \"are you a disney princess\" from the front (never tap tap from behind) and she was extremely receptive. We bantered about how shes sleeping beauty with the 10 little midgets. I high fived her hand and held it there while she locked on to them. Then i put her arm around my neck and it looked like she was gaming me. Her friends kept coming in to tell her to go with them, but i introduced myself and they seem fine with it. She keeps telling me she has a boyfriend but i just say \"cool. Me too\" and she laughs it off. She wanted to go back to her friends so i told her to kiss me on the cheek, and then the other cheek. And then lip to lip. I got her number. At this point of the night my social momentum was super fucking high. I havent felt like this ever since I got into a relationship. I opened about 3 sets after this but it was bad because they simply wasnt interested. I think what rsd didnt teach us is that there will be a lot of bitchy wierd girls who simply doesnt want to talk to you. But confidence in these approaches were 50% of what kept the interactions going. At one point of the night, someone who disliked me told the security that i carried \"drugs\". Funny thing is that the guys who did it were jealous that I gamed their friend so they wanted me kicked out. The night goes on and I got 1 more solid interaction with number close. Half of the girls were not interested in talking and just wanted to have fun. I noticed that if im there to take, the girls walk away. But if im simply there just to talk, they stay and dont find me as a threat. But this doesnt always happen, some girls even dislike you approaching them for whatever reason. My approaches were both direct and indirect. I always approached from the front and followed the 5 rules, eye contact, proximity, squared shoulder, speaking up, and smiling. The whole time i kept a grin on the face and never full on big smiles. \n\n\nI left half way because the friend was in a rush. He got in trouble for being out late (we're 17 y/o's). Im going to hit up the girls for a day 2 or hang out simply for social proof. It was a blast and one if my best nights. But still someone where in there, i miss my ex. \n\n\nWhat i could of done better: \n\n\nEye contact, more kino, sexual talk, and escalating more.\nThis is typed from my phone, my apologies if there are spelling mistakes  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65pnce", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "NewbieCasanova", "saved": false, "mod_reports": [], "name": "t3_65pnce", "subreddit_name_prefixed": "r/seduction", "approved_by": null, "over_18": false, "domain": "self.seduction", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhrv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/seduction/comments/65pnce/fr_rave_night_with_friends_kclosed_2x/", "num_reports": null, "locked": false, "stickied": false, "created": 1492385305.0, "url": "https://www.reddit.com/r/seduction/comments/65pnce/fr_rave_night_with_friends_kclosed_2x/", "author_flair_text": null, "quarantine": false, "title": "[FR] rave night with friends! Kclosed 2x", "created_utc": 1492356505.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]