[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "seduction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Here are a few of mine. Please post your own. &lt;/p&gt;\n\n&lt;p&gt;One night I went home with a girl and when we got to the door of her apartment building, she says &amp;quot;we can&amp;#39;t go in. My boyfriend is home.&amp;quot; No mention of the BF before this. It&amp;#39;s 3 AM. I say &amp;quot;ok well when can I fuck you in the lobby of the building.&amp;quot; She says no. I have to catch the train home by myself at 3 AM. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;One night I go home with a girl (let&amp;#39;s call her Jerkface) and I leave my jacket in her room with my keys, wallet and phone in it. I go downstairs to get something and when I get back her door is locked and she appears to be passed out. I bang on the door to no avail. I now no longer even want to fuck, I just want my shit to get home. She has a roommate, but the roomie isn&amp;#39;t there. I&amp;#39;m drunk. I have 3 options: 1) sleep in her living room, hoping that the roomie doesn&amp;#39;t come home and call the cops on some random guy in her apartment (or worse, shoot me), 2) Leave her apartment without my jacket, wallet, keys, phone, or way to get home at 4 AM, or 3) try to break her lock. I&amp;#39;m drunk, so I choose #3. I scour her entire apartment for a screwdriver and I disassemble her lock. I know that sounds creepy, but I figured it would be creepier for me to sleep in her apartment all night. I disassemble the doorknob and stuff but I can&amp;#39;t do anything about the actual locking mechanism. Now there is a hole in her door with just a lock in there so I yell at her through the hole. No response. I go in the roommate&amp;#39;s room and scour through all of her stuff. I find her roommate&amp;#39;s IPhone, but it&amp;#39;s locked. I remember that you can make emergency calls on a locked phone, so I decide to call 911 and tell the cops I think she died (which BTW, might have been true). I figured the cops would come, break the door open, and I would grab my jacket and leave. As I&amp;#39;m on the phone with 911 I think she hears me, wakes up and starts yelling at me, calling me a creep for breaking her lock, etc... I grab my jacket and run out of the house. I call an Uber and go home. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Later, Jerkface&amp;#39;s friend calls me and asks me why I was being creepy. I explain the situation to Jerkface&amp;#39;s friend. Jerkface&amp;#39;s friend agrees I did the right thing. BTW, both Jerkface and her friend are nuts. &lt;/p&gt;\n\n&lt;p&gt;One night I&amp;#39;m walking home from the bars and I see Jerkface&amp;#39;s friend with a guy. I decide to say hi to her despite what happened between me and Jerkface. Jerkface&amp;#39;s friend says to the guy &amp;quot;you know what, I think I&amp;#39;m going with Woujo.&amp;quot; The guy doesn&amp;#39;t understand and grabs her arm and Jerkface&amp;#39;s friend goes ballistic, yelling &amp;quot;don&amp;#39;t touch the rabbit fur coat!!&amp;quot; Jerkface&amp;#39;s friend comes with me. I know she&amp;#39;s crazy, so I&amp;#39;m not excited to have her, I just want to see what crazy shit she does. The friend says &amp;quot;let&amp;#39;s go to your place.&amp;quot; Knowing how nuts she is, I say no, let&amp;#39;s go to another bar. The other bar is only 4 blocks away but the friend is in heels so she starts complaining. Finally, she says &amp;quot;let&amp;#39;s grab a ride to the bar&amp;quot; and literally just gets into some guy&amp;#39;s car. She says to me &amp;quot;get in&amp;quot; but I&amp;#39;m like &amp;quot;no, that&amp;#39;s not Uber, that&amp;#39;s just some guy.&amp;quot; The girl in the guy&amp;#39;s passenger seat yells at me &amp;quot;are you with her&amp;quot; and I&amp;#39;m like &amp;quot;no.&amp;quot; Everybody in the car is confused and finally the guy takes the lead and yells at me and says &amp;quot;get her the fuck out of my car.&amp;quot; I say &amp;quot;Nope, not my responsibility. You need to call the cops to get her out&amp;quot; The car drives away, with her in it, never to be seen again. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I&amp;#39;m dancing with a hot Mexican girl all night and near the end she says &amp;quot;my brother is here, want to meet him?&amp;quot; My heart drops, I&amp;#39;m hoping her brother is not some crazy meathead that wants to beat me up. I say &amp;quot;sure&amp;quot; and turns out her brother is flamboyantly gay and really happy to see me. As we&amp;#39;re talking, he starts casually touching my dick. Normally, I&amp;#39;d flip out, but I didn&amp;#39;t want to make the girl mad so I would just gently move his hand away whenever he did it. At the end of the night the brother goes &amp;quot;hey want to come party with us after?&amp;quot; I wanted to party with the girl, but I felt like the brother liked me more than her. I turn to the girl and say &amp;quot;should I come with you guys.&amp;quot; She just shrugs and says sure with way less enthusiasm than the brother. That&amp;#39;s when I figured that the brother was probably more into me than her. I bailed. I see the brother a few weeks later at a bar with a really hot girl and he walks up to me and says &amp;quot;why did you never call my sister&amp;quot; and then touches my dick again. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I go to a strip club and get a hot stripper&amp;#39;s number but I never call her because I just assumed we didn&amp;#39;t form a connection. One night like 3 months later I&amp;#39;m drunk drunk and I randomly text her at 3 AM and she just responds &amp;quot;stripper party at [address]. Bring coke.&amp;quot; I can&amp;#39;t believe this is real, but I go anyway. Turns out, it actually is a stripper party. I don&amp;#39;t even know if she remembers who I am but the girl says she wants to have a 3 some with me and another stripper. The other stripper isn&amp;#39;t into it so she pretends to fall asleep on the couch. We do it though. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;One night I&amp;#39;m making out with a really hot girl at a club. Let&amp;#39;s call her X. X had a hot friend with her (let&amp;#39;s call her Y) so I tried to find a guy for Y. I introduce Y to some random guys at the club, and each time after talking to Y for about an hour the guy comes up to me and says &amp;quot;hey man, sorry I can&amp;#39;t handle that&amp;quot; and leaves. I have no idea what Y is doing to scare these guys off. Finally, the club closes and I invite X back. Y has no guy, so I point to some random guy outside the club and say &amp;quot;hey want to come with us?&amp;quot; That&amp;#39;s super sketchy, but I really wanted to get with X and I didn&amp;#39;t want Y being alone to fuck it up. So I invited this guy back to my place. I go in my bedroom with X and start making out. Y is in the living room with the guy. After about 20 minutes the guy is banging on my door. I open the door and he says &amp;quot;sorry but I can&amp;#39;t handle her&amp;quot; and leaves. Now Y is mad and she grabs X&amp;#39;s purse and goes outside on my balcony and starts dangling it over the ledge threatening to throw it off. X starts crying begging for the purse back. I tell Y to knock it off but Y keeps doing it. I forget what happened, but at some point Y left my apartment and ran into the street and X went chasing after her. After they left, I locked my door and fell asleep. I later called X to hang out again and found out she was trans. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;One night I&amp;#39;m leaving the club as it closes and I see 4 girls standing outside the club and they ask me &amp;quot;where are you going?&amp;quot; I say &amp;quot;home.&amp;quot; They say &amp;quot;can we come.&amp;quot; My mind is blown. 4 girls?? I say yes. We go home and 3 of them just go in my living room and start talking amongst themselves while the other one starts cleaning my apartment. I say the one &amp;quot;stop, you don&amp;#39;t need to do this&amp;quot; and she says &amp;quot;I just want to show you how good of a girlfriend I can be.&amp;quot; I invite her to my room and I fuck her while the rest are in my living room. &lt;/p&gt;\n\n&lt;p&gt;I have a lot more, I just have to remember them. &lt;/p&gt;\n\n&lt;p&gt;What stories do you have? &lt;/p&gt;\n\n&lt;p&gt;Obligatory website plug: &lt;a href=\"http://www.woujo.com\"&gt;http://www.woujo.com&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll post more when I think of some. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Here are a few of mine. Please post your own. \n\nOne night I went home with a girl and when we got to the door of her apartment building, she says \"we can't go in. My boyfriend is home.\" No mention of the BF before this. It's 3 AM. I say \"ok well when can I fuck you in the lobby of the building.\" She says no. I have to catch the train home by myself at 3 AM. \n\n***\n\nOne night I go home with a girl (let's call her Jerkface) and I leave my jacket in her room with my keys, wallet and phone in it. I go downstairs to get something and when I get back her door is locked and she appears to be passed out. I bang on the door to no avail. I now no longer even want to fuck, I just want my shit to get home. She has a roommate, but the roomie isn't there. I'm drunk. I have 3 options: 1) sleep in her living room, hoping that the roomie doesn't come home and call the cops on some random guy in her apartment (or worse, shoot me), 2) Leave her apartment without my jacket, wallet, keys, phone, or way to get home at 4 AM, or 3) try to break her lock. I'm drunk, so I choose #3. I scour her entire apartment for a screwdriver and I disassemble her lock. I know that sounds creepy, but I figured it would be creepier for me to sleep in her apartment all night. I disassemble the doorknob and stuff but I can't do anything about the actual locking mechanism. Now there is a hole in her door with just a lock in there so I yell at her through the hole. No response. I go in the roommate's room and scour through all of her stuff. I find her roommate's IPhone, but it's locked. I remember that you can make emergency calls on a locked phone, so I decide to call 911 and tell the cops I think she died (which BTW, might have been true). I figured the cops would come, break the door open, and I would grab my jacket and leave. As I'm on the phone with 911 I think she hears me, wakes up and starts yelling at me, calling me a creep for breaking her lock, etc... I grab my jacket and run out of the house. I call an Uber and go home. \n\n***\n\nLater, Jerkface's friend calls me and asks me why I was being creepy. I explain the situation to Jerkface's friend. Jerkface's friend agrees I did the right thing. BTW, both Jerkface and her friend are nuts. \n\nOne night I'm walking home from the bars and I see Jerkface's friend with a guy. I decide to say hi to her despite what happened between me and Jerkface. Jerkface's friend says to the guy \"you know what, I think I'm going with Woujo.\" The guy doesn't understand and grabs her arm and Jerkface's friend goes ballistic, yelling \"don't touch the rabbit fur coat!!\" Jerkface's friend comes with me. I know she's crazy, so I'm not excited to have her, I just want to see what crazy shit she does. The friend says \"let's go to your place.\" Knowing how nuts she is, I say no, let's go to another bar. The other bar is only 4 blocks away but the friend is in heels so she starts complaining. Finally, she says \"let's grab a ride to the bar\" and literally just gets into some guy's car. She says to me \"get in\" but I'm like \"no, that's not Uber, that's just some guy.\" The girl in the guy's passenger seat yells at me \"are you with her\" and I'm like \"no.\" Everybody in the car is confused and finally the guy takes the lead and yells at me and says \"get her the fuck out of my car.\" I say \"Nope, not my responsibility. You need to call the cops to get her out\" The car drives away, with her in it, never to be seen again. \n\n***\n\nI'm dancing with a hot Mexican girl all night and near the end she says \"my brother is here, want to meet him?\" My heart drops, I'm hoping her brother is not some crazy meathead that wants to beat me up. I say \"sure\" and turns out her brother is flamboyantly gay and really happy to see me. As we're talking, he starts casually touching my dick. Normally, I'd flip out, but I didn't want to make the girl mad so I would just gently move his hand away whenever he did it. At the end of the night the brother goes \"hey want to come party with us after?\" I wanted to party with the girl, but I felt like the brother liked me more than her. I turn to the girl and say \"should I come with you guys.\" She just shrugs and says sure with way less enthusiasm than the brother. That's when I figured that the brother was probably more into me than her. I bailed. I see the brother a few weeks later at a bar with a really hot girl and he walks up to me and says \"why did you never call my sister\" and then touches my dick again. \n\n***\n\nI go to a strip club and get a hot stripper's number but I never call her because I just assumed we didn't form a connection. One night like 3 months later I'm drunk drunk and I randomly text her at 3 AM and she just responds \"stripper party at [address]. Bring coke.\" I can't believe this is real, but I go anyway. Turns out, it actually is a stripper party. I don't even know if she remembers who I am but the girl says she wants to have a 3 some with me and another stripper. The other stripper isn't into it so she pretends to fall asleep on the couch. We do it though. \n\n***\n\nOne night I'm making out with a really hot girl at a club. Let's call her X. X had a hot friend with her (let's call her Y) so I tried to find a guy for Y. I introduce Y to some random guys at the club, and each time after talking to Y for about an hour the guy comes up to me and says \"hey man, sorry I can't handle that\" and leaves. I have no idea what Y is doing to scare these guys off. Finally, the club closes and I invite X back. Y has no guy, so I point to some random guy outside the club and say \"hey want to come with us?\" That's super sketchy, but I really wanted to get with X and I didn't want Y being alone to fuck it up. So I invited this guy back to my place. I go in my bedroom with X and start making out. Y is in the living room with the guy. After about 20 minutes the guy is banging on my door. I open the door and he says \"sorry but I can't handle her\" and leaves. Now Y is mad and she grabs X's purse and goes outside on my balcony and starts dangling it over the ledge threatening to throw it off. X starts crying begging for the purse back. I tell Y to knock it off but Y keeps doing it. I forget what happened, but at some point Y left my apartment and ran into the street and X went chasing after her. After they left, I locked my door and fell asleep. I later called X to hang out again and found out she was trans. \n\n***\n\nOne night I'm leaving the club as it closes and I see 4 girls standing outside the club and they ask me \"where are you going?\" I say \"home.\" They say \"can we come.\" My mind is blown. 4 girls?? I say yes. We go home and 3 of them just go in my living room and start talking amongst themselves while the other one starts cleaning my apartment. I say the one \"stop, you don't need to do this\" and she says \"I just want to show you how good of a girlfriend I can be.\" I invite her to my room and I fuck her while the rest are in my living room. \n\nI have a lot more, I just have to remember them. \n\nWhat stories do you have? \n\nObligatory website plug: http://www.woujo.com\n\nI'll post more when I think of some. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65r5of", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 17, "report_reasons": null, "author": "Woujo", "saved": false, "mod_reports": [], "name": "t3_65r5of", "subreddit_name_prefixed": "r/seduction", "approved_by": null, "over_18": false, "domain": "self.seduction", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhrv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/seduction/comments/65r5of/lets_have_a_fun_thread_about_our_craziest_stories/", "num_reports": null, "locked": false, "stickied": false, "created": 1492402568.0, "url": "https://www.reddit.com/r/seduction/comments/65r5of/lets_have_a_fun_thread_about_our_craziest_stories/", "author_flair_text": null, "quarantine": false, "title": "Let's have a fun thread about our craziest stories", "created_utc": 1492373768.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65r5of", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65r5of", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65r5of", "likes": null, "replies": "", "user_reports": [], "id": "dgd4nlj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ossahib", "parent_id": "t1_dgd4lim", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Hah! An open suitcase! Thats hilarious ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hah! An open suitcase! Thats hilarious &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgd4nlj", "score_hidden": false, "stickied": false, "created": 1492433460.0, "created_utc": 1492404660.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd4lim", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Woujo", "parent_id": "t1_dgd3rrv", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Good story. I had something similar happen. I was in New York for an interview and I got an AirBNB. I met a girl out, and I told her in lived in NY so she wouldn't think I was just trying to hit and run. When I brought her back she became increasingly suspicious that I didn't actually live there, especially considering that the my bedroom and closet were completely empty except for a bed and my open suitcase with all my belongings in it. LOL.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good story. I had something similar happen. I was in New York for an interview and I got an AirBNB. I met a girl out, and I told her in lived in NY so she wouldn&amp;#39;t think I was just trying to hit and run. When I brought her back she became increasingly suspicious that I didn&amp;#39;t actually live there, especially considering that the my bedroom and closet were completely empty except for a bed and my open suitcase with all my belongings in it. LOL.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgd4lim", "score_hidden": false, "stickied": false, "created": 1492433349.0, "created_utc": 1492404549.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd3rrv", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ossahib", "parent_id": "t3_65r5of", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "So I met this 21 year old Canadian chick during a pub crawl in Eastern Europe. We hit it off, started to get to know each other and at one point she inevitably asked my age.. I didn't want her to lose interest so I bullshitted her I was 21 too (I was 18). F-closed that night. We exchanged numbers and a week later she texts me she has an overnight layover in Amsterdam and asked whether she can stay over at my place.. O yeah, I also told her I have an apartment in central Amsterdam. I don't. No problem I told her with two days to spare. Eventually my brother bit the bullet and handed me his house keys..\nSo I pick her up from the airport and took her by public transport to my brothers local metro stop. We get out the metro and I legit walk her the blimming wrong way for a hundred odd metres before realising my mistake, so I turn us around and nervously laugh it off.. she knows something is up because who tf forgets their way home. Also, my brother lives opposite the metro stop too, in plain sight..\nSo we finally get to his place and I go for unlocking the door. FOUR keys on the keychain. Shit. Palms are sweaty. First attempt failed, second key worked and I try to play it cool again. We head upstairs to find bloody friends of my brothers hanging in the living room - I had no idea whether they knew what was up, but fortunately they played it cool. I take her to the bedroom and F-close. Next morning I drop her off at the train station and thats the end of that. \n\nProbably my best pub story. Also learned not to spin a web of lies - it will bite your ass later.", "edited": 1492404279.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So I met this 21 year old Canadian chick during a pub crawl in Eastern Europe. We hit it off, started to get to know each other and at one point she inevitably asked my age.. I didn&amp;#39;t want her to lose interest so I bullshitted her I was 21 too (I was 18). F-closed that night. We exchanged numbers and a week later she texts me she has an overnight layover in Amsterdam and asked whether she can stay over at my place.. O yeah, I also told her I have an apartment in central Amsterdam. I don&amp;#39;t. No problem I told her with two days to spare. Eventually my brother bit the bullet and handed me his house keys..\nSo I pick her up from the airport and took her by public transport to my brothers local metro stop. We get out the metro and I legit walk her the blimming wrong way for a hundred odd metres before realising my mistake, so I turn us around and nervously laugh it off.. she knows something is up because who tf forgets their way home. Also, my brother lives opposite the metro stop too, in plain sight..\nSo we finally get to his place and I go for unlocking the door. FOUR keys on the keychain. Shit. Palms are sweaty. First attempt failed, second key worked and I try to play it cool again. We head upstairs to find bloody friends of my brothers hanging in the living room - I had no idea whether they knew what was up, but fortunately they played it cool. I take her to the bedroom and F-close. Next morning I drop her off at the train station and thats the end of that. &lt;/p&gt;\n\n&lt;p&gt;Probably my best pub story. Also learned not to spin a web of lies - it will bite your ass later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgd3rrv", "score_hidden": false, "stickied": false, "created": 1492431888.0, "created_utc": 1492403088.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65r5of", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65r5of", "likes": null, "replies": "", "user_reports": [], "id": "dge3gfe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WhoAreTheGlobalists", "parent_id": "t1_dgcpwb2", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "deep", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;deep&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dge3gfe", "score_hidden": false, "stickied": false, "created": 1492490852.0, "created_utc": 1492462052.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcpwb2", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Iamflirtingwithyou", "parent_id": "t3_65r5of", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "One night I went out to party. But it was an off night like Wednesday and the bars were fucking dead. I went to a strip club. Fucking dead too. I walked up to a couple strippers and asked what they would do if they had the night off and wanted to party. One said she'd drink vodka and I said I had some in a water bottle in my car. She asked me if she could have some. I asked the doorman if i could go back to my car because I forgot my phone. He said it was ok. I snuck in my vodka and gave it to te stripper. She mixed it with some soda and let me have some. She asked if I liked Coke. I'd never done it but I was like fuck yeah. She gave me a little plastic bag with white powder and told me I should do it in the bathroom. It hurt my nose. I tasted it and it was really fucking bitter. I instantly regretted it. I thought she poisoned me and I was going to die. I talked to her again and she said it was her birthday and I basically said she was lying to get me to treat her a certain way but she showed me her real drivers license and I freaked out at how much she trusted me. I'll never forget the way she looked at me. She smiled at me and her eyes had this look of excitement. Maybe it was the Coke or the vodka but it was cool. I got to hear some real stories while I smoked cigarettes with her and her coworkers in the break area. Stories about how their baby daddy's had custody of their kids. Stories about how their dads treated them like shit. It was eye opening. Every stripper had a husband or boyfriend. Almost every stripper had children. They were just trying to provide for their families. I never went back to a strip club after that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One night I went out to party. But it was an off night like Wednesday and the bars were fucking dead. I went to a strip club. Fucking dead too. I walked up to a couple strippers and asked what they would do if they had the night off and wanted to party. One said she&amp;#39;d drink vodka and I said I had some in a water bottle in my car. She asked me if she could have some. I asked the doorman if i could go back to my car because I forgot my phone. He said it was ok. I snuck in my vodka and gave it to te stripper. She mixed it with some soda and let me have some. She asked if I liked Coke. I&amp;#39;d never done it but I was like fuck yeah. She gave me a little plastic bag with white powder and told me I should do it in the bathroom. It hurt my nose. I tasted it and it was really fucking bitter. I instantly regretted it. I thought she poisoned me and I was going to die. I talked to her again and she said it was her birthday and I basically said she was lying to get me to treat her a certain way but she showed me her real drivers license and I freaked out at how much she trusted me. I&amp;#39;ll never forget the way she looked at me. She smiled at me and her eyes had this look of excitement. Maybe it was the Coke or the vodka but it was cool. I got to hear some real stories while I smoked cigarettes with her and her coworkers in the break area. Stories about how their baby daddy&amp;#39;s had custody of their kids. Stories about how their dads treated them like shit. It was eye opening. Every stripper had a husband or boyfriend. Almost every stripper had children. They were just trying to provide for their families. I never went back to a strip club after that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgcpwb2", "score_hidden": false, "stickied": false, "created": 1492412462.0, "created_utc": 1492383662.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65r5of", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65r5of", "likes": null, "replies": "", "user_reports": [], "id": "dge3g2x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WhoAreTheGlobalists", "parent_id": "t1_dgcpw34", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "bruh, that shit happened to me too one time. I was so pissed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;bruh, that shit happened to me too one time. I was so pissed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dge3g2x", "score_hidden": false, "stickied": false, "created": 1492490841.0, "created_utc": 1492462041.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcpw34", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Blueeyesboi", "parent_id": "t3_65r5of", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Trans WTF MAN XD", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trans WTF MAN XD&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgcpw34", "score_hidden": false, "stickied": false, "created": 1492412454.0, "created_utc": 1492383654.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65r5of", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65r5of", "likes": null, "replies": "", "user_reports": [], "id": "dgclwzq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Woujo", "parent_id": "t1_dgcjul7", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "I don't really go out and \"game.\" ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really go out and &amp;quot;game.&amp;quot; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgclwzq", "score_hidden": false, "stickied": false, "created": 1492407102.0, "created_utc": 1492378302.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjul7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rabii99", "parent_id": "t3_65r5of", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Nice stories mate but no daygame stories?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice stories mate but no daygame stories?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgcjul7", "score_hidden": false, "stickied": false, "created": 1492404404.0, "created_utc": 1492375604.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65r5of", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65r5of", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65r5of", "likes": null, "replies": "", "user_reports": [], "id": "dgcpbop", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Iamflirtingwithyou", "parent_id": "t1_dgcodzf", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Technically I bought her dinner. From pizzahut. But yeah, I didn't pay hundreds of dollars like her clients. Dude. It was so fast. I couldn't believe how fast it was. Usually women put up token resistance. She put up no resistance whatsoever. I didn't suggest hooking up or anything. She got so turned on by my massage she was moaning softly. When she suggested that I take her home I was super surprised. Never happened that quick. Thinking about it now, she must just be a super sexual lady. I'm glad she gets paid to do what she loves. I have stripper Coke story too. I'll post on a separate comment. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Technically I bought her dinner. From pizzahut. But yeah, I didn&amp;#39;t pay hundreds of dollars like her clients. Dude. It was so fast. I couldn&amp;#39;t believe how fast it was. Usually women put up token resistance. She put up no resistance whatsoever. I didn&amp;#39;t suggest hooking up or anything. She got so turned on by my massage she was moaning softly. When she suggested that I take her home I was super surprised. Never happened that quick. Thinking about it now, she must just be a super sexual lady. I&amp;#39;m glad she gets paid to do what she loves. I have stripper Coke story too. I&amp;#39;ll post on a separate comment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgcpbop", "score_hidden": false, "stickied": false, "created": 1492411683.0, "created_utc": 1492382883.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcodzf", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Woujo", "parent_id": "t1_dgco32d", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "but you got it free? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;but you got it free? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgcodzf", "score_hidden": false, "stickied": false, "created": 1492410379.0, "created_utc": 1492381579.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgco32d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Iamflirtingwithyou", "parent_id": "t3_65r5of", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "So I went to a nearby casino around 4pm last month and I saw a gorgeous blonde milf by the bar in a tight dress with short sleeves and a collar. Kinda looked like a business woman. I was just hoping to smoke a cigarette and get a drink that day. I was dressed in a t-shirt and khaki pants. I walked up to her and told her I thought she was gorgeous and I wanted to know her. I asked  if I could sit with her to talk. She said of course. I asked what did she order from the bar? Could I buy her a drink. She said she doesn't drink and she got a free mocha since non alcoholic drinks were complimentary. I got a mocha too and started talking to her. I asked if I could have dinner with her. I asked if she liked massages and started rubbing her neck. She started moaning and asked if I lived nearby and where I was parked. I said the 2nd floor and she said lets go. I massaged her neck and shoulders in the backseat of my car and asked her to raise her skirt so I could rub her pussy.  I was rubbing her pussy through her fishnet pantyhose. She ripped her panty hose so I could finger her. She was really into it. She was practically fucking my hand. She asked me to fuck her but o had no condoms. I placed my other hand by her mouth and she eagerly sucked my fingers. I told her I wanted her to suck my dick and cum in her mouth. And that if she didn't want to swallow I would open my door for her to spit it out. She did just that. I told her I wanted to get something to eat in the casino and we left my car to back in. She said she liked pepperoni pizza with jalapeños. We went to the food court and got a medium. We hand a couple slices. I really liked her. I held her hand. She kissed my hand. I asked if I could have her number. She said sure and gave me 2 different mobile phone numbers. Which I thought was really weird. We hugged good by. As I walked away I noticed a bunch of dudes staring at me. Staring at her. Yeah she was hot. When i got back to my car I saw my cum on the floor and I got arosed again. When I got home I searched her phone number on google and my heart sank. She was an escort. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So I went to a nearby casino around 4pm last month and I saw a gorgeous blonde milf by the bar in a tight dress with short sleeves and a collar. Kinda looked like a business woman. I was just hoping to smoke a cigarette and get a drink that day. I was dressed in a t-shirt and khaki pants. I walked up to her and told her I thought she was gorgeous and I wanted to know her. I asked  if I could sit with her to talk. She said of course. I asked what did she order from the bar? Could I buy her a drink. She said she doesn&amp;#39;t drink and she got a free mocha since non alcoholic drinks were complimentary. I got a mocha too and started talking to her. I asked if I could have dinner with her. I asked if she liked massages and started rubbing her neck. She started moaning and asked if I lived nearby and where I was parked. I said the 2nd floor and she said lets go. I massaged her neck and shoulders in the backseat of my car and asked her to raise her skirt so I could rub her pussy.  I was rubbing her pussy through her fishnet pantyhose. She ripped her panty hose so I could finger her. She was really into it. She was practically fucking my hand. She asked me to fuck her but o had no condoms. I placed my other hand by her mouth and she eagerly sucked my fingers. I told her I wanted her to suck my dick and cum in her mouth. And that if she didn&amp;#39;t want to swallow I would open my door for her to spit it out. She did just that. I told her I wanted to get something to eat in the casino and we left my car to back in. She said she liked pepperoni pizza with jalapeños. We went to the food court and got a medium. We hand a couple slices. I really liked her. I held her hand. She kissed my hand. I asked if I could have her number. She said sure and gave me 2 different mobile phone numbers. Which I thought was really weird. We hugged good by. As I walked away I noticed a bunch of dudes staring at me. Staring at her. Yeah she was hot. When i got back to my car I saw my cum on the floor and I got arosed again. When I got home I searched her phone number on google and my heart sank. She was an escort. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgco32d", "score_hidden": false, "stickied": false, "created": 1492409967.0, "created_utc": 1492381167.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65r5of", "likes": null, "replies": "", "user_reports": [], "id": "dgctlko", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Elfclan30", "parent_id": "t3_65r5of", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "part 2", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;part 2&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgctlko", "score_hidden": false, "stickied": false, "created": 1492417500.0, "created_utc": 1492388700.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65r5of", "likes": null, "replies": "", "user_reports": [], "id": "dgd0qj1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Turlast", "parent_id": "t3_65r5of", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "Those stories are crazy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Those stories are crazy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgd0qj1", "score_hidden": false, "stickied": false, "created": 1492427194.0, "created_utc": 1492398394.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhrv", "removal_reason": null, "link_id": "t3_65r5of", "likes": null, "replies": "", "user_reports": [], "id": "dgdavi4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Xanarxses", "parent_id": "t3_65r5of", "subreddit_name_prefixed": "r/seduction", "controversiality": 0, "body": "ITT casanova diaries\n\n\nPretty good stories.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ITT casanova diaries&lt;/p&gt;\n\n&lt;p&gt;Pretty good stories.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "seduction", "name": "t1_dgdavi4", "score_hidden": false, "stickied": false, "created": 1492449145.0, "created_utc": 1492420345.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]