[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "worldbuilding", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/SlidingScaleOfVampireFriendliness\"&gt;Boom! TVTropes Link!&lt;/a&gt; - if you want more detail or examples of this in other fiction.&lt;/p&gt;\n\n&lt;p&gt;The scale of Vampire Friendliness is basically determining how capable/likely your vampires are to be nice people or bad people, based on how their vampiric traits manifest, seeing how vampires have quiet the variety of set-ups in fiction.&lt;/p&gt;\n\n&lt;p&gt;Describe how your vampires fit into each of these categories:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Blood requirement:- How much blood do they need? Do they need a lot? Do they have to kill people? Do they even need blood?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Craving type:- How do they crave it? Do they feel peckish as you and I would, or is it more of an addiction? Are they driven by an animal-like lust for feeding or can they repress themselves with discipline?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Conversion:- How does Vampirism spread? Is it easily spread or is it &amp;quot;gifted&amp;quot;? Is Vampire just a race or genetic condition with no &amp;quot;turning&amp;quot; involved?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Morality shifts:- Is there any shift in personality? Is a Vampire not the same person they were before being born? Do they lose their soul? Or are they the same person but their diet is a bit different?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Super powers:- Do Vampires get any neat powers? Are those powers easily abusable for personal gain?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Weaknesses:- Do Vampires hate sunlight with a passion or just accept their limitation? Do they &lt;em&gt;have&lt;/em&gt; a limitation?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Appearances:- Are they butt-ugly monsters or are they actually quite handsome? Do they look the same but with pointier teeth?&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;In general, how possible is it in your world for a Vampire to be a good person? Is it common? Rare? Non-existent? The norm?&lt;/p&gt;\n\n&lt;p&gt;Also, if you want to add any additional factoids about Vampies, go right ahead!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[Boom! TVTropes Link!](http://tvtropes.org/pmwiki/pmwiki.php/Main/SlidingScaleOfVampireFriendliness) - if you want more detail or examples of this in other fiction.\n\nThe scale of Vampire Friendliness is basically determining how capable/likely your vampires are to be nice people or bad people, based on how their vampiric traits manifest, seeing how vampires have quiet the variety of set-ups in fiction.\n\nDescribe how your vampires fit into each of these categories:\n\n* Blood requirement:- How much blood do they need? Do they need a lot? Do they have to kill people? Do they even need blood?\n\n* Craving type:- How do they crave it? Do they feel peckish as you and I would, or is it more of an addiction? Are they driven by an animal-like lust for feeding or can they repress themselves with discipline?\n\n* Conversion:- How does Vampirism spread? Is it easily spread or is it \"gifted\"? Is Vampire just a race or genetic condition with no \"turning\" involved?\n\n* Morality shifts:- Is there any shift in personality? Is a Vampire not the same person they were before being born? Do they lose their soul? Or are they the same person but their diet is a bit different?\n\n* Super powers:- Do Vampires get any neat powers? Are those powers easily abusable for personal gain?\n\n* Weaknesses:- Do Vampires hate sunlight with a passion or just accept their limitation? Do they *have* a limitation?\n\n* Appearances:- Are they butt-ugly monsters or are they actually quite handsome? Do they look the same but with pointier teeth?\n\nIn general, how possible is it in your world for a Vampire to be a good person? Is it common? Rare? Non-existent? The norm?\n\nAlso, if you want to add any additional factoids about Vampies, go right ahead!\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "🤔Discussion", "id": "65dvbq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 30, "report_reasons": null, "author": "MrManicMarty", "saved": false, "mod_reports": [], "name": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "approved_by": null, "over_18": false, "domain": "self.worldbuilding", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/uqnqhACFZpBG5izbRUDdD5wzmQPw-BUC3LH1NOnHnlY.jpg?s=5162fdcda755659c31a240f2e432bedb", "width": 200, "height": 67}, "resolutions": [{"url": "https://i.redditmedia.com/uqnqhACFZpBG5izbRUDdD5wzmQPw-BUC3LH1NOnHnlY.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=1197ec12b7cd01ce767badb5656cc3ea", "width": 108, "height": 36}], "variants": {}, "id": "Mtl4G6qpXNvfAztlrj2w3Xujb-9qxu0r8j1IKnwTszA"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2rd6n", "edited": false, "link_flair_css_class": "discussion", "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/worldbuilding/comments/65dvbq/where_do_your_vampires_fall_on_the_sliding_scale/", "num_reports": null, "locked": false, "stickied": false, "created": 1492219421.0, "url": "https://www.reddit.com/r/worldbuilding/comments/65dvbq/where_do_your_vampires_fall_on_the_sliding_scale/", "author_flair_text": "Nobody told me this worldbuilding stuff would be hard!", "quarantine": false, "title": "Where do your Vampires fall on the Sliding Scale of Vampire Friendliness?", "created_utc": 1492190621.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 37, "visited": false, "subreddit_type": "public", "ups": 30}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dg9ht1w", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Sixminuteslate", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "&gt;Blood Requirement\n\nVampires in Orare do not strictly require blood, but they do crave it. The source does not matter as long as it is fresh (though creatures with corrosive blood and other dangerous properties are in most cases not optimal). A vampire requires fresh blood in order to maintain its lifelike appearance and vampiric abilities, and the longer it goes without blood the more dry and sunken its flesh appears, until eventually (usually around 20-25 years since the last solid meal) their vampire properties will fade away completely and they'll become a \"normal\" type of undead, usually a skeleton by this point. \n\n&gt; Craving Type\n\nVampires are fully aware that without blood they will lose their supernatural abilities (though not all are aware that they can survive without it). Their hunger is gnawing and persistent and strongest when they have recently fed, but will fade away gradually the longer they go without blood. \n\n&gt; Conversion\n\nVampirism isn't a disease, and anyone can be made into a vampire after death with the proper rituals, the same as a lich, mummy, or other manufactured (not naturally occurring) undead. Surviving a vampire bite is likely to give you a secondary infection (most vampires don't brush their teeth) but it won't transform you into their spawn. The belief that it will, however, is very common in Orare, due to the amount of vampires that are themselves capable necromancers. \n\n&gt; Morality Shifts\n\nThere's no morality shift upon becoming undead for any type of undead in Orare, but it does affect some of the parts of consciousness. Undead are incapable of feeling most of the emotions they are familiar with in life, like fear, love, and joy, and quickly slip into a depressive state as they feel like the whole world has been \"greyed out\" and made devoid of meaning. The undead state does have \"emotions\" of its own, it just takes time to understand them and to forget the absence of the old ones. \n\n&gt; Super Powers\n\nIn addition to normal undead qualities, vampires have incredible strength, supernaturally precise senses, are able to heal their bodies rapidly, and can transform into a shadowy cloud and back. Like any undead they grow gradually stronger the longer they exist, though their abilities are also dependent on regular consumption of living blood. Without blood they are no more powerful than a normal skeleton or zombie, though a particularly ancient vampire will still be hideously strong. Many magic using vampires wield spells that conjure or control blood, but these are the result of research by vampires and not an innate quality of the vampiric condition. Mortals can learn these spells (if they had the chance), but because they are usually designed for use by supernaturally durable undead they can be hazardous for living creatures to cast. \n\n&gt; Weaknesses\n\nVampires are damaged by sunlight as though they were set on fire. This is the result of their powerful senses, which also make them vulnerable to effects that directly attack those qualities, like loud sounds and other bright lights. A vampire that has lost many of its abilities due to infrequent blood consumption will lose these vulnerabilities as well. Destroying a vampire's heart will usually destroy it instantly, but very old vampires that have been reduced to skeletons seem to have lost this weakness. \n\n&gt; Appearances\n\nVampires that have consumed blood very recently will look much the same they did in life. Without blood, vampires slowly look more and more like normal undead: withered and grey. Powerful undead of any sort will exude a hazy aura around themselves of pure negative energy, appearing like an afterimage when they move. \n\n&gt;Can a vampire be a good person?\n\nSure, there's nothing stopping them. In most cases the path of vampirism isn't one that good people choose, and given the resources and work involved in turning it is always a conscious choice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Blood Requirement&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Vampires in Orare do not strictly require blood, but they do crave it. The source does not matter as long as it is fresh (though creatures with corrosive blood and other dangerous properties are in most cases not optimal). A vampire requires fresh blood in order to maintain its lifelike appearance and vampiric abilities, and the longer it goes without blood the more dry and sunken its flesh appears, until eventually (usually around 20-25 years since the last solid meal) their vampire properties will fade away completely and they&amp;#39;ll become a &amp;quot;normal&amp;quot; type of undead, usually a skeleton by this point. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Craving Type&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Vampires are fully aware that without blood they will lose their supernatural abilities (though not all are aware that they can survive without it). Their hunger is gnawing and persistent and strongest when they have recently fed, but will fade away gradually the longer they go without blood. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Conversion&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Vampirism isn&amp;#39;t a disease, and anyone can be made into a vampire after death with the proper rituals, the same as a lich, mummy, or other manufactured (not naturally occurring) undead. Surviving a vampire bite is likely to give you a secondary infection (most vampires don&amp;#39;t brush their teeth) but it won&amp;#39;t transform you into their spawn. The belief that it will, however, is very common in Orare, due to the amount of vampires that are themselves capable necromancers. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Morality Shifts&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There&amp;#39;s no morality shift upon becoming undead for any type of undead in Orare, but it does affect some of the parts of consciousness. Undead are incapable of feeling most of the emotions they are familiar with in life, like fear, love, and joy, and quickly slip into a depressive state as they feel like the whole world has been &amp;quot;greyed out&amp;quot; and made devoid of meaning. The undead state does have &amp;quot;emotions&amp;quot; of its own, it just takes time to understand them and to forget the absence of the old ones. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Super Powers&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In addition to normal undead qualities, vampires have incredible strength, supernaturally precise senses, are able to heal their bodies rapidly, and can transform into a shadowy cloud and back. Like any undead they grow gradually stronger the longer they exist, though their abilities are also dependent on regular consumption of living blood. Without blood they are no more powerful than a normal skeleton or zombie, though a particularly ancient vampire will still be hideously strong. Many magic using vampires wield spells that conjure or control blood, but these are the result of research by vampires and not an innate quality of the vampiric condition. Mortals can learn these spells (if they had the chance), but because they are usually designed for use by supernaturally durable undead they can be hazardous for living creatures to cast. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Weaknesses&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Vampires are damaged by sunlight as though they were set on fire. This is the result of their powerful senses, which also make them vulnerable to effects that directly attack those qualities, like loud sounds and other bright lights. A vampire that has lost many of its abilities due to infrequent blood consumption will lose these vulnerabilities as well. Destroying a vampire&amp;#39;s heart will usually destroy it instantly, but very old vampires that have been reduced to skeletons seem to have lost this weakness. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Appearances&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Vampires that have consumed blood very recently will look much the same they did in life. Without blood, vampires slowly look more and more like normal undead: withered and grey. Powerful undead of any sort will exude a hazy aura around themselves of pure negative energy, appearing like an afterimage when they move. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Can a vampire be a good person?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sure, there&amp;#39;s nothing stopping them. In most cases the path of vampirism isn&amp;#39;t one that good people choose, and given the resources and work involved in turning it is always a conscious choice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9ht1w", "score_hidden": false, "stickied": false, "created": 1492221543.0, "created_utc": 1492192743.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dg9huvk", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "surrogate667", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "- Vampires require one third as much blood as humans require food, so they need to drink at least once a day. Their appetite depends on their size and strength (how much muscle mass they have, more specifically, because like in humans, muscles require more support).\n\n- The craving is akin to the craving for food that humans have, but if they \"starve\", then they'll find it difficult to not become ravenous. Until a vampire who has turned begins to drink non-vampire blood, they will age normally and be capable of surviving on a vampire's blood, but it will never be the same. If they are truly starved of blood, they will permanently become hideous, emaciated monsters called Strigoi that will behave like wild beasts.\n\n- People are converted into vampires if they drink a vampire's blood, so it is a sort of gift, There is also a necromantic ritual that can be undertaken to become a vampire. A common way for vampirism to spread is through a vampire lord or lady inviting humans as guards or servants, who may be chosen to become vampiric like themselves. Another common way is cult-like bands of them in the wilderness kidnapping people and forcing them into it.\n\n- There is no automatic morality shift, but vampires may begin to view humans the same way that people view cows, pigs or sheep to make it easier to feed off of them, depending on how they're living their lives/how they were converted. They tend to see themselves as superior to humans because of their innate abilities, but they may have high respect for their servants/bodyguards despite them not being vampires.\n\n- Vampires have an easier time using hemomancy and necromantic/demonic powers like resurrecting corpses or summoning demons, stronger vampires may manifest weapons in their hands that are made from crystallized blood. They are also capable of quick regeneration (obviously), and faster, stronger, (even if they look skinny) more magically inclined, and usually more intelligent and experienced than mortals because of their long lives. When they're old enough, they may be able to grow wings like a bat's, transform into a cloud of bats, or turn into mist.\n\n- The weaknesses of vampires include flaking away in the sunlight, (they'll regenerate when they drink blood and aren't in the sun, but slowly) taking severe damage from fire, being repelled by natural sources of moving water such as rainfall or streams, (so they can still take showers or baths) and being repelled by water magic which is considered the same. They don't all hate garlic, some might even enjoy it, but in smaller amounts. It has a more intense, burning flavor and smell for them, so it was used as a primitive method of repelling them by certain folk. Holy magic hurts them, but they won't be repelled just from seeing religious symbols, like crosses or eyes.\n\n- ~~All vampires are cute anime loli~~ They look the same as they did in life, but with paler skin, red eyes, and fangs.\n\nIt is possible for a vampire in my world to be a good person, those tend to be the nobles who have humans living on their estates in exchange for the cheap price of having their blood drained every now and then and providing them with other services. Many of these nobles can be awful people too, though, it depends on which species it is. High elf vampires tend to be \"good people\" the most often.", "edited": 1492194771.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Vampires require one third as much blood as humans require food, so they need to drink at least once a day. Their appetite depends on their size and strength (how much muscle mass they have, more specifically, because like in humans, muscles require more support).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The craving is akin to the craving for food that humans have, but if they &amp;quot;starve&amp;quot;, then they&amp;#39;ll find it difficult to not become ravenous. Until a vampire who has turned begins to drink non-vampire blood, they will age normally and be capable of surviving on a vampire&amp;#39;s blood, but it will never be the same. If they are truly starved of blood, they will permanently become hideous, emaciated monsters called Strigoi that will behave like wild beasts.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;People are converted into vampires if they drink a vampire&amp;#39;s blood, so it is a sort of gift, There is also a necromantic ritual that can be undertaken to become a vampire. A common way for vampirism to spread is through a vampire lord or lady inviting humans as guards or servants, who may be chosen to become vampiric like themselves. Another common way is cult-like bands of them in the wilderness kidnapping people and forcing them into it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There is no automatic morality shift, but vampires may begin to view humans the same way that people view cows, pigs or sheep to make it easier to feed off of them, depending on how they&amp;#39;re living their lives/how they were converted. They tend to see themselves as superior to humans because of their innate abilities, but they may have high respect for their servants/bodyguards despite them not being vampires.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Vampires have an easier time using hemomancy and necromantic/demonic powers like resurrecting corpses or summoning demons, stronger vampires may manifest weapons in their hands that are made from crystallized blood. They are also capable of quick regeneration (obviously), and faster, stronger, (even if they look skinny) more magically inclined, and usually more intelligent and experienced than mortals because of their long lives. When they&amp;#39;re old enough, they may be able to grow wings like a bat&amp;#39;s, transform into a cloud of bats, or turn into mist.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The weaknesses of vampires include flaking away in the sunlight, (they&amp;#39;ll regenerate when they drink blood and aren&amp;#39;t in the sun, but slowly) taking severe damage from fire, being repelled by natural sources of moving water such as rainfall or streams, (so they can still take showers or baths) and being repelled by water magic which is considered the same. They don&amp;#39;t all hate garlic, some might even enjoy it, but in smaller amounts. It has a more intense, burning flavor and smell for them, so it was used as a primitive method of repelling them by certain folk. Holy magic hurts them, but they won&amp;#39;t be repelled just from seeing religious symbols, like crosses or eyes.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;del&gt;All vampires are cute anime loli&lt;/del&gt; They look the same as they did in life, but with paler skin, red eyes, and fangs.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;It is possible for a vampire in my world to be a good person, those tend to be the nobles who have humans living on their estates in exchange for the cheap price of having their blood drained every now and then and providing them with other services. Many of these nobles can be awful people too, though, it depends on which species it is. High elf vampires tend to be &amp;quot;good people&amp;quot; the most often.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9huvk", "score_hidden": false, "stickied": false, "created": 1492221602.0, "created_utc": 1492192802.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dg9jftx", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "TheDeadWhale", "parent_id": "t1_dg9jaj3", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Thank you :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9jftx", "score_hidden": false, "stickied": false, "created": 1492223483.0, "created_utc": 1492194683.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9jaj3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MrManicMarty", "parent_id": "t1_dg9j40o", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Gruesome. But cool.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gruesome. But cool.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9jaj3", "score_hidden": false, "stickied": false, "created": 1492223303.0, "created_utc": 1492194503.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9j40o", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "TheDeadWhale", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "So. The Corsair's valley doesn't really have vampires, but there does exist a spiritual society within the Ganna city elite who regularly feed on human blood and flesh. The tribal peoples of the flatlands outside Ganna see them as vampiric and demonic, and the stories most likely get to them through escaped slaves from within the city. The cannibal society of The Blood Dancers is my industrial fantasy analogue to vampires, so they'll have to do:\n\n* Blood requirement: The elite society of Blood Dancers emerged from the idea that Ganna and the Iron empire's other metropolises are incredibly malnourished. It is also true that the stack cities are severely *overpopulated*. An elite club from the city's highest levels (literally) emerged from the suggestion that both problems could be solved at once. So they don't *need* to consume human blood, they *want* to. \n\n* Craving type: Blood Dancers are generally in the highest of social strata, causing their activities to be easily funded and organized. This is convenient due to the highly addictive nature of human flesh. Withdrawals can be intense, but Blood Dancers rarely experience symptoms, as they often have a whole district of slumdogs within their hungry gaze. Pork has been known to taste very similarly to manflesh, and can hold off cravings for a short while. \n\n* Conversion: The Blood Dance in question is a stomping, howling group dance, where members don devilish masks and mutilate a sacrifical human, flaying them alive and feeding their raw flesh to the audience. Most Blood Dancers preform their first ritual at a very young age. It spreads like a religion, with wealthy children attending events and receiving blood soaked brainwashing. By the time they're adults, their meat diet is almost exclusively human, and their friends and family tend to all be Blood Dancers themselves. The oldest families have their own dances and secret blood halls, scattered around the penthouses of Ganna. \n\n* Morality shifts: If one is not already severely psychopathic, participating in a blood dance pretty much seals the deal, especially if you are young and don't know any better. Children of Blood Dancers live very organized and planned lives, receiving world class education and inheriting massive sums of money. A massive secret society with a dress and diet code tends to make one a bit of an elitist. \n\n* Super powers: The social elite already have a certain level of power, but Blood dancers have the advantage of fear. They are secretive, quiet, and incredibly driven, causing many companies to desire having a few in their management. The status of a Blood Dancer spreads to their environment, and who doesn't want a classy cannibal on their team?\n\n* Weaknesses: Social isolation. They've lived their whole lives on the literal top of a neon metropolis, in a world where siege can happen at any moment, and where the city walls are half a kilometre thick for a reason. They thrive in the ultra-urban realm of their birth, but are found almost exclusively in Ganna, and rarely stray from a single block. \n\n* Appearances: Being Ganna natives, they all tend to be tall, raven haired and caramel skinned with very pronounced bone structure. It is not very easy to tell them apart physically, but blood dancers often wear very formal robes, shiny black ornamentation and extensive tattoos of their gory activities. Sunken eyes and pale complexion are common, but due to long ritualistic nights and religious sleep deprivation. ", "edited": 1492194613.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So. The Corsair&amp;#39;s valley doesn&amp;#39;t really have vampires, but there does exist a spiritual society within the Ganna city elite who regularly feed on human blood and flesh. The tribal peoples of the flatlands outside Ganna see them as vampiric and demonic, and the stories most likely get to them through escaped slaves from within the city. The cannibal society of The Blood Dancers is my industrial fantasy analogue to vampires, so they&amp;#39;ll have to do:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Blood requirement: The elite society of Blood Dancers emerged from the idea that Ganna and the Iron empire&amp;#39;s other metropolises are incredibly malnourished. It is also true that the stack cities are severely &lt;em&gt;overpopulated&lt;/em&gt;. An elite club from the city&amp;#39;s highest levels (literally) emerged from the suggestion that both problems could be solved at once. So they don&amp;#39;t &lt;em&gt;need&lt;/em&gt; to consume human blood, they &lt;em&gt;want&lt;/em&gt; to. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Craving type: Blood Dancers are generally in the highest of social strata, causing their activities to be easily funded and organized. This is convenient due to the highly addictive nature of human flesh. Withdrawals can be intense, but Blood Dancers rarely experience symptoms, as they often have a whole district of slumdogs within their hungry gaze. Pork has been known to taste very similarly to manflesh, and can hold off cravings for a short while. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Conversion: The Blood Dance in question is a stomping, howling group dance, where members don devilish masks and mutilate a sacrifical human, flaying them alive and feeding their raw flesh to the audience. Most Blood Dancers preform their first ritual at a very young age. It spreads like a religion, with wealthy children attending events and receiving blood soaked brainwashing. By the time they&amp;#39;re adults, their meat diet is almost exclusively human, and their friends and family tend to all be Blood Dancers themselves. The oldest families have their own dances and secret blood halls, scattered around the penthouses of Ganna. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Morality shifts: If one is not already severely psychopathic, participating in a blood dance pretty much seals the deal, especially if you are young and don&amp;#39;t know any better. Children of Blood Dancers live very organized and planned lives, receiving world class education and inheriting massive sums of money. A massive secret society with a dress and diet code tends to make one a bit of an elitist. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Super powers: The social elite already have a certain level of power, but Blood dancers have the advantage of fear. They are secretive, quiet, and incredibly driven, causing many companies to desire having a few in their management. The status of a Blood Dancer spreads to their environment, and who doesn&amp;#39;t want a classy cannibal on their team?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Weaknesses: Social isolation. They&amp;#39;ve lived their whole lives on the literal top of a neon metropolis, in a world where siege can happen at any moment, and where the city walls are half a kilometre thick for a reason. They thrive in the ultra-urban realm of their birth, but are found almost exclusively in Ganna, and rarely stray from a single block. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Appearances: Being Ganna natives, they all tend to be tall, raven haired and caramel skinned with very pronounced bone structure. It is not very easy to tell them apart physically, but blood dancers often wear very formal robes, shiny black ornamentation and extensive tattoos of their gory activities. Sunken eyes and pale complexion are common, but due to long ritualistic nights and religious sleep deprivation. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9j40o", "score_hidden": false, "stickied": false, "created": 1492223091.0, "created_utc": 1492194291.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dg9ko17", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "JesterOfDestiny", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "&gt;Blood requirement\n\nThey need it. They can survive with normal food, but it doesn't nourishes them properly. So they need blood to function properly. And they need quite a lot. If a vampire would get their needed amount from a single person, the victim would likely loose a lot of blood. But vampires can survive pretty long without blood.\n\nThere's also the chance to turn into man-bat monsters when they get really hungry.\n\n&gt;Craving type\n\nOutside of the aforementioned chance to turn into werebats, it's not much different to regular hunger. It grows in intensity, the longer it lingers, but it's not like they actively have to fight against the urge to bite the closest person.\n\n&gt;Conversion\n\nThose bitten won't turn into vampires, but vampire saliva contains a venom, that can cause severe brain damage, which may turn the bitten into vegetables.\n\nIt is possible to drink blood without biting though, so the dangers of brain-corroding venom can be avoided.\n\n&gt;Morality shifts\n\nVampires are born vampires.\n\n&gt;Super powers\n\nWell, if you can learn to control your man-bat transformation, it can become an immensely useful ability. They also heal quite quickly, depending on how much blood they consume and are immune to most earthly diseases. \n\nOther than that, they just get a big disgusting lamprey mouth, they have to conceal.\n\n&gt;Weaknesses\n\nThey're allergic to sunlight, have slight OCD and absolutely loathe garlic. Most people also fear them, so they have to conceal their vampirism. That can be pretty difficult when paired with those other weaknesses.\n\n&gt;Appearances\n\nThey look like perfectly normal people, maybe with a strong aversion to revealing clothes. And of course the whole lamprey-mouth thing, but that one's pretty easy to conceal. Well, yeah they also may turn into bat-monsters. But other than that, they look perfectly normal.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Blood requirement&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They need it. They can survive with normal food, but it doesn&amp;#39;t nourishes them properly. So they need blood to function properly. And they need quite a lot. If a vampire would get their needed amount from a single person, the victim would likely loose a lot of blood. But vampires can survive pretty long without blood.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s also the chance to turn into man-bat monsters when they get really hungry.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Craving type&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Outside of the aforementioned chance to turn into werebats, it&amp;#39;s not much different to regular hunger. It grows in intensity, the longer it lingers, but it&amp;#39;s not like they actively have to fight against the urge to bite the closest person.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Conversion&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Those bitten won&amp;#39;t turn into vampires, but vampire saliva contains a venom, that can cause severe brain damage, which may turn the bitten into vegetables.&lt;/p&gt;\n\n&lt;p&gt;It is possible to drink blood without biting though, so the dangers of brain-corroding venom can be avoided.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Morality shifts&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Vampires are born vampires.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Super powers&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, if you can learn to control your man-bat transformation, it can become an immensely useful ability. They also heal quite quickly, depending on how much blood they consume and are immune to most earthly diseases. &lt;/p&gt;\n\n&lt;p&gt;Other than that, they just get a big disgusting lamprey mouth, they have to conceal.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Weaknesses&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They&amp;#39;re allergic to sunlight, have slight OCD and absolutely loathe garlic. Most people also fear them, so they have to conceal their vampirism. That can be pretty difficult when paired with those other weaknesses.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Appearances&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They look like perfectly normal people, maybe with a strong aversion to revealing clothes. And of course the whole lamprey-mouth thing, but that one&amp;#39;s pretty easy to conceal. Well, yeah they also may turn into bat-monsters. But other than that, they look perfectly normal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9ko17", "score_hidden": false, "stickied": false, "created": 1492224961.0, "created_utc": 1492196161.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dg9p9ux", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TFeathersB", "parent_id": "t1_dg9o3f9", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Oops, yes I do. Thanks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oops, yes I do. Thanks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9p9ux", "score_hidden": false, "stickied": false, "created": 1492230507.0, "created_utc": 1492201707.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9o3f9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TimeRelic", "parent_id": "t1_dg9mq28", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "&gt; Blood Fruit is an option for \"veterinarian\" vampires\n\nDo you mean Vegetarian?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Blood Fruit is an option for &amp;quot;veterinarian&amp;quot; vampires&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Do you mean Vegetarian?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9o3f9", "score_hidden": false, "stickied": false, "created": 1492229088.0, "created_utc": 1492200288.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9mq28", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "TFeathersB", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "There are a few different types of vampires in my world, but the three main types are Vampire Purebloods, Greater Vampires and Lesser Vampires.\n\n**Blood Requirement**   \nAll vampires require blood and any blood can do but the blood of mortals and some fae is the most desired and filling. Vampire Purebloods need at least one body full every two weeks, but Greater and Lesser Vampires are almost always hungry and need to feed nightly on at least one body. They don't need to kill their victims, so long as they receive the required amount of blood.\n\nBlood Fruit is an option for \"vegetarian\" vampires, but at least five fruits a day is required to satisfy a Pureblood. And while Blood Fruit does grow on trees, the amount of work required to grown and cultivate vast amounts makes impractical for most.\n\n**Craving Type**   \nFor Pureblood Vampires their craving is much like a mortal growing hungry. However, after two weeks without feeding they begin to grow more violent and predatory. Greater and Lesser Vampires have a almost predatory lust for blood each night, they need to feed and will try to feed on as many people as they can.\n\n**Conversion**   \nPureblood Vampires are born and grow old like mortals do. It's unknown if they die of old age as there's been no record of a Pureblood Vampire ever doing so. Greater Vampires are created when a Pureblood Vampire drinks about two-thirds of their victim's blood and then the victim feasts on the vampire's own blood. Weather or not a pact is formed between the two is decided upon beforehand, if so then the victim will be bound to the vampire's every command. Lesser Vampires are created the same way only by Greater Vampires rather then Purebloods.\n\n**Morality Shifts**\nWhen someone is converted to a vampire their morality and personality remains the same. However, Greater and Lesser Vampires always have the desire to feed and if they do not answer it by their own free will then their predatory side takes over and will do anything to feed. It also has the unfortunate side-effect of desiring to feast on the blood of those closest to the vampire first.\n\n**Super Powers**   \nAll three get:\n\n* Super speed.\n* Super strength.\n* Greatly enhances senses.\n* The ability to turn into bats.\n* Fast regeneration.\n\nGreater and Purebloods get:\n\n* The ability to fly and hover at will.\n* Mind control abilities.\n\nPurebloods get:\n\n* Thea ability to teleport short distances.\n* The ability to turn into a shadow.\n* The ability to turn into a large hound.\n* Enhanced mind control abilities, even passive ones.\n\n**Weaknesses**\nAll tree vampires can be killed by mortal weapons, however silver weapons prevents a Greater or Lesser vampire's wounds from healing for several hours. All what is required to kill a vampire is to destroy the brain and heart. Pureblood vampires can stand sunlight however direct sunlight irritates exposed skin and their eyes. Greater Vampires suffer more from this then Purebloods and a lesser vampire's skin starts to burn if exposed for more then a few minutes. Their powers are also weakened in sunlight.\n\nHoly items and symbols can keep vampires at bay or even harm them, so long as the user's belief in those items is greater then the vampire's disbelief in them.\n\n**Appearances**   \nGreater and Lesser vampires are identical to their previous selves, however their skin grows pale and they're cold to the touch. When they go predatory their eyes change to a red or black colour. Pureblood vampires are often considered to be quite attractive (although that could be due to passive mind control). They look close to humans, however, their skin is usually a pale green in colour, their ears are pointed and their eyes are slit much like a cat's and are coloured red or magenta.\n\nSo, can a vampire be a good person? Yes. However, for purebloods it's easiest due to their greater control, restraint and often easier access to blood fruit. For Greater and Lesser vampires it becomes difficult, especially at night after a period of not feasting.", "edited": 1492201728.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are a few different types of vampires in my world, but the three main types are Vampire Purebloods, Greater Vampires and Lesser Vampires.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Blood Requirement&lt;/strong&gt;&lt;br/&gt;\nAll vampires require blood and any blood can do but the blood of mortals and some fae is the most desired and filling. Vampire Purebloods need at least one body full every two weeks, but Greater and Lesser Vampires are almost always hungry and need to feed nightly on at least one body. They don&amp;#39;t need to kill their victims, so long as they receive the required amount of blood.&lt;/p&gt;\n\n&lt;p&gt;Blood Fruit is an option for &amp;quot;vegetarian&amp;quot; vampires, but at least five fruits a day is required to satisfy a Pureblood. And while Blood Fruit does grow on trees, the amount of work required to grown and cultivate vast amounts makes impractical for most.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Craving Type&lt;/strong&gt;&lt;br/&gt;\nFor Pureblood Vampires their craving is much like a mortal growing hungry. However, after two weeks without feeding they begin to grow more violent and predatory. Greater and Lesser Vampires have a almost predatory lust for blood each night, they need to feed and will try to feed on as many people as they can.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Conversion&lt;/strong&gt;&lt;br/&gt;\nPureblood Vampires are born and grow old like mortals do. It&amp;#39;s unknown if they die of old age as there&amp;#39;s been no record of a Pureblood Vampire ever doing so. Greater Vampires are created when a Pureblood Vampire drinks about two-thirds of their victim&amp;#39;s blood and then the victim feasts on the vampire&amp;#39;s own blood. Weather or not a pact is formed between the two is decided upon beforehand, if so then the victim will be bound to the vampire&amp;#39;s every command. Lesser Vampires are created the same way only by Greater Vampires rather then Purebloods.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Morality Shifts&lt;/strong&gt;\nWhen someone is converted to a vampire their morality and personality remains the same. However, Greater and Lesser Vampires always have the desire to feed and if they do not answer it by their own free will then their predatory side takes over and will do anything to feed. It also has the unfortunate side-effect of desiring to feast on the blood of those closest to the vampire first.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Super Powers&lt;/strong&gt;&lt;br/&gt;\nAll three get:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Super speed.&lt;/li&gt;\n&lt;li&gt;Super strength.&lt;/li&gt;\n&lt;li&gt;Greatly enhances senses.&lt;/li&gt;\n&lt;li&gt;The ability to turn into bats.&lt;/li&gt;\n&lt;li&gt;Fast regeneration.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Greater and Purebloods get:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The ability to fly and hover at will.&lt;/li&gt;\n&lt;li&gt;Mind control abilities.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Purebloods get:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Thea ability to teleport short distances.&lt;/li&gt;\n&lt;li&gt;The ability to turn into a shadow.&lt;/li&gt;\n&lt;li&gt;The ability to turn into a large hound.&lt;/li&gt;\n&lt;li&gt;Enhanced mind control abilities, even passive ones.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Weaknesses&lt;/strong&gt;\nAll tree vampires can be killed by mortal weapons, however silver weapons prevents a Greater or Lesser vampire&amp;#39;s wounds from healing for several hours. All what is required to kill a vampire is to destroy the brain and heart. Pureblood vampires can stand sunlight however direct sunlight irritates exposed skin and their eyes. Greater Vampires suffer more from this then Purebloods and a lesser vampire&amp;#39;s skin starts to burn if exposed for more then a few minutes. Their powers are also weakened in sunlight.&lt;/p&gt;\n\n&lt;p&gt;Holy items and symbols can keep vampires at bay or even harm them, so long as the user&amp;#39;s belief in those items is greater then the vampire&amp;#39;s disbelief in them.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Appearances&lt;/strong&gt;&lt;br/&gt;\nGreater and Lesser vampires are identical to their previous selves, however their skin grows pale and they&amp;#39;re cold to the touch. When they go predatory their eyes change to a red or black colour. Pureblood vampires are often considered to be quite attractive (although that could be due to passive mind control). They look close to humans, however, their skin is usually a pale green in colour, their ears are pointed and their eyes are slit much like a cat&amp;#39;s and are coloured red or magenta.&lt;/p&gt;\n\n&lt;p&gt;So, can a vampire be a good person? Yes. However, for purebloods it&amp;#39;s easiest due to their greater control, restraint and often easier access to blood fruit. For Greater and Lesser vampires it becomes difficult, especially at night after a period of not feasting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9mq28", "score_hidden": false, "stickied": false, "created": 1492227442.0, "created_utc": 1492198642.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dg9k5oe", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Arakkoa_", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "* They need blood to stay sane, but too much and they go crazy in the other direction. A vampire starved of blood will turn into a psychopathic killer who hunts anyone weak enough. They start slouching, hissing, their fangs and claws grow out of control - from someone who looks vaguely human, they begin turning into a Nosferatu. If they overdose, the hunger starts overcoming them too, but they remain normal looking (even their skin color begins approaching normal human appearance), but their sanity slips. They become more paranoid and more deluded about their own power and influence. They start killing hundreds, but with the appearance of sophistication.\n* It's a bit of hunger, mixed with a bit of addiction. They do need that blood (as mentioned above) but they can contain themselves and often will, to appear more human - something they crave more than blood. The illusion of being something more than human, above the best of what humans can do, in terms of both culture and ability.\n* On most worlds, the curse of vampirism arises separately. Someone who learns a lot of dark magic starts using it to prolong their life. It starts with just one victim to get those extra twenty years, but it turns into an addiction and eventually all the necromantic energies mutate them into a vampire prime, a dangerous, deranged and monstrous-looking creature whose bites turn people into higher vampires. Higher vampires turn people into lower rank vampires (or rarely, another higher vampire) etc, until you reach the level of bestial, skulking \"nosferatus\" who can only kill people, not turn them.\n* The vampire keeps their soul, but the evil and death they cause stains the soul. It's technically no longer a soul, but a wraith, one tied to a mortal(ish) body, which doesn't usually happen (wraiths are usually spirits of long deceased mortals who went insane after death). It's that wraithly hunger that really drives their blood craving. The personality shifts towards a self-obsessed maniac who doesn't care for anyone but his own superiority. Some people take a long time and resist the change, but if they're not destroyed or somehow cured (very, very rare) they will always turn sooner or later.\n* Vampires regenerate a lot faster and a lot more than a normal person (they can survive almost anything, except for total incineration and a few other things), as long as they're well fed. They also become stronger and faster than your average human (or whatever else they were before). Depending on vampire, they can get to demigodly or godly levels of power. While hypnotic, shapeshifting and otherwise magical powers are not innate, many vampires (at least the mid-level ones) learn them anyway.\n* Sunlight, life magic and holy magic weaken them. They do not have a particular weakness to fire, but total incineration is one of the few ways to destroy them for good. They cannot enter a house uninvited due to a deep compulsion. They cannot cross running water (unless using a bridge or a boat). They don't have any particular feelings about garlic or crosses, unless one of these was actually consecrated.\n* It varies from vampire to vampire. The vampire prime is a true monstrosity - a hulking, deranged monster with large wings, an almost bat-like face and long claws and fangs. Higher vampires are usually very human-looking, if somewhat pale and \"dry\" looking. Lower level vampire have a descending hierarchy between the still rather human middle vampires, emaciated servitor vampires and skulking, bestial nosferatus.\n\nAny \"good\" vampire is either pretending or still fresh enough to not have settled into it yet. They may be lying to themselves as well and actually doing good deeds, but deep inside they're doing it just to look better than you, \"more than human\". And they still need that blood, which they can't get without killing people. It's the transfer of life that feeds them.\n\nThey can be friendly just fine, though. A powerful faction of vampire monarchs rules a world on the other side of the known space and enjoys friendly relations with galactic powers. Everyone knows about the atrocities committed in their realms, but as long as they're not touching us and are actually helping...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;They need blood to stay sane, but too much and they go crazy in the other direction. A vampire starved of blood will turn into a psychopathic killer who hunts anyone weak enough. They start slouching, hissing, their fangs and claws grow out of control - from someone who looks vaguely human, they begin turning into a Nosferatu. If they overdose, the hunger starts overcoming them too, but they remain normal looking (even their skin color begins approaching normal human appearance), but their sanity slips. They become more paranoid and more deluded about their own power and influence. They start killing hundreds, but with the appearance of sophistication.&lt;/li&gt;\n&lt;li&gt;It&amp;#39;s a bit of hunger, mixed with a bit of addiction. They do need that blood (as mentioned above) but they can contain themselves and often will, to appear more human - something they crave more than blood. The illusion of being something more than human, above the best of what humans can do, in terms of both culture and ability.&lt;/li&gt;\n&lt;li&gt;On most worlds, the curse of vampirism arises separately. Someone who learns a lot of dark magic starts using it to prolong their life. It starts with just one victim to get those extra twenty years, but it turns into an addiction and eventually all the necromantic energies mutate them into a vampire prime, a dangerous, deranged and monstrous-looking creature whose bites turn people into higher vampires. Higher vampires turn people into lower rank vampires (or rarely, another higher vampire) etc, until you reach the level of bestial, skulking &amp;quot;nosferatus&amp;quot; who can only kill people, not turn them.&lt;/li&gt;\n&lt;li&gt;The vampire keeps their soul, but the evil and death they cause stains the soul. It&amp;#39;s technically no longer a soul, but a wraith, one tied to a mortal(ish) body, which doesn&amp;#39;t usually happen (wraiths are usually spirits of long deceased mortals who went insane after death). It&amp;#39;s that wraithly hunger that really drives their blood craving. The personality shifts towards a self-obsessed maniac who doesn&amp;#39;t care for anyone but his own superiority. Some people take a long time and resist the change, but if they&amp;#39;re not destroyed or somehow cured (very, very rare) they will always turn sooner or later.&lt;/li&gt;\n&lt;li&gt;Vampires regenerate a lot faster and a lot more than a normal person (they can survive almost anything, except for total incineration and a few other things), as long as they&amp;#39;re well fed. They also become stronger and faster than your average human (or whatever else they were before). Depending on vampire, they can get to demigodly or godly levels of power. While hypnotic, shapeshifting and otherwise magical powers are not innate, many vampires (at least the mid-level ones) learn them anyway.&lt;/li&gt;\n&lt;li&gt;Sunlight, life magic and holy magic weaken them. They do not have a particular weakness to fire, but total incineration is one of the few ways to destroy them for good. They cannot enter a house uninvited due to a deep compulsion. They cannot cross running water (unless using a bridge or a boat). They don&amp;#39;t have any particular feelings about garlic or crosses, unless one of these was actually consecrated.&lt;/li&gt;\n&lt;li&gt;It varies from vampire to vampire. The vampire prime is a true monstrosity - a hulking, deranged monster with large wings, an almost bat-like face and long claws and fangs. Higher vampires are usually very human-looking, if somewhat pale and &amp;quot;dry&amp;quot; looking. Lower level vampire have a descending hierarchy between the still rather human middle vampires, emaciated servitor vampires and skulking, bestial nosferatus.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Any &amp;quot;good&amp;quot; vampire is either pretending or still fresh enough to not have settled into it yet. They may be lying to themselves as well and actually doing good deeds, but deep inside they&amp;#39;re doing it just to look better than you, &amp;quot;more than human&amp;quot;. And they still need that blood, which they can&amp;#39;t get without killing people. It&amp;#39;s the transfer of life that feeds them.&lt;/p&gt;\n\n&lt;p&gt;They can be friendly just fine, though. A powerful faction of vampire monarchs rules a world on the other side of the known space and enjoys friendly relations with galactic powers. Everyone knows about the atrocities committed in their realms, but as long as they&amp;#39;re not touching us and are actually helping...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9k5oe", "score_hidden": false, "stickied": false, "created": 1492224345.0, "created_utc": 1492195545.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dga3vo4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fylum", "parent_id": "t1_dga1p8x", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "I wanted to make them a disease at first, but it seemed hard to justify a culture and language for a disease. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wanted to make them a disease at first, but it seemed hard to justify a culture and language for a disease. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dga3vo4", "score_hidden": false, "stickied": false, "created": 1492249714.0, "created_utc": 1492220914.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga1p8x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "skogsherre", "parent_id": "t1_dg9l5fw", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "What made you decide to go with vampires as their own race?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What made you decide to go with vampires as their own race?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dga1p8x", "score_hidden": false, "stickied": false, "created": 1492246716.0, "created_utc": 1492217916.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9l5fw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fylum", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Vampires are a race distantly related to humanity, and very closely related to the Aepen (elf-analogues, themselves related to humanity) - some classify them as a subspecies.  If the Aepen, a rather rare race, were asked what level of rareness they were on, vampires would respond with, \"you are like a little baby, watch this\" and then establish a global population of less than 10k.  \n**Blood Requirement and Craving**  \nThey *do* require blood; whence that blood comes is insignificant.  They feed at regular intervals, roughly monthly, and tend to drink a good bit during that time.  It's a hunger just like you or I would feel.  Generally, they'd bite at the jugular and drink normally, making it a rather messy affair and necessitating sharp teeth.  \n**Conversion** \nHumans reproduce humans.  Aepen reproduce aepen.  Vampires reproduce vampires.  They are all capable of producing hybrids amongst themselves, though human-vampire hybrids are *exceptionally* rare, and tend to be infertile.  \n**Morality shifts**  \nA vampire has morals that are reflective of the society in which it was raised.  A vampire, like a human, is not inherently good or evil, it's just another intelligent being.  \n**Superpowers**  \nVampires have excellent night vision, retaining a tapetum lucidum, and are nocturnal by nature.  Aepen also possess this, though it is very degenerate.  They also tend to be slightly taller than both humans and aepen, and are often thinner, with long legs and arms.  Their ears are also highly sensitive and can be \"wiggled\".  They are *very* good runners and climbers.  \n**Weaknesses**  \nThey, like their relatives the Aepen, are pale and mottled, though they are even paler yet.  This contributes to their high photosensitivity, and high skin cancer rates within the vampire population.  \n**Appearances**  \nVampires resemble tall, thin, lanky humans in physical appearance.  Their ears are quite large and fan out to a point, and their eyes tend to be larger, though with the same color variations as you or I.  Their mouths are wide, and their teeth are very sharp.  They have hair in the same way that we do.  Their skin is exceptionally pale, and tends to be mottled.  Their hands are large, and their fingers are long and strong, and their toes are more dexterous than ours or an Aepen's.  Overall, almost goofy looking.  \n  \nGenerally, they are becoming increasingly accepted within their host human societies; the two major populations (representing upwards of 70% of all vampires globally) are in the interior highlands of Tempius, and deep in the deserts of Allas along some remote rivers.  Outside of these places, they generally live in the dense boreal forests of the continent of Vittepia (~20% of the global population); the remainder live scattered elsewhere globally.  While there was once a tree of vampire languages, most are either extinct or have devolved into creoles with their respective local human languages.  Similarly, they maintain their own cultural traditions and (to a lesser extent) religious practices, though these have been strongly influenced by the dominant local human culture.  The Tempians tend to like them, and within the Tempian military there are several reconnaissance companies composed wholly or in part of vampires.", "edited": 1492197008.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Vampires are a race distantly related to humanity, and very closely related to the Aepen (elf-analogues, themselves related to humanity) - some classify them as a subspecies.  If the Aepen, a rather rare race, were asked what level of rareness they were on, vampires would respond with, &amp;quot;you are like a little baby, watch this&amp;quot; and then establish a global population of less than 10k.&lt;br/&gt;\n&lt;strong&gt;Blood Requirement and Craving&lt;/strong&gt;&lt;br/&gt;\nThey &lt;em&gt;do&lt;/em&gt; require blood; whence that blood comes is insignificant.  They feed at regular intervals, roughly monthly, and tend to drink a good bit during that time.  It&amp;#39;s a hunger just like you or I would feel.  Generally, they&amp;#39;d bite at the jugular and drink normally, making it a rather messy affair and necessitating sharp teeth.&lt;br/&gt;\n&lt;strong&gt;Conversion&lt;/strong&gt; \nHumans reproduce humans.  Aepen reproduce aepen.  Vampires reproduce vampires.  They are all capable of producing hybrids amongst themselves, though human-vampire hybrids are &lt;em&gt;exceptionally&lt;/em&gt; rare, and tend to be infertile.&lt;br/&gt;\n&lt;strong&gt;Morality shifts&lt;/strong&gt;&lt;br/&gt;\nA vampire has morals that are reflective of the society in which it was raised.  A vampire, like a human, is not inherently good or evil, it&amp;#39;s just another intelligent being.&lt;br/&gt;\n&lt;strong&gt;Superpowers&lt;/strong&gt;&lt;br/&gt;\nVampires have excellent night vision, retaining a tapetum lucidum, and are nocturnal by nature.  Aepen also possess this, though it is very degenerate.  They also tend to be slightly taller than both humans and aepen, and are often thinner, with long legs and arms.  Their ears are also highly sensitive and can be &amp;quot;wiggled&amp;quot;.  They are &lt;em&gt;very&lt;/em&gt; good runners and climbers.&lt;br/&gt;\n&lt;strong&gt;Weaknesses&lt;/strong&gt;&lt;br/&gt;\nThey, like their relatives the Aepen, are pale and mottled, though they are even paler yet.  This contributes to their high photosensitivity, and high skin cancer rates within the vampire population.&lt;br/&gt;\n&lt;strong&gt;Appearances&lt;/strong&gt;&lt;br/&gt;\nVampires resemble tall, thin, lanky humans in physical appearance.  Their ears are quite large and fan out to a point, and their eyes tend to be larger, though with the same color variations as you or I.  Their mouths are wide, and their teeth are very sharp.  They have hair in the same way that we do.  Their skin is exceptionally pale, and tends to be mottled.  Their hands are large, and their fingers are long and strong, and their toes are more dexterous than ours or an Aepen&amp;#39;s.  Overall, almost goofy looking.  &lt;/p&gt;\n\n&lt;p&gt;Generally, they are becoming increasingly accepted within their host human societies; the two major populations (representing upwards of 70% of all vampires globally) are in the interior highlands of Tempius, and deep in the deserts of Allas along some remote rivers.  Outside of these places, they generally live in the dense boreal forests of the continent of Vittepia (~20% of the global population); the remainder live scattered elsewhere globally.  While there was once a tree of vampire languages, most are either extinct or have devolved into creoles with their respective local human languages.  Similarly, they maintain their own cultural traditions and (to a lesser extent) religious practices, though these have been strongly influenced by the dominant local human culture.  The Tempians tend to like them, and within the Tempian military there are several reconnaissance companies composed wholly or in part of vampires.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9l5fw", "score_hidden": false, "stickied": false, "created": 1492225544.0, "created_utc": 1492196744.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dg9my6o", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TimeRelic", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Well I like my vampires Evil and well suited to a horror story, so:\n\n* *Blood Requirement*: They can technically go without blood indefinitely, but they gradually expend their vitality, such that after a few years of constant activity without blood they will mummify, and become largely inert. They can be resurrected from this state at any time by exposure to blood. Typically they start hibernating before that happens, so they can come back decades, or even centuries, later without a significant loss in vitality. This feeds into how they hunt. They wake up, slaughter a few people in one place, travel to a new location, hibernate for a generation or two, repeat.\n\n* *Craving Type*: They experience hunger and thirst at gradually compounding rate. They can easily sate their appetite on any animals they please, but that won't address the root of the problem. The main reason they crave human lifeblood is the unending agony that an undead suffers from. People often assume that because a vampire doesn't react to being stabbed or shot, that it can't feel pain. Really vampires are in constant agony that they can't tell they've been injured. The only thing that can dull this pain for a short while is the vitality they gain from the lifeblood of the innocent. \n\n* *Conversion*: No conversion takes place. Each vampire is risen the way it dies: alone, and consumed by fear. Vampires are the corpses of those possessed by such a great fear of death that they were able to pervert both themselves and nature merely to stave it off. \n\n* *Morality Shifts*: To have been so completely consumed by fear and pain leaves them without the capacity for guilt or compassion, among other more positive emotions. It's not that they don't remember who they were before they rose, they are simply incapable of feeling attachment to others, or prior moral codes. They might initially seek out loved ones for comfort and reassurance, but in time they will realize they can't feel either. They will then feast upon those that used to mean so much to them, and begin their reign of terror.\n\n* *Superpowers*: Infinite longevity, a natural proficiency at curses, and resilience to both blunt and point force trauma. They also possess super-speed, super-strength, and shape-shifting abilities proportionate to their vitality at the time.\n\n* *Weaknesses*: Fire, dismemberment, garlic, running water, and sincerely held icons of faith.\n\n* *Appearance*: Highly variable. They start out as merely an animated corpse, but gradually shift to reflect their own self-image and expectations of what the undead should look like. Typically this results in very ugly vampires.\n\nSo yeah, if you are the kind of person willing to throw away everything that makes life worth living in order to avoid death, then you probably aren't the nicest person around. Even if you were, you probably wouldn't be for long, after you learn that killing people is the only way to make the pain stop.\n\nEDIT: Needless explanation that my Evil vampires are typically Evil.", "edited": 1492200178.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I like my vampires Evil and well suited to a horror story, so:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;Blood Requirement&lt;/em&gt;: They can technically go without blood indefinitely, but they gradually expend their vitality, such that after a few years of constant activity without blood they will mummify, and become largely inert. They can be resurrected from this state at any time by exposure to blood. Typically they start hibernating before that happens, so they can come back decades, or even centuries, later without a significant loss in vitality. This feeds into how they hunt. They wake up, slaughter a few people in one place, travel to a new location, hibernate for a generation or two, repeat.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;Craving Type&lt;/em&gt;: They experience hunger and thirst at gradually compounding rate. They can easily sate their appetite on any animals they please, but that won&amp;#39;t address the root of the problem. The main reason they crave human lifeblood is the unending agony that an undead suffers from. People often assume that because a vampire doesn&amp;#39;t react to being stabbed or shot, that it can&amp;#39;t feel pain. Really vampires are in constant agony that they can&amp;#39;t tell they&amp;#39;ve been injured. The only thing that can dull this pain for a short while is the vitality they gain from the lifeblood of the innocent. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;Conversion&lt;/em&gt;: No conversion takes place. Each vampire is risen the way it dies: alone, and consumed by fear. Vampires are the corpses of those possessed by such a great fear of death that they were able to pervert both themselves and nature merely to stave it off. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;Morality Shifts&lt;/em&gt;: To have been so completely consumed by fear and pain leaves them without the capacity for guilt or compassion, among other more positive emotions. It&amp;#39;s not that they don&amp;#39;t remember who they were before they rose, they are simply incapable of feeling attachment to others, or prior moral codes. They might initially seek out loved ones for comfort and reassurance, but in time they will realize they can&amp;#39;t feel either. They will then feast upon those that used to mean so much to them, and begin their reign of terror.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;Superpowers&lt;/em&gt;: Infinite longevity, a natural proficiency at curses, and resilience to both blunt and point force trauma. They also possess super-speed, super-strength, and shape-shifting abilities proportionate to their vitality at the time.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;Weaknesses&lt;/em&gt;: Fire, dismemberment, garlic, running water, and sincerely held icons of faith.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;Appearance&lt;/em&gt;: Highly variable. They start out as merely an animated corpse, but gradually shift to reflect their own self-image and expectations of what the undead should look like. Typically this results in very ugly vampires.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;So yeah, if you are the kind of person willing to throw away everything that makes life worth living in order to avoid death, then you probably aren&amp;#39;t the nicest person around. Even if you were, you probably wouldn&amp;#39;t be for long, after you learn that killing people is the only way to make the pain stop.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Needless explanation that my Evil vampires are typically Evil.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9my6o", "score_hidden": false, "stickied": false, "created": 1492227712.0, "created_utc": 1492198912.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dg9wide", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Geckoface", "parent_id": "t1_dg9vway", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "They'd hug you back like their life depends on it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;d hug you back like their life depends on it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9wide", "score_hidden": false, "stickied": false, "created": 1492239819.0, "created_utc": 1492211019.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9vway", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MrManicMarty", "parent_id": "t1_dg9v8xv", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Aww, that's really cute! And sad. I want to give your vampires a hug now!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aww, that&amp;#39;s really cute! And sad. I want to give your vampires a hug now!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9vway", "score_hidden": false, "stickied": false, "created": 1492238996.0, "created_utc": 1492210196.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9v8xv", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Geckoface", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "THAUM!'s vampires are absolutely a full 10 on the Friend-O-Meter. \n\nThey're a minor form of undead, really suffering from a magical disease called cardiac solanecrosis: heart death due to loneliness, more commonly called Heart Rot, or, medically, Stoker's Disease\n\n**Blood requirement**: Low to none. Solanecrosis patients require positive lifeforce to keep their hearts alive, and due to their affliction cannot create any of their own. This makes them completely reliable on the lifeforce of others. Normally, they are not parasitic, but rather commensalistic: they live off of the lifeforce naturally radiated by happy people, with no averse effects. They're often able to live normal lives if they have happy neighbours and get an ample amount of hugs. However, a starved vampire can react in a variety of ways. \n\n**Craving type:** When depraved of a source of lifeforce for a short period, such as a few days, vampires might feel minor heart strain, nausea, and lightheadedness, which increase to muscle pains, cramps, and severe heartache for longer periods. When deprived for extremely long periods - over four months - most vampires isolate themselves and waste away, dying quietly of heart failure. However, there is a small group that reacts the opposite way, becoming feral and hunting for lifeforce on instinct, resorting to assaulting people and attempting to drink their blood. These cases are rare, and the attacks nonfatal, but are still the most widely remembered aspect of the disease. \n\n**Conversion:** The disease is not infectious, nor does biting transmit it. Like cancer, each instance is unique, and can be triggered either by extreme loneliness for prolonged periods, extreme emotional stress or trauma, or simply a metaphysical malfunction of the body. \n\n**Morality shifts:** There is no shift in personality caused directly by the disease, though the affliction usually occurs in people with shared personalities - either reclusive tendencies or social ineptness. These often clash with the vampire's 'hunger' to be among people. \n\n**Super powers:** None, though solanecrosis is known to make mundane people aware to magic.\n\n**Weaknesses:** None. The name is often misinterpreted to mean 'dies in sunlight', but the 'sola' in solanecrosis means 'loneliness', and is unrelated to 'solar'. 'Solar necrosis' is a common misspelling of the name. \n\n**Appearances:** Vampires share many physical traits: the affliction of the heart usually leaves them pale and lanky, while passage of lifeforce through the body's energy points usually turns their eyes and nail beds lightish red, or full red for a well-fed vampire. The veins on their chest around their heart turn black, which spreads over the rest of the body depending on the severity of their condition.\n\nOverall, well-fed solanecrosis sufferers make for pleasant, caring neighbours, that often go out of their way to help the people they're dependent on. ", "edited": 1492209715.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;THAUM!&amp;#39;s vampires are absolutely a full 10 on the Friend-O-Meter. &lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;re a minor form of undead, really suffering from a magical disease called cardiac solanecrosis: heart death due to loneliness, more commonly called Heart Rot, or, medically, Stoker&amp;#39;s Disease&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Blood requirement&lt;/strong&gt;: Low to none. Solanecrosis patients require positive lifeforce to keep their hearts alive, and due to their affliction cannot create any of their own. This makes them completely reliable on the lifeforce of others. Normally, they are not parasitic, but rather commensalistic: they live off of the lifeforce naturally radiated by happy people, with no averse effects. They&amp;#39;re often able to live normal lives if they have happy neighbours and get an ample amount of hugs. However, a starved vampire can react in a variety of ways. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Craving type:&lt;/strong&gt; When depraved of a source of lifeforce for a short period, such as a few days, vampires might feel minor heart strain, nausea, and lightheadedness, which increase to muscle pains, cramps, and severe heartache for longer periods. When deprived for extremely long periods - over four months - most vampires isolate themselves and waste away, dying quietly of heart failure. However, there is a small group that reacts the opposite way, becoming feral and hunting for lifeforce on instinct, resorting to assaulting people and attempting to drink their blood. These cases are rare, and the attacks nonfatal, but are still the most widely remembered aspect of the disease. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Conversion:&lt;/strong&gt; The disease is not infectious, nor does biting transmit it. Like cancer, each instance is unique, and can be triggered either by extreme loneliness for prolonged periods, extreme emotional stress or trauma, or simply a metaphysical malfunction of the body. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Morality shifts:&lt;/strong&gt; There is no shift in personality caused directly by the disease, though the affliction usually occurs in people with shared personalities - either reclusive tendencies or social ineptness. These often clash with the vampire&amp;#39;s &amp;#39;hunger&amp;#39; to be among people. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Super powers:&lt;/strong&gt; None, though solanecrosis is known to make mundane people aware to magic.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Weaknesses:&lt;/strong&gt; None. The name is often misinterpreted to mean &amp;#39;dies in sunlight&amp;#39;, but the &amp;#39;sola&amp;#39; in solanecrosis means &amp;#39;loneliness&amp;#39;, and is unrelated to &amp;#39;solar&amp;#39;. &amp;#39;Solar necrosis&amp;#39; is a common misspelling of the name. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Appearances:&lt;/strong&gt; Vampires share many physical traits: the affliction of the heart usually leaves them pale and lanky, while passage of lifeforce through the body&amp;#39;s energy points usually turns their eyes and nail beds lightish red, or full red for a well-fed vampire. The veins on their chest around their heart turn black, which spreads over the rest of the body depending on the severity of their condition.&lt;/p&gt;\n\n&lt;p&gt;Overall, well-fed solanecrosis sufferers make for pleasant, caring neighbours, that often go out of their way to help the people they&amp;#39;re dependent on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9v8xv", "score_hidden": false, "stickied": false, "created": 1492238119.0, "created_utc": 1492209319.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dg9pq5w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "skogsherre", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "TBH the vampires in my setting are basically a gothier stand-in for elves - being a magical, immortal demi-human race with a huge superiority complex. A lot of my inspiration was the Vampire Counts from Warhammer Fantasy (especially Vlad von Carstein) - kind of assholes but in the end they're tolerated by their human subjects because honestly things could be waaaaay worse.\n\nI do enjoy playing with the uneasy symbiotic relationship between vampires and humans. Vampires do have to rely on humans for blood, but they also can offer the \"gift\" of lesser vampirism to maintain a retinue of loyal underlings. They're sort of evil in the sense that vampires openly run their own country (the Gotha-Styrian Empire) which is fairly aggressive and expansionistic. The Empire is about 95% human however, so if they were completely evil and hated they would have gone extinct a long time ago. \n\n**Blood Requirement:** They need to feed about once a month or so. They don't have to kill people. Rat's blood also can work as a lower quality substitute, some vampires breed rats for the same purpose (and \"rat eater\" is a vampire insult). \n\n**Craving type:** They straight up die if they don't get blood long enough, so it's the same sort of craving you or I would have for food.\n\n**Conversion:** Vampires are their own separate race, it's not possible to turn into a true vampire. I do have the concept of a \"lesser vampire\", essentially a human who has drank vampire blood and temporarily gained some of their powers (and weaknesses).\n\n**Morality shifts:** There's no inherent morality shift since vampires are their own race. Since they're immortal and prey on humans, they almost always look down on people. This can range from a patronizing sense of care to \"humans are nothing more than cattle\". They also tend to love power and try to install themselves as rulers or nobility.\n\n**Super powers:** \n\n* Immortality - vampires stop aging after about 30 but can still die from injury or disease.\n* Healing factor - vampires are very hard to kill, they can generally shrug off being shot, stabbed, hit by a car, falling off a building, diseases that will kill most men, etc. If they take enough injury they go into a comatose state for a while, giving the misconception that they're undead.\n* Super strength and speed - the average vampire is about Olympic athlete levels of strong and fast.\n* Night vision - Vampires have good nocturnal eyesight but they have poor color vision. Probably why they usually wear black and other muted colors.\n* Witchcraft - not inherent, but vampires are more commonly born with the ability to use magic compared to humans and are stronger witches.\n* Magical radiation - The idea with my setting is that vampires are a magical race that passively emit and aura of magical power. This has the effect of slowly warping and twisting the areas they live in (so everything ends up looking like Transylvania), and mutating humans as well.\n\n\n**Weaknesses:** \n\n* Sunlight - Causes severe fatigue and first degree burns. Also weakens their healing factor, making them much easier to kill in the daytime. A few hours of direct exposure will kill them.\n* Silver and garlic - Severely allergic, will cause anaphylactic shock.\n* Fire - Dampens their healing factor enough to kill them.\n* Decapitation or destruction of the heart - In fairness this will kill everything. \n\n**Appearances:** they're basically more ethereal looking humans, with pale skin, pointy ears and fangs, uniformly black hair, and amber or red eyes. They also have a pair of bat-like wings sprouting out of their back. They're also *all* female. Vampires are fairly tall with the average height being 5' 9\".", "edited": 1492217850.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;TBH the vampires in my setting are basically a gothier stand-in for elves - being a magical, immortal demi-human race with a huge superiority complex. A lot of my inspiration was the Vampire Counts from Warhammer Fantasy (especially Vlad von Carstein) - kind of assholes but in the end they&amp;#39;re tolerated by their human subjects because honestly things could be waaaaay worse.&lt;/p&gt;\n\n&lt;p&gt;I do enjoy playing with the uneasy symbiotic relationship between vampires and humans. Vampires do have to rely on humans for blood, but they also can offer the &amp;quot;gift&amp;quot; of lesser vampirism to maintain a retinue of loyal underlings. They&amp;#39;re sort of evil in the sense that vampires openly run their own country (the Gotha-Styrian Empire) which is fairly aggressive and expansionistic. The Empire is about 95% human however, so if they were completely evil and hated they would have gone extinct a long time ago. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Blood Requirement:&lt;/strong&gt; They need to feed about once a month or so. They don&amp;#39;t have to kill people. Rat&amp;#39;s blood also can work as a lower quality substitute, some vampires breed rats for the same purpose (and &amp;quot;rat eater&amp;quot; is a vampire insult). &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Craving type:&lt;/strong&gt; They straight up die if they don&amp;#39;t get blood long enough, so it&amp;#39;s the same sort of craving you or I would have for food.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Conversion:&lt;/strong&gt; Vampires are their own separate race, it&amp;#39;s not possible to turn into a true vampire. I do have the concept of a &amp;quot;lesser vampire&amp;quot;, essentially a human who has drank vampire blood and temporarily gained some of their powers (and weaknesses).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Morality shifts:&lt;/strong&gt; There&amp;#39;s no inherent morality shift since vampires are their own race. Since they&amp;#39;re immortal and prey on humans, they almost always look down on people. This can range from a patronizing sense of care to &amp;quot;humans are nothing more than cattle&amp;quot;. They also tend to love power and try to install themselves as rulers or nobility.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Super powers:&lt;/strong&gt; &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Immortality - vampires stop aging after about 30 but can still die from injury or disease.&lt;/li&gt;\n&lt;li&gt;Healing factor - vampires are very hard to kill, they can generally shrug off being shot, stabbed, hit by a car, falling off a building, diseases that will kill most men, etc. If they take enough injury they go into a comatose state for a while, giving the misconception that they&amp;#39;re undead.&lt;/li&gt;\n&lt;li&gt;Super strength and speed - the average vampire is about Olympic athlete levels of strong and fast.&lt;/li&gt;\n&lt;li&gt;Night vision - Vampires have good nocturnal eyesight but they have poor color vision. Probably why they usually wear black and other muted colors.&lt;/li&gt;\n&lt;li&gt;Witchcraft - not inherent, but vampires are more commonly born with the ability to use magic compared to humans and are stronger witches.&lt;/li&gt;\n&lt;li&gt;Magical radiation - The idea with my setting is that vampires are a magical race that passively emit and aura of magical power. This has the effect of slowly warping and twisting the areas they live in (so everything ends up looking like Transylvania), and mutating humans as well.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Weaknesses:&lt;/strong&gt; &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Sunlight - Causes severe fatigue and first degree burns. Also weakens their healing factor, making them much easier to kill in the daytime. A few hours of direct exposure will kill them.&lt;/li&gt;\n&lt;li&gt;Silver and garlic - Severely allergic, will cause anaphylactic shock.&lt;/li&gt;\n&lt;li&gt;Fire - Dampens their healing factor enough to kill them.&lt;/li&gt;\n&lt;li&gt;Decapitation or destruction of the heart - In fairness this will kill everything. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Appearances:&lt;/strong&gt; they&amp;#39;re basically more ethereal looking humans, with pale skin, pointy ears and fangs, uniformly black hair, and amber or red eyes. They also have a pair of bat-like wings sprouting out of their back. They&amp;#39;re also &lt;em&gt;all&lt;/em&gt; female. Vampires are fairly tall with the average height being 5&amp;#39; 9&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9pq5w", "score_hidden": false, "stickied": false, "created": 1492231056.0, "created_utc": 1492202256.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dg9uvtp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DaneLimmish", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Um...kinda like Nosferatu.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Um...kinda like Nosferatu.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9uvtp", "score_hidden": false, "stickied": false, "created": 1492237625.0, "created_utc": 1492208825.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dgafzez", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "the_vizir", "parent_id": "t1_dg9y42w", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Does your world have any of the typical vampire myths at all, even if they are technically all bunk? Or did you come up with some own myths of your own for villagers to whisper around the campirefire at night?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does your world have any of the typical vampire myths at all, even if they are technically all bunk? Or did you come up with some own myths of your own for villagers to whisper around the campirefire at night?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dgafzez", "score_hidden": false, "stickied": false, "created": 1492272235.0, "created_utc": 1492243435.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9y42w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RuneWarp", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Vampires are really just human sangromancers that get corrupted and warped by blood magic. They use this magic to prolong their lives, because they believe that blood has a concentration of mana. They are pale humans with white hair, red eyes and fangs.\n\nGarlic? Doesn't do shit to them.\n\nCrosses? Does nothing.\n\nSunlight? They avoid it because it's best to work in the shadows and they look very distinctive, but it doesn't actually harm them.\n\nA stake to the heart will kill them, but let's be honest, who wouldn't die to that?\n\nIn terms of strengths, they are very strong, can detect mana, have powerful blood magic (sangromancy) and live for long periods of time.\n\nIn terms of weaknesses, they have a bloodlust that can be their downfall if manipulated. They die to regular means, but due to their increased strength, normal cuts just aren't enough. Decapitation is usually ideal.\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Vampires are really just human sangromancers that get corrupted and warped by blood magic. They use this magic to prolong their lives, because they believe that blood has a concentration of mana. They are pale humans with white hair, red eyes and fangs.&lt;/p&gt;\n\n&lt;p&gt;Garlic? Doesn&amp;#39;t do shit to them.&lt;/p&gt;\n\n&lt;p&gt;Crosses? Does nothing.&lt;/p&gt;\n\n&lt;p&gt;Sunlight? They avoid it because it&amp;#39;s best to work in the shadows and they look very distinctive, but it doesn&amp;#39;t actually harm them.&lt;/p&gt;\n\n&lt;p&gt;A stake to the heart will kill them, but let&amp;#39;s be honest, who wouldn&amp;#39;t die to that?&lt;/p&gt;\n\n&lt;p&gt;In terms of strengths, they are very strong, can detect mana, have powerful blood magic (sangromancy) and live for long periods of time.&lt;/p&gt;\n\n&lt;p&gt;In terms of weaknesses, they have a bloodlust that can be their downfall if manipulated. They die to regular means, but due to their increased strength, normal cuts just aren&amp;#39;t enough. Decapitation is usually ideal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9y42w", "score_hidden": false, "stickied": false, "created": 1492241935.0, "created_utc": 1492213135.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dgahaec", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "aliendude777", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "In **Spelljack**...\n\nVampirism is an inability of the Animus to convert ambient magical energy into essentia, which the soul needs to live. Thus, they must take essentia (often through blood, but other transfer methods exist) from other living beings.\n\n* Blood requirement: Most vampires only need a thimbleful on average, and those who would require more blood than could be safely consumed will opt for an alternate transfer method.\n\n* Craving type: Non existent. Vampires only 'crave' blood the same way another person might 'crave' medication. It's just something they need to do to survive.\n\n* Conversion: Vampirism can happen whenever the Animus is damaged, typically during magically caused soul burn.\n\n* Morality shifts: None.\n\n* Superpowers: None, but it's worth noting that therianthropes (werewolves, werecats, other werecreatures) are more susceptible to vampirism.\n\n* Weaknesses: If they don't get enough essentia, vampires will be at risk for Wither, where the soul is starved, and they lose there ability to affect fate.\n\n* Appearances: Vampires are no more or less handsome than they were before they contracted vampirism. They do not gain pointed teeth.\n\nVampirism doesn't really affect morality. In Spelljack, vampirism is more akin to diabetes than a horrifying curse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In &lt;strong&gt;Spelljack&lt;/strong&gt;...&lt;/p&gt;\n\n&lt;p&gt;Vampirism is an inability of the Animus to convert ambient magical energy into essentia, which the soul needs to live. Thus, they must take essentia (often through blood, but other transfer methods exist) from other living beings.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Blood requirement: Most vampires only need a thimbleful on average, and those who would require more blood than could be safely consumed will opt for an alternate transfer method.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Craving type: Non existent. Vampires only &amp;#39;crave&amp;#39; blood the same way another person might &amp;#39;crave&amp;#39; medication. It&amp;#39;s just something they need to do to survive.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Conversion: Vampirism can happen whenever the Animus is damaged, typically during magically caused soul burn.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Morality shifts: None.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Superpowers: None, but it&amp;#39;s worth noting that therianthropes (werewolves, werecats, other werecreatures) are more susceptible to vampirism.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Weaknesses: If they don&amp;#39;t get enough essentia, vampires will be at risk for Wither, where the soul is starved, and they lose there ability to affect fate.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Appearances: Vampires are no more or less handsome than they were before they contracted vampirism. They do not gain pointed teeth.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Vampirism doesn&amp;#39;t really affect morality. In Spelljack, vampirism is more akin to diabetes than a horrifying curse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dgahaec", "score_hidden": false, "stickied": false, "created": 1492276248.0, "created_utc": 1492247448.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dgama4s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DaSmackMan", "parent_id": "t1_dgakzu8", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "The Nephilim are cultist cannibals who believe the nuclear war was God's will and that they're the accursed tasked to cleansed the world of old. They torture and eat people who appear old enough to have survived the nuclear winter and have a pact to do it unto those of their own who too have survived it, once their duty is done.\n\nNorth America has experienced numerous migrations over the years so no one knows their origins but they're a sizable group (many brainwashed as children) who have plagued the California Imperium's (placeholder) Oregon border, and presumably elsewhere. They're​ bold about their presence, using bones and rotten body parts to mark their territory, and wear the skin of their victims during an attack.\n\nAfter taking an encampment, the Imperium's commanders are expected to kill them all;  some youth are spared and have to carry the horrors by their lonely.", "edited": 1492261568.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Nephilim are cultist cannibals who believe the nuclear war was God&amp;#39;s will and that they&amp;#39;re the accursed tasked to cleansed the world of old. They torture and eat people who appear old enough to have survived the nuclear winter and have a pact to do it unto those of their own who too have survived it, once their duty is done.&lt;/p&gt;\n\n&lt;p&gt;North America has experienced numerous migrations over the years so no one knows their origins but they&amp;#39;re a sizable group (many brainwashed as children) who have plagued the California Imperium&amp;#39;s (placeholder) Oregon border, and presumably elsewhere. They&amp;#39;re​ bold about their presence, using bones and rotten body parts to mark their territory, and wear the skin of their victims during an attack.&lt;/p&gt;\n\n&lt;p&gt;After taking an encampment, the Imperium&amp;#39;s commanders are expected to kill them all;  some youth are spared and have to carry the horrors by their lonely.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dgama4s", "score_hidden": false, "stickied": false, "created": 1492290158.0, "created_utc": 1492261358.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgakzu8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MrManicMarty", "parent_id": "t1_dgakwy8", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Go for it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dgakzu8", "score_hidden": false, "stickied": false, "created": 1492287295.0, "created_utc": 1492258495.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgakwy8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DaSmackMan", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Do cannibals count?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do cannibals count?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dgakwy8", "score_hidden": false, "stickied": false, "created": 1492287101.0, "created_utc": 1492258301.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dg9v0wv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "asterisknet", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "In my game, there are two types: Vampires and Vampiric Demons\n\nHealth potions are made from enchanting non-human blood for about a minute. However, vampires have the ability to immediately enchant the blood as they drink. Vampires are also able to drink human blood.\n\nVampiric Demons are extremely strong and are basically Vampires but with two more major abilities that make them extremely powerful:\n- Vampire Swarm: One is able to transform into a cloud of shadowy vampiric bats that drain the life force of anything they attack.\n- Dominion: Vampiric Demons each have their own Dominion, a realm where souls of any non-humans they've slain are sent to. Vampiric Demons utilize the power of the souls within their Dominion, stacking the physical abilities of each and every soul's being onto their own, significantly boosting their power. So for example, if there are 12 cows in a Vampiric Demon's Dominion, upon activation, they will have the strength, speed, and endurance of themself plus the 12 cows.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my game, there are two types: Vampires and Vampiric Demons&lt;/p&gt;\n\n&lt;p&gt;Health potions are made from enchanting non-human blood for about a minute. However, vampires have the ability to immediately enchant the blood as they drink. Vampires are also able to drink human blood.&lt;/p&gt;\n\n&lt;p&gt;Vampiric Demons are extremely strong and are basically Vampires but with two more major abilities that make them extremely powerful:\n- Vampire Swarm: One is able to transform into a cloud of shadowy vampiric bats that drain the life force of anything they attack.\n- Dominion: Vampiric Demons each have their own Dominion, a realm where souls of any non-humans they&amp;#39;ve slain are sent to. Vampiric Demons utilize the power of the souls within their Dominion, stacking the physical abilities of each and every soul&amp;#39;s being onto their own, significantly boosting their power. So for example, if there are 12 cows in a Vampiric Demon&amp;#39;s Dominion, upon activation, they will have the strength, speed, and endurance of themself plus the 12 cows.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9v0wv", "score_hidden": false, "stickied": false, "created": 1492237815.0, "created_utc": 1492209015.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dg9z8aa", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "wille179", "parent_id": "t1_dg9z3t2", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "He himself is quite horrified by it, though the total lack of body moisture makes the corpses quite flammable and easily incinerated with a single match. The force also weakens the bone, so when you add in the thermal stress of human combustion, the bones disintegrate.\n\nHe doesn't leave bodies behind. Just ash.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He himself is quite horrified by it, though the total lack of body moisture makes the corpses quite flammable and easily incinerated with a single match. The force also weakens the bone, so when you add in the thermal stress of human combustion, the bones disintegrate.&lt;/p&gt;\n\n&lt;p&gt;He doesn&amp;#39;t leave bodies behind. Just ash.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9z8aa", "score_hidden": false, "stickied": false, "created": 1492243426.0, "created_utc": 1492214626.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9z3t2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MrManicMarty", "parent_id": "t1_dg9ytiy", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "&gt; His bite explosively draws out every bit of moisture in the body, mummifying you in seconds.\n\nThat's horrifying.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;His bite explosively draws out every bit of moisture in the body, mummifying you in seconds.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s horrifying.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9z3t2", "score_hidden": false, "stickied": false, "created": 1492243260.0, "created_utc": 1492214460.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ytiy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "wille179", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "There's only one vampire in my world. His circumstances are *really* unique.\n\n&gt; Blood requirement:- How much blood do they need? Do they need a lot? Do they have to kill people? Do they even need blood?\n\nHe needs about one person's blood every two weeks, though it stacks if he gorges himself (i.e. 3 people at once gives him 6 weeks). He can triple the amount of time he has between *human* feedings by gorging on animal blood. He really does need the blood.\n\nIf he cuts you and drains the blood into some container before drinking it, you'll be fine. But if he bites you, you die basically instantly. His bite explosively draws out every bit of moisture in the body, mummifying you in seconds.\n\n&gt; Craving type:- How do they crave it? Do they feel peckish as you and I would, or is it more of an addiction? Are they driven by an animal-like lust for feeding or can they repress themselves with discipline?\n\nIt feels exactly like thirst, except instead of getting delusional like a person would without water, the pain only ever increases. When not managed with animal blood, he drinks copious amounts of water.\n\n&gt; Conversion:- How does Vampirism spread? Is it easily spread or is it \"gifted\"? Is Vampire just a race or genetic condition with no \"turning\" involved?\n\nIt doesn't, thankfully. Instead, he was born after his soul survived a trip through the abyss and was reborn. Nobody is sure of how that actually worked.\n\n&gt; Morality shifts:- Is there any shift in personality? Is a Vampire not the same person they were before being born? Do they lose their soul? Or are they the same person but their diet is a bit different?\n\nThere is a minor psychopathic and sadistic tendency, which grow as his thirst increases. When he starts feeding, he can enter a blood trance, during which he kills without remorse, though he can be easily snapped out of it **after** he's had his initial fill.\n\nHe's also developed an irrational hatred of his own reflection, though he doesn't act upon that feeling.\n\n&gt; Super powers:- Do Vampires get any neat powers? Are those powers easily abusable for personal gain?\n\nHe has a hyper-intense awareness of the magical energies within his own body. It makes learning high-precision magical tasks easier. He can also restore his reserves by drinking more human blood. Between that and the knowledge of his previous life, he was able to self-invent a lot of spells (though he lacks any formal training). The unique Abyssal properties of his magic make even his simple spells extremely dangerous, as they bypass magical resistance.\n\nHe can also use the souls stolen when he kills people with his bite to auto-resurrect. This resets his age to about 22.\n\n&gt; Weaknesses:- Do Vampires hate sunlight with a passion or just accept their limitation? Do they have a limitation?\n\nHe is extra weak to sunlight; lightning, fire, and holy magic, and is unable to use elemental magic, period. Further, the same Abyssal property that enhances his magical attacks also makes him generally more vulnerable to magic than other people.\n\nHe also has a garlic allergy - mild anaphylactic shock if he eats any. His magic lets him force his own throat open and stimulate his adrenal glands, however, so it's just a mild annoyance for him now, though he wouldn't actually die from it even if he let it run its course without intervention.\n\n\n&gt; Appearances:- Are they butt-ugly monsters or are they actually quite handsome? Do they look the same but with pointier teeth?\n\nFor the most part, he looks fairly normal, if a little ugly. His absurd height and muscle mass is a result of magical self-modification rather than anything vampiric. On the other hand, his face and skin do reflect his nature.\n\nHis eyes are pale red, but crimson when hungry. He has abnormally thick fingernails (which he files into claws), long ears, excessive body hair, fangs, a weird facial bone structure, and pale skin. As he grows hungrier, these traits grow more pronounced, gradually making him look less human and more bestial.\n\nWhen he enters a blood trance, that's when the changes *really* start happening. Body hair becomes fur, head and beard hair grow rapidly, skin turns red, his face elongates into a muzzle, lips retract, jaw widens, ears elongate, fingernails become true claws, muscles bulk up, bones disproportionately elongate, the whites of his eyes turn red, and, most prominently, he sprouts a tail with a fully functional mouth of its own.\n\nWhen he awakens, all the changes quickly revert, except for the hair; he urgently needs a haircut and a shave after every feeding. It also leaves these tufts of fur on his wrists and ankles that falls out over a few days.\n\n&gt; In general, how possible is it in your world for a Vampire to be a good person? Is it common? Rare? Non-existent? The norm?\n\nHe tries to be a good person, using his nonlethal powers to help protect his family and friends, earn money to support them, and be a father/older brother figure for his little (human) brother.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s only one vampire in my world. His circumstances are &lt;em&gt;really&lt;/em&gt; unique.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Blood requirement:- How much blood do they need? Do they need a lot? Do they have to kill people? Do they even need blood?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He needs about one person&amp;#39;s blood every two weeks, though it stacks if he gorges himself (i.e. 3 people at once gives him 6 weeks). He can triple the amount of time he has between &lt;em&gt;human&lt;/em&gt; feedings by gorging on animal blood. He really does need the blood.&lt;/p&gt;\n\n&lt;p&gt;If he cuts you and drains the blood into some container before drinking it, you&amp;#39;ll be fine. But if he bites you, you die basically instantly. His bite explosively draws out every bit of moisture in the body, mummifying you in seconds.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Craving type:- How do they crave it? Do they feel peckish as you and I would, or is it more of an addiction? Are they driven by an animal-like lust for feeding or can they repress themselves with discipline?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It feels exactly like thirst, except instead of getting delusional like a person would without water, the pain only ever increases. When not managed with animal blood, he drinks copious amounts of water.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Conversion:- How does Vampirism spread? Is it easily spread or is it &amp;quot;gifted&amp;quot;? Is Vampire just a race or genetic condition with no &amp;quot;turning&amp;quot; involved?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It doesn&amp;#39;t, thankfully. Instead, he was born after his soul survived a trip through the abyss and was reborn. Nobody is sure of how that actually worked.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Morality shifts:- Is there any shift in personality? Is a Vampire not the same person they were before being born? Do they lose their soul? Or are they the same person but their diet is a bit different?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There is a minor psychopathic and sadistic tendency, which grow as his thirst increases. When he starts feeding, he can enter a blood trance, during which he kills without remorse, though he can be easily snapped out of it &lt;strong&gt;after&lt;/strong&gt; he&amp;#39;s had his initial fill.&lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s also developed an irrational hatred of his own reflection, though he doesn&amp;#39;t act upon that feeling.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Super powers:- Do Vampires get any neat powers? Are those powers easily abusable for personal gain?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He has a hyper-intense awareness of the magical energies within his own body. It makes learning high-precision magical tasks easier. He can also restore his reserves by drinking more human blood. Between that and the knowledge of his previous life, he was able to self-invent a lot of spells (though he lacks any formal training). The unique Abyssal properties of his magic make even his simple spells extremely dangerous, as they bypass magical resistance.&lt;/p&gt;\n\n&lt;p&gt;He can also use the souls stolen when he kills people with his bite to auto-resurrect. This resets his age to about 22.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Weaknesses:- Do Vampires hate sunlight with a passion or just accept their limitation? Do they have a limitation?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He is extra weak to sunlight; lightning, fire, and holy magic, and is unable to use elemental magic, period. Further, the same Abyssal property that enhances his magical attacks also makes him generally more vulnerable to magic than other people.&lt;/p&gt;\n\n&lt;p&gt;He also has a garlic allergy - mild anaphylactic shock if he eats any. His magic lets him force his own throat open and stimulate his adrenal glands, however, so it&amp;#39;s just a mild annoyance for him now, though he wouldn&amp;#39;t actually die from it even if he let it run its course without intervention.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Appearances:- Are they butt-ugly monsters or are they actually quite handsome? Do they look the same but with pointier teeth?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;For the most part, he looks fairly normal, if a little ugly. His absurd height and muscle mass is a result of magical self-modification rather than anything vampiric. On the other hand, his face and skin do reflect his nature.&lt;/p&gt;\n\n&lt;p&gt;His eyes are pale red, but crimson when hungry. He has abnormally thick fingernails (which he files into claws), long ears, excessive body hair, fangs, a weird facial bone structure, and pale skin. As he grows hungrier, these traits grow more pronounced, gradually making him look less human and more bestial.&lt;/p&gt;\n\n&lt;p&gt;When he enters a blood trance, that&amp;#39;s when the changes &lt;em&gt;really&lt;/em&gt; start happening. Body hair becomes fur, head and beard hair grow rapidly, skin turns red, his face elongates into a muzzle, lips retract, jaw widens, ears elongate, fingernails become true claws, muscles bulk up, bones disproportionately elongate, the whites of his eyes turn red, and, most prominently, he sprouts a tail with a fully functional mouth of its own.&lt;/p&gt;\n\n&lt;p&gt;When he awakens, all the changes quickly revert, except for the hair; he urgently needs a haircut and a shave after every feeding. It also leaves these tufts of fur on his wrists and ankles that falls out over a few days.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In general, how possible is it in your world for a Vampire to be a good person? Is it common? Rare? Non-existent? The norm?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He tries to be a good person, using his nonlethal powers to help protect his family and friends, earn money to support them, and be a father/older brother figure for his little (human) brother.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9ytiy", "score_hidden": false, "stickied": false, "created": 1492242872.0, "created_utc": 1492214072.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dg9zonr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheAlchemyst99", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "New vampires are on the level of Edward.\n\nThe rest are serial killers who enjoy torturing their prey.\n\nBlood requirement: Vampires prefer feeding each day but need to drink at least a liter a month.\n\nCraving: Vampires get cold, very, very cold, and blood is the only thing that warms them. They eventually go insane if off blood long enough and treat blood like food.\n\nConversion: A vampire is created when a human drinks the blood of a vampire. The blood kills the human and at the same time warps their body, making them look like a supermodel (and that's just the normal looking people).\n\nMorality: Killing people has the nasty effect of making you a sociopath or really manipulative.\n\nPowers: Flight and hypnosis with more powerful vampires developing super speed, strength, animal possession etc.\n\nWeakness: Anything purifying in a religious manner is toxic to vampires, holy water burning them like acid, religious symbols branding them if touched etc. As a result, they cannot walk on holy ground unless the priest who deemed it blessed dies. Fun fact, most vampires are heliophobic and most nocturnal, as many are afraid of sunlight killing them based upon the vast amount of vampire media we are exposed to. This is known as Stoker Syndrome. If a vampire is exposed to sunlight nothing will happen to them.\n\nAppearance: Sickly but unnaturally beautiful. Skin so soft and smooth and lacking marks, moles, bumps, warts etc. Luminous glowing eyes, perfect bone structure, well built, but slender, lithe.... essentially, vampires look like they were made in photoshop, designed to be as attractive as possible. This is because transformation the blood not only preserves the features of the body but also changes them, making some look like a better, way more attractive version of themselves. Downsides to this include looking pale and sickly, being unable to eat food and becoming a literal monster.\n\nFun facts: Vampires are dead, so they lack a heartbeat, don't need to drink, eat, but they do need to relieve themselves because the blood they consume is only drunk so that the life essence of it is drained. This then means the vampire has to go to the loo to remove the excess blood.\n\nAnother fun fact is that vampires are often incompetent at \"hunting\" as they have a tendency to go for the throat, making a massive mess of blood and gore and alerting anybody nearby that a serial killer is around. Because of this, older vampires take special care educating their children about the circulatory system.\n\nFun fact 3 is that vampires act as the leaders of the undead, setting Sanctuaries in major cities and state capitals such as New York, Beijing, Paris, London, Sydney, Rio, Houston, any other major city of a state or country. Vampires then set up smaller terrotories, enforcing their laws with hired thugs or clever spies.\n\nThanks! If you want to know more about my undead: http://imgur.com/2xujkNM", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;New vampires are on the level of Edward.&lt;/p&gt;\n\n&lt;p&gt;The rest are serial killers who enjoy torturing their prey.&lt;/p&gt;\n\n&lt;p&gt;Blood requirement: Vampires prefer feeding each day but need to drink at least a liter a month.&lt;/p&gt;\n\n&lt;p&gt;Craving: Vampires get cold, very, very cold, and blood is the only thing that warms them. They eventually go insane if off blood long enough and treat blood like food.&lt;/p&gt;\n\n&lt;p&gt;Conversion: A vampire is created when a human drinks the blood of a vampire. The blood kills the human and at the same time warps their body, making them look like a supermodel (and that&amp;#39;s just the normal looking people).&lt;/p&gt;\n\n&lt;p&gt;Morality: Killing people has the nasty effect of making you a sociopath or really manipulative.&lt;/p&gt;\n\n&lt;p&gt;Powers: Flight and hypnosis with more powerful vampires developing super speed, strength, animal possession etc.&lt;/p&gt;\n\n&lt;p&gt;Weakness: Anything purifying in a religious manner is toxic to vampires, holy water burning them like acid, religious symbols branding them if touched etc. As a result, they cannot walk on holy ground unless the priest who deemed it blessed dies. Fun fact, most vampires are heliophobic and most nocturnal, as many are afraid of sunlight killing them based upon the vast amount of vampire media we are exposed to. This is known as Stoker Syndrome. If a vampire is exposed to sunlight nothing will happen to them.&lt;/p&gt;\n\n&lt;p&gt;Appearance: Sickly but unnaturally beautiful. Skin so soft and smooth and lacking marks, moles, bumps, warts etc. Luminous glowing eyes, perfect bone structure, well built, but slender, lithe.... essentially, vampires look like they were made in photoshop, designed to be as attractive as possible. This is because transformation the blood not only preserves the features of the body but also changes them, making some look like a better, way more attractive version of themselves. Downsides to this include looking pale and sickly, being unable to eat food and becoming a literal monster.&lt;/p&gt;\n\n&lt;p&gt;Fun facts: Vampires are dead, so they lack a heartbeat, don&amp;#39;t need to drink, eat, but they do need to relieve themselves because the blood they consume is only drunk so that the life essence of it is drained. This then means the vampire has to go to the loo to remove the excess blood.&lt;/p&gt;\n\n&lt;p&gt;Another fun fact is that vampires are often incompetent at &amp;quot;hunting&amp;quot; as they have a tendency to go for the throat, making a massive mess of blood and gore and alerting anybody nearby that a serial killer is around. Because of this, older vampires take special care educating their children about the circulatory system.&lt;/p&gt;\n\n&lt;p&gt;Fun fact 3 is that vampires act as the leaders of the undead, setting Sanctuaries in major cities and state capitals such as New York, Beijing, Paris, London, Sydney, Rio, Houston, any other major city of a state or country. Vampires then set up smaller terrotories, enforcing their laws with hired thugs or clever spies.&lt;/p&gt;\n\n&lt;p&gt;Thanks! If you want to know more about my undead: &lt;a href=\"http://imgur.com/2xujkNM\"&gt;http://imgur.com/2xujkNM&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9zonr", "score_hidden": false, "stickied": false, "created": 1492244033.0, "created_utc": 1492215233.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dgaebck", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "the_vizir", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "**Blood Requirement**\n\nWell, it all depends on how active the vampire is, and how much of their own power they're using, and what they're feeding on. See, a vampire doesn't need *blood*, so much as the anima--or life force--found in blood. So taking blood from a pig or a cow is less effective than taking blood from a human is less effective than taking blood from a dragon or a fey. Of course, pigs are also less dangerous than humans, and humans are much less dangerous than dragons, so it's a catch-22.\n\nIn most cases, a vampire only needs to feed about once a week, but they need to take enough blood from the victim that their victim may very well be at risk of dying, which is why most vampires feed in smaller amounts more frequently. This keeps their cravings down and gives them more leeway--an unsuccessful night isn't going to be a threat.\n\n**Craving type**\n\nIt's straight up hunger. A vampire is effectively a walking corpse, and thus cannot get anima from the act of living *because they aren't alive.* So a vampire has to get their required anima through other means--specifically the blood of other living beings. It's basically like a nagging hunger--food and drink don't have the same invigorating properties that they had before, there's something missing in it. Blood, on the other hand, fills this empty place in the vampire, making them feel alive again.\n\nOf course, this feeling can be addictive, so while the basic drive might be hunger, vampires can begin to crave to the feeling they get when full on anima--the vigour of life, forgetting for a moment that one is an abomination against nature itself. So it's actually rather common for vampires to feed when they don't have to simply to get a fix. However, there are some vamps who will try to keep a firm hold on their morality and cravings, and through discipline, resist any addicting properties.\n\n**Conversion**\n\nVampirism is a curse, though its exact origins have been lost to history. It's known it first emerged in the Middle East some 10,000 years ago, and spread throughout the early city states of Mesopotamia, Asia Minor, and India. Some claim it was a gift bestowed upon a powerful king who made a deal with Death himself, others claim it was created a mage trying to extend his life through grand blood magic rites, others believe it is the result of a demonic bargain, others say that the legendary Lilith spawned the first vampires, and still others argue it was a curse bestowed upon Cain for the first murder.\n\nRegardless of its exact origins, vampirism is spread when a vampire drains the anima of a human, leaving behind an empty, hungering void where their spirit once resided. Note that anima is separate from blood, so a vampire doesn't have to drink a body dry as some legends state--but in most cases, a small bite usually isn't enough to fully drain someone's anima either. And again, it depends on the person--a mage has more anima than a normal human unless they've tapped themselves out during casting, while a psychic is a veritable fountain of anima that would take *dozens* of vampires to run dry. It's usually hard to get a read on how much anima a human has, so most vampires keep their feeding limited because the last thing most of them want is for vamps to pop up--and thus have more mouths to feed. Accidental conversions are still a risk, but most new vampires were singled out and purposely transformed. \n\n**Morality Shifts**\n\nA vampire loses their animating spirit, not their soul, and therefor they remain the same person they were before their death and rebirth. However, given one's new hungers and predatory instincts--usually accompanied by the revelation that vampires aren't a myth and that everything you thought about the world was wrong--it's typical for new vampires to undergo a psychotic break: becoming incredibly depressed, developing a new personality to cope, creating a new identity, becoming irrational and violent, hallucinating, and the like. The person who emerges from this could be incredibly different from who they were before--but this has nothing to do with the curse of vampirism and everything to do with humans trying to come to terms with their new existence. And it doesn't happen to everyone--strong willed individuals may be able to fight their way through the rebirth without cracking.\n\nVampire society usually takes these new vampires and offers them support and allies during the first few trying weeks and months of their unlife--typically including indoctrination into vampiric customs and beliefs. Most vampires, after all, view themselves as the epitome of undeath, and their transformation not as curse but a blessing--they're better now than they were before. Stronger. Faster. Smarter. Immune to disease and the rigours of aging. Most vampires view themselves as the true masters of the night, and believe that they *deserve* to be worshipped, feared, and followed by mankind--the cattle that feeds them. While this might sound harsh, it's a way to cope with the transformation: you're better than you were before, you have more friends and power now, and those you feed on aren't *really* like you anymore, right?\n\n**Super powers**\n\nAs mentioned, vampires have increased speed, stamina, strength, and an immunity to most diseases, illnesses, and aging. And that's just your standard vampire offerings. See, vampires are tied to blood, blood has a lot of anima, and anima is the stuff of magic. So basically, vampires are just brimming with magical energy. Indeed, most vampires learn how to harness the anima in blood towards many fantastic, supernatural ends, from enhancing their resilience and keeping their corpses moving, to controlling the emotions and thoughts of others, to shapeshifting, to spreading disease, to the powers of foresight and prophecy. With blood magic, vampires can control the bodies, animate corpses, read thoughts, inflict curses and disease, and assume the forms of bats, wolves, jaguars, or mist. And that's just the start--blood magic is incredibly diverse in its powers, and few know blood magic better than vampires.\n\nIndeed, the whole thing about new vampires being enslaved to the one who turned them? Well, that's partially true, because of blood resonance. It's incredibly easy for a vampire to influence the thoughts and actions of one who they recently drank from. Why most victims either can't remember a feeding, or remember only positive things about it. Mind control is wickedly insidious, after all.\n\n**Weaknesses**\n\nWith great power comes great weaknesses. And vampires have a slough of weaknesses. Most well-known is their weakness to holy objects and symbols--it's not the object itself, of course, but the wielder's faith empowering them to resist the vampire. Faith is an incredible defence, and works not only against vampires, but also spirits, ghosts, horrors, fey, jinn, and demons. And while holy water and crosses might common objects of faith in the West, in other regions, it may be a holy book, or a prayer, or a sacred place (Mecca has been free of vampires for millenia now). Heck, even faith in non-religious things, such as faith in your country, or your ideology, or your friends could be enough to work. There's been recorded cases of vampires being driven back by hammers-and-sickles, so if you ever wonder where the whole \"vampires are weak to garlic\" comes from, just remember that people can believe in the power of anything. \n\nOther than that, vampires are incredibly photosensitive and will find themselves burning to death under the glare of the sun or another bright source of UV radiation. While it's not immediately fatal to most vampires, it is incredibly painful, with their skin blistering and peeling away in minutes, and can usually kill a vampire in under an hour. Thus, most vampires restrict their activity to the nighttime hours, and if they must go out in the sun, they go out wearing heavy clothes with hoods, gloves, and gasmasks--letting no light through at all. It's a bit of a give away, honestly, and most vampires would much prefer to travel around in limos with tinted windows from one indoor parking garage to another. \n\nAnother common weakness is that vampires cannot enter a private dwelling if not invited in. Of course, most modern folks believe this applies to any enclosed location, but that's an incredibly common misconception: if it's a place where an open invitation is implied, like a restaurant, a courthouse, a mall, or even a church, a vampire can enter at will. Also, vampires cannot cross running water, but that's physically cross--standing at the other side of a river only works if the vampire can't find a bridge.\n\nAlso, steaks to the heart aren't fatal, but the original myths were right in that it bound a vampire and prevented them from moving or acting. So it's an effective way of binding them if you can't permanently kill them for whatever reason.\n\n**Appearances**\n\nA vampire's appearance depends on how recently they've fed, and how full on life and anima they are. A satiated vampire can appear almost human--skin a bit paler, eyes a bit dull, teeth a bit more pointed, skin a bit colder, but easily passable as human. Indeed, the transformation into a vampire usually makes one appear *healthier* than they were in life: a bit younger, stronger, more attractive in many regards. A hungry vampire, on the other hand, appears almost like a gaunt, feral beast with a maw full of fangs, fingers twisted into vicious claws, clammy skin clinging close to the bone, thinning hair, shallow cheeks and eyes blazing with unholy fire. Its not pleasant, and most vampires hate being seen in such a vulgar state. Interestingly, vampires who feed primarily on animals will often find themselves taking the traits of the animals whose blood they consume, appearing monstrous despite arguably being more humane.", "edited": 1492239282.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Blood Requirement&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Well, it all depends on how active the vampire is, and how much of their own power they&amp;#39;re using, and what they&amp;#39;re feeding on. See, a vampire doesn&amp;#39;t need &lt;em&gt;blood&lt;/em&gt;, so much as the anima--or life force--found in blood. So taking blood from a pig or a cow is less effective than taking blood from a human is less effective than taking blood from a dragon or a fey. Of course, pigs are also less dangerous than humans, and humans are much less dangerous than dragons, so it&amp;#39;s a catch-22.&lt;/p&gt;\n\n&lt;p&gt;In most cases, a vampire only needs to feed about once a week, but they need to take enough blood from the victim that their victim may very well be at risk of dying, which is why most vampires feed in smaller amounts more frequently. This keeps their cravings down and gives them more leeway--an unsuccessful night isn&amp;#39;t going to be a threat.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Craving type&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s straight up hunger. A vampire is effectively a walking corpse, and thus cannot get anima from the act of living &lt;em&gt;because they aren&amp;#39;t alive.&lt;/em&gt; So a vampire has to get their required anima through other means--specifically the blood of other living beings. It&amp;#39;s basically like a nagging hunger--food and drink don&amp;#39;t have the same invigorating properties that they had before, there&amp;#39;s something missing in it. Blood, on the other hand, fills this empty place in the vampire, making them feel alive again.&lt;/p&gt;\n\n&lt;p&gt;Of course, this feeling can be addictive, so while the basic drive might be hunger, vampires can begin to crave to the feeling they get when full on anima--the vigour of life, forgetting for a moment that one is an abomination against nature itself. So it&amp;#39;s actually rather common for vampires to feed when they don&amp;#39;t have to simply to get a fix. However, there are some vamps who will try to keep a firm hold on their morality and cravings, and through discipline, resist any addicting properties.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Conversion&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Vampirism is a curse, though its exact origins have been lost to history. It&amp;#39;s known it first emerged in the Middle East some 10,000 years ago, and spread throughout the early city states of Mesopotamia, Asia Minor, and India. Some claim it was a gift bestowed upon a powerful king who made a deal with Death himself, others claim it was created a mage trying to extend his life through grand blood magic rites, others believe it is the result of a demonic bargain, others say that the legendary Lilith spawned the first vampires, and still others argue it was a curse bestowed upon Cain for the first murder.&lt;/p&gt;\n\n&lt;p&gt;Regardless of its exact origins, vampirism is spread when a vampire drains the anima of a human, leaving behind an empty, hungering void where their spirit once resided. Note that anima is separate from blood, so a vampire doesn&amp;#39;t have to drink a body dry as some legends state--but in most cases, a small bite usually isn&amp;#39;t enough to fully drain someone&amp;#39;s anima either. And again, it depends on the person--a mage has more anima than a normal human unless they&amp;#39;ve tapped themselves out during casting, while a psychic is a veritable fountain of anima that would take &lt;em&gt;dozens&lt;/em&gt; of vampires to run dry. It&amp;#39;s usually hard to get a read on how much anima a human has, so most vampires keep their feeding limited because the last thing most of them want is for vamps to pop up--and thus have more mouths to feed. Accidental conversions are still a risk, but most new vampires were singled out and purposely transformed. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Morality Shifts&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;A vampire loses their animating spirit, not their soul, and therefor they remain the same person they were before their death and rebirth. However, given one&amp;#39;s new hungers and predatory instincts--usually accompanied by the revelation that vampires aren&amp;#39;t a myth and that everything you thought about the world was wrong--it&amp;#39;s typical for new vampires to undergo a psychotic break: becoming incredibly depressed, developing a new personality to cope, creating a new identity, becoming irrational and violent, hallucinating, and the like. The person who emerges from this could be incredibly different from who they were before--but this has nothing to do with the curse of vampirism and everything to do with humans trying to come to terms with their new existence. And it doesn&amp;#39;t happen to everyone--strong willed individuals may be able to fight their way through the rebirth without cracking.&lt;/p&gt;\n\n&lt;p&gt;Vampire society usually takes these new vampires and offers them support and allies during the first few trying weeks and months of their unlife--typically including indoctrination into vampiric customs and beliefs. Most vampires, after all, view themselves as the epitome of undeath, and their transformation not as curse but a blessing--they&amp;#39;re better now than they were before. Stronger. Faster. Smarter. Immune to disease and the rigours of aging. Most vampires view themselves as the true masters of the night, and believe that they &lt;em&gt;deserve&lt;/em&gt; to be worshipped, feared, and followed by mankind--the cattle that feeds them. While this might sound harsh, it&amp;#39;s a way to cope with the transformation: you&amp;#39;re better than you were before, you have more friends and power now, and those you feed on aren&amp;#39;t &lt;em&gt;really&lt;/em&gt; like you anymore, right?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Super powers&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As mentioned, vampires have increased speed, stamina, strength, and an immunity to most diseases, illnesses, and aging. And that&amp;#39;s just your standard vampire offerings. See, vampires are tied to blood, blood has a lot of anima, and anima is the stuff of magic. So basically, vampires are just brimming with magical energy. Indeed, most vampires learn how to harness the anima in blood towards many fantastic, supernatural ends, from enhancing their resilience and keeping their corpses moving, to controlling the emotions and thoughts of others, to shapeshifting, to spreading disease, to the powers of foresight and prophecy. With blood magic, vampires can control the bodies, animate corpses, read thoughts, inflict curses and disease, and assume the forms of bats, wolves, jaguars, or mist. And that&amp;#39;s just the start--blood magic is incredibly diverse in its powers, and few know blood magic better than vampires.&lt;/p&gt;\n\n&lt;p&gt;Indeed, the whole thing about new vampires being enslaved to the one who turned them? Well, that&amp;#39;s partially true, because of blood resonance. It&amp;#39;s incredibly easy for a vampire to influence the thoughts and actions of one who they recently drank from. Why most victims either can&amp;#39;t remember a feeding, or remember only positive things about it. Mind control is wickedly insidious, after all.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Weaknesses&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;With great power comes great weaknesses. And vampires have a slough of weaknesses. Most well-known is their weakness to holy objects and symbols--it&amp;#39;s not the object itself, of course, but the wielder&amp;#39;s faith empowering them to resist the vampire. Faith is an incredible defence, and works not only against vampires, but also spirits, ghosts, horrors, fey, jinn, and demons. And while holy water and crosses might common objects of faith in the West, in other regions, it may be a holy book, or a prayer, or a sacred place (Mecca has been free of vampires for millenia now). Heck, even faith in non-religious things, such as faith in your country, or your ideology, or your friends could be enough to work. There&amp;#39;s been recorded cases of vampires being driven back by hammers-and-sickles, so if you ever wonder where the whole &amp;quot;vampires are weak to garlic&amp;quot; comes from, just remember that people can believe in the power of anything. &lt;/p&gt;\n\n&lt;p&gt;Other than that, vampires are incredibly photosensitive and will find themselves burning to death under the glare of the sun or another bright source of UV radiation. While it&amp;#39;s not immediately fatal to most vampires, it is incredibly painful, with their skin blistering and peeling away in minutes, and can usually kill a vampire in under an hour. Thus, most vampires restrict their activity to the nighttime hours, and if they must go out in the sun, they go out wearing heavy clothes with hoods, gloves, and gasmasks--letting no light through at all. It&amp;#39;s a bit of a give away, honestly, and most vampires would much prefer to travel around in limos with tinted windows from one indoor parking garage to another. &lt;/p&gt;\n\n&lt;p&gt;Another common weakness is that vampires cannot enter a private dwelling if not invited in. Of course, most modern folks believe this applies to any enclosed location, but that&amp;#39;s an incredibly common misconception: if it&amp;#39;s a place where an open invitation is implied, like a restaurant, a courthouse, a mall, or even a church, a vampire can enter at will. Also, vampires cannot cross running water, but that&amp;#39;s physically cross--standing at the other side of a river only works if the vampire can&amp;#39;t find a bridge.&lt;/p&gt;\n\n&lt;p&gt;Also, steaks to the heart aren&amp;#39;t fatal, but the original myths were right in that it bound a vampire and prevented them from moving or acting. So it&amp;#39;s an effective way of binding them if you can&amp;#39;t permanently kill them for whatever reason.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Appearances&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;A vampire&amp;#39;s appearance depends on how recently they&amp;#39;ve fed, and how full on life and anima they are. A satiated vampire can appear almost human--skin a bit paler, eyes a bit dull, teeth a bit more pointed, skin a bit colder, but easily passable as human. Indeed, the transformation into a vampire usually makes one appear &lt;em&gt;healthier&lt;/em&gt; than they were in life: a bit younger, stronger, more attractive in many regards. A hungry vampire, on the other hand, appears almost like a gaunt, feral beast with a maw full of fangs, fingers twisted into vicious claws, clammy skin clinging close to the bone, thinning hair, shallow cheeks and eyes blazing with unholy fire. Its not pleasant, and most vampires hate being seen in such a vulgar state. Interestingly, vampires who feed primarily on animals will often find themselves taking the traits of the animals whose blood they consume, appearing monstrous despite arguably being more humane.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dgaebck", "score_hidden": false, "stickied": false, "created": 1492267824.0, "created_utc": 1492239024.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dgbgde9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SpaceCrom", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Conversion: Blood magic is fairly well known and until recently commonly used. The only reason it isn't used much any more is because there's better forms of magic now. But there is a branch of blood magic that deals with using the large quantities of human blood. These spells are outlawed and the cults that practice it are secret. The change is gradual as their skill improve and their bodies adjust to all the spells. The one vampire spell that everyone want is the extend your life spell. Most people that join vampire societies do it for that spell in particular.  \n\nBlood requirements and craving: It's not addictive but if you want to extend your life you need blood. On top of that, each time you cast it, the more blood you will need next time. So older master vampires require their student to bring them blood to keep the teaching them. So these students need blood to give to their master and blood from themselves. As one can see, this isn't sustainable forever. Eventually you will need to much blood to keep going and at that point there is too many things that can go wrong. Getting caught or student rebellion so on and so forth. \n\nMorality shifts: Being a vampire isn't a passive activity and you have to be an extremely immoral person to keep on doing it. That doesn't mean practitioners don't do mental acrobatics to justify it. \"My life is worth more than that low life.\" \"They were just wasting their life. I will put it to good use.\" \"Life has always been kill or be killed. This is no different.\" Since I haven't mentioned it before now, yes you have to drink the blood. \n\nSuper Powers: Different cults see each other as competition so, they don't share knowledge between them. So powers can vary wildly from cult to cult. Some know shape-shifting some don't. Some know mind control some don't. All of them know the spell to extend your life because no one wants to join a cult that doesn't offer that. \n\nWeaknesses: Sunlight will suppress vampire's spells. For young vampires this can be a blessing as well as a curse since the suppression is so complete there is no way to detect the vampire's spells. You can bewitch someone's mind and while they are in sunlight there is no way to tell that there is that spell waiting to take over when the sun goes down. For older vampires the sun is a big problem. If you have extended your life beyond its normal length and those spells get suppressed, well it's game over. Very old vampires suffer from desegregation over the years and can develop weaknesses unique to them. These tend to be ticks and rituals they can't stop themselves from doing and sometimes aren't even aware they do them.\n\nAppearances: Looking younger is known to most cults, it's even an easier one to figure out on ones own. But as vampires get older and they need more and more blood to extend their life just a little bit longer. So they are met with a choice on what to do with the blood they got. How important is looking young to them. Some vampires start to see youth spells as a wast other don't see the point of living longer if they don't look good too. \n\nThe point of vampires in my world is that they are humans. But the way they treat other humans like resource to be exploited, makes them more monstrous than even demons. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Conversion: Blood magic is fairly well known and until recently commonly used. The only reason it isn&amp;#39;t used much any more is because there&amp;#39;s better forms of magic now. But there is a branch of blood magic that deals with using the large quantities of human blood. These spells are outlawed and the cults that practice it are secret. The change is gradual as their skill improve and their bodies adjust to all the spells. The one vampire spell that everyone want is the extend your life spell. Most people that join vampire societies do it for that spell in particular.  &lt;/p&gt;\n\n&lt;p&gt;Blood requirements and craving: It&amp;#39;s not addictive but if you want to extend your life you need blood. On top of that, each time you cast it, the more blood you will need next time. So older master vampires require their student to bring them blood to keep the teaching them. So these students need blood to give to their master and blood from themselves. As one can see, this isn&amp;#39;t sustainable forever. Eventually you will need to much blood to keep going and at that point there is too many things that can go wrong. Getting caught or student rebellion so on and so forth. &lt;/p&gt;\n\n&lt;p&gt;Morality shifts: Being a vampire isn&amp;#39;t a passive activity and you have to be an extremely immoral person to keep on doing it. That doesn&amp;#39;t mean practitioners don&amp;#39;t do mental acrobatics to justify it. &amp;quot;My life is worth more than that low life.&amp;quot; &amp;quot;They were just wasting their life. I will put it to good use.&amp;quot; &amp;quot;Life has always been kill or be killed. This is no different.&amp;quot; Since I haven&amp;#39;t mentioned it before now, yes you have to drink the blood. &lt;/p&gt;\n\n&lt;p&gt;Super Powers: Different cults see each other as competition so, they don&amp;#39;t share knowledge between them. So powers can vary wildly from cult to cult. Some know shape-shifting some don&amp;#39;t. Some know mind control some don&amp;#39;t. All of them know the spell to extend your life because no one wants to join a cult that doesn&amp;#39;t offer that. &lt;/p&gt;\n\n&lt;p&gt;Weaknesses: Sunlight will suppress vampire&amp;#39;s spells. For young vampires this can be a blessing as well as a curse since the suppression is so complete there is no way to detect the vampire&amp;#39;s spells. You can bewitch someone&amp;#39;s mind and while they are in sunlight there is no way to tell that there is that spell waiting to take over when the sun goes down. For older vampires the sun is a big problem. If you have extended your life beyond its normal length and those spells get suppressed, well it&amp;#39;s game over. Very old vampires suffer from desegregation over the years and can develop weaknesses unique to them. These tend to be ticks and rituals they can&amp;#39;t stop themselves from doing and sometimes aren&amp;#39;t even aware they do them.&lt;/p&gt;\n\n&lt;p&gt;Appearances: Looking younger is known to most cults, it&amp;#39;s even an easier one to figure out on ones own. But as vampires get older and they need more and more blood to extend their life just a little bit longer. So they are met with a choice on what to do with the blood they got. How important is looking young to them. Some vampires start to see youth spells as a wast other don&amp;#39;t see the point of living longer if they don&amp;#39;t look good too. &lt;/p&gt;\n\n&lt;p&gt;The point of vampires in my world is that they are humans. But the way they treat other humans like resource to be exploited, makes them more monstrous than even demons. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dgbgde9", "score_hidden": false, "stickied": false, "created": 1492333415.0, "created_utc": 1492304615.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dgbvagd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Hi_Im_Wall", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "-Blood Requirement\n\nTheoretically, none. A Vampire in Bakar could, in theory, exist in a totally normal life with zero blood intake. However, this leaves the Vampire in a weakened state, although only by Vampire terms. Even a blood-starved Vampire could outpace most Humans.\n\n-Craving Type\n\nFor most Vampire this looks very much like an addiction. While a Vampire could go without consuming blood even once, once they do so for the first time and experience the power that comes with it it often creates a snowballing effect in the desire to feed.\n\n-Conversion\n\nSpread through bites. This is difficult, however, as due to the snowball-y nature of feedings most Vampire will kill the prey during the feeding. Any victim who happens to survive a feeding has a chance, though not a guarantee, of experiencing the conversion. \n\n-Morality Shifts\n\nNothing really changes directly, it's mostly with blood consumption that an individual would start to change. The more blood a Vampire consumes, the more power they gain, the more they can internally justice their acts, all of this leading to a decrease in the value of human life. So for Vampire who don't drink, no real change. Vampire who do drink, however, tend to lose a large scale of their humanity.\n\n-Super Powers\n\nAn increase in bodily senses, reflex, and strength are all common side effects of blood consumption. Due to this, a Vampire who begins feeding quickly snowballs into a very dangerous creature, as feeding even once will make it stronger and increase it's desire to feed. Since the Vampire is stronger now, it makes that second feeding even easier, and makes it even stronger, resulting in a dangerous cycle that makes Vampires one of the most deadly creatures in Bakar. Worse still is that there doesn't seem to be a cap to a Vampire's powers, so long as they keep feeding.\n\n-Weaknesses.\n\nA Vampire who doesn't feed only experiences minor weaknesses; as stated before, just being a Vampire gives a person vast bodily improvements over a standard human. Primarily we see that while blood-starved Vampires will still having increased bodily senses these Vampires often see it as a downfall, as the sensations often cause pain; lights seem far to bright, sounds are all too loud, clothes feel rough and coarse on the skin, sort of like having a bad hangover, minus the nausea. All of this begins to wear on the Vampire, making it even more likely for the person to eventually begin feeding.\n\n-Appearances\n\nA Vampire often looks quite normal, and would easily pass for a normal human, even one who feeds routinely. The only pronounced difference is the increased size of the canine teeth on both the upper and lower jaw, which are used for feeding.\n\nVampires in Bakar are few and far between. The only way to become one is through a bite, and since a bite only gives a small chance, provided the individual even lives through the ordeal, the creation of Vampires is a very uncommon occurrence. It's entirely possible for a Vampire to live a normal human life, though it's often filled with sufferings and annoyances due to the effects of being blood-starved. Due to this, most Vampires eventually succumb to the temptations, and might very quickly snowball into being one of the most dangerous creatures in the valley. Vampires are typically solitary creatures, being territorial creatures who do not enjoy sharing their space with others of their kind. Occasionally though Covens may form, often being no larger than three to five Vampires. Even with numbers this small a group well-fed Vampire's powers are far more than needed to control a huge area of land by force and fear. Only the highest rated Guilds and Clans in the Valley attempt to hunt fed Vampires, and often they'll only seek out one at a time. Thankfully, though, Vampire's territorial natures usually get the best of them, and any Covens will eventually tear themselves apart. Often times, quite literally.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;-Blood Requirement&lt;/p&gt;\n\n&lt;p&gt;Theoretically, none. A Vampire in Bakar could, in theory, exist in a totally normal life with zero blood intake. However, this leaves the Vampire in a weakened state, although only by Vampire terms. Even a blood-starved Vampire could outpace most Humans.&lt;/p&gt;\n\n&lt;p&gt;-Craving Type&lt;/p&gt;\n\n&lt;p&gt;For most Vampire this looks very much like an addiction. While a Vampire could go without consuming blood even once, once they do so for the first time and experience the power that comes with it it often creates a snowballing effect in the desire to feed.&lt;/p&gt;\n\n&lt;p&gt;-Conversion&lt;/p&gt;\n\n&lt;p&gt;Spread through bites. This is difficult, however, as due to the snowball-y nature of feedings most Vampire will kill the prey during the feeding. Any victim who happens to survive a feeding has a chance, though not a guarantee, of experiencing the conversion. &lt;/p&gt;\n\n&lt;p&gt;-Morality Shifts&lt;/p&gt;\n\n&lt;p&gt;Nothing really changes directly, it&amp;#39;s mostly with blood consumption that an individual would start to change. The more blood a Vampire consumes, the more power they gain, the more they can internally justice their acts, all of this leading to a decrease in the value of human life. So for Vampire who don&amp;#39;t drink, no real change. Vampire who do drink, however, tend to lose a large scale of their humanity.&lt;/p&gt;\n\n&lt;p&gt;-Super Powers&lt;/p&gt;\n\n&lt;p&gt;An increase in bodily senses, reflex, and strength are all common side effects of blood consumption. Due to this, a Vampire who begins feeding quickly snowballs into a very dangerous creature, as feeding even once will make it stronger and increase it&amp;#39;s desire to feed. Since the Vampire is stronger now, it makes that second feeding even easier, and makes it even stronger, resulting in a dangerous cycle that makes Vampires one of the most deadly creatures in Bakar. Worse still is that there doesn&amp;#39;t seem to be a cap to a Vampire&amp;#39;s powers, so long as they keep feeding.&lt;/p&gt;\n\n&lt;p&gt;-Weaknesses.&lt;/p&gt;\n\n&lt;p&gt;A Vampire who doesn&amp;#39;t feed only experiences minor weaknesses; as stated before, just being a Vampire gives a person vast bodily improvements over a standard human. Primarily we see that while blood-starved Vampires will still having increased bodily senses these Vampires often see it as a downfall, as the sensations often cause pain; lights seem far to bright, sounds are all too loud, clothes feel rough and coarse on the skin, sort of like having a bad hangover, minus the nausea. All of this begins to wear on the Vampire, making it even more likely for the person to eventually begin feeding.&lt;/p&gt;\n\n&lt;p&gt;-Appearances&lt;/p&gt;\n\n&lt;p&gt;A Vampire often looks quite normal, and would easily pass for a normal human, even one who feeds routinely. The only pronounced difference is the increased size of the canine teeth on both the upper and lower jaw, which are used for feeding.&lt;/p&gt;\n\n&lt;p&gt;Vampires in Bakar are few and far between. The only way to become one is through a bite, and since a bite only gives a small chance, provided the individual even lives through the ordeal, the creation of Vampires is a very uncommon occurrence. It&amp;#39;s entirely possible for a Vampire to live a normal human life, though it&amp;#39;s often filled with sufferings and annoyances due to the effects of being blood-starved. Due to this, most Vampires eventually succumb to the temptations, and might very quickly snowball into being one of the most dangerous creatures in the valley. Vampires are typically solitary creatures, being territorial creatures who do not enjoy sharing their space with others of their kind. Occasionally though Covens may form, often being no larger than three to five Vampires. Even with numbers this small a group well-fed Vampire&amp;#39;s powers are far more than needed to control a huge area of land by force and fear. Only the highest rated Guilds and Clans in the Valley attempt to hunt fed Vampires, and often they&amp;#39;ll only seek out one at a time. Thankfully, though, Vampire&amp;#39;s territorial natures usually get the best of them, and any Covens will eventually tear themselves apart. Often times, quite literally.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dgbvagd", "score_hidden": false, "stickied": false, "created": 1492362208.0, "created_utc": 1492333408.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dg9l6jz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Calvinist-Transhuman", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Vampirism in my world is just an addiction to Khymeragh blood by non-Khymeraghs. It's rare because not many non-Khymeraghs survive life and death encounters with Khymeraghs *and* have a desire to drink their blood.\n\nSo, technically, they don't *need* any blood; they just will go through terrible withdrawal unless they get it. Also, if one of them bites you, nothing happens (except for your likely death). You need to drink it to be vamped. Drinking Khymeragh blood will eventually grant you some Khymeragh characteristics, like their speed and intelligence, and their healing factor (as well as their immortality, if you don't already have it), but you'll start to feel their constant pain and constant fear; if you survive, you, like them, will grow numb to it. The only problem that they have with sunlight is that their skin becomes rather translucent, and their eyes grow slightly more sensitive to eat, but other than that, they're fine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Vampirism in my world is just an addiction to Khymeragh blood by non-Khymeraghs. It&amp;#39;s rare because not many non-Khymeraghs survive life and death encounters with Khymeraghs &lt;em&gt;and&lt;/em&gt; have a desire to drink their blood.&lt;/p&gt;\n\n&lt;p&gt;So, technically, they don&amp;#39;t &lt;em&gt;need&lt;/em&gt; any blood; they just will go through terrible withdrawal unless they get it. Also, if one of them bites you, nothing happens (except for your likely death). You need to drink it to be vamped. Drinking Khymeragh blood will eventually grant you some Khymeragh characteristics, like their speed and intelligence, and their healing factor (as well as their immortality, if you don&amp;#39;t already have it), but you&amp;#39;ll start to feel their constant pain and constant fear; if you survive, you, like them, will grow numb to it. The only problem that they have with sunlight is that their skin becomes rather translucent, and their eyes grow slightly more sensitive to eat, but other than that, they&amp;#39;re fine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9l6jz", "score_hidden": false, "stickied": false, "created": 1492225581.0, "created_utc": 1492196781.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dvbq", "likes": null, "replies": "", "user_reports": [], "id": "dg9w6jd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "UnluckyLucas", "parent_id": "t1_dg9vm66", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "No one has a soul before eruption. Everyone is soulless and cease to exist after brain death.\n\nMancers, those who erupted Orisons, have souls.\n\nWhen a non-mancer is infected, the spiritual virus infects the victim, and rapidly eats up the body's Mana and Anima, causing it to mutate - IE, *erupt*.\n\nBut... since it erupted from the body of the victim, then the thoughts, emotions, and strongest personality traits become a part of the vampirism/soul/orison.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No one has a soul before eruption. Everyone is soulless and cease to exist after brain death.&lt;/p&gt;\n\n&lt;p&gt;Mancers, those who erupted Orisons, have souls.&lt;/p&gt;\n\n&lt;p&gt;When a non-mancer is infected, the spiritual virus infects the victim, and rapidly eats up the body&amp;#39;s Mana and Anima, causing it to mutate - IE, &lt;em&gt;erupt&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;But... since it erupted from the body of the victim, then the thoughts, emotions, and strongest personality traits become a part of the vampirism/soul/orison.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9w6jd", "score_hidden": false, "stickied": false, "created": 1492239379.0, "created_utc": 1492210579.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9vm66", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Geckoface", "parent_id": "t1_dg9ldw6", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "About the soul: after conversion, is it still the soul of the victim, or is it really an 'invasive Orison'? If it is invasive, what is its origin? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;About the soul: after conversion, is it still the soul of the victim, or is it really an &amp;#39;invasive Orison&amp;#39;? If it is invasive, what is its origin? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9vm66", "score_hidden": false, "stickied": false, "created": 1492238617.0, "created_utc": 1492209817.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ldw6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "UnluckyLucas", "parent_id": "t3_65dvbq", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "* Blood requirement:- It isn't that they require a lot of blood, but they require some blood and a LOT of Anima. They can no longer create Anima themselves, and they need to consume large amounts of it alongside a fair amount of blood to stay 'alive.' This makes them brutal, aggressive hunters.\n\n* Craving type:- An aching agony that can be felt in what is left of their bones. Only feeding can numb the pain for a day or so.\n\n* Conversion:- Myth says only virgins can be converted, but rather it's non-mancers that are the susceptible ones. Vampirism is an invasive Orison that causes victims of a bite to erupt... and the eruption kills them pretty damn hard. Their bones explode open and their flesh and organs burn off, leaving a walking, burning skeleton. However, their freshly erupted Vampirism allows them to create a facsimile of a body. It is then that they need to feed on blood (for their disguise) and Anima (for their lives!)\n\n* Morality shifts:- You essentially become an entirely different person when you erupt. Since the transformation destroys your entire body, your Orison - your *soul* - is the one in control. You become your strongest personality traits, lose your mental filter and all of your discipline, and your memories become highly skewed and embellished. You essentially become a flanderized, extreme version of who you really are.\n\n* Super powers:- Because of their 'honesty' that exposing their soul provides, they are very charismatic. They can manipulate their own energy field (themselves, rather) to create energy-based weapons or projectiles. They also can manipulate local temperature to slow their decomposition, which slows their hunger. Physical blows do next to nothing to harm them.\n\n* Weaknesses:- You have to exhaust their Anima to critical levels to cause a meltdown, just like you would a demon or angel or fairy or whatever. Physical attacks would take *hours* to do that, and magical attacks aren't much better. You need a specific way to target their Anima levels.\n\n* Appearances:- They look how they want, but their true form is a charred skeleton whose visible marrow glows crimson red. Flames vent from cracks in the bones, out of the eye sockets, etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Blood requirement:- It isn&amp;#39;t that they require a lot of blood, but they require some blood and a LOT of Anima. They can no longer create Anima themselves, and they need to consume large amounts of it alongside a fair amount of blood to stay &amp;#39;alive.&amp;#39; This makes them brutal, aggressive hunters.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Craving type:- An aching agony that can be felt in what is left of their bones. Only feeding can numb the pain for a day or so.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Conversion:- Myth says only virgins can be converted, but rather it&amp;#39;s non-mancers that are the susceptible ones. Vampirism is an invasive Orison that causes victims of a bite to erupt... and the eruption kills them pretty damn hard. Their bones explode open and their flesh and organs burn off, leaving a walking, burning skeleton. However, their freshly erupted Vampirism allows them to create a facsimile of a body. It is then that they need to feed on blood (for their disguise) and Anima (for their lives!)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Morality shifts:- You essentially become an entirely different person when you erupt. Since the transformation destroys your entire body, your Orison - your &lt;em&gt;soul&lt;/em&gt; - is the one in control. You become your strongest personality traits, lose your mental filter and all of your discipline, and your memories become highly skewed and embellished. You essentially become a flanderized, extreme version of who you really are.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Super powers:- Because of their &amp;#39;honesty&amp;#39; that exposing their soul provides, they are very charismatic. They can manipulate their own energy field (themselves, rather) to create energy-based weapons or projectiles. They also can manipulate local temperature to slow their decomposition, which slows their hunger. Physical blows do next to nothing to harm them.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Weaknesses:- You have to exhaust their Anima to critical levels to cause a meltdown, just like you would a demon or angel or fairy or whatever. Physical attacks would take &lt;em&gt;hours&lt;/em&gt; to do that, and magical attacks aren&amp;#39;t much better. You need a specific way to target their Anima levels.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Appearances:- They look how they want, but their true form is a charred skeleton whose visible marrow glows crimson red. Flames vent from cracks in the bones, out of the eye sockets, etc.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9ldw6", "score_hidden": false, "stickied": false, "created": 1492225831.0, "created_utc": 1492197031.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]