[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "worldbuilding", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I hate that I&amp;#39;m making this post because it&amp;#39;s such a typical &amp;quot;well here&amp;#39;s how MY world works&amp;quot; kind of post, but I&amp;#39;ve seen a general interest in the topic. That topic being half-breeds and how they&amp;#39;re handled in your setting. In my particular setting, (Tiron, a fantasy realm) there are only a few sapient races, but they&amp;#39;ve been able to mix into quite a few. It&amp;#39;s an integral part of my world and as far as I&amp;#39;ve seen, it hasn&amp;#39;t really been done before.&lt;/p&gt;\n\n&lt;p&gt;Gods and immortals don&amp;#39;t really follow these rules of sapient species. Gods made the immortals who in turn made the world and the races in it. The five immortal races are celestials, fiends, fey, dragons, and titans/giants. All tasked with creating their own portion of the material plane. But that&amp;#39;s another story.&lt;/p&gt;\n\n&lt;p&gt;The celestials made the mortal races, those being humans, elves, dwarves, orcs, and lesser giants (giantlings). Each one of those races had a continent all to themselves, but as they branched out and discovered each other, they found they could multiply with each other to create new species. These half-breeds or mixed races all have their own characteristics shared between their parent races, but have the distinct misfortune of not being able to breed with any other races other than their own half-race. Here&amp;#39;s a quick rundown of some of these half races.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Nymphs&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;What most settings would call half-elves. Their name is given to them by their human parent race as a sort of insult, as most elves are considered objectively beautiful, their creation is seen as a sort of giving in to lust. A distinct feature of nymphs is a sort of natural marking on their skin. They are unique to the individual, and often telling of personality or ability. Elves call these markings &amp;quot;brands&amp;quot; and see them as signs of impurity.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Halflings&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Born of dwarven and human parents. Their social human side and dwarven propensity for celebration make them a general fun-loving race. Their parent races also put a large emphasis on family and tradition, so it&amp;#39;s common to see halflings come together to establish settlements of their own, quaint humble communties spread across Tiron and greater Myteria. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Trolls&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;A common pairing, as humans and orcs were some of the first races to meet after the orcs were driven out of their homeland by dragons. Lighter-skinned, more intelligent orcs with legendary endurance. Some say their wounds heal faster than any other race. They serve as soldiers and guards in human societies, while taking up roles as diplomats, wise-men, and builders in orc cultures.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Goliaths&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Human and giant cross. Appear as seven to eight-foot-tall humans. Very impressionable, as they usually inherit humans&amp;#39; adaptability and lesser giant complacency. Considered a race of servants, and pretty much become whatever it is the people around them want them to be.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Gnomes&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Birthed from elves and dwarves. Brilliant, but very small and feeble. This makes them excellent scholars and spellcasters, as they are hindered even in their agility. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Ghouls&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The rare offspring of an elf and an orc. Cursed with a pitted, corpselike skin, they are given a name of the undead and feared by most society. This and their elven attunement to magic and their violent orcish tendencies make them excellent story fodder for outcast evil sorcerers. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Cyclopes&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If you haven&amp;#39;t noticed the theme with the elven half-breeds, they don&amp;#39;t like when elves breed with other races. Elves rather prefer their races pure, so they long ago cursed their mixed offspring to have marking defects: the nymph&amp;#39;s brand, the gnome&amp;#39;s tiny and feeble nature, the ghoul&amp;#39;s corpselike appearance, and the single eye of the cyclops. Other than this glaring feature, cyclopes are a wise and strong species, taking up a nomadic lifestyle in the northern deserts. Sometimes they function as wisemen in wandering lesser giant herds. They are large in size, personality, wit, strength, and goals. Not known for their subtlety.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Imps&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Orcs and dwarves produce this devilish trickster race. Most settings would call these individuals &amp;quot;goblins,&amp;quot; but that is more of a slur for weaker lowland orcs. Imps are often employed as assassins and burglars, and are said to pursue dwarven greed with orcish ferocity. As such, they are at the other end of the spectrum from cyclopes in terms of subtlety. They love making deals and contracts and usually always have an escape route planned. I often draw on Star Trek&amp;#39;s Ferengi when writing or playing them.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Ogres&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The children of orcs and lesser giants. Very strong, very reclusive, but not very fast, mentally or physically. They don&amp;#39;t mesh well with giants&amp;#39; nomadic lifestyles, and usually go off on their own to live off the land in a lair (or a swamp, perhaps?). Often sought after as shock troops or arena fighters. Some less savory characters capture orcs and giants and make them breed to produce powerful ogre soldiers.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Unmen&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Lesser giants and dwarves are not fond of one another. A long history of war and a massive size difference almost always puts them at odds. Thus, a cross between the two is so rare that no one is sure that they exist. There are many speculations of what may come from this pairing, but none are known to be true or false.\nI run tabletop games in this world of mine, and I use Unman as a free slot for players to play as a race, homebrew or otherwise, that doesn&amp;#39;t fall in line with the lore. &lt;/p&gt;\n\n&lt;p&gt;So yeah, not super original, lots of fantasy tropes, but I feel like I&amp;#39;ve structured it in a unique way that is integrated into the world and feels logical and sequential. Plus, as playable races in a tabletop, it gives a new nuance to playing a gnome or similar race. Again, people are often interested in this particular facet of the world, so I thought I&amp;#39;d share. Feel free to borrow ideas. I&amp;#39;ve been developing Tiron since 5th grade, but I haven&amp;#39;t really posted on here too often, so I&amp;#39;d love to answer questions and talk more about my world.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I hate that I'm making this post because it's such a typical \"well here's how MY world works\" kind of post, but I've seen a general interest in the topic. That topic being half-breeds and how they're handled in your setting. In my particular setting, (Tiron, a fantasy realm) there are only a few sapient races, but they've been able to mix into quite a few. It's an integral part of my world and as far as I've seen, it hasn't really been done before.\n\nGods and immortals don't really follow these rules of sapient species. Gods made the immortals who in turn made the world and the races in it. The five immortal races are celestials, fiends, fey, dragons, and titans/giants. All tasked with creating their own portion of the material plane. But that's another story.\n\nThe celestials made the mortal races, those being humans, elves, dwarves, orcs, and lesser giants (giantlings). Each one of those races had a continent all to themselves, but as they branched out and discovered each other, they found they could multiply with each other to create new species. These half-breeds or mixed races all have their own characteristics shared between their parent races, but have the distinct misfortune of not being able to breed with any other races other than their own half-race. Here's a quick rundown of some of these half races.\n\n\n**Nymphs**\n\nWhat most settings would call half-elves. Their name is given to them by their human parent race as a sort of insult, as most elves are considered objectively beautiful, their creation is seen as a sort of giving in to lust. A distinct feature of nymphs is a sort of natural marking on their skin. They are unique to the individual, and often telling of personality or ability. Elves call these markings \"brands\" and see them as signs of impurity.\n\n\n**Halflings**\n\nBorn of dwarven and human parents. Their social human side and dwarven propensity for celebration make them a general fun-loving race. Their parent races also put a large emphasis on family and tradition, so it's common to see halflings come together to establish settlements of their own, quaint humble communties spread across Tiron and greater Myteria. \n\n\n**Trolls**\n\nA common pairing, as humans and orcs were some of the first races to meet after the orcs were driven out of their homeland by dragons. Lighter-skinned, more intelligent orcs with legendary endurance. Some say their wounds heal faster than any other race. They serve as soldiers and guards in human societies, while taking up roles as diplomats, wise-men, and builders in orc cultures.\n\n\n**Goliaths**\n\nHuman and giant cross. Appear as seven to eight-foot-tall humans. Very impressionable, as they usually inherit humans' adaptability and lesser giant complacency. Considered a race of servants, and pretty much become whatever it is the people around them want them to be.\n\n\n**Gnomes**\n\nBirthed from elves and dwarves. Brilliant, but very small and feeble. This makes them excellent scholars and spellcasters, as they are hindered even in their agility. \n\n\n**Ghouls**\n\nThe rare offspring of an elf and an orc. Cursed with a pitted, corpselike skin, they are given a name of the undead and feared by most society. This and their elven attunement to magic and their violent orcish tendencies make them excellent story fodder for outcast evil sorcerers. \n\n\n**Cyclopes**\n\nIf you haven't noticed the theme with the elven half-breeds, they don't like when elves breed with other races. Elves rather prefer their races pure, so they long ago cursed their mixed offspring to have marking defects: the nymph's brand, the gnome's tiny and feeble nature, the ghoul's corpselike appearance, and the single eye of the cyclops. Other than this glaring feature, cyclopes are a wise and strong species, taking up a nomadic lifestyle in the northern deserts. Sometimes they function as wisemen in wandering lesser giant herds. They are large in size, personality, wit, strength, and goals. Not known for their subtlety.\n\n\n**Imps**\n\nOrcs and dwarves produce this devilish trickster race. Most settings would call these individuals \"goblins,\" but that is more of a slur for weaker lowland orcs. Imps are often employed as assassins and burglars, and are said to pursue dwarven greed with orcish ferocity. As such, they are at the other end of the spectrum from cyclopes in terms of subtlety. They love making deals and contracts and usually always have an escape route planned. I often draw on Star Trek's Ferengi when writing or playing them.\n\n\n**Ogres**\n\nThe children of orcs and lesser giants. Very strong, very reclusive, but not very fast, mentally or physically. They don't mesh well with giants' nomadic lifestyles, and usually go off on their own to live off the land in a lair (or a swamp, perhaps?). Often sought after as shock troops or arena fighters. Some less savory characters capture orcs and giants and make them breed to produce powerful ogre soldiers.\n\n\n**Unmen**\n\nLesser giants and dwarves are not fond of one another. A long history of war and a massive size difference almost always puts them at odds. Thus, a cross between the two is so rare that no one is sure that they exist. There are many speculations of what may come from this pairing, but none are known to be true or false.\nI run tabletop games in this world of mine, and I use Unman as a free slot for players to play as a race, homebrew or otherwise, that doesn't fall in line with the lore. \n\nSo yeah, not super original, lots of fantasy tropes, but I feel like I've structured it in a unique way that is integrated into the world and feels logical and sequential. Plus, as playable races in a tabletop, it gives a new nuance to playing a gnome or similar race. Again, people are often interested in this particular facet of the world, so I thought I'd share. Feel free to borrow ideas. I've been developing Tiron since 5th grade, but I haven't really posted on here too often, so I'd love to answer questions and talk more about my world.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "📖Lore", "id": "65dwq2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 37, "report_reasons": null, "author": "FatChalupa", "saved": false, "mod_reports": [], "name": "t3_65dwq2", "subreddit_name_prefixed": "r/worldbuilding", "approved_by": null, "over_18": false, "domain": "self.worldbuilding", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rd6n", "edited": 1492197833.0, "link_flair_css_class": "lore", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/worldbuilding/comments/65dwq2/most_of_my_races_are_halfbreeds_and_heres_how/", "num_reports": null, "locked": false, "stickied": false, "created": 1492219788.0, "url": "https://www.reddit.com/r/worldbuilding/comments/65dwq2/most_of_my_races_are_halfbreeds_and_heres_how/", "author_flair_text": null, "quarantine": false, "title": "Most of my races are half-breeds, and here's how.", "created_utc": 1492190988.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 37}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dwq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dwq2", "likes": null, "replies": "", "user_reports": [], "id": "dg9pqom", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "FatChalupa", "parent_id": "t1_dg9okt0", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "I've had a couple of ideas for unmen. One was that they would look just like humans but maybe have some very deeply hidden dwarf/giant traits that could give them away. Would make them good spies. The other is maybe a sort of hairy, stocky race as you said. Haven't got far enough to really flesh that out, because the already existing races are already giving me plenty of opportunities to tell interesting stories.\n\nI've written quite a lot about early Tiron and have a novel draft done. The only races in contact in the books are humans and orcs, but there are whispers of pointy-eared sailors and lumbering giant men in faraway lands. Most of the games I run in the world take place hundreds of years after the books, where the mortal races are still sort of fresh to one another. It's a nice collaborative process of my players helping build the later years of the world. So unmen haven't quite happened yet, but if a player decides to play as one, I suppose we'd have to collaborate and determine what that would look like. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had a couple of ideas for unmen. One was that they would look just like humans but maybe have some very deeply hidden dwarf/giant traits that could give them away. Would make them good spies. The other is maybe a sort of hairy, stocky race as you said. Haven&amp;#39;t got far enough to really flesh that out, because the already existing races are already giving me plenty of opportunities to tell interesting stories.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve written quite a lot about early Tiron and have a novel draft done. The only races in contact in the books are humans and orcs, but there are whispers of pointy-eared sailors and lumbering giant men in faraway lands. Most of the games I run in the world take place hundreds of years after the books, where the mortal races are still sort of fresh to one another. It&amp;#39;s a nice collaborative process of my players helping build the later years of the world. So unmen haven&amp;#39;t quite happened yet, but if a player decides to play as one, I suppose we&amp;#39;d have to collaborate and determine what that would look like. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9pqom", "score_hidden": false, "stickied": false, "created": 1492231074.0, "created_utc": 1492202274.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9okt0", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "LorumScholar", "parent_id": "t3_65dwq2", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "I admit I was a bit skeptical at first, but this re-working of traditional fantasy races is great, well done! It feels logical to me that unmen would be stocky, human-sized, and celebratory. If you were to write a book with one or two unmen characters, what would they be like?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I admit I was a bit skeptical at first, but this re-working of traditional fantasy races is great, well done! It feels logical to me that unmen would be stocky, human-sized, and celebratory. If you were to write a book with one or two unmen characters, what would they be like?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9okt0", "score_hidden": false, "stickied": false, "created": 1492229671.0, "created_utc": 1492200871.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dwq2", "likes": null, "replies": "", "user_reports": [], "id": "dg9tft6", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "lloyd094", "parent_id": "t3_65dwq2", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "I'll be honest, I've had a similar theme in my head for a while, so it made me laugh when I read this. Very well explained however - looks like you've had plenty of good thought put into this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll be honest, I&amp;#39;ve had a similar theme in my head for a while, so it made me laugh when I read this. Very well explained however - looks like you&amp;#39;ve had plenty of good thought put into this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9tft6", "score_hidden": false, "stickied": false, "created": 1492235726.0, "created_utc": 1492206926.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dwq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dwq2", "likes": null, "replies": "", "user_reports": [], "id": "dg9h7zo", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "FatChalupa", "parent_id": "t1_dg9gupy", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Well the rule in Tiron is that the halfbreeds are infertile to all but their own half race. So like a mule, the mixing stops at one generation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well the rule in Tiron is that the halfbreeds are infertile to all but their own half race. So like a mule, the mixing stops at one generation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9h7zo", "score_hidden": false, "stickied": false, "created": 1492220865.0, "created_utc": 1492192065.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9gupy", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "surrogate667", "parent_id": "t3_65dwq2", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "The problem with half breeds that makes me generally avoid having them in my settings is the question of what you'd call two half breeds of different combinations who breeded together. What would a gnome + nymph be called? A gnome + human or elf? An ogre and imp? A goliath and troll? Where and how would this madness end? Of course, just having to think of all the potential combinations from pure races is too crazy for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem with half breeds that makes me generally avoid having them in my settings is the question of what you&amp;#39;d call two half breeds of different combinations who breeded together. What would a gnome + nymph be called? A gnome + human or elf? An ogre and imp? A goliath and troll? Where and how would this madness end? Of course, just having to think of all the potential combinations from pure races is too crazy for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9gupy", "score_hidden": false, "stickied": false, "created": 1492220439.0, "created_utc": 1492191639.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dwq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dwq2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65dwq2", "likes": null, "replies": "", "user_reports": [], "id": "dg9m9cr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "LightTankTerror", "parent_id": "t1_dg9lr76", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "That would get rather hectic, good planning on that front!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That would get rather hectic, good planning on that front!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9m9cr", "score_hidden": false, "stickied": false, "created": 1492226887.0, "created_utc": 1492198087.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9lr76", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "FatChalupa", "parent_id": "t1_dg9kwkc", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "The halfling can only have children with another halfling. No other race would be compatible. Imps can only have children with imps, and so on and so forth. The interbreeding ceases after the first generation, so pure/full races are the only ones who really have the benefit of having a child with whomever they please, other than a half-race.\n\nEssentially, if you're a purebred, you can have a child with any other purebred. If you're a half-breed, you can only have a child with another half-breed of your exact same variety. Think horses, donkeys, and mules. \n\nIt makes an interesting dynamic for most half-breed characters. They can either find another of their kind and start a family, or they can carry on their legacy by doing something worth remembering.\n\nIt also makes things more convenient and less hectic, so there's no 1/16 dwarf or 1/8 orc or such complications in worldbuilding.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The halfling can only have children with another halfling. No other race would be compatible. Imps can only have children with imps, and so on and so forth. The interbreeding ceases after the first generation, so pure/full races are the only ones who really have the benefit of having a child with whomever they please, other than a half-race.&lt;/p&gt;\n\n&lt;p&gt;Essentially, if you&amp;#39;re a purebred, you can have a child with any other purebred. If you&amp;#39;re a half-breed, you can only have a child with another half-breed of your exact same variety. Think horses, donkeys, and mules. &lt;/p&gt;\n\n&lt;p&gt;It makes an interesting dynamic for most half-breed characters. They can either find another of their kind and start a family, or they can carry on their legacy by doing something worth remembering.&lt;/p&gt;\n\n&lt;p&gt;It also makes things more convenient and less hectic, so there&amp;#39;s no 1/16 dwarf or 1/8 orc or such complications in worldbuilding.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9lr76", "score_hidden": false, "stickied": false, "created": 1492226275.0, "created_utc": 1492197475.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9kwkc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "LightTankTerror", "parent_id": "t3_65dwq2", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "So what happens to the second generation? For example, a human and a dwarf create a halfling child. If this halfling were to create a child with a dwarf, what would be the result? \n\nCan half-races interact with other half races with a similar half (example: halfling and imp), and what would they produce fif they can?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So what happens to the second generation? For example, a human and a dwarf create a halfling child. If this halfling were to create a child with a dwarf, what would be the result? &lt;/p&gt;\n\n&lt;p&gt;Can half-races interact with other half races with a similar half (example: halfling and imp), and what would they produce fif they can?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9kwkc", "score_hidden": false, "stickied": false, "created": 1492225246.0, "created_utc": 1492196446.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]