[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "worldbuilding", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Occasionally a realistic fiction writer will talk about the parties in their parliamentary or constitutional democracies, but what about monarchies, theocracies, or noble or merchant republics? What various factions arise out of the different considerations of fantastical or sci-fi governments, even those that are not accountable to the people at large? Are there magical guilds, religious divides, military orders? Who keeps breathing down the King&amp;#39;s neck?&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;As always, try to comment on two other posts, with a preference for those with less comments&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Occasionally a realistic fiction writer will talk about the parties in their parliamentary or constitutional democracies, but what about monarchies, theocracies, or noble or merchant republics? What various factions arise out of the different considerations of fantastical or sci-fi governments, even those that are not accountable to the people at large? Are there magical guilds, religious divides, military orders? Who keeps breathing down the King's neck?\n\n- As always, try to comment on two other posts, with a preference for those with less comments", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "🤓Prompt", "id": "65e5na", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 34, "report_reasons": null, "author": "Calvinist-Transhuman", "saved": false, "mod_reports": [], "name": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "approved_by": null, "over_18": false, "domain": "self.worldbuilding", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rd6n", "edited": false, "link_flair_css_class": "prompt", "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/worldbuilding/comments/65e5na/describe_the_political_factionsparties_in/", "num_reports": null, "locked": false, "stickied": false, "created": 1492222145.0, "url": "https://www.reddit.com/r/worldbuilding/comments/65e5na/describe_the_political_factionsparties_in/", "author_flair_text": "Reichsschwert: 30 Yrs War of Space China", "quarantine": false, "title": "Describe the political factions/parties in governments that are not democracies!", "created_utc": 1492193345.0, "distinguished": null, "media": null, "upvote_ratio": 0.98, "num_comments": 47, "visited": false, "subreddit_type": "public", "ups": 34}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dg9q5mx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Calvinist-Transhuman", "parent_id": "t1_dg9oo5y", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Thanks; I read your post, and I like your fresh handling of the old plutocracy trope.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks; I read your post, and I like your fresh handling of the old plutocracy trope.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9q5mx", "score_hidden": false, "stickied": false, "created": 1492231572.0, "created_utc": 1492202772.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9oo5y", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MarkIsNotAShark", "parent_id": "t1_dg9jpuv", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "I love your sense of deep history. Your mix of old and new institutions makes this government feel very real and robust", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love your sense of deep history. Your mix of old and new institutions makes this government feel very real and robust&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9oo5y", "score_hidden": false, "stickied": false, "created": 1492229782.0, "created_utc": 1492200982.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9jpuv", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Calvinist-Transhuman", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "The **Nine King's Confederation** is delicate balancing act for the current appointed War Leader, Tleukos. Firstly, he must keep in mind the eponymous **Nine Kings**, of which he is not one. These Nine (which actually include two Lords and a Prince) are descended from the quasi-mythological Khymeragh hero known as the Brennus, and are simultaneously the monarchs of the Nine Kingdoms and chieftains of specific tribes of those those kingdoms (though they are not always the head of the clans within these tribes!). These Nine include the disparate interests of Star Khymeraghs (such as the King of Suns and the Fire Prince) and the Void Khymeraghs (such as the Raven Lord and the Flayer King), as well as all the various combinations thereof, but in general they prefer to centralize their power over their Khymeragh subjects, often by tightening up the rules of succession (some are elected monarchies, or tanistries) and by introducing non-Khymeragh servants who are loyal entirely to them, and who supersede clan divisions. This is not to say that the Kings are unfied; they bicker endlessly (and not always bloodlessly) amongst themselves, and whilst none but the manic Vercyngetorix have openly defied Tleukos yet, they are highly suspicious of his marriage to the Raven Lady (a fluke which inadvertantly makes him appear to be seeking equal status with them), and his popularity with the half-bloods. Nonetheless, they are a valuable bulwark against the more traditional elements of Khymeragh culture.\n\nAs mentioned above, **Tribal and Clan Divisions** are central to Khymeragh culture, moreso than any Royal government (clan wars are onto slightly less common between Kingdoms than within them), and these prove the greatest challenge to any central Khymeragh kingdom. Not a day goes by without reports of one clan fleet firing upon another, and it is only the skillful hands of all Nine Kings and Tleukos which prevent open war from breaking out.\n\n**The Druids** were once far more important to society; in pagan days they were virtual despots, and when the Khyemraghs became Trioists, the division's between the Refinery and Syncretic parties gave them only slightly less power. After the mass purging of the Refinerists a generation ago, however, the power of even Syncretic Druids has begun to sink, as clan divisions move back to the forefront.\n\nThe next faction are the elusive **military orders**, of which the Boar Warriors, Raven Warriors, and Salmon Warriors are the most prominent. These favor heavy honor codes, as well as rules on who can own certain weapons (mainly swords) and who can wear what type of clothing. They have an odd relationship with the Druid factions which they used to be a part of back in pagan times, but since the mass conversion of the Khymeraghs to Triost faith, the exact relationship between these two groups has grown a bit blurred. They are generally disfavorable to Tleukos, who they view as too happy with using Human military science, though he is able to accrue the loyalty of some of them by playing off of the jealousies between the various orders, and by bribes out of his own pocket, wherewith he acquires the aid of their highly skilled warriors.\n\nThe next most imporant faction is the **mix breeds**, part human and part Kymeragh, who are some of Tleukos' most ardent supporters, as it is commonly though that he is of mixed blood himself. As the mix-bloods are eager to prove that they are not at all like their human cousins, these are often the most fanatically anti-human, massacring human captives and strewing their body parts across their ships. Some radicals even insist on making Tleukos king in place of the Nine, though Tleukos himself repeatedly denounces this group. This fanaticism obviously offsets humans, but pure-blood Khymeraghs often find their over-enthusiasm rather gauche, or even hypocritical.\n\nFinally, their are the vast populations of **Void Humans**, who, whilst invariably spoken of in the same breath as the hated Eternal Human Empire, are often of bloodlines which plied the Void before Cleombrotus ever founded that empire; some say the Void was full of Humans before Khymeraghs even existed. The position of Humans in Khymeragh society varies greatly, from the totally meritocratic (which nonetheless often results in Humans in less honorable positions, as they cannot hope to match Khymeraghs in warfare), to ritually enforced servitude. These hold little power, but their sheer number means their compliance is nonetheless valuable to any potential ruler. However, as the Khymeragh factions grow more and more disparate, Tleukos finds that the only way to hold them together is increasingly vehement anti-human rhetoric. Only time will tell if this ancient people will come out better or worse from this generation.", "edited": 1492203061.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The &lt;strong&gt;Nine King&amp;#39;s Confederation&lt;/strong&gt; is delicate balancing act for the current appointed War Leader, Tleukos. Firstly, he must keep in mind the eponymous &lt;strong&gt;Nine Kings&lt;/strong&gt;, of which he is not one. These Nine (which actually include two Lords and a Prince) are descended from the quasi-mythological Khymeragh hero known as the Brennus, and are simultaneously the monarchs of the Nine Kingdoms and chieftains of specific tribes of those those kingdoms (though they are not always the head of the clans within these tribes!). These Nine include the disparate interests of Star Khymeraghs (such as the King of Suns and the Fire Prince) and the Void Khymeraghs (such as the Raven Lord and the Flayer King), as well as all the various combinations thereof, but in general they prefer to centralize their power over their Khymeragh subjects, often by tightening up the rules of succession (some are elected monarchies, or tanistries) and by introducing non-Khymeragh servants who are loyal entirely to them, and who supersede clan divisions. This is not to say that the Kings are unfied; they bicker endlessly (and not always bloodlessly) amongst themselves, and whilst none but the manic Vercyngetorix have openly defied Tleukos yet, they are highly suspicious of his marriage to the Raven Lady (a fluke which inadvertantly makes him appear to be seeking equal status with them), and his popularity with the half-bloods. Nonetheless, they are a valuable bulwark against the more traditional elements of Khymeragh culture.&lt;/p&gt;\n\n&lt;p&gt;As mentioned above, &lt;strong&gt;Tribal and Clan Divisions&lt;/strong&gt; are central to Khymeragh culture, moreso than any Royal government (clan wars are onto slightly less common between Kingdoms than within them), and these prove the greatest challenge to any central Khymeragh kingdom. Not a day goes by without reports of one clan fleet firing upon another, and it is only the skillful hands of all Nine Kings and Tleukos which prevent open war from breaking out.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Druids&lt;/strong&gt; were once far more important to society; in pagan days they were virtual despots, and when the Khyemraghs became Trioists, the division&amp;#39;s between the Refinery and Syncretic parties gave them only slightly less power. After the mass purging of the Refinerists a generation ago, however, the power of even Syncretic Druids has begun to sink, as clan divisions move back to the forefront.&lt;/p&gt;\n\n&lt;p&gt;The next faction are the elusive &lt;strong&gt;military orders&lt;/strong&gt;, of which the Boar Warriors, Raven Warriors, and Salmon Warriors are the most prominent. These favor heavy honor codes, as well as rules on who can own certain weapons (mainly swords) and who can wear what type of clothing. They have an odd relationship with the Druid factions which they used to be a part of back in pagan times, but since the mass conversion of the Khymeraghs to Triost faith, the exact relationship between these two groups has grown a bit blurred. They are generally disfavorable to Tleukos, who they view as too happy with using Human military science, though he is able to accrue the loyalty of some of them by playing off of the jealousies between the various orders, and by bribes out of his own pocket, wherewith he acquires the aid of their highly skilled warriors.&lt;/p&gt;\n\n&lt;p&gt;The next most imporant faction is the &lt;strong&gt;mix breeds&lt;/strong&gt;, part human and part Kymeragh, who are some of Tleukos&amp;#39; most ardent supporters, as it is commonly though that he is of mixed blood himself. As the mix-bloods are eager to prove that they are not at all like their human cousins, these are often the most fanatically anti-human, massacring human captives and strewing their body parts across their ships. Some radicals even insist on making Tleukos king in place of the Nine, though Tleukos himself repeatedly denounces this group. This fanaticism obviously offsets humans, but pure-blood Khymeraghs often find their over-enthusiasm rather gauche, or even hypocritical.&lt;/p&gt;\n\n&lt;p&gt;Finally, their are the vast populations of &lt;strong&gt;Void Humans&lt;/strong&gt;, who, whilst invariably spoken of in the same breath as the hated Eternal Human Empire, are often of bloodlines which plied the Void before Cleombrotus ever founded that empire; some say the Void was full of Humans before Khymeraghs even existed. The position of Humans in Khymeragh society varies greatly, from the totally meritocratic (which nonetheless often results in Humans in less honorable positions, as they cannot hope to match Khymeraghs in warfare), to ritually enforced servitude. These hold little power, but their sheer number means their compliance is nonetheless valuable to any potential ruler. However, as the Khymeragh factions grow more and more disparate, Tleukos finds that the only way to hold them together is increasingly vehement anti-human rhetoric. Only time will tell if this ancient people will come out better or worse from this generation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9jpuv", "score_hidden": false, "stickied": false, "created": 1492223822.0, "created_utc": 1492195022.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dg9od3k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sriber", "parent_id": "t1_dg9o7t8", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "They are \"parties\" in equivalent of federal parliament of Union of Akhyraisar (the most powerful country in the world). During events of series my world is technologically and socially similar to late antiquity/early middle ages.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They are &amp;quot;parties&amp;quot; in equivalent of federal parliament of Union of Akhyraisar (the most powerful country in the world). During events of series my world is technologically and socially similar to late antiquity/early middle ages.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9od3k", "score_hidden": false, "stickied": false, "created": 1492229415.0, "created_utc": 1492200615.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9o7t8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HippyxViking", "parent_id": "t1_dg9k8hh", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Can you give us the summary context? What kind of world is this, what are we even talking about? \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you give us the summary context? What kind of world is this, what are we even talking about? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9o7t8", "score_hidden": false, "stickied": false, "created": 1492229238.0, "created_utc": 1492200438.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dg9mrw6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sriber", "parent_id": "t1_dg9meio", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Less confusing Holy Roman Empire. It's federation ruled be leaders consisting of 40 kingdoms ruled by kings.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Less confusing Holy Roman Empire. It&amp;#39;s federation ruled be leaders consisting of 40 kingdoms ruled by kings.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9mrw6", "score_hidden": false, "stickied": false, "created": 1492227501.0, "created_utc": 1492198701.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9meio", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Calvinist-Transhuman", "parent_id": "t1_dg9m9wr", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Ah. Is it more akin to the Polish Lithuanian Commonwealth or the Holy Roman Empire?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah. Is it more akin to the Polish Lithuanian Commonwealth or the Holy Roman Empire?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9meio", "score_hidden": false, "stickied": false, "created": 1492227059.0, "created_utc": 1492198259.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9m9wr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sriber", "parent_id": "t1_dg9kszj", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Election campaign.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Election campaign.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9m9wr", "score_hidden": false, "stickied": false, "created": 1492226905.0, "created_utc": 1492198105.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9kszj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Calvinist-Transhuman", "parent_id": "t1_dg9k8hh", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Can explain the context in which these catchwords are used?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can explain the context in which these catchwords are used?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9kszj", "score_hidden": false, "stickied": false, "created": 1492225128.0, "created_utc": 1492196328.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9k8hh", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Sriber", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "I'll use catchwords, if that's OK.\n\n**Namxurgvar** - Liberty and equality for all our people and expansion through peaceful means!\n\n**Gurvgvar** - Liberty and equality for all our people and focusing on domestic issues!\n\n**Nogvar** - Let's use our strength to subjugate others and gain resources!\n\n**Neomgvar** - Subjugating others is will of the gods!\n\n**Brengvar** - Hegemony through peaceful means!\n\n**Xungvar** - Keeping good old days and cultural purity, assimilate rest!\n\n**Frithgvar** - Let's create better society and inspire other to become like us!\n\n**Frelgvar** - More power to the people and focusing on domestic issues!\n\n**Makgvar** - Keeping cultures separate and country from outside influences!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll use catchwords, if that&amp;#39;s OK.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Namxurgvar&lt;/strong&gt; - Liberty and equality for all our people and expansion through peaceful means!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Gurvgvar&lt;/strong&gt; - Liberty and equality for all our people and focusing on domestic issues!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Nogvar&lt;/strong&gt; - Let&amp;#39;s use our strength to subjugate others and gain resources!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Neomgvar&lt;/strong&gt; - Subjugating others is will of the gods!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Brengvar&lt;/strong&gt; - Hegemony through peaceful means!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Xungvar&lt;/strong&gt; - Keeping good old days and cultural purity, assimilate rest!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Frithgvar&lt;/strong&gt; - Let&amp;#39;s create better society and inspire other to become like us!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Frelgvar&lt;/strong&gt; - More power to the people and focusing on domestic issues!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Makgvar&lt;/strong&gt; - Keeping cultures separate and country from outside influences!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9k8hh", "score_hidden": false, "stickied": false, "created": 1492224439.0, "created_utc": 1492195639.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dgatjdk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "criticaltortoise", "parent_id": "t1_dg9ttot", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "The Terran Empire is a bit complicated. The best way to describe it is as a sort of odd federal/neo-feudal system. The Houses serve the function of both administrative subdivision *and* political party/faction. \n\nImagine if in the United States, California and New York were each only run by one political party that was legally the only party that could run the state and each led a grand alliance of like-minded states. That's sort of the situation that's going on here, though even that is oversimplifying it.\n\nThe Grand Houses don't really fit cleanly into any one sort of political apparatus in the modern sense. They're faction and government combined into one entity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Terran Empire is a bit complicated. The best way to describe it is as a sort of odd federal/neo-feudal system. The Houses serve the function of both administrative subdivision &lt;em&gt;and&lt;/em&gt; political party/faction. &lt;/p&gt;\n\n&lt;p&gt;Imagine if in the United States, California and New York were each only run by one political party that was legally the only party that could run the state and each led a grand alliance of like-minded states. That&amp;#39;s sort of the situation that&amp;#39;s going on here, though even that is oversimplifying it.&lt;/p&gt;\n\n&lt;p&gt;The Grand Houses don&amp;#39;t really fit cleanly into any one sort of political apparatus in the modern sense. They&amp;#39;re faction and government combined into one entity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dgatjdk", "score_hidden": false, "stickied": false, "created": 1492301702.0, "created_utc": 1492272902.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ttot", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jowijo", "parent_id": "t1_dg9nle8", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "That's incredibly fascinating actually. I love the depth and history behind all of this. One thing that wasn't clear to me however, is are these two coalitions separate nations (a la England/Scotland in the UK?), or two factions of politics and nobility within one unitary kingdom?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s incredibly fascinating actually. I love the depth and history behind all of this. One thing that wasn&amp;#39;t clear to me however, is are these two coalitions separate nations (a la England/Scotland in the UK?), or two factions of politics and nobility within one unitary kingdom?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9ttot", "score_hidden": false, "stickied": false, "created": 1492236222.0, "created_utc": 1492207422.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9nle8", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "criticaltortoise", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "The Terran Empire's nobility is, at present, broadly divided into two coalitions, usually referred to as the **Tyrus bloc** and the **Trevelyan-Systra bloc**, each named for the Grand Houses that head the coalitions within the Grand Council (the closest thing the Empire has to a parliament).\n\nTheir feud is centuries-long and dates back to the founding of House Tyrus about 300 years ago, which happened specifically as a reaction to unchecked power on part of House Trevelyan, House Systra, and their allies and vassals, and disagreements over the structure of the Terran government. Today, the two sides frequently scheme against each other. Recently, House Tyrus had their Emperor on the Throne, but after a massive scandal involving misappropriation of funding and lots of adultery and other personal vices, he was ousted and replaced by a Trevelyan-backed Emperor (who himself is controversial because of a perceived lack of independence from the coalition despite him not actually being a Trevelyan or Systra member).\n\nThe current point of contention is the role of commoners in Terran society -- the Trevelyan-Systra coalition has repeatedly tried and failed to insitute a full Imperial Parliament complete with a House of Commons alongside the Grand Council -- that is, to allow limited representative democracy -- where the Tyrus coalition seeks to further push the old aristocratic system, with some Tyrus hardliners even saying that the Emperor should be a hereditary position instead of elective within the nobility.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Terran Empire&amp;#39;s nobility is, at present, broadly divided into two coalitions, usually referred to as the &lt;strong&gt;Tyrus bloc&lt;/strong&gt; and the &lt;strong&gt;Trevelyan-Systra bloc&lt;/strong&gt;, each named for the Grand Houses that head the coalitions within the Grand Council (the closest thing the Empire has to a parliament).&lt;/p&gt;\n\n&lt;p&gt;Their feud is centuries-long and dates back to the founding of House Tyrus about 300 years ago, which happened specifically as a reaction to unchecked power on part of House Trevelyan, House Systra, and their allies and vassals, and disagreements over the structure of the Terran government. Today, the two sides frequently scheme against each other. Recently, House Tyrus had their Emperor on the Throne, but after a massive scandal involving misappropriation of funding and lots of adultery and other personal vices, he was ousted and replaced by a Trevelyan-backed Emperor (who himself is controversial because of a perceived lack of independence from the coalition despite him not actually being a Trevelyan or Systra member).&lt;/p&gt;\n\n&lt;p&gt;The current point of contention is the role of commoners in Terran society -- the Trevelyan-Systra coalition has repeatedly tried and failed to insitute a full Imperial Parliament complete with a House of Commons alongside the Grand Council -- that is, to allow limited representative democracy -- where the Tyrus coalition seeks to further push the old aristocratic system, with some Tyrus hardliners even saying that the Emperor should be a hereditary position instead of elective within the nobility.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9nle8", "score_hidden": false, "stickied": false, "created": 1492228490.0, "created_utc": 1492199690.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dg9qhvx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "surrogate667", "parent_id": "t1_dg9qfz8", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Yeah, you caught me, there's the etymology :P", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, you caught me, there&amp;#39;s the etymology :P&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9qhvx", "score_hidden": false, "stickied": false, "created": 1492231985.0, "created_utc": 1492203185.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9qfz8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Calvinist-Transhuman", "parent_id": "t1_dg9ll80", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Sassanid+Assyria=Sassyria?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sassanid+Assyria=Sassyria?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9qfz8", "score_hidden": false, "stickied": false, "created": 1492231921.0, "created_utc": 1492203121.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ll80", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "surrogate667", "parent_id": "t1_dg9let5", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "It's actually Persian/Egyptian/Fertile Crescent influence, no Arab or Islamic influence here. Their neighbours, the orcs, have more Islamic/Arab influence. They get mad at the dark elves over things that the dark elves think are perfectly fine and normal. : ^ )", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s actually Persian/Egyptian/Fertile Crescent influence, no Arab or Islamic influence here. Their neighbours, the orcs, have more Islamic/Arab influence. They get mad at the dark elves over things that the dark elves think are perfectly fine and normal. : ^ )&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9ll80", "score_hidden": false, "stickied": false, "created": 1492226074.0, "created_utc": 1492197274.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9let5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DutchFarmers", "parent_id": "t1_dg9jsc5", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Oh shit elves with Islamic/Arab influence? That sounds really interesting. How deep does the influence go?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh shit elves with Islamic/Arab influence? That sounds really interesting. How deep does the influence go?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9let5", "score_hidden": false, "stickied": false, "created": 1492225862.0, "created_utc": 1492197062.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9jsc5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "surrogate667", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "The **Faladrim** *(dark elves)* are ruled by mages, with the most powerful one serving as king (shah). Two of the great houses, **House Magasta** and **House Behistia**, are the mages, many of them necromancers, who were always there in exile, while the other two are made up of peoples from the remains of the Faladrim empire before it shattered due to invasion and moral decay. By both law and tradition, these people who once treated the mages as lepers but came crawling back to them are known as the **Remnants of Sassyria** and the **Remnants of Nilathia**. These titles help them to always remember what happened and to avoid repeating the same mistakes, some of them choose to wear these titles with pride. As time has passed, these two once great houses are actually on nearly equal grounds with the mages. These four groups living together ensures that there is always potential for conflict, as some within the Remnants harbour desire for vengeance and power, and they tend to have the most military force due to their numbers and what they focus on.\n\n*[I'll just stick with four factions lol]*", "edited": 1492197470.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The &lt;strong&gt;Faladrim&lt;/strong&gt; &lt;em&gt;(dark elves)&lt;/em&gt; are ruled by mages, with the most powerful one serving as king (shah). Two of the great houses, &lt;strong&gt;House Magasta&lt;/strong&gt; and &lt;strong&gt;House Behistia&lt;/strong&gt;, are the mages, many of them necromancers, who were always there in exile, while the other two are made up of peoples from the remains of the Faladrim empire before it shattered due to invasion and moral decay. By both law and tradition, these people who once treated the mages as lepers but came crawling back to them are known as the &lt;strong&gt;Remnants of Sassyria&lt;/strong&gt; and the &lt;strong&gt;Remnants of Nilathia&lt;/strong&gt;. These titles help them to always remember what happened and to avoid repeating the same mistakes, some of them choose to wear these titles with pride. As time has passed, these two once great houses are actually on nearly equal grounds with the mages. These four groups living together ensures that there is always potential for conflict, as some within the Remnants harbour desire for vengeance and power, and they tend to have the most military force due to their numbers and what they focus on.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;[I&amp;#39;ll just stick with four factions lol]&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9jsc5", "score_hidden": false, "stickied": false, "created": 1492223904.0, "created_utc": 1492195104.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dg9llfx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DutchFarmers", "parent_id": "t1_dg9lbew", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Back when I wrote the story Brexit wasn't a thing but yeah it's really, really pertinent to today's political climate which is a little unfortunate ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Back when I wrote the story Brexit wasn&amp;#39;t a thing but yeah it&amp;#39;s really, really pertinent to today&amp;#39;s political climate which is a little unfortunate &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9llfx", "score_hidden": false, "stickied": false, "created": 1492226081.0, "created_utc": 1492197281.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9lbew", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Calvinist-Transhuman", "parent_id": "t1_dg9l68i", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Sounds like a metaphor for a certain Euroean political bloc...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like a metaphor for a certain Euroean political bloc...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9lbew", "score_hidden": false, "stickied": false, "created": 1492225751.0, "created_utc": 1492196951.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dg9nnap", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Arakkoa_", "parent_id": "t1_dg9l68i", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "How does a feudal society work with democratic elements? Where are those elements, exactly?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How does a feudal society work with democratic elements? Where are those elements, exactly?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9nnap", "score_hidden": false, "stickied": false, "created": 1492228555.0, "created_utc": 1492199755.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9l68i", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DutchFarmers", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "I wrote a novel over the summer last year and it was based in a feudal society with some democratic ideas implanted in the government. \n\nThe two parties that threatened to rip the nation apart were the Royalists and the Anti-Royalists. \n\nThe Royalists were obviously in favor of keeping the current monarchy, arguing that the individual counties were stronger together than apart. They also feared that larger counties would take this opportunity to invade smaller ones. Believed that the centralized power of the monarchy was important to retain stability throughout the country and prevent the various issues of the past. \n\nAnti-Royalist is actually a misnomer because the members of this party aren't actually anti-royality. They're just anti-union/feudalism. They don't like the current system of having a king ruling over various lords and ladies who could easily be kings or emperors in their own right. Anti-Royalists don't think it's fair to be in a union that offers them no real benefits. They argue that even if the union they have established breaks down there is no threat of invasion as they have centuries of established history and treaties can still be formed. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wrote a novel over the summer last year and it was based in a feudal society with some democratic ideas implanted in the government. &lt;/p&gt;\n\n&lt;p&gt;The two parties that threatened to rip the nation apart were the Royalists and the Anti-Royalists. &lt;/p&gt;\n\n&lt;p&gt;The Royalists were obviously in favor of keeping the current monarchy, arguing that the individual counties were stronger together than apart. They also feared that larger counties would take this opportunity to invade smaller ones. Believed that the centralized power of the monarchy was important to retain stability throughout the country and prevent the various issues of the past. &lt;/p&gt;\n\n&lt;p&gt;Anti-Royalist is actually a misnomer because the members of this party aren&amp;#39;t actually anti-royality. They&amp;#39;re just anti-union/feudalism. They don&amp;#39;t like the current system of having a king ruling over various lords and ladies who could easily be kings or emperors in their own right. Anti-Royalists don&amp;#39;t think it&amp;#39;s fair to be in a union that offers them no real benefits. They argue that even if the union they have established breaks down there is no threat of invasion as they have centuries of established history and treaties can still be formed. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9l68i", "score_hidden": false, "stickied": false, "created": 1492225570.0, "created_utc": 1492196770.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dg9nk5o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Arakkoa_", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Most common people in the Irden Empire are kept brainwashed by government propaganda. Dwarven children will drown themselves saving portraits of the Emperor and spit upon a human acting out against his dwarven lord. They just never get to see an alternative.\n\nHowever, the higher rungs on the ladder of society are smart, educated and ambitious enough to know the Emperor is just a man and it's people like them - usually, literally them - that keep him in power. But they're not dissidents - oh no. They simply seek to use those facts for their own gain.\n\nThe major faction pressing the crown is composed of young or older, jingoistic dwarves. The Empire has been stagnating for centuries, ever since it signed the Gnadra Accords. The documents limits when and how they can conquer worlds and the elites *hate it*. They press on the Emperor to act and move on the unexploited worlds right beyond their borders, Accords be damned.\n\nWhat they don't know is that the current Emperor is acting more than any of his recent predecessors - but he's doing it rather clandestinely. Unlike his father, who would make a show of executing his political opponents on trumped up charges of treason; and unlike his great-great-grandfather, the Emperor during and before the Xa'tac War, who ruthlessly conquered numerous worlds, literally spitting in the face of a Gnadra ambassador, he's doing things quietly. He colluded with a secretly anarchist, pseudo-conservatist \"journalist\" in the Gnadra society who wants to destroy their state and they're working on faking their Chancellor elections to put a clownish buffoon of a puppet in the chair.\n\nBecause it's a militaristic society obsessed with order and tradition, they rarely dissent towards more peaceful matters. The more loyal and less aggressive generals and weltkomissars seek inward perfection. They want less wars not because they're nice... it's because they want to clean their society up, exterminate all the monsters (read: sentient races that don't fit their order) and put everyone where they belong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most common people in the Irden Empire are kept brainwashed by government propaganda. Dwarven children will drown themselves saving portraits of the Emperor and spit upon a human acting out against his dwarven lord. They just never get to see an alternative.&lt;/p&gt;\n\n&lt;p&gt;However, the higher rungs on the ladder of society are smart, educated and ambitious enough to know the Emperor is just a man and it&amp;#39;s people like them - usually, literally them - that keep him in power. But they&amp;#39;re not dissidents - oh no. They simply seek to use those facts for their own gain.&lt;/p&gt;\n\n&lt;p&gt;The major faction pressing the crown is composed of young or older, jingoistic dwarves. The Empire has been stagnating for centuries, ever since it signed the Gnadra Accords. The documents limits when and how they can conquer worlds and the elites &lt;em&gt;hate it&lt;/em&gt;. They press on the Emperor to act and move on the unexploited worlds right beyond their borders, Accords be damned.&lt;/p&gt;\n\n&lt;p&gt;What they don&amp;#39;t know is that the current Emperor is acting more than any of his recent predecessors - but he&amp;#39;s doing it rather clandestinely. Unlike his father, who would make a show of executing his political opponents on trumped up charges of treason; and unlike his great-great-grandfather, the Emperor during and before the Xa&amp;#39;tac War, who ruthlessly conquered numerous worlds, literally spitting in the face of a Gnadra ambassador, he&amp;#39;s doing things quietly. He colluded with a secretly anarchist, pseudo-conservatist &amp;quot;journalist&amp;quot; in the Gnadra society who wants to destroy their state and they&amp;#39;re working on faking their Chancellor elections to put a clownish buffoon of a puppet in the chair.&lt;/p&gt;\n\n&lt;p&gt;Because it&amp;#39;s a militaristic society obsessed with order and tradition, they rarely dissent towards more peaceful matters. The more loyal and less aggressive generals and weltkomissars seek inward perfection. They want less wars not because they&amp;#39;re nice... it&amp;#39;s because they want to clean their society up, exterminate all the monsters (read: sentient races that don&amp;#39;t fit their order) and put everyone where they belong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9nk5o", "score_hidden": false, "stickied": false, "created": 1492228449.0, "created_utc": 1492199649.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dga3vmf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ThatGenericSoda", "parent_id": "t1_dga3azj", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "I'll draw it when I get a chance! It's ridiculous.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll draw it when I get a chance! It&amp;#39;s ridiculous.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dga3vmf", "score_hidden": false, "stickied": false, "created": 1492249712.0, "created_utc": 1492220912.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga3azj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HaloedBane", "parent_id": "t1_dg9nr3k", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Lol what kind of a hat does the high prince of Xiph wear?  Any pics?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol what kind of a hat does the high prince of Xiph wear?  Any pics?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dga3azj", "score_hidden": false, "stickied": false, "created": 1492248935.0, "created_utc": 1492220135.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dg9w8ut", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ThatGenericSoda", "parent_id": "t1_dg9qn1y", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "The Empire of Meyas for sure. The sheer amount of political backstabbing and social infighting for position is outstanding. Every movement of the upper class has to be take into account. Even making people who are supposed to be equals, there is an unspoken hierarchy that shifts constantly due to thousands of factors everyone \"must\" be aware of if they want to succeed. Wealth, marriage, clothing, leisure activities, what kinds of business or properties a person owns, they way their treat and dress their servants, friends, enemies, who they are seen with, who they aren't seen with. All of these things and more feed into a constantly in flux hierarchy of nobility. All of this of course spins itself around the sitting emperor or empress who can throw the whole thing into chaos by showing favor or disfavor to a particular person. A low ranking noble might brush elbows with a high lord or lady if the empress favors them with a compliment. The richest noble in the Empire might be ignored by their leaders (within their social level) because they got a frown from the empress years earlier. \n\nNearly identical language and fairly similar religion comes from several factors. For one, almost all the known world spend hundreds of years (with fluctuation) under the Empire of Meyas. Human inhabitation and initial population of this world is not natural, and though they developed slightly differing religions and languages early on, they were similar enough that assimilation was not too difficult. Finally, a (former)  god of humanity using his name from the Isaoldean pantheon once cut a path of destruction across the continent that is now home to the kingdom of sereldor. Hard not to assimilate when the gods are realish ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Empire of Meyas for sure. The sheer amount of political backstabbing and social infighting for position is outstanding. Every movement of the upper class has to be take into account. Even making people who are supposed to be equals, there is an unspoken hierarchy that shifts constantly due to thousands of factors everyone &amp;quot;must&amp;quot; be aware of if they want to succeed. Wealth, marriage, clothing, leisure activities, what kinds of business or properties a person owns, they way their treat and dress their servants, friends, enemies, who they are seen with, who they aren&amp;#39;t seen with. All of these things and more feed into a constantly in flux hierarchy of nobility. All of this of course spins itself around the sitting emperor or empress who can throw the whole thing into chaos by showing favor or disfavor to a particular person. A low ranking noble might brush elbows with a high lord or lady if the empress favors them with a compliment. The richest noble in the Empire might be ignored by their leaders (within their social level) because they got a frown from the empress years earlier. &lt;/p&gt;\n\n&lt;p&gt;Nearly identical language and fairly similar religion comes from several factors. For one, almost all the known world spend hundreds of years (with fluctuation) under the Empire of Meyas. Human inhabitation and initial population of this world is not natural, and though they developed slightly differing religions and languages early on, they were similar enough that assimilation was not too difficult. Finally, a (former)  god of humanity using his name from the Isaoldean pantheon once cut a path of destruction across the continent that is now home to the kingdom of sereldor. Hard not to assimilate when the gods are realish &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9w8ut", "score_hidden": false, "stickied": false, "created": 1492239465.0, "created_utc": 1492210665.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9qn1y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Calvinist-Transhuman", "parent_id": "t1_dg9nr3k", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Welcome back, u/ThatGenericSoda !\n\nWhich of these would you say has the most convoluted politics?\n\n&gt; and is laregely responsible for the almost identical languages and religions adopted by human nations. \n\n[Now where have I heard that before...?] (https://www.reddit.com/r/worldbuilding/comments/64k778/how_are_your_religions_different_and_interesting/dg374s0/)", "edited": 1492204092.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Welcome back, &lt;a href=\"/u/ThatGenericSoda\"&gt;u/ThatGenericSoda&lt;/a&gt; !&lt;/p&gt;\n\n&lt;p&gt;Which of these would you say has the most convoluted politics?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;and is laregely responsible for the almost identical languages and religions adopted by human nations. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/worldbuilding/comments/64k778/how_are_your_religions_different_and_interesting/dg374s0/\"&gt;Now where have I heard that before...?&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9qn1y", "score_hidden": false, "stickied": false, "created": 1492232162.0, "created_utc": 1492203362.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9nr3k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ThatGenericSoda", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "The kingdom of Nevin: Matrilineal monarchy. The kingdom of nevin and a small and hardy nation ruled by a single monarch with absolute power. Titles, wealth, and holdings are passed through the mother, meaning that the titles of a mother is passed to her eldest child, but the titles and holdings of a father is passed to the eldest child of his eldest sister (or close female relative. For example, the current monarch of Nevin, Movren Balur will not pass the throne on to his eldest daughter, but to his eldest nephew, who will likely pass it on tot he child of his eldest sister. Movren's children will enteric estates and wealth from their mother, a middling noble and famed composer of music. \n\n-----------------------------------\n\nThe kingdom of Pereval: A sort of constitutional monarchy where the king is elected by a committee of high lords and ladies, with input from lesser lords and nobles. On the surface, this elected king is a reflection of the people, but in reality Pereval is a mageocracy. The third largest institute of magical study in the known world is in the nation, and all nobles have one or more made advisors, who rule in all but name. While the monarch is elected by the nobility and rules absolutely, only fools and the uneducated masses have any allusions about where true power lies. \n\n-----------------------------------\n\nThe dominion of Farva: A theocracy and extremist dictatorship lead by a council of druids, powerful, nature worshiping, magic users who rule with an iron fist. With legions of secret police and punitive laws, Farva is more or less a police state ruled by fear.\n\n-----------------------------------\n\nThe free cities of Ganalon: a collection of city states who maintain independence from each other while coming to international decision through an expansive senate of elected officials. Conflict between city state is quite common, though the nation presents itself as a whole to outsiders. This notion is reinforced by the incredible wall that encircles the entire \"nation\". Independent cities are ruled by smaller senates, who are responsible for electing officials to the national senate.\n\n-----------------------------------\n\nThe eleven tribes: Ruled by a council of elders, who are in turn ruled by the eldest, ancients of the eleven people who reside on their sacred volcanic islands. During times of war, a war chief is elected and given absolute control over the tribes actions, during times of war with humans, a single war chief is elected by all the tribes together.\n\n-----------------------------------\n\nThe kingdom or Serledor: A monarchy ruled by family succession, with high lords admin storing large holds and lesser nobles.\n\n-----------------------------------\n\nThe Empire of Meyas: and expansive empire that has swollowed up dozens of nations with little sign of slowing. Ruled by an empress who is held only slightly below the gods themselves. Provinces, made up of large absorbed nations or several smaller nations, are ruled by high nobles, with counties and districts ruled by lesser nobles.\n\n-----------------------------------\n\nThe \"empire\" of Su: A tiny amounts in nation ruled by a self entitled emperor. Power chances hands regularly and the ruling class rules through fear and brutal practices. Most of the population is downtrodden slave labor, or very very poor peasants. \n\n-----------------------------------\n\nBodania: an expansive collection or aligned territories ruled by warlords. Bodania is a warrior culture, with all nobility being of the noble class. Different regions administer power differently, but usually have a handful of very powerful warlords who collect tribute and administer funds to their lesser vassals. The highest title in the land is the \"lord of blades\" a title rarely held for long. The lord of blades must be acknowledged by 6 high ranking warlords, or a perspective lord of blades can declare them self by killing 4 high ranking warlords and their personal guards (who can number no more than ten) in single combat. \n\n-----------------------------------\n\nIsaolde: the former empire of isaolde once covered almost all of the he known world, and is laregely responsible for the almost identical languages and religions adopted by human nations. Still ruled by an \"emperor\" the nation is militaristic, with soldiers being the highest paid members of society. The nation has the largest concentration of slaves in the known world, as well as the second highest population.\n\n-----------------------------------\n\nThe merchant republic of Vara: a collection of islands protected by natural barriers and an impressive navy. Vara is an incredibly wealthy nation, and is kept so due to long standing and complicated trade routes created conflicts in more easy navigated waters. The nation is governed by an expansive class of beaurocrats, but is ruled by a council of wealthy merchants(usually in turn ruled by their various concubines and extra marital affairs) \n\n-----------------------------------\n\nThe principality of Xiph is a nation ruled by a high \"prince\" a figurehead elected by his or her peers. The high prince has no more power than the other princes, who make decisions as a council, but gets to live in a fancy palace, throw parties, and wear a fancy hat. \n\n-----------------------------------\n\nThese are all pretty brief but give a decent overview of my worlds governments.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The kingdom of Nevin: Matrilineal monarchy. The kingdom of nevin and a small and hardy nation ruled by a single monarch with absolute power. Titles, wealth, and holdings are passed through the mother, meaning that the titles of a mother is passed to her eldest child, but the titles and holdings of a father is passed to the eldest child of his eldest sister (or close female relative. For example, the current monarch of Nevin, Movren Balur will not pass the throne on to his eldest daughter, but to his eldest nephew, who will likely pass it on tot he child of his eldest sister. Movren&amp;#39;s children will enteric estates and wealth from their mother, a middling noble and famed composer of music. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The kingdom of Pereval: A sort of constitutional monarchy where the king is elected by a committee of high lords and ladies, with input from lesser lords and nobles. On the surface, this elected king is a reflection of the people, but in reality Pereval is a mageocracy. The third largest institute of magical study in the known world is in the nation, and all nobles have one or more made advisors, who rule in all but name. While the monarch is elected by the nobility and rules absolutely, only fools and the uneducated masses have any allusions about where true power lies. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The dominion of Farva: A theocracy and extremist dictatorship lead by a council of druids, powerful, nature worshiping, magic users who rule with an iron fist. With legions of secret police and punitive laws, Farva is more or less a police state ruled by fear.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The free cities of Ganalon: a collection of city states who maintain independence from each other while coming to international decision through an expansive senate of elected officials. Conflict between city state is quite common, though the nation presents itself as a whole to outsiders. This notion is reinforced by the incredible wall that encircles the entire &amp;quot;nation&amp;quot;. Independent cities are ruled by smaller senates, who are responsible for electing officials to the national senate.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The eleven tribes: Ruled by a council of elders, who are in turn ruled by the eldest, ancients of the eleven people who reside on their sacred volcanic islands. During times of war, a war chief is elected and given absolute control over the tribes actions, during times of war with humans, a single war chief is elected by all the tribes together.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The kingdom or Serledor: A monarchy ruled by family succession, with high lords admin storing large holds and lesser nobles.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The Empire of Meyas: and expansive empire that has swollowed up dozens of nations with little sign of slowing. Ruled by an empress who is held only slightly below the gods themselves. Provinces, made up of large absorbed nations or several smaller nations, are ruled by high nobles, with counties and districts ruled by lesser nobles.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The &amp;quot;empire&amp;quot; of Su: A tiny amounts in nation ruled by a self entitled emperor. Power chances hands regularly and the ruling class rules through fear and brutal practices. Most of the population is downtrodden slave labor, or very very poor peasants. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Bodania: an expansive collection or aligned territories ruled by warlords. Bodania is a warrior culture, with all nobility being of the noble class. Different regions administer power differently, but usually have a handful of very powerful warlords who collect tribute and administer funds to their lesser vassals. The highest title in the land is the &amp;quot;lord of blades&amp;quot; a title rarely held for long. The lord of blades must be acknowledged by 6 high ranking warlords, or a perspective lord of blades can declare them self by killing 4 high ranking warlords and their personal guards (who can number no more than ten) in single combat. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Isaolde: the former empire of isaolde once covered almost all of the he known world, and is laregely responsible for the almost identical languages and religions adopted by human nations. Still ruled by an &amp;quot;emperor&amp;quot; the nation is militaristic, with soldiers being the highest paid members of society. The nation has the largest concentration of slaves in the known world, as well as the second highest population.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The merchant republic of Vara: a collection of islands protected by natural barriers and an impressive navy. Vara is an incredibly wealthy nation, and is kept so due to long standing and complicated trade routes created conflicts in more easy navigated waters. The nation is governed by an expansive class of beaurocrats, but is ruled by a council of wealthy merchants(usually in turn ruled by their various concubines and extra marital affairs) &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The principality of Xiph is a nation ruled by a high &amp;quot;prince&amp;quot; a figurehead elected by his or her peers. The high prince has no more power than the other princes, who make decisions as a council, but gets to live in a fancy palace, throw parties, and wear a fancy hat. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;These are all pretty brief but give a decent overview of my worlds governments.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9nr3k", "score_hidden": false, "stickied": false, "created": 1492228679.0, "created_utc": 1492199879.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dga3zx2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HaloedBane", "parent_id": "t1_dga3dor", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "OK, so it sounds a bit like the factions in Ancient Greece, where each city-state had an oligarchist and a populist party.  In some states one was always more powerful, in others there were considerable shifts.  And then of course sometimes you'd get inter-city alliances based on these factions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OK, so it sounds a bit like the factions in Ancient Greece, where each city-state had an oligarchist and a populist party.  In some states one was always more powerful, in others there were considerable shifts.  And then of course sometimes you&amp;#39;d get inter-city alliances based on these factions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dga3zx2", "score_hidden": false, "stickied": false, "created": 1492249873.0, "created_utc": 1492221073.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga3dor", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MarkIsNotAShark", "parent_id": "t1_dga39n1", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "My concept actually involves a large swarth of differently sized empires and countries (work in progress, possibly in over my head) and a few of them are corporate states. The political climate would depend on the specific state. But more Profitist states tend to be more powerful militarily but generally less stable socially", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My concept actually involves a large swarth of differently sized empires and countries (work in progress, possibly in over my head) and a few of them are corporate states. The political climate would depend on the specific state. But more Profitist states tend to be more powerful militarily but generally less stable socially&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dga3dor", "score_hidden": false, "stickied": false, "created": 1492249042.0, "created_utc": 1492220242.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga39n1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HaloedBane", "parent_id": "t1_dg9oj1y", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Which one has the upper hand?  Is there a possibility of Profitists ever quashing Peoplists (Populists?) completely or viceversa?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Which one has the upper hand?  Is there a possibility of Profitists ever quashing Peoplists (Populists?) completely or viceversa?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dga39n1", "score_hidden": false, "stickied": false, "created": 1492248883.0, "created_utc": 1492220083.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9oj1y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MarkIsNotAShark", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "In a corporate state (sci Fi form of government in which interstellar corporations become so large they are able to buy small governments out of power and provide basic governmental services) parties are divided on the profit-people spectrum. The Profitists on one end think that because the government is literally a business that it's primary concern should be its bottom line and that services should be provided to corporate citizens only so far as they ultimately increase profits. Peopleists are the opposite end, believing that quality of life of its citizens is the priority, with profits coming second. However they are not Democrats, and still think that governing power should be divided between investors proportionally to their quantity of owned shares in corporate stock", "edited": 1492202861.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In a corporate state (sci Fi form of government in which interstellar corporations become so large they are able to buy small governments out of power and provide basic governmental services) parties are divided on the profit-people spectrum. The Profitists on one end think that because the government is literally a business that it&amp;#39;s primary concern should be its bottom line and that services should be provided to corporate citizens only so far as they ultimately increase profits. Peopleists are the opposite end, believing that quality of life of its citizens is the priority, with profits coming second. However they are not Democrats, and still think that governing power should be divided between investors proportionally to their quantity of owned shares in corporate stock&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9oj1y", "score_hidden": false, "stickied": false, "created": 1492229614.0, "created_utc": 1492200814.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dg9xtqw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jowijo", "parent_id": "t1_dg9wxcp", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "It's many things. The chief reason is that even those at the top are brainwashed by their own ideology. Opposition is nonexistent in the political space, over 96% of the male population is totally illiterate. Civilians and royalty enjoy an incredibly high standard of living. Poverty, hunger, unemployment? A non-issue in the city-state. \n\nExternally it comes down to economics. Benvesa is the world's leading contract manufacturer for clothing, consumer electronics, cosmetics; and boasts a prolific and profitable computer game industry. producing the top franchises in sports, platformers, and simulation games. Other major employers are animation, toy-making, and baby products. Basically \"Made in Benvesa\" is my world's \"Made in China\", and their deep ties to major tech and clothing firms have made the island incredibly powerful and prosperous economically.\n\nThen there's Lecisuene who uses the island as a power projection point. Several missile installations exist on the northeast of the island, and are there for the eventual war with the Lecicenpas. They're not supposed to have an \"external military presence\", and if Benvesa were to fall, they would have to pull back their only buffer between their enemies, and the open ocean.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s many things. The chief reason is that even those at the top are brainwashed by their own ideology. Opposition is nonexistent in the political space, over 96% of the male population is totally illiterate. Civilians and royalty enjoy an incredibly high standard of living. Poverty, hunger, unemployment? A non-issue in the city-state. &lt;/p&gt;\n\n&lt;p&gt;Externally it comes down to economics. Benvesa is the world&amp;#39;s leading contract manufacturer for clothing, consumer electronics, cosmetics; and boasts a prolific and profitable computer game industry. producing the top franchises in sports, platformers, and simulation games. Other major employers are animation, toy-making, and baby products. Basically &amp;quot;Made in Benvesa&amp;quot; is my world&amp;#39;s &amp;quot;Made in China&amp;quot;, and their deep ties to major tech and clothing firms have made the island incredibly powerful and prosperous economically.&lt;/p&gt;\n\n&lt;p&gt;Then there&amp;#39;s Lecisuene who uses the island as a power projection point. Several missile installations exist on the northeast of the island, and are there for the eventual war with the Lecicenpas. They&amp;#39;re not supposed to have an &amp;quot;external military presence&amp;quot;, and if Benvesa were to fall, they would have to pull back their only buffer between their enemies, and the open ocean.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9xtqw", "score_hidden": false, "stickied": false, "created": 1492241562.0, "created_utc": 1492212762.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9wxcp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DaneLimmish", "parent_id": "t1_dg9tg24", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Outside of staying in power, what is it that drives the Domain to be so autocratic? Is it driven by people with a grand agenda for what they do, by robots who hate everything, etc?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Outside of staying in power, what is it that drives the Domain to be so autocratic? Is it driven by people with a grand agenda for what they do, by robots who hate everything, etc?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9wxcp", "score_hidden": false, "stickied": false, "created": 1492240377.0, "created_utc": 1492211577.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9tg24", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jowijo", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "**The Domain of Benvesa** is the only organized state that can be considered an totalitarian autocracy and about as opposed to democracy as oil is to water. A nasty place where freedom of information, expression; reproductive rights, and men's rights are totally absent. The state controls everything, from cultural expression, to life itself. Nobody can enter, nobody can leave.\n\nOnly girls can receive an education, and this education is the product of propaganda, literal destruction and revision of history, sprinkled with some academics, all around an elaborate cult of personality. After many generations of this, it has come to the point where the people earnestly believe their despotic society is just and fair; and their warped worldview right and rational.\n\n**Tuprisia** technically is still an authoritarian socialist empire, but it is now technically an oligarchy, with only five members of the People's Party actually wielding control. With most rural tribes and autonomous peoples in a constant state of war, the extent of central authority really only exists in the conurbation in the northwest, though they are slowly reclaiming ground. They're far better off than Benvesans though. The extensive censorship of the former communist party is slowly easing, and the standard of living is rising for everyone outside of the war-zones.", "edited": 1492207234.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;The Domain of Benvesa&lt;/strong&gt; is the only organized state that can be considered an totalitarian autocracy and about as opposed to democracy as oil is to water. A nasty place where freedom of information, expression; reproductive rights, and men&amp;#39;s rights are totally absent. The state controls everything, from cultural expression, to life itself. Nobody can enter, nobody can leave.&lt;/p&gt;\n\n&lt;p&gt;Only girls can receive an education, and this education is the product of propaganda, literal destruction and revision of history, sprinkled with some academics, all around an elaborate cult of personality. After many generations of this, it has come to the point where the people earnestly believe their despotic society is just and fair; and their warped worldview right and rational.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Tuprisia&lt;/strong&gt; technically is still an authoritarian socialist empire, but it is now technically an oligarchy, with only five members of the People&amp;#39;s Party actually wielding control. With most rural tribes and autonomous peoples in a constant state of war, the extent of central authority really only exists in the conurbation in the northwest, though they are slowly reclaiming ground. They&amp;#39;re far better off than Benvesans though. The extensive censorship of the former communist party is slowly easing, and the standard of living is rising for everyone outside of the war-zones.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9tg24", "score_hidden": false, "stickied": false, "created": 1492235735.0, "created_utc": 1492206935.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dg9o4ie", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HippyxViking", "parent_id": "t1_dg9mzvz", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "They're neither straight 'corrupt' or 'benevolent', but I would say that between my own leftist leanings and the setting's cyberpunk-inspired fallibility of authority, they lean closer to the 'corrupt' side. On the other hand, really they all do at the end of they day. \n\nEach of the factions fulfill a needed niche in the fabric of Spookyverse, moderating and facilitating interstellar relationships in an era when empire is not really wanted nor feasible. GMZ specifically has probably done more for the reinvestment and expansion of basic technology &amp; economy than any other org (though the Psychics have probably done more for q-tech &amp; q-capables in particular) - at the same time they are ultimately naked capitalists, and they did so with a whole hell of a lot of exploitation. \n\nIt's a bit handwavey, but I would say GMZ has probably caused the most straight suffering of any of the factions. On the other hand though, RT's endgame is interstellar empire and they have a tendency to 'make a desert and call it peace', the Psychics support serious apocalyptic cults within their ranks, whether passively or actively, and the families are almost by definition outright corrupt. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;re neither straight &amp;#39;corrupt&amp;#39; or &amp;#39;benevolent&amp;#39;, but I would say that between my own leftist leanings and the setting&amp;#39;s cyberpunk-inspired fallibility of authority, they lean closer to the &amp;#39;corrupt&amp;#39; side. On the other hand, really they all do at the end of they day. &lt;/p&gt;\n\n&lt;p&gt;Each of the factions fulfill a needed niche in the fabric of Spookyverse, moderating and facilitating interstellar relationships in an era when empire is not really wanted nor feasible. GMZ specifically has probably done more for the reinvestment and expansion of basic technology &amp;amp; economy than any other org (though the Psychics have probably done more for q-tech &amp;amp; q-capables in particular) - at the same time they are ultimately naked capitalists, and they did so with a whole hell of a lot of exploitation. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a bit handwavey, but I would say GMZ has probably caused the most straight suffering of any of the factions. On the other hand though, RT&amp;#39;s endgame is interstellar empire and they have a tendency to &amp;#39;make a desert and call it peace&amp;#39;, the Psychics support serious apocalyptic cults within their ranks, whether passively or actively, and the families are almost by definition outright corrupt. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9o4ie", "score_hidden": false, "stickied": false, "created": 1492229126.0, "created_utc": 1492200326.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9mzvz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sriber", "parent_id": "t1_dg9ldrn", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Is the The GMZ Corp example of corrupt or benevolent NGO superpower?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is the The GMZ Corp example of corrupt or benevolent NGO superpower?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9mzvz", "score_hidden": false, "stickied": false, "created": 1492227770.0, "created_utc": 1492198970.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ldrn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HippyxViking", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "In **Spookyverse** (cyberpunk Cthulhu meets Star-trek), The Scattered Era of Known Space has been shaped by major, supergovernmental factions which exist across states/worlds. \n\n* Renova Tierra, the Terra Resurgent, would balk at the idea that they aren't Democratic, but the reality is that they are at best a semi-stratocracy, and more accurately an authoritarian extra-governmental military superpower which *supports* a certain brand of  liberal, democratic republic. Their primary goal is the reconstruction of Terra Unitas, the interstellar human empire that existed (*cough*andcaused*cough*) the Collapse/Cthulhu Times - in pursuit of that, they peacefully, or not so peacefully push worlds to form democratic republics and adopt their 'Charter of Terra' as the basis for their constitution. \n\n* The Holy Order of the Word and Mind of God, aka God-Minders or Psychics, are a vast, vaguely Abrahamic religion which believes that Elsewhere, the (arguably nightmarish) universe whence comes Quintessence, is literally heaven and the mind of god, and that the gift of quintessence and q-capability is to prepare humanity for the day when heaven and the universe will be united. As a baseline, they're a pretty good group that does a lot of charity work, is tech forward, and lots of other good qualities, but on another level their core philosphy is sort of rooting for an apocalyptic second Collapse and the end of the universe at the 'hands' of cthonic beings outside our comprehension. \n\n* The GMZ Corp (Goldmine Zach's) is a straight mega-corporation &amp; supra-financial institution which spans so many worlds and businesses that no one has any real idea of their breadth or depth. On many of the worlds within the sort of classical syndicalist/pseudo-libertarian Sycon of Pluto, they are de facto rulers, but they wield significant influence everywhere outside the semi-communist Goldpact. \n\n* The Families (name pending improvement...) are a loose association of mobsters other organizations engaged in the black and grey markets of known space. Many are literal merchant families which outright own worlds or other major resources, while others are more conventional criminal syndicates. ", "edited": 1492202817.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In &lt;strong&gt;Spookyverse&lt;/strong&gt; (cyberpunk Cthulhu meets Star-trek), The Scattered Era of Known Space has been shaped by major, supergovernmental factions which exist across states/worlds. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Renova Tierra, the Terra Resurgent, would balk at the idea that they aren&amp;#39;t Democratic, but the reality is that they are at best a semi-stratocracy, and more accurately an authoritarian extra-governmental military superpower which &lt;em&gt;supports&lt;/em&gt; a certain brand of  liberal, democratic republic. Their primary goal is the reconstruction of Terra Unitas, the interstellar human empire that existed (&lt;em&gt;cough&lt;/em&gt;andcaused&lt;em&gt;cough&lt;/em&gt;) the Collapse/Cthulhu Times - in pursuit of that, they peacefully, or not so peacefully push worlds to form democratic republics and adopt their &amp;#39;Charter of Terra&amp;#39; as the basis for their constitution. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The Holy Order of the Word and Mind of God, aka God-Minders or Psychics, are a vast, vaguely Abrahamic religion which believes that Elsewhere, the (arguably nightmarish) universe whence comes Quintessence, is literally heaven and the mind of god, and that the gift of quintessence and q-capability is to prepare humanity for the day when heaven and the universe will be united. As a baseline, they&amp;#39;re a pretty good group that does a lot of charity work, is tech forward, and lots of other good qualities, but on another level their core philosphy is sort of rooting for an apocalyptic second Collapse and the end of the universe at the &amp;#39;hands&amp;#39; of cthonic beings outside our comprehension. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The GMZ Corp (Goldmine Zach&amp;#39;s) is a straight mega-corporation &amp;amp; supra-financial institution which spans so many worlds and businesses that no one has any real idea of their breadth or depth. On many of the worlds within the sort of classical syndicalist/pseudo-libertarian Sycon of Pluto, they are de facto rulers, but they wield significant influence everywhere outside the semi-communist Goldpact. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The Families (name pending improvement...) are a loose association of mobsters other organizations engaged in the black and grey markets of known space. Many are literal merchant families which outright own worlds or other major resources, while others are more conventional criminal syndicates. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9ldrn", "score_hidden": false, "stickied": false, "created": 1492225827.0, "created_utc": 1492197027.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dg9ssbh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Calvinist-Transhuman", "parent_id": "t1_dg9rs12", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "I don't have a Dropbox, but the lore in the comments seemed pretty neat, if a little complex.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have a Dropbox, but the lore in the comments seemed pretty neat, if a little complex.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9ssbh", "score_hidden": false, "stickied": false, "created": 1492234885.0, "created_utc": 1492206085.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9rs12", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bob-the-Seagull-King", "parent_id": "t1_dg9rgly", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "ha! What a coincidence, have you had a look at what I wrote? What'd you think?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ha! What a coincidence, have you had a look at what I wrote? What&amp;#39;d you think?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9rs12", "score_hidden": false, "stickied": false, "created": 1492233591.0, "created_utc": 1492204791.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9rgly", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Calvinist-Transhuman", "parent_id": "t1_dg9rdqd", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "I was just there when this message popped up!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was just there when this message popped up!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9rgly", "score_hidden": false, "stickied": false, "created": 1492233193.0, "created_utc": 1492204393.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9rdqd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bob-the-Seagull-King", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Wow! I just posted a thread on the political system of [Suswana](https://www.reddit.com/r/worldbuilding/comments/65f3jt/a_chart_detailing_the_political_system_of_suswana/)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow! I just posted a thread on the political system of &lt;a href=\"https://www.reddit.com/r/worldbuilding/comments/65f3jt/a_chart_detailing_the_political_system_of_suswana/\"&gt;Suswana&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9rdqd", "score_hidden": false, "stickied": false, "created": 1492233091.0, "created_utc": 1492204291.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dg9wnfk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DaneLimmish", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Few places in the world are wholly, 100% autocratic. \n\nFor instance, the Emperor of the Two Rivers, though an Emperor, is still elected into office. Sure, it's mostly just a formality, and the previous emperor's son is usually elected, but there is a process dammit! The Emperor, first and foremost, is seen as the First Among Equals.\n\nIn turn, though Ducal (as well as kings and counts) lands are purely hereditary, they still have various other members of landed nobility advice them, and few dukes will act without the permission of their council. The rulers of ducal lands (as well as kings and counts) are seen as The First Among Equals *within their respective realm*\n\nThe Emperor, as well as his kings, dukes, and counts, has to watch out and not piss off his underlings. Ultimately, the system is designed in a way to hold those with the most power responsible to their underlings. This is successful to varying degrees.\n\nThe system grew out of the time period before the formation of the Empire, when humans of the area were a bit more divided by clan or tribe. A Tribe King or a Clan Chief had to rely on and keep happy the heads of sub-tribes and sub-clans within his realm. \n\nNow, the hobgoblins.\n\nIn teh lands directly to the south of the Empire, there are three hobgoblin kings. Their system is quite similar to the humans to the north, but a tad different.\n\nThe king is elected from the family of the king. In order, those considered are: Son, nephew, daughter, niece, uncle, cousin (m), aunt, cousin (f).\n\nThe electors are the various clan chiefs who owe the king fealty.\n\nTheir system is also set up to keep the king in check. Their history for the system is pretty much the same as the humans to the north: You can't rule shit if you have nobody under you.\n\n\nNote: I hope this was understandable. The internal political situation in the Empire and hobgoblin lands is...complex and has been purposely left mostly vague. There is also no clear cut difference between a duke or a king. In the empire, ducal lands, as well as kingdoms, were at first tribal or familial, like the old Stem Duchies IRL. As well, both humans and hobgoblins are both descended from nomadic or migrating populations who settled in their respective areas, Edit2: which made gaining consent from the governed that much more important. I drew inspiration for their governments from the various peoples on the outskirts of the Mediterranean, as they seem to have often had *quasi*-democratic systems Edit: As well as the monarchical systems present in Scandanavia, Anglo-Saxon England, and the HRE. \n", "edited": 1492211432.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Few places in the world are wholly, 100% autocratic. &lt;/p&gt;\n\n&lt;p&gt;For instance, the Emperor of the Two Rivers, though an Emperor, is still elected into office. Sure, it&amp;#39;s mostly just a formality, and the previous emperor&amp;#39;s son is usually elected, but there is a process dammit! The Emperor, first and foremost, is seen as the First Among Equals.&lt;/p&gt;\n\n&lt;p&gt;In turn, though Ducal (as well as kings and counts) lands are purely hereditary, they still have various other members of landed nobility advice them, and few dukes will act without the permission of their council. The rulers of ducal lands (as well as kings and counts) are seen as The First Among Equals &lt;em&gt;within their respective realm&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The Emperor, as well as his kings, dukes, and counts, has to watch out and not piss off his underlings. Ultimately, the system is designed in a way to hold those with the most power responsible to their underlings. This is successful to varying degrees.&lt;/p&gt;\n\n&lt;p&gt;The system grew out of the time period before the formation of the Empire, when humans of the area were a bit more divided by clan or tribe. A Tribe King or a Clan Chief had to rely on and keep happy the heads of sub-tribes and sub-clans within his realm. &lt;/p&gt;\n\n&lt;p&gt;Now, the hobgoblins.&lt;/p&gt;\n\n&lt;p&gt;In teh lands directly to the south of the Empire, there are three hobgoblin kings. Their system is quite similar to the humans to the north, but a tad different.&lt;/p&gt;\n\n&lt;p&gt;The king is elected from the family of the king. In order, those considered are: Son, nephew, daughter, niece, uncle, cousin (m), aunt, cousin (f).&lt;/p&gt;\n\n&lt;p&gt;The electors are the various clan chiefs who owe the king fealty.&lt;/p&gt;\n\n&lt;p&gt;Their system is also set up to keep the king in check. Their history for the system is pretty much the same as the humans to the north: You can&amp;#39;t rule shit if you have nobody under you.&lt;/p&gt;\n\n&lt;p&gt;Note: I hope this was understandable. The internal political situation in the Empire and hobgoblin lands is...complex and has been purposely left mostly vague. There is also no clear cut difference between a duke or a king. In the empire, ducal lands, as well as kingdoms, were at first tribal or familial, like the old Stem Duchies IRL. As well, both humans and hobgoblins are both descended from nomadic or migrating populations who settled in their respective areas, Edit2: which made gaining consent from the governed that much more important. I drew inspiration for their governments from the various peoples on the outskirts of the Mediterranean, as they seem to have often had &lt;em&gt;quasi&lt;/em&gt;-democratic systems Edit: As well as the monarchical systems present in Scandanavia, Anglo-Saxon England, and the HRE. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dg9wnfk", "score_hidden": false, "stickied": false, "created": 1492240009.0, "created_utc": 1492211209.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dga0h38", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KerianH", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "**Minoklos** is a theocratic monarchy, one which is ruled over by a high king but where a lot of the policy is conducted by a council of high priests.  These priests, all loyal fanatics of the god *Komol* - the bloodthirsty bull who demands human blood in exchange for good fortune, fertile crops, and successful military campaigns - are the power behind the throne while the king pretty much lavishes in splendor as the chosen of the bull-headed god.  His symbol of power is often represented by a Golden Calf, and ever ten years parades are held in every great city throughout the empire where a calf forged of gold is carried in honor of the king.  Most who are subjugated by the Minoklosi absolutely hate their regime, because every ten years (five years after the Ceremony of the Golden Calf) the priests will command that every boy and girl of ten years of age within the empire be brought to Minoklos in chains to be sacrificed to the Great Bull.  It's rumored that this blood ritual is what fuels the magic of their priests, which is why they are so successful at fighting against other magicians and sorcerers.\n\n**Syrak** is a traditional monarchy that rules across the *Ourae Mountains* east of the *Great Father Sea*.  They are ruled by a king, who is advised by a council of five viziers (each said to represent the five other nations descended from **Fallen Rakash** of old), who in turn manage affairs with their own independent councils that oversee the kingdom and manage laws and resources for the empire.  Traditionally much of Syrak's wealth and resource management is done through their priestly caste, a tradition that's been passed down since even before Rakash's demise, where the priests would accept sacrifices of food and gold in times of plenty and redistribute them among the people in times of drought, as the Dry is perhaps at its worst in the East.  Of course, while the viziers manage much of the kingdom, the king's job is to manage military strength, where he will lead his armies to war against the other five Empires of Rakash and beyond.\n\n**Mekhet** is ruled by a God King, the *Rakhum*, who is claimed to be a descendant of one of nine of the Mekhet pantheon of gods.  Both the king of his people and the high priest of a great cult of followers, the Rakhum is both worshiped and the chiefest of worshipers, who will often lead great ceremonies in dedication to the gods of Mekhet.  As tradition ordains, the dynasty rules from a traditional capital selected by the first of their dynasty (usually their birthplace or a holy site special to the god most important to their house) with at least 14 cities being named as the nation's capital (of which at least 8-9 regularly interchange).  Daily affairs are monitored and regulated by a group of magistrates known a the Chosen of Rakhum who also serve in a council composed of priests, magi, retired officers, and other officials to aid the Rakhum in deciding the nation's policy.  However all are well aware that as the representative of the gods of Mekhet the Rakhum's word is law.  The current Rakhum as Atesh-KunRa of the Kun dynasty, descended from the great ram Nukum the Potter ruling from the capital of *Gazir*.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Minoklos&lt;/strong&gt; is a theocratic monarchy, one which is ruled over by a high king but where a lot of the policy is conducted by a council of high priests.  These priests, all loyal fanatics of the god &lt;em&gt;Komol&lt;/em&gt; - the bloodthirsty bull who demands human blood in exchange for good fortune, fertile crops, and successful military campaigns - are the power behind the throne while the king pretty much lavishes in splendor as the chosen of the bull-headed god.  His symbol of power is often represented by a Golden Calf, and ever ten years parades are held in every great city throughout the empire where a calf forged of gold is carried in honor of the king.  Most who are subjugated by the Minoklosi absolutely hate their regime, because every ten years (five years after the Ceremony of the Golden Calf) the priests will command that every boy and girl of ten years of age within the empire be brought to Minoklos in chains to be sacrificed to the Great Bull.  It&amp;#39;s rumored that this blood ritual is what fuels the magic of their priests, which is why they are so successful at fighting against other magicians and sorcerers.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Syrak&lt;/strong&gt; is a traditional monarchy that rules across the &lt;em&gt;Ourae Mountains&lt;/em&gt; east of the &lt;em&gt;Great Father Sea&lt;/em&gt;.  They are ruled by a king, who is advised by a council of five viziers (each said to represent the five other nations descended from &lt;strong&gt;Fallen Rakash&lt;/strong&gt; of old), who in turn manage affairs with their own independent councils that oversee the kingdom and manage laws and resources for the empire.  Traditionally much of Syrak&amp;#39;s wealth and resource management is done through their priestly caste, a tradition that&amp;#39;s been passed down since even before Rakash&amp;#39;s demise, where the priests would accept sacrifices of food and gold in times of plenty and redistribute them among the people in times of drought, as the Dry is perhaps at its worst in the East.  Of course, while the viziers manage much of the kingdom, the king&amp;#39;s job is to manage military strength, where he will lead his armies to war against the other five Empires of Rakash and beyond.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Mekhet&lt;/strong&gt; is ruled by a God King, the &lt;em&gt;Rakhum&lt;/em&gt;, who is claimed to be a descendant of one of nine of the Mekhet pantheon of gods.  Both the king of his people and the high priest of a great cult of followers, the Rakhum is both worshiped and the chiefest of worshipers, who will often lead great ceremonies in dedication to the gods of Mekhet.  As tradition ordains, the dynasty rules from a traditional capital selected by the first of their dynasty (usually their birthplace or a holy site special to the god most important to their house) with at least 14 cities being named as the nation&amp;#39;s capital (of which at least 8-9 regularly interchange).  Daily affairs are monitored and regulated by a group of magistrates known a the Chosen of Rakhum who also serve in a council composed of priests, magi, retired officers, and other officials to aid the Rakhum in deciding the nation&amp;#39;s policy.  However all are well aware that as the representative of the gods of Mekhet the Rakhum&amp;#39;s word is law.  The current Rakhum as Atesh-KunRa of the Kun dynasty, descended from the great ram Nukum the Potter ruling from the capital of &lt;em&gt;Gazir&lt;/em&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dga0h38", "score_hidden": false, "stickied": false, "created": 1492245077.0, "created_utc": 1492216277.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dga37jx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HaloedBane", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "The higher echelons of the Incudean Council, the supreme deliberative body of the nation of Incudea (10,000+ strong) is split into factions, the most powerful of which are Kaga and Kobol.  These 2 have a power-sharing arrangement that works as follows: the various institutions associated with the Council are split between Kaga-led ones (intelligence, information, etc.), Kobol-led ones (capital/finance, high-level policing), and neutral ones (the Army proper, science/technology).  The five-member Leadership Committee of the Incudean Council (LCIC) always has 3 members of one faction and 2 members of another (they alternate every 12 years).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The higher echelons of the Incudean Council, the supreme deliberative body of the nation of Incudea (10,000+ strong) is split into factions, the most powerful of which are Kaga and Kobol.  These 2 have a power-sharing arrangement that works as follows: the various institutions associated with the Council are split between Kaga-led ones (intelligence, information, etc.), Kobol-led ones (capital/finance, high-level policing), and neutral ones (the Army proper, science/technology).  The five-member Leadership Committee of the Incudean Council (LCIC) always has 3 members of one faction and 2 members of another (they alternate every 12 years).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dga37jx", "score_hidden": false, "stickied": false, "created": 1492248804.0, "created_utc": 1492220004.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dgatldd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lars123mc", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "This is not fully developed, but a nation I'm working on in my world is extremely ethnically and culturally homogenous, and it's government consists of parties that corresponds to the different departments of government. So you have the economic party which has the job of electing a representative that will be responsible for the nations economy. The only people that gets to vote on the representative is people that has taken extensive education in economics. This structure is the same for the other parties as well; the defence party, the education party, the health party, the intelligence party, etc. This ensures that the most qualified people are in government. After the representatives has been elected the nation pretty much runs like an oligarchy.\n\nThe reason the ethnically and culturally homogenous part is important is because the people of the nation has gotten a pretty collectivist mind-set because of it. They work almost like a hive-mind, so the people that don't vote doesn't really mind because they know the officials will do what's in their interest anyway.\n\nThis is a strange mix between North Korea and Nazi Germany, but without the autocracy part. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is not fully developed, but a nation I&amp;#39;m working on in my world is extremely ethnically and culturally homogenous, and it&amp;#39;s government consists of parties that corresponds to the different departments of government. So you have the economic party which has the job of electing a representative that will be responsible for the nations economy. The only people that gets to vote on the representative is people that has taken extensive education in economics. This structure is the same for the other parties as well; the defence party, the education party, the health party, the intelligence party, etc. This ensures that the most qualified people are in government. After the representatives has been elected the nation pretty much runs like an oligarchy.&lt;/p&gt;\n\n&lt;p&gt;The reason the ethnically and culturally homogenous part is important is because the people of the nation has gotten a pretty collectivist mind-set because of it. They work almost like a hive-mind, so the people that don&amp;#39;t vote doesn&amp;#39;t really mind because they know the officials will do what&amp;#39;s in their interest anyway.&lt;/p&gt;\n\n&lt;p&gt;This is a strange mix between North Korea and Nazi Germany, but without the autocracy part. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dgatldd", "score_hidden": false, "stickied": false, "created": 1492301784.0, "created_utc": 1492272984.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rd6n", "removal_reason": null, "link_id": "t3_65e5na", "likes": null, "replies": "", "user_reports": [], "id": "dge0sai", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GodofWar1234", "parent_id": "t3_65e5na", "subreddit_name_prefixed": "r/worldbuilding", "controversiality": 0, "body": "Political factions in the Republic of North America:\n\n- National Patriot's Party(NPP)\n\n   The National Patriot's Party(NPP)is an extreme right wing fascist totalitarian party that rules the Republic of North America. They believe in extreme isolationism, and believe that North America is superior in comparison to other surviving post-WWIII/Great Flood nations. They also highly prioritize the military and have an extreme policy call the \"Military Might before All\" doctrine. \n\n- Revolutionary Patriots of North America(RPNA)\n\n    The Revolutionary Patriots of North America(RPNA)are actually more of a *military* faction instead of a political one, but they have been utilizing politics in the past 15 years to destroy the North American government and replace it with a federal presidential constitutional republic. They have a strong belief in restoring the US Constitution and strongly believe in freedom for all. However, despite being very much against it, they have been forced to use acts like corruption and bribery in order to have pro-RPNA politicians serve as Territorial Senators and such in order to further their agenda from the inside out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Political factions in the Republic of North America:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;National Patriot&amp;#39;s Party(NPP)&lt;/p&gt;\n\n&lt;p&gt;The National Patriot&amp;#39;s Party(NPP)is an extreme right wing fascist totalitarian party that rules the Republic of North America. They believe in extreme isolationism, and believe that North America is superior in comparison to other surviving post-WWIII/Great Flood nations. They also highly prioritize the military and have an extreme policy call the &amp;quot;Military Might before All&amp;quot; doctrine. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Revolutionary Patriots of North America(RPNA)&lt;/p&gt;\n\n&lt;p&gt;The Revolutionary Patriots of North America(RPNA)are actually more of a &lt;em&gt;military&lt;/em&gt; faction instead of a political one, but they have been utilizing politics in the past 15 years to destroy the North American government and replace it with a federal presidential constitutional republic. They have a strong belief in restoring the US Constitution and strongly believe in freedom for all. However, despite being very much against it, they have been forced to use acts like corruption and bribery in order to have pro-RPNA politicians serve as Territorial Senators and such in order to further their agenda from the inside out. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "worldbuilding", "name": "t1_dge0sai", "score_hidden": false, "stickied": false, "created": 1492487864.0, "created_utc": 1492459064.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]