[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TrueAskReddit", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64sol2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 111, "report_reasons": null, "author": "Smash_4dams", "saved": false, "mod_reports": [], "name": "t3_64sol2", "subreddit_name_prefixed": "r/TrueAskReddit", "approved_by": null, "over_18": false, "domain": "self.TrueAskReddit", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2s91q", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TrueAskReddit/comments/64sol2/since_the_us_has_such_a_solid_history_of/", "num_reports": null, "locked": false, "stickied": false, "created": 1491963969.0, "url": "https://www.reddit.com/r/TrueAskReddit/comments/64sol2/since_the_us_has_such_a_solid_history_of/", "author_flair_text": null, "quarantine": false, "title": "Since the US has such a solid history of overthrowing 3rd world dictators, what's been stopping us from sending secret agents to NK to kill Kim Jong Un?", "created_utc": 1491935169.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 34, "visited": false, "subreddit_type": "public", "ups": 111}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg50fuh", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "Regularity", "parent_id": "t1_dg4unk4", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Buffer states provide what's known as [strategic depth](https://en.wikipedia.org/wiki/Strategic_depth). If conflicts ever occur, the greater the distance between the enemy's starting position and your state's vital organs (center of government, command elements, military bases, etc), the more time you'll have -- and this additional time not only means you can mobilize more forces, but that mobilized forces will have more time to position and entrench for when battle does occur.\n\nThis indirectly translates to international power projection and negotiating power in international affairs. Imagine it like this: A mugger a knife standing at the opposite end of a long street would have a lot less leverage over you than someone standing one step away. Even if have absolutely no intention of ever actually stabbing you, you're probably a lot more likely to give them what they want if they're standing with a knife right in front of you, right? As opposed to when they're at the opposite end of a long street, and you have plenty of time to call for help, to run away, or grab a nearby object to fight back.\n\nThis is part of the reason why Russia went a bit nuts when Ukraine had its recent revolution and started orienting towards EU and NATO. Even though the chance of a NATO invasion was basically non-existent, a NATO Ukraine risked damaging Russia's international power projection. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Buffer states provide what&amp;#39;s known as &lt;a href=\"https://en.wikipedia.org/wiki/Strategic_depth\"&gt;strategic depth&lt;/a&gt;. If conflicts ever occur, the greater the distance between the enemy&amp;#39;s starting position and your state&amp;#39;s vital organs (center of government, command elements, military bases, etc), the more time you&amp;#39;ll have -- and this additional time not only means you can mobilize more forces, but that mobilized forces will have more time to position and entrench for when battle does occur.&lt;/p&gt;\n\n&lt;p&gt;This indirectly translates to international power projection and negotiating power in international affairs. Imagine it like this: A mugger a knife standing at the opposite end of a long street would have a lot less leverage over you than someone standing one step away. Even if have absolutely no intention of ever actually stabbing you, you&amp;#39;re probably a lot more likely to give them what they want if they&amp;#39;re standing with a knife right in front of you, right? As opposed to when they&amp;#39;re at the opposite end of a long street, and you have plenty of time to call for help, to run away, or grab a nearby object to fight back.&lt;/p&gt;\n\n&lt;p&gt;This is part of the reason why Russia went a bit nuts when Ukraine had its recent revolution and started orienting towards EU and NATO. Even though the chance of a NATO invasion was basically non-existent, a NATO Ukraine risked damaging Russia&amp;#39;s international power projection. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg50fuh", "score_hidden": false, "stickied": false, "created": 1491977397.0, "created_utc": 1491948597.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg5ffye", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blasto_blastocyst", "parent_id": "t1_dg4zktl", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Slight correction: the Chinese memory of Japanese invasion at the time of the Korean War was under ten years old.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Slight correction: the Chinese memory of Japanese invasion at the time of the Korean War was under ten years old.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg5ffye", "score_hidden": false, "stickied": false, "created": 1491997666.0, "created_utc": 1491968866.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg5g2go", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "Formshifter", "parent_id": "t1_dg4zktl", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "the word foreign in your first sentence is a little superfluous dontchathink? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the word foreign in your first sentence is a little superfluous dontchathink? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg5g2go", "score_hidden": false, "stickied": false, "created": 1491998673.0, "created_utc": 1491969873.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4zktl", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "doubledownon1", "parent_id": "t1_dg4unk4", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Most foreign countries, like China, [Russia](https://en.wikipedia.org/wiki/Buffer_state#Europe), and [Iran](https://en.wikipedia.org/wiki/1953_Iranian_coup_d%27%C3%A9tat), all have cultural \"memories\" that extend much longer than America's cultural memory.\nFor example, the United States supported the anti-communist [Nationalists](https://en.wikipedia.org/wiki/Kuomintang) during the Chinese civil war between the Mao led communists and the Chiang Kai-Shek led Nationalists after the end of WWII. Althought the communists obviously ended up winning, the Chinese government never forgot that we were once hostile towards them. \n\nSimilarly, the U.S invaded communist North Korea during the Korean war. Given America's vehement anti-communist stance at the time, as well as our recent support for the Nationalists, China worried that we would not stop at the invasion of North Korea, and attempt to topple China as well-this is partially why China intervened in the Korean War.\nChina, like [Russia](https://en.wikipedia.org/wiki/Operation_Barbarossa), has had very bad experiences with foreign invaders within the past century, like the [The Japanese Invasion of Manchuria](https://en.wikipedia.org/wiki/Japanese_invasion_of_Manchuria)\n\nThe Cold War may seem like ancient history to us Americans, but to China (like Russia and Iran) these past conflicts are very much relevant. Putin used (and continues to use) the Russian fear of NATO to justify his invasion of Crimea and Ukraine. China uses the memory of foreign (read: American and Japanese) interference to justify their expansion into the South China Sea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most foreign countries, like China, &lt;a href=\"https://en.wikipedia.org/wiki/Buffer_state#Europe\"&gt;Russia&lt;/a&gt;, and &lt;a href=\"https://en.wikipedia.org/wiki/1953_Iranian_coup_d%27%C3%A9tat\"&gt;Iran&lt;/a&gt;, all have cultural &amp;quot;memories&amp;quot; that extend much longer than America&amp;#39;s cultural memory.\nFor example, the United States supported the anti-communist &lt;a href=\"https://en.wikipedia.org/wiki/Kuomintang\"&gt;Nationalists&lt;/a&gt; during the Chinese civil war between the Mao led communists and the Chiang Kai-Shek led Nationalists after the end of WWII. Althought the communists obviously ended up winning, the Chinese government never forgot that we were once hostile towards them. &lt;/p&gt;\n\n&lt;p&gt;Similarly, the U.S invaded communist North Korea during the Korean war. Given America&amp;#39;s vehement anti-communist stance at the time, as well as our recent support for the Nationalists, China worried that we would not stop at the invasion of North Korea, and attempt to topple China as well-this is partially why China intervened in the Korean War.\nChina, like &lt;a href=\"https://en.wikipedia.org/wiki/Operation_Barbarossa\"&gt;Russia&lt;/a&gt;, has had very bad experiences with foreign invaders within the past century, like the &lt;a href=\"https://en.wikipedia.org/wiki/Japanese_invasion_of_Manchuria\"&gt;The Japanese Invasion of Manchuria&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The Cold War may seem like ancient history to us Americans, but to China (like Russia and Iran) these past conflicts are very much relevant. Putin used (and continues to use) the Russian fear of NATO to justify his invasion of Crimea and Ukraine. China uses the memory of foreign (read: American and Japanese) interference to justify their expansion into the South China Sea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg4zktl", "score_hidden": false, "stickied": false, "created": 1491976317.0, "created_utc": 1491947517.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg5dytm", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Uncle_Erik", "parent_id": "t1_dg4unk4", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "The buffer state is one thing.\n\nProviding for North Korean refugees would cost an amazing amount of money.  If North Korea's government goes down, people are going to flood into China and South Korea looking for food and shelter.\n\nChina absolutely does not want to have millions of North Koreans suddenly showing up.  It would be a complete mess and a very expensive mess they don't want to pay for.  Same goes for South Korea.  They do not want to feed and shelter millions of North Koreans.  Also, North Korean resources pale in comparison to what it would cost to fix North Korea.  It's not worth it for China.\n\nFurther, South Korea has kept a close eye on German reunification.  The amount West Germany spent has them terrified.  That terrifies the US because it means we'll have to bail out South Korea.  Japan figures they'll be sucked into paying for part of that and they really don't want to, either.\n\nIf you want to understand North Korean politics, pay attention to their demands.  North Korea *always* wants to get into unilateral negotiations with the US.  The US then insists on multilateral negotiations that include South Korea, China, and Japan.\n\nWhy is this?\n\nNorth Korea is not afraid of the US.  Not even a little bit.  North Korea is actually afraid of China.  They are afraid China will make them a puppet state.  The only country China is afraid of is the US.  North Korea wants to get in bed with the US so they can tell China to fuck off because the US is on their side.  The US knows this is what North Korea wants, the US isn't willing to piss off China, so the US insists on talks that include China.\n\nThat's what is really going on.  North Korea isn't as crazy as it seems.\n\nNo one is really happy about the situation, but China, South Korea, Japan, and the US really don't want to have to pay for and deal with a North Korean collapse.  It's a lot cheaper to let things stay as they are.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The buffer state is one thing.&lt;/p&gt;\n\n&lt;p&gt;Providing for North Korean refugees would cost an amazing amount of money.  If North Korea&amp;#39;s government goes down, people are going to flood into China and South Korea looking for food and shelter.&lt;/p&gt;\n\n&lt;p&gt;China absolutely does not want to have millions of North Koreans suddenly showing up.  It would be a complete mess and a very expensive mess they don&amp;#39;t want to pay for.  Same goes for South Korea.  They do not want to feed and shelter millions of North Koreans.  Also, North Korean resources pale in comparison to what it would cost to fix North Korea.  It&amp;#39;s not worth it for China.&lt;/p&gt;\n\n&lt;p&gt;Further, South Korea has kept a close eye on German reunification.  The amount West Germany spent has them terrified.  That terrifies the US because it means we&amp;#39;ll have to bail out South Korea.  Japan figures they&amp;#39;ll be sucked into paying for part of that and they really don&amp;#39;t want to, either.&lt;/p&gt;\n\n&lt;p&gt;If you want to understand North Korean politics, pay attention to their demands.  North Korea &lt;em&gt;always&lt;/em&gt; wants to get into unilateral negotiations with the US.  The US then insists on multilateral negotiations that include South Korea, China, and Japan.&lt;/p&gt;\n\n&lt;p&gt;Why is this?&lt;/p&gt;\n\n&lt;p&gt;North Korea is not afraid of the US.  Not even a little bit.  North Korea is actually afraid of China.  They are afraid China will make them a puppet state.  The only country China is afraid of is the US.  North Korea wants to get in bed with the US so they can tell China to fuck off because the US is on their side.  The US knows this is what North Korea wants, the US isn&amp;#39;t willing to piss off China, so the US insists on talks that include China.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s what is really going on.  North Korea isn&amp;#39;t as crazy as it seems.&lt;/p&gt;\n\n&lt;p&gt;No one is really happy about the situation, but China, South Korea, Japan, and the US really don&amp;#39;t want to have to pay for and deal with a North Korean collapse.  It&amp;#39;s a lot cheaper to let things stay as they are.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg5dytm", "score_hidden": false, "stickied": false, "created": 1491995423.0, "created_utc": 1491966623.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4unk4", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Smash_4dams", "parent_id": "t1_dg4prnu", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Why does China feel the need for a buffer state so bad? Do they really think there's a shadow of a chance for an American/coalition invasion?\n\nComing from an American perspective, I don’t see how we would ever have anything to gain from a military invasion of China. They are the hub of manufacturing for our products. International trade would become crippled and multinational corporations would lose billions of dollars. I don't see how any of the billionaire class would want a war with China. They are, after all, the real deciders of war historically.\n\nNot to mention, wouldn't China love to get its hands on North Korean coal and other natural resources?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why does China feel the need for a buffer state so bad? Do they really think there&amp;#39;s a shadow of a chance for an American/coalition invasion?&lt;/p&gt;\n\n&lt;p&gt;Coming from an American perspective, I don’t see how we would ever have anything to gain from a military invasion of China. They are the hub of manufacturing for our products. International trade would become crippled and multinational corporations would lose billions of dollars. I don&amp;#39;t see how any of the billionaire class would want a war with China. They are, after all, the real deciders of war historically.&lt;/p&gt;\n\n&lt;p&gt;Not to mention, wouldn&amp;#39;t China love to get its hands on North Korean coal and other natural resources?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg4unk4", "score_hidden": false, "stickied": false, "created": 1491970581.0, "created_utc": 1491941781.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg4x68k", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "officerbill_", "parent_id": "t1_dg4prnu", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Plus it's useful for both domestic &amp; foreign policy to have a \"crazy\" dictator in the region. NK is no real threat to the US, but their actions and public displays can be used.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Plus it&amp;#39;s useful for both domestic &amp;amp; foreign policy to have a &amp;quot;crazy&amp;quot; dictator in the region. NK is no real threat to the US, but their actions and public displays can be used.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg4x68k", "score_hidden": false, "stickied": false, "created": 1491973426.0, "created_utc": 1491944626.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg5akul", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bluesbrother21", "parent_id": "t1_dg4prnu", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "I think assuming South Korea doesn't/shouldn't reunification is a bit hasty and likely incorrect. There was an askreddit thread earlier today regarding inter-korea relations and the majority of responses either heavily implied or outright stated that reunification is the eventual goal of the south korean government", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think assuming South Korea doesn&amp;#39;t/shouldn&amp;#39;t reunification is a bit hasty and likely incorrect. There was an askreddit thread earlier today regarding inter-korea relations and the majority of responses either heavily implied or outright stated that reunification is the eventual goal of the south korean government&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg5akul", "score_hidden": false, "stickied": false, "created": 1491990744.0, "created_utc": 1491961944.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg565ip", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "untaken-username", "parent_id": "t1_dg517m4", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Not to mention, the border between Afghanistan and China is relatively small and a good ways apart from more \"urbanized\" Afghanistan where US forces are more concentrated (far away both in terms of distance and elevation). It's a very mountainous border.\n\nAnd once you get over the mountains you've got 1,000+ km of desert and rural China before you even get close to the eastern half, where China's industry and central government are located.\n\nIn other words, it would be like starting in California with the plan to march east to sack Washington D.C.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not to mention, the border between Afghanistan and China is relatively small and a good ways apart from more &amp;quot;urbanized&amp;quot; Afghanistan where US forces are more concentrated (far away both in terms of distance and elevation). It&amp;#39;s a very mountainous border.&lt;/p&gt;\n\n&lt;p&gt;And once you get over the mountains you&amp;#39;ve got 1,000+ km of desert and rural China before you even get close to the eastern half, where China&amp;#39;s industry and central government are located.&lt;/p&gt;\n\n&lt;p&gt;In other words, it would be like starting in California with the plan to march east to sack Washington D.C.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg565ip", "score_hidden": false, "stickied": false, "created": 1491984958.0, "created_utc": 1491956158.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg517m4", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Regularity", "parent_id": "t1_dg50t8e", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Afghanistan drove out both the Soviet Union and America. It's a land route in the sense a yard filled with several rabid guard dogs could be considered a short cut on the way to school.\n\nEven if Afghanistan were entirely docile, you'd still be faced with very rough terrain and vast distances (well over a thousand kilometers), which translates into a very slow, very vulnerable supply line. Supplies would be dispatched that could arrive days or weeks after the troops receiving them had already died.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Afghanistan drove out both the Soviet Union and America. It&amp;#39;s a land route in the sense a yard filled with several rabid guard dogs could be considered a short cut on the way to school.&lt;/p&gt;\n\n&lt;p&gt;Even if Afghanistan were entirely docile, you&amp;#39;d still be faced with very rough terrain and vast distances (well over a thousand kilometers), which translates into a very slow, very vulnerable supply line. Supplies would be dispatched that could arrive days or weeks after the troops receiving them had already died.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg517m4", "score_hidden": false, "stickied": false, "created": 1491978386.0, "created_utc": 1491949586.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg50t8e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "demosthenes02", "parent_id": "t1_dg4prnu", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Doesn't the us have Afghanistan as a direct land connection?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Doesn&amp;#39;t the us have Afghanistan as a direct land connection?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg50t8e", "score_hidden": false, "stickied": false, "created": 1491977874.0, "created_utc": 1491949074.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg5h170", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "In-China", "parent_id": "t1_dg4prnu", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "What Chinese aggression towards Korea or Japan are you talking about? If I remember correctly it was Japan who colonized Korea and invaded China in a Nazi-esque fashion while setting up the puppet state of Manchukuo. When did China ever start a war or invasion on Japan or Korea?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What Chinese aggression towards Korea or Japan are you talking about? If I remember correctly it was Japan who colonized Korea and invaded China in a Nazi-esque fashion while setting up the puppet state of Manchukuo. When did China ever start a war or invasion on Japan or Korea?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg5h170", "score_hidden": false, "stickied": false, "created": 1492000333.0, "created_utc": 1491971533.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg5xh92", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kerouacrimbaud", "parent_id": "t1_dg5mz9z", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "They are.  One reason action is *not* taken against the Kim regime is that if that action goes awry (which is easy to see happening) you would create a situation *far* worse on humanitarian grounds than the status quo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They are.  One reason action is &lt;em&gt;not&lt;/em&gt; taken against the Kim regime is that if that action goes awry (which is easy to see happening) you would create a situation &lt;em&gt;far&lt;/em&gt; worse on humanitarian grounds than the status quo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg5xh92", "score_hidden": false, "stickied": false, "created": 1492036011.0, "created_utc": 1492007211.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mz9z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "s6x", "parent_id": "t1_dg4prnu", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Why isn't the human rights crisis there a part of any of these calculations?  Why are governments so callous to this type of suffering?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why isn&amp;#39;t the human rights crisis there a part of any of these calculations?  Why are governments so callous to this type of suffering?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg5mz9z", "score_hidden": false, "stickied": false, "created": 1492014356.0, "created_utc": 1491985556.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg5hhtl", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Aidtor", "parent_id": "t1_dg5ewyb", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "&gt; Well the size of the German empire was huge compared to North Korea, so the cost wouldn't be as much\n\nIt's people, not land, that is expensive. The GDP per capita differential is much larger than east and west Germany. You'd have to essentially completely refrain millions who are brainwashed while simultaneously creating and industrial base from scratch. This would be *very* expensive. \n\n&gt;we could keep our military presence there also to protect South Koreans from the freed North Koreans\n\nNo. China would lose their shit which is very bad for the west as a whole. A more likely scenario would be China rushing in as soon as the Kim regime falls and creating a puppet state to act as a buffer zone. \n\n&gt;helping with the reconstruction could be passed more onto the United Nations also couldn't it? \n\nThis isn't like collecting money from you friends after a night out. We are talking trillions or tens of trillions of dollars. All the governments in the world spend about 17 trillion per year so you would be looking at diverting at least half of all government expenditures *in the world* and sending it to the UN. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Well the size of the German empire was huge compared to North Korea, so the cost wouldn&amp;#39;t be as much&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s people, not land, that is expensive. The GDP per capita differential is much larger than east and west Germany. You&amp;#39;d have to essentially completely refrain millions who are brainwashed while simultaneously creating and industrial base from scratch. This would be &lt;em&gt;very&lt;/em&gt; expensive. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;we could keep our military presence there also to protect South Koreans from the freed North Koreans&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No. China would lose their shit which is very bad for the west as a whole. A more likely scenario would be China rushing in as soon as the Kim regime falls and creating a puppet state to act as a buffer zone. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;helping with the reconstruction could be passed more onto the United Nations also couldn&amp;#39;t it? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This isn&amp;#39;t like collecting money from you friends after a night out. We are talking trillions or tens of trillions of dollars. All the governments in the world spend about 17 trillion per year so you would be looking at diverting at least half of all government expenditures &lt;em&gt;in the world&lt;/em&gt; and sending it to the UN. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg5hhtl", "score_hidden": false, "stickied": false, "created": 1492001166.0, "created_utc": 1491972366.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ewyb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KnifeMower", "parent_id": "t1_dg4prnu", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Well the size of the German empire was huge compared to North Korea, so the cost wouldn't be as much, and we could keep our military presence there also to protect South Koreans from the freed North Koreans, and helping with the reconstruction could be passed more onto the United Nations also couldn't it? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well the size of the German empire was huge compared to North Korea, so the cost wouldn&amp;#39;t be as much, and we could keep our military presence there also to protect South Koreans from the freed North Koreans, and helping with the reconstruction could be passed more onto the United Nations also couldn&amp;#39;t it? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg5ewyb", "score_hidden": false, "stickied": false, "created": 1491996840.0, "created_utc": 1491968040.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg501yo", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "BobMacActual", "parent_id": "t1_dg4prnu", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Came here to make sure somebody said this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Came here to make sure somebody said this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg501yo", "score_hidden": false, "stickied": false, "created": 1491976910.0, "created_utc": 1491948110.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4prnu", "gilded": 0, "archived": false, "score": 115, "report_reasons": null, "author": "Regularity", "parent_id": "t3_64sol2", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Mostly because no one really has a strong interest in seeing the NK regime toppled.\n\nChina wants it there as a buffer state against the US and their allies. A direct land connection makes any attempts at ground invasion, no matter how unlikely, much more likely to succeed (as opposed to being bottlenecked entirely by strategic air and naval transport capacity, as in the case of naval invasions). The loss of NK would also allow a more thorough deployment of missile interception systems, reducing the effectiveness of China's nuclear might.\n\nIt's unlikely the powers in South Korea want it either. German reunification supposedly cost a collective 2 trillion Euros to date. And that's bearing in mind the education and technology gap between the FRG (West) and GDR (East) was far less than between North and South Korea. While some blindly nationalistic groups desire it, anyone with an ounce of economic insight wouldn't bat an eyelash before deciding it's a Very Bad Idea.\n\nAmerica doesn't stand to gain very much. North Korea hasn't really caused it any significant economic damage, and toppling it wouldn't bring much profit. In fact, just the opposite: if their intervention is revealed, they risk sanctions, or being pressured into providing assistance to South Korea in cleaning up the aftermath.  North Korea also provides an excellent excuse to keep a significant military presence in the region to prevent Chinese aggression in nearby areas (Taiwan, Japan, South China Seas) without being accused of directly threatening or confronting China itself.\n\nAnd of course, there's the whole policy shift. The Cold War is over, the Monroe Doctrine is no longer a driving factor in US foreign affairs, and the Second Gulf War and Invasion of Afghanistan makes even a whiff of foreign intervention an invitation to a political shitstorm at this point.", "edited": 1491937403.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mostly because no one really has a strong interest in seeing the NK regime toppled.&lt;/p&gt;\n\n&lt;p&gt;China wants it there as a buffer state against the US and their allies. A direct land connection makes any attempts at ground invasion, no matter how unlikely, much more likely to succeed (as opposed to being bottlenecked entirely by strategic air and naval transport capacity, as in the case of naval invasions). The loss of NK would also allow a more thorough deployment of missile interception systems, reducing the effectiveness of China&amp;#39;s nuclear might.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s unlikely the powers in South Korea want it either. German reunification supposedly cost a collective 2 trillion Euros to date. And that&amp;#39;s bearing in mind the education and technology gap between the FRG (West) and GDR (East) was far less than between North and South Korea. While some blindly nationalistic groups desire it, anyone with an ounce of economic insight wouldn&amp;#39;t bat an eyelash before deciding it&amp;#39;s a Very Bad Idea.&lt;/p&gt;\n\n&lt;p&gt;America doesn&amp;#39;t stand to gain very much. North Korea hasn&amp;#39;t really caused it any significant economic damage, and toppling it wouldn&amp;#39;t bring much profit. In fact, just the opposite: if their intervention is revealed, they risk sanctions, or being pressured into providing assistance to South Korea in cleaning up the aftermath.  North Korea also provides an excellent excuse to keep a significant military presence in the region to prevent Chinese aggression in nearby areas (Taiwan, Japan, South China Seas) without being accused of directly threatening or confronting China itself.&lt;/p&gt;\n\n&lt;p&gt;And of course, there&amp;#39;s the whole policy shift. The Cold War is over, the Monroe Doctrine is no longer a driving factor in US foreign affairs, and the Second Gulf War and Invasion of Afghanistan makes even a whiff of foreign intervention an invitation to a political shitstorm at this point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg4prnu", "score_hidden": false, "stickied": false, "created": 1491965320.0, "created_utc": 1491936520.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 115}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg4xlfu", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Slinkwyde", "parent_id": "t1_dg4rbsh", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 1, "body": "&gt; solidify it's global identity\n\n*its (possessive, not \"it is\")", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;solidify it&amp;#39;s global identity&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;*its (possessive, not &amp;quot;it is&amp;quot;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg4xlfu", "score_hidden": false, "stickied": false, "created": 1491973931.0, "created_utc": 1491945131.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg5bl5c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Redapted", "parent_id": "t1_dg4wins", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Works well as a pun, though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Works well as a pun, though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg5bl5c", "score_hidden": false, "stickied": false, "created": 1491992092.0, "created_utc": 1491963292.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4wins", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "chilehead", "parent_id": "t1_dg4rbsh", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "[Reins](http://www.dictionary.com/browse/rein), not [reigns](http://www.dictionary.com/browse/reign).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://www.dictionary.com/browse/rein\"&gt;Reins&lt;/a&gt;, not &lt;a href=\"http://www.dictionary.com/browse/reign\"&gt;reigns&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg4wins", "score_hidden": false, "stickied": false, "created": 1491972669.0, "created_utc": 1491943869.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4rbsh", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "captainwacky91", "parent_id": "t3_64sol2", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Because we have a solid history of merely overthrowing them; not so much with the nation building/stability enforcement that should come after the overthrowing of said dictator(s). \n\n/u/Regularity has hit most of the talking points though. \n\nHowever; I would like to posit one interesting potential solution: instead of the US doing the legwork, China takes the reigns in rebuilding North Korea. \n\nIf China wants to 100% solidify it's global identity as a new \"Superpower\", then a task as monumental (and possibly unprecedented?) as \"restructuring\" the nation of North Korea would certainly give them the political clout to do so. If China decides to lax the borders between the two Koreas; then \"reunification\" has occurred at least on the social level, and China gets to keep their buffer state. Some of this is wishful thinking though.\n\nIn reality, the US would (likely) politically balk at such an idea. It would show the US as weak for failing to fulfill the 60+ year promise of Korean reunification; and with the old regime gone, so would any \"real\" need for strategic military bases located in South Korea... bases that expand the US' zone of military influence. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because we have a solid history of merely overthrowing them; not so much with the nation building/stability enforcement that should come after the overthrowing of said dictator(s). &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"/u/Regularity\"&gt;/u/Regularity&lt;/a&gt; has hit most of the talking points though. &lt;/p&gt;\n\n&lt;p&gt;However; I would like to posit one interesting potential solution: instead of the US doing the legwork, China takes the reigns in rebuilding North Korea. &lt;/p&gt;\n\n&lt;p&gt;If China wants to 100% solidify it&amp;#39;s global identity as a new &amp;quot;Superpower&amp;quot;, then a task as monumental (and possibly unprecedented?) as &amp;quot;restructuring&amp;quot; the nation of North Korea would certainly give them the political clout to do so. If China decides to lax the borders between the two Koreas; then &amp;quot;reunification&amp;quot; has occurred at least on the social level, and China gets to keep their buffer state. Some of this is wishful thinking though.&lt;/p&gt;\n\n&lt;p&gt;In reality, the US would (likely) politically balk at such an idea. It would show the US as weak for failing to fulfill the 60+ year promise of Korean reunification; and with the old regime gone, so would any &amp;quot;real&amp;quot; need for strategic military bases located in South Korea... bases that expand the US&amp;#39; zone of military influence. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg4rbsh", "score_hidden": false, "stickied": false, "created": 1491966956.0, "created_utc": 1491938156.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg5xulw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kerouacrimbaud", "parent_id": "t1_dg56xwg", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "That is part of it. The more important part is that we intervene where we know other great powers won't intervene in any serious capacity.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is part of it. The more important part is that we intervene where we know other great powers won&amp;#39;t intervene in any serious capacity.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg5xulw", "score_hidden": false, "stickied": false, "created": 1492036452.0, "created_utc": 1492007652.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg56xwg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "stillmclovinit", "parent_id": "t1_dg4z4d3", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "yep. we have a solid history of intervention in places where we disagree with the nation's choice of government bc it doesnt align with ours, too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yep. we have a solid history of intervention in places where we disagree with the nation&amp;#39;s choice of government bc it doesnt align with ours, too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg56xwg", "score_hidden": false, "stickied": false, "created": 1491986007.0, "created_utc": 1491957207.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4z4d3", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Potss", "parent_id": "t3_64sol2", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "You forgot the key component.  We have a history of supporting far more 3rd world dictators than the number we've overthrown.  In fact we've probably put at least as many in power as we've overthrown.  The overthrow only comes if they are no longer politically or economically convenient, and there will be a decent ROI for the ruling class in eliminating them.  That is rarer than you might think. \n\n\nIn the case of NK, the ROI just isn't there, especially with China, and especially with it acting as such a good propaganda tool for our narratives. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You forgot the key component.  We have a history of supporting far more 3rd world dictators than the number we&amp;#39;ve overthrown.  In fact we&amp;#39;ve probably put at least as many in power as we&amp;#39;ve overthrown.  The overthrow only comes if they are no longer politically or economically convenient, and there will be a decent ROI for the ruling class in eliminating them.  That is rarer than you might think. &lt;/p&gt;\n\n&lt;p&gt;In the case of NK, the ROI just isn&amp;#39;t there, especially with China, and especially with it acting as such a good propaganda tool for our narratives. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg4z4d3", "score_hidden": false, "stickied": false, "created": 1491975767.0, "created_utc": 1491946967.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg55l58", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "csbob2010", "parent_id": "t1_dg4ua37", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "It would have to be a complete regime change or someone would just take Kim's spot. Regimes don't hand over power by choice. They know they are all going to prison at best once the international courts start investigating conditions there. I'm sure there's a much more rigid command structure than we are aware of, one of the generals or his relatives would just take over if he was assassinated without a follow up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It would have to be a complete regime change or someone would just take Kim&amp;#39;s spot. Regimes don&amp;#39;t hand over power by choice. They know they are all going to prison at best once the international courts start investigating conditions there. I&amp;#39;m sure there&amp;#39;s a much more rigid command structure than we are aware of, one of the generals or his relatives would just take over if he was assassinated without a follow up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg55l58", "score_hidden": false, "stickied": false, "created": 1491984220.0, "created_utc": 1491955420.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg5e57w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Uncle_Erik", "parent_id": "t1_dg4ua37", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Do you have *any* idea how difficult it is to feed 25 million people?  It would take most of the spare resources of the entire free world.  Plus North Korea's infrastructure is total shit.  It's not like you could simply bring trucks over.  Or have refrigerated storage, or storage at all, for that matter.  You'd have to go in and build new roads, rail lines, airports, warehouses, ports, and much else.\n\nIn the meantime, millions of starving people would flood into China and South Korea, which would present a bunch of additional problems.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have &lt;em&gt;any&lt;/em&gt; idea how difficult it is to feed 25 million people?  It would take most of the spare resources of the entire free world.  Plus North Korea&amp;#39;s infrastructure is total shit.  It&amp;#39;s not like you could simply bring trucks over.  Or have refrigerated storage, or storage at all, for that matter.  You&amp;#39;d have to go in and build new roads, rail lines, airports, warehouses, ports, and much else.&lt;/p&gt;\n\n&lt;p&gt;In the meantime, millions of starving people would flood into China and South Korea, which would present a bunch of additional problems.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg5e57w", "score_hidden": false, "stickied": false, "created": 1491995681.0, "created_utc": 1491966881.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ua37", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Smash_4dams", "parent_id": "t1_dg4tlmb", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "Wouldn't the removal of sanctions help feed these people though? If the dictator was eliminated, the US, China, Japan and other first world nations would be much more willing to provide aid to the country, no?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wouldn&amp;#39;t the removal of sanctions help feed these people though? If the dictator was eliminated, the US, China, Japan and other first world nations would be much more willing to provide aid to the country, no?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg4ua37", "score_hidden": false, "stickied": false, "created": 1491970166.0, "created_utc": 1491941366.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg5cbb0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeShawnThordason", "parent_id": "t1_dg4tlmb", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "&gt; a short, bloody civil war, as the top generals sought to replace Kim with a stay-the-course provisional government. Since vicious repression is the go-to tool kit, purges would be virtually guaranteed.\n\nThis is what I perceive. I'm not confident that the power struggle would result in a situation which allows refugees to flee to the borders for long.\n\nFurther, sending an assassin would be (1) a likely suicide mission and (2) an act of war. A war no one really wants, and which would kill thousands (at least) of South Korean citizens in its opening moments. If the DPRK goes to war with the South, it is destroyed, leading to the full humanitarian and refugee disaster. If it goes to war with itself, it is bloody and still a massive humanitarian crisis, but one that may not have a resolution if the state remains intact.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;a short, bloody civil war, as the top generals sought to replace Kim with a stay-the-course provisional government. Since vicious repression is the go-to tool kit, purges would be virtually guaranteed.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is what I perceive. I&amp;#39;m not confident that the power struggle would result in a situation which allows refugees to flee to the borders for long.&lt;/p&gt;\n\n&lt;p&gt;Further, sending an assassin would be (1) a likely suicide mission and (2) an act of war. A war no one really wants, and which would kill thousands (at least) of South Korean citizens in its opening moments. If the DPRK goes to war with the South, it is destroyed, leading to the full humanitarian and refugee disaster. If it goes to war with itself, it is bloody and still a massive humanitarian crisis, but one that may not have a resolution if the state remains intact.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg5cbb0", "score_hidden": false, "stickied": false, "created": 1491993093.0, "created_utc": 1491964293.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4tlmb", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "jello_sweaters", "parent_id": "t3_64sol2", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "The fall of the Kim regime would be followed immediately by one of the greatest humanitarian disasters in human history.\n\nThere are 25 million North Koreans, most of whom are on the edge of starvation *if* the North Korean government is humming along at peak efficiency.\n\nWithin this, there are literally no living North Koreans who have known any life other than the Kim dynasty; the level of brainwashing is severe, and if even a quarter of them feel actual loyalty, then the post-fall period will be one of bloodshed, as factions within the military and civilian populations fight to create a new social order that is literally inconceivable to 99% of the population.\n\nMore than likely, the first thing we'd see, unless a foreign power sent a *massive* occupying force to oversee the transition, would be a short, bloody civil war, as the top generals sought to replace Kim with a stay-the-course provisional government. Since vicious repression is the go-to tool kit, purges would be virtually guaranteed.\n\nFast-forward a month. You've got ten million starving people who literally don't know how to live without being told what to do. The most likely outcome is a mass migration towards the South and into China, neither of whom are prepared to take on millions of extra hungry refugees. More to the point, though, it'll take a while for word to get round that you simply can't walk to South Korea, and thousands of people will die in the minefields.\n\nBest-case, it'll be a decade before a post-Kim North Korea is ready to function as a third-world state, as they are almost entirely lacking in infrastructure and any industry beyond farming with ox and plow, or mining with 1940s-level technology.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The fall of the Kim regime would be followed immediately by one of the greatest humanitarian disasters in human history.&lt;/p&gt;\n\n&lt;p&gt;There are 25 million North Koreans, most of whom are on the edge of starvation &lt;em&gt;if&lt;/em&gt; the North Korean government is humming along at peak efficiency.&lt;/p&gt;\n\n&lt;p&gt;Within this, there are literally no living North Koreans who have known any life other than the Kim dynasty; the level of brainwashing is severe, and if even a quarter of them feel actual loyalty, then the post-fall period will be one of bloodshed, as factions within the military and civilian populations fight to create a new social order that is literally inconceivable to 99% of the population.&lt;/p&gt;\n\n&lt;p&gt;More than likely, the first thing we&amp;#39;d see, unless a foreign power sent a &lt;em&gt;massive&lt;/em&gt; occupying force to oversee the transition, would be a short, bloody civil war, as the top generals sought to replace Kim with a stay-the-course provisional government. Since vicious repression is the go-to tool kit, purges would be virtually guaranteed.&lt;/p&gt;\n\n&lt;p&gt;Fast-forward a month. You&amp;#39;ve got ten million starving people who literally don&amp;#39;t know how to live without being told what to do. The most likely outcome is a mass migration towards the South and into China, neither of whom are prepared to take on millions of extra hungry refugees. More to the point, though, it&amp;#39;ll take a while for word to get round that you simply can&amp;#39;t walk to South Korea, and thousands of people will die in the minefields.&lt;/p&gt;\n\n&lt;p&gt;Best-case, it&amp;#39;ll be a decade before a post-Kim North Korea is ready to function as a third-world state, as they are almost entirely lacking in infrastructure and any industry beyond farming with ox and plow, or mining with 1940s-level technology.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg4tlmb", "score_hidden": false, "stickied": false, "created": 1491969412.0, "created_utc": 1491940612.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s91q", "removal_reason": null, "link_id": "t3_64sol2", "likes": null, "replies": "", "user_reports": [], "id": "dg58gsn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "autoNFA", "parent_id": "t3_64sol2", "subreddit_name_prefixed": "r/TrueAskReddit", "controversiality": 0, "body": "In addition to what other people have said, NK has a lot of artillery and missiles pointed towards Seoul. As I understand it, if they fired, they'd kill tens of thousands of South Korean civilians before their launch sites could be destroyed, even with a pre-emptive attack on the launch sites.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In addition to what other people have said, NK has a lot of artillery and missiles pointed towards Seoul. As I understand it, if they fired, they&amp;#39;d kill tens of thousands of South Korean civilians before their launch sites could be destroyed, even with a pre-emptive attack on the launch sites.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TrueAskReddit", "name": "t1_dg58gsn", "score_hidden": false, "stickied": false, "created": 1491988005.0, "created_utc": 1491959205.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]