[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "ProRevenge", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So back in 2011 I got my CDLs. Commercial drivers license for those that don&amp;#39;t know. I wanted to get a local route but the only place that would hire someone without experience that wasn&amp;#39;t driving across country was a local beverage company. Our main brand was Miller.. I was the Miller man.&lt;/p&gt;\n\n&lt;p&gt;Now this job had me getting up at 4am, driving to the warehouse to pick up the truck, drive up to two hours away before starting my deliveries, delivering (at most I think 27 stores in one day) up to about 700 cases of different product, driving back the two hours to the warehouse and then clocking out.&lt;/p&gt;\n\n&lt;p&gt;If anyone has done delivery, you know that if one thing goes wrong early in the day that the rest of your day usually continues to go downhill. As a beer man, the prices at big chain stores had to be exact, if not... phone calls were made, prices changed, math was done, it was a lot when you&amp;#39;re in a hurry.&lt;/p&gt;\n\n&lt;p&gt;Now you may ask why one would be in a hurry... Well the beer delivery job is tough, but if you&amp;#39;re into moving around and not being lazy, it&amp;#39;s a great job for staying in shape, slinging 700 cases of beer a day is quite a workout, not to mention all the walking you do around stores... the reason they&amp;#39;re in a hurry is because their managers. They are always on your ass about what took so long at such and such store. These managers get bonuses if their drivers don&amp;#39;t go over so many hours per week. You see where this is going.&lt;/p&gt;\n\n&lt;p&gt;My manager (we will call him EZ money) this is a throw away but if he sees this he will know who I am and that it&amp;#39;s about him. He was all buddy buddy at first. Then this lead slowly into the bullshit about where I&amp;#39;m at or what&amp;#39;s taking so long. I&amp;#39;ve been accused of taking a nap at a truck stop instead of delivering. That set me off one day and I told him if he didn&amp;#39;t like how I was doing my job, he could get out of his office and come tell me how to do it right.  &lt;/p&gt;\n\n&lt;p&gt;Saying that, I did try to get my hours in but I didn&amp;#39;t stop working all day. I would face beer/wine bottles in stores when I stocked and such. Everything looked great by the time I left. I rotated every item and kept back stock looking nice. Apparently that only matters when someone important might look at it. Not on a regular basis for time reasons.&lt;/p&gt;\n\n&lt;p&gt;What really set me off was when my manager called me about 3pm one evening as I&amp;#39;m driving my route back to the warehouse (keep in mind it&amp;#39;s 2 hours in one direction to first stop. That&amp;#39;s 4 hours on the road.) He asks me where the hell I am and when I&amp;#39;ll be back. I tell him I&amp;#39;m on the road and I&amp;#39;ll be there in about an hour. Hang up.  When I get back to the warehouse he calls me in his office where his boss is also sitting. They had me a sheet of paper that says I violated company policy by answering the phone while driving. I almost lost my shit over this because EZ money was the one gagging out and called me. If I didn&amp;#39;t answer he would be like the bad ex everyone has had that blows phones up. I signed the paper. Took my warning. Went back to working like normal but with vengeance on my mind.&lt;/p&gt;\n\n&lt;p&gt;Fast forward, I quit that job for another job that paid 7 more dollars on the hour. The beer company told me to come talk to them on my last day because I didn&amp;#39;t give my notice until the day I quit. They offered me a dollar raise. Told them no. I was going to drop all thought about that job but working there for two years I had most of the employees added on Facebook. EZ money was on that list of people.&lt;/p&gt;\n\n&lt;p&gt;One day I&amp;#39;m surfing the ol&amp;#39; Facebook and I see a picture that EZ money had posted. Apparently one of his drivers didn&amp;#39;t show up so he had to drive the delivery truck. I didn&amp;#39;t mention earlier that these are the tractor trailers with the doors going down the sides. Not exactly small. This mother frigger was driving this tractor trailer down the interstate at 70mph taking a picture of the sunrise. You can clearly see the interior of the truck, the interstate, the sunrise. I don&amp;#39;t know anyone who stops on the interstate in the middle of the road to take a picture. I immediately emailed the beer company corporate office. Explaining that I was such and such and saw one of their drivers putting pictures on Facebook of them driving in the truck. Blah blah dangerous blah blah. Sent. I forgot about it.&lt;/p&gt;\n\n&lt;p&gt;About two weeks later, one of my buddies that worked there sends me a text and says &amp;quot;You won&amp;#39;t believe what happened to EZ money!&amp;quot; Turns out he was fired. My friend said it was due to lacking performance... deep down I knew what had really happened. That picture that he took brought him down. All that was needed was a little help. This guy lost his pretty decent job, his wife left him for another beer manager (that wasn&amp;#39;t any part of my doing but I laughed my ass off) and his two kids stay with mommy and her new man while new man posts things about being &amp;quot;new dad&amp;quot; of the year. Savage. All over trying to be cool with a picture on Facebook.&lt;/p&gt;\n\n&lt;p&gt;TL;DR\nManager was a prick and got me in trouble for something petty. Manager sets up his own demise via picture on Facebook. I push the ball down the hill and watch it explode on Ez Money&amp;#39;s life.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So back in 2011 I got my CDLs. Commercial drivers license for those that don't know. I wanted to get a local route but the only place that would hire someone without experience that wasn't driving across country was a local beverage company. Our main brand was Miller.. I was the Miller man.\n\nNow this job had me getting up at 4am, driving to the warehouse to pick up the truck, drive up to two hours away before starting my deliveries, delivering (at most I think 27 stores in one day) up to about 700 cases of different product, driving back the two hours to the warehouse and then clocking out.\n\nIf anyone has done delivery, you know that if one thing goes wrong early in the day that the rest of your day usually continues to go downhill. As a beer man, the prices at big chain stores had to be exact, if not... phone calls were made, prices changed, math was done, it was a lot when you're in a hurry.\n\nNow you may ask why one would be in a hurry... Well the beer delivery job is tough, but if you're into moving around and not being lazy, it's a great job for staying in shape, slinging 700 cases of beer a day is quite a workout, not to mention all the walking you do around stores... the reason they're in a hurry is because their managers. They are always on your ass about what took so long at such and such store. These managers get bonuses if their drivers don't go over so many hours per week. You see where this is going.\n\nMy manager (we will call him EZ money) this is a throw away but if he sees this he will know who I am and that it's about him. He was all buddy buddy at first. Then this lead slowly into the bullshit about where I'm at or what's taking so long. I've been accused of taking a nap at a truck stop instead of delivering. That set me off one day and I told him if he didn't like how I was doing my job, he could get out of his office and come tell me how to do it right.  \n\nSaying that, I did try to get my hours in but I didn't stop working all day. I would face beer/wine bottles in stores when I stocked and such. Everything looked great by the time I left. I rotated every item and kept back stock looking nice. Apparently that only matters when someone important might look at it. Not on a regular basis for time reasons.\n\nWhat really set me off was when my manager called me about 3pm one evening as I'm driving my route back to the warehouse (keep in mind it's 2 hours in one direction to first stop. That's 4 hours on the road.) He asks me where the hell I am and when I'll be back. I tell him I'm on the road and I'll be there in about an hour. Hang up.  When I get back to the warehouse he calls me in his office where his boss is also sitting. They had me a sheet of paper that says I violated company policy by answering the phone while driving. I almost lost my shit over this because EZ money was the one gagging out and called me. If I didn't answer he would be like the bad ex everyone has had that blows phones up. I signed the paper. Took my warning. Went back to working like normal but with vengeance on my mind.\n\n\nFast forward, I quit that job for another job that paid 7 more dollars on the hour. The beer company told me to come talk to them on my last day because I didn't give my notice until the day I quit. They offered me a dollar raise. Told them no. I was going to drop all thought about that job but working there for two years I had most of the employees added on Facebook. EZ money was on that list of people.\n\nOne day I'm surfing the ol' Facebook and I see a picture that EZ money had posted. Apparently one of his drivers didn't show up so he had to drive the delivery truck. I didn't mention earlier that these are the tractor trailers with the doors going down the sides. Not exactly small. This mother frigger was driving this tractor trailer down the interstate at 70mph taking a picture of the sunrise. You can clearly see the interior of the truck, the interstate, the sunrise. I don't know anyone who stops on the interstate in the middle of the road to take a picture. I immediately emailed the beer company corporate office. Explaining that I was such and such and saw one of their drivers putting pictures on Facebook of them driving in the truck. Blah blah dangerous blah blah. Sent. I forgot about it.\n\n\nAbout two weeks later, one of my buddies that worked there sends me a text and says \"You won't believe what happened to EZ money!\" Turns out he was fired. My friend said it was due to lacking performance... deep down I knew what had really happened. That picture that he took brought him down. All that was needed was a little help. This guy lost his pretty decent job, his wife left him for another beer manager (that wasn't any part of my doing but I laughed my ass off) and his two kids stay with mommy and her new man while new man posts things about being \"new dad\" of the year. Savage. All over trying to be cool with a picture on Facebook.\n\n\nTL;DR\nManager was a prick and got me in trouble for something petty. Manager sets up his own demise via picture on Facebook. I push the ball down the hill and watch it explode on Ez Money's life.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64xfao", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 400, "report_reasons": null, "author": "usedtobe_beerman", "saved": false, "mod_reports": [], "name": "t3_64xfao", "subreddit_name_prefixed": "r/ProRevenge", "approved_by": null, "over_18": false, "domain": "self.ProRevenge", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2vjvl", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/ProRevenge/comments/64xfao/revenge_for_the_beer_man/", "num_reports": null, "locked": false, "stickied": false, "created": 1492023424.0, "url": "https://www.reddit.com/r/ProRevenge/comments/64xfao/revenge_for_the_beer_man/", "author_flair_text": null, "quarantine": false, "title": "Revenge for the beer man.", "created_utc": 1491994624.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 400}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vjvl", "removal_reason": null, "link_id": "t3_64xfao", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vjvl", "removal_reason": null, "link_id": "t3_64xfao", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vjvl", "removal_reason": null, "link_id": "t3_64xfao", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vjvl", "removal_reason": null, "link_id": "t3_64xfao", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vjvl", "removal_reason": null, "link_id": "t3_64xfao", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vjvl", "removal_reason": null, "link_id": "t3_64xfao", "likes": null, "replies": "", "user_reports": [], "id": "dg6062d", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "usedtobe_beerman", "parent_id": "t1_dg5zomy", "subreddit_name_prefixed": "r/ProRevenge", "controversiality": 0, "body": "Oh hahahaha my bad!  I agree totally. The funny part is that everyone who reads it doesn't even care. I do like seeing others drama tho lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh hahahaha my bad!  I agree totally. The funny part is that everyone who reads it doesn&amp;#39;t even care. I do like seeing others drama tho lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ProRevenge", "name": "t1_dg6062d", "score_hidden": false, "stickied": false, "created": 1492039077.0, "created_utc": 1492010277.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zomy", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "eViLegion", "parent_id": "t1_dg5ytiz", "subreddit_name_prefixed": "r/ProRevenge", "controversiality": 0, "body": "Heh, sorry, my post looks like I was having a go at you but I totally wasn't! I don't mean 'you' as in 'you'... I mean 'you' as in 'people in general'.\n\nYou, and the stuff you're posting, it's all cool bro!\n\nI mean those people posting all the evidence of their amazing lives, it just seems to me like they are trying really hard to convince everyone else of it's awesomeness, rather than just enjoying it quietly like normal folks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Heh, sorry, my post looks like I was having a go at you but I totally wasn&amp;#39;t! I don&amp;#39;t mean &amp;#39;you&amp;#39; as in &amp;#39;you&amp;#39;... I mean &amp;#39;you&amp;#39; as in &amp;#39;people in general&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;You, and the stuff you&amp;#39;re posting, it&amp;#39;s all cool bro!&lt;/p&gt;\n\n&lt;p&gt;I mean those people posting all the evidence of their amazing lives, it just seems to me like they are trying really hard to convince everyone else of it&amp;#39;s awesomeness, rather than just enjoying it quietly like normal folks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ProRevenge", "name": "t1_dg5zomy", "score_hidden": false, "stickied": false, "created": 1492038539.0, "created_utc": 1492009739.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ytiz", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "usedtobe_beerman", "parent_id": "t1_dg5x15z", "subreddit_name_prefixed": "r/ProRevenge", "controversiality": 0, "body": "Edit: misunderstood the post! Cheers.", "edited": 1492010315.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Edit: misunderstood the post! Cheers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ProRevenge", "name": "t1_dg5ytiz", "score_hidden": false, "stickied": false, "created": 1492037562.0, "created_utc": 1492008762.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5x15z", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "eViLegion", "parent_id": "t1_dg5rfcn", "subreddit_name_prefixed": "r/ProRevenge", "controversiality": 0, "body": "Posting shit on facebook?\nWell, your life must be totally awesome given the desperate measures you appear to be taking to convince me of this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Posting shit on facebook?\nWell, your life must be totally awesome given the desperate measures you appear to be taking to convince me of this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ProRevenge", "name": "t1_dg5x15z", "score_hidden": false, "stickied": false, "created": 1492035480.0, "created_utc": 1492006680.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5rfcn", "gilded": 0, "archived": false, "score": 50, "report_reasons": null, "author": "usedtobe_beerman", "parent_id": "t1_dg5qtsz", "subreddit_name_prefixed": "r/ProRevenge", "controversiality": 0, "body": "I mostly keep stuff off of there. My girlfriend says the relationships you don't see on Facebook are the good ones. I agree. \n\nI also think that if you're gonna bail on something it's better to tell the truth about why. People respect that. Some just don't get it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mostly keep stuff off of there. My girlfriend says the relationships you don&amp;#39;t see on Facebook are the good ones. I agree. &lt;/p&gt;\n\n&lt;p&gt;I also think that if you&amp;#39;re gonna bail on something it&amp;#39;s better to tell the truth about why. People respect that. Some just don&amp;#39;t get it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ProRevenge", "name": "t1_dg5rfcn", "score_hidden": false, "stickied": false, "created": 1492026895.0, "created_utc": 1491998095.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 50}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vjvl", "removal_reason": null, "link_id": "t3_64xfao", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vjvl", "removal_reason": null, "link_id": "t3_64xfao", "likes": null, "replies": "", "user_reports": [], "id": "dg61u4s", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "usedtobe_beerman", "parent_id": "t1_dg61ci0", "subreddit_name_prefixed": "r/ProRevenge", "controversiality": 0, "body": "This manager also told me to \"unlike\" Budweiser because I worked for Miller. If I hadn't lost respect for him already, I would have then. People and their internet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This manager also told me to &amp;quot;unlike&amp;quot; Budweiser because I worked for Miller. If I hadn&amp;#39;t lost respect for him already, I would have then. People and their internet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ProRevenge", "name": "t1_dg61u4s", "score_hidden": false, "stickied": false, "created": 1492040910.0, "created_utc": 1492012110.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg61ci0", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "DemonB7R", "parent_id": "t1_dg5qtsz", "subreddit_name_prefixed": "r/ProRevenge", "controversiality": 0, "body": "This is why I do not friend anyone I work with. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is why I do not friend anyone I work with. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ProRevenge", "name": "t1_dg61ci0", "score_hidden": false, "stickied": false, "created": 1492040370.0, "created_utc": 1492011570.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vjvl", "removal_reason": null, "link_id": "t3_64xfao", "likes": null, "replies": "", "user_reports": [], "id": "dgddfcu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tehskwrl", "parent_id": "t1_dg5qtsz", "subreddit_name_prefixed": "r/ProRevenge", "controversiality": 0, "body": "FB is a poison. It feels strange being off of it, but let me tell you, I found the fucking cure. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;FB is a poison. It feels strange being off of it, but let me tell you, I found the fucking cure. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ProRevenge", "name": "t1_dgddfcu", "score_hidden": false, "stickied": false, "created": 1492457204.0, "created_utc": 1492428404.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qtsz", "gilded": 0, "archived": false, "score": 127, "report_reasons": null, "author": "SleepNowMyThrowaway", "parent_id": "t3_64xfao", "subreddit_name_prefixed": "r/ProRevenge", "controversiality": 0, "body": "&gt; ...his wife left him for another beer manager.\n\nlol\n\nFB is a poison and I find it remarkable idiots that post on there. A co-worker of mine was supposed to be off \"sick\" but his wife was posting photos of them on a beach in Florida; didn't go over well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;...his wife left him for another beer manager.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;lol&lt;/p&gt;\n\n&lt;p&gt;FB is a poison and I find it remarkable idiots that post on there. A co-worker of mine was supposed to be off &amp;quot;sick&amp;quot; but his wife was posting photos of them on a beach in Florida; didn&amp;#39;t go over well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ProRevenge", "name": "t1_dg5qtsz", "score_hidden": false, "stickied": false, "created": 1492025609.0, "created_utc": 1491996809.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 127}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vjvl", "removal_reason": null, "link_id": "t3_64xfao", "likes": null, "replies": "", "user_reports": [], "id": "dg6ct6n", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "fixerofthings", "parent_id": "t3_64xfao", "subreddit_name_prefixed": "r/ProRevenge", "controversiality": 0, "body": "Oh man, that's awesome. Had a similar situation with a Micro manager, Marco from here on in, I had years ago. We were a contractor that installed \"Big Brother Black boxes\" on anything that you could drive in postal sorting centers, automotive plants, etc. Anyway, I knew I'd be working in a foundry one day and I wore clothes that I could get dirty in. I finished early and was asked to come to Ford HQ in Dearborn to upgrade their fleet hardware. I confirmed with my boss and went there to finish up. I was slightly embarrassed due to my attire and that I was now in a corporate environment, a sea of ties and suits. But, since we didn't have any professional looking polos with a company logo I wore what I thought was suitable for the environment. I mentioned this to my program manager and he said not to worry about it and that he would see about getting us company polos. \n\nHearing about my attire in Ford's corporate offices, Marco berated me for wearing a t-shirt under my safety vets. Soon after, we got t-shirts and a few polos with our company logo on it but we were under strict orders that we were NEVER to wear the t-shirt on site. Um...ok. Whatevs.\n\nFast forward a few months, we gather at the largest USPS facility in the country for training. My manager, Marco shows up in, you guessed it, our company t-shirt. The same t-shirt we were told NEVER to wear on site.\n\nI quickly snapped a pic of him and sent it to *his* boss. \n\nGuess who got a write up? Thanks Marco. Worst micro-manager ever.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh man, that&amp;#39;s awesome. Had a similar situation with a Micro manager, Marco from here on in, I had years ago. We were a contractor that installed &amp;quot;Big Brother Black boxes&amp;quot; on anything that you could drive in postal sorting centers, automotive plants, etc. Anyway, I knew I&amp;#39;d be working in a foundry one day and I wore clothes that I could get dirty in. I finished early and was asked to come to Ford HQ in Dearborn to upgrade their fleet hardware. I confirmed with my boss and went there to finish up. I was slightly embarrassed due to my attire and that I was now in a corporate environment, a sea of ties and suits. But, since we didn&amp;#39;t have any professional looking polos with a company logo I wore what I thought was suitable for the environment. I mentioned this to my program manager and he said not to worry about it and that he would see about getting us company polos. &lt;/p&gt;\n\n&lt;p&gt;Hearing about my attire in Ford&amp;#39;s corporate offices, Marco berated me for wearing a t-shirt under my safety vets. Soon after, we got t-shirts and a few polos with our company logo on it but we were under strict orders that we were NEVER to wear the t-shirt on site. Um...ok. Whatevs.&lt;/p&gt;\n\n&lt;p&gt;Fast forward a few months, we gather at the largest USPS facility in the country for training. My manager, Marco shows up in, you guessed it, our company t-shirt. The same t-shirt we were told NEVER to wear on site.&lt;/p&gt;\n\n&lt;p&gt;I quickly snapped a pic of him and sent it to &lt;em&gt;his&lt;/em&gt; boss. &lt;/p&gt;\n\n&lt;p&gt;Guess who got a write up? Thanks Marco. Worst micro-manager ever.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ProRevenge", "name": "t1_dg6ct6n", "score_hidden": false, "stickied": false, "created": 1492052226.0, "created_utc": 1492023426.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vjvl", "removal_reason": null, "link_id": "t3_64xfao", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2vjvl", "removal_reason": null, "link_id": "t3_64xfao", "likes": null, "replies": "", "user_reports": [], "id": "dg6wq5b", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "usedtobe_beerman", "parent_id": "t1_dg6wabh", "subreddit_name_prefixed": "r/ProRevenge", "controversiality": 0, "body": "Getting paid by the hour definitely helped. I liked the overtime. Didn't like the back pain every day lol. Your job was my favorite person to have with me. It's a bigger help than anyone thinks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Getting paid by the hour definitely helped. I liked the overtime. Didn&amp;#39;t like the back pain every day lol. Your job was my favorite person to have with me. It&amp;#39;s a bigger help than anyone thinks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ProRevenge", "name": "t1_dg6wq5b", "score_hidden": false, "stickied": false, "created": 1492075176.0, "created_utc": 1492046376.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6wabh", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Ilovekittensomg", "parent_id": "t3_64xfao", "subreddit_name_prefixed": "r/ProRevenge", "controversiality": 0, "body": "Having worked for a beer distributor (5 years with a Bud distributor), my hat is off to you. Sideloaders are a beast, taking time to rotate and face labels was usually an afterthought. I spent some time helping drivers and still have no idea how anyone can do that day after day. The day I quit was the best day I had there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having worked for a beer distributor (5 years with a Bud distributor), my hat is off to you. Sideloaders are a beast, taking time to rotate and face labels was usually an afterthought. I spent some time helping drivers and still have no idea how anyone can do that day after day. The day I quit was the best day I had there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ProRevenge", "name": "t1_dg6wabh", "score_hidden": false, "stickied": false, "created": 1492074635.0, "created_utc": 1492045835.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2vjvl", "removal_reason": null, "link_id": "t3_64xfao", "likes": null, "replies": "", "user_reports": [], "id": "dg68zde", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "dannydale", "parent_id": "t3_64xfao", "subreddit_name_prefixed": "r/ProRevenge", "controversiality": 0, "body": "This is what should happen to a manager when they entrap an employee. Excellent work!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is what should happen to a manager when they entrap an employee. Excellent work!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ProRevenge", "name": "t1_dg68zde", "score_hidden": false, "stickied": false, "created": 1492048299.0, "created_utc": 1492019499.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}]