[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "ProRevenge", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve worked in environmental consulting in one form or another for several years.during my career, I had to take a job with a small, locally owned company run by Dr. Slime.  DS has a phd and required us to call him DS.  &lt;/p&gt;\n\n&lt;p&gt;I had been there for several years and worked my way up to manager for the remediation group.  DS had one client that was big.  They had a chemical release that revealed a history of spills that impacted the groundwater.  Our company&amp;#39;s job was to clean it up to state/federal standards in the most cost effective way possible.  The previous remediation manager had proposed a conventional &amp;quot;pump and treat&amp;quot; system.  A pump and treat system is usually deep groundwater pumps installed in groundwater recovery wells pumping impacted groundwater to the surface for treatment.  He proposed a rather inexpensive option that, in reality, wasn&amp;#39;t going to work.  Regulators questioned the effectiveness of the proposed system, so DS paid a consultant to agree that our approach was sound.&lt;/p&gt;\n\n&lt;p&gt;As I stated above, the former manager was former and it was in my hands.  Rather than install a P&amp;amp;T system that wouldn&amp;#39;t work, I designed and recommended a more aggressive, and expensive remediation system.  &lt;/p&gt;\n\n&lt;p&gt;The cost difference jumped from $50k for the P&amp;amp;T to about $150k for my design.  I showed via models that the advanced system would accomplish the goal of capturing the contaminated water and actually cleaning it up faster, and in the long term...less costs.&lt;/p&gt;\n\n&lt;p&gt;The client bought into it and we finalized the design of our system.  Various tweaks and adjustments were made.  We billed the client top dollar for this design.  I show the final package to DS.  He asks if I had sent this to the client.  I hadn&amp;#39;t.   &lt;/p&gt;\n\n&lt;p&gt;And I left his office.   &lt;/p&gt;\n\n&lt;p&gt;We spend the next months installing wells, the support for the system, start it up and are operating for a few months when I am in clients office giving him an update.&lt;/p&gt;\n\n&lt;p&gt;He says, you&amp;#39;d think for the money we spent, $175,000,  it would perform as good as it was.  &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t say anything, because i wanted to investigate why his number was $25k more.  Note:  DS&amp;#39;s practice was to sell the client services and mark up our costs by 10%.  Easy money for being a bank.  I had arranged for the client to pay the manufacturer directly, to save these markups.&lt;/p&gt;\n\n&lt;p&gt;I reached out to the manufacturer about the increase in costs and was told not to ask.  &lt;/p&gt;\n\n&lt;p&gt;Me?  I did the mental math and determined that DS arranged to get a $25k kickback on the system we designed.&lt;/p&gt;\n\n&lt;p&gt;I should have reported him for fraud, but I didn&amp;#39;t.  To many coworkers would have lost their jobs and the manufacturer would have been in trouble too.&lt;/p&gt;\n\n&lt;p&gt;My plan was to hit DS where it hurt most:  his billings.  I figured that if I could save the client $100k, it would make up for my estimated kickback.&lt;/p&gt;\n\n&lt;p&gt;For the previous years, we had to sample roughly 100 groundwater wells 4 times a year.  We would have 6 people working a week and billing the client for it.&lt;/p&gt;\n\n&lt;p&gt;I used a new technology that allowed us to replace the labor from 240 manhours to 40 manhours (1 person on site doing the work of 6 people) 4 times a year (saving $25k per event).&lt;/p&gt;\n\n&lt;p&gt;DS owned the lab that the client used.   I suggested that the client bid out the work to minimize the costs.  I included their sampling required for their permits.  &lt;/p&gt;\n\n&lt;p&gt;I put together a request for bids and sent it to the client with a list of labs, including DS&amp;#39;s lab.&lt;/p&gt;\n\n&lt;p&gt;When he found out, he called me into his office.  He was more than upset, cussing me out telling me not to f-ck with his lab.  Anyway, the bids were in and it saved the client about $30k a year.&lt;/p&gt;\n\n&lt;p&gt;DS didn&amp;#39;t pay us overtime.  We were supposed to get get &amp;quot;comp-time&amp;quot; for over 45 hours, but it was a lie.  Of course, no matter how many hours I worked, I never billed the client for more than 38 hours a week (as 2 hours a week were dedicated to a weekly staff meeting and paperwork).&lt;/p&gt;\n\n&lt;p&gt;So far, the plan is working out well.  The client is recouping their cost.  DS is losing revenue.&lt;/p&gt;\n\n&lt;p&gt;But I am the one suffering.   So I came up with a plan to quit and force him to hire me back as a contractor at a pretty big hourly rate.  He bites, we sign a contract, and I am granted 24 hours a week.  Sure, I give up the manager spot, put I am taking home more only working 3 days a week.  &lt;/p&gt;\n\n&lt;p&gt;After about 3 years,  he terminates my contract.&lt;/p&gt;\n\n&lt;p&gt;Okay.  My first phone call was to our next client who we did thousands per year.  Rue client, Angry Woman AW, hates DS and told me that as long as I was at the company, she&amp;#39;d stay with us.&lt;/p&gt;\n\n&lt;p&gt;I was gone.  In the course of leaving, I directed another client to another consulting company that did as good as a job as we did, at half the cost (it was the loss of this contract that got my contract terminated).  Loss = $60k a year.   AW changes consultants and fires DS.  Loss =$180 a year.&lt;/p&gt;\n\n&lt;p&gt;A week later, I am at another consulting company and a local law enforcement officer serves me papers that DS is going to sue me.  I call up his attorney and tell him to &amp;quot;bring it on&amp;quot;.  I would love for my attorney to get DS on the stand and we would ask him about his billing practices and the kickback.   A few minutes later, the attorney calls me back to tell me, &amp;quot;never do it again&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;In the end, DS lost clients and hundreds of thousands in income.  All because he wanted a kickback.  &lt;/p&gt;\n\n&lt;p&gt;tl/dr:  I suspect my boss extorted a kickback from the manufacturer for a remediation system sold to a client.  Spend the next years cutting billing to the client to save them money and cost the boss a few clients and contracts too.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've worked in environmental consulting in one form or another for several years.during my career, I had to take a job with a small, locally owned company run by Dr. Slime.  DS has a phd and required us to call him DS.  \n\nI had been there for several years and worked my way up to manager for the remediation group.  DS had one client that was big.  They had a chemical release that revealed a history of spills that impacted the groundwater.  Our company's job was to clean it up to state/federal standards in the most cost effective way possible.  The previous remediation manager had proposed a conventional \"pump and treat\" system.  A pump and treat system is usually deep groundwater pumps installed in groundwater recovery wells pumping impacted groundwater to the surface for treatment.  He proposed a rather inexpensive option that, in reality, wasn't going to work.  Regulators questioned the effectiveness of the proposed system, so DS paid a consultant to agree that our approach was sound.\n\nAs I stated above, the former manager was former and it was in my hands.  Rather than install a P&amp;T system that wouldn't work, I designed and recommended a more aggressive, and expensive remediation system.  \n\nThe cost difference jumped from $50k for the P&amp;T to about $150k for my design.  I showed via models that the advanced system would accomplish the goal of capturing the contaminated water and actually cleaning it up faster, and in the long term...less costs.\n\nThe client bought into it and we finalized the design of our system.  Various tweaks and adjustments were made.  We billed the client top dollar for this design.  I show the final package to DS.  He asks if I had sent this to the client.  I hadn't.   \n\nAnd I left his office.   \n\nWe spend the next months installing wells, the support for the system, start it up and are operating for a few months when I am in clients office giving him an update.\n\nHe says, you'd think for the money we spent, $175,000,  it would perform as good as it was.  \n\nI didn't say anything, because i wanted to investigate why his number was $25k more.  Note:  DS's practice was to sell the client services and mark up our costs by 10%.  Easy money for being a bank.  I had arranged for the client to pay the manufacturer directly, to save these markups.\n\nI reached out to the manufacturer about the increase in costs and was told not to ask.  \n\nMe?  I did the mental math and determined that DS arranged to get a $25k kickback on the system we designed.\n\nI should have reported him for fraud, but I didn't.  To many coworkers would have lost their jobs and the manufacturer would have been in trouble too.\n\nMy plan was to hit DS where it hurt most:  his billings.  I figured that if I could save the client $100k, it would make up for my estimated kickback.\n\nFor the previous years, we had to sample roughly 100 groundwater wells 4 times a year.  We would have 6 people working a week and billing the client for it.\n\nI used a new technology that allowed us to replace the labor from 240 manhours to 40 manhours (1 person on site doing the work of 6 people) 4 times a year (saving $25k per event).\n\nDS owned the lab that the client used.   I suggested that the client bid out the work to minimize the costs.  I included their sampling required for their permits.  \n\nI put together a request for bids and sent it to the client with a list of labs, including DS's lab.\n\nWhen he found out, he called me into his office.  He was more than upset, cussing me out telling me not to f-ck with his lab.  Anyway, the bids were in and it saved the client about $30k a year.\n\nDS didn't pay us overtime.  We were supposed to get get \"comp-time\" for over 45 hours, but it was a lie.  Of course, no matter how many hours I worked, I never billed the client for more than 38 hours a week (as 2 hours a week were dedicated to a weekly staff meeting and paperwork).\n\nSo far, the plan is working out well.  The client is recouping their cost.  DS is losing revenue.\n\nBut I am the one suffering.   So I came up with a plan to quit and force him to hire me back as a contractor at a pretty big hourly rate.  He bites, we sign a contract, and I am granted 24 hours a week.  Sure, I give up the manager spot, put I am taking home more only working 3 days a week.  \n\nAfter about 3 years,  he terminates my contract.\n\nOkay.  My first phone call was to our next client who we did thousands per year.  Rue client, Angry Woman AW, hates DS and told me that as long as I was at the company, she'd stay with us.\n\nI was gone.  In the course of leaving, I directed another client to another consulting company that did as good as a job as we did, at half the cost (it was the loss of this contract that got my contract terminated).  Loss = $60k a year.   AW changes consultants and fires DS.  Loss =$180 a year.\n\nA week later, I am at another consulting company and a local law enforcement officer serves me papers that DS is going to sue me.  I call up his attorney and tell him to \"bring it on\".  I would love for my attorney to get DS on the stand and we would ask him about his billing practices and the kickback.   A few minutes later, the attorney calls me back to tell me, \"never do it again\". \n\nIn the end, DS lost clients and hundreds of thousands in income.  All because he wanted a kickback.  \n\n\ntl/dr:  I suspect my boss extorted a kickback from the manufacturer for a remediation system sold to a client.  Spend the next years cutting billing to the client to save them money and cost the boss a few clients and contracts too.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65zuy2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "RobbyTheRedneck", "saved": false, "mod_reports": [], "name": "t3_65zuy2", "subreddit_name_prefixed": "r/ProRevenge", "approved_by": null, "over_18": false, "domain": "self.ProRevenge", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2vjvl", "edited": 1492480474.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": true, "spoiler": false, "permalink": "/r/ProRevenge/comments/65zuy2/that_kickback_is_gonna_cost_you/", "num_reports": null, "locked": false, "stickied": false, "created": 1492508045.0, "url": "https://www.reddit.com/r/ProRevenge/comments/65zuy2/that_kickback_is_gonna_cost_you/", "author_flair_text": null, "quarantine": false, "title": "That kickback is gonna cost you!", "created_utc": 1492479245.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]