[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "DoesAnybodyElse", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t always go out to shop, so when I have the chance, I should take advantage of it.&lt;/p&gt;\n\n&lt;p&gt;Like today, I was at the mall with my mom. She was suggesting stores to go into, and beforehand I was pretty happy, because I really don&amp;#39;t have many new clothes and I always see things I want to get. &lt;/p&gt;\n\n&lt;p&gt;But then, I dunno how to put it, I forced myself to act tired? My eyelids became heavy, although minutes before I was fine. As I looked at shops and clothes, there were so many things I wanted and would love to look through and I knew I could&amp;#39;ve done some serious damage...&lt;/p&gt;\n\n&lt;p&gt;but then I told her I didn&amp;#39;t want to go anywhere. I didn&amp;#39;t want to shop. I snapped and and basically contradicted everything I  said I wanted to do. Yet, I didn&amp;#39;t know what I was doing? &lt;/p&gt;\n\n&lt;p&gt;And so we left.&lt;/p&gt;\n\n&lt;p&gt;I regretted it. I always regret it. Every time I&amp;#39;m out to shop, I tell everyone, or I tell myself, I don&amp;#39;t want to. Then, I have a debate in my head whether or not to turn back around because I know there are things I want to get, and I never know why I force myself not to get them. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if this is an anxiety related thing or I&amp;#39;m just making things hard for myself..? I always walk past stores I want to go into, but I&amp;#39;m afraid to say I want to (even if it&amp;#39;s perfectly fine), and if I make it to a store, I&amp;#39;m too afraid to get what I want? Either way leads to me going home empty-handed and weighed down with unnecessary regret. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't always go out to shop, so when I have the chance, I should take advantage of it.\n\nLike today, I was at the mall with my mom. She was suggesting stores to go into, and beforehand I was pretty happy, because I really don't have many new clothes and I always see things I want to get. \n\nBut then, I dunno how to put it, I forced myself to act tired? My eyelids became heavy, although minutes before I was fine. As I looked at shops and clothes, there were so many things I wanted and would love to look through and I knew I could've done some serious damage...\n\nbut then I told her I didn't want to go anywhere. I didn't want to shop. I snapped and and basically contradicted everything I  said I wanted to do. Yet, I didn't know what I was doing? \n\nAnd so we left.\n\nI regretted it. I always regret it. Every time I'm out to shop, I tell everyone, or I tell myself, I don't want to. Then, I have a debate in my head whether or not to turn back around because I know there are things I want to get, and I never know why I force myself not to get them. \n\nI don't know if this is an anxiety related thing or I'm just making things hard for myself..? I always walk past stores I want to go into, but I'm afraid to say I want to (even if it's perfectly fine), and if I make it to a store, I'm too afraid to get what I want? Either way leads to me going home empty-handed and weighed down with unnecessary regret. \n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65xvjw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "yhctap", "saved": false, "mod_reports": [], "name": "t3_65xvjw", "subreddit_name_prefixed": "r/DoesAnybodyElse", "approved_by": null, "over_18": false, "domain": "self.DoesAnybodyElse", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r5vt", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/DoesAnybodyElse/comments/65xvjw/dae_get_in_the_mood_to_shop_but_when_at_the_mall/", "num_reports": null, "locked": false, "stickied": false, "created": 1492487276.0, "url": "https://www.reddit.com/r/DoesAnybodyElse/comments/65xvjw/dae_get_in_the_mood_to_shop_but_when_at_the_mall/", "author_flair_text": null, "quarantine": false, "title": "DAE get in the mood to shop, but when at the mall immediately refuses to go into any store or get anything?", "created_utc": 1492458476.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]