[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "HomeImprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently bought a house in Oregon that has a mixture of grounded outlets (in the newer additions) and ungrounded outlets (in the older sections). The ungrounded outlets are a mix of two-prong and three-prong.&lt;/p&gt;\n\n&lt;p&gt;I learned that one way to be up to code is to install three-prong ungrounded GFCI outlets with labels on them. But I am having trouble understanding if that is really good enough - aren&amp;#39;t grounded outlets still better somehow? For what reasons should I reject ungrounded GFCI and install a grounding wire instead? &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;I regularly work off my macbook laptop, preferably with the longer three-prong cord&lt;/li&gt;\n&lt;li&gt;I have other computer equipment in my office&lt;/li&gt;\n&lt;li&gt;I have audio equipment as well and do some light mixing and mastering (hobby level), and want to avoid &amp;quot;hum&amp;quot;&lt;/li&gt;\n&lt;li&gt;I have a UPS and also care about surge protection. Do surge protectors even do anything if they are plugged into a GFCI ungrounded outlet? &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I&amp;#39;m &lt;em&gt;thinking&lt;/em&gt; my plan should be to run a grounding wire to the rooms where I will install expensive equipment, and just install GFCI outlets where the other two-prong outlets are for lamps and stuff. But I&amp;#39;m less sure about what to do with the various outlets where I will periodically plug in my laptop near sofas and stuff. We also have a hobby area (sewing machines, arduino stuff), not sure if I should run a grounding wire there or if GFCI ungrounded is enough.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "\nI recently bought a house in Oregon that has a mixture of grounded outlets (in the newer additions) and ungrounded outlets (in the older sections). The ungrounded outlets are a mix of two-prong and three-prong.\n\nI learned that one way to be up to code is to install three-prong ungrounded GFCI outlets with labels on them. But I am having trouble understanding if that is really good enough - aren't grounded outlets still better somehow? For what reasons should I reject ungrounded GFCI and install a grounding wire instead? \n\n- I regularly work off my macbook laptop, preferably with the longer three-prong cord\n- I have other computer equipment in my office\n- I have audio equipment as well and do some light mixing and mastering (hobby level), and want to avoid \"hum\"\n- I have a UPS and also care about surge protection. Do surge protectors even do anything if they are plugged into a GFCI ungrounded outlet? \n\nI'm *thinking* my plan should be to run a grounding wire to the rooms where I will install expensive equipment, and just install GFCI outlets where the other two-prong outlets are for lamps and stuff. But I'm less sure about what to do with the various outlets where I will periodically plug in my laptop near sofas and stuff. We also have a hobby area (sewing machines, arduino stuff), not sure if I should run a grounding wire there or if GFCI ungrounded is enough.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65n8op", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "thunder-thumbs", "saved": false, "mod_reports": [], "name": "t3_65n8op", "subreddit_name_prefixed": "r/HomeImprovement", "approved_by": null, "over_18": false, "domain": "self.HomeImprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2ql97", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/HomeImprovement/comments/65n8op/ungrounded_outlets_gfci_surge_protectors/", "num_reports": null, "locked": false, "stickied": false, "created": 1492342759.0, "url": "https://www.reddit.com/r/HomeImprovement/comments/65n8op/ungrounded_outlets_gfci_surge_protectors/", "author_flair_text": null, "quarantine": false, "title": "Ungrounded outlets, gfci, surge protectors", "created_utc": 1492313959.0, "distinguished": null, "media": null, "upvote_ratio": 0.77, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": "", "user_reports": [], "id": "dgbuczb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "wellwasherelf", "parent_id": "t3_65n8op", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "I'm currently dealing with this exact same situation. It's a giant annoyance but here's what I've gathered in my research (disclaimer: I'm not an electrician or an expert. This is just my understanding of everything):\n\n&gt; But I am having trouble understanding if that is really good enough - aren't grounded outlets still better somehow? For what reasons should I reject ungrounded GFCI and install a grounding wire instead?\n\nGFCI is for your own protection. In a situation where current from the hot wire isn't being returned to the neutral, it assumes that it's flowing to whatever device is plugged into it and cuts power. Without a GFCI outlet, if there's a short in, say, your washer, you're going to get a massive shock if you touch the thing. They're required in kitchens and bathrooms because water presence is a good way to harm or kill yourself. They do also make GFCI breakers fwiw.\n\nA grounded receptacle is going to protect against surges such as lightning strikes. They do make whole house surge protectors that wire into your breaker, they're not expensive and might be looking into, in addition to grounded outlets. However, I believe I read somewhere that there exists such a thing as micro surges, which can be damaging to sensitive equipment and a whole house surge protector won't stop. I'm not an electrician, so someone who knows what they're talking about could better explain that.\n\n&gt;    I regularly work off my macbook laptop, preferably with the longer three-prong cord\n&gt;    I have other computer equipment in my office\n\nGROUND THESE.\n\n&gt;    I have audio equipment as well and do some light mixing and mastering (hobby level), and want to avoid \"hum\"\n\nThis could be slightly more complex. If you're getting hum, there's possibly a ground loop somewhere in your house. If there are multiple paths for the equipment to ground (e.g. if 2 different outlets have their grounds tied together) you're going to get interference/humming. I don't know enough to tell you the proper way to fix this in regards to changing the wiring. You can technically use a 3-&gt;2 prong adapter to eliminate the ground from your monitors, but please, please don't do that. Don't fuck up your equipment; do it right.\n\n&gt; But I'm less sure about what to do with the various outlets where I will periodically plug in my laptop near sofas and stuff. \n\nIf you're going to have any sensitive equipment plugged into it, take the safe route and ground it\n\n&gt; We also have a hobby area (sewing machines, arduino stuff), not sure if I should run a grounding wire there or if GFCI ungrounded is enough.\n\nIt might be worth looking into a whole house surge protector for stuff like this, since it's not dire but still something you'd rather not get potentially fried. I would still run a dedicated ground to your sensitive equipment on top of that, though.\n\nAlso, if your house has metal electrical boxes, it's worth checking with a multimeter if the boxes themselves are actually grounded. In some homes they are, so that would save you time and money.", "edited": 1492332347.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m currently dealing with this exact same situation. It&amp;#39;s a giant annoyance but here&amp;#39;s what I&amp;#39;ve gathered in my research (disclaimer: I&amp;#39;m not an electrician or an expert. This is just my understanding of everything):&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But I am having trouble understanding if that is really good enough - aren&amp;#39;t grounded outlets still better somehow? For what reasons should I reject ungrounded GFCI and install a grounding wire instead?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;GFCI is for your own protection. In a situation where current from the hot wire isn&amp;#39;t being returned to the neutral, it assumes that it&amp;#39;s flowing to whatever device is plugged into it and cuts power. Without a GFCI outlet, if there&amp;#39;s a short in, say, your washer, you&amp;#39;re going to get a massive shock if you touch the thing. They&amp;#39;re required in kitchens and bathrooms because water presence is a good way to harm or kill yourself. They do also make GFCI breakers fwiw.&lt;/p&gt;\n\n&lt;p&gt;A grounded receptacle is going to protect against surges such as lightning strikes. They do make whole house surge protectors that wire into your breaker, they&amp;#39;re not expensive and might be looking into, in addition to grounded outlets. However, I believe I read somewhere that there exists such a thing as micro surges, which can be damaging to sensitive equipment and a whole house surge protector won&amp;#39;t stop. I&amp;#39;m not an electrician, so someone who knows what they&amp;#39;re talking about could better explain that.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I regularly work off my macbook laptop, preferably with the longer three-prong cord\n   I have other computer equipment in my office&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;GROUND THESE.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I have audio equipment as well and do some light mixing and mastering (hobby level), and want to avoid &amp;quot;hum&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This could be slightly more complex. If you&amp;#39;re getting hum, there&amp;#39;s possibly a ground loop somewhere in your house. If there are multiple paths for the equipment to ground (e.g. if 2 different outlets have their grounds tied together) you&amp;#39;re going to get interference/humming. I don&amp;#39;t know enough to tell you the proper way to fix this in regards to changing the wiring. You can technically use a 3-&amp;gt;2 prong adapter to eliminate the ground from your monitors, but please, please don&amp;#39;t do that. Don&amp;#39;t fuck up your equipment; do it right.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But I&amp;#39;m less sure about what to do with the various outlets where I will periodically plug in my laptop near sofas and stuff. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you&amp;#39;re going to have any sensitive equipment plugged into it, take the safe route and ground it&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We also have a hobby area (sewing machines, arduino stuff), not sure if I should run a grounding wire there or if GFCI ungrounded is enough.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It might be worth looking into a whole house surge protector for stuff like this, since it&amp;#39;s not dire but still something you&amp;#39;d rather not get potentially fried. I would still run a dedicated ground to your sensitive equipment on top of that, though.&lt;/p&gt;\n\n&lt;p&gt;Also, if your house has metal electrical boxes, it&amp;#39;s worth checking with a multimeter if the boxes themselves are actually grounded. In some homes they are, so that would save you time and money.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgbuczb", "score_hidden": false, "stickied": false, "created": 1492359169.0, "created_utc": 1492330369.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": "", "user_reports": [], "id": "dgbyn84", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WillOTheWispish", "parent_id": "t3_65n8op", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "We had this problem on the upper floor of our house and my father in law (who actually is an electrical engineer) said that we did not need to put GFCI in everywhere, but that is was the safest and cheapest way to bring it up to code (and beyond) and would be safest with our modern electronics and any potential little ones because we put in tamper resistant products. Sorry for the run on sentence, but $300 for above code peace of mind vs $30 and being told every week we should have put in something else was worth it. And I am good at changing electrical outlets and light switches - priceless! \n\nTo the comment about downstream GFCIs - the downstream outlets should be protected by the upstream GFIC, but my house was wired by someone whose decisions did not make sense, so we did not know where all the circuits ran. It was not always done in a logical manner. Therefore, my father in law recommended that all outlets should have GFCIs. We have not had problems with these being downstream on the circuit, so I cannot comment on that potential. Just remember to use the little stickers regarding what the outlet lacks. \n\nEdit - helping my spelling and adding bit about downstream GFICs. ", "edited": 1492345009.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We had this problem on the upper floor of our house and my father in law (who actually is an electrical engineer) said that we did not need to put GFCI in everywhere, but that is was the safest and cheapest way to bring it up to code (and beyond) and would be safest with our modern electronics and any potential little ones because we put in tamper resistant products. Sorry for the run on sentence, but $300 for above code peace of mind vs $30 and being told every week we should have put in something else was worth it. And I am good at changing electrical outlets and light switches - priceless! &lt;/p&gt;\n\n&lt;p&gt;To the comment about downstream GFCIs - the downstream outlets should be protected by the upstream GFIC, but my house was wired by someone whose decisions did not make sense, so we did not know where all the circuits ran. It was not always done in a logical manner. Therefore, my father in law recommended that all outlets should have GFCIs. We have not had problems with these being downstream on the circuit, so I cannot comment on that potential. Just remember to use the little stickers regarding what the outlet lacks. &lt;/p&gt;\n\n&lt;p&gt;Edit - helping my spelling and adding bit about downstream GFICs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgbyn84", "score_hidden": false, "stickied": false, "created": 1492373104.0, "created_utc": 1492344304.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": "", "user_reports": [], "id": "dge716r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thunder-thumbs", "parent_id": "t1_dgdj1un", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Thanks westom! Do you have any additional opinions on GFCI-ungrounded outlets vs grounded outlets, and which I should choose? Main guideline I've heard so far is that if the equipment hooks into anything external, it should be a grounded outlet. Anything else? I'm not sure what other reasons one should consider a grounded outlet over a GFCI-ungrounded outlet.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks westom! Do you have any additional opinions on GFCI-ungrounded outlets vs grounded outlets, and which I should choose? Main guideline I&amp;#39;ve heard so far is that if the equipment hooks into anything external, it should be a grounded outlet. Anything else? I&amp;#39;m not sure what other reasons one should consider a grounded outlet over a GFCI-ungrounded outlet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dge716r", "score_hidden": false, "stickied": false, "created": 1492495133.0, "created_utc": 1492466333.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdj1un", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "westom", "parent_id": "t1_dgd6dbq", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Protection of appliances and protection of humans are separate issues.  National Electrical Code and UL are about protecting humans.  That safety (equipment) ground prong or a GFCI is about protecting humans.\n\nAppliances do not fail if that ground does or does not exist.  Protecting appliances means a transient must not be anywhere inside.  Otherwise a transient will hunt for earth destructively via appliances.  Earthing a transient before it can enter is irrelevant to protecting humans and is essential for protecting appliances.\n\nA third item - structure- also needs protection.  So properly earthed lightning rods are installed.  Another example of completely different items to protect something completely different.\n\nAppliance will work just fine even if not grounded.  Appliance is unharmed if a ground does not exist. Existence of that ground or no ground does not affect its operation or appliance reliability (protection). That ground (GFCI, double insulated, polarity, and other techniques) protect humans.\n\nAn appliance will not be damaged or fail if a receptacles safety ground does or does not exist.  But human life is at risk if that safety ground (and other listed human safety techniques) do not exist.\n\nWhat must your electrician know (many do not)?  What makes that 'whole house' protector effective?  Single point earth ground.  Every incoming wire (TV cable, satellite dish, telephone, invisible dog fence) must enter at a common location to make a 'low impedance' (ie less than 10 foot) connection to a same earth ground.\n\nMinimal protector is 50,000 amps since it must even earth direct lightning strikes (ie 20,000 amps) and remain functional.\n\nThat ground hardwire from breaker box (and protector) to earth must be low impedance (ie no sharp bends).  If a bare copper quarter inch hardwire goes up over a foundation and down to earth, then it meets code.  And compromises protection.  It is too long, has sharp bends over a foundation, and is not separated from other non-grounding wires.  Routing a hardwire through a foundation and down to single point earth ground increases protection.\n\nA protector is only as effective as its earth ground.  How that hardwire routes and connects to earth ground defines quality of protection.  Again, some electricians only trained in code, would not know this.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Protection of appliances and protection of humans are separate issues.  National Electrical Code and UL are about protecting humans.  That safety (equipment) ground prong or a GFCI is about protecting humans.&lt;/p&gt;\n\n&lt;p&gt;Appliances do not fail if that ground does or does not exist.  Protecting appliances means a transient must not be anywhere inside.  Otherwise a transient will hunt for earth destructively via appliances.  Earthing a transient before it can enter is irrelevant to protecting humans and is essential for protecting appliances.&lt;/p&gt;\n\n&lt;p&gt;A third item - structure- also needs protection.  So properly earthed lightning rods are installed.  Another example of completely different items to protect something completely different.&lt;/p&gt;\n\n&lt;p&gt;Appliance will work just fine even if not grounded.  Appliance is unharmed if a ground does not exist. Existence of that ground or no ground does not affect its operation or appliance reliability (protection). That ground (GFCI, double insulated, polarity, and other techniques) protect humans.&lt;/p&gt;\n\n&lt;p&gt;An appliance will not be damaged or fail if a receptacles safety ground does or does not exist.  But human life is at risk if that safety ground (and other listed human safety techniques) do not exist.&lt;/p&gt;\n\n&lt;p&gt;What must your electrician know (many do not)?  What makes that &amp;#39;whole house&amp;#39; protector effective?  Single point earth ground.  Every incoming wire (TV cable, satellite dish, telephone, invisible dog fence) must enter at a common location to make a &amp;#39;low impedance&amp;#39; (ie less than 10 foot) connection to a same earth ground.&lt;/p&gt;\n\n&lt;p&gt;Minimal protector is 50,000 amps since it must even earth direct lightning strikes (ie 20,000 amps) and remain functional.&lt;/p&gt;\n\n&lt;p&gt;That ground hardwire from breaker box (and protector) to earth must be low impedance (ie no sharp bends).  If a bare copper quarter inch hardwire goes up over a foundation and down to earth, then it meets code.  And compromises protection.  It is too long, has sharp bends over a foundation, and is not separated from other non-grounding wires.  Routing a hardwire through a foundation and down to single point earth ground increases protection.&lt;/p&gt;\n\n&lt;p&gt;A protector is only as effective as its earth ground.  How that hardwire routes and connects to earth ground defines quality of protection.  Again, some electricians only trained in code, would not know this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgdj1un", "score_hidden": false, "stickied": false, "created": 1492467449.0, "created_utc": 1492438649.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd6dbq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thunder-thumbs", "parent_id": "t1_dgcmauw", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Thanks for the clarification, westom. Sounds like whole-house protection is key, I will get a quote from my electrician for that.\n\nI'm still stuck on one thing, though - if I have whole-house protection, I'm still not sure what advantage a grounded outlet (safety ground) gives me over an ungrounded GFCI receptacle.\n\nYou also earlier said, \"Appliances (even expensive electronics) are not at any risk without a safety ground.\" Can you clarify? That makes it sound like appliances are safe (not at risk) if the outlet is ungrounded. So if I install a grounded outlet, I've put my equipment at greater risk?\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the clarification, westom. Sounds like whole-house protection is key, I will get a quote from my electrician for that.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m still stuck on one thing, though - if I have whole-house protection, I&amp;#39;m still not sure what advantage a grounded outlet (safety ground) gives me over an ungrounded GFCI receptacle.&lt;/p&gt;\n\n&lt;p&gt;You also earlier said, &amp;quot;Appliances (even expensive electronics) are not at any risk without a safety ground.&amp;quot; Can you clarify? That makes it sound like appliances are safe (not at risk) if the outlet is ungrounded. So if I install a grounded outlet, I&amp;#39;ve put my equipment at greater risk?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd6dbq", "score_hidden": false, "stickied": false, "created": 1492436895.0, "created_utc": 1492408095.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcmauw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "westom", "parent_id": "t1_dgcc0lf", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Safety ground is a wire from each receptacle's third prong to a ground bus inside a breaker box.  It is not earth ground.  And earth ground is not safety (equipment) ground.\n\nSafety ground conducts well over 15 amps (15,000 milliamps) so that a circuit breaker trips.  For protecting humans - not appliances.\n\nGFCI is an electronics device that measures both incoming and outgoing currents.  If a 5 milliamp difference exists in maybe 15,000 milliamps, then electronics cut off all power.  Again, to protect humans.\n\nSafety ground, GFCI, double insulated, polarity, etc are all different and protect human life.\n\nEarth ground is electrically different from safety ground, digital ground, chassis ground, motherboard ground, floating grounds, and ground beneath shoes.  Many are interconnected - and are electrically different.\n\nBreaker box ground must connect to earth ground.  Receptacles must not connect to earth ground.\n\nAn effective protector is mounted in a breaker box, on a meter pan, or behind the electric meter ... to make a low impedance (ie less than 10 foot) connection to earth ground.\n\nSafety ground (ie to plug-in protectors) does not make a plug-in protector effective. Impedance and other factors say why.  Plug-in protector must connect to wall receptacle safety ground ... to protect human life.  Plug-in manufacturers forget to say why that safety ground must exist and to meet UL requirements - that define human protection; not appliances protection.\n\nProtectors do nothing for 'too much power' to an appliance.  Protectors are for potentially destructive transients - maybe once every seven years.  Electronics protect themselves from 'too much power' - one function of a PSU.\n\nSome numbers.  A properly earthed protector does maybe 99.5% to 99.9% of the protection.  Then a plug-in protector might do another 0.2%.  Plug-in protector is not useless.  But can make appliance damage easier, fail on a tiniest surge, or even create a fire if a properly earthed 'whole house' solution does not exist.\n\nEverything has a number.  Some things are better than others. A 'whole house' solution costs about $1 per protected appliance.  How much for a plug-in solution? \n\nLightning can be 20,000 amps.  So a minimal 'whole house' protector is 50,000 amps.  Honest recommendations discuss these numbers.  Some items are superior to others - once a number is included.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Safety ground is a wire from each receptacle&amp;#39;s third prong to a ground bus inside a breaker box.  It is not earth ground.  And earth ground is not safety (equipment) ground.&lt;/p&gt;\n\n&lt;p&gt;Safety ground conducts well over 15 amps (15,000 milliamps) so that a circuit breaker trips.  For protecting humans - not appliances.&lt;/p&gt;\n\n&lt;p&gt;GFCI is an electronics device that measures both incoming and outgoing currents.  If a 5 milliamp difference exists in maybe 15,000 milliamps, then electronics cut off all power.  Again, to protect humans.&lt;/p&gt;\n\n&lt;p&gt;Safety ground, GFCI, double insulated, polarity, etc are all different and protect human life.&lt;/p&gt;\n\n&lt;p&gt;Earth ground is electrically different from safety ground, digital ground, chassis ground, motherboard ground, floating grounds, and ground beneath shoes.  Many are interconnected - and are electrically different.&lt;/p&gt;\n\n&lt;p&gt;Breaker box ground must connect to earth ground.  Receptacles must not connect to earth ground.&lt;/p&gt;\n\n&lt;p&gt;An effective protector is mounted in a breaker box, on a meter pan, or behind the electric meter ... to make a low impedance (ie less than 10 foot) connection to earth ground.&lt;/p&gt;\n\n&lt;p&gt;Safety ground (ie to plug-in protectors) does not make a plug-in protector effective. Impedance and other factors say why.  Plug-in protector must connect to wall receptacle safety ground ... to protect human life.  Plug-in manufacturers forget to say why that safety ground must exist and to meet UL requirements - that define human protection; not appliances protection.&lt;/p&gt;\n\n&lt;p&gt;Protectors do nothing for &amp;#39;too much power&amp;#39; to an appliance.  Protectors are for potentially destructive transients - maybe once every seven years.  Electronics protect themselves from &amp;#39;too much power&amp;#39; - one function of a PSU.&lt;/p&gt;\n\n&lt;p&gt;Some numbers.  A properly earthed protector does maybe 99.5% to 99.9% of the protection.  Then a plug-in protector might do another 0.2%.  Plug-in protector is not useless.  But can make appliance damage easier, fail on a tiniest surge, or even create a fire if a properly earthed &amp;#39;whole house&amp;#39; solution does not exist.&lt;/p&gt;\n\n&lt;p&gt;Everything has a number.  Some things are better than others. A &amp;#39;whole house&amp;#39; solution costs about $1 per protected appliance.  How much for a plug-in solution? &lt;/p&gt;\n\n&lt;p&gt;Lightning can be 20,000 amps.  So a minimal &amp;#39;whole house&amp;#39; protector is 50,000 amps.  Honest recommendations discuss these numbers.  Some items are superior to others - once a number is included.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcmauw", "score_hidden": false, "stickied": false, "created": 1492407611.0, "created_utc": 1492378811.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcc0lf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thunder-thumbs", "parent_id": "t1_dgc7ftw", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Just to clarify, do you mean that \"safety ground\" and GFCI are two terms for the same thing? Or are they two different things?\n\nThat's really interesting, it sounds like plugging a surge protector into a GFCI ungrounded outlet wouldn't give the equipment/appliances any extra protection at all.\n", "edited": 1492365641.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just to clarify, do you mean that &amp;quot;safety ground&amp;quot; and GFCI are two terms for the same thing? Or are they two different things?&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s really interesting, it sounds like plugging a surge protector into a GFCI ungrounded outlet wouldn&amp;#39;t give the equipment/appliances any extra protection at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcc0lf", "score_hidden": false, "stickied": false, "created": 1492394095.0, "created_utc": 1492365295.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": "", "user_reports": [], "id": "dgcdx2y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thunder-thumbs", "parent_id": "t1_dgc7ftw", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Also, don't most modern electrical wires (with grounding wires inside) go from outlet to electrical panel without connecting to earth ground in between? Most house outlets are more than 10' away from the panel. Wouldn't that mean that most plug-in surge protectors are essentially useless?\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, don&amp;#39;t most modern electrical wires (with grounding wires inside) go from outlet to electrical panel without connecting to earth ground in between? Most house outlets are more than 10&amp;#39; away from the panel. Wouldn&amp;#39;t that mean that most plug-in surge protectors are essentially useless?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcdx2y", "score_hidden": false, "stickied": false, "created": 1492396647.0, "created_utc": 1492367847.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7ftw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "westom", "parent_id": "t3_65n8op", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "&gt; I'm thinking my plan should be to run a grounding wire to the rooms where I will install expensive equipment, and just install GFCI outlets where the other two-prong outlets are for lamps and stuff. \n\nFirst define what each does. Safety ground in a receptacle only protects humans.  Appliances (even expensive electronics) are not at any risk without a safety ground.  Humans are at risk if a safety ground or GFCI does not exist.\n\nIgnore any recommendation that assumes safety grounds make a protector effective.  The myth is encouraged by half truths in  protector advertising.  That protector ground light is only reporting on a ground missing ... for human safety.  It cannot report that ground as good; can only report some defects.\n\nProtectors that are effective connect low impedance (ie less than 10 feet) to earth ground.  Earth ground is not safety ground.  And (obvious from numbers) a wall receptacle safety ground has excessive impedance.  Low resistance; excessive impedance.\n\nNo plug-in protector has that low impedance (ie less than 10 foot) connection.  UPS claims even less protection.  Read specification numbers.  Ignore any recommendation not tempered by numbers.\n\nGFCI or safety ground protects humans.  A 'whole house' protector (if properly connected to single point earth ground) protects appliances - including dishwasher, dimmer switches, refrigerator, CFL and LED bulbs, expensive computers, bathroom and kitchen GFCIs, TVs, clocks, and the item that most needs protection during a surge - smoke detectors.\n\nTwo completely different and unrelated items to avert two completely different threats.  Next ask about relevant numbers.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m thinking my plan should be to run a grounding wire to the rooms where I will install expensive equipment, and just install GFCI outlets where the other two-prong outlets are for lamps and stuff. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;First define what each does. Safety ground in a receptacle only protects humans.  Appliances (even expensive electronics) are not at any risk without a safety ground.  Humans are at risk if a safety ground or GFCI does not exist.&lt;/p&gt;\n\n&lt;p&gt;Ignore any recommendation that assumes safety grounds make a protector effective.  The myth is encouraged by half truths in  protector advertising.  That protector ground light is only reporting on a ground missing ... for human safety.  It cannot report that ground as good; can only report some defects.&lt;/p&gt;\n\n&lt;p&gt;Protectors that are effective connect low impedance (ie less than 10 feet) to earth ground.  Earth ground is not safety ground.  And (obvious from numbers) a wall receptacle safety ground has excessive impedance.  Low resistance; excessive impedance.&lt;/p&gt;\n\n&lt;p&gt;No plug-in protector has that low impedance (ie less than 10 foot) connection.  UPS claims even less protection.  Read specification numbers.  Ignore any recommendation not tempered by numbers.&lt;/p&gt;\n\n&lt;p&gt;GFCI or safety ground protects humans.  A &amp;#39;whole house&amp;#39; protector (if properly connected to single point earth ground) protects appliances - including dishwasher, dimmer switches, refrigerator, CFL and LED bulbs, expensive computers, bathroom and kitchen GFCIs, TVs, clocks, and the item that most needs protection during a surge - smoke detectors.&lt;/p&gt;\n\n&lt;p&gt;Two completely different and unrelated items to avert two completely different threats.  Next ask about relevant numbers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgc7ftw", "score_hidden": false, "stickied": false, "created": 1492388092.0, "created_utc": 1492359292.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": "", "user_reports": [], "id": "dgc9gom", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vesperholly", "parent_id": "t3_65n8op", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "My house has ungrounded outlets. It freaked me out a lot at first so I had several electricians come out to give me estimates and suggestions on what to do. All three guys said not to worry too much about ungrounded outlets - a lamp isn't much draw and plus with LED bulbs it's even less nowadays.\n\nIn the end, I had GFCI breakers installed and a whole-house surge protector. Apparently some of the breakers were already grounded so I only needed 3. Cost about $300 or so.\n\nGrounded outlets are best, but the reason there are alternatives like GFCI is that it can be prohibitively expensive to upgrade from ungrounded. If you have an unfinished basement and a one-story house, I'd get some quotes because it might be not too crazy costly to rewire the old portions - wouldn't involve cutting holes in your walls to run wire up to a second floor. I've also read that simply running a ground wire isn't ideal and completely new wire with the ground inside should be run, so ask about both options.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My house has ungrounded outlets. It freaked me out a lot at first so I had several electricians come out to give me estimates and suggestions on what to do. All three guys said not to worry too much about ungrounded outlets - a lamp isn&amp;#39;t much draw and plus with LED bulbs it&amp;#39;s even less nowadays.&lt;/p&gt;\n\n&lt;p&gt;In the end, I had GFCI breakers installed and a whole-house surge protector. Apparently some of the breakers were already grounded so I only needed 3. Cost about $300 or so.&lt;/p&gt;\n\n&lt;p&gt;Grounded outlets are best, but the reason there are alternatives like GFCI is that it can be prohibitively expensive to upgrade from ungrounded. If you have an unfinished basement and a one-story house, I&amp;#39;d get some quotes because it might be not too crazy costly to rewire the old portions - wouldn&amp;#39;t involve cutting holes in your walls to run wire up to a second floor. I&amp;#39;ve also read that simply running a ground wire isn&amp;#39;t ideal and completely new wire with the ground inside should be run, so ask about both options.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgc9gom", "score_hidden": false, "stickied": false, "created": 1492390738.0, "created_utc": 1492361938.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": "", "user_reports": [], "id": "dgcp3qd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tasker_morris", "parent_id": "t3_65n8op", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "i'd read through the FAQs on /r/electricians first. here's one on [two prong outlets](https://www.reddit.com/r/electricians/comments/26no2f/faq_twoprong_outlets/), and here's on on [GFIs](https://www.reddit.com/r/electricians/comments/29bg5j/how_does_a_ground_fault_circuit_interrupter/). \n\ni've been dealing with this myself and i'll save you the trouble with two main points. the GFI won't really help protect your appliances or equipment. it's basically a way to get the house up to code. running a single ground wire will be a pain, and at that point you should just consider specifically which outlets you want to rewire. if it's a room with lots of computer, audio equipment, and electronics, then it'd be wise to do that room in its entirety. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i&amp;#39;d read through the FAQs on &lt;a href=\"/r/electricians\"&gt;/r/electricians&lt;/a&gt; first. here&amp;#39;s one on &lt;a href=\"https://www.reddit.com/r/electricians/comments/26no2f/faq_twoprong_outlets/\"&gt;two prong outlets&lt;/a&gt;, and here&amp;#39;s on on &lt;a href=\"https://www.reddit.com/r/electricians/comments/29bg5j/how_does_a_ground_fault_circuit_interrupter/\"&gt;GFIs&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;i&amp;#39;ve been dealing with this myself and i&amp;#39;ll save you the trouble with two main points. the GFI won&amp;#39;t really help protect your appliances or equipment. it&amp;#39;s basically a way to get the house up to code. running a single ground wire will be a pain, and at that point you should just consider specifically which outlets you want to rewire. if it&amp;#39;s a room with lots of computer, audio equipment, and electronics, then it&amp;#39;d be wise to do that room in its entirety. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcp3qd", "score_hidden": false, "stickied": false, "created": 1492411372.0, "created_utc": 1492382572.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": "", "user_reports": [], "id": "dgc6acx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spectrum-Art", "parent_id": "t1_dgc60bv", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "My mistake, that's what I had been taught. Thanks for the heads up!\n\nEdit: I've fixed my post to reflect the correction. Hopefully I've provided some useful info :)", "edited": 1492358399.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My mistake, that&amp;#39;s what I had been taught. Thanks for the heads up!&lt;/p&gt;\n\n&lt;p&gt;Edit: I&amp;#39;ve fixed my post to reflect the correction. Hopefully I&amp;#39;ve provided some useful info :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgc6acx", "score_hidden": false, "stickied": false, "created": 1492386535.0, "created_utc": 1492357735.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": "", "user_reports": [], "id": "dgd6h11", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thunder-thumbs", "parent_id": "t1_dgcdni0", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "I don't have a problem with rewiring parts of my home, but how is that actually better than GFCI outlets? It sounds like both options are good for human safety, neither is better for equipment safety. What is actually better about grounded outlets than GFCI ungrounded outlets?\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have a problem with rewiring parts of my home, but how is that actually better than GFCI outlets? It sounds like both options are good for human safety, neither is better for equipment safety. What is actually better about grounded outlets than GFCI ungrounded outlets?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd6h11", "score_hidden": false, "stickied": false, "created": 1492437103.0, "created_utc": 1492408303.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65n8op", "likes": null, "replies": "", "user_reports": [], "id": "dgcmper", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "westom", "parent_id": "t1_dgcdni0", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "&gt; A plug in surge protector requires a grounded outlet yes or else they guarantee nothing.\n\nRead fine print in their warranty.  They do not guarantee what hyped and big print claims.  Plug-in protectors provide same appliance protection with or without a safety ground.  That safety ground must exist to protect humans - not appliances.\n\nPlug-in protectors do nothing to prevent shocks.  But it must have a 15 amp circuit breaker to prevent overloads.  That breaker also does nothing for surge protection.  Overload and surges are two completely different anomalies.\n\nIf isolation transformers are effective, well, electronics already have that protection. Galvanic isolation exists,  is routine, and required by safety codes.  Anything an isolation transformer might do must already be inside every computer.\n\nAppliances already contain robust protection - including galvanic isolation.  Concern is for a transient that can overwhelm already existing protection in every appliance - from dishwasher to clock.  A 'whole house' protector (properly earthed) is critical.  So that robust protection already inside every appliance is not overwhelmed.\n", "edited": 1492382249.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;A plug in surge protector requires a grounded outlet yes or else they guarantee nothing.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Read fine print in their warranty.  They do not guarantee what hyped and big print claims.  Plug-in protectors provide same appliance protection with or without a safety ground.  That safety ground must exist to protect humans - not appliances.&lt;/p&gt;\n\n&lt;p&gt;Plug-in protectors do nothing to prevent shocks.  But it must have a 15 amp circuit breaker to prevent overloads.  That breaker also does nothing for surge protection.  Overload and surges are two completely different anomalies.&lt;/p&gt;\n\n&lt;p&gt;If isolation transformers are effective, well, electronics already have that protection. Galvanic isolation exists,  is routine, and required by safety codes.  Anything an isolation transformer might do must already be inside every computer.&lt;/p&gt;\n\n&lt;p&gt;Appliances already contain robust protection - including galvanic isolation.  Concern is for a transient that can overwhelm already existing protection in every appliance - from dishwasher to clock.  A &amp;#39;whole house&amp;#39; protector (properly earthed) is critical.  So that robust protection already inside every appliance is not overwhelmed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcmper", "score_hidden": false, "stickied": false, "created": 1492408147.0, "created_utc": 1492379347.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdni0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Imaelectrician", "parent_id": "t1_dgcc9mx", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "A plug in surge protector requires a grounded outlet yes or else they guarantee nothing.  A whole house surge protector and GFI outlets would be the way to go if you don't want to rewire your home. They provide an extra level of safety so you don't get shocked and you still have surge protection to protect your valuables. Another option is to purchase appropriately sized isolation transformers and plug anythibg valuable you have into them to protect against surges.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A plug in surge protector requires a grounded outlet yes or else they guarantee nothing.  A whole house surge protector and GFI outlets would be the way to go if you don&amp;#39;t want to rewire your home. They provide an extra level of safety so you don&amp;#39;t get shocked and you still have surge protection to protect your valuables. Another option is to purchase appropriately sized isolation transformers and plug anythibg valuable you have into them to protect against surges.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcdni0", "score_hidden": false, "stickied": false, "created": 1492396277.0, "created_utc": 1492367477.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcc9mx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thunder-thumbs", "parent_id": "t1_dgc60bv", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Here's what I'm still confused on then. The surge protectors I've seen require a three-prong outlet, so that implies it should either plug into a grounded outlet, or a GFCI ungrounded outlet. And since I gather (from other replies in this thread) that surge protectors won't do anything useful when plugged into a GFCI ungrounded outlet, then doesn't that imply that a surge protector needs a fully grounded outlet in order to be effective?\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s what I&amp;#39;m still confused on then. The surge protectors I&amp;#39;ve seen require a three-prong outlet, so that implies it should either plug into a grounded outlet, or a GFCI ungrounded outlet. And since I gather (from other replies in this thread) that surge protectors won&amp;#39;t do anything useful when plugged into a GFCI ungrounded outlet, then doesn&amp;#39;t that imply that a surge protector needs a fully grounded outlet in order to be effective?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcc9mx", "score_hidden": false, "stickied": false, "created": 1492394426.0, "created_utc": 1492365626.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc60bv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Imaelectrician", "parent_id": "t1_dgbtojq", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "This isn't correct. A ground doesn't make a breaker trip if to much current is drawn. That's just what a breaker does, it's a breakers sole purpose. A ground is there so that if something fails it provides a low impedance path for the electricity to return, resulting in a high amp draw that should trip the breaker, but has nothing to do at all with the  breaker tripping under normal overloads. If you don't have a ground wire and you overload a breaker it will still trip. It's purely there for your safety and to prevent shocks. Nothing to do with overloads. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t correct. A ground doesn&amp;#39;t make a breaker trip if to much current is drawn. That&amp;#39;s just what a breaker does, it&amp;#39;s a breakers sole purpose. A ground is there so that if something fails it provides a low impedance path for the electricity to return, resulting in a high amp draw that should trip the breaker, but has nothing to do at all with the  breaker tripping under normal overloads. If you don&amp;#39;t have a ground wire and you overload a breaker it will still trip. It&amp;#39;s purely there for your safety and to prevent shocks. Nothing to do with overloads. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgc60bv", "score_hidden": false, "stickied": false, "created": 1492386153.0, "created_utc": 1492357353.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbtojq", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Spectrum-Art", "parent_id": "t3_65n8op", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Hello, neighbor! I do contract work in the Seattle area. Big wall of text coming up, apologies in advance.\nThe easiest way to think of it is this:\n\nGFCI's protect against electric shock, (by cutting power to the outlet when there's a fault in the circuit or device,)\n\nEDIT: Grounding wires protect against shock, (by providing a low impedance path for electricity to return in the case of a failure,) and\n\nSurge protectors protect against too much power going into the devices, (by sending the excess back down the neutral wire, aka the white wire, not the ground).\n\nIf it's an old, ungrounded circuit, you can put in ungrounded, non-gfci outlets, or gfci's, as long as they're labeled with what they're missing (ground/gfci). Any new circuits you run have to have a ground. Outlets in certain areas, (outdoor, kitchen, bath, basement) must have a gfci. Other than that, use the guidelines above to determine what protections you want to put on each outlet.\n\nIf you'll have sensitive/expensive equipment plugged in, use a surge protector. It will work without a ground.\n\nIf it's in one of the aforementioned areas of the house, or may come into contact with water, install a gfci. When in doubt, install a gfci. They are similar in function to the ground wire, but about 1000x more sensitive.\n\nIf you are going to need a lot of power, it might be a good idea to look into re-running the circuit with an equipment ground.\n\nTo be clear, this is my personal opinion. I am not licensed as an electrician, so don't take my advice as gospel. For anything you are unsure of, call a professional.\n\nEDIT: For Arduino, go with at least a surge protector. I've seen those little guys fry pretty easily.\n\nAlso, don't run multiple GFCI's in sequence. They don't play well. Any outlet 'downstream' of a GFCI will be similarly protected by it.", "edited": 1492358231.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello, neighbor! I do contract work in the Seattle area. Big wall of text coming up, apologies in advance.\nThe easiest way to think of it is this:&lt;/p&gt;\n\n&lt;p&gt;GFCI&amp;#39;s protect against electric shock, (by cutting power to the outlet when there&amp;#39;s a fault in the circuit or device,)&lt;/p&gt;\n\n&lt;p&gt;EDIT: Grounding wires protect against shock, (by providing a low impedance path for electricity to return in the case of a failure,) and&lt;/p&gt;\n\n&lt;p&gt;Surge protectors protect against too much power going into the devices, (by sending the excess back down the neutral wire, aka the white wire, not the ground).&lt;/p&gt;\n\n&lt;p&gt;If it&amp;#39;s an old, ungrounded circuit, you can put in ungrounded, non-gfci outlets, or gfci&amp;#39;s, as long as they&amp;#39;re labeled with what they&amp;#39;re missing (ground/gfci). Any new circuits you run have to have a ground. Outlets in certain areas, (outdoor, kitchen, bath, basement) must have a gfci. Other than that, use the guidelines above to determine what protections you want to put on each outlet.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;ll have sensitive/expensive equipment plugged in, use a surge protector. It will work without a ground.&lt;/p&gt;\n\n&lt;p&gt;If it&amp;#39;s in one of the aforementioned areas of the house, or may come into contact with water, install a gfci. When in doubt, install a gfci. They are similar in function to the ground wire, but about 1000x more sensitive.&lt;/p&gt;\n\n&lt;p&gt;If you are going to need a lot of power, it might be a good idea to look into re-running the circuit with an equipment ground.&lt;/p&gt;\n\n&lt;p&gt;To be clear, this is my personal opinion. I am not licensed as an electrician, so don&amp;#39;t take my advice as gospel. For anything you are unsure of, call a professional.&lt;/p&gt;\n\n&lt;p&gt;EDIT: For Arduino, go with at least a surge protector. I&amp;#39;ve seen those little guys fry pretty easily.&lt;/p&gt;\n\n&lt;p&gt;Also, don&amp;#39;t run multiple GFCI&amp;#39;s in sequence. They don&amp;#39;t play well. Any outlet &amp;#39;downstream&amp;#39; of a GFCI will be similarly protected by it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgbtojq", "score_hidden": false, "stickied": false, "created": 1492357128.0, "created_utc": 1492328328.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]