[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "HomeImprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey &lt;a href=\"/r/HomeImprovement\"&gt;/r/HomeImprovement&lt;/a&gt;,&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Personal TL;DR starts here:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I&amp;#39;m recently 27, I&amp;#39;ve spent the majority of my life in small-town Louisiana and I&amp;#39;m very, very tired of it. My professional skillset is in IT, but the majority of my work experience is random part-time food service and retail, a small unhappy stretch doing in-home installations for AT&amp;amp;T, and years of being my father&amp;#39;s small business&amp;#39; &amp;quot;computer guy.&amp;quot; I&amp;#39;ve got dated A+, Network+ and Security+ certifications (almost 10 years at this point) that haven&amp;#39;t helped me secure a position with any of the companies I&amp;#39;ve applied at around the sate, but I had pretty poor personal and professional development back then.&lt;/p&gt;\n\n&lt;p&gt;So, I&amp;#39;m pretty desperate for a change. I am still trying to be measured and level about whatever move I make, and I&amp;#39;m trying not to ruin my chances of being able to retire &amp;#39;ever.&amp;#39; For about two years, I&amp;#39;ve been enamored with the idea of pursuing the &lt;a href=\"/r/vandwellers\"&gt;/r/vandwellers&lt;/a&gt; dream or converting a box truck or bus into a tiny home on wheels. I have almost broken down and bought a box truck twice now. &lt;strong&gt;The low cost of getting a &amp;#39;foundation&amp;#39; and the ability to build it out into a home over time is appealing to me.&lt;/strong&gt; Depending on how exactly I obtained a vehicle, it&amp;#39;s possible I could avoid making payments (insurance, primarily) on it at all until I planned on putting it on the road--even if that&amp;#39;s a little sketchy. Unfortunately, building out a camper is accepting that if you&amp;#39;re actually &lt;em&gt;able&lt;/em&gt; to sell it (especially a DIY conversion), you&amp;#39;re going to be selling it at a big loss.&lt;/p&gt;\n\n&lt;p&gt;Another thing I&amp;#39;ve considered is trying to travel and see if I find a sense of belonging anywhere else. Especially outside of the US. I&amp;#39;m very interested in martial arts and studying them &amp;#39;at their roots&amp;#39; in places like Thailand, Brazil, and China sounds very exciting. Though surely I&amp;#39;ve romanticized the thought in my head. Learning about other cultures, foods, and languages by immersion sounds genuinely fulfilling, though. Unfortunately, travel is an expense that I can&amp;#39;t expect to gain any financial stability from. I don&amp;#39;t feel like I have professional enough credentials to land a job or make a living overseas, but I have considered attempting to help pay bills by becoming a fighter. I do worry about how sustainable that is given how physically taxing it is and how it&amp;#39;s possible that genetics decide it&amp;#39;s time for things to go downhill for me within a decade. And it&amp;#39;s very performance based even if those things aren&amp;#39;t issues.&lt;/p&gt;\n\n&lt;p&gt;Anyways, either of those lifestyles would be much more sustainable and comfortable if I had passive income and a safety net in case living in a van or living overseas just isn&amp;#39;t viable anymore. So, the debt and commitment of a house is terrifying and involves amounts of money that make my head spin. &lt;strong&gt;But realistically, a home is an intelligent, functional, and flexible investment.&lt;/strong&gt; Even just selling the house, the earnings would easily make a safe foundation for a camper conversion or a lot of travel. Yesterday I was looking at my savings and how I&amp;#39;m trying to fund a trip to Thailand without interrupting my normal savings and I decided to start looking at houses to see what the pricing was like. That leads us into this post!&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;End TL;DR&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;So, yesterday I checked out this house in Louisiana. It&amp;#39;s in a city I&amp;#39;d be much happier living in, and it&amp;#39;s a city that&amp;#39;s populated enough that I have lots of friends who might be interested in living there, and there&amp;#39;s a fair amount of demand from college students and just ordinary folks for places to live. It&amp;#39;s a much larger house than I need as an individual, and I&amp;#39;m trying to secure a &amp;#39;duplex&amp;#39;-style place that I could rent to strangers and not worry so much about my own safety/privacy if I was also living there.&lt;/p&gt;\n\n&lt;p&gt;My first observation was that the price of the home is exceptionally low, so much so that &lt;strong&gt;I could afford to buy the house and make monthly payments on it without needing to change my lifestyle.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Upon seeing the house, it was pretty obvious why the price was so low. In fact, my verdict after having checked the place out is &amp;quot;This lot would probably be worth more without his house on it.&amp;quot; The agent I was with remarked, &amp;quot;Yeah, the house comes with the lot!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So, the placement of the house and the very affordable price are leading me to still give the place some consideration, I don&amp;#39;t know what steps I need to take to figure out if this home is even worth being a &amp;#39;project&amp;#39; or not. Obviously, I&amp;#39;d like to have experts examine the property and give me their advice, but before spending any money on this place I might as well have interested and hopefully well-meaning strangers share some thoughts, right?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Without further ado, here&amp;#39;s pictures of the place:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Exterior: &lt;a href=\"http://imgur.com/a/7TBUl\"&gt;http://imgur.com/a/7TBUl&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Interior: &lt;a href=\"http://imgur.com/a/0hCgo\"&gt;http://imgur.com/a/0hCgo&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;So, the place is definitely in rough shape. The agent I met was extremely helpful and had lots of information on the house. Apparently it was co-owned and got bought out and that&amp;#39;s probably one of the many reasons this place is listed for as low as it is. (Less than 30 days now.)&lt;/p&gt;\n\n&lt;p&gt;Prior to the home being put up for sale, it&amp;#39;s been rented (for a &lt;strong&gt;lot&lt;/strong&gt;, even considering where it is) for 15 years and the information the agent had suggested the house is 41-51 years old, almost certainly closer to the 50-side we agreed.&lt;/p&gt;\n\n&lt;p&gt;For a 4-bedroom place there&amp;#39;s only one bathroom and it seems added-on, my guess is the place had an outhouse prior to that. Speaking of things outside of the house, the lot is huge, 50x140, it has almost enough room for two of these houses. The hot water heater that&amp;#39;s jacked up in the back is the first thing I noticed and then I noticed the broken window. It&amp;#39;s very likely that damage didn&amp;#39;t happen until the house was vacated, but the &amp;quot;fix&amp;quot; was to screw a door in place over the window...&lt;/p&gt;\n\n&lt;p&gt;I used to do in-home phone and cable and internet installations so I tried taking pictures of all the visible cables running outside and it&amp;#39;s pretty weird to me that most of them are cut. I guess at some point they switched from cable to satellite (or whatever) and one company just wrecked another&amp;#39;s installation.&lt;/p&gt;\n\n&lt;p&gt;On the inside, the pictures probably do things justice. The ceilings are 12&amp;#39; tall which is nice, but pretty much everything on the inside is dated and run down. &lt;strong&gt;There was electricity to the home still and all the lights worked.&lt;/strong&gt; In fact, &lt;strong&gt;even the central air worked, at least to the point of pushing air.&lt;/strong&gt; There are washer/dryer hookups in the kitchen area, but the units themselves aren&amp;#39;t there.&lt;/p&gt;\n\n&lt;p&gt;The last room in the pictures (with the big closet, before the bathroom pictures) of the interior was &lt;strong&gt;at a clear incline,&lt;/strong&gt; so much so that I was hesitant about walking to the far corners to take the pictures I did. However, measuring from the wall opposite of the incline--at every height I checked with a laser--was 11&amp;#39;9&amp;quot;. It was somehow square to its opposite wall.&lt;/p&gt;\n\n&lt;p&gt;The main appeal of the home from the outside was the two front doors, it appeased my &amp;quot;duplex&amp;quot; ideas. But, alas, the front door facing the street doesn&amp;#39;t actually have a handle. It does have a lock, but I didn&amp;#39;t closely examine to see if it had hinges anymore.&lt;/p&gt;\n\n&lt;p&gt;My tour of the place led me to believe this place is &amp;quot;probably too far gone&amp;quot; for me, but everything besides the condition is insanely optimal for me, even down to being within my favorite internet provider&amp;#39;s service area. (Haha) I feel like there might be some merit to the potential I see in the lot, but I&amp;#39;m not sure I&amp;#39;d feasibly be able to make it happen with this home on here. The few estimates I&amp;#39;ve done online (which I know are rough) seem to indicate a similarly-sized new home would easily be $200,000+ which is way outside of what I can sensible commit to. However, demolishing the home does seem to be much cheaper than I would have expected--~$8,000 to ~$15,000 according to google!&lt;/p&gt;\n\n&lt;p&gt;Anyways, my reason tells me I should probably forget about this place, but I am in a position where I could probably afford to have a few experts look over the foundation and the structure of the home. Do you think I should give that a shot? Is there anywhere I can estimate how much that (the consultations, not the renovations) would cost?&lt;/p&gt;\n\n&lt;p&gt;Thanks, sorry for the long post.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey /r/HomeImprovement,\n\n**Personal TL;DR starts here:**\n\n---\n\nI'm recently 27, I've spent the majority of my life in small-town Louisiana and I'm very, very tired of it. My professional skillset is in IT, but the majority of my work experience is random part-time food service and retail, a small unhappy stretch doing in-home installations for AT&amp;T, and years of being my father's small business' \"computer guy.\" I've got dated A+, Network+ and Security+ certifications (almost 10 years at this point) that haven't helped me secure a position with any of the companies I've applied at around the sate, but I had pretty poor personal and professional development back then.\n\nSo, I'm pretty desperate for a change. I am still trying to be measured and level about whatever move I make, and I'm trying not to ruin my chances of being able to retire 'ever.' For about two years, I've been enamored with the idea of pursuing the /r/vandwellers dream or converting a box truck or bus into a tiny home on wheels. I have almost broken down and bought a box truck twice now. **The low cost of getting a 'foundation' and the ability to build it out into a home over time is appealing to me.** Depending on how exactly I obtained a vehicle, it's possible I could avoid making payments (insurance, primarily) on it at all until I planned on putting it on the road--even if that's a little sketchy. Unfortunately, building out a camper is accepting that if you're actually *able* to sell it (especially a DIY conversion), you're going to be selling it at a big loss.\n\nAnother thing I've considered is trying to travel and see if I find a sense of belonging anywhere else. Especially outside of the US. I'm very interested in martial arts and studying them 'at their roots' in places like Thailand, Brazil, and China sounds very exciting. Though surely I've romanticized the thought in my head. Learning about other cultures, foods, and languages by immersion sounds genuinely fulfilling, though. Unfortunately, travel is an expense that I can't expect to gain any financial stability from. I don't feel like I have professional enough credentials to land a job or make a living overseas, but I have considered attempting to help pay bills by becoming a fighter. I do worry about how sustainable that is given how physically taxing it is and how it's possible that genetics decide it's time for things to go downhill for me within a decade. And it's very performance based even if those things aren't issues.\n\nAnyways, either of those lifestyles would be much more sustainable and comfortable if I had passive income and a safety net in case living in a van or living overseas just isn't viable anymore. So, the debt and commitment of a house is terrifying and involves amounts of money that make my head spin. **But realistically, a home is an intelligent, functional, and flexible investment.** Even just selling the house, the earnings would easily make a safe foundation for a camper conversion or a lot of travel. Yesterday I was looking at my savings and how I'm trying to fund a trip to Thailand without interrupting my normal savings and I decided to start looking at houses to see what the pricing was like. That leads us into this post!\n\n---\n\n**End TL;DR**\n\nSo, yesterday I checked out this house in Louisiana. It's in a city I'd be much happier living in, and it's a city that's populated enough that I have lots of friends who might be interested in living there, and there's a fair amount of demand from college students and just ordinary folks for places to live. It's a much larger house than I need as an individual, and I'm trying to secure a 'duplex'-style place that I could rent to strangers and not worry so much about my own safety/privacy if I was also living there.\n\nMy first observation was that the price of the home is exceptionally low, so much so that **I could afford to buy the house and make monthly payments on it without needing to change my lifestyle.**\n\nUpon seeing the house, it was pretty obvious why the price was so low. In fact, my verdict after having checked the place out is \"This lot would probably be worth more without his house on it.\" The agent I was with remarked, \"Yeah, the house comes with the lot!\"\n\nSo, the placement of the house and the very affordable price are leading me to still give the place some consideration, I don't know what steps I need to take to figure out if this home is even worth being a 'project' or not. Obviously, I'd like to have experts examine the property and give me their advice, but before spending any money on this place I might as well have interested and hopefully well-meaning strangers share some thoughts, right?\n\n**Without further ado, here's pictures of the place:**\n\nExterior: http://imgur.com/a/7TBUl\n\nInterior: http://imgur.com/a/0hCgo\n\nSo, the place is definitely in rough shape. The agent I met was extremely helpful and had lots of information on the house. Apparently it was co-owned and got bought out and that's probably one of the many reasons this place is listed for as low as it is. (Less than 30 days now.)\n\nPrior to the home being put up for sale, it's been rented (for a **lot**, even considering where it is) for 15 years and the information the agent had suggested the house is 41-51 years old, almost certainly closer to the 50-side we agreed.\n\nFor a 4-bedroom place there's only one bathroom and it seems added-on, my guess is the place had an outhouse prior to that. Speaking of things outside of the house, the lot is huge, 50x140, it has almost enough room for two of these houses. The hot water heater that's jacked up in the back is the first thing I noticed and then I noticed the broken window. It's very likely that damage didn't happen until the house was vacated, but the \"fix\" was to screw a door in place over the window...\n\nI used to do in-home phone and cable and internet installations so I tried taking pictures of all the visible cables running outside and it's pretty weird to me that most of them are cut. I guess at some point they switched from cable to satellite (or whatever) and one company just wrecked another's installation.\n\nOn the inside, the pictures probably do things justice. The ceilings are 12' tall which is nice, but pretty much everything on the inside is dated and run down. **There was electricity to the home still and all the lights worked.** In fact, **even the central air worked, at least to the point of pushing air.** There are washer/dryer hookups in the kitchen area, but the units themselves aren't there.\n\nThe last room in the pictures (with the big closet, before the bathroom pictures) of the interior was **at a clear incline,** so much so that I was hesitant about walking to the far corners to take the pictures I did. However, measuring from the wall opposite of the incline--at every height I checked with a laser--was 11'9\". It was somehow square to its opposite wall.\n\nThe main appeal of the home from the outside was the two front doors, it appeased my \"duplex\" ideas. But, alas, the front door facing the street doesn't actually have a handle. It does have a lock, but I didn't closely examine to see if it had hinges anymore.\n\nMy tour of the place led me to believe this place is \"probably too far gone\" for me, but everything besides the condition is insanely optimal for me, even down to being within my favorite internet provider's service area. (Haha) I feel like there might be some merit to the potential I see in the lot, but I'm not sure I'd feasibly be able to make it happen with this home on here. The few estimates I've done online (which I know are rough) seem to indicate a similarly-sized new home would easily be $200,000+ which is way outside of what I can sensible commit to. However, demolishing the home does seem to be much cheaper than I would have expected--~$8,000 to ~$15,000 according to google!\n\nAnyways, my reason tells me I should probably forget about this place, but I am in a position where I could probably afford to have a few experts look over the foundation and the structure of the home. Do you think I should give that a shot? Is there anywhere I can estimate how much that (the consultations, not the renovations) would cost?\n\nThanks, sorry for the long post.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ryin", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 42, "report_reasons": null, "author": "ScapegoatZovc", "saved": false, "mod_reports": [], "name": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "approved_by": null, "over_18": false, "domain": "self.HomeImprovement", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/flX9C-dbgS5LXlMaiVUgrl3911tZn07uwDB2Yj29Zdk.jpg?s=5e7656f087dbfda5b0aad74121495f87", "width": 3840, "height": 2160}, "resolutions": [{"url": "https://i.redditmedia.com/flX9C-dbgS5LXlMaiVUgrl3911tZn07uwDB2Yj29Zdk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=6b865186ee5674a930ab40ea7c336e5d", "width": 108, "height": 60}, {"url": "https://i.redditmedia.com/flX9C-dbgS5LXlMaiVUgrl3911tZn07uwDB2Yj29Zdk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=e897b92b5ef781f87279319cddaa26f1", "width": 216, "height": 121}, {"url": "https://i.redditmedia.com/flX9C-dbgS5LXlMaiVUgrl3911tZn07uwDB2Yj29Zdk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=ddd47cf1821954d4092882618770e26c", "width": 320, "height": 180}, {"url": "https://i.redditmedia.com/flX9C-dbgS5LXlMaiVUgrl3911tZn07uwDB2Yj29Zdk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=3c6ceb475788ff8f360fb0f338990fba", "width": 640, "height": 360}, {"url": "https://i.redditmedia.com/flX9C-dbgS5LXlMaiVUgrl3911tZn07uwDB2Yj29Zdk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=df51ff8b53d25ab69c2552a9438bff29", "width": 960, "height": 540}, {"url": "https://i.redditmedia.com/flX9C-dbgS5LXlMaiVUgrl3911tZn07uwDB2Yj29Zdk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=2505fd53c528818e67c4b74521da0421", "width": 1080, "height": 607}], "variants": {}, "id": "OkfK7aAlYGV-ShnH1VKy35cDiD2XF_7_ept4dIpohVo"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2ql97", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/HomeImprovement/comments/65ryin/can_this_home_be_salvaged/", "num_reports": null, "locked": false, "stickied": false, "created": 1492411983.0, "url": "https://www.reddit.com/r/HomeImprovement/comments/65ryin/can_this_home_be_salvaged/", "author_flair_text": null, "quarantine": false, "title": "Can this home be salvaged?", "created_utc": 1492383183.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 38, "visited": false, "subreddit_type": "public", "ups": 42}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgd6l2i", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "PhonyUsername", "parent_id": "t1_dgcsnkl", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Do not use the inspector recommended by the agent. They are their to help the process along. Find your own inspector.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do not use the inspector recommended by the agent. They are their to help the process along. Find your own inspector.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd6l2i", "score_hidden": false, "stickied": false, "created": 1492437343.0, "created_utc": 1492408543.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcsnkl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ScapegoatZovc", "parent_id": "t1_dgcs0qc", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Cool, I'll give the agent a call some time this week and see what the costs of inspections are like. I'll see if I can bring a few extra pairs of eyes with me, too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cool, I&amp;#39;ll give the agent a call some time this week and see what the costs of inspections are like. I&amp;#39;ll see if I can bring a few extra pairs of eyes with me, too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcsnkl", "score_hidden": false, "stickied": false, "created": 1492416222.0, "created_utc": 1492387422.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcs0qc", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Sarcasticorjustrude", "parent_id": "t1_dgcrqk9", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Absolutely. If you're dealing with an agent, they will be able to put you in contact with property inspectors.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Absolutely. If you&amp;#39;re dealing with an agent, they will be able to put you in contact with property inspectors.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcs0qc", "score_hidden": false, "stickied": false, "created": 1492415353.0, "created_utc": 1492386553.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrqk9", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ScapegoatZovc", "parent_id": "t1_dgcrgq5", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Is that something that can be inspected before I buy the property? I know you often have to do crawling and digging to fool with things like electrical.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is that something that can be inspected before I buy the property? I know you often have to do crawling and digging to fool with things like electrical.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcrqk9", "score_hidden": false, "stickied": false, "created": 1492414973.0, "created_utc": 1492386173.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrgq5", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Sarcasticorjustrude", "parent_id": "t1_dgcrbu8", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "&gt; I do have handy friends who have expressed interest in helping with a project like this.\n\nThat can save you truckloads of money. But, be sure than some things are done or at least inspected by proper professionals if you decide to pull the trigger. Electrical is the biggest one, and I'd be surprised if that place didn't need anything short of a full re-wire. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I do have handy friends who have expressed interest in helping with a project like this.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That can save you truckloads of money. But, be sure than some things are done or at least inspected by proper professionals if you decide to pull the trigger. Electrical is the biggest one, and I&amp;#39;d be surprised if that place didn&amp;#39;t need anything short of a full re-wire. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcrgq5", "score_hidden": false, "stickied": false, "created": 1492414618.0, "created_utc": 1492385818.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgddz2x", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "TheBimpo", "parent_id": "t1_dgcrbu8", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "What does \"helping\" mean? My pals don't mind a few hours of labor here and there, but this is a total renovation of the entire property, hundreds of hours of skilled labor to get this place restored. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What does &amp;quot;helping&amp;quot; mean? My pals don&amp;#39;t mind a few hours of labor here and there, but this is a total renovation of the entire property, hundreds of hours of skilled labor to get this place restored. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgddz2x", "score_hidden": false, "stickied": false, "created": 1492458559.0, "created_utc": 1492429759.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgdj1r9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "limitless__", "parent_id": "t1_dgcrbu8", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "That is a complete wreck.  Honestly.  I know the idea is attractive $-wise but that's a non-starter.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is a complete wreck.  Honestly.  I know the idea is attractive $-wise but that&amp;#39;s a non-starter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgdj1r9", "score_hidden": false, "stickied": false, "created": 1492467445.0, "created_utc": 1492438645.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrbu8", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ScapegoatZovc", "parent_id": "t1_dgcqlto", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Thanks for the input. Getting into six figures is pretty much my no-no zone. If the cost on top of buying the home was more than ~$100,000 it's probably out of my league. It's something that I can space out over time, which is nice, but if it won't be livable for more than a year it's probably not worth sitting on my hands.\n\nI don't have access to cut rate materials, but I do have handy friends who have expressed interest in helping with a project like this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the input. Getting into six figures is pretty much my no-no zone. If the cost on top of buying the home was more than ~$100,000 it&amp;#39;s probably out of my league. It&amp;#39;s something that I can space out over time, which is nice, but if it won&amp;#39;t be livable for more than a year it&amp;#39;s probably not worth sitting on my hands.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have access to cut rate materials, but I do have handy friends who have expressed interest in helping with a project like this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcrbu8", "score_hidden": false, "stickied": false, "created": 1492414438.0, "created_utc": 1492385638.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqlto", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "Sarcasticorjustrude", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "To me, it looks like nearly **everything** would have to be replaced, and that's assuming the main structure and foundation is still intact. It could cost six figures *easily* to bring that home into livable, inspection-passing condition.\n\n\nUnless you're a contractor yourself with access to cut-rate materials and labor, I would run away with my hands protecting my vital parts.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To me, it looks like nearly &lt;strong&gt;everything&lt;/strong&gt; would have to be replaced, and that&amp;#39;s assuming the main structure and foundation is still intact. It could cost six figures &lt;em&gt;easily&lt;/em&gt; to bring that home into livable, inspection-passing condition.&lt;/p&gt;\n\n&lt;p&gt;Unless you&amp;#39;re a contractor yourself with access to cut-rate materials and labor, I would run away with my hands protecting my vital parts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcqlto", "score_hidden": false, "stickied": false, "created": 1492413452.0, "created_utc": 1492384652.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgd36zq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ScapegoatZovc", "parent_id": "t1_dgd05h1", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "&gt;Perhaps your struggle with finding your place has led you to romanticize certain ideas because of the novelty of them?\n\nI could definitely see this being the case. The city where this lot is is the city where I've had the most personal and social growth, it's the only place I've lived that I feel any 'good' connections to. I can definitely see (or feel?) a lot of novelty in these ideas and I try to remind myself of the hazards and instabilities of either being alone in a foreign country or being alone as a nomad. Maybe not wanting to be where I am still makes me unreasonable when looking at things laid out.\n\n&gt;I hope you find what you're looking for OP. Have you considered teaching English in another country? Not an impossible field to break into and maybe it'll stimulate your imagination a bit.\n\nThanks, that carries a special meaning when it seems sincere and it comes from a stranger. I have thought about trying to teach English abroad. A lot, actually. I like the idea of it but I do not have a degree and at this point I've pretty much burned my bridges with college. Every now and then I hear folks suggest that there are programs that don't need degrees, but I also hear they either \"don't pay well enough\" or \"aren't as in demand\" or somehow framed in a less than favorable way. In the bit of looking into Thailand I've done, there are apparently less-vetted \"business English\" programs for teaching professionals (rather than, say, school kids) that are an option but are less secure/stable.\n\nI will say that I do like teaching, though, from the little bit that I've done. I train a lot of adults in my current position and I've worked with kids a lot through martial arts and I've had lots of fun doing both.\n\nThanks again for the advice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Perhaps your struggle with finding your place has led you to romanticize certain ideas because of the novelty of them?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I could definitely see this being the case. The city where this lot is is the city where I&amp;#39;ve had the most personal and social growth, it&amp;#39;s the only place I&amp;#39;ve lived that I feel any &amp;#39;good&amp;#39; connections to. I can definitely see (or feel?) a lot of novelty in these ideas and I try to remind myself of the hazards and instabilities of either being alone in a foreign country or being alone as a nomad. Maybe not wanting to be where I am still makes me unreasonable when looking at things laid out.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I hope you find what you&amp;#39;re looking for OP. Have you considered teaching English in another country? Not an impossible field to break into and maybe it&amp;#39;ll stimulate your imagination a bit.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Thanks, that carries a special meaning when it seems sincere and it comes from a stranger. I have thought about trying to teach English abroad. A lot, actually. I like the idea of it but I do not have a degree and at this point I&amp;#39;ve pretty much burned my bridges with college. Every now and then I hear folks suggest that there are programs that don&amp;#39;t need degrees, but I also hear they either &amp;quot;don&amp;#39;t pay well enough&amp;quot; or &amp;quot;aren&amp;#39;t as in demand&amp;quot; or somehow framed in a less than favorable way. In the bit of looking into Thailand I&amp;#39;ve done, there are apparently less-vetted &amp;quot;business English&amp;quot; programs for teaching professionals (rather than, say, school kids) that are an option but are less secure/stable.&lt;/p&gt;\n\n&lt;p&gt;I will say that I do like teaching, though, from the little bit that I&amp;#39;ve done. I train a lot of adults in my current position and I&amp;#39;ve worked with kids a lot through martial arts and I&amp;#39;ve had lots of fun doing both.&lt;/p&gt;\n\n&lt;p&gt;Thanks again for the advice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd36zq", "score_hidden": false, "stickied": false, "created": 1492430928.0, "created_utc": 1492402128.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd05h1", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "BigFatDynamo", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Buying a house and pursuing your dreams of travel aren't mutually exclusive ideas, but they're damn close. I would stay liquid if i were you, and wait to buy something until you want to set down for a while. \n\nPerhaps your struggle with finding your place has led you to romanticize certain ideas because of the novelty of them?\n\nI hope you find what you're looking for OP. Have you considered teaching English in another country? Not an impossible field to break into and maybe it'll stimulate your imagination a bit. \n\nAlso, the house looks like a disaster.  Run away.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Buying a house and pursuing your dreams of travel aren&amp;#39;t mutually exclusive ideas, but they&amp;#39;re damn close. I would stay liquid if i were you, and wait to buy something until you want to set down for a while. &lt;/p&gt;\n\n&lt;p&gt;Perhaps your struggle with finding your place has led you to romanticize certain ideas because of the novelty of them?&lt;/p&gt;\n\n&lt;p&gt;I hope you find what you&amp;#39;re looking for OP. Have you considered teaching English in another country? Not an impossible field to break into and maybe it&amp;#39;ll stimulate your imagination a bit. &lt;/p&gt;\n\n&lt;p&gt;Also, the house looks like a disaster.  Run away.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd05h1", "score_hidden": false, "stickied": false, "created": 1492426369.0, "created_utc": 1492397569.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgddmh1", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "HughJafro", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "I think we have different ideas of what TL;DR means.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think we have different ideas of what TL;DR means.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgddmh1", "score_hidden": false, "stickied": false, "created": 1492457698.0, "created_utc": 1492428898.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgcwhuo", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ScapegoatZovc", "parent_id": "t1_dgcv04n", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "But the door's on the window", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But the door&amp;#39;s on the window&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcwhuo", "score_hidden": false, "stickied": false, "created": 1492421307.0, "created_utc": 1492392507.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgd788y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "WigginIII", "parent_id": "t1_dgcv04n", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Traplyfe", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Traplyfe&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd788y", "score_hidden": false, "stickied": false, "created": 1492438759.0, "created_utc": 1492409959.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcv04n", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "8ballrun", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "its not all bad, it would make a nice crackhouse", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;its not all bad, it would make a nice crackhouse&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcv04n", "score_hidden": false, "stickied": false, "created": 1492419393.0, "created_utc": 1492390593.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgejicd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rdt790", "parent_id": "t1_dgd09k7", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Really? I didn't think it looked bad enough to freak out over. \n\nI didn't see any feces, roaches, dead animals, tires and the ceiling isn't caving in. Inside looks reasonably clean too. The \"grass\" is even mowed.\n\nFair disclosure, I used to work in real estate for a broker who specialized in bank owned property. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Really? I didn&amp;#39;t think it looked bad enough to freak out over. &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t see any feces, roaches, dead animals, tires and the ceiling isn&amp;#39;t caving in. Inside looks reasonably clean too. The &amp;quot;grass&amp;quot; is even mowed.&lt;/p&gt;\n\n&lt;p&gt;Fair disclosure, I used to work in real estate for a broker who specialized in bank owned property. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgejicd", "score_hidden": false, "stickied": false, "created": 1492510816.0, "created_utc": 1492482016.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd09k7", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "kanjiklubbin", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "10/10 this is the best thing I've ever seen.\n\nYou're joking, right? If you're not then please, please PLEASE run away from this place. Forgiving literally EVERYTHING else, the foundation is a handful of deck piers... Just... no.\n\n[My reaction scrolling through pictures imagining I had bought this place while drunk or something.](https://media.giphy.com/media/A8mOE2k9WV0yc/giphy.gif)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;10/10 this is the best thing I&amp;#39;ve ever seen.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re joking, right? If you&amp;#39;re not then please, please PLEASE run away from this place. Forgiving literally EVERYTHING else, the foundation is a handful of deck piers... Just... no.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://media.giphy.com/media/A8mOE2k9WV0yc/giphy.gif\"&gt;My reaction scrolling through pictures imagining I had bought this place while drunk or something.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd09k7", "score_hidden": false, "stickied": false, "created": 1492426529.0, "created_utc": 1492397729.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgddyi4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thefrc", "parent_id": "t1_dgd3ajw", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Usually modular homes are trucked in from where they are built. It's a national thing, not a local thing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Usually modular homes are trucked in from where they are built. It&amp;#39;s a national thing, not a local thing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgddyi4", "score_hidden": false, "stickied": false, "created": 1492458519.0, "created_utc": 1492429719.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgdjufu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "evenstarauror", "parent_id": "t1_dgd3ajw", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "If you wanted to do a house kit or modular home I think most of those are pretty national and deliver anywhere-of course you still have quite a bit of work with those options, although a lot of the house kits now are designed for DIY-ers.\n\nFor a prefab home (a trailer or a double-wide) you'll want to keep your research pretty local as transporting these makes delivery expensive if it needs to travel far.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you wanted to do a house kit or modular home I think most of those are pretty national and deliver anywhere-of course you still have quite a bit of work with those options, although a lot of the house kits now are designed for DIY-ers.&lt;/p&gt;\n\n&lt;p&gt;For a prefab home (a trailer or a double-wide) you&amp;#39;ll want to keep your research pretty local as transporting these makes delivery expensive if it needs to travel far.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgdjufu", "score_hidden": false, "stickied": false, "created": 1492468534.0, "created_utc": 1492439734.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd3ajw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ScapegoatZovc", "parent_id": "t1_dgd2aa9", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Thanks for that suggestion. I'll try to figure out what lots in the area are actually worth and stew on the idea and talk with friends and family a bit.\n\nIf the cost of a similar lot is in the neighborhood of the lot's price and demolition, it might be worth taking it from that angle. I'll also try to look into prefabricated homes--is that something I should do locally or is it a thing I could get a good idea of looking at 'national' or universal stuff online?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for that suggestion. I&amp;#39;ll try to figure out what lots in the area are actually worth and stew on the idea and talk with friends and family a bit.&lt;/p&gt;\n\n&lt;p&gt;If the cost of a similar lot is in the neighborhood of the lot&amp;#39;s price and demolition, it might be worth taking it from that angle. I&amp;#39;ll also try to look into prefabricated homes--is that something I should do locally or is it a thing I could get a good idea of looking at &amp;#39;national&amp;#39; or universal stuff online?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd3ajw", "score_hidden": false, "stickied": false, "created": 1492431083.0, "created_utc": 1492402283.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2aa9", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "evenstarauror", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "If you really like the location that much, you could consider a manufactured home or house kit of some kind.  Get rid of the house, the nonexistent beach-pier foundation and pour a slab for the house kit.  This could be way more affordable than trying to fix up a house in that kind of shape.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you really like the location that much, you could consider a manufactured home or house kit of some kind.  Get rid of the house, the nonexistent beach-pier foundation and pour a slab for the house kit.  This could be way more affordable than trying to fix up a house in that kind of shape.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd2aa9", "score_hidden": false, "stickied": false, "created": 1492429461.0, "created_utc": 1492400661.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgde7ev", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "HughJafro", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Personally, I'd avoid it. I have done this exact same thing, so I have the experience from that perspective. I bought a $35,000 house and rehabbed it. I didn't have any help and learned some expensive lessons along the way. So trust me when I say, you're better off getting a nicer house and filling it with roommates until you can get some of that mortgage paid off or start making better money. Even then, keep one roommate around to pay your taxes for ya.\n\nOn the other hand, IF you know someone who does remodeling for a living, get them to look at it, and while you may not need their help if you're handy, you DO need their advice and expertise. If you don't know someone like this, avoid this kind of project 100%.\n\nThere are major things you look for are:\n\n* ROOF\n* Foundation\n* Septic or sewer? If spetic, how is the system?\n* No Garage? Hope you don't want one because adding one will cost big money.\n* No driveway? That's a few grand for one.\n\nSo basically IF you have the cash to buy the place (Downpayment+taxes+whatever else you need to close) **AND** the cash to remodel it **AND** someone who can be there to help advise (not necessarily help you physically), I'd say look into it. As long as you're willing to work for it. Otherwise, skip it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally, I&amp;#39;d avoid it. I have done this exact same thing, so I have the experience from that perspective. I bought a $35,000 house and rehabbed it. I didn&amp;#39;t have any help and learned some expensive lessons along the way. So trust me when I say, you&amp;#39;re better off getting a nicer house and filling it with roommates until you can get some of that mortgage paid off or start making better money. Even then, keep one roommate around to pay your taxes for ya.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, IF you know someone who does remodeling for a living, get them to look at it, and while you may not need their help if you&amp;#39;re handy, you DO need their advice and expertise. If you don&amp;#39;t know someone like this, avoid this kind of project 100%.&lt;/p&gt;\n\n&lt;p&gt;There are major things you look for are:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;ROOF&lt;/li&gt;\n&lt;li&gt;Foundation&lt;/li&gt;\n&lt;li&gt;Septic or sewer? If spetic, how is the system?&lt;/li&gt;\n&lt;li&gt;No Garage? Hope you don&amp;#39;t want one because adding one will cost big money.&lt;/li&gt;\n&lt;li&gt;No driveway? That&amp;#39;s a few grand for one.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;So basically IF you have the cash to buy the place (Downpayment+taxes+whatever else you need to close) &lt;strong&gt;AND&lt;/strong&gt; the cash to remodel it &lt;strong&gt;AND&lt;/strong&gt; someone who can be there to help advise (not necessarily help you physically), I&amp;#39;d say look into it. As long as you&amp;#39;re willing to work for it. Otherwise, skip it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgde7ev", "score_hidden": false, "stickied": false, "created": 1492459102.0, "created_utc": 1492430302.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgd4e0w", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "abhikavi", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "This is not the kind of house to take on unless your dream-- your one and only dream-- is to renovate a house like this. It will consume your life, and will eat up every cent you get as you earn it.\n\nWatch the Money Pit (Tom Hanks, 1986)-- it's somewhat of an exaggeration, but it does accurately show how consuming home renovation can be. \n\nBuying the lot, knocking down the house, and putting in whatever you can afford right now (tent, trailer, your dream tiny house), is a much more sane choice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is not the kind of house to take on unless your dream-- your one and only dream-- is to renovate a house like this. It will consume your life, and will eat up every cent you get as you earn it.&lt;/p&gt;\n\n&lt;p&gt;Watch the Money Pit (Tom Hanks, 1986)-- it&amp;#39;s somewhat of an exaggeration, but it does accurately show how consuming home renovation can be. &lt;/p&gt;\n\n&lt;p&gt;Buying the lot, knocking down the house, and putting in whatever you can afford right now (tent, trailer, your dream tiny house), is a much more sane choice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd4e0w", "score_hidden": false, "stickied": false, "created": 1492432966.0, "created_utc": 1492404166.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgdi8qg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thisadviceisworthles", "parent_id": "t1_dgdhp31", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Just because you work for you dad doesn't mean it's not a job.  Tell them you are take vacation on X (in writing).  If they say no, say you need it in writing.  If they say no to that, don't show up to work that day, if they refuse it in writing (and you have use it or loose it vacation time), show that letter at the end of the year and demand that your vacation time be paid.  It should solve the work situation, moving to a different state will help with the family situation that follows.\n\nI don't know how anyone can work for family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just because you work for you dad doesn&amp;#39;t mean it&amp;#39;s not a job.  Tell them you are take vacation on X (in writing).  If they say no, say you need it in writing.  If they say no to that, don&amp;#39;t show up to work that day, if they refuse it in writing (and you have use it or loose it vacation time), show that letter at the end of the year and demand that your vacation time be paid.  It should solve the work situation, moving to a different state will help with the family situation that follows.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how anyone can work for family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgdi8qg", "score_hidden": false, "stickied": false, "created": 1492466308.0, "created_utc": 1492437508.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdhp31", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ScapegoatZovc", "parent_id": "t1_dgdghcm", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Haha, you really sound like you were in a similar spot to me. Good guess on those locations!\n\nI have a few friends who have taken their degrees to Austin. Two of them have actually made pretty generous offers as afar as boarding is concerned to help me get on my feet.\n\nThe biggest issue is, working for my father's business is not the easy \"Oh, he works for his dad\" a lot of people write it off as. I consistently put in more than 40 hours a week and haven't had a vacation in two years. (Other employees have had vacations, even ones who haven't been here as long as me... When I ask I get the run around.) It's like there isn't enough time for me to take a few days off and explore somewhere and decide if I actually want to start applying places.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha, you really sound like you were in a similar spot to me. Good guess on those locations!&lt;/p&gt;\n\n&lt;p&gt;I have a few friends who have taken their degrees to Austin. Two of them have actually made pretty generous offers as afar as boarding is concerned to help me get on my feet.&lt;/p&gt;\n\n&lt;p&gt;The biggest issue is, working for my father&amp;#39;s business is not the easy &amp;quot;Oh, he works for his dad&amp;quot; a lot of people write it off as. I consistently put in more than 40 hours a week and haven&amp;#39;t had a vacation in two years. (Other employees have had vacations, even ones who haven&amp;#39;t been here as long as me... When I ask I get the run around.) It&amp;#39;s like there isn&amp;#39;t enough time for me to take a few days off and explore somewhere and decide if I actually want to start applying places.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgdhp31", "score_hidden": false, "stickied": false, "created": 1492465482.0, "created_utc": 1492436682.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdghcm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thisadviceisworthles", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Before you spend money on the inspection, get a contractor in there to quote the renovation.  Even if you don't plan to go that route, insuring that it is financially viable to fix is the most important first step.\n\nLooking at the condition.  It seems the house is mostly serviceable, but that addition is questionable.  I think, depending on location, if you tear down the addition an renovate the rest, you should be able to have a small repaired house for a reasonable amount.  \n\nHaving said that: I would not recommend this.  I was, literally, in your position at 25, and I put in the offer and the deal was killed by termites.  If you are young, and not established in a job then I don't recommend buying a house.  This goes triple in Louisiana because of flood insurance .  I left Louisiana, and purchased a house that costs less every month than the flood insurance would have cost on the house I put in an offer on.\n\nIf you want to travel, then stop looking at houses and leave.  Even if it is short trips.  Based on the house pictures, it looks like you are in  South Louisiana (BR, Lafayette  or NO), if you are in BR or NO get your IT resume together and hop Megabus to Austin, spend a few days applying.  If you want to travel focus on temp/contract work, work 6 months putting half your check away.  Also consider doing the same trip to Akron, Ohio and Birmingham,AL.\n\nDon't buy a house just because it's cheap and you think you should. \n\nEdit: At 25 I was considering houses in New Orleans.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Before you spend money on the inspection, get a contractor in there to quote the renovation.  Even if you don&amp;#39;t plan to go that route, insuring that it is financially viable to fix is the most important first step.&lt;/p&gt;\n\n&lt;p&gt;Looking at the condition.  It seems the house is mostly serviceable, but that addition is questionable.  I think, depending on location, if you tear down the addition an renovate the rest, you should be able to have a small repaired house for a reasonable amount.  &lt;/p&gt;\n\n&lt;p&gt;Having said that: I would not recommend this.  I was, literally, in your position at 25, and I put in the offer and the deal was killed by termites.  If you are young, and not established in a job then I don&amp;#39;t recommend buying a house.  This goes triple in Louisiana because of flood insurance .  I left Louisiana, and purchased a house that costs less every month than the flood insurance would have cost on the house I put in an offer on.&lt;/p&gt;\n\n&lt;p&gt;If you want to travel, then stop looking at houses and leave.  Even if it is short trips.  Based on the house pictures, it looks like you are in  South Louisiana (BR, Lafayette  or NO), if you are in BR or NO get your IT resume together and hop Megabus to Austin, spend a few days applying.  If you want to travel focus on temp/contract work, work 6 months putting half your check away.  Also consider doing the same trip to Akron, Ohio and Birmingham,AL.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t buy a house just because it&amp;#39;s cheap and you think you should. &lt;/p&gt;\n\n&lt;p&gt;Edit: At 25 I was considering houses in New Orleans.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgdghcm", "score_hidden": false, "stickied": false, "created": 1492463536.0, "created_utc": 1492434736.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgd20dk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "this_here", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Run.  Seriously.  I bought a similar place back in my 20's.  More trouble than it's worth.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Run.  Seriously.  I bought a similar place back in my 20&amp;#39;s.  More trouble than it&amp;#39;s worth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd20dk", "score_hidden": false, "stickied": false, "created": 1492429049.0, "created_utc": 1492400249.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgd5wjr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "roobinsteen", "parent_id": "t1_dgd54ky", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "This is a good answer. I adore old houses, even severely fucked up ones. But it looks like this one is sitting on deck blocks......\n\nProbably was a pretty shitty house from day one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a good answer. I adore old houses, even severely fucked up ones. But it looks like this one is sitting on deck blocks......&lt;/p&gt;\n\n&lt;p&gt;Probably was a pretty shitty house from day one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd5wjr", "score_hidden": false, "stickied": false, "created": 1492435927.0, "created_utc": 1492407127.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd54ky", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "brainguy222", "parent_id": "t1_dgd3ns5", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Well most of the time I only recommend prefab if your housing options are limited to:\n\n1.) Places that require to the stud renovations. Often repairing old properties is far more expensive than starting fresh\n\n2.) The place was never designed to be a long-lasting long-standing home. In the detroit area that are a ton of fantastic homes that were built for the doctors, engineers, and business owners of a time gone past, those homes require significant renovation but they have features, designs and materials that would be far too expensive to replicate today so it's worth putting 50k or 70 to repair them. \n\nThis home looks like a disposable mobile home that was never taken care of which is pretty common in the south. It's not worth the money because it was never meant to be upkept. Because you don't have to deal with as much life threatening weather aka cold, your homes don't need to be built as well to survive in, but if you have the means, you should live in a home that is comfortable and lives up to modern standards. \n\nHere's a couple of companies if you're interested. Last one is from LA but they don't have any duplex design, i'm sure they could design one if you showed interest for little to no money. \n\nhttp://www.westchestermodular.com/family_lynn.html\n\nhttp://www.cavcodurango.com/series/duplexseries110/\n\nhttp://www.nationwide-homes.com/main.cfm?pagename=plandetail&amp;planId=1099&amp;stateName=&amp;countyName=\n\nhttp://www.americanhomesla.com/floor_plans.html", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well most of the time I only recommend prefab if your housing options are limited to:&lt;/p&gt;\n\n&lt;p&gt;1.) Places that require to the stud renovations. Often repairing old properties is far more expensive than starting fresh&lt;/p&gt;\n\n&lt;p&gt;2.) The place was never designed to be a long-lasting long-standing home. In the detroit area that are a ton of fantastic homes that were built for the doctors, engineers, and business owners of a time gone past, those homes require significant renovation but they have features, designs and materials that would be far too expensive to replicate today so it&amp;#39;s worth putting 50k or 70 to repair them. &lt;/p&gt;\n\n&lt;p&gt;This home looks like a disposable mobile home that was never taken care of which is pretty common in the south. It&amp;#39;s not worth the money because it was never meant to be upkept. Because you don&amp;#39;t have to deal with as much life threatening weather aka cold, your homes don&amp;#39;t need to be built as well to survive in, but if you have the means, you should live in a home that is comfortable and lives up to modern standards. &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s a couple of companies if you&amp;#39;re interested. Last one is from LA but they don&amp;#39;t have any duplex design, i&amp;#39;m sure they could design one if you showed interest for little to no money. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.westchestermodular.com/family_lynn.html\"&gt;http://www.westchestermodular.com/family_lynn.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.cavcodurango.com/series/duplexseries110/\"&gt;http://www.cavcodurango.com/series/duplexseries110/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.nationwide-homes.com/main.cfm?pagename=plandetail&amp;amp;planId=1099&amp;amp;stateName=&amp;amp;countyName=\"&gt;http://www.nationwide-homes.com/main.cfm?pagename=plandetail&amp;amp;planId=1099&amp;amp;stateName=&amp;amp;countyName=&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.americanhomesla.com/floor_plans.html\"&gt;http://www.americanhomesla.com/floor_plans.html&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd54ky", "score_hidden": false, "stickied": false, "created": 1492434368.0, "created_utc": 1492405568.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd3ns5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ScapegoatZovc", "parent_id": "t1_dgczprr", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Thanks, I think this is a sensible suggestion and approach. /u/evenstarauror gave a similar suggestion and I replied to them, too.\n\nYou do a good job of selling the idea of prefab homes and knowing that there might be duplex-style options is interesting. Hearing you're pretty happy with your results personally is also encouraging.\n\nHonestly, this house doesn't look \"that bad\" to me having lived in rural Louisiana most of my life (and doing in-home installations for AT&amp;T), but it's definitely the worst looking house out of the ones surrounding it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, I think this is a sensible suggestion and approach. &lt;a href=\"/u/evenstarauror\"&gt;/u/evenstarauror&lt;/a&gt; gave a similar suggestion and I replied to them, too.&lt;/p&gt;\n\n&lt;p&gt;You do a good job of selling the idea of prefab homes and knowing that there might be duplex-style options is interesting. Hearing you&amp;#39;re pretty happy with your results personally is also encouraging.&lt;/p&gt;\n\n&lt;p&gt;Honestly, this house doesn&amp;#39;t look &amp;quot;that bad&amp;quot; to me having lived in rural Louisiana most of my life (and doing in-home installations for AT&amp;amp;T), but it&amp;#39;s definitely the worst looking house out of the ones surrounding it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd3ns5", "score_hidden": false, "stickied": false, "created": 1492431699.0, "created_utc": 1492402899.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgczprr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "brainguy222", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "In my personal opinion, you should consider buying a prefab house and putting it over the cheapest house in the nicest area you can afford. You could get a prefab duplex at 80 a square foot for builders grade and live in an energy efficient, ergonomically and efficiently designed home while renting out the other half for income. Without many of the headaches that comes with a 50 year old home that has had mainly renters living in it for those years. Sure this is more work logistically, but far less work in building or hands on work. For 160k + initial cost you could build a very nice place to live and a good investment rather than a compromise. \n\nI may be biased because I live in the Midwest, but this house makes some of the houses in east Detroit look good. And those go for 20k for 1000 square feet. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my personal opinion, you should consider buying a prefab house and putting it over the cheapest house in the nicest area you can afford. You could get a prefab duplex at 80 a square foot for builders grade and live in an energy efficient, ergonomically and efficiently designed home while renting out the other half for income. Without many of the headaches that comes with a 50 year old home that has had mainly renters living in it for those years. Sure this is more work logistically, but far less work in building or hands on work. For 160k + initial cost you could build a very nice place to live and a good investment rather than a compromise. &lt;/p&gt;\n\n&lt;p&gt;I may be biased because I live in the Midwest, but this house makes some of the houses in east Detroit look good. And those go for 20k for 1000 square feet. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgczprr", "score_hidden": false, "stickied": false, "created": 1492425769.0, "created_utc": 1492396969.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgdly88", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "three_martini_lunch", "parent_id": "t1_dgd3ij5", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "&gt; Regarding what I want out of my life: all I can say is I'm searching for it. I'm trying to figure out what's within reach that will help me keep pursuing the things I enjoy the most.\n\nThis house is not for you.\n\nI made the mistake of buying a house in a place I knew I would only live for about 5 years. I figured I couldn't lose that much money compared to renting even in the worst case scenario. Of course, then 2008 happened - the worst case scenario.\n\nThe problem with the real estate market collapsing was *not* that we lost money (though we did still save compared to renting, but it was maybe a thousand dollars at best). It was that we couldn't sell the house. So, we had this albatross around our neck for 3 years that kept us from moving on with our lives in our new location.\n\nIt is hard to describe how much it drags you down owning a home you don't live in but...\n\n\n* You are paying substantial RE taxes every year\n\n* You are paying the mortgage\n\n* You still have to pay minimal utilities.\n\n* You have to pay for security or someone to check on it at least every other day.\n\n* You are technically in violation of your homeowners insurance. While it is an urban myth that HO insurance will deny a claim for DIY work without a permit. They most certainly will deny a claim related to a property being vacant. If someone steals your plumbing and the house is found vacant - they will deny this claim.\n\n* Even if you can find renters, a property management company takes a 15-30% cut depending on the amount of ongoing maintenance.\n\nMy advice - buy a RV or become a van dweller like you mentioned. Buying a house is for when you have things figured out and plan to stick around for at least 10+ years. Otherwise, buy a van and live free.\n\n", "edited": 1492442597.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Regarding what I want out of my life: all I can say is I&amp;#39;m searching for it. I&amp;#39;m trying to figure out what&amp;#39;s within reach that will help me keep pursuing the things I enjoy the most.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This house is not for you.&lt;/p&gt;\n\n&lt;p&gt;I made the mistake of buying a house in a place I knew I would only live for about 5 years. I figured I couldn&amp;#39;t lose that much money compared to renting even in the worst case scenario. Of course, then 2008 happened - the worst case scenario.&lt;/p&gt;\n\n&lt;p&gt;The problem with the real estate market collapsing was &lt;em&gt;not&lt;/em&gt; that we lost money (though we did still save compared to renting, but it was maybe a thousand dollars at best). It was that we couldn&amp;#39;t sell the house. So, we had this albatross around our neck for 3 years that kept us from moving on with our lives in our new location.&lt;/p&gt;\n\n&lt;p&gt;It is hard to describe how much it drags you down owning a home you don&amp;#39;t live in but...&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;You are paying substantial RE taxes every year&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;You are paying the mortgage&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;You still have to pay minimal utilities.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;You have to pay for security or someone to check on it at least every other day.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;You are technically in violation of your homeowners insurance. While it is an urban myth that HO insurance will deny a claim for DIY work without a permit. They most certainly will deny a claim related to a property being vacant. If someone steals your plumbing and the house is found vacant - they will deny this claim.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Even if you can find renters, a property management company takes a 15-30% cut depending on the amount of ongoing maintenance.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;My advice - buy a RV or become a van dweller like you mentioned. Buying a house is for when you have things figured out and plan to stick around for at least 10+ years. Otherwise, buy a van and live free.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgdly88", "score_hidden": false, "stickied": false, "created": 1492471177.0, "created_utc": 1492442377.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd3ij5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ScapegoatZovc", "parent_id": "t1_dgd2dmb", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Thanks for the suggestion. It's similar to /u/evenstarauror's and I replied to them as well.\n\nRegarding what I want out of my life: all I can say is I'm searching for it. I'm trying to figure out what's within reach that will help me keep pursuing the things I enjoy the most.\n\nA house would be passive income which makes life easier overall.\n\nA 'tiny house on wheels' is more attainable and would generally be cheaper than continuing to rent. Kind of a sketchy lifestyle, illegal in some cases.\n\nTraveling is the biggest gambit. Most of the places within the US I've traveled to I've liked much more than where I live, but I didn't have to do the grind of working so it could just have been that. There's no feasible monetary return on travel, and unless I'm moving somewhere like Thailand where everything is tremendously cheaper, it's not really a way to save money.\n\nRegarding travel and Thailand, I am tentatively planning to visit some time this year to see how I *actually* feel about one or both of those.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the suggestion. It&amp;#39;s similar to &lt;a href=\"/u/evenstarauror\"&gt;/u/evenstarauror&lt;/a&gt;&amp;#39;s and I replied to them as well.&lt;/p&gt;\n\n&lt;p&gt;Regarding what I want out of my life: all I can say is I&amp;#39;m searching for it. I&amp;#39;m trying to figure out what&amp;#39;s within reach that will help me keep pursuing the things I enjoy the most.&lt;/p&gt;\n\n&lt;p&gt;A house would be passive income which makes life easier overall.&lt;/p&gt;\n\n&lt;p&gt;A &amp;#39;tiny house on wheels&amp;#39; is more attainable and would generally be cheaper than continuing to rent. Kind of a sketchy lifestyle, illegal in some cases.&lt;/p&gt;\n\n&lt;p&gt;Traveling is the biggest gambit. Most of the places within the US I&amp;#39;ve traveled to I&amp;#39;ve liked much more than where I live, but I didn&amp;#39;t have to do the grind of working so it could just have been that. There&amp;#39;s no feasible monetary return on travel, and unless I&amp;#39;m moving somewhere like Thailand where everything is tremendously cheaper, it&amp;#39;s not really a way to save money.&lt;/p&gt;\n\n&lt;p&gt;Regarding travel and Thailand, I am tentatively planning to visit some time this year to see how I &lt;em&gt;actually&lt;/em&gt; feel about one or both of those.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd3ij5", "score_hidden": false, "stickied": false, "created": 1492431454.0, "created_utc": 1492402654.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2dmb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Boats_Bars_Beaches", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "If you really wanted to live in this neighborhood I would add 15k to the buy price for demolition of this structure and then price out prefab houses. They have come a long way in the last 10 years and are probably your cheapest option. That being said I think you really need to figure out what you want out of life in the next 3-5 years. You're talking about 2-3 completely different options. Moving overseas, traveling nomad, and home owner are completely different experiences. For what it's worth, most people I've talked to that have traveled extensively don't regret their decision but that's totally interdependent. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you really wanted to live in this neighborhood I would add 15k to the buy price for demolition of this structure and then price out prefab houses. They have come a long way in the last 10 years and are probably your cheapest option. That being said I think you really need to figure out what you want out of life in the next 3-5 years. You&amp;#39;re talking about 2-3 completely different options. Moving overseas, traveling nomad, and home owner are completely different experiences. For what it&amp;#39;s worth, most people I&amp;#39;ve talked to that have traveled extensively don&amp;#39;t regret their decision but that&amp;#39;s totally interdependent. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd2dmb", "score_hidden": false, "stickied": false, "created": 1492429607.0, "created_utc": 1492400807.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgcyke2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ritchie70", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "There are a ton of things that would make me say \"heck no\" but the important thing is going to be to get under that house and see how things look. The structure and foundation is what's going to really kill you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are a ton of things that would make me say &amp;quot;heck no&amp;quot; but the important thing is going to be to get under that house and see how things look. The structure and foundation is what&amp;#39;s going to really kill you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgcyke2", "score_hidden": false, "stickied": false, "created": 1492424160.0, "created_utc": 1492395360.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgdj3md", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "funchy", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "The home needs a LOT of work.  I could be mistaken but i think it's  a lot older than 40-50 years.  That goofy addition on the back might be the part that's 50 years?   Researching old tax records should give an actual age when the original part of the house was first built .\n\nI'm skeptical that it was rented for a lot of money any time in the past decade.  Doesn't matter anyway because youre buying it for yourself not an investment property.  Think about it:  if it was generating so much rental income, a local investor would've already bought it.  \n\nYou may have trouble qualifying for a regular home loan when their appraiser walks through.  Bank is going to want to see good cash reserves to show you have the resources to repair the house.\n\nBank is going to require you get homeowners insurance.  I can't speak for your area but here they want photos and possibly a walk though before underwriting a new policy.  They can demand safety issues be fixed immediately before theyll issue the policy.  \n\nBefore you buy any house, get a home inspection done.\n\nMy opinion:  get a nice used RV.  Dont try to make a rv from a box truck given your situation.  You want to travel and arent sure where you want to settle down so something mobile makes more sense. All you know is you want something to call home.    Or just rent?  Then you can relocate somewhat easily.  A rv or box truck will only depreciate in value.  That house may need so much work that it can easily cost more than the property would be worth.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The home needs a LOT of work.  I could be mistaken but i think it&amp;#39;s  a lot older than 40-50 years.  That goofy addition on the back might be the part that&amp;#39;s 50 years?   Researching old tax records should give an actual age when the original part of the house was first built .&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m skeptical that it was rented for a lot of money any time in the past decade.  Doesn&amp;#39;t matter anyway because youre buying it for yourself not an investment property.  Think about it:  if it was generating so much rental income, a local investor would&amp;#39;ve already bought it.  &lt;/p&gt;\n\n&lt;p&gt;You may have trouble qualifying for a regular home loan when their appraiser walks through.  Bank is going to want to see good cash reserves to show you have the resources to repair the house.&lt;/p&gt;\n\n&lt;p&gt;Bank is going to require you get homeowners insurance.  I can&amp;#39;t speak for your area but here they want photos and possibly a walk though before underwriting a new policy.  They can demand safety issues be fixed immediately before theyll issue the policy.  &lt;/p&gt;\n\n&lt;p&gt;Before you buy any house, get a home inspection done.&lt;/p&gt;\n\n&lt;p&gt;My opinion:  get a nice used RV.  Dont try to make a rv from a box truck given your situation.  You want to travel and arent sure where you want to settle down so something mobile makes more sense. All you know is you want something to call home.    Or just rent?  Then you can relocate somewhat easily.  A rv or box truck will only depreciate in value.  That house may need so much work that it can easily cost more than the property would be worth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgdj3md", "score_hidden": false, "stickied": false, "created": 1492467518.0, "created_utc": 1492438718.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgdf5r1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "guinader", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "Read title was going to say\" every home can be salvaged...\" But then i clicked the pictures and though \" why would you want to salvage anything?\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Read title was going to say&amp;quot; every home can be salvaged...&amp;quot; But then i clicked the pictures and though &amp;quot; why would you want to salvage anything?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgdf5r1", "score_hidden": false, "stickied": false, "created": 1492461122.0, "created_utc": 1492432322.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ql97", "removal_reason": null, "link_id": "t3_65ryin", "likes": null, "replies": "", "user_reports": [], "id": "dgd9d8v", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ZippyTheChicken", "parent_id": "t3_65ryin", "subreddit_name_prefixed": "r/HomeImprovement", "controversiality": 0, "body": "new windows and doors   \nvinyl siding  and some exterior patching\n\nThe interior is basically a complete tare out \n\nNew Electrical   \nNew Plumbing  \nNew Flooring  \n\nI mean it depends you know... you can do the demolition yourself and hanging siding is pretty dam simple.... flooring will depend on what you put down.\n\nIts a lot of money in the end and what are you going to get back from it? IDK\n\nDoing the work isn't the hard part .. affording the work and getting a profit when you are done is the problem. \n\nHouses are pretty close together .. is it a nice neighborhood and this is the crappiest house? or is this the standard? .. if this isn't the neighborhood eye sore then you won't be turning a profit off it.\n\ndo the numbers..\n\nmaybe you can rent it but renting to people is a bitch because people are crazy .. they will tare your home apart.\n\ngood luck\n\nIf I could get that insanely cheap I would put 30 days into it and sell it or rent it and have the rent pay the mortgage ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;new windows and doors&lt;br/&gt;\nvinyl siding  and some exterior patching&lt;/p&gt;\n\n&lt;p&gt;The interior is basically a complete tare out &lt;/p&gt;\n\n&lt;p&gt;New Electrical&lt;br/&gt;\nNew Plumbing&lt;br/&gt;\nNew Flooring  &lt;/p&gt;\n\n&lt;p&gt;I mean it depends you know... you can do the demolition yourself and hanging siding is pretty dam simple.... flooring will depend on what you put down.&lt;/p&gt;\n\n&lt;p&gt;Its a lot of money in the end and what are you going to get back from it? IDK&lt;/p&gt;\n\n&lt;p&gt;Doing the work isn&amp;#39;t the hard part .. affording the work and getting a profit when you are done is the problem. &lt;/p&gt;\n\n&lt;p&gt;Houses are pretty close together .. is it a nice neighborhood and this is the crappiest house? or is this the standard? .. if this isn&amp;#39;t the neighborhood eye sore then you won&amp;#39;t be turning a profit off it.&lt;/p&gt;\n\n&lt;p&gt;do the numbers..&lt;/p&gt;\n\n&lt;p&gt;maybe you can rent it but renting to people is a bitch because people are crazy .. they will tare your home apart.&lt;/p&gt;\n\n&lt;p&gt;good luck&lt;/p&gt;\n\n&lt;p&gt;If I could get that insanely cheap I would put 30 days into it and sell it or rent it and have the rent pay the mortgage &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "HomeImprovement", "name": "t1_dgd9d8v", "score_hidden": false, "stickied": false, "created": 1492444072.0, "created_utc": 1492415272.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]