[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LetsNotMeet", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is currently happening right now outside of my house and I thought I would share it while I wait for my parents to come home. Although I feel that I am not in any &lt;em&gt;considerable&lt;/em&gt; amounts of danger as I am a large, young male with a dog in the house in broad daylight this event has definitely shaken me and I&amp;#39;m currently contemplating the need to get the police involved.&lt;/p&gt;\n\n&lt;p&gt;It all started this morning at about 11am, I was just sitting in my living room watching television when I heard the sound of someone trying to open the front door. I had just thought that one of my family members got back from work early so I got up to help let them in when I noticed that the figure I noticed through the glass panel of my door was someone else &lt;strong&gt;really&lt;/strong&gt; close to the glass. My dog started getting protective rushing to the door (he does this all the time) and then the figure started to back away. Feeling confused I opened the door and stepped outside to see that there was an older lady (I would guess about mid 50) just standing there with her big bag by her side. She seemed strange but nothing to be overly concerned about, she just smelled filthy like she hadn&amp;#39;t showered in months and like she was hocked up on some drug or another. I asked her if I could help her and she just instantly perked up saying that she was a friend of my mum&amp;#39;s and if she could come inside. Having not heard anything about it from my mum, I left her outside and went back inside to talk to phone my mum about it and she said that she wasn&amp;#39;t expecting anyone, keeping her on the line I went back out and asked the lady for her name but she just got angrier and said she&amp;#39;s a friend of my mum and she&amp;#39;ll know who she is but when I refused she started screaming me down and demanding I let her in. I went back inside, threatened to call the police and just sat by the front door with my dog for what seemed like forever watching her face pinned against the glass staring at me. I don&amp;#39;t know how much time passed but she eventually moved away and then there was nothing for hours. &lt;/p&gt;\n\n&lt;p&gt;Fast forward to now and this is the situation that&amp;#39;s happening now. I went outside to take my dog for a walk and saw that she&amp;#39;d pissed herself on my doorstep. I was furious and said that I would just clean it up when I got back from the walk with my dog. I made sure to lock the front door and all the windows before taking my dog to the park to just temporarily forget about whatever the fuck was going on. When I walked I saw her standing at the far end of the alley next to my house, when she noticed me she started hobbling as fast as she could towards my front door. I sprinted with my dog to be her too it and as I shut the door I heard her screaming &amp;quot;please&amp;quot; but she didn&amp;#39;t sound as angry as she did before.&lt;/p&gt;\n\n&lt;p&gt;Typing this out I can still see her pacing in the alley next to my house. I think I will just call the police, and let my dad (he&amp;#39;s going to be the first one back) to be careful of the situation.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll post updates as events transpire, and will try my best to upload photos. I don&amp;#39;t want to do anything just yet in case I make her angry.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Update&lt;/strong&gt; This happened a couple days ago now, as the mods needed to approve it. The police were called in the end and she was taken away. As mentioned it&amp;#39;s highly likely that she had mental health issues so it doesn&amp;#39;t sit right with me to upload the photos. Hopefully she was taken back somewhere safe.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is currently happening right now outside of my house and I thought I would share it while I wait for my parents to come home. Although I feel that I am not in any *considerable* amounts of danger as I am a large, young male with a dog in the house in broad daylight this event has definitely shaken me and I'm currently contemplating the need to get the police involved.\n\nIt all started this morning at about 11am, I was just sitting in my living room watching television when I heard the sound of someone trying to open the front door. I had just thought that one of my family members got back from work early so I got up to help let them in when I noticed that the figure I noticed through the glass panel of my door was someone else **really** close to the glass. My dog started getting protective rushing to the door (he does this all the time) and then the figure started to back away. Feeling confused I opened the door and stepped outside to see that there was an older lady (I would guess about mid 50) just standing there with her big bag by her side. She seemed strange but nothing to be overly concerned about, she just smelled filthy like she hadn't showered in months and like she was hocked up on some drug or another. I asked her if I could help her and she just instantly perked up saying that she was a friend of my mum's and if she could come inside. Having not heard anything about it from my mum, I left her outside and went back inside to talk to phone my mum about it and she said that she wasn't expecting anyone, keeping her on the line I went back out and asked the lady for her name but she just got angrier and said she's a friend of my mum and she'll know who she is but when I refused she started screaming me down and demanding I let her in. I went back inside, threatened to call the police and just sat by the front door with my dog for what seemed like forever watching her face pinned against the glass staring at me. I don't know how much time passed but she eventually moved away and then there was nothing for hours. \n\nFast forward to now and this is the situation that's happening now. I went outside to take my dog for a walk and saw that she'd pissed herself on my doorstep. I was furious and said that I would just clean it up when I got back from the walk with my dog. I made sure to lock the front door and all the windows before taking my dog to the park to just temporarily forget about whatever the fuck was going on. When I walked I saw her standing at the far end of the alley next to my house, when she noticed me she started hobbling as fast as she could towards my front door. I sprinted with my dog to be her too it and as I shut the door I heard her screaming \"please\" but she didn't sound as angry as she did before.\n\nTyping this out I can still see her pacing in the alley next to my house. I think I will just call the police, and let my dad (he's going to be the first one back) to be careful of the situation.\n\nI'll post updates as events transpire, and will try my best to upload photos. I don't want to do anything just yet in case I make her angry.\n\n**Update** This happened a couple days ago now, as the mods needed to approve it. The police were called in the end and she was taken away. As mentioned it's highly likely that she had mental health issues so it doesn't sit right with me to upload the photos. Hopefully she was taken back somewhere safe.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Medium", "id": "64zh41", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "TrafalgarDLaw", "saved": false, "mod_reports": [], "name": "t3_64zh41", "subreddit_name_prefixed": "r/LetsNotMeet", "approved_by": null, "over_18": false, "domain": "self.LetsNotMeet", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2t3t8", "edited": 1492448459.0, "link_flair_css_class": "medium", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LetsNotMeet/comments/64zh41/there_is_a_creepy_lady_walking_round_my_house/", "num_reports": null, "locked": false, "stickied": false, "created": 1492045583.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/64zh41/there_is_a_creepy_lady_walking_round_my_house/", "author_flair_text": null, "quarantine": false, "title": "There is a creepy lady walking round my house right now that is trying to get in.", "created_utc": 1492016783.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_64zh41", "likes": null, "replies": "", "user_reports": [], "id": "dg669ze", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_64zh41", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "/u/TrafalgarDLaw\n\nYour submission has been removed because it appears to be a \"wall of text\". Please edit the submission and add some paragraph breaks by **pressing the enter key twice to create paragraph breaks**.\n\nAfter editing, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FLetsNotMeet&amp;subject=Wall of Text Removal&amp;message=My [submission](/r/LetsNotMeet/comments/64zh41/there_is_a_creepy_lady_walking_round_my_house/\\) was removed because it was a Wall of Text:). Ask for your post to be re-approved. This link should automatically add your submission link to the body of the text. Please understand that when you have edited, the post must be manually approved by a moderator. It **will not** be not auto-approved by AutoMod when it has been edited.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LetsNotMeet) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/TrafalgarDLaw\"&gt;/u/TrafalgarDLaw&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Your submission has been removed because it appears to be a &amp;quot;wall of text&amp;quot;. Please edit the submission and add some paragraph breaks by &lt;strong&gt;pressing the enter key twice to create paragraph breaks&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;After editing, please &lt;a href=\"https://www.reddit.com/message/compose?to=%2Fr%2FLetsNotMeet&amp;amp;subject=Wall%20of%20Text%20Removal&amp;amp;message=My%20%5Bsubmission%5D(/r/LetsNotMeet/comments/64zh41/there_is_a_creepy_lady_walking_round_my_house/)%20was%20removed%20because%20it%20was%20a%20Wall%20of%20Text:\"&gt;message the moderators&lt;/a&gt;. Ask for your post to be re-approved. This link should automatically add your submission link to the body of the text. Please understand that when you have edited, the post must be manually approved by a moderator. It &lt;strong&gt;will not&lt;/strong&gt; be not auto-approved by AutoMod when it has been edited.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/LetsNotMeet\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dg669ze", "score_hidden": false, "stickied": false, "created": 1492045584.0, "created_utc": 1492016784.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_64zh41", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_64zh41", "likes": null, "replies": "", "user_reports": [], "id": "dgdr4n5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TrafalgarDLaw", "parent_id": "t1_dgdqz5b", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "That's OK, thankfully it's all sorted now. I did call the cops and they did say they'd take her to her home/ to get help. I'm not gonna upload any pictures for privacy reasons but it was really freaky.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s OK, thankfully it&amp;#39;s all sorted now. I did call the cops and they did say they&amp;#39;d take her to her home/ to get help. I&amp;#39;m not gonna upload any pictures for privacy reasons but it was really freaky.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgdr4n5", "score_hidden": false, "stickied": false, "created": 1492477043.0, "created_utc": 1492448243.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqz5b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Blais_Of_Glory", "parent_id": "t3_64zh41", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "I would suggest calling the police. It sounds like the old lady may have dementia or another illness and needs help. A family down the street had a grandmother who had dementia and she would sometimes escape and wander around the neighborhood and be very confused. It's very sad for everyone involved. I hope she gets help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would suggest calling the police. It sounds like the old lady may have dementia or another illness and needs help. A family down the street had a grandmother who had dementia and she would sometimes escape and wander around the neighborhood and be very confused. It&amp;#39;s very sad for everyone involved. I hope she gets help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgdqz5b", "score_hidden": false, "stickied": false, "created": 1492476871.0, "created_utc": 1492448071.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_64zh41", "likes": null, "replies": "", "user_reports": [], "id": "dgdsd32", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheExplosiveCherry", "parent_id": "t3_64zh41", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "Crazy people suck. I kinda wish your mom had come while she was at your door and see how she defended herself getting into your home then", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Crazy people suck. I kinda wish your mom had come while she was at your door and see how she defended herself getting into your home then&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgdsd32", "score_hidden": false, "stickied": false, "created": 1492478419.0, "created_utc": 1492449619.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]