[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LetsNotMeet", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Heard about this page from a friend thought I would share my story. A bit of background:&lt;/p&gt;\n\n&lt;p&gt;I live in the north west of England in a small town surrounded by farmers’ fields. When my friends and I were in high school around 14-15 we used to think it was cool to pull all-nighters on summer nights and do random things. I also used to have this obsession with spies when I was in school and had always wanted to work for MI5, I know it sounds lame but I read lots of books from real life spies and copied many things they did.\nNow to the story:&lt;/p&gt;\n\n&lt;p&gt;Our last ever all-nighter started out like they all did; with us plotting what we would do about 3 days in advance. One of my friends had recently got a girlfriend and told us that on Friday he was heading over to a party in a neighbouring village. The party was held by his girlfriend’s friend in a field near her house. There would be booze and chicks so we all thought that was better than strolling the streets at night as we usually did.\nFriday came around and we told our parents we were staying at each other’s houses as we usually did and met up at a park on the outskirts of town around 10pm. There were 6 of us there and for reference in the story we will call them tom, Fred, Greg, James and Ron. We hung out on the park for a few hours chatting, bantering each other and trying to contact our friend who was already at the party, however he was ignoring us. As the time approached around 11:30ish I noticed a car was parked on the car park near us. Nobody was inside but this struck me as strange as we always used to come here and I had never seen cars before. Since all the spy stuff I used to read conditioned me to take note of strange things I made a point of remembering the make, colour and plate number.&lt;/p&gt;\n\n&lt;p&gt;Time went on to about 12:30am and we gave up trying to contact our friend who had clearly ditched us for some girl and instead we thought it would be fun to just gate crash the party. We knew it was in the small neighbouring village and that they were in a field drinking, so they would have been loud enough to hear. We were about to set off when Greg and Ron decided they wanted to go home and couldn&amp;#39;t be bothered walking with us to the party. So the four of us set off and it is keen to note that the only road to the neighbouring village was a dark country lane, wide enough for about 1 and a half cars, with no path and no lights. It was cloudy and pitch black and this was a time when cell phones were not widely common and only two of us had one.&lt;/p&gt;\n\n&lt;p&gt;About halfway through the journey we noticed lights behind us so we had to dive into the hedges to avoid being squashed. As the car passed and headed off into the distance I noticed the liscence plate was the same one from the park. This made me uneasy for the time of night, however I thought about it and from the park there were only two ways he could have gone, this being one of them, so I quickly shook the feeling off. After about an hour and a half of walking we made it to the village and it looked like a ghost town. It was so quiet and eerie, not a sound could be heard. Every building was set far back from the main road in the village and the only lights were a few old dim street lamps, that were pretty much useless.&lt;/p&gt;\n\n&lt;p&gt;We thought we would just start walking down the road and turning off into the fields and search them one by one. To paint the picture in your head imagine looking down a straight road, on your right were the houses set far back with fields behind them. On the left-hand side of the road were just fields. We started on our left-hand side assuming that if they were drinking they wouldn&amp;#39;t go in their own back fields. After searching a few of them to no avail, I noticed a car up the road turn into an entrance on our side. Eventually we made our way up to this entrance and it was another car park, whith about 4 cars parked. I was looking at each one and thats when I saw it. The same car that was parked in our town when we were at the park. There was no one inside and I thought to myself this cannot be a coincidence, it was about 2am for fucks sake.&lt;/p&gt;\n\n&lt;p&gt;The car park we were in ran onto a field and because it was so dark we could faintly make out thin structures in the distance so before I could tell my them, my friends shouted &amp;quot;its them&amp;quot; and took off running towards far edge of the field. After sprinting to catch up I noticed they were all stopped as the realisation came to me that there was a cemetery at the end of the field. I was so creepy, especially after seeing that car parked nearby so I suggested we try a few fields over because the scary looking angel statues put on edge. My friends agreed so we went back to the road and skipped a field, I must have been tired or something because I completely forgot about the car.&lt;/p&gt;\n\n&lt;p&gt;The next field we went in was very long and as we neared the edge of it, Tom thought he heard talking in one of the adjacent fields but it was so dark we couldn’t see anything. We thought we were nearing them and that they had heard us coming so quietened down to hope we wouldn’t find them. James who had a phone thought that we should call them and see if we hear their cell phones go off so we would know which field they were in. Everyone fell silent as we tried to listen out for the ring tone.\nThis is where it gets creepy, I don’t know what it was and to this day I have never heard a sound so terrifying in my life. It came from the bushes on the side of the cemetery we had skipped and sounded like a goat crossed with a man, the sound was deep and was followed by a deep cry, sort of like a painful wail. The bushes rumbled and all I could hear was the screaming of my friends and Fred, we all hauled ass out of that field. I have never run so fast in my life, like Hussain bolt on speed! As I ran through the darkness I couldn’t see anything only the faint glow of the street lamp by the road getting closer and the sound of the creep in the bushes getting fainter. James made it out first, then me and then Tom. I looked back but I couldn’t see Fred, I froze at the entrance and just stared into the darkness, thoughts raced through my mind like what if he got caught, what if he’s dead. Eventually I saw a shadowy figure emerge and it was Fred hobbling out of the field. We grouped by the street lamp and checked his leg, it was bleeding. Whatever was in the bushes it attacked him and my only thought was we have to get out of here.&lt;/p&gt;\n\n&lt;p&gt;We began to briskly walk back towards the direction of our home town and jsut before we turned to get onto the country road towards home I looked back and saw man standing under the street lamp we were just at. I couldn’t see any of his features just the outline of him, I couldn’t make out if he was coming towards us or away but I knew he doing one of them. I screamed to my friends and we starting jogging but Fred was hurt and he had to make do with a sort of hobble skipping motion. We walked fast, back down the country road, it felt darker than the last time and we were all shaken from our encounter. Anytime someone tried to talk they were quickly silenced and things were so tense, we were scared, angry and so tired at around 2:30am\nAbout 5 mins into the journey home I saw some lights behind us, we all darted into the bushes so as not to be seen and drove passed. I didn’t make out the licence plate but I knew it was the car from before because it had very distinctive back lights on it that I recognised. I still hadn&amp;#39;t told the others about the car and it seemed like the worst time to tell them as they wouldn&amp;#39;t listen to each other. About 15 mins later I saw some lights coming towards us so we hopped back into the bushes, it passed again and I noticed it was the same car. This freak was definitely looking for us. Again about 10mins later like more lights behind us, so we hid and did the same about another 10 mins later when we saw it again.&lt;/p&gt;\n\n&lt;p&gt;We were coming up to our town and luckily it hadn’t come back for a third time, we decided to go to into our town centre as by then it was it was around 4am and we were tired. It was getting lighter so we wanted to have a look at Fred’s leg. It was a nasty cut that later required stitching. Once we were all in town we just started pouring out our shared experience going over the details of each other’s point of view and who we thought it was and why they were there. I told them about the car and what I thought had happened. They didn’t even notice it was the same one coming back around each time. We never did tell our parents what happened, Fred told his that he fell and cut it on the way home. So, to the creepy guy stalking us and attacking us from the bushes... let&amp;#39;s not meet.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Heard about this page from a friend thought I would share my story. A bit of background:\n\n\nI live in the north west of England in a small town surrounded by farmers’ fields. When my friends and I were in high school around 14-15 we used to think it was cool to pull all-nighters on summer nights and do random things. I also used to have this obsession with spies when I was in school and had always wanted to work for MI5, I know it sounds lame but I read lots of books from real life spies and copied many things they did.\nNow to the story:\n\n\nOur last ever all-nighter started out like they all did; with us plotting what we would do about 3 days in advance. One of my friends had recently got a girlfriend and told us that on Friday he was heading over to a party in a neighbouring village. The party was held by his girlfriend’s friend in a field near her house. There would be booze and chicks so we all thought that was better than strolling the streets at night as we usually did.\nFriday came around and we told our parents we were staying at each other’s houses as we usually did and met up at a park on the outskirts of town around 10pm. There were 6 of us there and for reference in the story we will call them tom, Fred, Greg, James and Ron. We hung out on the park for a few hours chatting, bantering each other and trying to contact our friend who was already at the party, however he was ignoring us. As the time approached around 11:30ish I noticed a car was parked on the car park near us. Nobody was inside but this struck me as strange as we always used to come here and I had never seen cars before. Since all the spy stuff I used to read conditioned me to take note of strange things I made a point of remembering the make, colour and plate number.\n\n\nTime went on to about 12:30am and we gave up trying to contact our friend who had clearly ditched us for some girl and instead we thought it would be fun to just gate crash the party. We knew it was in the small neighbouring village and that they were in a field drinking, so they would have been loud enough to hear. We were about to set off when Greg and Ron decided they wanted to go home and couldn't be bothered walking with us to the party. So the four of us set off and it is keen to note that the only road to the neighbouring village was a dark country lane, wide enough for about 1 and a half cars, with no path and no lights. It was cloudy and pitch black and this was a time when cell phones were not widely common and only two of us had one.\n\n\nAbout halfway through the journey we noticed lights behind us so we had to dive into the hedges to avoid being squashed. As the car passed and headed off into the distance I noticed the liscence plate was the same one from the park. This made me uneasy for the time of night, however I thought about it and from the park there were only two ways he could have gone, this being one of them, so I quickly shook the feeling off. After about an hour and a half of walking we made it to the village and it looked like a ghost town. It was so quiet and eerie, not a sound could be heard. Every building was set far back from the main road in the village and the only lights were a few old dim street lamps, that were pretty much useless.\n\n\nWe thought we would just start walking down the road and turning off into the fields and search them one by one. To paint the picture in your head imagine looking down a straight road, on your right were the houses set far back with fields behind them. On the left-hand side of the road were just fields. We started on our left-hand side assuming that if they were drinking they wouldn't go in their own back fields. After searching a few of them to no avail, I noticed a car up the road turn into an entrance on our side. Eventually we made our way up to this entrance and it was another car park, whith about 4 cars parked. I was looking at each one and thats when I saw it. The same car that was parked in our town when we were at the park. There was no one inside and I thought to myself this cannot be a coincidence, it was about 2am for fucks sake.\n\n\nThe car park we were in ran onto a field and because it was so dark we could faintly make out thin structures in the distance so before I could tell my them, my friends shouted \"its them\" and took off running towards far edge of the field. After sprinting to catch up I noticed they were all stopped as the realisation came to me that there was a cemetery at the end of the field. I was so creepy, especially after seeing that car parked nearby so I suggested we try a few fields over because the scary looking angel statues put on edge. My friends agreed so we went back to the road and skipped a field, I must have been tired or something because I completely forgot about the car.\n\n\nThe next field we went in was very long and as we neared the edge of it, Tom thought he heard talking in one of the adjacent fields but it was so dark we couldn’t see anything. We thought we were nearing them and that they had heard us coming so quietened down to hope we wouldn’t find them. James who had a phone thought that we should call them and see if we hear their cell phones go off so we would know which field they were in. Everyone fell silent as we tried to listen out for the ring tone.\nThis is where it gets creepy, I don’t know what it was and to this day I have never heard a sound so terrifying in my life. It came from the bushes on the side of the cemetery we had skipped and sounded like a goat crossed with a man, the sound was deep and was followed by a deep cry, sort of like a painful wail. The bushes rumbled and all I could hear was the screaming of my friends and Fred, we all hauled ass out of that field. I have never run so fast in my life, like Hussain bolt on speed! As I ran through the darkness I couldn’t see anything only the faint glow of the street lamp by the road getting closer and the sound of the creep in the bushes getting fainter. James made it out first, then me and then Tom. I looked back but I couldn’t see Fred, I froze at the entrance and just stared into the darkness, thoughts raced through my mind like what if he got caught, what if he’s dead. Eventually I saw a shadowy figure emerge and it was Fred hobbling out of the field. We grouped by the street lamp and checked his leg, it was bleeding. Whatever was in the bushes it attacked him and my only thought was we have to get out of here.\n\n\nWe began to briskly walk back towards the direction of our home town and jsut before we turned to get onto the country road towards home I looked back and saw man standing under the street lamp we were just at. I couldn’t see any of his features just the outline of him, I couldn’t make out if he was coming towards us or away but I knew he doing one of them. I screamed to my friends and we starting jogging but Fred was hurt and he had to make do with a sort of hobble skipping motion. We walked fast, back down the country road, it felt darker than the last time and we were all shaken from our encounter. Anytime someone tried to talk they were quickly silenced and things were so tense, we were scared, angry and so tired at around 2:30am\nAbout 5 mins into the journey home I saw some lights behind us, we all darted into the bushes so as not to be seen and drove passed. I didn’t make out the licence plate but I knew it was the car from before because it had very distinctive back lights on it that I recognised. I still hadn't told the others about the car and it seemed like the worst time to tell them as they wouldn't listen to each other. About 15 mins later I saw some lights coming towards us so we hopped back into the bushes, it passed again and I noticed it was the same car. This freak was definitely looking for us. Again about 10mins later like more lights behind us, so we hid and did the same about another 10 mins later when we saw it again.\n\n\nWe were coming up to our town and luckily it hadn’t come back for a third time, we decided to go to into our town centre as by then it was it was around 4am and we were tired. It was getting lighter so we wanted to have a look at Fred’s leg. It was a nasty cut that later required stitching. Once we were all in town we just started pouring out our shared experience going over the details of each other’s point of view and who we thought it was and why they were there. I told them about the car and what I thought had happened. They didn’t even notice it was the same one coming back around each time. We never did tell our parents what happened, Fred told his that he fell and cut it on the way home. So, to the creepy guy stalking us and attacking us from the bushes... let's not meet.\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6587rk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "Yabberdabberdooo", "saved": false, "mod_reports": [], "name": "t3_6587rk", "subreddit_name_prefixed": "r/LetsNotMeet", "approved_by": null, "over_18": false, "domain": "self.LetsNotMeet", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2t3t8", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LetsNotMeet/comments/6587rk/fields/", "num_reports": null, "locked": false, "stickied": false, "created": 1492145387.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/6587rk/fields/", "author_flair_text": null, "quarantine": false, "title": "Fields", "created_utc": 1492116587.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_6587rk", "likes": null, "replies": "", "user_reports": [], "id": "dg87b9w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_6587rk", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "/u/Yabberdabberdooo\n\nYour submission has been removed because it appears to be a \"wall of text\". Please edit the submission and add some paragraph breaks by **pressing the enter key twice to create paragraph breaks**.\n\nAfter editing, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FLetsNotMeet&amp;subject=Wall of Text Removal&amp;message=My [submission](/r/LetsNotMeet/comments/6587rk/fields/\\) was removed because it was a Wall of Text:). Ask for your post to be re-approved. This link should automatically add your submission link to the body of the text. Please understand that when you have edited, the post must be manually approved by a moderator. It **will not** be not auto-approved by AutoMod when it has been edited.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LetsNotMeet) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/Yabberdabberdooo\"&gt;/u/Yabberdabberdooo&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Your submission has been removed because it appears to be a &amp;quot;wall of text&amp;quot;. Please edit the submission and add some paragraph breaks by &lt;strong&gt;pressing the enter key twice to create paragraph breaks&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;After editing, please &lt;a href=\"https://www.reddit.com/message/compose?to=%2Fr%2FLetsNotMeet&amp;amp;subject=Wall%20of%20Text%20Removal&amp;amp;message=My%20%5Bsubmission%5D(/r/LetsNotMeet/comments/6587rk/fields/)%20was%20removed%20because%20it%20was%20a%20Wall%20of%20Text:\"&gt;message the moderators&lt;/a&gt;. Ask for your post to be re-approved. This link should automatically add your submission link to the body of the text. Please understand that when you have edited, the post must be manually approved by a moderator. It &lt;strong&gt;will not&lt;/strong&gt; be not auto-approved by AutoMod when it has been edited.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/LetsNotMeet\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dg87b9w", "score_hidden": false, "stickied": false, "created": 1492145387.0, "created_utc": 1492116587.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_6587rk", "likes": null, "replies": "", "user_reports": [], "id": "dgdyup6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EvelynGarnet", "parent_id": "t3_6587rk", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "So what's your friend's side of the story--the one with the girlfriend?  Any personal theories on the creeper car?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So what&amp;#39;s your friend&amp;#39;s side of the story--the one with the girlfriend?  Any personal theories on the creeper car?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgdyup6", "score_hidden": false, "stickied": false, "created": 1492485681.0, "created_utc": 1492456881.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]