[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LetsNotMeet", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;On October of 2016, a long time family friend began harassing my family. So, I&amp;#39;ve known this guy since I was around 5. He worked at my dad&amp;#39;s friend&amp;#39;s car dealership as the person who basically maintenances the exteriors (washes the cars, shines them, etc.) My parents became fond of him because he looked very sweet, and they rather felt pity for him as he had horrible hygiene habits. They&amp;#39;d often buy him food, gift him clothes, and things of that sort. &lt;/p&gt;\n\n&lt;p&gt;Around 2015 this man gets a job right across the street from my mom&amp;#39;s job. He saw my mom one morning and they just waved at each other. This man starts calling my mom frequently. Now, my mom is extremely nice, &lt;em&gt;too&lt;/em&gt; nice, so instead of just not picking up, she would talk to him. This guy becomes obsessed with my mom to the point she tells him to STOP contacting her (around May of 2016). All is well, guy stops contacting mom. &lt;/p&gt;\n\n&lt;p&gt;Months later he began to watch my mom. He would park his car in front of my mom&amp;#39;s job and watch her. She noticed him but she never saw it as a huge threat, so she never said anything. That&amp;#39;s where things escalate. &lt;/p&gt;\n\n&lt;p&gt;My mom was walking out of work with a co-worker one day, normal co-worker friendship. My mom catches a ride with her co-worker to a mandatory work event, so she wouldn&amp;#39;t have to drive home too late as these events end late at night. Meanwhile, the guy is watching them walk to his car. He suddenly thinks that my mom is having an affair with this guy and decides to follow them. They arrive at the place and my mom stays in the car while her co-worker goes inside to check if its the right location. The stalker walks up to the car, opens the door, slaps my mom, grabs a knife from his car, and slashes the co-workers tires. My mom is in complete shock, and immediately calls her co-worker to come outside. The co-worker decides to not press any charges against him, even though he easily could, as there were cameras outside the location. Now, my mom mentions none of this to my dad because my dad is really explosive, to the point that he will get in trouble over this guy. &lt;/p&gt;\n\n&lt;p&gt;So, everything is okay for a couple of days, until this guy starts calling my mom non-stop and leaving her threatening voicemails. \nThe voicemails said things along the lines of &amp;quot;If you don&amp;#39;t meet me up at a hotel on Wednesday at 1 PM, I&amp;#39;m going to tell your husband you&amp;#39;re cheating on him.&amp;quot; This scares my mom because my dad has a past with domestic violence, so she&amp;#39;s scared my dad will believe him and beat her. Wednesday comes along and when she gets to work he is outside watching her, whole day watching her. She calls my grandparents (they&amp;#39;re not old farts), as my grandpa is an ex-military, ex-judoka, and is no one to play with. They immediately drive to my moms job, but this guy starts harassing my grandparents, and won&amp;#39;t leave my moms job. 1 PM comes around and my mom calls the police. Dude hauls across the street and hides, leaving his car at my moms job. Police search for him everywhere, and he&amp;#39;s nowhere to be found. &lt;/p&gt;\n\n&lt;p&gt;The phone calls continue and things escalate. This man decides to vandalize my mom&amp;#39;s car. He throws tar all over my moms car while the car is parked outside my house. Car is destroyed and my parents have to pay lots of money to be able to fix it. At this point, my dad knows of the whole ordeal, and is set on killing this guy. We advise him to calm down because my mom is planning on getting a restraining order from him, and she didn&amp;#39;t want my dad to ruin her chances or commit a crime. &lt;/p&gt;\n\n&lt;p&gt;He continues calling and stands outside my moms job everyday. This man starts driving by my house everyday, and begins to see me as a target. He leaves my mom a threatening voice-mail saying he is going to vandalize my car, so at this point I&amp;#39;m even more terrified. At this point in the story, my mom has had to call the cops on him several times, but the cops say they can&amp;#39;t do anything as he hasn&amp;#39;t physically attacked her. My mom decides she&amp;#39;s going to finally petition for the restraining order, with the police reports and voicemails as proof. They set up a court date, and give my mom a temporary restraining order until the court date, so approximately 2 weeks. &lt;/p&gt;\n\n&lt;p&gt;This guy does not stop calling my mom, so my mom calls the detective in charge of her case, and the guy hasn&amp;#39;t even been served with the restraining order yet (few days before the court date). He was notified with the court date, though, so he tells my mom he has proof that &lt;em&gt;she&lt;/em&gt; won&amp;#39;t stop calling him. &lt;/p&gt;\n\n&lt;p&gt;He then starts targeting the rest of us. I wake up one Saturday morning, and my car has letters drawn all over the windows with nail polish. Luckily, we were able to just scrape it off gently, but by now I am a nervous wreck. I start doing bad in my classes, and I hadn&amp;#39;t slept for about a month. He then begins to harass my dad with voice-mails and phone calls, but luckily my dad didn&amp;#39;t buy any of his bs. &lt;/p&gt;\n\n&lt;p&gt;Finally, the court date arrives. This man shows up with his step-son, and his step-son starts talking shit to my mom, because of course he only knows this mans side of the story. The judge calls them in and does the usual questioning, talks about police reports, etc. The judge asks him if he has anything to say or show. He says &amp;quot;Yes, I have a phone bill that shows she called me more than 200 times in the past month.&amp;quot; The judge says &amp;quot;Okay, show me.&amp;quot; Guess what, he didn&amp;#39;t bring it. There&amp;#39;s no such thing. Judge nods her head and says &amp;quot;Okay, I reached the verdict.&amp;quot; He was found guilty, and my mom was awarded a restraining order for life. We finally have peace in our family again. &lt;/p&gt;\n\n&lt;p&gt;So, family stalker, fuck you. Let&amp;#39;s NOT meet again. &lt;/p&gt;\n\n&lt;p&gt;Edit: Just want to tell people who might be in similar situations to please go to the police ASAP. The danger and the emotional torture is not worth it. Sometimes they won&amp;#39;t go away, like we thought this guy would. We took too long to take action.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "On October of 2016, a long time family friend began harassing my family. So, I've known this guy since I was around 5. He worked at my dad's friend's car dealership as the person who basically maintenances the exteriors (washes the cars, shines them, etc.) My parents became fond of him because he looked very sweet, and they rather felt pity for him as he had horrible hygiene habits. They'd often buy him food, gift him clothes, and things of that sort. \n\nAround 2015 this man gets a job right across the street from my mom's job. He saw my mom one morning and they just waved at each other. This man starts calling my mom frequently. Now, my mom is extremely nice, *too* nice, so instead of just not picking up, she would talk to him. This guy becomes obsessed with my mom to the point she tells him to STOP contacting her (around May of 2016). All is well, guy stops contacting mom. \n\nMonths later he began to watch my mom. He would park his car in front of my mom's job and watch her. She noticed him but she never saw it as a huge threat, so she never said anything. That's where things escalate. \n\nMy mom was walking out of work with a co-worker one day, normal co-worker friendship. My mom catches a ride with her co-worker to a mandatory work event, so she wouldn't have to drive home too late as these events end late at night. Meanwhile, the guy is watching them walk to his car. He suddenly thinks that my mom is having an affair with this guy and decides to follow them. They arrive at the place and my mom stays in the car while her co-worker goes inside to check if its the right location. The stalker walks up to the car, opens the door, slaps my mom, grabs a knife from his car, and slashes the co-workers tires. My mom is in complete shock, and immediately calls her co-worker to come outside. The co-worker decides to not press any charges against him, even though he easily could, as there were cameras outside the location. Now, my mom mentions none of this to my dad because my dad is really explosive, to the point that he will get in trouble over this guy. \n\nSo, everything is okay for a couple of days, until this guy starts calling my mom non-stop and leaving her threatening voicemails. \nThe voicemails said things along the lines of \"If you don't meet me up at a hotel on Wednesday at 1 PM, I'm going to tell your husband you're cheating on him.\" This scares my mom because my dad has a past with domestic violence, so she's scared my dad will believe him and beat her. Wednesday comes along and when she gets to work he is outside watching her, whole day watching her. She calls my grandparents (they're not old farts), as my grandpa is an ex-military, ex-judoka, and is no one to play with. They immediately drive to my moms job, but this guy starts harassing my grandparents, and won't leave my moms job. 1 PM comes around and my mom calls the police. Dude hauls across the street and hides, leaving his car at my moms job. Police search for him everywhere, and he's nowhere to be found. \n\nThe phone calls continue and things escalate. This man decides to vandalize my mom's car. He throws tar all over my moms car while the car is parked outside my house. Car is destroyed and my parents have to pay lots of money to be able to fix it. At this point, my dad knows of the whole ordeal, and is set on killing this guy. We advise him to calm down because my mom is planning on getting a restraining order from him, and she didn't want my dad to ruin her chances or commit a crime. \n\nHe continues calling and stands outside my moms job everyday. This man starts driving by my house everyday, and begins to see me as a target. He leaves my mom a threatening voice-mail saying he is going to vandalize my car, so at this point I'm even more terrified. At this point in the story, my mom has had to call the cops on him several times, but the cops say they can't do anything as he hasn't physically attacked her. My mom decides she's going to finally petition for the restraining order, with the police reports and voicemails as proof. They set up a court date, and give my mom a temporary restraining order until the court date, so approximately 2 weeks. \n\nThis guy does not stop calling my mom, so my mom calls the detective in charge of her case, and the guy hasn't even been served with the restraining order yet (few days before the court date). He was notified with the court date, though, so he tells my mom he has proof that *she* won't stop calling him. \n\nHe then starts targeting the rest of us. I wake up one Saturday morning, and my car has letters drawn all over the windows with nail polish. Luckily, we were able to just scrape it off gently, but by now I am a nervous wreck. I start doing bad in my classes, and I hadn't slept for about a month. He then begins to harass my dad with voice-mails and phone calls, but luckily my dad didn't buy any of his bs. \n\nFinally, the court date arrives. This man shows up with his step-son, and his step-son starts talking shit to my mom, because of course he only knows this mans side of the story. The judge calls them in and does the usual questioning, talks about police reports, etc. The judge asks him if he has anything to say or show. He says \"Yes, I have a phone bill that shows she called me more than 200 times in the past month.\" The judge says \"Okay, show me.\" Guess what, he didn't bring it. There's no such thing. Judge nods her head and says \"Okay, I reached the verdict.\" He was found guilty, and my mom was awarded a restraining order for life. We finally have peace in our family again. \n\nSo, family stalker, fuck you. Let's NOT meet again. \n\nEdit: Just want to tell people who might be in similar situations to please go to the police ASAP. The danger and the emotional torture is not worth it. Sometimes they won't go away, like we thought this guy would. We took too long to take action.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Long", "id": "65vl54", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 105, "report_reasons": null, "author": "lilmousefoofoo", "saved": false, "mod_reports": [], "name": "t3_65vl54", "subreddit_name_prefixed": "r/LetsNotMeet", "approved_by": null, "over_18": false, "domain": "self.LetsNotMeet", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2t3t8", "edited": 1492479925.0, "link_flair_css_class": "long", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LetsNotMeet/comments/65vl54/our_family_stalker/", "num_reports": null, "locked": false, "stickied": false, "created": 1492465095.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/65vl54/our_family_stalker/", "author_flair_text": null, "quarantine": false, "title": "Our Family Stalker", "created_utc": 1492436295.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 105}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65vl54", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65vl54", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65vl54", "likes": null, "replies": "", "user_reports": [], "id": "dgdlhgi", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "coopiecoop", "parent_id": "t1_dgdksvm", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "I hope she will find the determination eventually.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope she will find the determination eventually.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgdlhgi", "score_hidden": false, "stickied": false, "created": 1492470613.0, "created_utc": 1492441813.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65vl54", "likes": null, "replies": "", "user_reports": [], "id": "dgdnazs", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "AlienTheArley", "parent_id": "t1_dgdksvm", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "My REAL DAD and amd Mom got divorced when I was a baby because he did not help my Mom become a Resident or something to United Sates because she was born in Honduras (I was born In U.S.A) so they got divorced the good thing is that since they got divorced I got to live with My Aunt,My AWESOME Uncle, and my Mom and Last September my Baby Brother is born.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My REAL DAD and amd Mom got divorced when I was a baby because he did not help my Mom become a Resident or something to United Sates because she was born in Honduras (I was born In U.S.A) so they got divorced the good thing is that since they got divorced I got to live with My Aunt,My AWESOME Uncle, and my Mom and Last September my Baby Brother is born.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgdnazs", "score_hidden": false, "stickied": false, "created": 1492472746.0, "created_utc": 1492443946.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdksvm", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "lilmousefoofoo", "parent_id": "t1_dgdkdfp", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "I know. I talk to her about it all the time, but she takes pity upon him (he has no family here, will be left in the streets etc.) which I don't. I barely talk to him because I can't stand him. Every time any of us bring it up to her she brushes it off or doesn't want to hear it. It's difficult. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know. I talk to her about it all the time, but she takes pity upon him (he has no family here, will be left in the streets etc.) which I don&amp;#39;t. I barely talk to him because I can&amp;#39;t stand him. Every time any of us bring it up to her she brushes it off or doesn&amp;#39;t want to hear it. It&amp;#39;s difficult. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgdksvm", "score_hidden": false, "stickied": false, "created": 1492469763.0, "created_utc": 1492440963.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkdfp", "gilded": 0, "archived": false, "score": 61, "report_reasons": null, "author": "coopiecoop", "parent_id": "t3_65vl54", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "&gt; This scares my mom because my dad has a past with domestic violence, so she's scared my dad will believe him and beat her.\n\nsidenote: this is also a huge freaking issue that should be adressed/solved somehow.\n\n(NO ONE should be afraid of their own husband/wife being violent towards them! and no, not even *if* they would be guilty of cheating on their spouse)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;This scares my mom because my dad has a past with domestic violence, so she&amp;#39;s scared my dad will believe him and beat her.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;sidenote: this is also a huge freaking issue that should be adressed/solved somehow.&lt;/p&gt;\n\n&lt;p&gt;(NO ONE should be afraid of their own husband/wife being violent towards them! and no, not even &lt;em&gt;if&lt;/em&gt; they would be guilty of cheating on their spouse)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgdkdfp", "score_hidden": false, "stickied": false, "created": 1492469220.0, "created_utc": 1492440420.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 61}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65vl54", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65vl54", "likes": null, "replies": "", "user_reports": [], "id": "dgdiqqu", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "lilmousefoofoo", "parent_id": "t1_dgdihfq", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "He went away. My mom actually ran into him on the street a couple weeks ago, but she drove away. We're trying to have the least contact possible with him, even if we have the restraining order, just to spare the problems that will obviously come along (arrest etc.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He went away. My mom actually ran into him on the street a couple weeks ago, but she drove away. We&amp;#39;re trying to have the least contact possible with him, even if we have the restraining order, just to spare the problems that will obviously come along (arrest etc.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgdiqqu", "score_hidden": false, "stickied": false, "created": 1492467028.0, "created_utc": 1492438228.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdihfq", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "AlienTheArley", "parent_id": "t3_65vl54", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "Must have been hard and what happened to that guy?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Must have been hard and what happened to that guy?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgdihfq", "score_hidden": false, "stickied": false, "created": 1492466662.0, "created_utc": 1492437862.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65vl54", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65vl54", "likes": null, "replies": "", "user_reports": [], "id": "dge02a8", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "lilmousefoofoo", "parent_id": "t1_dgdzt7p", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "Don't wish this on anybody. The emotional torture my family and I went through was overwhelming. I feel for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t wish this on anybody. The emotional torture my family and I went through was overwhelming. I feel for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dge02a8", "score_hidden": false, "stickied": false, "created": 1492487054.0, "created_utc": 1492458254.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzt7p", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Loren1402", "parent_id": "t3_65vl54", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "Wow i know how you feel i have a similar story\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow i know how you feel i have a similar story&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgdzt7p", "score_hidden": false, "stickied": false, "created": 1492486772.0, "created_utc": 1492457972.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65vl54", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65vl54", "likes": null, "replies": "", "user_reports": [], "id": "dgehghs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lilmousefoofoo", "parent_id": "t1_dgegsex", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "My dad went over to his house during the whole ordeal without our knowledge and beat his ass (the day before the court date). My dad's friend was a witness. This was probably the craziest time period in my life. Too much shit was going on!\n\nEdit: He then left my dad voicemails apologizing for the whole thing, after my dad beat his ass. My dad showed me all the voicemails, and all we could do was laugh.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My dad went over to his house during the whole ordeal without our knowledge and beat his ass (the day before the court date). My dad&amp;#39;s friend was a witness. This was probably the craziest time period in my life. Too much shit was going on!&lt;/p&gt;\n\n&lt;p&gt;Edit: He then left my dad voicemails apologizing for the whole thing, after my dad beat his ass. My dad showed me all the voicemails, and all we could do was laugh.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgehghs", "score_hidden": true, "stickied": false, "created": 1492508407.0, "created_utc": 1492479607.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgegsex", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bloodbathmat", "parent_id": "t3_65vl54", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "Should have let dad kill him.  Sometimes violence is the only thing a predator understands.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Should have let dad kill him.  Sometimes violence is the only thing a predator understands.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgegsex", "score_hidden": true, "stickied": false, "created": 1492507573.0, "created_utc": 1492478773.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65vl54", "likes": null, "replies": "", "user_reports": [], "id": "dgdl4ga", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "AlienTheArley", "parent_id": "t3_65vl54", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 1, "body": "Oh ok Thanks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh ok Thanks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgdl4ga", "score_hidden": false, "stickied": false, "created": 1492470162.0, "created_utc": 1492441362.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]