[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LetsNotMeet", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a long time lurker and didn&amp;#39;t realise I had this story until I came across pictures of the event, this happened a few years ago and I&amp;#39;m sorry for so much background detail but I swear it&amp;#39;s needed.&lt;/p&gt;\n\n&lt;p&gt;I live near a small city which is notoriously known for its use of drugs and illegal drum and bass raves due to how remote and isolated it is, usually they don&amp;#39;t end up badly but there is usually a report every week about someone being stabbed or killed etc.&lt;/p&gt;\n\n&lt;p&gt;Growing up in a rural part of the country, I&amp;#39;ve found myself usually with nothing to do - all that surrounds me is fields, pigs and more fields, so the best any teenage girl can do is the occasional camp-out on a field with her friends or maybe roaming the various abandoned farmhouses. Except, every summer, there&amp;#39;s a three-day festival that has had it&amp;#39;s name changed three times due to the scabby reputation it has. My family is slightly torn-apart, my dad lives abroad as an expatriate and me and my mum only moved here for my education, but that&amp;#39;s another story. Basically, we aren&amp;#39;t very familiar with the area we live because we lived in the Middle East for so long and my parents are originally from London/Surrey area... so we never knew how bad this festival could be.&lt;/p&gt;\n\n&lt;p&gt;I spent one day there, from 11am to 11pm and within this time I experienced more use of drugs, violence and outright sex than my entire (at the time) 15 years of life. But the one experience that stuck out to me was in the drum and bass tent, which as I referred to earlier was filled with the usual illegal ravers, except legally. Second hand high from the weed smoke and slightly tipsy from alcohol, I discovered my love for the rave scene, until I got parted from my friends.&lt;/p&gt;\n\n&lt;p&gt;I was bobbing back and fourth to the music when a guy snaked his hands around my waist and put his fingers in my belt loops. This surprised me but it didn&amp;#39;t register for a few seconds due to the smog that was in my brain - I pulled back and asked what he was doing. He was a tall black guy, (we&amp;#39;ll call him Original) around 6&amp;#39;6/7, mid twenties to early thirties and he told me that he&amp;#39;d seen me and thought I had an amazing body and that he wanted me to come back to his tent with him, what was my number, how old was I and where did I live. - I was wearing jeans, a high cut shirt, a windbreaker and sneakers... my body was not being shown off, by any means. I laughed, I&amp;#39;m not very good with confrontation unless I have my friends around me and usually resort to being a bit timid and nice in the hopes people leave me alone, (bearing in mind too that I&amp;#39;m Caucasian female, 5&amp;#39;6 and maybe 125lbs). I told him I was only fifteen, that I was fine here and I wanted to keep dancing. He schlicked his tongue against his teeth and stared at me with his eyes slightly laughing (I don&amp;#39;t know how else to explain that?) and I backed away and kept dancing. Stupid of me, I know. He came back up behind me, pulling my coat up a bit and putting his hands on my bum, where I immediately turned round and told him to get off me - he backed away and told me that he just wanted to get to know me better and take me away somewhere private, I told him that wasn&amp;#39;t going to happen and just to fuck off. The humour behind his eyes wasn&amp;#39;t present anymore, instead they turned cold and nasty and I&amp;#39;ll never forget that.&lt;/p&gt;\n\n&lt;p&gt;Fast forward maybe 10 minutes, another black dude came up to talk to me while I was taking a breather at the back of the tent. He was saying I&amp;#39;d caught his friends eye, they all thought I was gorgeous and wanted me to come with them to smoke, pointing towards a large group of black guys surrounding and patting Original on the back. I told him that I was with my friends and I didn&amp;#39;t want to do that because they&amp;#39;d be angry if I left them. He told me they&amp;#39;d never have to know and put his hands around my wrist really tight taking me toward the group. Again, I pulled back and told him that I didn&amp;#39;t want to do that, and he looked back at the group and shrugged.\nThis happened twice more with different things said and offered to me and the group getting angrier each time I blew them off.&lt;/p&gt;\n\n&lt;p&gt;I just ignored this, not wanting to cause a scene, feeling kind of &amp;quot;wtf&amp;quot; at the entire situation and went back to the throng of the crowd - where the entire group formed a circle around me, bumping against me and pushing original toward me. He cupped my face in his hand and loud whispered (the kind where you&amp;#39;re drunk and in a loud environment but only want them to hear.) all the things he wanted to do with me, that I could be his young, tight vanilla to his dark chocolate and he&amp;#39;d destroy me but I&amp;#39;d love it ?!. My friend actually appeared at this moment, seeing my face completely contort in absolute terror she told him that I was a lesbian and not interested, dragging me away and back towards the toilets away from them, they were shouting how I was just a fuck anyway and all he wanted was a bit of meat.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;d think the story ends here, but three hours later, me and the friend saw original being dragged out the tent by 4 security guards, being held by his hands and feet and put behind a big door that was for drug searches. Like a scene from a movie, I saw the doors close as the guy was held down and a security guard ping some white gloves onto his hands. We found out later the guy had literally grams of angel dust in wraps and wraps of little baggies hidden up... there.&lt;/p&gt;\n\n&lt;p&gt;I mean I don&amp;#39;t know what he was definitely going to do with that, but something definitely tells me I would have if I&amp;#39;d of gone with him.\nBig black guy who wouldn&amp;#39;t leave me tf alone, let&amp;#39;s not meet again.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm a long time lurker and didn't realise I had this story until I came across pictures of the event, this happened a few years ago and I'm sorry for so much background detail but I swear it's needed.\n\n\nI live near a small city which is notoriously known for its use of drugs and illegal drum and bass raves due to how remote and isolated it is, usually they don't end up badly but there is usually a report every week about someone being stabbed or killed etc.\n\n\nGrowing up in a rural part of the country, I've found myself usually with nothing to do - all that surrounds me is fields, pigs and more fields, so the best any teenage girl can do is the occasional camp-out on a field with her friends or maybe roaming the various abandoned farmhouses. Except, every summer, there's a three-day festival that has had it's name changed three times due to the scabby reputation it has. My family is slightly torn-apart, my dad lives abroad as an expatriate and me and my mum only moved here for my education, but that's another story. Basically, we aren't very familiar with the area we live because we lived in the Middle East for so long and my parents are originally from London/Surrey area... so we never knew how bad this festival could be.\n\nI spent one day there, from 11am to 11pm and within this time I experienced more use of drugs, violence and outright sex than my entire (at the time) 15 years of life. But the one experience that stuck out to me was in the drum and bass tent, which as I referred to earlier was filled with the usual illegal ravers, except legally. Second hand high from the weed smoke and slightly tipsy from alcohol, I discovered my love for the rave scene, until I got parted from my friends.\n\n\nI was bobbing back and fourth to the music when a guy snaked his hands around my waist and put his fingers in my belt loops. This surprised me but it didn't register for a few seconds due to the smog that was in my brain - I pulled back and asked what he was doing. He was a tall black guy, (we'll call him Original) around 6'6/7, mid twenties to early thirties and he told me that he'd seen me and thought I had an amazing body and that he wanted me to come back to his tent with him, what was my number, how old was I and where did I live. - I was wearing jeans, a high cut shirt, a windbreaker and sneakers... my body was not being shown off, by any means. I laughed, I'm not very good with confrontation unless I have my friends around me and usually resort to being a bit timid and nice in the hopes people leave me alone, (bearing in mind too that I'm Caucasian female, 5'6 and maybe 125lbs). I told him I was only fifteen, that I was fine here and I wanted to keep dancing. He schlicked his tongue against his teeth and stared at me with his eyes slightly laughing (I don't know how else to explain that?) and I backed away and kept dancing. Stupid of me, I know. He came back up behind me, pulling my coat up a bit and putting his hands on my bum, where I immediately turned round and told him to get off me - he backed away and told me that he just wanted to get to know me better and take me away somewhere private, I told him that wasn't going to happen and just to fuck off. The humour behind his eyes wasn't present anymore, instead they turned cold and nasty and I'll never forget that.\n\n\nFast forward maybe 10 minutes, another black dude came up to talk to me while I was taking a breather at the back of the tent. He was saying I'd caught his friends eye, they all thought I was gorgeous and wanted me to come with them to smoke, pointing towards a large group of black guys surrounding and patting Original on the back. I told him that I was with my friends and I didn't want to do that because they'd be angry if I left them. He told me they'd never have to know and put his hands around my wrist really tight taking me toward the group. Again, I pulled back and told him that I didn't want to do that, and he looked back at the group and shrugged.\nThis happened twice more with different things said and offered to me and the group getting angrier each time I blew them off.\n\n\nI just ignored this, not wanting to cause a scene, feeling kind of \"wtf\" at the entire situation and went back to the throng of the crowd - where the entire group formed a circle around me, bumping against me and pushing original toward me. He cupped my face in his hand and loud whispered (the kind where you're drunk and in a loud environment but only want them to hear.) all the things he wanted to do with me, that I could be his young, tight vanilla to his dark chocolate and he'd destroy me but I'd love it ?!. My friend actually appeared at this moment, seeing my face completely contort in absolute terror she told him that I was a lesbian and not interested, dragging me away and back towards the toilets away from them, they were shouting how I was just a fuck anyway and all he wanted was a bit of meat.\n\n\nYou'd think the story ends here, but three hours later, me and the friend saw original being dragged out the tent by 4 security guards, being held by his hands and feet and put behind a big door that was for drug searches. Like a scene from a movie, I saw the doors close as the guy was held down and a security guard ping some white gloves onto his hands. We found out later the guy had literally grams of angel dust in wraps and wraps of little baggies hidden up... there.\n\nI mean I don't know what he was definitely going to do with that, but something definitely tells me I would have if I'd of gone with him.\nBig black guy who wouldn't leave me tf alone, let's not meet again.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Long", "id": "65wlr8", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 21, "report_reasons": null, "author": "harrxngton", "saved": false, "mod_reports": [], "name": "t3_65wlr8", "subreddit_name_prefixed": "r/LetsNotMeet", "approved_by": null, "over_18": false, "domain": "self.LetsNotMeet", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2t3t8", "edited": 1492452563.0, "link_flair_css_class": "long", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LetsNotMeet/comments/65wlr8/i_could_of_been_the_vanilla_to_his_dark_chocolate/", "num_reports": null, "locked": false, "stickied": false, "created": 1492475352.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/65wlr8/i_could_of_been_the_vanilla_to_his_dark_chocolate/", "author_flair_text": null, "quarantine": false, "title": "I could of been the Vanilla to his Dark Chocolate.", "created_utc": 1492446552.0, "distinguished": null, "media": null, "upvote_ratio": 0.79, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65wlr8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65wlr8", "likes": null, "replies": "", "user_reports": [], "id": "dgduvy6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "harrxngton", "parent_id": "t1_dgdshfn", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "I noticed that after I posted (:", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I noticed that after I posted (:&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgduvy6", "score_hidden": false, "stickied": false, "created": 1492481199.0, "created_utc": 1492452399.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdshfn", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "andysood1980", "parent_id": "t3_65wlr8", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "Have", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgdshfn", "score_hidden": false, "stickied": false, "created": 1492478553.0, "created_utc": 1492449753.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65wlr8", "likes": null, "replies": "", "user_reports": [], "id": "dge2pd7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aberniii", "parent_id": "t3_65wlr8", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "Wow, must be something about drugged out weirdos at festivals XD.   \nSeriously though, very glad you're friend found you when she did. Great timing on her part!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, must be something about drugged out weirdos at festivals XD.&lt;br/&gt;\nSeriously though, very glad you&amp;#39;re friend found you when she did. Great timing on her part!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dge2pd7", "score_hidden": false, "stickied": false, "created": 1492490006.0, "created_utc": 1492461206.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65wlr8", "likes": null, "replies": "", "user_reports": [], "id": "dgehcz5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theorigamiwaffle", "parent_id": "t3_65wlr8", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "I'm so glad you're safe", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so glad you&amp;#39;re safe&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgehcz5", "score_hidden": true, "stickied": false, "created": 1492508285.0, "created_utc": 1492479485.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65wlr8", "likes": null, "replies": "", "user_reports": [], "id": "dgdplpm", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_65wlr8", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "/u/harrxngton\n\nYour submission has been removed because it appears to be a \"wall of text\". Please edit the submission and add some paragraph breaks by **pressing the enter key twice to create paragraph breaks**.\n\nAfter editing, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FLetsNotMeet&amp;subject=Wall of Text Removal&amp;message=My [submission](/r/LetsNotMeet/comments/65wlr8/i_could_of_been_the_vanilla_to_his_dark_chocolate/\\) was removed because it was a Wall of Text:). Ask for your post to be re-approved. This link should automatically add your submission link to the body of the text. Please understand that when you have edited, the post must be manually approved by a moderator. It **will not** be not auto-approved by AutoMod when it has been edited.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LetsNotMeet) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/harrxngton\"&gt;/u/harrxngton&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Your submission has been removed because it appears to be a &amp;quot;wall of text&amp;quot;. Please edit the submission and add some paragraph breaks by &lt;strong&gt;pressing the enter key twice to create paragraph breaks&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;After editing, please &lt;a href=\"https://www.reddit.com/message/compose?to=%2Fr%2FLetsNotMeet&amp;amp;subject=Wall%20of%20Text%20Removal&amp;amp;message=My%20%5Bsubmission%5D(/r/LetsNotMeet/comments/65wlr8/i_could_of_been_the_vanilla_to_his_dark_chocolate/)%20was%20removed%20because%20it%20was%20a%20Wall%20of%20Text:\"&gt;message the moderators&lt;/a&gt;. Ask for your post to be re-approved. This link should automatically add your submission link to the body of the text. Please understand that when you have edited, the post must be manually approved by a moderator. It &lt;strong&gt;will not&lt;/strong&gt; be not auto-approved by AutoMod when it has been edited.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/LetsNotMeet\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgdplpm", "score_hidden": false, "stickied": false, "created": 1492475352.0, "created_utc": 1492446552.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]