[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LetsNotMeet", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Now i live and work in Texas, the area i work in is heavily wooded and has a population of about 500 people. I had been rolling with a partner who got injured playing softball and needed to get surgery. So i got paired up with someone else for a few months. The kid was young, he was about 21 and his name was Kyle. So one night we were sitting off of the interstate which was a one lane in both direction. This area of the road was very dark and secluded and kids usually drag race here. &lt;/p&gt;\n\n&lt;p&gt;About halfway through there is a 7/11 with a gas station which is weird because it&amp;#39;s smack in the middle of nothing. At about 2am on a Friday night dispatch got a hang up call from the 7/11. So me and my partner responded as we were maybe 10 minutes away. Once we arrived we entered and the cashier was just relaxing watching TV. We asked if he had called 911 as we got a hang up call and he stated he didn&amp;#39;t. So we were a bit confused and we called code-4. As we left the building and we returning to our car we heard whistling. It sounded distant and out there, there is nothing for miles so looked at each other and grabbed our lights and just shined them into the area we thought it was coming from. Coming from the distance was this man, about mid 40&amp;#39;s, White. He was wearing this outfit that looked like it was from a bad 80&amp;#39;s movie. We sat in our vehicle and watched him walk by and we had our windows down and he was slowly whistling &amp;quot;you are my sunshine.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So at this point we are so confused and had this weird gut feeling. We pulled out and then continued on our way. We drove about 30 minutes away to this old abandoned strip mall. We had only been sitting in the parking lot for maybe 5 minutes when i heard the whistling again. We instantly looked at each other and drew our weapons while still sitting on our patrol car. We turned on our light bar which has a LED spotlight capability. For those who don&amp;#39;t know, it&amp;#39;s really god damn bright.&lt;/p&gt;\n\n&lt;p&gt;We were looking at the road and the same man slowly walked by while whistling. Now i thought to myself, we were driving at least 65 MPH from that 7/11 which is 30 minutes away. At the pace he was going it would have taken him like 5 hours to reach us so how did he get here that fast. Is this guy secretly Usain Bolt? We slowly drove up to him and lit him up. I exited the vehicle and he just stood there whistling. My partner was contact and i was cover. Kyle asked him where he was coming from and the man kept whistling. Kyle then asked the man what he name was and the man looked up and kept whistling but this time it was really slow like he was mocking us. At that point i walked over and asked the man for his ID. He instantly stopped whistling and reached slowly for his wallet. I took his wallet and opened it up.&lt;/p&gt;\n\n&lt;p&gt;His damn ID was from 1989. As my partner was trying to still talk with the man i ran his ID in my system. Nothing came up besides basic information last reported. I got a really weird feeling from him so i called my SGT who i sent a photo of the man to. Thankfully someone at the station recognized him and made a call.  The man we stopped had escaped from the mental institution about 75 miles in the direction from which he came from. We placed him in handcuffs and drove him to the facility. Once we brought him inside i asked the employee why the man had access to his belongings and clothing and why hadn&amp;#39;t the escape been reported. The women said that she has no idea because the patients belongings are locked away until release and she avoided the question on how they didn&amp;#39;t notice he was gone and report it.  I was curious about the mans history so asked the employee if she could tell me anything about him.&lt;/p&gt;\n\n&lt;p&gt;She said that due to patient privacy laws she couldn&amp;#39;t really tell me anything other then he murdered his wife and was witnessed whistling when they found them. Take a guess what this man was whistling?&lt;/p&gt;\n\n&lt;p&gt;You are my only sunshine.&lt;/p&gt;\n\n&lt;p&gt;So to this man, god have mercy on your soul.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Now i live and work in Texas, the area i work in is heavily wooded and has a population of about 500 people. I had been rolling with a partner who got injured playing softball and needed to get surgery. So i got paired up with someone else for a few months. The kid was young, he was about 21 and his name was Kyle. So one night we were sitting off of the interstate which was a one lane in both direction. This area of the road was very dark and secluded and kids usually drag race here. \n\n\n\nAbout halfway through there is a 7/11 with a gas station which is weird because it's smack in the middle of nothing. At about 2am on a Friday night dispatch got a hang up call from the 7/11. So me and my partner responded as we were maybe 10 minutes away. Once we arrived we entered and the cashier was just relaxing watching TV. We asked if he had called 911 as we got a hang up call and he stated he didn't. So we were a bit confused and we called code-4. As we left the building and we returning to our car we heard whistling. It sounded distant and out there, there is nothing for miles so looked at each other and grabbed our lights and just shined them into the area we thought it was coming from. Coming from the distance was this man, about mid 40's, White. He was wearing this outfit that looked like it was from a bad 80's movie. We sat in our vehicle and watched him walk by and we had our windows down and he was slowly whistling \"you are my sunshine.\"\n\n\n\nSo at this point we are so confused and had this weird gut feeling. We pulled out and then continued on our way. We drove about 30 minutes away to this old abandoned strip mall. We had only been sitting in the parking lot for maybe 5 minutes when i heard the whistling again. We instantly looked at each other and drew our weapons while still sitting on our patrol car. We turned on our light bar which has a LED spotlight capability. For those who don't know, it's really god damn bright.\n\n\nWe were looking at the road and the same man slowly walked by while whistling. Now i thought to myself, we were driving at least 65 MPH from that 7/11 which is 30 minutes away. At the pace he was going it would have taken him like 5 hours to reach us so how did he get here that fast. Is this guy secretly Usain Bolt? We slowly drove up to him and lit him up. I exited the vehicle and he just stood there whistling. My partner was contact and i was cover. Kyle asked him where he was coming from and the man kept whistling. Kyle then asked the man what he name was and the man looked up and kept whistling but this time it was really slow like he was mocking us. At that point i walked over and asked the man for his ID. He instantly stopped whistling and reached slowly for his wallet. I took his wallet and opened it up.\n\n\nHis damn ID was from 1989. As my partner was trying to still talk with the man i ran his ID in my system. Nothing came up besides basic information last reported. I got a really weird feeling from him so i called my SGT who i sent a photo of the man to. Thankfully someone at the station recognized him and made a call.  The man we stopped had escaped from the mental institution about 75 miles in the direction from which he came from. We placed him in handcuffs and drove him to the facility. Once we brought him inside i asked the employee why the man had access to his belongings and clothing and why hadn't the escape been reported. The women said that she has no idea because the patients belongings are locked away until release and she avoided the question on how they didn't notice he was gone and report it.  I was curious about the mans history so asked the employee if she could tell me anything about him.\n\nShe said that due to patient privacy laws she couldn't really tell me anything other then he murdered his wife and was witnessed whistling when they found them. Take a guess what this man was whistling?\n\nYou are my only sunshine.\n\nSo to this man, god have mercy on your soul.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65wqzl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 21, "report_reasons": null, "author": "OFCjay", "saved": false, "mod_reports": [], "name": "t3_65wqzl", "subreddit_name_prefixed": "r/LetsNotMeet", "approved_by": null, "over_18": false, "domain": "self.LetsNotMeet", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2t3t8", "edited": 1492448301.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LetsNotMeet/comments/65wqzl/you_are_my_sunshine/", "num_reports": null, "locked": false, "stickied": false, "created": 1492476727.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/65wqzl/you_are_my_sunshine/", "author_flair_text": null, "quarantine": false, "title": "You are my sunshine", "created_utc": 1492447927.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65wqzl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65wqzl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65wqzl", "likes": null, "replies": "", "user_reports": [], "id": "dge5fum", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Huckdog", "parent_id": "t1_dge0uu8", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "Makes sense.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Makes sense.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dge5fum", "score_hidden": false, "stickied": false, "created": 1492493168.0, "created_utc": 1492464368.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge0uu8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "OFCjay", "parent_id": "t1_dgdxpkn", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "I am thinking he hitchhiked, we saw about 4 or 5 vehicles drive past in the time so it's the most likely explanation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am thinking he hitchhiked, we saw about 4 or 5 vehicles drive past in the time so it&amp;#39;s the most likely explanation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dge0uu8", "score_hidden": false, "stickied": false, "created": 1492487945.0, "created_utc": 1492459145.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdxpkn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Huckdog", "parent_id": "t3_65wqzl", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "Did you figure out how he made it to the second location so quickly? There had to have been a vehicle somewhere or maybe he got dropped off. That's creepy as hell.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did you figure out how he made it to the second location so quickly? There had to have been a vehicle somewhere or maybe he got dropped off. That&amp;#39;s creepy as hell.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgdxpkn", "score_hidden": false, "stickied": false, "created": 1492484382.0, "created_utc": 1492455582.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t3t8", "removal_reason": null, "link_id": "t3_65wqzl", "likes": null, "replies": "", "user_reports": [], "id": "dgeelpq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LadyRedfox8", "parent_id": "t3_65wqzl", "subreddit_name_prefixed": "r/LetsNotMeet", "controversiality": 0, "body": "The patient privacy laws are called HIPPA. Believe me they're a pain in the butt for those who must follow them. The nurse might not have been trying to be difficult. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The patient privacy laws are called HIPPA. Believe me they&amp;#39;re a pain in the butt for those who must follow them. The nurse might not have been trying to be difficult. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LetsNotMeet", "name": "t1_dgeelpq", "score_hidden": false, "stickied": false, "created": 1492504853.0, "created_utc": 1492476053.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]