[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LetsNotMeet", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I made a very unexciting &lt;a href=\"https://www.reddit.com/r/LetsNotMeet/comments/5vargx/just_a_friendly_reminder_to_help_your_fellow/?st=J1MDXXNQ&amp;amp;sh=fd311770\"&gt;post&lt;/a&gt; about how I tried to do the right thing concerning drunk passengers and making sure they had the right uber driver.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to this last weekend. My friends and I had a little get-together and I volunteered to go on a beer run when alcohol was running low. A girl came with me to buy cigarettes (I am an average height male by the way). The first liquor store was closed and it was getting late so I called my people and asked if they REALLY wanted more alcohol. They said yes and that the next closest was only &amp;quot;a couple blocks away&amp;quot; (bullshit, I know this area and it would be about a 30 minute walk but they were insistent). Whatever, girl and I are making good conversation so we went to store #2. &lt;/p&gt;\n\n&lt;p&gt;We arrive after girl concedes I was not lying about the distance. Its already almost 12 by now (we left about an hour earlier) so we decide to call a Lyft instead of walking 30 minutes again. &lt;/p&gt;\n\n&lt;p&gt;We decided to wait on the sidewalk at this intersection. I was watching &amp;quot;Chris,&amp;quot; our friendly Lyft driver on my phone app&amp;#39;s map as this other dude in his car stops across the street from us and rolls his window down. Then in this mumbled voice he says, &amp;quot;Are you guys waiting for your Uber driver?&amp;quot; First, I knew he wasn&amp;#39;t our driver because I saw he was on a different street and we didn&amp;#39;t receive an alert. Second, we&amp;#39;re using Lyft. Third, he asked in the same manner as those weirdos in downtown areas you pass by that try to sell you drugs (&amp;quot;Mumble mumble...got some chronic bruh...mumble mumble...shit&amp;#39;s fire.&amp;quot;) so he had creepy vibes. He was a chubby bald (like a #0 setting on hair clippers buzz cut) dude in a grimey silver sedan. &lt;/p&gt;\n\n&lt;p&gt;Neither of us responded. In hindsight I should have just said ,&amp;quot;No we&amp;#39;re good&amp;quot; but when I deal with the &amp;#39;mumblers&amp;#39; I usually just don&amp;#39;t engage. Sometimes after I say &amp;quot;No thanks&amp;quot; they use the opportunity to start conversation and ask for money so I just keep my mouth shut. It&amp;#39;s just a habit for me now. He asked/mumbled again, &amp;quot;You waiting for your uber driver?&amp;quot; Homegirl responds, &amp;quot;No, Lyft.&amp;quot; He mumbles something unintelligible after that that sounded like a question and she responds &amp;quot;What?&amp;quot; I cut her off and told her &amp;#39;Don&amp;#39;t talk to this fool he&amp;#39;s a creep.&amp;#39; Homeboy realizes I&amp;#39;m not letting her speak and he drives off. No uber sticker on his car. He keeps driving straight up the street without stopping so it&amp;#39;s clear this fucker wasn&amp;#39;t looking for any uber passengers. He was looking for someone unaware enough to get in his car with him (unless he was trying to hit on the girl waiting with me?). &lt;/p&gt;\n\n&lt;p&gt;We got back with our actual Lyft driver safely and everyone was too tired to keep drinking and complained that we took forever (which was the sole reason why I called them earlier, those ungrateful fucks I have for friends). So fake uber driver, lets not meet. And don&amp;#39;t actually sign up for uber, pls. &lt;/p&gt;\n\n&lt;p&gt;TL;DR called a Lyft driver after a beer run, creepy fake &amp;#39;Uber&amp;#39; driver tries to talk to us, get home safe in time for everyone to be tired and not drink. Cheers!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I made a very unexciting [post](https://www.reddit.com/r/LetsNotMeet/comments/5vargx/just_a_friendly_reminder_to_help_your_fellow/?st=J1MDXXNQ&amp;sh=fd311770) about how I tried to do the right thing concerning drunk passengers and making sure they had the right uber driver.\n\n\nFast forward to this last weekend. My friends and I had a little get-together and I volunteered to go on a beer run when alcohol was running low. A girl came with me to buy cigarettes (I am an average height male by the way). The first liquor store was closed and it was getting late so I called my people and asked if they REALLY wanted more alcohol. They said yes and that the next closest was only \"a couple blocks away\" (bullshit, I know this area and it would be about a 30 minute walk but they were insistent). Whatever, girl and I are making good conversation so we went to store #2. \n\n\n\nWe arrive after girl concedes I was not lying about the distance. Its already almost 12 by now (we left about an hour earlier) so we decide to call a Lyft instead of walking 30 minutes again. \n\n\n\nWe decided to wait on the sidewalk at this intersection. I was watching \"Chris,\" our friendly Lyft driver on my phone app's map as this other dude in his car stops across the street from us and rolls his window down. Then in this mumbled voice he says, \"Are you guys waiting for your Uber driver?\" First, I knew he wasn't our driver because I saw he was on a different street and we didn't receive an alert. Second, we're using Lyft. Third, he asked in the same manner as those weirdos in downtown areas you pass by that try to sell you drugs (\"Mumble mumble...got some chronic bruh...mumble mumble...shit's fire.\") so he had creepy vibes. He was a chubby bald (like a #0 setting on hair clippers buzz cut) dude in a grimey silver sedan. \n\n\n\nNeither of us responded. In hindsight I should have just said ,\"No we're good\" but when I deal with the 'mumblers' I usually just don't engage. Sometimes after I say \"No thanks\" they use the opportunity to start conversation and ask for money so I just keep my mouth shut. It's just a habit for me now. He asked/mumbled again, \"You waiting for your uber driver?\" Homegirl responds, \"No, Lyft.\" He mumbles something unintelligible after that that sounded like a question and she responds \"What?\" I cut her off and told her 'Don't talk to this fool he's a creep.' Homeboy realizes I'm not letting her speak and he drives off. No uber sticker on his car. He keeps driving straight up the street without stopping so it's clear this fucker wasn't looking for any uber passengers. He was looking for someone unaware enough to get in his car with him (unless he was trying to hit on the girl waiting with me?). \n\n\nWe got back with our actual Lyft driver safely and everyone was too tired to keep drinking and complained that we took forever (which was the sole reason why I called them earlier, those ungrateful fucks I have for friends). So fake uber driver, lets not meet. And don't actually sign up for uber, pls. \n\n\n\nTL;DR called a Lyft driver after a beer run, creepy fake 'Uber' driver tries to talk to us, get home safe in time for everyone to be tired and not drink. Cheers!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Medium", "id": "65xbih", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "Ohdaswet", "saved": false, "mod_reports": [], "name": "t3_65xbih", "subreddit_name_prefixed": "r/LetsNotMeet", "approved_by": null, "over_18": false, "domain": "self.LetsNotMeet", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2t3t8", "edited": false, "link_flair_css_class": "medium", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LetsNotMeet/comments/65xbih/lnm_follow_up_to_nonlnm_post/", "num_reports": null, "locked": false, "stickied": false, "created": 1492482046.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/65xbih/lnm_follow_up_to_nonlnm_post/", "author_flair_text": null, "quarantine": false, "title": "LNM follow up to non-LNM post", "created_utc": 1492453246.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]