[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "weightroom", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Intro and Background&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Welcome to the Dark Side.&lt;/p&gt;\n\n&lt;p&gt;This program was written by me and Cody (&lt;a href=\"/u/gzcl\"&gt;/u/gzcl&lt;/a&gt;) in order to help prep for USAPL&amp;#39;s Collegiate Nationals as an equipped lifter. I thought the tier system that Cody came up with could work really well with gear, so I decided to try my hand at programming this stuff on my own. I do have to say, this was mostly experimental as I haven&amp;#39;t found many good resources about equipped training other than talking to other equipped lifters. Essentially, equipped lifts became T1s and raw competition stuff became T2s.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Progress and Equipment Info&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Equipped Squat - 545lbx2 --&amp;gt; 605lbx2, 617lbx1&lt;/li&gt;\n&lt;li&gt;Equipped Bench - 347lb --&amp;gt; 385lb&lt;/li&gt;\n&lt;li&gt;Equipped Deadlift - No Data--&amp;gt; 573lb, Almost 600lb&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Equipment Used&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Super Centurion R/S (squat suit)&lt;/li&gt;\n&lt;li&gt;LCC A/S Super Katana (bench shirt)&lt;/li&gt;\n&lt;li&gt;Sumo Stance Velocity (deadlift suit)&lt;/li&gt;\n&lt;li&gt;Started with Inzer W70 knee wraps but then switched back to Titan Sig Gold Knee Wraps&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;My bodyweight didn&amp;#39;t fluctuate a lot but at its worst ranged between 118 kgs - 123 kgs.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Program&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This was essentially 2 different programs in order to prep for 2 different meets. &lt;a href=\"https://docs.google.com/spreadsheets/d/1-h_YE8PkM4d7By3ndbs-h2XukGM6TMz0BmmAvGcBh-c/edit?usp=sharing\"&gt;This is the spreadsheet for both.&lt;/a&gt; For both of them, I decided to take a higher frequency approach since the biggest problem I have when in gear is lack of volume, so I figured it would be easier to spread it out through the week so I couldn&amp;#39;t make excuses whenever I took one of my suits or my bench shirt off.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Program 1:&lt;/p&gt;\n\n&lt;p&gt;This program is the first 2 sheets on the spreadsheet labeled &amp;#39;Acclimation&amp;#39; and &amp;#39;Peak&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;I hadn&amp;#39;t lifted equipped in a few months before this, so I decided to structure this training as if I was just starting and breaking in my gear all over again (since I also had it tailored down too). For each squat day, I would work up in heavy doubles in full suit and wraps until I got to an RPE 9 or so and call it there. At the beginning, I could barely hit 545x2 to half depth (will upload video when I get home) and after a few weeks of doing this, I eventually hit &lt;a href=\"https://www.instagram.com/p/BPlxuXGgZYK/\"&gt;605lbsx2&lt;/a&gt; to questionable depth.&lt;/p&gt;\n\n&lt;p&gt;For Bench, I started with boards and got rid of them in order to touch after a few weeks. Went from 347lbs to chest last time I was in a shirt to 385lbs but with my ass about 4 inches off the bench.&lt;/p&gt;\n\n&lt;p&gt;For Deadlift, I didn&amp;#39;t have a deadlift suit until the peak phase, so this was all raw until the last couple weeks where I threw it on to acclimate to it.&lt;/p&gt;\n\n&lt;p&gt;This was super taxing. It worked super well the first few weeks since I was on winter break from school, and I could sleep as much as I wanted. Once school started again, it was a lot harder to maintain. That&amp;#39;s why the final prep for collegiates changed so much from this.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Program 2:&lt;/p&gt;\n\n&lt;p&gt;This is the last sheet labeled &amp;#39;Collegiates&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;For this, I was coming off of my last meet and felt proficient enough in gear that I could start training with some actual volume instead of just hoping I wouldn&amp;#39;t die once I unracked the weights. For squats, I took a more classic approach where I started with a few weeks of raw lifting and as the weeks I added more gear until I was in the full suit. Raw -&amp;gt; Raw w/ Wraps -&amp;gt; Suit w/ straps down + Wraps -&amp;gt; Full Suit + wraps.&lt;/p&gt;\n\n&lt;p&gt;For bench, I traded off working to the chest and doing lockout work. For the first 2 weeks, I lifted raw and did pin press lock out work. The next 2 weeks were in the shirt either to a 1 board or the chest. This was followed by one heavy lockout workout and then one more to the chest before I did my opener one week out. By this time, I retried 385lb and did it without my butt coming off the bench, but it was still pretty slow.&lt;/p&gt;\n\n&lt;p&gt;At this point, my raw sumo deadlift felt terrible, my raw conventional was ok, but my equipped sumo was the best. I figured I needed to work on my raw sumo to help out. I did a few weeks of raw sumo and then slowly added gear. Raw -&amp;gt; Suit w/ straps down -&amp;gt; Full suit. It&amp;#39;s also worth noting that I was having a lot of hip problems whenever I lifted raw so that hindered the first few weeks of training.&lt;/p&gt;\n\n&lt;p&gt;This program got me a lot better in tune with the gear. It became more comfortable to lift in it and I got used to using some lighter weight and not just depending on putting heavier and heavier loads just to get down. This made all the lifts a lot more consistent as well.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Meets&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;After doing the first program, I competed at the USAPL Colorado Sate Championships, and I didn&amp;#39;t do super well. I had gotten way stronger in gear than the last meet I did in it, but it was also the first time I had to water cut for a meet since this was when I weighed 123kgs (I compete 120kg). I messed that up and ended up only squatting 567lb, Benched 375lb, and I only deadlifted 463lb just to qualify for collegiates. I went 5/6 where I passed on my last squat, missed my second bench, and passed on my last 2 deadlifts. This meet also opened up my eyes to how much being depleted of water or being bloated can really screw with how your gear fits and how much that can affect your performance.&lt;/p&gt;\n\n&lt;p&gt;For Collegiate nationals, I only weighed 120.5kgs going in and did much better with that cut. It also helped that I was on the platform with the most flights so it gave me more time to recover between events. Final lifts were a 617lb Squat, 375 lb Bench, and a 573 lb deadlift. You can see those lifts &lt;a href=\"https://www.instagram.com/p/BSrfEjIBLRz\"&gt;here.&lt;/a&gt; Unfortunately, my bench felt really bad the day of, so no improvement there, but everything else went great. I went 7/9 where I hit all 3 squats, 2 benches, and 2 deadlifts. I missed a 601lb deadlift in order to secure 7th (which is about the best I could have done considering the people I was competing against.)&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Final Thoughts&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Honestly, this program worked better than I thought it would. I made improvements in the second program though I lost weight (my suits and shirt definitely were looser than they were the first program) and I had to start wrapping my own knees. Even though, I didn&amp;#39;t gain any extra poundage on my bench the second half, the bar path and control was significantly better. I am disappointed that I missed the 600lb deadlift on my final attempt, but it is definitely doable in the near future. I give this program a 7/10. I do need to improve fatigue management and start doing more work in the bottom and middle of my bench since that&amp;#39;s where I always miss for strength reasons. I also have to get my raw bench up if I have any hope of increasing my equipped bench. If anyone else has experience with programming equipped lifting, I would love some pointers or to chat and get some more info about it. In the future, I just plan to improve upon this program now that I&amp;#39;ve started figuring out what works and what doesn&amp;#39;t.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**Intro and Background**\n\nWelcome to the Dark Side.\n\nThis program was written by me and Cody (/u/gzcl) in order to help prep for USAPL's Collegiate Nationals as an equipped lifter. I thought the tier system that Cody came up with could work really well with gear, so I decided to try my hand at programming this stuff on my own. I do have to say, this was mostly experimental as I haven't found many good resources about equipped training other than talking to other equipped lifters. Essentially, equipped lifts became T1s and raw competition stuff became T2s.\n\n&amp;nbsp;\n\n**Progress and Equipment Info**\n\n* Equipped Squat - 545lbx2 --&gt; 605lbx2, 617lbx1\n* Equipped Bench - 347lb --&gt; 385lb\n* Equipped Deadlift - No Data--&gt; 573lb, Almost 600lb\n\nEquipment Used\n\n* Super Centurion R/S (squat suit)\n* LCC A/S Super Katana (bench shirt)\n* Sumo Stance Velocity (deadlift suit)\n* Started with Inzer W70 knee wraps but then switched back to Titan Sig Gold Knee Wraps\n\nMy bodyweight didn't fluctuate a lot but at its worst ranged between 118 kgs - 123 kgs.\n\n&amp;nbsp;\n\n**The Program**\n\nThis was essentially 2 different programs in order to prep for 2 different meets. [This is the spreadsheet for both.](https://docs.google.com/spreadsheets/d/1-h_YE8PkM4d7By3ndbs-h2XukGM6TMz0BmmAvGcBh-c/edit?usp=sharing) For both of them, I decided to take a higher frequency approach since the biggest problem I have when in gear is lack of volume, so I figured it would be easier to spread it out through the week so I couldn't make excuses whenever I took one of my suits or my bench shirt off.\n\n&amp;nbsp;\n\nProgram 1:\n\nThis program is the first 2 sheets on the spreadsheet labeled 'Acclimation' and 'Peak'\n\nI hadn't lifted equipped in a few months before this, so I decided to structure this training as if I was just starting and breaking in my gear all over again (since I also had it tailored down too). For each squat day, I would work up in heavy doubles in full suit and wraps until I got to an RPE 9 or so and call it there. At the beginning, I could barely hit 545x2 to half depth (will upload video when I get home) and after a few weeks of doing this, I eventually hit [605lbsx2](https://www.instagram.com/p/BPlxuXGgZYK/) to questionable depth.\n\nFor Bench, I started with boards and got rid of them in order to touch after a few weeks. Went from 347lbs to chest last time I was in a shirt to 385lbs but with my ass about 4 inches off the bench.\n\nFor Deadlift, I didn't have a deadlift suit until the peak phase, so this was all raw until the last couple weeks where I threw it on to acclimate to it.\n\nThis was super taxing. It worked super well the first few weeks since I was on winter break from school, and I could sleep as much as I wanted. Once school started again, it was a lot harder to maintain. That's why the final prep for collegiates changed so much from this.\n\n&amp;nbsp;\n\nProgram 2:\n\nThis is the last sheet labeled 'Collegiates'\n\nFor this, I was coming off of my last meet and felt proficient enough in gear that I could start training with some actual volume instead of just hoping I wouldn't die once I unracked the weights. For squats, I took a more classic approach where I started with a few weeks of raw lifting and as the weeks I added more gear until I was in the full suit. Raw -&gt; Raw w/ Wraps -&gt; Suit w/ straps down + Wraps -&gt; Full Suit + wraps.\n\nFor bench, I traded off working to the chest and doing lockout work. For the first 2 weeks, I lifted raw and did pin press lock out work. The next 2 weeks were in the shirt either to a 1 board or the chest. This was followed by one heavy lockout workout and then one more to the chest before I did my opener one week out. By this time, I retried 385lb and did it without my butt coming off the bench, but it was still pretty slow.\n\nAt this point, my raw sumo deadlift felt terrible, my raw conventional was ok, but my equipped sumo was the best. I figured I needed to work on my raw sumo to help out. I did a few weeks of raw sumo and then slowly added gear. Raw -&gt; Suit w/ straps down -&gt; Full suit. It's also worth noting that I was having a lot of hip problems whenever I lifted raw so that hindered the first few weeks of training.\n\nThis program got me a lot better in tune with the gear. It became more comfortable to lift in it and I got used to using some lighter weight and not just depending on putting heavier and heavier loads just to get down. This made all the lifts a lot more consistent as well.\n\n&amp;nbsp;\n\n**Meets**\n\nAfter doing the first program, I competed at the USAPL Colorado Sate Championships, and I didn't do super well. I had gotten way stronger in gear than the last meet I did in it, but it was also the first time I had to water cut for a meet since this was when I weighed 123kgs (I compete 120kg). I messed that up and ended up only squatting 567lb, Benched 375lb, and I only deadlifted 463lb just to qualify for collegiates. I went 5/6 where I passed on my last squat, missed my second bench, and passed on my last 2 deadlifts. This meet also opened up my eyes to how much being depleted of water or being bloated can really screw with how your gear fits and how much that can affect your performance.\n\nFor Collegiate nationals, I only weighed 120.5kgs going in and did much better with that cut. It also helped that I was on the platform with the most flights so it gave me more time to recover between events. Final lifts were a 617lb Squat, 375 lb Bench, and a 573 lb deadlift. You can see those lifts [here.](https://www.instagram.com/p/BSrfEjIBLRz) Unfortunately, my bench felt really bad the day of, so no improvement there, but everything else went great. I went 7/9 where I hit all 3 squats, 2 benches, and 2 deadlifts. I missed a 601lb deadlift in order to secure 7th (which is about the best I could have done considering the people I was competing against.)\n\n&amp;nbsp;\n\n**Final Thoughts**\n\nHonestly, this program worked better than I thought it would. I made improvements in the second program though I lost weight (my suits and shirt definitely were looser than they were the first program) and I had to start wrapping my own knees. Even though, I didn't gain any extra poundage on my bench the second half, the bar path and control was significantly better. I am disappointed that I missed the 600lb deadlift on my final attempt, but it is definitely doable in the near future. I give this program a 7/10. I do need to improve fatigue management and start doing more work in the bottom and middle of my bench since that's where I always miss for strength reasons. I also have to get my raw bench up if I have any hope of increasing my equipped bench. If anyone else has experience with programming equipped lifting, I would love some pointers or to chat and get some more info about it. In the future, I just plan to improve upon this program now that I've started figuring out what works and what doesn't.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Program Review", "id": "65diu0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 47, "report_reasons": null, "author": "amine802", "saved": false, "mod_reports": [], "name": "t3_65diu0", "subreddit_name_prefixed": "r/weightroom", "approved_by": null, "over_18": false, "domain": "self.weightroom", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ssmu", "edited": false, "link_flair_css_class": "", "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/weightroom/comments/65diu0/program_review_gzcl_dark_side_xpost_rpowerlifting/", "num_reports": null, "locked": false, "stickied": false, "created": 1492216047.0, "url": "https://www.reddit.com/r/weightroom/comments/65diu0/program_review_gzcl_dark_side_xpost_rpowerlifting/", "author_flair_text": "General - Strength Training", "quarantine": false, "title": "[Program Review] GZCL Dark Side (X-post /r/powerlifting)", "created_utc": 1492187247.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 47}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ssmu", "removal_reason": null, "link_id": "t3_65diu0", "likes": null, "replies": "", "user_reports": [], "id": "dg9d0uf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mentionhelper", "parent_id": "t3_65diu0", "subreddit_name_prefixed": "r/weightroom", "controversiality": 1, "body": "It looks like you're trying to mention another user, which only works if it's done in the comments like this (otherwise they don't receive a notification): \n\n- /u/gzcl\n\n\n\n---\n\n ^I'm ^a ^bot. ^Bleep. ^Bloop. ^| ^Visit ^/r/mentionhelper ^for ^discussion/feedback ^| ^Want ^to ^be ^left ^alone? ^Reply ^to ^this ^message ^with ^\"stop\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like you&amp;#39;re trying to mention another user, which only works if it&amp;#39;s done in the comments like this (otherwise they don&amp;#39;t receive a notification): &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"/u/gzcl\"&gt;/u/gzcl&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;sup&gt;I&amp;#39;m&lt;/sup&gt; &lt;sup&gt;a&lt;/sup&gt; &lt;sup&gt;bot.&lt;/sup&gt; &lt;sup&gt;Bleep.&lt;/sup&gt; &lt;sup&gt;Bloop.&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;Visit&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"/r/mentionhelper\"&gt;/r/mentionhelper&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;for&lt;/sup&gt; &lt;sup&gt;discussion/feedback&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;Want&lt;/sup&gt; &lt;sup&gt;to&lt;/sup&gt; &lt;sup&gt;be&lt;/sup&gt; &lt;sup&gt;left&lt;/sup&gt; &lt;sup&gt;alone?&lt;/sup&gt; &lt;sup&gt;Reply&lt;/sup&gt; &lt;sup&gt;to&lt;/sup&gt; &lt;sup&gt;this&lt;/sup&gt; &lt;sup&gt;message&lt;/sup&gt; &lt;sup&gt;with&lt;/sup&gt; &lt;sup&gt;&amp;quot;stop&amp;quot;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "weightroom", "name": "t1_dg9d0uf", "score_hidden": false, "stickied": false, "created": 1492216066.0, "created_utc": 1492187266.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]