[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I seem to have this buffer up which prevents a lot of people from approaching me. My face and demeanor are serious. I&amp;#39;ve been told this all my life. However, once I get close to the people I have gotten close to (usually it&amp;#39;s difficult), we have these very rich, warm, and fun relationships. &lt;/p&gt;\n\n&lt;p&gt;Unfortunately right now I am in an area where I don&amp;#39;t know anybody and I&amp;#39;m running into this unapproachability problem. I don&amp;#39;t really know what to do. I think if I just start smiling all of the time, it will look creepy. And if I approach other people, unless I&amp;#39;m drunk, they tend to put their guard up. &lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;m not looking for tips so much as I&amp;#39;m curious if anyone here has actually made that kind of transition? And if so, then of course I&amp;#39;d like to hear some tips. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I seem to have this buffer up which prevents a lot of people from approaching me. My face and demeanor are serious. I've been told this all my life. However, once I get close to the people I have gotten close to (usually it's difficult), we have these very rich, warm, and fun relationships. \n\nUnfortunately right now I am in an area where I don't know anybody and I'm running into this unapproachability problem. I don't really know what to do. I think if I just start smiling all of the time, it will look creepy. And if I approach other people, unless I'm drunk, they tend to put their guard up. \n\nBut I'm not looking for tips so much as I'm curious if anyone here has actually made that kind of transition? And if so, then of course I'd like to hear some tips. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64rjwd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 46, "report_reasons": null, "author": "differonzi", "saved": false, "mod_reports": [], "name": "t3_64rjwd", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/64rjwd/have_any_of_you_successfully_become_approachable/", "num_reports": null, "locked": false, "stickied": false, "created": 1491953613.0, "url": "https://www.reddit.com/r/selfimprovement/comments/64rjwd/have_any_of_you_successfully_become_approachable/", "author_flair_text": null, "quarantine": false, "title": "Have any of you successfully become \"approachable\" (aka neutral/grimacing as a default to smiling, etc)?", "created_utc": 1491924813.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 46}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_64rjwd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_64rjwd", "likes": null, "replies": "", "user_reports": [], "id": "dg4kcfs", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "differonzi", "parent_id": "t1_dg4iqxd", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Thanks for your post. \n\n&gt;So when i am in public, I smile all the time. I have my \"resting smile\", which is me smiling just enough to make it look like I am a pleasant person, and then there's my 1000 mega-watt smile, that I turn on if anyone catches my eye, bumps into me, talks to me, whatever. I make what feels to me like a crazy, exaggerated smile, because even though TO ME it feels insane, TO OTHERS it just looks like a nice smile. I have practiced it in the mirror a lot, and my 1000 mega-watt smile just looks like a normal, pleasant smile, **but it FEELS weird because I have to really engage my face to make it.** \n\nYeah, that's pretty spot on. I'm just not used to doing this thing with my face everytime I'm walking down the street. Could be at least trying as an experiment and then seeing the results. \n\nGood luck with the weight loss. How much more are you looking to lose?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your post. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So when i am in public, I smile all the time. I have my &amp;quot;resting smile&amp;quot;, which is me smiling just enough to make it look like I am a pleasant person, and then there&amp;#39;s my 1000 mega-watt smile, that I turn on if anyone catches my eye, bumps into me, talks to me, whatever. I make what feels to me like a crazy, exaggerated smile, because even though TO ME it feels insane, TO OTHERS it just looks like a nice smile. I have practiced it in the mirror a lot, and my 1000 mega-watt smile just looks like a normal, pleasant smile, &lt;strong&gt;but it FEELS weird because I have to really engage my face to make it.&lt;/strong&gt; &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah, that&amp;#39;s pretty spot on. I&amp;#39;m just not used to doing this thing with my face everytime I&amp;#39;m walking down the street. Could be at least trying as an experiment and then seeing the results. &lt;/p&gt;\n\n&lt;p&gt;Good luck with the weight loss. How much more are you looking to lose?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg4kcfs", "score_hidden": false, "stickied": false, "created": 1491959389.0, "created_utc": 1491930589.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_64rjwd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_64rjwd", "likes": null, "replies": "", "user_reports": [], "id": "dg63jaq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dolphinesque", "parent_id": "t1_dg5z8dt", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Thanks, I'm currently two and a half weeks in on the keto diet, and I'm exercising three to five days a week. I'm really working hard at it. In the meantime though, wearing makeup helps me feel good about myself, so I'll continue to do that, regardless of what weight I'm at.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, I&amp;#39;m currently two and a half weeks in on the keto diet, and I&amp;#39;m exercising three to five days a week. I&amp;#39;m really working hard at it. In the meantime though, wearing makeup helps me feel good about myself, so I&amp;#39;ll continue to do that, regardless of what weight I&amp;#39;m at.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg63jaq", "score_hidden": false, "stickied": false, "created": 1492042742.0, "created_utc": 1492013942.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5z8dt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PM_ME_PET_PICTURES", "parent_id": "t1_dg4iqxd", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I used to have the exact same problem as you. My best advice is cut the time that you spend on makeup and hair, and make weight loss your priority. Trust me, it'll change your life. I believe in you ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to have the exact same problem as you. My best advice is cut the time that you spend on makeup and hair, and make weight loss your priority. Trust me, it&amp;#39;ll change your life. I believe in you &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg5z8dt", "score_hidden": false, "stickied": false, "created": 1492038034.0, "created_utc": 1492009234.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4iqxd", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "dolphinesque", "parent_id": "t3_64rjwd", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Yes. \n\nI am an overweight woman and my face is jowly (leading to \"resting bitch face\"). If you're beautiful and slender and have resting bitch face, that's not a problem, because you're beautiful and slender and people will just think you're aloof because you're so beautiful that you have to be. But when you are overweight, people are already judging you, so I had to make some changes. \n\nIt depends on where I'm going and what I'm doing, but if I need to be approachable, I ABSOLUTELY have to dress well, do my hair, and put on makeup. I put a lot of effort into my appearance. It makes a huge difference. There is a huge difference in how I am treated when I am in jeans and a t-shirt, and no makeup, vs. a really nice outfit, expensive shoes, and makeup. \n\nRegardless of where I am, I have to smile. It was hard at first, because I wasn't used to it. But I have resting bitch face, so my natural face looks kinda angry. And when you are overweight AND look kinda bitchy, it doesn't matter what kind of person you are on the inside, people make judgments about you. So when i am in public, I smile all the time. I have my \"resting smile\", which is me smiling just enough to make it look like I am a pleasant person, and then there's my 1000 mega-watt smile, that I turn on if anyone catches my eye, bumps into me, talks to me, whatever. I make what feels to me like a crazy, exaggerated smile, because even though TO ME it feels insane, TO OTHERS it just looks like a nice smile. I have practiced it in the mirror a lot, and my 1000 mega-watt smile just looks like a normal, pleasant smile, but it FEELS weird because I have to really engage my face to make it. Again, I am jowly so my lips turn down a bit at the corners, so I HAVE to smile just to look like I'm not a serial killer, and I have to smile EXTRA BIG to look like I'm smiling at all. \n\nI practiced and practiced and now it's second nature. I get treated A LOT differently, no doubt. An overweight woman smiling is treated much better than one who looks pissed off and bitchy. \n\nI'm also working on losing the weight, that's important too, I think. But until then, I will keep on smiling. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. &lt;/p&gt;\n\n&lt;p&gt;I am an overweight woman and my face is jowly (leading to &amp;quot;resting bitch face&amp;quot;). If you&amp;#39;re beautiful and slender and have resting bitch face, that&amp;#39;s not a problem, because you&amp;#39;re beautiful and slender and people will just think you&amp;#39;re aloof because you&amp;#39;re so beautiful that you have to be. But when you are overweight, people are already judging you, so I had to make some changes. &lt;/p&gt;\n\n&lt;p&gt;It depends on where I&amp;#39;m going and what I&amp;#39;m doing, but if I need to be approachable, I ABSOLUTELY have to dress well, do my hair, and put on makeup. I put a lot of effort into my appearance. It makes a huge difference. There is a huge difference in how I am treated when I am in jeans and a t-shirt, and no makeup, vs. a really nice outfit, expensive shoes, and makeup. &lt;/p&gt;\n\n&lt;p&gt;Regardless of where I am, I have to smile. It was hard at first, because I wasn&amp;#39;t used to it. But I have resting bitch face, so my natural face looks kinda angry. And when you are overweight AND look kinda bitchy, it doesn&amp;#39;t matter what kind of person you are on the inside, people make judgments about you. So when i am in public, I smile all the time. I have my &amp;quot;resting smile&amp;quot;, which is me smiling just enough to make it look like I am a pleasant person, and then there&amp;#39;s my 1000 mega-watt smile, that I turn on if anyone catches my eye, bumps into me, talks to me, whatever. I make what feels to me like a crazy, exaggerated smile, because even though TO ME it feels insane, TO OTHERS it just looks like a nice smile. I have practiced it in the mirror a lot, and my 1000 mega-watt smile just looks like a normal, pleasant smile, but it FEELS weird because I have to really engage my face to make it. Again, I am jowly so my lips turn down a bit at the corners, so I HAVE to smile just to look like I&amp;#39;m not a serial killer, and I have to smile EXTRA BIG to look like I&amp;#39;m smiling at all. &lt;/p&gt;\n\n&lt;p&gt;I practiced and practiced and now it&amp;#39;s second nature. I get treated A LOT differently, no doubt. An overweight woman smiling is treated much better than one who looks pissed off and bitchy. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also working on losing the weight, that&amp;#39;s important too, I think. But until then, I will keep on smiling. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg4iqxd", "score_hidden": false, "stickied": false, "created": 1491957656.0, "created_utc": 1491928856.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_64rjwd", "likes": null, "replies": "", "user_reports": [], "id": "dg52ign", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Ski-gal", "parent_id": "t3_64rjwd", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I highly recommend reading \"The Charisma Myth\". It has great tips to help with first impressions. It even gives advice on how to handle all of that charisma it teaches you to project, lol.  I thought that was absurd until I kept finding strangers who would talk my ear when I used the tips. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I highly recommend reading &amp;quot;The Charisma Myth&amp;quot;. It has great tips to help with first impressions. It even gives advice on how to handle all of that charisma it teaches you to project, lol.  I thought that was absurd until I kept finding strangers who would talk my ear when I used the tips. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg52ign", "score_hidden": false, "stickied": false, "created": 1491980059.0, "created_utc": 1491951259.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_64rjwd", "likes": null, "replies": "", "user_reports": [], "id": "dg4ysbv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jau682", "parent_id": "t3_64rjwd", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I did it. I smiled all the time and approached people with a big smile and obvious intentions. Leave nothing to interpretation and most people will not find it creepy. As long as you aren't trying to get something out of them it's fine. Go for it :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did it. I smiled all the time and approached people with a big smile and obvious intentions. Leave nothing to interpretation and most people will not find it creepy. As long as you aren&amp;#39;t trying to get something out of them it&amp;#39;s fine. Go for it :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg4ysbv", "score_hidden": false, "stickied": false, "created": 1491975364.0, "created_utc": 1491946564.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_64rjwd", "likes": null, "replies": "", "user_reports": [], "id": "dg5h5eu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Guacomaco", "parent_id": "t3_64rjwd", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Yep. It takes a lot of work, it will be uncomfortable and painful at times, but it is so so worth it. The trick to becoming approachable, is to be comfortable approaching yourself. I spent a couple of years where i had the rule that every single day i would approach at least one stranger a day (most days i tried to do 5 strangers a day). I tried to make it a girl that intimidated me each day but sometimes it would be the janitor at the restaurant i worked at, or just some random dude. At first it was so fucking hard, and i felt so embarrassed and awkward. After a while it became much more normal and i just wasn't freaked out by people any more. I noticed people would come up to me and start conversations more often and when i would approach them, they almost always responded positively. \n\nI will say; i think relying on others to approach you is a downright terrible idea. If you are a guy, no matter how \"approachable\" you are, people will seldomly approach you, even if you are incredibly socially successful. Get comfortable approaching others, especially people who intimidate you, if you really want to get over this. You even said it yourself; people respond well to your approach *when you're drunk*. This is because you're much more calm and level headed. In my opinion, you should work on getting to that headspace without alchohol. Because its really not *that* hard in the grand scheme of things. Honestly its one of the best journeys i've ever undertaken.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep. It takes a lot of work, it will be uncomfortable and painful at times, but it is so so worth it. The trick to becoming approachable, is to be comfortable approaching yourself. I spent a couple of years where i had the rule that every single day i would approach at least one stranger a day (most days i tried to do 5 strangers a day). I tried to make it a girl that intimidated me each day but sometimes it would be the janitor at the restaurant i worked at, or just some random dude. At first it was so fucking hard, and i felt so embarrassed and awkward. After a while it became much more normal and i just wasn&amp;#39;t freaked out by people any more. I noticed people would come up to me and start conversations more often and when i would approach them, they almost always responded positively. &lt;/p&gt;\n\n&lt;p&gt;I will say; i think relying on others to approach you is a downright terrible idea. If you are a guy, no matter how &amp;quot;approachable&amp;quot; you are, people will seldomly approach you, even if you are incredibly socially successful. Get comfortable approaching others, especially people who intimidate you, if you really want to get over this. You even said it yourself; people respond well to your approach &lt;em&gt;when you&amp;#39;re drunk&lt;/em&gt;. This is because you&amp;#39;re much more calm and level headed. In my opinion, you should work on getting to that headspace without alchohol. Because its really not &lt;em&gt;that&lt;/em&gt; hard in the grand scheme of things. Honestly its one of the best journeys i&amp;#39;ve ever undertaken.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg5h5eu", "score_hidden": false, "stickied": false, "created": 1492000541.0, "created_utc": 1491971741.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]