[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I realy don&amp;#39;t know what to do, and i feel stuck. I dont&amp;#39;t have any friends since high school, am unemployed and i&amp;#39;m still living together with my mom. I had a gf a year ago, but i broke up with her because that relationship was getting very bad for my health. I&amp;#39;m spending my days looking for a job online, not realy going outside, only to go to the grocery store or running, which i can&amp;#39;t do anymore because i&amp;#39;m way too sore. This has been going on for about 6 months, and i realy want this to stop, because i&amp;#39;m getting very depressed. I just don&amp;#39;t know how to get out of this, and i feel as i&amp;#39;ve lost my chance on life. I also experience a lot of social anxiety and this makes me isolate myself. Anyone experiencing the same? Have any advice?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I realy don't know what to do, and i feel stuck. I dont't have any friends since high school, am unemployed and i'm still living together with my mom. I had a gf a year ago, but i broke up with her because that relationship was getting very bad for my health. I'm spending my days looking for a job online, not realy going outside, only to go to the grocery store or running, which i can't do anymore because i'm way too sore. This has been going on for about 6 months, and i realy want this to stop, because i'm getting very depressed. I just don't know how to get out of this, and i feel as i've lost my chance on life. I also experience a lot of social anxiety and this makes me isolate myself. Anyone experiencing the same? Have any advice?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64zcr7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "fapnaut77", "saved": false, "mod_reports": [], "name": "t3_64zcr7", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/64zcr7/24m_i_feel_stuck_dont_know_what_to_do/", "num_reports": null, "locked": false, "stickied": false, "created": 1492044459.0, "url": "https://www.reddit.com/r/selfimprovement/comments/64zcr7/24m_i_feel_stuck_dont_know_what_to_do/", "author_flair_text": null, "quarantine": false, "title": "[24M] I feel stuck, don't know what to do.", "created_utc": 1492015659.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_64zcr7", "likes": null, "replies": "", "user_reports": [], "id": "dg6dqqe", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Rocksteady2R", "parent_id": "t3_64zcr7", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "find some routine, make some rituals that get you out of that funk.   It's a pretty normalized funk you're describing - got no job, got no girl, got no motivation.  \n\nStart a 5 or 10 minute morning exerccise routine, after you've brushed your teeth.  \n\nThen make sure you also go outside once a day for whatever reason - walk around the park/neighborhood, meditate outdoors, go get the mail, whatever.\n\nLook for a roomate in teh RW for 10 minutes a day until you find something reasonable.  \n\nLook for a job for 1 hour a day (or more, really, but for starters, go easy).\n\nI'm a huge proselytizer of /r/theXeffect.  swing over there and check out those folks, they do good well at starting and building momentum in exactly these kinds of hurdles.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;find some routine, make some rituals that get you out of that funk.   It&amp;#39;s a pretty normalized funk you&amp;#39;re describing - got no job, got no girl, got no motivation.  &lt;/p&gt;\n\n&lt;p&gt;Start a 5 or 10 minute morning exerccise routine, after you&amp;#39;ve brushed your teeth.  &lt;/p&gt;\n\n&lt;p&gt;Then make sure you also go outside once a day for whatever reason - walk around the park/neighborhood, meditate outdoors, go get the mail, whatever.&lt;/p&gt;\n\n&lt;p&gt;Look for a roomate in teh RW for 10 minutes a day until you find something reasonable.  &lt;/p&gt;\n\n&lt;p&gt;Look for a job for 1 hour a day (or more, really, but for starters, go easy).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a huge proselytizer of &lt;a href=\"/r/theXeffect\"&gt;/r/theXeffect&lt;/a&gt;.  swing over there and check out those folks, they do good well at starting and building momentum in exactly these kinds of hurdles.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg6dqqe", "score_hidden": false, "stickied": false, "created": 1492053196.0, "created_utc": 1492024396.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_64zcr7", "likes": null, "replies": "", "user_reports": [], "id": "dg73844", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "orxaltheon", "parent_id": "t3_64zcr7", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "The fact that you go out for a run already makes you 500% better than the other people in your situation. \n\nSocial anxiety however is a very strong wedge that's stopping you from being successful in your life.\n\n&amp;nbsp;\n\nUnfortunately, your issue is deeply psychological, and probably no amount of advice online may truly make it go away. The first road to improvement is admittance and knowing exactly what's wrong - look for and talk with a psychologist and your social anxiety will no longer have a deep hold on you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The fact that you go out for a run already makes you 500% better than the other people in your situation. &lt;/p&gt;\n\n&lt;p&gt;Social anxiety however is a very strong wedge that&amp;#39;s stopping you from being successful in your life.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Unfortunately, your issue is deeply psychological, and probably no amount of advice online may truly make it go away. The first road to improvement is admittance and knowing exactly what&amp;#39;s wrong - look for and talk with a psychologist and your social anxiety will no longer have a deep hold on you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg73844", "score_hidden": false, "stickied": false, "created": 1492083588.0, "created_utc": 1492054788.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_64zcr7", "likes": null, "replies": "", "user_reports": [], "id": "dg6kzou", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Pushedbyboredom", "parent_id": "t3_64zcr7", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "\"The Way of the Superior Man\" by David Deida is a great book, much of which is about living with a purpose. Highly recommend. \n\nOther than that, you might have to just bite the bullet and do some shit you don't feel like doing or feel you \"can't\" do for whatever reason (too sore, too depressed, too socially anxious/anxious in general). None of those things are actually MAKING you do/not do anything. People go for runs while sore all the time. People take on social situations despite anxiety all the time. Etc. You can too. You CAN do it. It'll just be hard at first, but \"it's hard\" is like the lamest excuse you can give yourself for not doing something you know is good for you.  Get comfortable being a little uncomfortable. Start a little slow, approaching your edge, and slowly begin living just beyond it. You can do it, man. You didn't lose out on life. You're young as hell. Your doors are still all open if you want to go through them. Decide what you want to struggle towards and start the climb. Motivation doesn't just happen ; it's bred from action. \n\nYou can pull yourself out of this. Don't give yourself excuses why you can't. You're the man!\n\nPM me if you wanna talk more. I've been where you are. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;The Way of the Superior Man&amp;quot; by David Deida is a great book, much of which is about living with a purpose. Highly recommend. &lt;/p&gt;\n\n&lt;p&gt;Other than that, you might have to just bite the bullet and do some shit you don&amp;#39;t feel like doing or feel you &amp;quot;can&amp;#39;t&amp;quot; do for whatever reason (too sore, too depressed, too socially anxious/anxious in general). None of those things are actually MAKING you do/not do anything. People go for runs while sore all the time. People take on social situations despite anxiety all the time. Etc. You can too. You CAN do it. It&amp;#39;ll just be hard at first, but &amp;quot;it&amp;#39;s hard&amp;quot; is like the lamest excuse you can give yourself for not doing something you know is good for you.  Get comfortable being a little uncomfortable. Start a little slow, approaching your edge, and slowly begin living just beyond it. You can do it, man. You didn&amp;#39;t lose out on life. You&amp;#39;re young as hell. Your doors are still all open if you want to go through them. Decide what you want to struggle towards and start the climb. Motivation doesn&amp;#39;t just happen ; it&amp;#39;s bred from action. &lt;/p&gt;\n\n&lt;p&gt;You can pull yourself out of this. Don&amp;#39;t give yourself excuses why you can&amp;#39;t. You&amp;#39;re the man!&lt;/p&gt;\n\n&lt;p&gt;PM me if you wanna talk more. I&amp;#39;ve been where you are. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg6kzou", "score_hidden": false, "stickied": false, "created": 1492060817.0, "created_utc": 1492032017.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]