[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I used to get up at 6am every morning like clockwork, but I&amp;#39;m going through a period where I can rarely get up before 1:30pm (extreme difference, I know). I normally hate it when I don&amp;#39;t wake up before 8. How can I change this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I used to get up at 6am every morning like clockwork, but I'm going through a period where I can rarely get up before 1:30pm (extreme difference, I know). I normally hate it when I don't wake up before 8. How can I change this?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6532jc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "TurtleOnTheRocks", "saved": false, "mod_reports": [], "name": "t3_6532jc", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/6532jc/i_cant_wake_up_in_the_mornings_and_need_to_change/", "num_reports": null, "locked": false, "stickied": false, "created": 1492082590.0, "url": "https://www.reddit.com/r/selfimprovement/comments/6532jc/i_cant_wake_up_in_the_mornings_and_need_to_change/", "author_flair_text": null, "quarantine": false, "title": "I can't wake up in the mornings and need to change that", "created_utc": 1492053790.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_6532jc", "likes": null, "replies": "", "user_reports": [], "id": "dg74cuq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "dolphinesque", "parent_id": "t3_6532jc", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I know this is not what you are looking for. But there are a million websites out there on this very issue, on how to get to sleep earlier, how to change your habits, and so on. \n\nBut the bottom line is you don't HAVE to get up. \n\nI have to get up early for work every day. If I don't get up, I can't pay my bills. So that's my motivation. If I could sleep in until 1:30 p.m., I would. Many of us would. You're not changing it because it's more comfortable to get up at 1:30 than it is to get up at 6:00 or 8:00, or even 10:00. \n\nIf I told you that I wanted to meet you on the nearest street corner to you at 8:00 a.m. sharp tomorrow morning, and if you made it there, I'd give you $5,000 dollars, I guarantee you'd wake up and be there. You'd set three alarms, you'd have a friend call (or even stop by), you'd probably even show up by 7:30 a.m. just to make sure you didn't miss the opportunity. So you absolutely CAN wake up early. You have the physical capability. You just don't WANT to. \n \nSo I have 2 thoughts. The first thought is to just start making it a habit. Set your alarm for 9 a.m. and just start getting up at 9 no matter what, and do the same thing every morning - make it a routine and a habit. It will be AWFUL at first, and then you'll get used to it. \n\nThe other thought is - live the dream. Just wake up whenever. Yes, the day is half-gone and you feel annoyed with yourself. But if you're not going to change, why bother? If you're just going to stay up till 3 a.m. playing games or watching YouTube, and NOT reading one of the million websites on how to get to sleep at a decent hour, then what can anyone on Reddit say that would change you? I know that sounds harsh. We get asked this question ALL THE TIME and some people just don't want to deal with the discomfort of waking up earlier. If you don't have to, why bother? \n\nYou CAN do it if you want. You really can. You just have to know that it will suck at first, and then t will become a habit and you'll feel proud of it. \n\nStaying up late is really rewarding. We all love it. But if you hate the consequences, then you have to be a \"good parent\" to yourself and put yourself to bed. No electronics. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know this is not what you are looking for. But there are a million websites out there on this very issue, on how to get to sleep earlier, how to change your habits, and so on. &lt;/p&gt;\n\n&lt;p&gt;But the bottom line is you don&amp;#39;t HAVE to get up. &lt;/p&gt;\n\n&lt;p&gt;I have to get up early for work every day. If I don&amp;#39;t get up, I can&amp;#39;t pay my bills. So that&amp;#39;s my motivation. If I could sleep in until 1:30 p.m., I would. Many of us would. You&amp;#39;re not changing it because it&amp;#39;s more comfortable to get up at 1:30 than it is to get up at 6:00 or 8:00, or even 10:00. &lt;/p&gt;\n\n&lt;p&gt;If I told you that I wanted to meet you on the nearest street corner to you at 8:00 a.m. sharp tomorrow morning, and if you made it there, I&amp;#39;d give you $5,000 dollars, I guarantee you&amp;#39;d wake up and be there. You&amp;#39;d set three alarms, you&amp;#39;d have a friend call (or even stop by), you&amp;#39;d probably even show up by 7:30 a.m. just to make sure you didn&amp;#39;t miss the opportunity. So you absolutely CAN wake up early. You have the physical capability. You just don&amp;#39;t WANT to. &lt;/p&gt;\n\n&lt;p&gt;So I have 2 thoughts. The first thought is to just start making it a habit. Set your alarm for 9 a.m. and just start getting up at 9 no matter what, and do the same thing every morning - make it a routine and a habit. It will be AWFUL at first, and then you&amp;#39;ll get used to it. &lt;/p&gt;\n\n&lt;p&gt;The other thought is - live the dream. Just wake up whenever. Yes, the day is half-gone and you feel annoyed with yourself. But if you&amp;#39;re not going to change, why bother? If you&amp;#39;re just going to stay up till 3 a.m. playing games or watching YouTube, and NOT reading one of the million websites on how to get to sleep at a decent hour, then what can anyone on Reddit say that would change you? I know that sounds harsh. We get asked this question ALL THE TIME and some people just don&amp;#39;t want to deal with the discomfort of waking up earlier. If you don&amp;#39;t have to, why bother? &lt;/p&gt;\n\n&lt;p&gt;You CAN do it if you want. You really can. You just have to know that it will suck at first, and then t will become a habit and you&amp;#39;ll feel proud of it. &lt;/p&gt;\n\n&lt;p&gt;Staying up late is really rewarding. We all love it. But if you hate the consequences, then you have to be a &amp;quot;good parent&amp;quot; to yourself and put yourself to bed. No electronics. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg74cuq", "score_hidden": false, "stickied": false, "created": 1492085279.0, "created_utc": 1492056479.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]