[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, as you read the post more I&amp;#39;m probably going to get tore in to for how stupid it is for me to be reacting this way but I could use some advice!&lt;/p&gt;\n\n&lt;p&gt;Might be relevant - I don&amp;#39;t really enjoy drinking at all or find the bar environment enjoyable at all and I really don&amp;#39;t enjoy dancing at all.&lt;/p&gt;\n\n&lt;p&gt;The problem I&amp;#39;m having is, whenever my girlfriend goes out to drink with her friends/family (they are all big into that scene) or I even hear her make plans to do this in a few days/whatever I get almost sad and and extremely shitty feeling in my stomach that I can&amp;#39;t really shake, and I am distracted/feeling shitty all while shes out. She enjoys drinking and dancing pretty infrequently, I&amp;#39;d say she probably goes out maybe 4 times a year at most, so its not like shes just a party girl going out every weekend. She says that she enjoys drinking every once in a while to de-stress and enjoys dancing because she finds it fun and she feels sexy when she does it (I don&amp;#39;t get the dancing part really but it kind of makes sense to me). I&amp;#39;ve been with her dancing, and shes pretty goofy and absolutely hates people touching her, but she will dance with other guys/girls/whatever (and by dance with other guys I mean just randomly dancing/looking at/jumping/flailing arms in the direction of the person, never physical). Initially the dancing with other guys bothered me but she explained to me how she is just dancing with anyone who wants to dance (whether shes naive about most guy&amp;#39;s intentions when they are dancing with a girl in a club/bar I don&amp;#39;t know, but it&amp;#39;s not really a big deal anymore to me I don&amp;#39;t think, could be lying to myself because I clearly am uncomfortable with her going out still but more info on that in a minute) and she never gets physical with anyone, would never grind in her life (not even me, she thinks its classless) and I&amp;#39;ve seen her push guys who get too close on her so there&amp;#39;s that.&lt;/p&gt;\n\n&lt;p&gt;Anyway, what prompted me to make this post today is I found out shes going to be going out with her sister(who&amp;#39;s visiting from out of state), another sister (who&amp;#39;s married and pregnant), and her cousin (who&amp;#39;s married as well). The reason I mention the married/etc thing is to give scope on what type of going out it is, I honestly believe there are no bad intentions when she goes out or anything shady going on, but clearly I&amp;#39;m still bothered and I&amp;#39;m really not sure why and I really would like to change my mindset on that. And just to make things clear, she doesn&amp;#39;t always go out without me so its not anything like that, its just a girls thing with her sister who&amp;#39;s in from out of town I guess, I&amp;#39;ve been invited plenty (but I dislike seeing my GF drunk for some reason, possible reason incoming).&lt;/p&gt;\n\n&lt;p&gt;I think some of my discomfort has to do from early in our relationship (been together over 2 and a half years now). I&amp;#39;ve had a couple negative experiences associated with her drinking/getting drunk and I think that is possible what could be triggering my discomfort? Just bad associations? *&lt;em&gt;The bad experience: *&lt;/em&gt; We started dating way too early honestly. She had been broken up with her ex of 4 years for only about a month, but I was naive (first real relationship) so I got in to that bullshit. About 3 or 4 months in to our relationship she went out with her ex for lunch (Yeah, I have no idea why the fuck I was cool with that either, don&amp;#39;t have to even comment on it... I&amp;#39;ve learned from experience!) and we were supposed to do something later that night (lets just say 7pm) anyway, 7pm comes and goes and nothing, try to call her, nothing. 10pm comes around and she calls me telling me shes home and shes pretty drunk. Not really sure the details of it but apparently her and her ex had some drinks at some point (nothing happened, I trust her on that because something did happen later with him before she cut ties with him for good and she was up front about it) which I think understandably pissed me off. &lt;/p&gt;\n\n&lt;p&gt;When considering all these things I can&amp;#39;t even pinpoint what makes me feel uncomfortable. Logically I know there isn&amp;#39;t anything wrong with what shes doing and no reason for me to stress, but I can&amp;#39;t stop myself from feeling sick to my stomach. I try not to let it effect me, but based off my wall of text is clearly does and I don&amp;#39;t want to continue feeling like this whenever she goes out dancing with her sisters or even drinks when I&amp;#39;m there.&lt;/p&gt;\n\n&lt;p&gt;Any advice is welcome!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR: Every time my girlfriend drinks I feel sick to my stomach for basically no reason. How do I stop giving a shit?&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, as you read the post more I'm probably going to get tore in to for how stupid it is for me to be reacting this way but I could use some advice!\n\nMight be relevant - I don't really enjoy drinking at all or find the bar environment enjoyable at all and I really don't enjoy dancing at all.\n\nThe problem I'm having is, whenever my girlfriend goes out to drink with her friends/family (they are all big into that scene) or I even hear her make plans to do this in a few days/whatever I get almost sad and and extremely shitty feeling in my stomach that I can't really shake, and I am distracted/feeling shitty all while shes out. She enjoys drinking and dancing pretty infrequently, I'd say she probably goes out maybe 4 times a year at most, so its not like shes just a party girl going out every weekend. She says that she enjoys drinking every once in a while to de-stress and enjoys dancing because she finds it fun and she feels sexy when she does it (I don't get the dancing part really but it kind of makes sense to me). I've been with her dancing, and shes pretty goofy and absolutely hates people touching her, but she will dance with other guys/girls/whatever (and by dance with other guys I mean just randomly dancing/looking at/jumping/flailing arms in the direction of the person, never physical). Initially the dancing with other guys bothered me but she explained to me how she is just dancing with anyone who wants to dance (whether shes naive about most guy's intentions when they are dancing with a girl in a club/bar I don't know, but it's not really a big deal anymore to me I don't think, could be lying to myself because I clearly am uncomfortable with her going out still but more info on that in a minute) and she never gets physical with anyone, would never grind in her life (not even me, she thinks its classless) and I've seen her push guys who get too close on her so there's that.\n\nAnyway, what prompted me to make this post today is I found out shes going to be going out with her sister(who's visiting from out of state), another sister (who's married and pregnant), and her cousin (who's married as well). The reason I mention the married/etc thing is to give scope on what type of going out it is, I honestly believe there are no bad intentions when she goes out or anything shady going on, but clearly I'm still bothered and I'm really not sure why and I really would like to change my mindset on that. And just to make things clear, she doesn't always go out without me so its not anything like that, its just a girls thing with her sister who's in from out of town I guess, I've been invited plenty (but I dislike seeing my GF drunk for some reason, possible reason incoming).\n\nI think some of my discomfort has to do from early in our relationship (been together over 2 and a half years now). I've had a couple negative experiences associated with her drinking/getting drunk and I think that is possible what could be triggering my discomfort? Just bad associations? **The bad experience: ** We started dating way too early honestly. She had been broken up with her ex of 4 years for only about a month, but I was naive (first real relationship) so I got in to that bullshit. About 3 or 4 months in to our relationship she went out with her ex for lunch (Yeah, I have no idea why the fuck I was cool with that either, don't have to even comment on it... I've learned from experience!) and we were supposed to do something later that night (lets just say 7pm) anyway, 7pm comes and goes and nothing, try to call her, nothing. 10pm comes around and she calls me telling me shes home and shes pretty drunk. Not really sure the details of it but apparently her and her ex had some drinks at some point (nothing happened, I trust her on that because something did happen later with him before she cut ties with him for good and she was up front about it) which I think understandably pissed me off. \n\nWhen considering all these things I can't even pinpoint what makes me feel uncomfortable. Logically I know there isn't anything wrong with what shes doing and no reason for me to stress, but I can't stop myself from feeling sick to my stomach. I try not to let it effect me, but based off my wall of text is clearly does and I don't want to continue feeling like this whenever she goes out dancing with her sisters or even drinks when I'm there.\n\nAny advice is welcome!\n\n**TL;DR: Every time my girlfriend drinks I feel sick to my stomach for basically no reason. How do I stop giving a shit?**", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "653dzb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1, "report_reasons": null, "author": "sterowayz5", "saved": false, "mod_reports": [], "name": "t3_653dzb", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/653dzb/how_can_i_stop_feeling_sick_to_my_stomach_when_my/", "num_reports": null, "locked": false, "stickied": false, "created": 1492086776.0, "url": "https://www.reddit.com/r/selfimprovement/comments/653dzb/how_can_i_stop_feeling_sick_to_my_stomach_when_my/", "author_flair_text": null, "quarantine": false, "title": "How can I stop feeling sick to my stomach when my girlfriend drinks/goes out? (possibly insecurity?)", "created_utc": 1492057976.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_653dzb", "likes": null, "replies": "", "user_reports": [], "id": "dg7g76g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "elegyofdust", "parent_id": "t3_653dzb", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "You've just gotta realize that her actions are completely her own, and even if something happens, there's nothing you can do about it. Once you realize this I think you'll begin to feel better (more relaxed) about it. You've gotta trust her as much as you're doubting yourself right now.\n\nIn the event something does happen and your gut feeling turns out to be justified, just know that you've done what you can. Again, she is responsible for her own actions. At the end of the day there's nothing you can do. It's not your fault / responsibility. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ve just gotta realize that her actions are completely her own, and even if something happens, there&amp;#39;s nothing you can do about it. Once you realize this I think you&amp;#39;ll begin to feel better (more relaxed) about it. You&amp;#39;ve gotta trust her as much as you&amp;#39;re doubting yourself right now.&lt;/p&gt;\n\n&lt;p&gt;In the event something does happen and your gut feeling turns out to be justified, just know that you&amp;#39;ve done what you can. Again, she is responsible for her own actions. At the end of the day there&amp;#39;s nothing you can do. It&amp;#39;s not your fault / responsibility. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg7g76g", "score_hidden": false, "stickied": false, "created": 1492113903.0, "created_utc": 1492085103.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_653dzb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_653dzb", "likes": null, "replies": "", "user_reports": [], "id": "dg7g6kc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sterowayz5", "parent_id": "t1_dg7d8kp", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I'm not invited.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not invited.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg7g6kc", "score_hidden": false, "stickied": false, "created": 1492113872.0, "created_utc": 1492085072.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_653dzb", "likes": null, "replies": "", "user_reports": [], "id": "dg7g90q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "elegyofdust", "parent_id": "t1_dg7d8kp", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "This is terrible advice. OP, you're not useless or a crybaby. You're just insecure about your relationship.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is terrible advice. OP, you&amp;#39;re not useless or a crybaby. You&amp;#39;re just insecure about your relationship.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg7g90q", "score_hidden": false, "stickied": false, "created": 1492114004.0, "created_utc": 1492085204.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7d8kp", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "GCF1", "parent_id": "t3_653dzb", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Stop being such a cry baby useless boyfriend. She goes out 4 times a year! Go with her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stop being such a cry baby useless boyfriend. She goes out 4 times a year! Go with her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg7d8kp", "score_hidden": false, "stickied": false, "created": 1492106498.0, "created_utc": 1492077698.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -8}}], "after": null, "before": null}}]