[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have a habit of picking up hobbies to stave off existential dread. This works until the hobby is no longer interesting; once this happens, I jump ship and find a new hobby. I&amp;#39;ve found that this method is becoming less and less effective, since I know that my hobbies come from a urge to find a distraction rather than authentic interest. This is not necessarily a bad thing, as I want to learn how to discover genuine interests and I don&amp;#39;t want all my enjoyment to feel artificial. My issue is that I can&amp;#39;t seem to fix this. I&amp;#39;ve set a long term goal which I feel passionate about and concrete short term goals, started a progress journal, and taken substantial steps forward (tfw when boredom supersedes lifelong lack of motivation), but all my progress feels hollow, and I feel like I&amp;#39;ve fallen into my old habits again. Even having made progress, I still cannot find lasting fulfillment. Everything I do feels exactly like the pattern of feeling bored, starting a new game, enjoying it, going for 100% completion, reaching 20%, feeling happy, reaching 50%, feeling happy, reaching 100%, feeling fulfilled, and then feeling bored three hours later, but now I&amp;#39;ve replaced video games with self-improvement. Maybe I have indeed improved myself, but not in the way that I wanted, and I don&amp;#39;t feel any happier for it. I&amp;#39;m still doing what I&amp;#39;ve always done, and what I&amp;#39;ve never been able to fix; distracting myself from existential dread by finding artificial feeling achievement. I think that I&amp;#39;m misidentifying the problem, which is keeping me from taking the right steps to fix it, but I don&amp;#39;t know how to identify the right problem. I&amp;#39;ve tried the &amp;quot;embrace emptiness and learn to use it for spiritual growth,&amp;quot; but it&amp;#39;s always ended with my picking up a mindless activity. Has anyone experienced this and been able to do something about it? Any and all advice would be greatly appreciated. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have a habit of picking up hobbies to stave off existential dread. This works until the hobby is no longer interesting; once this happens, I jump ship and find a new hobby. I've found that this method is becoming less and less effective, since I know that my hobbies come from a urge to find a distraction rather than authentic interest. This is not necessarily a bad thing, as I want to learn how to discover genuine interests and I don't want all my enjoyment to feel artificial. My issue is that I can't seem to fix this. I've set a long term goal which I feel passionate about and concrete short term goals, started a progress journal, and taken substantial steps forward (tfw when boredom supersedes lifelong lack of motivation), but all my progress feels hollow, and I feel like I've fallen into my old habits again. Even having made progress, I still cannot find lasting fulfillment. Everything I do feels exactly like the pattern of feeling bored, starting a new game, enjoying it, going for 100% completion, reaching 20%, feeling happy, reaching 50%, feeling happy, reaching 100%, feeling fulfilled, and then feeling bored three hours later, but now I've replaced video games with self-improvement. Maybe I have indeed improved myself, but not in the way that I wanted, and I don't feel any happier for it. I'm still doing what I've always done, and what I've never been able to fix; distracting myself from existential dread by finding artificial feeling achievement. I think that I'm misidentifying the problem, which is keeping me from taking the right steps to fix it, but I don't know how to identify the right problem. I've tried the \"embrace emptiness and learn to use it for spiritual growth,\" but it's always ended with my picking up a mindless activity. Has anyone experienced this and been able to do something about it? Any and all advice would be greatly appreciated. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "657k2z", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "Assholiness", "saved": false, "mod_reports": [], "name": "t3_657k2z", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": 1492111871.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/657k2z/finding_authentic_enjoyment/", "num_reports": null, "locked": false, "stickied": false, "created": 1492139133.0, "url": "https://www.reddit.com/r/selfimprovement/comments/657k2z/finding_authentic_enjoyment/", "author_flair_text": null, "quarantine": false, "title": "Finding authentic enjoyment.", "created_utc": 1492110333.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_657k2z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_657k2z", "likes": null, "replies": "", "user_reports": [], "id": "dg8oug1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Assholiness", "parent_id": "t1_dg8nlm2", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I'm a student right now and I find classes really unsatisfying even though I tried to choose ones which I find interesting with material which I want to learn :/ I'm trying to get into a pretty selective PhD program, but I've been beginning to wonder how much of that is just me looking for a challenge to dedicate time to. \n\nI've been working on finding more interaction heavy activities, although I've been finding all sorts of excuses to not commit. Hopefully I can find the nerve and they'll take me somewhere. I've been considering seeing a counselor or therapist, there's one in my area who I've heard good things about. Thank you for your input! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a student right now and I find classes really unsatisfying even though I tried to choose ones which I find interesting with material which I want to learn :/ I&amp;#39;m trying to get into a pretty selective PhD program, but I&amp;#39;ve been beginning to wonder how much of that is just me looking for a challenge to dedicate time to. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been working on finding more interaction heavy activities, although I&amp;#39;ve been finding all sorts of excuses to not commit. Hopefully I can find the nerve and they&amp;#39;ll take me somewhere. I&amp;#39;ve been considering seeing a counselor or therapist, there&amp;#39;s one in my area who I&amp;#39;ve heard good things about. Thank you for your input! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg8oug1", "score_hidden": false, "stickied": false, "created": 1492168937.0, "created_utc": 1492140137.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8nlm2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BeBetterBen", "parent_id": "t3_657k2z", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "It sounds like you need a real activity. Try something with more substance that involves other people, like volunteering. If you aren't content in your life, do something about it. Go back to school, take some classes. Ask yourself the hard questions of who you are and what you want to be doing and answer them honestly.\n\nIn addition, it would be healthy to seek a counselor to help guide your thoughts and help break bad habits.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you need a real activity. Try something with more substance that involves other people, like volunteering. If you aren&amp;#39;t content in your life, do something about it. Go back to school, take some classes. Ask yourself the hard questions of who you are and what you want to be doing and answer them honestly.&lt;/p&gt;\n\n&lt;p&gt;In addition, it would be healthy to seek a counselor to help guide your thoughts and help break bad habits.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg8nlm2", "score_hidden": false, "stickied": false, "created": 1492167060.0, "created_utc": 1492138260.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_657k2z", "likes": null, "replies": "", "user_reports": [], "id": "dg82uw9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "participation_ribbon", "parent_id": "t3_657k2z", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Try skydiving. Existential dread *and* authentic enjoyment in one!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try skydiving. Existential dread &lt;em&gt;and&lt;/em&gt; authentic enjoyment in one!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg82uw9", "score_hidden": false, "stickied": false, "created": 1492140464.0, "created_utc": 1492111664.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_657k2z", "likes": null, "replies": "", "user_reports": [], "id": "dg9od9n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sucrerey", "parent_id": "t3_657k2z", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "sad nihilist: \"existential dread is the reason I cant truly enjoy anything\"\n\nhappy nihilist: \"existential dread is the reason I can enjoy almost anything\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;sad nihilist: &amp;quot;existential dread is the reason I cant truly enjoy anything&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;happy nihilist: &amp;quot;existential dread is the reason I can enjoy almost anything&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg9od9n", "score_hidden": false, "stickied": false, "created": 1492229421.0, "created_utc": 1492200621.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_657k2z", "likes": null, "replies": "", "user_reports": [], "id": "dgbsz2v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lionwolfe", "parent_id": "t3_657k2z", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Pick a mindful activity. Something you're so excited about you're ready to do it forever. Turn a passion into a purpose.\n\nFailing that, you got yourself a self-awareness problem, a drastic one. Poor you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pick a mindful activity. Something you&amp;#39;re so excited about you&amp;#39;re ready to do it forever. Turn a passion into a purpose.&lt;/p&gt;\n\n&lt;p&gt;Failing that, you got yourself a self-awareness problem, a drastic one. Poor you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgbsz2v", "score_hidden": false, "stickied": false, "created": 1492355186.0, "created_utc": 1492326386.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]