[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have made sure I have all the basics (according to reddit and common sense) checked; these would be things such as hygiene, grooming, fitness, and dressing nicely. As a matter of fact, luckily, I receive some feedback once in a while from friends at various different places complimenting me on each of those, including a female friend and flatmate who often compliments me on my clothes, being very physically strong, or even just being able to string a few sentences without butchering the language due to poor grammar. I&amp;#39;m the guy who friends (guys, obviously) come up to and ask tips on working out and stuff.&lt;/p&gt;\n\n&lt;p&gt;Now, I make a conscious effort to keep all those factors in check, Mostly because I enjoy the act of paying attention to these things, and not just because I want to impress the opposite sex. I enjoy stuff like looking at myself and seeing that I am able to maintain a healthy body, or that I can combine a set of clothes that complements itself, or simply that I can choose a certain product that leaves my skin smelling wonderfully after a shower.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s the catch, I&amp;#39;m very short. Just shy of 5&amp;#39;6&amp;quot;. My facial features are also quite poor, and therefore I am by no means easy on the eyes; it&amp;#39;s safe to say I&amp;#39;m ugly.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had one sexual encounter with a girl before, and I tried getting the relationship I had with her to become more stable, but in the end it didn&amp;#39;t work out. This happened quite recently as well. I&amp;#39;ve had no luck with women throughout my entire life except on that one occasion, and I&amp;#39;d be lying if I said I don&amp;#39;t miss it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m at university right now, and I am struggling to concentrate on my studies because of this. I genuinely believe that if I were seeing someone, or even just going out meeting different women, I would be able to concentrate much better on my studies as it would bring some sort of stability to my mind, and consequently, my daily routine. Any help would be appreciated, and solving this issue, to me, would be essential.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have made sure I have all the basics (according to reddit and common sense) checked; these would be things such as hygiene, grooming, fitness, and dressing nicely. As a matter of fact, luckily, I receive some feedback once in a while from friends at various different places complimenting me on each of those, including a female friend and flatmate who often compliments me on my clothes, being very physically strong, or even just being able to string a few sentences without butchering the language due to poor grammar. I'm the guy who friends (guys, obviously) come up to and ask tips on working out and stuff.\n\nNow, I make a conscious effort to keep all those factors in check, Mostly because I enjoy the act of paying attention to these things, and not just because I want to impress the opposite sex. I enjoy stuff like looking at myself and seeing that I am able to maintain a healthy body, or that I can combine a set of clothes that complements itself, or simply that I can choose a certain product that leaves my skin smelling wonderfully after a shower.\n\nHere's the catch, I'm very short. Just shy of 5'6\". My facial features are also quite poor, and therefore I am by no means easy on the eyes; it's safe to say I'm ugly.\n\nI've had one sexual encounter with a girl before, and I tried getting the relationship I had with her to become more stable, but in the end it didn't work out. This happened quite recently as well. I've had no luck with women throughout my entire life except on that one occasion, and I'd be lying if I said I don't miss it.\n\nI'm at university right now, and I am struggling to concentrate on my studies because of this. I genuinely believe that if I were seeing someone, or even just going out meeting different women, I would be able to concentrate much better on my studies as it would bring some sort of stability to my mind, and consequently, my daily routine. Any help would be appreciated, and solving this issue, to me, would be essential.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6580s7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "AwayTheThrowsGo", "saved": false, "mod_reports": [], "name": "t3_6580s7", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/6580s7/what_can_i_do_to_improve_my_attractiveness_as_a/", "num_reports": null, "locked": false, "stickied": false, "created": 1492143534.0, "url": "https://www.reddit.com/r/selfimprovement/comments/6580s7/what_can_i_do_to_improve_my_attractiveness_as_a/", "author_flair_text": null, "quarantine": false, "title": "What can I do to improve my attractiveness as a man?", "created_utc": 1492114734.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_6580s7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_6580s7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_6580s7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_6580s7", "likes": null, "replies": "", "user_reports": [], "id": "dgc495z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AwayTheThrowsGo", "parent_id": "t1_dgbb2b6", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Would there be a thing such as doing too many sports? I currently do 3 and attend sessions at my uni every week (just for curiosity's sake, these are taekwondo, boxing, and gymnastics) and enjoy all of them, but would doing too many somehow work the opposite way, and I'd come across as unapproachable?\n\nAlso I love what you suggested regarding walking through the woods/park, which is something I quite enjoy doing, but the bit about dating kind of went over my head.\n\nI don't really go out on dates or anything, which, especially in the environment I'm in, are seemingly almost exclusively arranged through stuff like tinder and such. Needless to say, I don't have a tinder account (which seems to baffle my friends and flatmates); as a matter of fact I don't even have any pictures of myself on facebook or anything.\n\nIs that what I'm missing? Do I just have to cave in? Thanks for the advice by the way, I really appreciate it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would there be a thing such as doing too many sports? I currently do 3 and attend sessions at my uni every week (just for curiosity&amp;#39;s sake, these are taekwondo, boxing, and gymnastics) and enjoy all of them, but would doing too many somehow work the opposite way, and I&amp;#39;d come across as unapproachable?&lt;/p&gt;\n\n&lt;p&gt;Also I love what you suggested regarding walking through the woods/park, which is something I quite enjoy doing, but the bit about dating kind of went over my head.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t really go out on dates or anything, which, especially in the environment I&amp;#39;m in, are seemingly almost exclusively arranged through stuff like tinder and such. Needless to say, I don&amp;#39;t have a tinder account (which seems to baffle my friends and flatmates); as a matter of fact I don&amp;#39;t even have any pictures of myself on facebook or anything.&lt;/p&gt;\n\n&lt;p&gt;Is that what I&amp;#39;m missing? Do I just have to cave in? Thanks for the advice by the way, I really appreciate it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgc495z", "score_hidden": false, "stickied": false, "created": 1492383685.0, "created_utc": 1492354885.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbb2b6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "isabellajc", "parent_id": "t1_dg8eq10", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "If sports make you feel good, do it! \n\nWhen I say go outside, the motivation is multifold. What I mean to say is step away from your screens and the regular bullshit that constantly has keeps your mind entertained. I personally believe there is a lot of value in walking through the woods (if you can access them) or walking through a park as a way to quiet your mind, sort through your thoughts, and get to know yourself better. There are a number of studies that link time in nature to increased mental stability. If you're confident in your mind and in your self I think it'll shine through as attractiveness, and spending just a little time in nature is a good way to get there. Confidence is key. Know thyself. \n\nFurther, going for a walk with someone can be an awesome first date idea because you don't have to tolerate the intensity of being directly face-to-face with another person as an initial interaction. Walking together is also a good way to understand what it feels like to be physically next to someone and to move with them. It can be cool to be able to say \"hey there's this really great park that I like to walk in let me show it to you.\" It's more interesting than saying \"let me buy you a drink\". To add another benefit of outdoor walking to the dating scenario, there's always something to talk about when you're walking as your surroundings are always changing and there's more to see than there is at a bar. \n\nGet underneath the sky! Breathe the air. Get in touch with your humanness. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If sports make you feel good, do it! &lt;/p&gt;\n\n&lt;p&gt;When I say go outside, the motivation is multifold. What I mean to say is step away from your screens and the regular bullshit that constantly has keeps your mind entertained. I personally believe there is a lot of value in walking through the woods (if you can access them) or walking through a park as a way to quiet your mind, sort through your thoughts, and get to know yourself better. There are a number of studies that link time in nature to increased mental stability. If you&amp;#39;re confident in your mind and in your self I think it&amp;#39;ll shine through as attractiveness, and spending just a little time in nature is a good way to get there. Confidence is key. Know thyself. &lt;/p&gt;\n\n&lt;p&gt;Further, going for a walk with someone can be an awesome first date idea because you don&amp;#39;t have to tolerate the intensity of being directly face-to-face with another person as an initial interaction. Walking together is also a good way to understand what it feels like to be physically next to someone and to move with them. It can be cool to be able to say &amp;quot;hey there&amp;#39;s this really great park that I like to walk in let me show it to you.&amp;quot; It&amp;#39;s more interesting than saying &amp;quot;let me buy you a drink&amp;quot;. To add another benefit of outdoor walking to the dating scenario, there&amp;#39;s always something to talk about when you&amp;#39;re walking as your surroundings are always changing and there&amp;#39;s more to see than there is at a bar. &lt;/p&gt;\n\n&lt;p&gt;Get underneath the sky! Breathe the air. Get in touch with your humanness. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgbb2b6", "score_hidden": false, "stickied": false, "created": 1492325868.0, "created_utc": 1492297068.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8eq10", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AwayTheThrowsGo", "parent_id": "t1_dg8desa", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Thanks for the advice. A few questions though; is sports in line with what you meant when you mentioned I should do things I really care about? And when you say I should go outside, are you referring to any specific places?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the advice. A few questions though; is sports in line with what you meant when you mentioned I should do things I really care about? And when you say I should go outside, are you referring to any specific places?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg8eq10", "score_hidden": false, "stickied": false, "created": 1492154788.0, "created_utc": 1492125988.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8desa", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "isabellajc", "parent_id": "t3_6580s7", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Looks matter less to a smart, self-aware &amp; decent woman. If you're exercising and tending to your appearance I'm sure you're coming off as good-looking and confident. Find some things that you really care about and do them regularly. Read and keep up n exercising and go outside, and if you're going to watch something, let it be a good movie. This will make you a good conversationalist because you'll have interesting material to pull from. Don't try to be overly polite or overly politically correct. Just be honest and inquisitive and positive. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Looks matter less to a smart, self-aware &amp;amp; decent woman. If you&amp;#39;re exercising and tending to your appearance I&amp;#39;m sure you&amp;#39;re coming off as good-looking and confident. Find some things that you really care about and do them regularly. Read and keep up n exercising and go outside, and if you&amp;#39;re going to watch something, let it be a good movie. This will make you a good conversationalist because you&amp;#39;ll have interesting material to pull from. Don&amp;#39;t try to be overly polite or overly politically correct. Just be honest and inquisitive and positive. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg8desa", "score_hidden": false, "stickied": false, "created": 1492153035.0, "created_utc": 1492124235.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_6580s7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_6580s7", "likes": null, "replies": "", "user_reports": [], "id": "dg8wb4f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AwayTheThrowsGo", "parent_id": "t1_dg8izjp", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Thanks. That's actually something I feel like I've personally struggled with myself, possibly due to fear of adverse consequences (especially in the case of advocating something), and the stuff I'm passionate about being super vague, but being at university I guess it would be the best place to start being more assertive about it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. That&amp;#39;s actually something I feel like I&amp;#39;ve personally struggled with myself, possibly due to fear of adverse consequences (especially in the case of advocating something), and the stuff I&amp;#39;m passionate about being super vague, but being at university I guess it would be the best place to start being more assertive about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg8wb4f", "score_hidden": false, "stickied": false, "created": 1492183926.0, "created_utc": 1492155126.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8izjp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Olyvyr", "parent_id": "t3_6580s7", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I second finding something you are passionate about and digging into it. I was *just* having this conversation with my partner and we agree that it's difficult for us to be attracted to someone who isn't passionate about something.\n\nIt can be *anything*: advocacy, well-being, music, art, animals, the environment, your family/friends, academics, etc. Other people will see that passion and want to be a part of it.\n\nIt will create a sense that you are independent and charting your own path. I personally find that very attractive in anyone and don't think I'm alone in that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I second finding something you are passionate about and digging into it. I was &lt;em&gt;just&lt;/em&gt; having this conversation with my partner and we agree that it&amp;#39;s difficult for us to be attracted to someone who isn&amp;#39;t passionate about something.&lt;/p&gt;\n\n&lt;p&gt;It can be &lt;em&gt;anything&lt;/em&gt;: advocacy, well-being, music, art, animals, the environment, your family/friends, academics, etc. Other people will see that passion and want to be a part of it.&lt;/p&gt;\n\n&lt;p&gt;It will create a sense that you are independent and charting your own path. I personally find that very attractive in anyone and don&amp;#39;t think I&amp;#39;m alone in that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg8izjp", "score_hidden": false, "stickied": false, "created": 1492160590.0, "created_utc": 1492131790.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_6580s7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_6580s7", "likes": null, "replies": "", "user_reports": [], "id": "dg8w61w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AwayTheThrowsGo", "parent_id": "t1_dg8pf44", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I'd say it's probably the being able to be intimate with someone else. I mean, with meeting someone, if there were sex involved it would be terrific, and I'd always try to make it clear that sex is something I'm interested in, but even if there weren't I'm confident I could deal with it/get around it somehow.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d say it&amp;#39;s probably the being able to be intimate with someone else. I mean, with meeting someone, if there were sex involved it would be terrific, and I&amp;#39;d always try to make it clear that sex is something I&amp;#39;m interested in, but even if there weren&amp;#39;t I&amp;#39;m confident I could deal with it/get around it somehow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg8w61w", "score_hidden": false, "stickied": false, "created": 1492183522.0, "created_utc": 1492154722.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8pf44", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Lostgirl1000", "parent_id": "t3_6580s7", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "A question, what about seeing someone or dating women would give you peace of mind right now? The sex part, the intimacy with another? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A question, what about seeing someone or dating women would give you peace of mind right now? The sex part, the intimacy with another? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg8pf44", "score_hidden": false, "stickied": false, "created": 1492169840.0, "created_utc": 1492141040.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_6580s7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_6580s7", "likes": null, "replies": "", "user_reports": [], "id": "dg89kr0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "AwayTheThrowsGo", "parent_id": "t1_dg86w1l", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Haha I wish I could, I really do, but I'm 19 years old and all I get is a textbook pedo stache and some genuine pubes on my chin, cheeks and sideburn areas.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha I wish I could, I really do, but I&amp;#39;m 19 years old and all I get is a textbook pedo stache and some genuine pubes on my chin, cheeks and sideburn areas.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg89kr0", "score_hidden": false, "stickied": false, "created": 1492148072.0, "created_utc": 1492119272.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86w1l", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_6580s7", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg86w1l", "score_hidden": false, "stickied": false, "created": 1492144904.0, "created_utc": 1492116104.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]