[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 18 and I&amp;#39;ve been almost a complete shut-in for two years. I&amp;#39;m also a borderline NEET or hikikomori as I only have classes a few days per week and I don&amp;#39;t leave the house otherwise.&lt;/p&gt;\n\n&lt;p&gt;Because of a chain events that brought me to where I am today, I don&amp;#39;t really have irl friends anymore since school ended in 2015. So I make up for that by wasting away entire days in front of a screen to ease the boredom. The last time I spoken to anyone irl other than immediate family was a week ago, I kid you not. That also happens to be the last time I left the house. I&amp;#39;m tired of living like this and I wish I never let my life be reduced to this.&lt;/p&gt;\n\n&lt;p&gt;My hobbies are asocial for the most part. When I&amp;#39;m not in class, I spend my entire day online posting on reddit and 4chan, talking on Discord, watching anime, and if not that, then anything equally shallow and unproductive.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll soon have to find a job but to be honest, I don&amp;#39;t feel prepared to do so in the slightest. I feel that my life is so shallow, I just can&amp;#39;t relate to the average person anymore. Every conversation I have, on average, just ends in me diverting the conversation back to them, as I truly haven&amp;#39;t done anything in the past two years worth mentioning. At worst, I make things awkward. I just feel completely out of touch with society now because of this reclusive lifestyle. &lt;/p&gt;\n\n&lt;p&gt;It wasn&amp;#39;t always this way and I just wanna go back to the way things were. Assume I know nothing, what would you do if you were in my situation?&lt;/p&gt;\n\n&lt;p&gt;Might not reply straight away because it&amp;#39;s night time here but I will get back to you.&lt;/p&gt;\n\n&lt;p&gt;Edit: just want to say, thanks everyone&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm 18 and I've been almost a complete shut-in for two years. I'm also a borderline NEET or hikikomori as I only have classes a few days per week and I don't leave the house otherwise.\n\nBecause of a chain events that brought me to where I am today, I don't really have irl friends anymore since school ended in 2015. So I make up for that by wasting away entire days in front of a screen to ease the boredom. The last time I spoken to anyone irl other than immediate family was a week ago, I kid you not. That also happens to be the last time I left the house. I'm tired of living like this and I wish I never let my life be reduced to this.\n\nMy hobbies are asocial for the most part. When I'm not in class, I spend my entire day online posting on reddit and 4chan, talking on Discord, watching anime, and if not that, then anything equally shallow and unproductive.\n\nI'll soon have to find a job but to be honest, I don't feel prepared to do so in the slightest. I feel that my life is so shallow, I just can't relate to the average person anymore. Every conversation I have, on average, just ends in me diverting the conversation back to them, as I truly haven't done anything in the past two years worth mentioning. At worst, I make things awkward. I just feel completely out of touch with society now because of this reclusive lifestyle. \n\nIt wasn't always this way and I just wanna go back to the way things were. Assume I know nothing, what would you do if you were in my situation?\n\nMight not reply straight away because it's night time here but I will get back to you.\n\nEdit: just want to say, thanks everyone", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "659c4s", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "nikikomori", "saved": false, "mod_reports": [], "name": "t3_659c4s", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": 1492386662.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/659c4s/im_tired_of_being_a_reclusive_shutin_and_i_want/", "num_reports": null, "locked": false, "stickied": false, "created": 1492157543.0, "url": "https://www.reddit.com/r/selfimprovement/comments/659c4s/im_tired_of_being_a_reclusive_shutin_and_i_want/", "author_flair_text": null, "quarantine": false, "title": "I'm tired of being a reclusive shut-in and I want to recover before it's too late", "created_utc": 1492128743.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_659c4s", "likes": null, "replies": "", "user_reports": [], "id": "dg9nvbm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sucrerey", "parent_id": "t3_659c4s", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "how many ways can you answer this question:\n\nwhat do you like to do?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;how many ways can you answer this question:&lt;/p&gt;\n\n&lt;p&gt;what do you like to do?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg9nvbm", "score_hidden": false, "stickied": false, "created": 1492228815.0, "created_utc": 1492200015.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_659c4s", "likes": null, "replies": "", "user_reports": [], "id": "dgbt957", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Lionwolfe", "parent_id": "t3_659c4s", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Adding to all the answers so far. What's wrong with observation? It feels awkward, but you learn a lot about the people around you, their interests, backgrounds, communication styles. With that information, you can adjust your communication and go talk to some of those people.\n\nGo to a coffee shop and do all the above while sipping a drink. Worked for me.\n\nI used to be a recluse for, like, a decade. You see, I though I was an introvert. But I'm not. Awkward.\n\nI befriend strangers and run a website. If a decade can be beaten, two years can be certainly remedied.\n\nOff-topic: Have you seen Project A-ko?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Adding to all the answers so far. What&amp;#39;s wrong with observation? It feels awkward, but you learn a lot about the people around you, their interests, backgrounds, communication styles. With that information, you can adjust your communication and go talk to some of those people.&lt;/p&gt;\n\n&lt;p&gt;Go to a coffee shop and do all the above while sipping a drink. Worked for me.&lt;/p&gt;\n\n&lt;p&gt;I used to be a recluse for, like, a decade. You see, I though I was an introvert. But I&amp;#39;m not. Awkward.&lt;/p&gt;\n\n&lt;p&gt;I befriend strangers and run a website. If a decade can be beaten, two years can be certainly remedied.&lt;/p&gt;\n\n&lt;p&gt;Off-topic: Have you seen Project A-ko?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgbt957", "score_hidden": false, "stickied": false, "created": 1492355956.0, "created_utc": 1492327156.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_659c4s", "likes": null, "replies": "", "user_reports": [], "id": "dg8kn6r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ParasiticNarwal", "parent_id": "t3_659c4s", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Dude it sounds like you are trapped by your own freedom, you can do (almost) anything but no one to do it with. This feels like a problem now but I assure you that it is a giant opportunity. Doing something on your own doesn't mean you are lonely or a loser, it means you are giving yourself the opportunity to make friends and talk to someone, this is how you get out of this rut. \nThink of the fat guy at the gym, so what if he's bad at running or can't lift much? He is improving himself simply by doing it. You just need to put yourself put there, simply showing up is 90% of the work. Every interest you've ever had, someone else has and you can share. \nYou said you weren't always like this so you aren't totally socially inept, but like the fat guy at the gym you didn't use your social muscles and so they stopped working as well, the solution is to ease yourself back into it and you'll see progress. Join any society you have even a passing interest in, strike up conversations with people in your classes, take the first step in more social interactions. You will succeed ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude it sounds like you are trapped by your own freedom, you can do (almost) anything but no one to do it with. This feels like a problem now but I assure you that it is a giant opportunity. Doing something on your own doesn&amp;#39;t mean you are lonely or a loser, it means you are giving yourself the opportunity to make friends and talk to someone, this is how you get out of this rut. \nThink of the fat guy at the gym, so what if he&amp;#39;s bad at running or can&amp;#39;t lift much? He is improving himself simply by doing it. You just need to put yourself put there, simply showing up is 90% of the work. Every interest you&amp;#39;ve ever had, someone else has and you can share. \nYou said you weren&amp;#39;t always like this so you aren&amp;#39;t totally socially inept, but like the fat guy at the gym you didn&amp;#39;t use your social muscles and so they stopped working as well, the solution is to ease yourself back into it and you&amp;#39;ll see progress. Join any society you have even a passing interest in, strike up conversations with people in your classes, take the first step in more social interactions. You will succeed &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg8kn6r", "score_hidden": false, "stickied": false, "created": 1492162876.0, "created_utc": 1492134076.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_659c4s", "likes": null, "replies": "", "user_reports": [], "id": "dgangj1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AshyLarry27", "parent_id": "t3_659c4s", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Don't look at socializing and society from a \"how do normal people do it?\" mind set. When I went to community college, there were plenty of computer and anime fans that hung out by the main student center of campus. If you plan to go to college, even community college, there are groups of people and events/clubs for EVERYONE. When you socialize on the internet, you're not talking to a robot, those are real life people with similar interests. You just need to find your crowd.\n\n Also, begin looking into your future and your goals. If you're 18 and out of high school, these are the years you have fun while building a foundation for your life before time flies away. You're way too bored with free time to be set in life. Look up guys like Gary Veynerchuk to help inspire and motivate you to find a passion in something to get your life rolling. You're too young to be sitting at a computer and wasting your life away. I was in a similar boat to yours, this quote kind of woke me up and I hope it helps you too:\n\n“If you're bored with life, if you don't get up every morning with a burning desire to do things, you don't have enough goals.” - Lou Holtz", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t look at socializing and society from a &amp;quot;how do normal people do it?&amp;quot; mind set. When I went to community college, there were plenty of computer and anime fans that hung out by the main student center of campus. If you plan to go to college, even community college, there are groups of people and events/clubs for EVERYONE. When you socialize on the internet, you&amp;#39;re not talking to a robot, those are real life people with similar interests. You just need to find your crowd.&lt;/p&gt;\n\n&lt;p&gt;Also, begin looking into your future and your goals. If you&amp;#39;re 18 and out of high school, these are the years you have fun while building a foundation for your life before time flies away. You&amp;#39;re way too bored with free time to be set in life. Look up guys like Gary Veynerchuk to help inspire and motivate you to find a passion in something to get your life rolling. You&amp;#39;re too young to be sitting at a computer and wasting your life away. I was in a similar boat to yours, this quote kind of woke me up and I hope it helps you too:&lt;/p&gt;\n\n&lt;p&gt;“If you&amp;#39;re bored with life, if you don&amp;#39;t get up every morning with a burning desire to do things, you don&amp;#39;t have enough goals.” - Lou Holtz&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgangj1", "score_hidden": false, "stickied": false, "created": 1492292446.0, "created_utc": 1492263646.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]