[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey Reddit. I&amp;#39;ve been lurking around here for a while now and I can see myself in most of these posts. My life is a mess and at this very point in my life - I&amp;#39;ve never been so low. So I thought why not write it all down and just go through it with you guys. It&amp;#39;s probably going to be a rather longer post, so I&amp;#39;d understand if you just can&amp;#39;t be arsed reading all of it - if you do, I&amp;#39;d greatly appreciate it.&lt;/p&gt;\n\n&lt;p&gt;Where do I start. I&amp;#39;m 22 years old. But I feel much older than my age. I currently live in a smaller city in Sweden. Currently, I have no job. No social life. No dreams. Nothing I would like to achieve. Really, my lust to live is broken and scattered to pieces. I dwell in the past because I refuse to accept the present. The future is even further away. I can&amp;#39;t see a future when I can&amp;#39;t even accept the present.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s currently 4 AM. I don&amp;#39;t sleep early because I have no reason to. I have nothing to wake up to. I live with my father, his wife and my 2 younger brothers. My father is a hard-working man and I feel like absolute sh*t for not being able to help him economically. My mother lives 4 hours away from my city and I don&amp;#39;t see her that often. My parents used to fight verbally and sometimes physically when I was a kid. After 14 years of them fighting and moving to a new city every other month, they finally divorced. My father got married and my mother is lonely. She sometimes calls me in the middle of the night, drunk, crying and telling me how much she hates herself for leaving us. I tell her that I understand her situation and I try to make her laugh. The next day she apologizes to me and I always say it&amp;#39;s fine - even though it breaks my heart. 7 years ago I got into a fight with my mothers boyfriend and she made the choice to leave us for him. She&amp;#39;s no longer with him though.&lt;/p&gt;\n\n&lt;p&gt;I love my parents to death. But I also blame them for the dreams I couldn&amp;#39;t achieve in life. I blame them for burning my perfect image to the ground. I don&amp;#39;t want to sound arrogant, but I had alot of talents and potential as a kid. I used to play football and I made it really far in every club I&amp;#39;d play in. Eventually we&amp;#39;d move to a new city and that would just knock down everything I&amp;#39;ve built. I&amp;#39;d have to re-built it again and again until I just stopped. That doesn&amp;#39;t just apply to football. It applies to everything. Adjusting to schools, adjusting to new enviroments, adjusting to new people etc. Eventually, I learned to not adjust anymore. I felt like I had too many identities. Just when I learned to not adjust, we settled down. Now, I have no social life. I know no one in this city, even though I&amp;#39;ve lived here for almost 8 years. I&amp;#39;ve learned to isolate myself in my room, play games and listen to music. Going out is uncomfortable. I feel like sh*t because that&amp;#39;s not how I used to be. Here I go again dwelling in the past.&lt;/p&gt;\n\n&lt;p&gt;Anyways, I put alot of the blame on my parents. I also put a blame on myself for not being able to live up to my parents expectations. My father looks at me as if he&amp;#39;s ashamed. He always compares me to other people. &amp;quot;Look at that guy, he works hard, has a girlfriend - why can&amp;#39;t you be like him?&amp;quot;. Not long ago, he came into my room and asked a rethorical question: &amp;quot;Why do you even exist?&amp;quot;. I can see it from his point of view. I&amp;#39;m doing nothing with my life. I&amp;#39;m contributing with nothing to the family. Him comparing me to other people makes me feel terrible. I start comparing myself to everyone. I drown in self-hatred and self-pity. I get jealous of other peoples success. I get jealous of people who could achieve their dreams.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m in general a happy and positive guy. I hate negativity. I hate it. The superficial of myself doesn&amp;#39;t show what I&amp;#39;m truly carrying in my bag. But recently, even my looks(I&amp;#39;m not kidding) are starting to adapt to what I&amp;#39;m feeling. I just want to fix myself. I wan&amp;#39;t to be the best version of myself. I wan&amp;#39;t to live.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what to do. What&amp;#39;s the first step to getting the f*ck out of this bubble? I used to work out and go to the gym but I don&amp;#39;t even have enough money to pay for a membership. I have debts and loans on my shoulders. And almost all of them have been to help my family. Financially, I&amp;#39;m screwed and I feel like money is the key to everything. That brings me to one of my addictions. I gamble alot, in hopes that I&amp;#39;m going to win and solve everything. Pay the debts and help everyone around me economically. In my head, money is the key to freedom.&lt;/p&gt;\n\n&lt;p&gt;As I previously said, I don&amp;#39;t want to achieve anything. There&amp;#39;s nothing that I REALLY want. I&amp;#39;m just empty. I have nothing to stand for. I have nothing I burn for, except for the games that I&amp;#39;m good at. But other than that, there&amp;#39;s nothing.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;ul&gt;\n&lt;li&gt;How do I stop dwelling in the past?&lt;/li&gt;\n&lt;li&gt;How do I stop blaming people around for things I couldn&amp;#39;t achieve?&lt;/li&gt;\n&lt;li&gt;How do I learn loving myself?&lt;/li&gt;\n&lt;li&gt;How do I stop comparing myself to others?&lt;/li&gt;\n&lt;li&gt;How do I stop &amp;quot;feeling bad&amp;quot; for myself?&lt;/li&gt;\n&lt;li&gt;How do I find myself?&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I know these questions are vague as hell. I just want something, anything to help me live the life I want to live - to become the best version of myself.&lt;/p&gt;\n\n&lt;p&gt;I appreciate any answers, help and advice.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey Reddit. I've been lurking around here for a while now and I can see myself in most of these posts. My life is a mess and at this very point in my life - I've never been so low. So I thought why not write it all down and just go through it with you guys. It's probably going to be a rather longer post, so I'd understand if you just can't be arsed reading all of it - if you do, I'd greatly appreciate it.\n\n\nWhere do I start. I'm 22 years old. But I feel much older than my age. I currently live in a smaller city in Sweden. Currently, I have no job. No social life. No dreams. Nothing I would like to achieve. Really, my lust to live is broken and scattered to pieces. I dwell in the past because I refuse to accept the present. The future is even further away. I can't see a future when I can't even accept the present.\n\n\nIt's currently 4 AM. I don't sleep early because I have no reason to. I have nothing to wake up to. I live with my father, his wife and my 2 younger brothers. My father is a hard-working man and I feel like absolute sh*t for not being able to help him economically. My mother lives 4 hours away from my city and I don't see her that often. My parents used to fight verbally and sometimes physically when I was a kid. After 14 years of them fighting and moving to a new city every other month, they finally divorced. My father got married and my mother is lonely. She sometimes calls me in the middle of the night, drunk, crying and telling me how much she hates herself for leaving us. I tell her that I understand her situation and I try to make her laugh. The next day she apologizes to me and I always say it's fine - even though it breaks my heart. 7 years ago I got into a fight with my mothers boyfriend and she made the choice to leave us for him. She's no longer with him though.\n\n\nI love my parents to death. But I also blame them for the dreams I couldn't achieve in life. I blame them for burning my perfect image to the ground. I don't want to sound arrogant, but I had alot of talents and potential as a kid. I used to play football and I made it really far in every club I'd play in. Eventually we'd move to a new city and that would just knock down everything I've built. I'd have to re-built it again and again until I just stopped. That doesn't just apply to football. It applies to everything. Adjusting to schools, adjusting to new enviroments, adjusting to new people etc. Eventually, I learned to not adjust anymore. I felt like I had too many identities. Just when I learned to not adjust, we settled down. Now, I have no social life. I know no one in this city, even though I've lived here for almost 8 years. I've learned to isolate myself in my room, play games and listen to music. Going out is uncomfortable. I feel like sh*t because that's not how I used to be. Here I go again dwelling in the past.\n\n\nAnyways, I put alot of the blame on my parents. I also put a blame on myself for not being able to live up to my parents expectations. My father looks at me as if he's ashamed. He always compares me to other people. \"Look at that guy, he works hard, has a girlfriend - why can't you be like him?\". Not long ago, he came into my room and asked a rethorical question: \"Why do you even exist?\". I can see it from his point of view. I'm doing nothing with my life. I'm contributing with nothing to the family. Him comparing me to other people makes me feel terrible. I start comparing myself to everyone. I drown in self-hatred and self-pity. I get jealous of other peoples success. I get jealous of people who could achieve their dreams.\n\n\nI'm in general a happy and positive guy. I hate negativity. I hate it. The superficial of myself doesn't show what I'm truly carrying in my bag. But recently, even my looks(I'm not kidding) are starting to adapt to what I'm feeling. I just want to fix myself. I wan't to be the best version of myself. I wan't to live.\n\n\nI don't know what to do. What's the first step to getting the f*ck out of this bubble? I used to work out and go to the gym but I don't even have enough money to pay for a membership. I have debts and loans on my shoulders. And almost all of them have been to help my family. Financially, I'm screwed and I feel like money is the key to everything. That brings me to one of my addictions. I gamble alot, in hopes that I'm going to win and solve everything. Pay the debts and help everyone around me economically. In my head, money is the key to freedom.\n\n\nAs I previously said, I don't want to achieve anything. There's nothing that I REALLY want. I'm just empty. I have nothing to stand for. I have nothing I burn for, except for the games that I'm good at. But other than that, there's nothing.\n\n\n-----------------------------------------------------------------------------------\n\n- How do I stop dwelling in the past?\n- How do I stop blaming people around for things I couldn't achieve?\n- How do I learn loving myself?\n- How do I stop comparing myself to others?\n- How do I stop \"feeling bad\" for myself?\n- How do I find myself?\n\nI know these questions are vague as hell. I just want something, anything to help me live the life I want to live - to become the best version of myself.\n\nI appreciate any answers, help and advice.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65a600", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "Frigment", "saved": false, "mod_reports": [], "name": "t3_65a600", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/65a600/broken_the_worst_version_of_myself/", "num_reports": null, "locked": false, "stickied": false, "created": 1492167728.0, "url": "https://www.reddit.com/r/selfimprovement/comments/65a600/broken_the_worst_version_of_myself/", "author_flair_text": null, "quarantine": false, "title": "Broken | The worst version of myself.", "created_utc": 1492138928.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65a600", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65a600", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65a600", "likes": null, "replies": "", "user_reports": [], "id": "dg9jopo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dontgoonreddit", "parent_id": "t1_dg911qr", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "&gt; I feel like there's nothing else that would get me joy like listening to music/playing games. I'm afraid of losing that joy, if that makes sense. What if I don't find anything out there? What if the image I've painted up as \"the best version of myself\" isn't really that good.\n\nLet's be honest: if listening to music and playing games really brought you enough joy, then you wouldn't make a reddit thread named \"Broken | The worst version of myself.\" It seems like there is not much you could lose (not intended to be an insult). \n\nThere are three options why the work as a cashier didn't make you happy: \n\n1 You hated the job. I told you to spend some time in uncomfortable situations, but hours every day of something that you hate are too much.\n\n2 You still spent your free time too comfortable, so your brain didn't change what it's \"normal state\" was.\n\n3 You didn't give yourself any free time at all. This seems to be what you are afraid of doing.\n\nHow about this: during your day you have 20-30mins of music time to unwind. In the evening, you have 20-30mins of video game time. When I said your life ought to be more comfortable, I didn't mean that you should avoid any kind of joy and pleasure. However, I still think you should avoid porn and the sites I mentioned completely because those are very addictive. If you are addicted to video games, you should avoid them completely, too, but it seems to me that games are just unaddictive fun for you.\n\nThat being said, you surely will \"find something something out there\". You wrote that you used to be passionate about football. I don't see a reason why you wouldn't be able to develop a passion for something again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I feel like there&amp;#39;s nothing else that would get me joy like listening to music/playing games. I&amp;#39;m afraid of losing that joy, if that makes sense. What if I don&amp;#39;t find anything out there? What if the image I&amp;#39;ve painted up as &amp;quot;the best version of myself&amp;quot; isn&amp;#39;t really that good.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Let&amp;#39;s be honest: if listening to music and playing games really brought you enough joy, then you wouldn&amp;#39;t make a reddit thread named &amp;quot;Broken | The worst version of myself.&amp;quot; It seems like there is not much you could lose (not intended to be an insult). &lt;/p&gt;\n\n&lt;p&gt;There are three options why the work as a cashier didn&amp;#39;t make you happy: &lt;/p&gt;\n\n&lt;p&gt;1 You hated the job. I told you to spend some time in uncomfortable situations, but hours every day of something that you hate are too much.&lt;/p&gt;\n\n&lt;p&gt;2 You still spent your free time too comfortable, so your brain didn&amp;#39;t change what it&amp;#39;s &amp;quot;normal state&amp;quot; was.&lt;/p&gt;\n\n&lt;p&gt;3 You didn&amp;#39;t give yourself any free time at all. This seems to be what you are afraid of doing.&lt;/p&gt;\n\n&lt;p&gt;How about this: during your day you have 20-30mins of music time to unwind. In the evening, you have 20-30mins of video game time. When I said your life ought to be more comfortable, I didn&amp;#39;t mean that you should avoid any kind of joy and pleasure. However, I still think you should avoid porn and the sites I mentioned completely because those are very addictive. If you are addicted to video games, you should avoid them completely, too, but it seems to me that games are just unaddictive fun for you.&lt;/p&gt;\n\n&lt;p&gt;That being said, you surely will &amp;quot;find something something out there&amp;quot;. You wrote that you used to be passionate about football. I don&amp;#39;t see a reason why you wouldn&amp;#39;t be able to develop a passion for something again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg9jopo", "score_hidden": false, "stickied": false, "created": 1492223785.0, "created_utc": 1492194985.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg911qr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Frigment", "parent_id": "t1_dg8xh85", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "\"Your lifestyle and daily habits drain your motivation. Your lack of motivation makes you inactive. Your inactivity makes you unhappy.\"\n- This is very accurate.\n\nI see what you're saying. I need to get out of my comfort zone. But here's the thing: I feel like there's nothing else that would get me joy like listening to music/playing games. I'm afraid of losing that joy, if that makes sense. What if I don't find anything out there? What if the image I've painted up as \"the best version of myself\" isn't really that good. For example, I worked at a bank as a cashier for 6 months and I've never felt more numb than that period. I worked so much, I forgot to live. Maybe I feel like this because I've been in my bubble for too long and as you said - it became my normal state, therefore anything that is not, feels like sh*t.\n\n\"Happiness exists only by contrast\"\n- Makes sense.\n\nI really like the advice you've given me. Really appreciate it!\n\nI will start doing that love yourself ritual haha.\n\nThank you for taking the time to read and respond. I greatly appreciate it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Your lifestyle and daily habits drain your motivation. Your lack of motivation makes you inactive. Your inactivity makes you unhappy.&amp;quot;\n- This is very accurate.&lt;/p&gt;\n\n&lt;p&gt;I see what you&amp;#39;re saying. I need to get out of my comfort zone. But here&amp;#39;s the thing: I feel like there&amp;#39;s nothing else that would get me joy like listening to music/playing games. I&amp;#39;m afraid of losing that joy, if that makes sense. What if I don&amp;#39;t find anything out there? What if the image I&amp;#39;ve painted up as &amp;quot;the best version of myself&amp;quot; isn&amp;#39;t really that good. For example, I worked at a bank as a cashier for 6 months and I&amp;#39;ve never felt more numb than that period. I worked so much, I forgot to live. Maybe I feel like this because I&amp;#39;ve been in my bubble for too long and as you said - it became my normal state, therefore anything that is not, feels like sh*t.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Happiness exists only by contrast&amp;quot;\n- Makes sense.&lt;/p&gt;\n\n&lt;p&gt;I really like the advice you&amp;#39;ve given me. Really appreciate it!&lt;/p&gt;\n\n&lt;p&gt;I will start doing that love yourself ritual haha.&lt;/p&gt;\n\n&lt;p&gt;Thank you for taking the time to read and respond. I greatly appreciate it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg911qr", "score_hidden": false, "stickied": false, "created": 1492198554.0, "created_utc": 1492169754.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8xh85", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "dontgoonreddit", "parent_id": "t3_65a600", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I think I know what your problem is. Your lifestyle and daily habits drain your motivation. Your lack of motivation makes you inactive. Your inactivity makes you unhappy. If I am right, then you should therefore not try to force yourself to be more happy or active, but tackle the core of your problem, which are your lifestyle and habits.\n\nSo what exactly should you do?\n\nYou should make your life more uncomfortable. If you spend most of your time in your room playing your favourite video game while listening to your favourite album of your favourite band of your favourite subgenre of your favourite genre of music, cuddled cozily into a blanket, then your mind will automatically recognize this as normal state.\n\nBy normal state I mean that it is the state you unconsciously compare every other situation to. If you are in a less comfortable situation (and  pretty much every situation is less comfortable than what I described above), then you will feel unhappy. If you are in a more comfortable situation (and, to be honest, I can't come up with a more comfortable situation that is still realistic), you will feel happy.\n\nThe conclusion is simple: if what I described above is your \"normal state\" then you will easily feel unhappy in a situation and hardly find a situation that makes you happy.\n\nAn example: showering. When I used to take warm showers, I never felt happy before, during or after the shower. I just showered. Now I take cold showers and afterwards and during the latter half of my time under the shower, I feel **fucking great!** However, this great feeling of motivation, awesomeness and life comes at a cost: before I take the shower, I am kind of afraid of the cold that I am going to experience. And during the first half of my time under the shower, the cold feels awful. But I do it anyway. In Moby Dick, there is a sentence that says \"Happyness exists only by contrast\" or something like this.\n\nI think you have now understood what I think your problem is. But what exactly should you do about it? Here are some specific things:\n\n* take a cold shower every morning\n\n* cut out activities in your life that make you happy without asking you to do anything to earn it: I mean mostly drugs, porn, TV/anime, meme sites and any other site that gives you an endless amount of entertainment or interesting facts like YouTube or the facebook newsfeed (in this order)\n\n* work out - you said you can't afford to go to the gym, but you sure as hell can afford running shoes to go running and a room to do bodyweight exercises in\n\n* force yourself to social interaction if necessary\n\n* find your great passion and dedicate your life to it\n\nOn how to love yourself, I will just copy and paste a comment I wrote in another thread: \n\n&gt; Learn to love yourself. Every morning, take two minutes to think about stuff you like about yourself. I also have an exercise that will help you right now, right here, as you're reading this. Close your eyes, cross your legs (ankle over knee if you are male), put your hands behind your head and in your mind repeat the sentence \"I love myself\" over and over and over. Think about the sentence. If your thoughts turn to other things, gently return them to the sentence. You love yourself. I am aware of the fact that this sounds stupid as hell, but since a stranger on the internet took the time to write such a long text for you, do him the favour of at least trying it out.\n\nIf you have any more questions, feel free to ask. I wish you good luck.\n\nEnglish is not my native language, so please excuse language mistakes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think I know what your problem is. Your lifestyle and daily habits drain your motivation. Your lack of motivation makes you inactive. Your inactivity makes you unhappy. If I am right, then you should therefore not try to force yourself to be more happy or active, but tackle the core of your problem, which are your lifestyle and habits.&lt;/p&gt;\n\n&lt;p&gt;So what exactly should you do?&lt;/p&gt;\n\n&lt;p&gt;You should make your life more uncomfortable. If you spend most of your time in your room playing your favourite video game while listening to your favourite album of your favourite band of your favourite subgenre of your favourite genre of music, cuddled cozily into a blanket, then your mind will automatically recognize this as normal state.&lt;/p&gt;\n\n&lt;p&gt;By normal state I mean that it is the state you unconsciously compare every other situation to. If you are in a less comfortable situation (and  pretty much every situation is less comfortable than what I described above), then you will feel unhappy. If you are in a more comfortable situation (and, to be honest, I can&amp;#39;t come up with a more comfortable situation that is still realistic), you will feel happy.&lt;/p&gt;\n\n&lt;p&gt;The conclusion is simple: if what I described above is your &amp;quot;normal state&amp;quot; then you will easily feel unhappy in a situation and hardly find a situation that makes you happy.&lt;/p&gt;\n\n&lt;p&gt;An example: showering. When I used to take warm showers, I never felt happy before, during or after the shower. I just showered. Now I take cold showers and afterwards and during the latter half of my time under the shower, I feel &lt;strong&gt;fucking great!&lt;/strong&gt; However, this great feeling of motivation, awesomeness and life comes at a cost: before I take the shower, I am kind of afraid of the cold that I am going to experience. And during the first half of my time under the shower, the cold feels awful. But I do it anyway. In Moby Dick, there is a sentence that says &amp;quot;Happyness exists only by contrast&amp;quot; or something like this.&lt;/p&gt;\n\n&lt;p&gt;I think you have now understood what I think your problem is. But what exactly should you do about it? Here are some specific things:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;take a cold shower every morning&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;cut out activities in your life that make you happy without asking you to do anything to earn it: I mean mostly drugs, porn, TV/anime, meme sites and any other site that gives you an endless amount of entertainment or interesting facts like YouTube or the facebook newsfeed (in this order)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;work out - you said you can&amp;#39;t afford to go to the gym, but you sure as hell can afford running shoes to go running and a room to do bodyweight exercises in&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;force yourself to social interaction if necessary&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;find your great passion and dedicate your life to it&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;On how to love yourself, I will just copy and paste a comment I wrote in another thread: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Learn to love yourself. Every morning, take two minutes to think about stuff you like about yourself. I also have an exercise that will help you right now, right here, as you&amp;#39;re reading this. Close your eyes, cross your legs (ankle over knee if you are male), put your hands behind your head and in your mind repeat the sentence &amp;quot;I love myself&amp;quot; over and over and over. Think about the sentence. If your thoughts turn to other things, gently return them to the sentence. You love yourself. I am aware of the fact that this sounds stupid as hell, but since a stranger on the internet took the time to write such a long text for you, do him the favour of at least trying it out.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you have any more questions, feel free to ask. I wish you good luck.&lt;/p&gt;\n\n&lt;p&gt;English is not my native language, so please excuse language mistakes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg8xh85", "score_hidden": false, "stickied": false, "created": 1492187435.0, "created_utc": 1492158635.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65a600", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65a600", "likes": null, "replies": "", "user_reports": [], "id": "dg90d6h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Frigment", "parent_id": "t1_dg8p0lb", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I just now realised that I made it more about my parents than it really is.\n\n\"the only person that could save me from this mindset was myself\"\n- Solid advice.\n\nAppreciate your input and wish you the best man.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just now realised that I made it more about my parents than it really is.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;the only person that could save me from this mindset was myself&amp;quot;\n- Solid advice.&lt;/p&gt;\n\n&lt;p&gt;Appreciate your input and wish you the best man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg90d6h", "score_hidden": false, "stickied": false, "created": 1492196718.0, "created_utc": 1492167918.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8p0lb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "casuallycereal", "parent_id": "t3_65a600", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Heya.  I have been through similar things in my life,  where I moved schools a lot.  Both of my parents were college students and they moved around a lot when rent got too high,  which would result in us moving to a whole different neighborhood in the city.  This would also result in me changing schools,  and I kinda think I know what you mean by having what you built, destroyed.  I could never blame my parents ever though because my parents were able to get jobs to make my secondary school years much more comfortable and then even support me for college.  My situation sound no where near as hard as yours, so Im sorry if my 2cent seems a little off. In my teenage years I definitely felt like someone was responsible for my current state (I had very few friends and my grades werent any good)  but at the same time I was also extremely lazy.  It was not until I went to college that I realized that the only person that could save me from this mindset was myself.  Sure I still didnt have the best grades,  but I was atleast making an effort.  The most important thing for me was keeping an open mind (Even though i am extremely biased most times).  It seems vague, but give it day by day.  Im also 22 so I still have a LONG way to go.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Heya.  I have been through similar things in my life,  where I moved schools a lot.  Both of my parents were college students and they moved around a lot when rent got too high,  which would result in us moving to a whole different neighborhood in the city.  This would also result in me changing schools,  and I kinda think I know what you mean by having what you built, destroyed.  I could never blame my parents ever though because my parents were able to get jobs to make my secondary school years much more comfortable and then even support me for college.  My situation sound no where near as hard as yours, so Im sorry if my 2cent seems a little off. In my teenage years I definitely felt like someone was responsible for my current state (I had very few friends and my grades werent any good)  but at the same time I was also extremely lazy.  It was not until I went to college that I realized that the only person that could save me from this mindset was myself.  Sure I still didnt have the best grades,  but I was atleast making an effort.  The most important thing for me was keeping an open mind (Even though i am extremely biased most times).  It seems vague, but give it day by day.  Im also 22 so I still have a LONG way to go.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg8p0lb", "score_hidden": false, "stickied": false, "created": 1492169205.0, "created_utc": 1492140405.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65a600", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65a600", "likes": null, "replies": "", "user_reports": [], "id": "dg90nfy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Frigment", "parent_id": "t1_dg8smws", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Appreciate that you took the time to read and answer.\n\nMy parents do not like to talk. Not my father at least. If I ever mention that they stopped from achieving whatever it is that I wanted - it'll break them. I feel like there's no good in talking to them. I'm trying to forgive them and just move on and stop putting the blame on them. Because deep down, I know that I didn't achieve my goals because of myself. I just use this as an excuse to stop trying achieving things.\n\nJust now, I was talking to my dad about working with him. That might happen as I have an interview this monday!\n\n\"But you won't know until you go\"\n- Makes sense.\n\nI hope that you can figure things out yourself. I appreciate the encouraging words and the advice. Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Appreciate that you took the time to read and answer.&lt;/p&gt;\n\n&lt;p&gt;My parents do not like to talk. Not my father at least. If I ever mention that they stopped from achieving whatever it is that I wanted - it&amp;#39;ll break them. I feel like there&amp;#39;s no good in talking to them. I&amp;#39;m trying to forgive them and just move on and stop putting the blame on them. Because deep down, I know that I didn&amp;#39;t achieve my goals because of myself. I just use this as an excuse to stop trying achieving things.&lt;/p&gt;\n\n&lt;p&gt;Just now, I was talking to my dad about working with him. That might happen as I have an interview this monday!&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;But you won&amp;#39;t know until you go&amp;quot;\n- Makes sense.&lt;/p&gt;\n\n&lt;p&gt;I hope that you can figure things out yourself. I appreciate the encouraging words and the advice. Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg90nfy", "score_hidden": false, "stickied": false, "created": 1492197522.0, "created_utc": 1492168722.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8smws", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "beefcakes94", "parent_id": "t3_65a600", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Hey man, I'm also 22, from the states (California). Here are my thoughts (for what they're worth).\n\nFirst it sounds like you need to resolve the emotions you have with your parents. You're angry with them for stealing your potential by moving you around throughout your childhood. But you gotta think, they're just doing their best. Trying to keep a family together while their marriage is falling apart. It seems like a lot to juggle. We're all just people, doing our best day by day, but we all makes mistakes. I'm sure they were doing their best to handle their life.\n\nNext, it sounds like you really want to contribute to your family. Especially economically. Well if you have all this time and you need a drive to fulfill, THIS IS IT. You talk about how you have no interests or future to work towards. I say bullshit. Find a way to help your dad with his work. Or maybe take care of the chores around the house so when he's off work, you guys can enjoy some time together. If not working for your dad, find some volunteer programs so that you can help other people with your time. This may lead to other interests/hobbies/friends/social life. The important part is to keep you busy so you stay away from gambling. That can only lead to trouble.\n\nThird, the potential never left. Or was wasted. It's still in you. You can still be great at something. Sports, career, music. Whatever you're into. You can choose. The point is, just because that potential never came to fruition wasn't because it was wasted. It was because it never had to the chance to come to fruition. You were constantly changing environments so your were constantly starting over. Things seem a bit more stable now so you can choose where you want to apply that potential and really see how much your can do! I think it's exciting!\n\nFourth, yeah you had a rough past. But that's the thing. It's in the past. And I get it you have trouble ruminating over the past. But I think that's the thing. You have to think about it and process it to get past it. So go ahead! Acknowledge and respect your past. But then say \"ok, how am I gonna make sure that the past doesn't repeat itself?\" \"How do I move forward?\" (Hint: I think it's by working with your dad).\nHere's an analogy I think I'd relevant. It's the treading water analogy. Imagine you're stuck in the ocean and every horizon is water. You have no way of knowing which way to swim. So you tread water. But eventually, unless you wanna tread water your whole life, you have to just pick a direction and start swimming. If it's the wrong the direction, you can always turn around and swim the other way. But your won't know until you go.\n\nFinally, all I gotta say is: It's on you. If you wanna change your life or do something different, you're the only one controlling that. No one else is gonna make the change for you. Whatever you want out of life, you have to go take it yourself. \n\nAlso personal opinion: money isn't the key. Money is a tool used to get resources. It's important to handle properly and budget, but it's just a tool. Your mind is the key. Healthy mind along with healthy relationships produce happiness. In my opinion.\n\nHope that helped on some level. I haven't gotten everything figured out yet either but I hope some of what I said makes sense. If I was off base feel free to say so.\n\nOh! And there are ways to work out without a gym membership. Go check out r/fitness they could probably help out.\n\nBest wishes", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man, I&amp;#39;m also 22, from the states (California). Here are my thoughts (for what they&amp;#39;re worth).&lt;/p&gt;\n\n&lt;p&gt;First it sounds like you need to resolve the emotions you have with your parents. You&amp;#39;re angry with them for stealing your potential by moving you around throughout your childhood. But you gotta think, they&amp;#39;re just doing their best. Trying to keep a family together while their marriage is falling apart. It seems like a lot to juggle. We&amp;#39;re all just people, doing our best day by day, but we all makes mistakes. I&amp;#39;m sure they were doing their best to handle their life.&lt;/p&gt;\n\n&lt;p&gt;Next, it sounds like you really want to contribute to your family. Especially economically. Well if you have all this time and you need a drive to fulfill, THIS IS IT. You talk about how you have no interests or future to work towards. I say bullshit. Find a way to help your dad with his work. Or maybe take care of the chores around the house so when he&amp;#39;s off work, you guys can enjoy some time together. If not working for your dad, find some volunteer programs so that you can help other people with your time. This may lead to other interests/hobbies/friends/social life. The important part is to keep you busy so you stay away from gambling. That can only lead to trouble.&lt;/p&gt;\n\n&lt;p&gt;Third, the potential never left. Or was wasted. It&amp;#39;s still in you. You can still be great at something. Sports, career, music. Whatever you&amp;#39;re into. You can choose. The point is, just because that potential never came to fruition wasn&amp;#39;t because it was wasted. It was because it never had to the chance to come to fruition. You were constantly changing environments so your were constantly starting over. Things seem a bit more stable now so you can choose where you want to apply that potential and really see how much your can do! I think it&amp;#39;s exciting!&lt;/p&gt;\n\n&lt;p&gt;Fourth, yeah you had a rough past. But that&amp;#39;s the thing. It&amp;#39;s in the past. And I get it you have trouble ruminating over the past. But I think that&amp;#39;s the thing. You have to think about it and process it to get past it. So go ahead! Acknowledge and respect your past. But then say &amp;quot;ok, how am I gonna make sure that the past doesn&amp;#39;t repeat itself?&amp;quot; &amp;quot;How do I move forward?&amp;quot; (Hint: I think it&amp;#39;s by working with your dad).\nHere&amp;#39;s an analogy I think I&amp;#39;d relevant. It&amp;#39;s the treading water analogy. Imagine you&amp;#39;re stuck in the ocean and every horizon is water. You have no way of knowing which way to swim. So you tread water. But eventually, unless you wanna tread water your whole life, you have to just pick a direction and start swimming. If it&amp;#39;s the wrong the direction, you can always turn around and swim the other way. But your won&amp;#39;t know until you go.&lt;/p&gt;\n\n&lt;p&gt;Finally, all I gotta say is: It&amp;#39;s on you. If you wanna change your life or do something different, you&amp;#39;re the only one controlling that. No one else is gonna make the change for you. Whatever you want out of life, you have to go take it yourself. &lt;/p&gt;\n\n&lt;p&gt;Also personal opinion: money isn&amp;#39;t the key. Money is a tool used to get resources. It&amp;#39;s important to handle properly and budget, but it&amp;#39;s just a tool. Your mind is the key. Healthy mind along with healthy relationships produce happiness. In my opinion.&lt;/p&gt;\n\n&lt;p&gt;Hope that helped on some level. I haven&amp;#39;t gotten everything figured out yet either but I hope some of what I said makes sense. If I was off base feel free to say so.&lt;/p&gt;\n\n&lt;p&gt;Oh! And there are ways to work out without a gym membership. Go check out &lt;a href=\"/r/fitness\"&gt;r/fitness&lt;/a&gt; they could probably help out.&lt;/p&gt;\n\n&lt;p&gt;Best wishes&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dg8smws", "score_hidden": false, "stickied": false, "created": 1492175368.0, "created_utc": 1492146568.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65a600", "likes": null, "replies": "", "user_reports": [], "id": "dgajd2a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "howcaneyehelpyou", "parent_id": "t3_65a600", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Obviously, I don't know you personally, but here's my two cents (or equivalent) worth:\n\n1. You live in a country with (as far as I know) a fairly decent welfare state/ health service- I'd get yourself referred for therapy or something similar.  You clearly have pretty bad mental health/ self esteem problems (don't mean this in a bad way, same applies to me), so that needs to be dealt with urgently.  \n2. Start running- it won't solve your problems for you, but running is a good antidepressant, gets you outside and about.  Helped me through some dark times in my life.\n3. Following on from point 1, I'd go down and start looking into studying/ learning stuff.  In the UK, where I'm from, you can do free distance learning courses/ one day courses at adult education places.  \n4. Once you've built up some confidence and fitness, begin playing football again- if you have a talent for that then ultimately that could be your ticket to meeting new people and getting a social circle.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Obviously, I don&amp;#39;t know you personally, but here&amp;#39;s my two cents (or equivalent) worth:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;You live in a country with (as far as I know) a fairly decent welfare state/ health service- I&amp;#39;d get yourself referred for therapy or something similar.  You clearly have pretty bad mental health/ self esteem problems (don&amp;#39;t mean this in a bad way, same applies to me), so that needs to be dealt with urgently.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Start running- it won&amp;#39;t solve your problems for you, but running is a good antidepressant, gets you outside and about.  Helped me through some dark times in my life.&lt;/li&gt;\n&lt;li&gt;Following on from point 1, I&amp;#39;d go down and start looking into studying/ learning stuff.  In the UK, where I&amp;#39;m from, you can do free distance learning courses/ one day courses at adult education places.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Once you&amp;#39;ve built up some confidence and fitness, begin playing football again- if you have a talent for that then ultimately that could be your ticket to meeting new people and getting a social circle.&lt;br/&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgajd2a", "score_hidden": false, "stickied": false, "created": 1492282863.0, "created_utc": 1492254063.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]