[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello everyone.  I was hoping some of you might be able to offer some advice about my situation.\nI&amp;#39;m a 32 year old guy who&amp;#39;s hit a bit of a wall in life.  On one hand things are going great for me.  Health, income, stability etc. I&amp;#39;m also single and have no children.  Basically I&amp;#39;m in a wonderful position to do some really great things.  That being said, my life has become oh so dull.  My routine basically consists of work and home.  Occasional outings with friends but those are few and far between because they&amp;#39;ve either moved or have gotten married and we just don&amp;#39;t get a chance to see each as much.  Totally understandable at this age of course.&lt;/p&gt;\n\n&lt;p&gt;The troubling part is that I find I&amp;#39;ve become very afraid of breaking away from my usual routine and It&amp;#39;s gradually become worse since I turned 30 a few years ago.  It&amp;#39;s to the point where I get very anxious if I do things or put myself in situations that I&amp;#39;m not familiar or comfortable with.  Avoidance has become so second nature that it&amp;#39;s my go repsonse.  Heck, I even find myself watching the same tv shows and movies over and over again to the point of memorization.&lt;/p&gt;\n\n&lt;p&gt;Dating and relationships are also pretty non-existant at this point not that I was much of go getter in my younger days either.  Again, I find myself feeling very anxious when it comes to pursing and putting myself out there that I&amp;#39;ve pretty much started to shy away from the situation all together.&lt;/p&gt;\n\n&lt;p&gt;Basically I&amp;#39;ve started to live my entire life in a bubble and I don&amp;#39;t like it.  These are the prime years of my life and I&amp;#39;m pissing them away because I&amp;#39;m scared of god knows what.  I keep thinking that if I do this or that things will start to get better but I seem to always find myself back at square one contemplating my next move.&lt;/p&gt;\n\n&lt;p&gt;Does anyone have any suggestions of how to break out of this funk and start living my life?!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello everyone.  I was hoping some of you might be able to offer some advice about my situation.\nI'm a 32 year old guy who's hit a bit of a wall in life.  On one hand things are going great for me.  Health, income, stability etc. I'm also single and have no children.  Basically I'm in a wonderful position to do some really great things.  That being said, my life has become oh so dull.  My routine basically consists of work and home.  Occasional outings with friends but those are few and far between because they've either moved or have gotten married and we just don't get a chance to see each as much.  Totally understandable at this age of course.\n\nThe troubling part is that I find I've become very afraid of breaking away from my usual routine and It's gradually become worse since I turned 30 a few years ago.  It's to the point where I get very anxious if I do things or put myself in situations that I'm not familiar or comfortable with.  Avoidance has become so second nature that it's my go repsonse.  Heck, I even find myself watching the same tv shows and movies over and over again to the point of memorization.\n\nDating and relationships are also pretty non-existant at this point not that I was much of go getter in my younger days either.  Again, I find myself feeling very anxious when it comes to pursing and putting myself out there that I've pretty much started to shy away from the situation all together.\n\nBasically I've started to live my entire life in a bubble and I don't like it.  These are the prime years of my life and I'm pissing them away because I'm scared of god knows what.  I keep thinking that if I do this or that things will start to get better but I seem to always find myself back at square one contemplating my next move.\n\nDoes anyone have any suggestions of how to break out of this funk and start living my life?!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65jhcj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 23, "report_reasons": null, "author": "confusedbymoney", "saved": false, "mod_reports": [], "name": "t3_65jhcj", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/65jhcj/ive_become_so_afraid_of_breaking_the_routine_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492297214.0, "url": "https://www.reddit.com/r/selfimprovement/comments/65jhcj/ive_become_so_afraid_of_breaking_the_routine_and/", "author_flair_text": null, "quarantine": false, "title": "I've become so afraid of breaking the routine and trying new things...", "created_utc": 1492268414.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65jhcj", "likes": null, "replies": "", "user_reports": [], "id": "dgba3gv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dieselbreakfast", "parent_id": "t3_65jhcj", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Join a club, or group that does activities. CrossFit comes to mind, meet new people doing a new thing. Get strong meet fit chicks (if you're into that) put yourself into a group of new people and experience a new world. \n\nChurch is another , but it's ...Church. idk. Jesus is kind of a buzzkill. \n\nNew people will show you new directions that you maybe never considered. Right now you are comfortable, and that's a deadly trap. You will find yourself stuck in a groove and won't ever want to get out on your own.\n\nGet out and make some new friends . Go do something scary and new. Good luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Join a club, or group that does activities. CrossFit comes to mind, meet new people doing a new thing. Get strong meet fit chicks (if you&amp;#39;re into that) put yourself into a group of new people and experience a new world. &lt;/p&gt;\n\n&lt;p&gt;Church is another , but it&amp;#39;s ...Church. idk. Jesus is kind of a buzzkill. &lt;/p&gt;\n\n&lt;p&gt;New people will show you new directions that you maybe never considered. Right now you are comfortable, and that&amp;#39;s a deadly trap. You will find yourself stuck in a groove and won&amp;#39;t ever want to get out on your own.&lt;/p&gt;\n\n&lt;p&gt;Get out and make some new friends . Go do something scary and new. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgba3gv", "score_hidden": false, "stickied": false, "created": 1492324434.0, "created_utc": 1492295634.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65jhcj", "likes": null, "replies": "", "user_reports": [], "id": "dgb5kos", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sweanix", "parent_id": "t3_65jhcj", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "From your post I can't tell where you are from I imagine this applies to the US as well but there are groups set up for people who want to get more out of life and they plan events that anybody can go to. I'm a member of one called spice in the UK and on there site I can see a list of events I can pick from (the sort of event you would take a friend to or go to as a tourist.) It might sound scary but as you are there to do a thing that everyone else wants to do it takes the pressure off of and you make friends organically", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From your post I can&amp;#39;t tell where you are from I imagine this applies to the US as well but there are groups set up for people who want to get more out of life and they plan events that anybody can go to. I&amp;#39;m a member of one called spice in the UK and on there site I can see a list of events I can pick from (the sort of event you would take a friend to or go to as a tourist.) It might sound scary but as you are there to do a thing that everyone else wants to do it takes the pressure off of and you make friends organically&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgb5kos", "score_hidden": false, "stickied": false, "created": 1492318119.0, "created_utc": 1492289319.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65jhcj", "likes": null, "replies": "", "user_reports": [], "id": "dgbizd8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Willbo", "parent_id": "t3_65jhcj", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "If you're having these thoughts, it's a good sign that change is on the horizon! It's time to get in tune with your goals and visualize the person you want to be. When you visualize the end result, shows you the areas you need to improve and gives you motivation to put in the work.\n\nDon't be afraid to make that final leap. If you discover any resistance to change and find yourself coming up with excuses, pinpoint those issues and try to mitigate that risk.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re having these thoughts, it&amp;#39;s a good sign that change is on the horizon! It&amp;#39;s time to get in tune with your goals and visualize the person you want to be. When you visualize the end result, shows you the areas you need to improve and gives you motivation to put in the work.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t be afraid to make that final leap. If you discover any resistance to change and find yourself coming up with excuses, pinpoint those issues and try to mitigate that risk.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgbizd8", "score_hidden": false, "stickied": false, "created": 1492337210.0, "created_utc": 1492308410.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65jhcj", "likes": null, "replies": "", "user_reports": [], "id": "dgbl39b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RNG_take_the_wheel", "parent_id": "t3_65jhcj", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Don't focus on the feeling of being scared, or the resistance. That's not what's important to pay attention to. What's important to pay attention to are the things worth pushing through the fear for. What do you wish you were doing? How would you like to shake things up? I suspect the fear is not the problem so much as the rut itself.  \nWhat would your 'perfect, exciting, non-anxiety filled life' look like? What are some concrete steps you could take towards that picture?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t focus on the feeling of being scared, or the resistance. That&amp;#39;s not what&amp;#39;s important to pay attention to. What&amp;#39;s important to pay attention to are the things worth pushing through the fear for. What do you wish you were doing? How would you like to shake things up? I suspect the fear is not the problem so much as the rut itself.&lt;br/&gt;\nWhat would your &amp;#39;perfect, exciting, non-anxiety filled life&amp;#39; look like? What are some concrete steps you could take towards that picture?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgbl39b", "score_hidden": false, "stickied": false, "created": 1492340307.0, "created_utc": 1492311507.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65jhcj", "likes": null, "replies": "", "user_reports": [], "id": "dgb4b2u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bileduct", "parent_id": "t3_65jhcj", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Go to church. Get involved in the community maybe", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go to church. Get involved in the community maybe&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgb4b2u", "score_hidden": false, "stickied": false, "created": 1492316400.0, "created_utc": 1492287600.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65jhcj", "likes": null, "replies": "", "user_reports": [], "id": "dgb52iq", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ImJohava", "parent_id": "t3_65jhcj", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Hi! 17-year-old High School Junior here. When I was younger, I faced a similar issue where there wasnt much going on in my life. Wake up, School, Home, sleep. I decided to switch it up a bit and change my life for the better. I joined a club swim team. And while I wasn't the greatest there, I enjoyed my time being away from all the normal faces I see everyday and being able to meet new friends and personalities. Since joining that club, not only have I become one of the best contenders in my graduating class to be recuited by college coaches, I've met some brilliant, beautiful, and colorful characters. And my life would be excruciating to know that had I not decided to become involved in a sport, my life would be dull and would be robotic.\n\nSo my advice is this: Get involved in a sport that you don't know much about or that you didn't know exists. Not only will you be more physically fit, you will also break the chain that is your day-to-day life.\n\nTL;DR: Join an athletic club and enjoy yourself! :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi! 17-year-old High School Junior here. When I was younger, I faced a similar issue where there wasnt much going on in my life. Wake up, School, Home, sleep. I decided to switch it up a bit and change my life for the better. I joined a club swim team. And while I wasn&amp;#39;t the greatest there, I enjoyed my time being away from all the normal faces I see everyday and being able to meet new friends and personalities. Since joining that club, not only have I become one of the best contenders in my graduating class to be recuited by college coaches, I&amp;#39;ve met some brilliant, beautiful, and colorful characters. And my life would be excruciating to know that had I not decided to become involved in a sport, my life would be dull and would be robotic.&lt;/p&gt;\n\n&lt;p&gt;So my advice is this: Get involved in a sport that you don&amp;#39;t know much about or that you didn&amp;#39;t know exists. Not only will you be more physically fit, you will also break the chain that is your day-to-day life.&lt;/p&gt;\n\n&lt;p&gt;TL;DR: Join an athletic club and enjoy yourself! :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgb52iq", "score_hidden": false, "stickied": false, "created": 1492317441.0, "created_utc": 1492288641.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]