[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As of now I am a high schooler and not doing too bad in life. I have pretty good social skills and I am able to strike a friendship with almost everybody. I have a lot of acquaintances and I am liked by most of the people I know. The only problem is that I don&amp;#39;t have much to do regarding outside of school. Most of the time in the weekend I just stay home and play Overwatch with my friends. Although I do have close friends and we enjoy playing video games at home together with us seeing a movie together every once in awhile, I want to hang out more outside of school. Even though I may a great time playing video games, I know quite a bit of friends (not as close) that always do something new with their friends every other day, whether it be seeing a movie, biking around, or just hanging out. Summer is two months away and I don&amp;#39;t want to spend my summer just playing video games. Being the extroverted person I am, I want to explore the world more and socialize with people. &lt;/p&gt;\n\n&lt;p&gt;At the moment I am a part of couple of clubs and extra curricular activities outside my school (Robotics and Cyber Patriots), but even though I am friendly with the people there I have a hard time making close friendships with the members. Likewise, I&amp;#39;ll be doing other activities such as Cross Country next year, so hopefully that can help me fill the gap. I made attempts to get all my current close friends and I to hang out together, but they usually tell me &amp;quot;they&amp;#39;re busy that day&amp;quot; or &amp;quot;they don&amp;#39;t feel like going&amp;quot;. There&amp;#39;s also a group of friends I know fairly well that does stuff together every other day, and I have hanged out with some of them a couple of times before. I would like to join them, but since I&amp;#39;m not very close with the group I find it weird if I ask if I could join them. &lt;/p&gt;\n\n&lt;p&gt;As a result I&amp;#39;m not very sure on what do I need to do now. At school I sit with my video game friends at lunch. Should I sit somewhere else for a couple of days? I tried doing that when a couple of my acquaintances recommend me to sit with their friends.  I did and both times I had a hard time joining in with their conversations, so I just sat back where I originally sat. At the same time I don&amp;#39;t want to abandon my video game friends, since I&amp;#39;ve known them for a long time. Even so, I&amp;#39;m 100% ready to put myself out there and meet new people, but I just don&amp;#39;t want to be doing for too long since I&amp;#39;ll feel like a lost soul with no friends. &lt;/p&gt;\n\n&lt;p&gt;This leads me to my question? What should I do? How can I find people I can hang out with outside of school? How can I get my current close friends to start hanging out more often. Please give me a lead and tell me where to start so I can live a more fulfilling life. &lt;/p&gt;\n\n&lt;p&gt;Thanks, &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "As of now I am a high schooler and not doing too bad in life. I have pretty good social skills and I am able to strike a friendship with almost everybody. I have a lot of acquaintances and I am liked by most of the people I know. The only problem is that I don't have much to do regarding outside of school. Most of the time in the weekend I just stay home and play Overwatch with my friends. Although I do have close friends and we enjoy playing video games at home together with us seeing a movie together every once in awhile, I want to hang out more outside of school. Even though I may a great time playing video games, I know quite a bit of friends (not as close) that always do something new with their friends every other day, whether it be seeing a movie, biking around, or just hanging out. Summer is two months away and I don't want to spend my summer just playing video games. Being the extroverted person I am, I want to explore the world more and socialize with people. \n\n\nAt the moment I am a part of couple of clubs and extra curricular activities outside my school (Robotics and Cyber Patriots), but even though I am friendly with the people there I have a hard time making close friendships with the members. Likewise, I'll be doing other activities such as Cross Country next year, so hopefully that can help me fill the gap. I made attempts to get all my current close friends and I to hang out together, but they usually tell me \"they're busy that day\" or \"they don't feel like going\". There's also a group of friends I know fairly well that does stuff together every other day, and I have hanged out with some of them a couple of times before. I would like to join them, but since I'm not very close with the group I find it weird if I ask if I could join them. \n\n\nAs a result I'm not very sure on what do I need to do now. At school I sit with my video game friends at lunch. Should I sit somewhere else for a couple of days? I tried doing that when a couple of my acquaintances recommend me to sit with their friends.  I did and both times I had a hard time joining in with their conversations, so I just sat back where I originally sat. At the same time I don't want to abandon my video game friends, since I've known them for a long time. Even so, I'm 100% ready to put myself out there and meet new people, but I just don't want to be doing for too long since I'll feel like a lost soul with no friends. \n\n\nThis leads me to my question? What should I do? How can I find people I can hang out with outside of school? How can I get my current close friends to start hanging out more often. Please give me a lead and tell me where to start so I can live a more fulfilling life. \n\n\nThanks, ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65m23c", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "SimeonT", "saved": false, "mod_reports": [], "name": "t3_65m23c", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/65m23c/how_can_i_socialize_more_outside_of_school/", "num_reports": null, "locked": false, "stickied": false, "created": 1492326732.0, "url": "https://www.reddit.com/r/selfimprovement/comments/65m23c/how_can_i_socialize_more_outside_of_school/", "author_flair_text": null, "quarantine": false, "title": "How can I socialize more outside of school?", "created_utc": 1492297932.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65m23c", "likes": null, "replies": "", "user_reports": [], "id": "dgbroqb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Lionwolfe", "parent_id": "t3_65m23c", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I am a young adult, and my high school years are still vivid in my memory.\n\nTypically, school friendships do not last long, because people change, become independent, move away and generally go their own way. Many close friends stay together, though, if they are self-aware enough to know what path they are on and that their friend can help them on their path.\n\nFirst thought I have is you just have not figured out your path and passions yet. It is good to like video games and Robotics (I wish my school had passionate teachers who would be willing to make a Robotics club!). Are you passionate about them? Do you play video games just because of friends or do you enjoy them enough to rave about them or criticize them on, say, Facebook?\n\nAnother thought is that you have not found the people who can be your close friends yet. Every community attracts particular kinds of people and not everyone can fit into each social circle.\n\nGood job with the clubs, nevertheless, some socialization and something to do is better than nothing.\n\nIf you like video games, you may like tabletop role-playing games. They can be played both via Internet and with a bunch of friends at your house. A typical session lasts three or four hours.\n\nYou could volunteer somewhere. Don't like the place - find another place. This ties into finding your passion and gives you something to slap onto your resume.\n\nAnother option to consider is to hang out with your parents and their friends. I did and learned more about people, their stories, lifestyles and mindsets. My parents took me to barbecue picnics, house dinners, meetups and celebrations at restaurants, holiday dinners and sleepovers and the ski base (I don't ski or snowboard). (And I don't even have a good relationship with my parents.) This option may or may not be for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am a young adult, and my high school years are still vivid in my memory.&lt;/p&gt;\n\n&lt;p&gt;Typically, school friendships do not last long, because people change, become independent, move away and generally go their own way. Many close friends stay together, though, if they are self-aware enough to know what path they are on and that their friend can help them on their path.&lt;/p&gt;\n\n&lt;p&gt;First thought I have is you just have not figured out your path and passions yet. It is good to like video games and Robotics (I wish my school had passionate teachers who would be willing to make a Robotics club!). Are you passionate about them? Do you play video games just because of friends or do you enjoy them enough to rave about them or criticize them on, say, Facebook?&lt;/p&gt;\n\n&lt;p&gt;Another thought is that you have not found the people who can be your close friends yet. Every community attracts particular kinds of people and not everyone can fit into each social circle.&lt;/p&gt;\n\n&lt;p&gt;Good job with the clubs, nevertheless, some socialization and something to do is better than nothing.&lt;/p&gt;\n\n&lt;p&gt;If you like video games, you may like tabletop role-playing games. They can be played both via Internet and with a bunch of friends at your house. A typical session lasts three or four hours.&lt;/p&gt;\n\n&lt;p&gt;You could volunteer somewhere. Don&amp;#39;t like the place - find another place. This ties into finding your passion and gives you something to slap onto your resume.&lt;/p&gt;\n\n&lt;p&gt;Another option to consider is to hang out with your parents and their friends. I did and learned more about people, their stories, lifestyles and mindsets. My parents took me to barbecue picnics, house dinners, meetups and celebrations at restaurants, holiday dinners and sleepovers and the ski base (I don&amp;#39;t ski or snowboard). (And I don&amp;#39;t even have a good relationship with my parents.) This option may or may not be for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgbroqb", "score_hidden": false, "stickied": false, "created": 1492351971.0, "created_utc": 1492323171.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65m23c", "likes": null, "replies": "", "user_reports": [], "id": "dgc0xek", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_vend7u", "parent_id": "t3_65m23c", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Maybe you can join a gym and take up some new hobbies (mma, classes) and make friends there. I'm in a very similar situation to you and I'm in high school", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe you can join a gym and take up some new hobbies (mma, classes) and make friends there. I&amp;#39;m in a very similar situation to you and I&amp;#39;m in high school&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgc0xek", "score_hidden": false, "stickied": false, "created": 1492378209.0, "created_utc": 1492349409.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]