[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Back when I was 16 I started my first real project. It was a game development project. Have you ever had a feeling when you just knew you had to do something, or that it felt like fate was guiding you to this moment in your life? That&amp;#39;s how it felt then. I had no idea what I was in for, but I was incredibly excited about what the future held for me. &lt;/p&gt;\n\n&lt;p&gt;Long story short, I started from scratch without any development skills other than a &amp;quot;logical mind&amp;quot;. I taught myself everything I needed to know along the way, and I hyper focused on that project for a year until reaching the first major beta release. Every moment of spare time I had I would use to further the project. When I needed to chill for a few hours I&amp;#39;d watch some tv shows or anime, or play a game. I even worked on it during school hours in the classroom, or long into the night. Whenever I was outside or away from home I was always thinking about the next step, what to learn next, my weaknesses and challenges and ways to overcome them, etc. I had absolute clarity on the present situation and the future. I was incredibly driven and creativity and inspiration and motivation was practically on fire for that entire time. It was (and still is) the best time of my life, where I had the most fun ever recorded in my memories. &lt;/p&gt;\n\n&lt;p&gt;I got a name for myself in the community, got a lot of fans and people who supported my work without even trying. I say without trying because all I did was release the beta and the fans gathered on their own. I didn&amp;#39;t do any promotion, I don&amp;#39;t have any social skills to do it. I just made a forum post on some site with a download link. I didn&amp;#39;t actually do it for the attention or anything I simply did it for myself, but it was nice to see people appreciated what I did. The fans and how they treated me was even more of a reason to be driven. The 2nd major beta was finished roughly a year later but the game itself was not, there was still about 30% left to complete.&lt;/p&gt;\n\n&lt;p&gt;Then everything changed. I remember it clearly, my fire burned out around the age of 18 practically right after I released that 2nd beta. All I did was tell myself &amp;quot;I got quite far, maybe I&amp;#39;ll take a week off before starting the next bit&amp;quot;. I never got truly back into the swing of it. My fans kept asking me for release dates, I had to keep telling them &amp;quot;soon&amp;quot; or &amp;quot;i dont know&amp;quot;. I could no longer see my future, I lost my absolute clarity on the situation. Everything became hazy, and my drive was basically 0. Every couple of months I&amp;#39;d muster up some motivation to work on the project for a month or a few weeks. I used this time to make the most of it and was able to release another beta, which had about 1-5% of progress compared to the previous ones. &lt;/p&gt;\n\n&lt;p&gt;Then 2 years passed and I&amp;#39;d done nothing, then another 2 years. 8 years later (today) and that project is still left unfinished. Fans are still waiting, and that damn forum post I made back in the day still gets users posting on it. I still get fans tweeting me saying how much they like the game and asking when the next release is. Over the years it&amp;#39;s changed from &amp;quot;soon&amp;quot; to &amp;quot;i dont know&amp;quot; to &amp;quot;maybe never&amp;quot;. There&amp;#39;s been over 10 million downloads of the beta since the last release 6 years ago.&lt;/p&gt;\n\n&lt;p&gt;Here is the real problem...&lt;/p&gt;\n\n&lt;p&gt;In short, since that day I never got my fire back. I can&amp;#39;t motivate myself to do a single thing for more than 1-3 weeks. My life now is quite a challenge. I run a bunch of projects which bring in enough money for me to survive. I&amp;#39;ve got ideas and plans for another 20+ projects, and the skills needed to make them come alive. If I was able to motivate myself to make them then my future would be secured. You&amp;#39;d have thought that would be enough to motivate me but it&amp;#39;s not. The only thing I&amp;#39;m lacking is the fire to actually get going. To best describe it, even the slightest small thing is hard to get going on. I have a hazy head and everything feels like a big bad boss, even when it&amp;#39;s just a 5-10 min task. Feeling like this makes it even harder to start anything new as that usually takes longer than 5 mins.&lt;/p&gt;\n\n&lt;p&gt;The most puzzling thing is that I really like my work. In fact, all of the things I can&amp;#39;t bring myself to do are things that I &lt;em&gt;know&lt;/em&gt; I enjoy doing. Both work and leisure. I&amp;#39;m able to hype myself up and get excited for what it would be like after I did something, but it does not go further than that. I&amp;#39;ve been thinking over and over and over about this problem for years. Back in the day when I first started to notice that I slowed down big time, I thought &amp;quot;oh I&amp;#39;m just burned out, i&amp;#39;ll bounce back soon&amp;quot;. I never bounced back, not for more than a few weeks. Even those few week spurts are not how I used to feel, just a shadow of my former self.&lt;/p&gt;\n\n&lt;p&gt;My friends and my business partner don&amp;#39;t seem to understand how it feels, as they just call me lazy. They don&amp;#39;t understand why I&amp;#39;m not using my skills to become a millionaire, and I&amp;#39;m with them wondering the same thing. As each day goes by where I got nothing done I get increasingly worried that my life is going to be like this forever.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve got no idea what I need to do to get back my lost flame, and hoping someone has some tips for me.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt; I know what I want to do. I know what I like doing. I just can&amp;#39;t bring myself to do it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Back when I was 16 I started my first real project. It was a game development project. Have you ever had a feeling when you just knew you had to do something, or that it felt like fate was guiding you to this moment in your life? That's how it felt then. I had no idea what I was in for, but I was incredibly excited about what the future held for me. \n\nLong story short, I started from scratch without any development skills other than a \"logical mind\". I taught myself everything I needed to know along the way, and I hyper focused on that project for a year until reaching the first major beta release. Every moment of spare time I had I would use to further the project. When I needed to chill for a few hours I'd watch some tv shows or anime, or play a game. I even worked on it during school hours in the classroom, or long into the night. Whenever I was outside or away from home I was always thinking about the next step, what to learn next, my weaknesses and challenges and ways to overcome them, etc. I had absolute clarity on the present situation and the future. I was incredibly driven and creativity and inspiration and motivation was practically on fire for that entire time. It was (and still is) the best time of my life, where I had the most fun ever recorded in my memories. \n\nI got a name for myself in the community, got a lot of fans and people who supported my work without even trying. I say without trying because all I did was release the beta and the fans gathered on their own. I didn't do any promotion, I don't have any social skills to do it. I just made a forum post on some site with a download link. I didn't actually do it for the attention or anything I simply did it for myself, but it was nice to see people appreciated what I did. The fans and how they treated me was even more of a reason to be driven. The 2nd major beta was finished roughly a year later but the game itself was not, there was still about 30% left to complete.\n\nThen everything changed. I remember it clearly, my fire burned out around the age of 18 practically right after I released that 2nd beta. All I did was tell myself \"I got quite far, maybe I'll take a week off before starting the next bit\". I never got truly back into the swing of it. My fans kept asking me for release dates, I had to keep telling them \"soon\" or \"i dont know\". I could no longer see my future, I lost my absolute clarity on the situation. Everything became hazy, and my drive was basically 0. Every couple of months I'd muster up some motivation to work on the project for a month or a few weeks. I used this time to make the most of it and was able to release another beta, which had about 1-5% of progress compared to the previous ones. \n\nThen 2 years passed and I'd done nothing, then another 2 years. 8 years later (today) and that project is still left unfinished. Fans are still waiting, and that damn forum post I made back in the day still gets users posting on it. I still get fans tweeting me saying how much they like the game and asking when the next release is. Over the years it's changed from \"soon\" to \"i dont know\" to \"maybe never\". There's been over 10 million downloads of the beta since the last release 6 years ago.\n\nHere is the real problem...\n\nIn short, since that day I never got my fire back. I can't motivate myself to do a single thing for more than 1-3 weeks. My life now is quite a challenge. I run a bunch of projects which bring in enough money for me to survive. I've got ideas and plans for another 20+ projects, and the skills needed to make them come alive. If I was able to motivate myself to make them then my future would be secured. You'd have thought that would be enough to motivate me but it's not. The only thing I'm lacking is the fire to actually get going. To best describe it, even the slightest small thing is hard to get going on. I have a hazy head and everything feels like a big bad boss, even when it's just a 5-10 min task. Feeling like this makes it even harder to start anything new as that usually takes longer than 5 mins.\n\nThe most puzzling thing is that I really like my work. In fact, all of the things I can't bring myself to do are things that I *know* I enjoy doing. Both work and leisure. I'm able to hype myself up and get excited for what it would be like after I did something, but it does not go further than that. I've been thinking over and over and over about this problem for years. Back in the day when I first started to notice that I slowed down big time, I thought \"oh I'm just burned out, i'll bounce back soon\". I never bounced back, not for more than a few weeks. Even those few week spurts are not how I used to feel, just a shadow of my former self.\n\nMy friends and my business partner don't seem to understand how it feels, as they just call me lazy. They don't understand why I'm not using my skills to become a millionaire, and I'm with them wondering the same thing. As each day goes by where I got nothing done I get increasingly worried that my life is going to be like this forever.\n\nI've got no idea what I need to do to get back my lost flame, and hoping someone has some tips for me.\n\n**tl;dr** I know what I want to do. I know what I like doing. I just can't bring myself to do it.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65pfhn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 57, "report_reasons": null, "author": "WheresMyFireAt", "saved": false, "mod_reports": [], "name": "t3_65pfhn", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": 1492354111.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/65pfhn/how_can_i_relight_the_fire_that_burnt_out_years/", "num_reports": null, "locked": false, "stickied": false, "created": 1492382617.0, "url": "https://www.reddit.com/r/selfimprovement/comments/65pfhn/how_can_i_relight_the_fire_that_burnt_out_years/", "author_flair_text": null, "quarantine": false, "title": "How can I relight the fire that burnt out years ago?", "created_utc": 1492353817.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 57}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65pfhn", "likes": null, "replies": "", "user_reports": [], "id": "dgc8ahy", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "lazyquackduck101", "parent_id": "t3_65pfhn", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I have only read the tldr because I'm about to leave but I felt I needed to say something. From what I understand your life has just been the same thing day in day out for the past while, this is exactly what I was experiencing just recently. First, cut out some bad habits, we all have them and it's something that you need to just face. Once you face then a few times you will understand that they were limiting you from expanding. Second, fill the gap that you have removed, now that your bad habits are being taken care of it is vindictive that you replace them with good habits. Start doing some push-ups when you get up, meditate, read, learn an instrument really just anything that's not the regular stuff. Third, let the combination of these two things take you to a higher sence of awareness. You will begin to regain the spark you once had, you will find yourslef doing things that are out of your comfort zone without even realizing it, and you will begin to make your thoughts are reality. Your subconscious will begin to wirk in your favor.\n\nBefore I leave, it is important that you just start small. Make achievable goals, it will make the journey easyer. For example: do 10 push-ups at anytime of the day, meditate for 5 minuets, or read 2 pages. Make your goal just enough to get started.\n\nBut what do I know. I hope you find this helpful. 👍🏻\n\nEdit: what I was trying to get at was: if you become a happier person everything around you becomes achievable. It will reignight your spark. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have only read the tldr because I&amp;#39;m about to leave but I felt I needed to say something. From what I understand your life has just been the same thing day in day out for the past while, this is exactly what I was experiencing just recently. First, cut out some bad habits, we all have them and it&amp;#39;s something that you need to just face. Once you face then a few times you will understand that they were limiting you from expanding. Second, fill the gap that you have removed, now that your bad habits are being taken care of it is vindictive that you replace them with good habits. Start doing some push-ups when you get up, meditate, read, learn an instrument really just anything that&amp;#39;s not the regular stuff. Third, let the combination of these two things take you to a higher sence of awareness. You will begin to regain the spark you once had, you will find yourslef doing things that are out of your comfort zone without even realizing it, and you will begin to make your thoughts are reality. Your subconscious will begin to wirk in your favor.&lt;/p&gt;\n\n&lt;p&gt;Before I leave, it is important that you just start small. Make achievable goals, it will make the journey easyer. For example: do 10 push-ups at anytime of the day, meditate for 5 minuets, or read 2 pages. Make your goal just enough to get started.&lt;/p&gt;\n\n&lt;p&gt;But what do I know. I hope you find this helpful. 👍🏻&lt;/p&gt;\n\n&lt;p&gt;Edit: what I was trying to get at was: if you become a happier person everything around you becomes achievable. It will reignight your spark. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgc8ahy", "score_hidden": false, "stickied": false, "created": 1492389231.0, "created_utc": 1492360431.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65pfhn", "likes": null, "replies": "", "user_reports": [], "id": "dgc5idp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "1nfinitezer0", "parent_id": "t3_65pfhn", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "What do you want your life to be about? What is it that you want to be able to look back on as having done (for yourself or others)? Why is this important to you? Digging deep into your motivations will bring more passion and motivation into the present. You've already got the tools to make it happen, but you're not doing it because you're not clear on why it's worth working hard for.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What do you want your life to be about? What is it that you want to be able to look back on as having done (for yourself or others)? Why is this important to you? Digging deep into your motivations will bring more passion and motivation into the present. You&amp;#39;ve already got the tools to make it happen, but you&amp;#39;re not doing it because you&amp;#39;re not clear on why it&amp;#39;s worth working hard for.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgc5idp", "score_hidden": false, "stickied": false, "created": 1492385469.0, "created_utc": 1492356669.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65pfhn", "likes": null, "replies": "", "user_reports": [], "id": "dgciq75", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Unglossed", "parent_id": "t3_65pfhn", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Too many projects. No focus.\n\nDiscipline and focus is what you need, not motivation. You've created a bunch of habits that no longer work for your games or apps (whatever you're making). You have to be disciplined and create new habits, and have focus. \n\nMaybe you're just not supposed to be doing what everyone wants you to do. That's ok. Focus on what makes you happy. ", "edited": 1492374696.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Too many projects. No focus.&lt;/p&gt;\n\n&lt;p&gt;Discipline and focus is what you need, not motivation. You&amp;#39;ve created a bunch of habits that no longer work for your games or apps (whatever you&amp;#39;re making). You have to be disciplined and create new habits, and have focus. &lt;/p&gt;\n\n&lt;p&gt;Maybe you&amp;#39;re just not supposed to be doing what everyone wants you to do. That&amp;#39;s ok. Focus on what makes you happy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgciq75", "score_hidden": false, "stickied": false, "created": 1492402949.0, "created_utc": 1492374149.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65pfhn", "likes": null, "replies": "", "user_reports": [], "id": "dgco00k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kmf01", "parent_id": "t3_65pfhn", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Google low testosterone symptoms. If it seems familiar go and check your levels in lab. Your hormones can hold you back", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Google low testosterone symptoms. If it seems familiar go and check your levels in lab. Your hormones can hold you back&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgco00k", "score_hidden": false, "stickied": false, "created": 1492409854.0, "created_utc": 1492381054.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65pfhn", "likes": null, "replies": "", "user_reports": [], "id": "dge77xt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LordMoy", "parent_id": "t3_65pfhn", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "  Fake the feeling of the fire you once had, I'm sure you still remember it. Even if it's not real, use that to get motivated and enjoy your work, not to earn money or pay bills but to actually enjoy the process. Learn to find happiness in whatever you doing whenever.\n  If you want to finish the game, do it. Post on the forum that you want to finish it but tell them you lost that spark you had when you started. I'm sure lots of people will understand and help you out get it back, after all 10 million isn't a small number. \n  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fake the feeling of the fire you once had, I&amp;#39;m sure you still remember it. Even if it&amp;#39;s not real, use that to get motivated and enjoy your work, not to earn money or pay bills but to actually enjoy the process. Learn to find happiness in whatever you doing whenever.\n  If you want to finish the game, do it. Post on the forum that you want to finish it but tell them you lost that spark you had when you started. I&amp;#39;m sure lots of people will understand and help you out get it back, after all 10 million isn&amp;#39;t a small number. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dge77xt", "score_hidden": false, "stickied": false, "created": 1492495363.0, "created_utc": 1492466563.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65pfhn", "likes": null, "replies": "", "user_reports": [], "id": "dgcgf73", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hookdump", "parent_id": "t3_65pfhn", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 1, "body": "Read about Stoicism.\n\nLook up the NoFap subreddit.\n\nLook up \"cold showers benefits\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Read about Stoicism.&lt;/p&gt;\n\n&lt;p&gt;Look up the NoFap subreddit.&lt;/p&gt;\n\n&lt;p&gt;Look up &amp;quot;cold showers benefits&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgcgf73", "score_hidden": false, "stickied": false, "created": 1492399965.0, "created_utc": 1492371165.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65pfhn", "likes": null, "replies": "", "user_reports": [], "id": "dgcbgum", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CanadianNomad", "parent_id": "t3_65pfhn", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Sorry no insight.  I feel the same way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry no insight.  I feel the same way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgcbgum", "score_hidden": false, "stickied": false, "created": 1492393378.0, "created_utc": 1492364578.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65pfhn", "likes": null, "replies": "", "user_reports": [], "id": "dgcnjkd", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "productivebunny", "parent_id": "t3_65pfhn", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "@cubeworld creator, is that you? jkjk i kid, but this situation feels oddly familiar ;)", "edited": 1492390063.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;@cubeworld creator, is that you? jkjk i kid, but this situation feels oddly familiar ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgcnjkd", "score_hidden": false, "stickied": false, "created": 1492409244.0, "created_utc": 1492380444.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]