[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see this over and over in self help books: &amp;quot;What would achieve in your life if you knew you could not fail?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;This question has always stumped me. I fail all the time. There&amp;#39;s no way I can set my sights on a goal and NOT fail. The question ignores reality. Could someone please word it a different way so it helps people like me? thx&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I see this over and over in self help books: \"What would achieve in your life if you knew you could not fail?\" \n\nThis question has always stumped me. I fail all the time. There's no way I can set my sights on a goal and NOT fail. The question ignores reality. Could someone please word it a different way so it helps people like me? thx", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65q610", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "heresmything", "saved": false, "mod_reports": [], "name": "t3_65q610", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/65q610/if_you_knew_you_could_not_fail/", "num_reports": null, "locked": false, "stickied": false, "created": 1492391417.0, "url": "https://www.reddit.com/r/selfimprovement/comments/65q610/if_you_knew_you_could_not_fail/", "author_flair_text": null, "quarantine": false, "title": "\"If you knew you could not fail..\"", "created_utc": 1492362617.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65q610", "likes": null, "replies": "", "user_reports": [], "id": "dgcd1rn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kingcrunchcrunch", "parent_id": "t3_65q610", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "\"You're probably going to fail, but you won't know until you try. And next time your odds of success are a bit better.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;You&amp;#39;re probably going to fail, but you won&amp;#39;t know until you try. And next time your odds of success are a bit better.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgcd1rn", "score_hidden": false, "stickied": false, "created": 1492395468.0, "created_utc": 1492366668.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65q610", "likes": null, "replies": "", "user_reports": [], "id": "dgcjsfj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "engxix", "parent_id": "t3_65q610", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I think you're misunderstanding the point of the question. It isn't meant to suggest that we can somehow avoid failure altogether and achieve some type of hyper-successful lifestyle. Rather, it's meant to critique a common mindset that holds us back: our fear of failure itself.\n\nOften times, because we don't want to look dumb, or we're scared of letting someone down, we don't pursue the opportunities that we are most passionate about. This question is meant to critique that mindset and inspire you to pursue these dreams and goals, and not worry about the possibility of failure.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re misunderstanding the point of the question. It isn&amp;#39;t meant to suggest that we can somehow avoid failure altogether and achieve some type of hyper-successful lifestyle. Rather, it&amp;#39;s meant to critique a common mindset that holds us back: our fear of failure itself.&lt;/p&gt;\n\n&lt;p&gt;Often times, because we don&amp;#39;t want to look dumb, or we&amp;#39;re scared of letting someone down, we don&amp;#39;t pursue the opportunities that we are most passionate about. This question is meant to critique that mindset and inspire you to pursue these dreams and goals, and not worry about the possibility of failure.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgcjsfj", "score_hidden": false, "stickied": false, "created": 1492404328.0, "created_utc": 1492375528.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65q610", "likes": null, "replies": "", "user_reports": [], "id": "dgcs0z8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dolphinesque", "parent_id": "t3_65q610", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "This won't fit into a pithy, memorable sentence, but maybe it will help. \n \nIf you bought a new video game, you didn't run through the whole thing on the first try and win it with no problems. Instead, you started out, jumped a gap, and boom, ran into a koopa and had to start over. The next time, you jumped the gap, this time you jumped OVER the koopa, stomped a goomba, but damn it, that second goomba got you. You died and went back to start. The next time, you jumped the gap, avoided the koopa, stomped both goombas, jumped onto a platform, dodged bullet bill, jumped another gap, and damn it! A flying koopa came out of nowhere and got you. You died and went back to start. \n \nYou failed and failed and failed and failed and failed.  \n \nBut after about a week of regular playing, you were no longer stuck on level 1. Maybe you were on level 4 or 5, or even level 7 or 8 by then. Every level brought new frustrations, new challenges, new obstacles, new ways to die (i.e. FAIL), new monsters out to kill you,  nothing but challenge after challenge keeping you from your goal. \n \nBut you stuck with it, and with every level, you failed and failed and failed, and every failure taught you a lesson. Every failure taught you how to navigate those obstacles a little better. Every failure made you sharper when it came to killing the monsters. \n\nAnd then there came that awesome day, after 5, 10, maybe even 100 tries, when you killed Bowser, you finally defeated the game, and you succeeded. You finally achieved your goal! \n \nYes, you sacrificed. You spent a lot of hours playing. You invested a lot of time and frustration. But in the end, you achieved the goal you set out to achieve. \n\nFailure is learning. Failure brings us closer to success. Failure is life - no one succeeds at everything first try. We fail, and fall off our bikes, or burn our scrambled eggs, or accidentally delete our term papers, or get fired. It happens. And then we look at the experience, and learn. \n\nI hope this helps. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This won&amp;#39;t fit into a pithy, memorable sentence, but maybe it will help. &lt;/p&gt;\n\n&lt;p&gt;If you bought a new video game, you didn&amp;#39;t run through the whole thing on the first try and win it with no problems. Instead, you started out, jumped a gap, and boom, ran into a koopa and had to start over. The next time, you jumped the gap, this time you jumped OVER the koopa, stomped a goomba, but damn it, that second goomba got you. You died and went back to start. The next time, you jumped the gap, avoided the koopa, stomped both goombas, jumped onto a platform, dodged bullet bill, jumped another gap, and damn it! A flying koopa came out of nowhere and got you. You died and went back to start. &lt;/p&gt;\n\n&lt;p&gt;You failed and failed and failed and failed and failed.  &lt;/p&gt;\n\n&lt;p&gt;But after about a week of regular playing, you were no longer stuck on level 1. Maybe you were on level 4 or 5, or even level 7 or 8 by then. Every level brought new frustrations, new challenges, new obstacles, new ways to die (i.e. FAIL), new monsters out to kill you,  nothing but challenge after challenge keeping you from your goal. &lt;/p&gt;\n\n&lt;p&gt;But you stuck with it, and with every level, you failed and failed and failed, and every failure taught you a lesson. Every failure taught you how to navigate those obstacles a little better. Every failure made you sharper when it came to killing the monsters. &lt;/p&gt;\n\n&lt;p&gt;And then there came that awesome day, after 5, 10, maybe even 100 tries, when you killed Bowser, you finally defeated the game, and you succeeded. You finally achieved your goal! &lt;/p&gt;\n\n&lt;p&gt;Yes, you sacrificed. You spent a lot of hours playing. You invested a lot of time and frustration. But in the end, you achieved the goal you set out to achieve. &lt;/p&gt;\n\n&lt;p&gt;Failure is learning. Failure brings us closer to success. Failure is life - no one succeeds at everything first try. We fail, and fall off our bikes, or burn our scrambled eggs, or accidentally delete our term papers, or get fired. It happens. And then we look at the experience, and learn. &lt;/p&gt;\n\n&lt;p&gt;I hope this helps. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgcs0z8", "score_hidden": false, "stickied": false, "created": 1492415363.0, "created_utc": 1492386563.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65q610", "likes": null, "replies": "", "user_reports": [], "id": "dgcttlf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Oberon_Swanson", "parent_id": "t3_65q610", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "\"Regardless of your fears and shortcomings as you see them, what are your biggest dreams that would make you the happiest if they came true?\"\n\nSo they mean, set aside things like \"I'd love to be a movie star but I am not good-looking enough.\" \"I'd like to be a CEO of a major company but I don't have Ivy League connections.\" \"I'd like to start my own business but I don't have startup capital.\" \"I'd like to become a legendary painter but I just can't see myself becoming that great at something no matter how hard I try.\" \"I'd like to run my own restaurant, but most restaurants close within two years of being opened.\"\n\nTo me, chasing your dreams IS living your dreams. Just chase after them regardless of whether you will reach them or not, and you will be happy, which is more important than being successful. You need to make decisions and live days that let you sleep at night feeling satisfied with yourself and your efforts. Results aren't as important.\n\nYou need to ask yourself to think big because you only get to live once. You don't need to get caught up in what is going to stop you or why you might fail or why it might not all come together. Just adapt to your shortcomings and push through. Look at all the people who succeeded despite them having every traditional reason not to. Sylvester Stallone became a Hollywood star even though his face is partially paralyzed. Barack Obama was raised by a single mom in inner city Chicago and became President, running against an experienced senator and war veteran, and then again beat a mega-millionaire in his second term.\n\nIf you see yourself as not succeeding if you take the traditional route, that does not mean your dream is closed to you. That just means don't take the traditional route. You are going to have to blaze your own path. Maybe you have to work twice as hard as someone else. Maybe you have to work ten times harder and wait ten years longer. So what? The time will pass anyway. In ten years you can either be living your dream (or something close to it) or stuck in a similar shitty routine to what you are dissatisfied with now.\n\nIf you think about what you can 'realistically' accomplish, that's not too bad, but you should also unshackle your mind a bit and dream bigger. Don't look at how you're gonna fail and decide not to try. Look at how you're gonna succeed. Keep in mind how you could fail and just avoid those things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Regardless of your fears and shortcomings as you see them, what are your biggest dreams that would make you the happiest if they came true?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So they mean, set aside things like &amp;quot;I&amp;#39;d love to be a movie star but I am not good-looking enough.&amp;quot; &amp;quot;I&amp;#39;d like to be a CEO of a major company but I don&amp;#39;t have Ivy League connections.&amp;quot; &amp;quot;I&amp;#39;d like to start my own business but I don&amp;#39;t have startup capital.&amp;quot; &amp;quot;I&amp;#39;d like to become a legendary painter but I just can&amp;#39;t see myself becoming that great at something no matter how hard I try.&amp;quot; &amp;quot;I&amp;#39;d like to run my own restaurant, but most restaurants close within two years of being opened.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;To me, chasing your dreams IS living your dreams. Just chase after them regardless of whether you will reach them or not, and you will be happy, which is more important than being successful. You need to make decisions and live days that let you sleep at night feeling satisfied with yourself and your efforts. Results aren&amp;#39;t as important.&lt;/p&gt;\n\n&lt;p&gt;You need to ask yourself to think big because you only get to live once. You don&amp;#39;t need to get caught up in what is going to stop you or why you might fail or why it might not all come together. Just adapt to your shortcomings and push through. Look at all the people who succeeded despite them having every traditional reason not to. Sylvester Stallone became a Hollywood star even though his face is partially paralyzed. Barack Obama was raised by a single mom in inner city Chicago and became President, running against an experienced senator and war veteran, and then again beat a mega-millionaire in his second term.&lt;/p&gt;\n\n&lt;p&gt;If you see yourself as not succeeding if you take the traditional route, that does not mean your dream is closed to you. That just means don&amp;#39;t take the traditional route. You are going to have to blaze your own path. Maybe you have to work twice as hard as someone else. Maybe you have to work ten times harder and wait ten years longer. So what? The time will pass anyway. In ten years you can either be living your dream (or something close to it) or stuck in a similar shitty routine to what you are dissatisfied with now.&lt;/p&gt;\n\n&lt;p&gt;If you think about what you can &amp;#39;realistically&amp;#39; accomplish, that&amp;#39;s not too bad, but you should also unshackle your mind a bit and dream bigger. Don&amp;#39;t look at how you&amp;#39;re gonna fail and decide not to try. Look at how you&amp;#39;re gonna succeed. Keep in mind how you could fail and just avoid those things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgcttlf", "score_hidden": false, "stickied": false, "created": 1492417800.0, "created_utc": 1492389000.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65q610", "likes": null, "replies": "", "user_reports": [], "id": "dgciwv4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ximoh", "parent_id": "t3_65q610", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Your success will not come without fails, so you are in the right way.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your success will not come without fails, so you are in the right way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgciwv4", "score_hidden": false, "stickied": false, "created": 1492403185.0, "created_utc": 1492374385.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]