[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;2 months ago i got sick of the misery and decided to be better. I started multiple good habits including NoFap and i remember feeling so energetic. In a single day i managed to draw, workout, clean my apartment, write my thesis paper, talk to 5 different friends etc. and actually had a vision for my future. But soon it all became exhausting and i started to relax more and more until now, all i manage is to go to work, watch tv shows, fap and go to sleep. I think im starting to get some motivation back but i hate the fact that i always eventually keep falling back to the slob life. Or do i? There&amp;#39;s also the aspect that i&amp;#39;ve been this slob pretty much my whole life and it&amp;#39;s comfortable. I&amp;#39;ve learned to live with the misery, listening to dark somber music, it&amp;#39;s almost like theres something romantic about the misery and any idea of being some successful awesome dude seems so alien and fake to me. Sometimes i do get sick of it and try to improve, but eventually start questioning it &amp;quot;what for?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "2 months ago i got sick of the misery and decided to be better. I started multiple good habits including NoFap and i remember feeling so energetic. In a single day i managed to draw, workout, clean my apartment, write my thesis paper, talk to 5 different friends etc. and actually had a vision for my future. But soon it all became exhausting and i started to relax more and more until now, all i manage is to go to work, watch tv shows, fap and go to sleep. I think im starting to get some motivation back but i hate the fact that i always eventually keep falling back to the slob life. Or do i? There's also the aspect that i've been this slob pretty much my whole life and it's comfortable. I've learned to live with the misery, listening to dark somber music, it's almost like theres something romantic about the misery and any idea of being some successful awesome dude seems so alien and fake to me. Sometimes i do get sick of it and try to improve, but eventually start questioning it \"what for?\"", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65r3ug", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "elmo1254", "saved": false, "mod_reports": [], "name": "t3_65r3ug", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/65r3ug/i_keep_falling_back/", "num_reports": null, "locked": false, "stickied": false, "created": 1492401999.0, "url": "https://www.reddit.com/r/selfimprovement/comments/65r3ug/i_keep_falling_back/", "author_flair_text": null, "quarantine": false, "title": "I keep falling back", "created_utc": 1492373199.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65r3ug", "likes": null, "replies": "", "user_reports": [], "id": "dgcoceu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rocksteady2R", "parent_id": "t3_65r3ug", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "If I may:\n\nDon't worry about 'Visions for The Future', man, try for one day at a time.  so much easier to handle if you don't put the literal value of your future on a daily progress quota of a few good days.  \n\nHaving said *that* - head on over to /r/theXeffect or /r/bulletjournal and see if something like that strikes a chord with you.  Having a daily method like one of these, and there are a few others, is such an excellent resource.  And it doesn't take much.  5 minutes daily doing a thing - super easy to achieve, and so much more the day you dind't do anything because you were afraid of doing 2 hours.  That'll new you so much progress.  \n\nAnyhow... Whatever you choose, good luck!\n\n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I may:&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t worry about &amp;#39;Visions for The Future&amp;#39;, man, try for one day at a time.  so much easier to handle if you don&amp;#39;t put the literal value of your future on a daily progress quota of a few good days.  &lt;/p&gt;\n\n&lt;p&gt;Having said &lt;em&gt;that&lt;/em&gt; - head on over to &lt;a href=\"/r/theXeffect\"&gt;/r/theXeffect&lt;/a&gt; or &lt;a href=\"/r/bulletjournal\"&gt;/r/bulletjournal&lt;/a&gt; and see if something like that strikes a chord with you.  Having a daily method like one of these, and there are a few others, is such an excellent resource.  And it doesn&amp;#39;t take much.  5 minutes daily doing a thing - super easy to achieve, and so much more the day you dind&amp;#39;t do anything because you were afraid of doing 2 hours.  That&amp;#39;ll new you so much progress.  &lt;/p&gt;\n\n&lt;p&gt;Anyhow... Whatever you choose, good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgcoceu", "score_hidden": false, "stickied": false, "created": 1492410319.0, "created_utc": 1492381519.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65r3ug", "likes": null, "replies": "", "user_reports": [], "id": "dgds2yi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "brick_eater", "parent_id": "t3_65r3ug", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "NoFap can be a useful tool. I would also add journaling as a daily habit if you haven't already, I've found it to be a very useful tool in my arsenal. I used to do a big journal entry at the end of every month, eventually I switched to a small entry every evening - either can work and help you gain more self-awareness and learn the lessons that life is trying to teach you.\n\nI would also consider talking therapy/counselling if you haven't already. I wish I had started seeing a therapist/counsellor sooner than I had to be honest, and every time I've been I've found it useful. Potentially also try CBT as well. Sending positive encouragement your way &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;NoFap can be a useful tool. I would also add journaling as a daily habit if you haven&amp;#39;t already, I&amp;#39;ve found it to be a very useful tool in my arsenal. I used to do a big journal entry at the end of every month, eventually I switched to a small entry every evening - either can work and help you gain more self-awareness and learn the lessons that life is trying to teach you.&lt;/p&gt;\n\n&lt;p&gt;I would also consider talking therapy/counselling if you haven&amp;#39;t already. I wish I had started seeing a therapist/counsellor sooner than I had to be honest, and every time I&amp;#39;ve been I&amp;#39;ve found it useful. Potentially also try CBT as well. Sending positive encouragement your way &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgds2yi", "score_hidden": false, "stickied": false, "created": 1492478108.0, "created_utc": 1492449308.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]