[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First of all I want to warn you that this will probably be long and most likely messy as i&amp;#39;m going to be telling mostly everything that is wrong with me/my life at the moment. I&amp;#39;m 16 and in college (College starts at 16 in the UK), I have zero drive or push to make me do well, I&amp;#39;m about 7 months into college and right now I have like 6 assignments due tomorrow and one exam I&amp;#39;m supposed to be preparing for,I&amp;#39;ve noticed that I&amp;#39;ve been sandbagging a lot and I could be doing extremely well if I wasn&amp;#39;t so lazy, and by the way, I procrastinate  A LOT. I know I have a lot of potential and I would rank myself as pretty smart when I get going, its just that I don&amp;#39;t ever push myself to &amp;quot;get going&amp;quot; or get started in the first place. &lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s worse is that i&amp;#39;m on my LAST WARNING in college due to how many lessons i&amp;#39;ve missed, and honestly i&amp;#39;d say that 30% of the time was because I was stressed on what to where because somewhere in my brain I think that people care so much about me. I&amp;#39;ve gotten really anti-social in college, like really, first of I want to say that I&amp;#39;ve stutter and you may of encountered someone who stutters in your life but it&amp;#39;s not an easy thing to deal with. Stuttering holds me back a lot, like when talking to girls or socializing in general, or even simple things like answering questions in class, I know that stutter is mainly psychological (Atleast in my case) because I don&amp;#39;t really stutter if I&amp;#39;m feeling super confident/juvenile, but the thing is, I try to improve myself, like I tried to workout or get better confidence with talking to girls/people but then my stutter just brings me back to SQUARE 1, and I don&amp;#39;t stutter by myself, only with people, I get nervous and afraid that they&amp;#39;re judging it or &amp;quot;waiting for me&amp;quot; and it just ruins everything. &lt;/p&gt;\n\n&lt;p&gt;What can I do? I&amp;#39;ve been chilling in the library for most of my free time in college and my work ethic is poor as hell in college. It&amp;#39;s funny though, most people say that they didn&amp;#39;t know that I had a stutter until I actually told them, so maybe it&amp;#39;s all in my head thus making my stuttering worse? Idk but it&amp;#39;s a big problem for me, if I go to talk to a girl that&amp;#39;s always on my head, thus making me stutter more. I&amp;#39;m pretty sociable in class though, and I&amp;#39;ll say that i&amp;#39;m pretty attractive or &amp;quot;handsome&amp;quot;, (girls tend to call me cute though). But I don&amp;#39;t want to rely on physical features to uplift me, how can I straighten my life, I want to be a man but I feel so weak inside with my constant pessimistic attitude and my anxiety jolting me in every fucking social situation? I&amp;#39;ll also like to add that I recently took up NoFap as I used to masturbate like everyday, mostly twice, 3 times if on the weekends when i&amp;#39;m doing nothing, but I took up Nofap for my 3rd time last month and lasted like a month and a week, I was really proud of myself but I relapsed last week :( now i&amp;#39;m trying to start again. Also, I stay at home ALL weekends, I don&amp;#39;t go parties or even go out with friends, I do practically nothing but play games, eat or stay on Youtube (which literally takes up 90% of my time). It&amp;#39;s a shame because I&amp;#39;m sure I&amp;#39;m the only one of my friends who hasn&amp;#39;t changed since leaving secondary school and coming to college, it got so depressing that I didn&amp;#39;t like going on snapchat because it&amp;#39;ll just be a bunch of people I know enjoying their lives while i&amp;#39;m even too lazy/scared to do a damn interview to get a job let alone go to a party (The latter actually seems more scary for me). Before I end this, and If you read all of this thankyou, but one problem I&amp;#39;ve had is that I fall BACK into this mindset, like I&amp;#39;ll get pumped for the first few hours or day, maybe 2 if i&amp;#39;m lucky, then boom, i&amp;#39;m the same old depressed guy again, how do I stop that? I&amp;#39;ve gone through this cycle like 20 times already, one mindset where i&amp;#39;m like &amp;quot;YES (my name) JUST ACT COCKY/CONFIDENT (fake it till you make it gig) HAHAHAHA&amp;quot; Then a day later im just riddled with anxiety and the same guy again. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "First of all I want to warn you that this will probably be long and most likely messy as i'm going to be telling mostly everything that is wrong with me/my life at the moment. I'm 16 and in college (College starts at 16 in the UK), I have zero drive or push to make me do well, I'm about 7 months into college and right now I have like 6 assignments due tomorrow and one exam I'm supposed to be preparing for,I've noticed that I've been sandbagging a lot and I could be doing extremely well if I wasn't so lazy, and by the way, I procrastinate  A LOT. I know I have a lot of potential and I would rank myself as pretty smart when I get going, its just that I don't ever push myself to \"get going\" or get started in the first place. \n\nWhat's worse is that i'm on my LAST WARNING in college due to how many lessons i've missed, and honestly i'd say that 30% of the time was because I was stressed on what to where because somewhere in my brain I think that people care so much about me. I've gotten really anti-social in college, like really, first of I want to say that I've stutter and you may of encountered someone who stutters in your life but it's not an easy thing to deal with. Stuttering holds me back a lot, like when talking to girls or socializing in general, or even simple things like answering questions in class, I know that stutter is mainly psychological (Atleast in my case) because I don't really stutter if I'm feeling super confident/juvenile, but the thing is, I try to improve myself, like I tried to workout or get better confidence with talking to girls/people but then my stutter just brings me back to SQUARE 1, and I don't stutter by myself, only with people, I get nervous and afraid that they're judging it or \"waiting for me\" and it just ruins everything. \n\nWhat can I do? I've been chilling in the library for most of my free time in college and my work ethic is poor as hell in college. It's funny though, most people say that they didn't know that I had a stutter until I actually told them, so maybe it's all in my head thus making my stuttering worse? Idk but it's a big problem for me, if I go to talk to a girl that's always on my head, thus making me stutter more. I'm pretty sociable in class though, and I'll say that i'm pretty attractive or \"handsome\", (girls tend to call me cute though). But I don't want to rely on physical features to uplift me, how can I straighten my life, I want to be a man but I feel so weak inside with my constant pessimistic attitude and my anxiety jolting me in every fucking social situation? I'll also like to add that I recently took up NoFap as I used to masturbate like everyday, mostly twice, 3 times if on the weekends when i'm doing nothing, but I took up Nofap for my 3rd time last month and lasted like a month and a week, I was really proud of myself but I relapsed last week :( now i'm trying to start again. Also, I stay at home ALL weekends, I don't go parties or even go out with friends, I do practically nothing but play games, eat or stay on Youtube (which literally takes up 90% of my time). It's a shame because I'm sure I'm the only one of my friends who hasn't changed since leaving secondary school and coming to college, it got so depressing that I didn't like going on snapchat because it'll just be a bunch of people I know enjoying their lives while i'm even too lazy/scared to do a damn interview to get a job let alone go to a party (The latter actually seems more scary for me). Before I end this, and If you read all of this thankyou, but one problem I've had is that I fall BACK into this mindset, like I'll get pumped for the first few hours or day, maybe 2 if i'm lucky, then boom, i'm the same old depressed guy again, how do I stop that? I've gone through this cycle like 20 times already, one mindset where i'm like \"YES (my name) JUST ACT COCKY/CONFIDENT (fake it till you make it gig) HAHAHAHA\" Then a day later im just riddled with anxiety and the same guy again. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ue2t", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "supermaro2", "saved": false, "mod_reports": [], "name": "t3_65ue2t", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/65ue2t/i_have_absolutely_zero_motivation_in_college_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492446697.0, "url": "https://www.reddit.com/r/selfimprovement/comments/65ue2t/i_have_absolutely_zero_motivation_in_college_and/", "author_flair_text": null, "quarantine": false, "title": "I have absolutely zero motivation in college and life in general. (Anxiety,Depression, Social life, Girls)", "created_utc": 1492417897.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65ue2t", "likes": null, "replies": "", "user_reports": [], "id": "dge8drs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LordMoy", "parent_id": "t3_65ue2t", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I have the same problems although at a smaller level. Instead of a stutter I have really bad teeth (disgusting yellow color) and I'm a sophomore in USA. I'm really shy or wary of meeting new people. I'm outgoing and loud within my circle of friends and family but put someone new in front of me, I'll stop talking and act really awkward. I want to change basically most things in my life but like you, I have days where I'm progressing then days where I'm back at square one. Idk if this help but I understand how you feel, your post really hit me hard. I don't know how but I hope that we both can find a way to become what we want to be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have the same problems although at a smaller level. Instead of a stutter I have really bad teeth (disgusting yellow color) and I&amp;#39;m a sophomore in USA. I&amp;#39;m really shy or wary of meeting new people. I&amp;#39;m outgoing and loud within my circle of friends and family but put someone new in front of me, I&amp;#39;ll stop talking and act really awkward. I want to change basically most things in my life but like you, I have days where I&amp;#39;m progressing then days where I&amp;#39;m back at square one. Idk if this help but I understand how you feel, your post really hit me hard. I don&amp;#39;t know how but I hope that we both can find a way to become what we want to be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dge8drs", "score_hidden": false, "stickied": false, "created": 1492496834.0, "created_utc": 1492468034.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65ue2t", "likes": null, "replies": "", "user_reports": [], "id": "dge9xfb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tawayteadrinker", "parent_id": "t3_65ue2t", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Hey man, I feel for you. I've been where you are, but I'm doing a lot better now. I want to talk about myself a little bit to get a point across, so please bear with me.\n\nI graduated college the first time a few years ago, and am going back again. The first time was tough and I almost failed out. I was put on probation, twice, and had to write them a letter begging them to let me stay. I failed a lot of classes and even had to take calculus three times. I'm not dumb either, I just wasn't motivated and couldn't bring myself to care. I would get overwhelmed when I started caring and I've concluded it was a defense mechanism. It sounds like maybe something similar is going on with you.\n\nAfter graduating with a degree I wasn't excited about, my career started eating away at what life I had left. A few years passed and I was getting closer and closer to rock bottom. I was depressed, self-harming, and even thought about suicide.\n\nI'm 29 now. I decided to go back to college last year and have a 4.0 GPA (out of 4.0) and am more motivated then most of the other students. I took 3 classes last summer and had a job, and still aced the classes. I went from almost failing out of college to getting straight A's (and even some A+'s). Things haven't been easy, the material is just as hard as it's ever been, but I have so much more motivation to sit down and understand it. I even have a scholarship and a summer internship lined up. What's more, I have goals and am as happy as I have ever been.\n\nI went back to college in June of 2016. I read a book, Feeling Good, in December of 2015. I would attribute my change to that book. It's not that I just read the book and became super motivated, it was a process and I'm still learning. What the book did was help me with new perspectives of thinking.\n\nA few lessons I learned that I would like to share are:\n\n* Don't be your worst enemy. Berating yourself is just going to make it harder to get to work. Instead, be your own friend.\n* Don't compare yourself to others, compare yourself to your past self. You'll always be able to find somebody that's better than you at everything if look hard enough, so this is just disastrous.\n* Stop seeking validation from others. I'm still struggling form this one, but why should their opinion of you be more important than your own opinion of yourself? Is your opinion of them more important than their own? I don't have much expertise, but it sounds like your stuttering would benefit from not being pressured by what you think others thing of you.\n* Do what you want to do. Be selfish, being being selfish isn't as bad as society makes it. When I changed this perspective I went from wanting to help my aging parents because I had to, to realizing that I actually have a desire to help them be satisfied. When it was a responsibility, I couldn't see past that feeling of being stuck with it.\n* Laziness isn't a character trait. It's a symptom of something deeper, find out what that is. For me, it's always been that something is overwhelming me. Since I realize this, I can sit down and deal with that feeling of being overwhelmed. One technique is to break down large tasks and just focusing on 15-minute segments.\n* One I learned in the last few weeks is that schedules don't work for me. I had a lot to do and started setting deadlines, like I have to finish this task by 4 and that task in the 2 hours after. Instead, focusing on the task has helped more. I don't have to finish it by 4, but I do have to work on it until 4.\n* Look up to Pomodoro technique.\n* Don't downplay your strengths. If you're attractive, be happy about it. No need to get cocky but there's also no reason to not appreciate it.\n* The issue isn't always the most obvious thing. Dig deeper and find out if whatever your experiencing is a cause or a symptom.\n\nI can't stress the first point enough. If you take one thing away from this, it's that you should stop being so hard on yourself.\n\nI didn't learn any of these overnight. They have been skills I have started picking up ever since reading that book. I'm not sure if it'd help you as much, but I'd say it's worth a shot. Heck, I would even be willing to let you borrow my digital copy (I think Amazon will let me lend it) if you can't afford it.\n\nI'm not sure if any of this helps, but please message me if you have any questions or just need to talk.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man, I feel for you. I&amp;#39;ve been where you are, but I&amp;#39;m doing a lot better now. I want to talk about myself a little bit to get a point across, so please bear with me.&lt;/p&gt;\n\n&lt;p&gt;I graduated college the first time a few years ago, and am going back again. The first time was tough and I almost failed out. I was put on probation, twice, and had to write them a letter begging them to let me stay. I failed a lot of classes and even had to take calculus three times. I&amp;#39;m not dumb either, I just wasn&amp;#39;t motivated and couldn&amp;#39;t bring myself to care. I would get overwhelmed when I started caring and I&amp;#39;ve concluded it was a defense mechanism. It sounds like maybe something similar is going on with you.&lt;/p&gt;\n\n&lt;p&gt;After graduating with a degree I wasn&amp;#39;t excited about, my career started eating away at what life I had left. A few years passed and I was getting closer and closer to rock bottom. I was depressed, self-harming, and even thought about suicide.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 29 now. I decided to go back to college last year and have a 4.0 GPA (out of 4.0) and am more motivated then most of the other students. I took 3 classes last summer and had a job, and still aced the classes. I went from almost failing out of college to getting straight A&amp;#39;s (and even some A+&amp;#39;s). Things haven&amp;#39;t been easy, the material is just as hard as it&amp;#39;s ever been, but I have so much more motivation to sit down and understand it. I even have a scholarship and a summer internship lined up. What&amp;#39;s more, I have goals and am as happy as I have ever been.&lt;/p&gt;\n\n&lt;p&gt;I went back to college in June of 2016. I read a book, Feeling Good, in December of 2015. I would attribute my change to that book. It&amp;#39;s not that I just read the book and became super motivated, it was a process and I&amp;#39;m still learning. What the book did was help me with new perspectives of thinking.&lt;/p&gt;\n\n&lt;p&gt;A few lessons I learned that I would like to share are:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Don&amp;#39;t be your worst enemy. Berating yourself is just going to make it harder to get to work. Instead, be your own friend.&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t compare yourself to others, compare yourself to your past self. You&amp;#39;ll always be able to find somebody that&amp;#39;s better than you at everything if look hard enough, so this is just disastrous.&lt;/li&gt;\n&lt;li&gt;Stop seeking validation from others. I&amp;#39;m still struggling form this one, but why should their opinion of you be more important than your own opinion of yourself? Is your opinion of them more important than their own? I don&amp;#39;t have much expertise, but it sounds like your stuttering would benefit from not being pressured by what you think others thing of you.&lt;/li&gt;\n&lt;li&gt;Do what you want to do. Be selfish, being being selfish isn&amp;#39;t as bad as society makes it. When I changed this perspective I went from wanting to help my aging parents because I had to, to realizing that I actually have a desire to help them be satisfied. When it was a responsibility, I couldn&amp;#39;t see past that feeling of being stuck with it.&lt;/li&gt;\n&lt;li&gt;Laziness isn&amp;#39;t a character trait. It&amp;#39;s a symptom of something deeper, find out what that is. For me, it&amp;#39;s always been that something is overwhelming me. Since I realize this, I can sit down and deal with that feeling of being overwhelmed. One technique is to break down large tasks and just focusing on 15-minute segments.&lt;/li&gt;\n&lt;li&gt;One I learned in the last few weeks is that schedules don&amp;#39;t work for me. I had a lot to do and started setting deadlines, like I have to finish this task by 4 and that task in the 2 hours after. Instead, focusing on the task has helped more. I don&amp;#39;t have to finish it by 4, but I do have to work on it until 4.&lt;/li&gt;\n&lt;li&gt;Look up to Pomodoro technique.&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t downplay your strengths. If you&amp;#39;re attractive, be happy about it. No need to get cocky but there&amp;#39;s also no reason to not appreciate it.&lt;/li&gt;\n&lt;li&gt;The issue isn&amp;#39;t always the most obvious thing. Dig deeper and find out if whatever your experiencing is a cause or a symptom.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I can&amp;#39;t stress the first point enough. If you take one thing away from this, it&amp;#39;s that you should stop being so hard on yourself.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t learn any of these overnight. They have been skills I have started picking up ever since reading that book. I&amp;#39;m not sure if it&amp;#39;d help you as much, but I&amp;#39;d say it&amp;#39;s worth a shot. Heck, I would even be willing to let you borrow my digital copy (I think Amazon will let me lend it) if you can&amp;#39;t afford it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if any of this helps, but please message me if you have any questions or just need to talk.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dge9xfb", "score_hidden": false, "stickied": false, "created": 1492498859.0, "created_utc": 1492470059.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]