[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hiya~ Soo I have been trying to teach myself the following things:&lt;/p&gt;\n\n&lt;p&gt;• Doing things for myself&lt;/p&gt;\n\n&lt;p&gt;• Learning to say &amp;quot;no&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;• Learning to stand up for myself&lt;/p&gt;\n\n&lt;p&gt;• Learning to not let others people&amp;#39;s opinions affect me.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m having troubles with the last one..\nI started it slowly by getting going for a vocational school last year, focusing on making art my profession. I broke up with my ex earlier this year (the relationship made me incredibly unhappy), started doing assignments early, focusing on myself, trying to be more social.. All these desicions had made me happier than I was before. But it seems like a few people (from now and my old school) aren&amp;#39;t to happy with some things.. They say I&amp;#39;ve changed and that I&amp;#39;m not the person who I was before. When I confronted and asked in what way, they gave me no reply. They&amp;#39;re not the only ones either- a few people are being salty about my past habits as well.&lt;/p&gt;\n\n&lt;p&gt;I won&amp;#39;t lose myself for them. I&amp;#39;ve made that mistake a few times already.. Yet it bothers me too much sometimes..&lt;/p&gt;\n\n&lt;p&gt;TLDR: How to not give a crap about other people&amp;#39;s opinions?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hiya~ Soo I have been trying to teach myself the following things:\n\n• Doing things for myself\n\n• Learning to say \"no\"\n\n• Learning to stand up for myself\n\n• Learning to not let others people's opinions affect me.\n\n\nI'm having troubles with the last one..\nI started it slowly by getting going for a vocational school last year, focusing on making art my profession. I broke up with my ex earlier this year (the relationship made me incredibly unhappy), started doing assignments early, focusing on myself, trying to be more social.. All these desicions had made me happier than I was before. But it seems like a few people (from now and my old school) aren't to happy with some things.. They say I've changed and that I'm not the person who I was before. When I confronted and asked in what way, they gave me no reply. They're not the only ones either- a few people are being salty about my past habits as well.\n\nI won't lose myself for them. I've made that mistake a few times already.. Yet it bothers me too much sometimes..\n\nTLDR: How to not give a crap about other people's opinions?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65uza4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 54, "report_reasons": null, "author": "Xaquinn", "saved": false, "mod_reports": [], "name": "t3_65uza4", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/65uza4/how_to_not_care_about_other_peoples_opinions/", "num_reports": null, "locked": false, "stickied": false, "created": 1492457293.0, "url": "https://www.reddit.com/r/selfimprovement/comments/65uza4/how_to_not_care_about_other_peoples_opinions/", "author_flair_text": null, "quarantine": false, "title": "How to not care about other people's opinions?", "created_utc": 1492428493.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 54}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65uza4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65uza4", "likes": null, "replies": "", "user_reports": [], "id": "dgdtgvd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "taylorswiftxd", "parent_id": "t1_dgdeqnz", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "In short: they hate us cause they ain't us", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In short: they hate us cause they ain&amp;#39;t us&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgdtgvd", "score_hidden": false, "stickied": false, "created": 1492479641.0, "created_utc": 1492450841.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdeqnz", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "_Thatoneguy101_", "parent_id": "t3_65uza4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "There was this one meme which said \"I used to care about other people's opinions, until I tried to pay my bills with them\". \nThere's a really good chance the people who criticize you have similar behaviours to the ones you used to and just can't stand to look at someone who actually does something about them. That's really common but not always the case. \nMaybe it's just how you come off, try to actually consider what they say and decide for yourself if they have a point or not. Maybe you're accidentally doing something annoying, again it's a possibility, it's up to you to decide if it's something you want to change or not.\nIf your friends distance themselves from you because you try to improve yourself, then they're no friends at all, just people who look to be with those similar to them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There was this one meme which said &amp;quot;I used to care about other people&amp;#39;s opinions, until I tried to pay my bills with them&amp;quot;. \nThere&amp;#39;s a really good chance the people who criticize you have similar behaviours to the ones you used to and just can&amp;#39;t stand to look at someone who actually does something about them. That&amp;#39;s really common but not always the case. \nMaybe it&amp;#39;s just how you come off, try to actually consider what they say and decide for yourself if they have a point or not. Maybe you&amp;#39;re accidentally doing something annoying, again it&amp;#39;s a possibility, it&amp;#39;s up to you to decide if it&amp;#39;s something you want to change or not.\nIf your friends distance themselves from you because you try to improve yourself, then they&amp;#39;re no friends at all, just people who look to be with those similar to them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgdeqnz", "score_hidden": false, "stickied": false, "created": 1492460282.0, "created_utc": 1492431482.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65uza4", "likes": null, "replies": "", "user_reports": [], "id": "dgds6lc", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Sindrosan", "parent_id": "t3_65uza4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I love this question. It's a challenge I experience as well.\nShort answer, it takes practice. You have to continue doing things that you want to do and treat everyone else's opinions as water off a ducks back. At first it's hard and even nerve wracking, but as time goes on it does get easier.\n\nA quote I once heard said something along the lines of \"No matter how famous you get, how popular you get, how successful you get, no matter how well of a speech you write or how well you plan your actions; people will misinterpret, remember incorrectly, jump to conclusions and misquote you. Everyone already has a bias that everything about you passes through. So, if people are going to hear what they want to hear you may as well say what you want to say\"\n\nThat saying had helped me out a lot. It reminded me that people are usually more concerned with themselves, which also includes *their* definition/image of you. It's worth changing for the better, but if you're around people that don't want to improve themselves for the better and don't understand why you want to improve you, they *will* misinterpret. Accept that going in and keep moving forward.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love this question. It&amp;#39;s a challenge I experience as well.\nShort answer, it takes practice. You have to continue doing things that you want to do and treat everyone else&amp;#39;s opinions as water off a ducks back. At first it&amp;#39;s hard and even nerve wracking, but as time goes on it does get easier.&lt;/p&gt;\n\n&lt;p&gt;A quote I once heard said something along the lines of &amp;quot;No matter how famous you get, how popular you get, how successful you get, no matter how well of a speech you write or how well you plan your actions; people will misinterpret, remember incorrectly, jump to conclusions and misquote you. Everyone already has a bias that everything about you passes through. So, if people are going to hear what they want to hear you may as well say what you want to say&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That saying had helped me out a lot. It reminded me that people are usually more concerned with themselves, which also includes &lt;em&gt;their&lt;/em&gt; definition/image of you. It&amp;#39;s worth changing for the better, but if you&amp;#39;re around people that don&amp;#39;t want to improve themselves for the better and don&amp;#39;t understand why you want to improve you, they &lt;em&gt;will&lt;/em&gt; misinterpret. Accept that going in and keep moving forward.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgds6lc", "score_hidden": false, "stickied": false, "created": 1492478217.0, "created_utc": 1492449417.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65uza4", "likes": null, "replies": "", "user_reports": [], "id": "dgdr7rh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kirbyderwood", "parent_id": "t3_65uza4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "&gt; But it seems like a few people (from now and my old school) aren't to happy with some things.. They say I've changed and that I'm not the person who I was before\n\nThat's 100% true.  You're not the same person.  But then again, nobody is the same person they were before.  Everybody evolves and changes.  Some resist this change, some embrace it.  Those who resist it, suffer.  Those who embrace it, thrive.  By going back to school, you're embracing that natural evolution, hopefully for the better.  You are becoming a different person, and that is not a bad thing at all - be proud of it.\n\nMaybe some of your friends are resisting your evolution and are suffering as a result.  They're pining for the \"good old days\" or maybe mourning the loss of the \"old you.\"  Perhaps they are slightly jealous that you're taking action and they're not.   Whatever the reason, you can't control their reaction to your evolution.  All you can do is be compassionate.  If their negativity  becomes too much, then step back for a while until it subsides.  But realize it is their reaction to you and they are ultimately responsible for it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But it seems like a few people (from now and my old school) aren&amp;#39;t to happy with some things.. They say I&amp;#39;ve changed and that I&amp;#39;m not the person who I was before&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s 100% true.  You&amp;#39;re not the same person.  But then again, nobody is the same person they were before.  Everybody evolves and changes.  Some resist this change, some embrace it.  Those who resist it, suffer.  Those who embrace it, thrive.  By going back to school, you&amp;#39;re embracing that natural evolution, hopefully for the better.  You are becoming a different person, and that is not a bad thing at all - be proud of it.&lt;/p&gt;\n\n&lt;p&gt;Maybe some of your friends are resisting your evolution and are suffering as a result.  They&amp;#39;re pining for the &amp;quot;good old days&amp;quot; or maybe mourning the loss of the &amp;quot;old you.&amp;quot;  Perhaps they are slightly jealous that you&amp;#39;re taking action and they&amp;#39;re not.   Whatever the reason, you can&amp;#39;t control their reaction to your evolution.  All you can do is be compassionate.  If their negativity  becomes too much, then step back for a while until it subsides.  But realize it is their reaction to you and they are ultimately responsible for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgdr7rh", "score_hidden": false, "stickied": false, "created": 1492477139.0, "created_utc": 1492448339.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65uza4", "likes": null, "replies": "", "user_reports": [], "id": "dgdyig6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ParasiticNarwal", "parent_id": "t3_65uza4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Think about how much you think about a random person, in seconds and minutes, on an average day. Next to nothing right? That is the maximum they think about you. Why occupy so much of your mental energy in the pursuit of improving people's opinions when the majority of them don't even have one. In short, people don't care about you, why should you care about people. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Think about how much you think about a random person, in seconds and minutes, on an average day. Next to nothing right? That is the maximum they think about you. Why occupy so much of your mental energy in the pursuit of improving people&amp;#39;s opinions when the majority of them don&amp;#39;t even have one. In short, people don&amp;#39;t care about you, why should you care about people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgdyig6", "score_hidden": false, "stickied": false, "created": 1492485291.0, "created_utc": 1492456491.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65uza4", "likes": null, "replies": "", "user_reports": [], "id": "dgdgmu2", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "QuibsY", "parent_id": "t3_65uza4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "My go-to person for this kind of stuff is Day[9]. Twitch streamer and Youtuber. Has several videos on his channel under \"Day[9] Story Time\" that I'd recommend.\n\nTo loosely quote, and what I think you should take away from him: \"If there is someone negative in your life, or says you can't do something, you should actually just never talk to that person ever. And you can.\" If you want to see the exact quote it's \"Day[9]'s Musings - Being Relentlessly Positive on youtube. Can't link =/\n\nI apply this to my life daily, I just don't talk to those negative people. It takes some time and some will power but you end up surrounding yourself with people that you genuinely like. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My go-to person for this kind of stuff is Day[9]. Twitch streamer and Youtuber. Has several videos on his channel under &amp;quot;Day[9] Story Time&amp;quot; that I&amp;#39;d recommend.&lt;/p&gt;\n\n&lt;p&gt;To loosely quote, and what I think you should take away from him: &amp;quot;If there is someone negative in your life, or says you can&amp;#39;t do something, you should actually just never talk to that person ever. And you can.&amp;quot; If you want to see the exact quote it&amp;#39;s &amp;quot;Day[9]&amp;#39;s Musings - Being Relentlessly Positive on youtube. Can&amp;#39;t link =/&lt;/p&gt;\n\n&lt;p&gt;I apply this to my life daily, I just don&amp;#39;t talk to those negative people. It takes some time and some will power but you end up surrounding yourself with people that you genuinely like. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgdgmu2", "score_hidden": false, "stickied": false, "created": 1492463797.0, "created_utc": 1492434997.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65uza4", "likes": null, "replies": "", "user_reports": [], "id": "dgdf715", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "danielunited", "parent_id": "t3_65uza4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "You really find something that makes you comfortable. Find something you're good at and enjoy doing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You really find something that makes you comfortable. Find something you&amp;#39;re good at and enjoy doing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgdf715", "score_hidden": false, "stickied": false, "created": 1492461192.0, "created_utc": 1492432392.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65uza4", "likes": null, "replies": "", "user_reports": [], "id": "dge0j4g", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ouroboro76", "parent_id": "t3_65uza4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": " Almost everybody loves a yes person or a doormat, but fewer love people that push back a bit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Almost everybody loves a yes person or a doormat, but fewer love people that push back a bit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dge0j4g", "score_hidden": false, "stickied": false, "created": 1492487576.0, "created_utc": 1492458776.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65uza4", "likes": null, "replies": "", "user_reports": [], "id": "dge33iy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lxpnh98_2", "parent_id": "t3_65uza4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "The thing about other people's opinions of you is that they don't exist as much as you think they do. Most people think primarily about themselves, and don't care about other people as much. Those who do are often insecure about themselves, so you shouldn't really worry about them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing about other people&amp;#39;s opinions of you is that they don&amp;#39;t exist as much as you think they do. Most people think primarily about themselves, and don&amp;#39;t care about other people as much. Those who do are often insecure about themselves, so you shouldn&amp;#39;t really worry about them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dge33iy", "score_hidden": false, "stickied": false, "created": 1492490449.0, "created_utc": 1492461649.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65uza4", "likes": null, "replies": "", "user_reports": [], "id": "dgep0om", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "stefoo2", "parent_id": "t3_65uza4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Here's a cool thing to remember.\n\nYou are a 1,000,000 page novel. You are so complex you hardly know yourself. \n\nWhen someone judges you, they open up the novel and read a SINGLE page and then they build their opinion about the ENTIRE BOOK based on that SINGLE PAGE. That's bullshit. But that is how people work, we are designed to work that way because instinctually we do that to protect ourselves.\n\nSo acknowledge that they are being ignorant when they say the things that they do, and KNOW that if they TRULY knew who you were, they would never EVER say the things that they do. Instead they would see a amazing person with beautiful qualities, because ultimately, we are all amazing and limitless but that is hidden behind our fears and insecurities. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s a cool thing to remember.&lt;/p&gt;\n\n&lt;p&gt;You are a 1,000,000 page novel. You are so complex you hardly know yourself. &lt;/p&gt;\n\n&lt;p&gt;When someone judges you, they open up the novel and read a SINGLE page and then they build their opinion about the ENTIRE BOOK based on that SINGLE PAGE. That&amp;#39;s bullshit. But that is how people work, we are designed to work that way because instinctually we do that to protect ourselves.&lt;/p&gt;\n\n&lt;p&gt;So acknowledge that they are being ignorant when they say the things that they do, and KNOW that if they TRULY knew who you were, they would never EVER say the things that they do. Instead they would see a amazing person with beautiful qualities, because ultimately, we are all amazing and limitless but that is hidden behind our fears and insecurities. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgep0om", "score_hidden": false, "stickied": false, "created": 1492518233.0, "created_utc": 1492489433.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65uza4", "likes": null, "replies": "", "user_reports": [], "id": "dgdntg7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bradrel", "parent_id": "t3_65uza4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Consider reading The Four Agreements by Don Miguel Ruiz.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Consider reading The Four Agreements by Don Miguel Ruiz.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgdntg7", "score_hidden": false, "stickied": false, "created": 1492473332.0, "created_utc": 1492444532.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65uza4", "likes": null, "replies": "", "user_reports": [], "id": "dgdjapr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bubblebleep", "parent_id": "t3_65uza4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Don't ask them in what ways you have changed, instead ask them what is bothering them in the new you. If they have an answer (which is not always the case), ask examples, then thank them for pointing that out and tell them you will think about how you could have done things in a different way. Then, two options: either you do think about it and maybe change a few things in the process (if that fits new you), or you just plain forget it and go on living your live. Even then, the other person might feel considered and that might be enough to stop him from complaining.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t ask them in what ways you have changed, instead ask them what is bothering them in the new you. If they have an answer (which is not always the case), ask examples, then thank them for pointing that out and tell them you will think about how you could have done things in a different way. Then, two options: either you do think about it and maybe change a few things in the process (if that fits new you), or you just plain forget it and go on living your live. Even then, the other person might feel considered and that might be enough to stop him from complaining.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgdjapr", "score_hidden": false, "stickied": false, "created": 1492467793.0, "created_utc": 1492438993.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65uza4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65uza4", "likes": null, "replies": "", "user_reports": [], "id": "dgdfc6d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t1_dgdfc67", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Your submission to /r/selfimprovement was automatically removed for including a photo, link, or video in violation of Rule #2. Please read the rules and post accordingly. Thank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/selfimprovement) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your submission to &lt;a href=\"/r/selfimprovement\"&gt;/r/selfimprovement&lt;/a&gt; was automatically removed for including a photo, link, or video in violation of Rule #2. Please read the rules and post accordingly. Thank you!&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/selfimprovement\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgdfc6d", "score_hidden": false, "stickied": false, "created": 1492461471.0, "created_utc": 1492432671.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfc67", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65uza4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgdfc67", "score_hidden": false, "stickied": false, "created": 1492461471.0, "created_utc": 1492432671.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]