[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see people as objects of my gratification and a way to achieve some sort of goal or get some sort of resource. I am very cold and emotionless towards everyone  around me. I see Friends as a means to get something like getting into parties, getting homework ftom etc. I&amp;#39;ve deloped a very shall we say &amp;quot;red pill&amp;quot; mindset towards women. I see women as these trophies to be won. I can never have a female friend cause I just see no purpose.\nEven my own family I see as a convenient means to resources.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not a sociopath but I do have a super rational emotionless side to me. Everything is like a job that needs to be done. Everything is dull and boring. Stuff people enjoy like going out, watching movies etc I just see it as an opportunity to &amp;quot;self improve&amp;quot; I couldn&amp;#39;t care less about the activity or people involved.&lt;/p&gt;\n\n&lt;p&gt;Seriously how do you actually enjoy stuff?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I see people as objects of my gratification and a way to achieve some sort of goal or get some sort of resource. I am very cold and emotionless towards everyone  around me. I see Friends as a means to get something like getting into parties, getting homework ftom etc. I've deloped a very shall we say \"red pill\" mindset towards women. I see women as these trophies to be won. I can never have a female friend cause I just see no purpose.\nEven my own family I see as a convenient means to resources.\n\n\n\n\nI'm not a sociopath but I do have a super rational emotionless side to me. Everything is like a job that needs to be done. Everything is dull and boring. Stuff people enjoy like going out, watching movies etc I just see it as an opportunity to \"self improve\" I couldn't care less about the activity or people involved.\n\n\n\n\nSeriously how do you actually enjoy stuff?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65y4bg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 19, "report_reasons": null, "author": "aldjfh", "saved": false, "mod_reports": [], "name": "t3_65y4bg", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/65y4bg/i_see_everything_as_a_job_how_do_i_actuallu_enjoy/", "num_reports": null, "locked": false, "stickied": false, "created": 1492489628.0, "url": "https://www.reddit.com/r/selfimprovement/comments/65y4bg/i_see_everything_as_a_job_how_do_i_actuallu_enjoy/", "author_flair_text": null, "quarantine": false, "title": "I see everything as a job. How do I actuallu enjoy stuff?", "created_utc": 1492460828.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65y4bg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65y4bg", "likes": null, "replies": "", "user_reports": [], "id": "dgemwne", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Saxyphone", "parent_id": "t1_dge5eui", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "This is solid advice. Fake it till you make it sounds stupid, and dishonest, but in the end, you really will become a more comfortable, sociable individual. Whenever I am introduced to a new social situation, whether it be a new job, new school, or whatever, I insticutally close myself off, and stick to myself. But I force myself to get out of that habit by actively attempting to talk to one person in that group every time I'm involved with them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is solid advice. Fake it till you make it sounds stupid, and dishonest, but in the end, you really will become a more comfortable, sociable individual. Whenever I am introduced to a new social situation, whether it be a new job, new school, or whatever, I insticutally close myself off, and stick to myself. But I force myself to get out of that habit by actively attempting to talk to one person in that group every time I&amp;#39;m involved with them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgemwne", "score_hidden": false, "stickied": false, "created": 1492515134.0, "created_utc": 1492486334.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge5eui", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Poo-et", "parent_id": "t3_65y4bg", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I think that a lot of what you're describing is a coping mechanism for your difficulties being social. You are emotionally detaching yourself from those around you to compensate for a flaw you are hiding from. And from scrubbing your post history (sorry), I think that because you have been romantically and socially unsuccessful, you have retreated into this shell where you try to avoid feeling anything for fear of rejection. The human brain, except in the cases of suicidal individuals, will never embrace being flawed. This leads to an \"it's not me, it's them\" mentality. And this is absolutely not a negative personal reflection on your character, just an universal observation from my life.\n\nI think the best way to snap out of this mindset is to *pretend* to care. Bear with me here. Join a sports club. Hate sports? I thought I did too until I picked up Table Tennis. There's probably a club near you. Go in, and TRY to make a single friend. Talk to a single person, and get to know them. Assuming you're not a horrible person with no redeeming qualities (which is obviously not the case), you will now have someone you know. Don't close off from them, and the next time you go to the club, talk to that same person. Don't be cold and detached, be animated and once again *pretend* to be interested even if you don't.  \n\nThis is what helped me claw my way out of the shell that enveloped me for the first 13 years of my life. We've all got a long way to go here, but we're in it together. I mean, fuck, I just posted the 'I'm a dick' thread that is currently sitting just below yours. Stay positive. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that a lot of what you&amp;#39;re describing is a coping mechanism for your difficulties being social. You are emotionally detaching yourself from those around you to compensate for a flaw you are hiding from. And from scrubbing your post history (sorry), I think that because you have been romantically and socially unsuccessful, you have retreated into this shell where you try to avoid feeling anything for fear of rejection. The human brain, except in the cases of suicidal individuals, will never embrace being flawed. This leads to an &amp;quot;it&amp;#39;s not me, it&amp;#39;s them&amp;quot; mentality. And this is absolutely not a negative personal reflection on your character, just an universal observation from my life.&lt;/p&gt;\n\n&lt;p&gt;I think the best way to snap out of this mindset is to &lt;em&gt;pretend&lt;/em&gt; to care. Bear with me here. Join a sports club. Hate sports? I thought I did too until I picked up Table Tennis. There&amp;#39;s probably a club near you. Go in, and TRY to make a single friend. Talk to a single person, and get to know them. Assuming you&amp;#39;re not a horrible person with no redeeming qualities (which is obviously not the case), you will now have someone you know. Don&amp;#39;t close off from them, and the next time you go to the club, talk to that same person. Don&amp;#39;t be cold and detached, be animated and once again &lt;em&gt;pretend&lt;/em&gt; to be interested even if you don&amp;#39;t.  &lt;/p&gt;\n\n&lt;p&gt;This is what helped me claw my way out of the shell that enveloped me for the first 13 years of my life. We&amp;#39;ve all got a long way to go here, but we&amp;#39;re in it together. I mean, fuck, I just posted the &amp;#39;I&amp;#39;m a dick&amp;#39; thread that is currently sitting just below yours. Stay positive. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dge5eui", "score_hidden": false, "stickied": false, "created": 1492493134.0, "created_utc": 1492464334.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}]