[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all. I&amp;#39;m a 23 y/o guy. For as long as I can remember I&amp;#39;ve suffered from what I&amp;#39;d describe as low self-esteem. But so many descriptions of what it&amp;#39;s like to have low self-esteem and such online just... don&amp;#39;t completely click with me. I&amp;#39;ve always felt like I was a walking contradiction in many senses. Let me give an overview...&lt;/p&gt;\n\n&lt;p&gt;I am self-critical. I&amp;#39;m passive. I&amp;#39;m often scared to assert myself. I&amp;#39;m a pessimistic, and I&amp;#39;m often cynical, but also very trusting at once.&lt;/p&gt;\n\n&lt;p&gt;I am happy with the way I look - very happy. I&amp;#39;m attractive and I know it... yet I don&amp;#39;t feel like it I can take advantage of it. I have slept with four people, and been in two relationships (currently in the second). So while I&amp;#39;m not inept - I&amp;#39;ve always been terrified by the prospect of a hook-up or one night stand. I just can&amp;#39;t bring myself to do it, I don&amp;#39;t have the confidence in myself, which is why sexual encounters have been few and far between.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t feel guilty about myself, I just feel disappointed in myself a lot of the time. And yet I&amp;#39;ve never once felt like I wanted to be another person. I&amp;#39;ve always wanted to be &amp;#39;me&amp;#39;. I feel like this is crucial, as it goes against a lot of what I&amp;#39;ve read.&lt;/p&gt;\n\n&lt;p&gt;I consider myself an introvert, &lt;em&gt;but&lt;/em&gt; I do need social interaction and I&amp;#39;ve never had trouble making friends in my adult life - I would say I&amp;#39;m fairly popular, but don&amp;#39;t entirely know what I do so right. I just be myself. Despite this, I&amp;#39;m still constantly anxious about what people think of me, and I have paranoid characteristics.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always been scared of pursuing relationships because I rarely have strong enough feelings for someone to justify it. I&amp;#39;ve always been scared of pursuing a relationship which I couldn&amp;#39;t commit to 100%. My first relationship was a couple years back - a girl with BPD. I truly loved her, but, I learned the hard way. In hindsight, I think it&amp;#39;s clear why I fell for her - I think we each saw a lot of ourselves in each other, but inevitably it fell apart despite my best efforts.&lt;/p&gt;\n\n&lt;p&gt;Currently I&amp;#39;m in a relationship but I just don&amp;#39;t feel that strongly towards the girl I&amp;#39;m with, yet I&amp;#39;m also scared of breaking up with her since I know she&amp;#39;s good for me, and likes me a lot. I feel like I&amp;#39;d regret it. But I also feel a little trapped... despite this one being a healthy relationship with a regular girl.&lt;/p&gt;\n\n&lt;p&gt;I should also mention that I&amp;#39;m ADHD, diagnosed, medicated; but I get tired of trying to pin all of my problems to that because there&amp;#39;s never any resolution to be found and it often feels like I&amp;#39;m missing something. I&amp;#39;ve suffered from on-and-off mild depression for as long as I can remember too.&lt;/p&gt;\n\n&lt;p&gt;I have a very loving and supportive family, and two successful older brothers, so the problem is not rooted with my childhood / parents. At least I wouldn&amp;#39;t think so. But then I don&amp;#39;t feel like I had a particularly happy childhood either, always did feel a bit distant and disconnected from the world around me.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR always felt that I have low self-esteem but a lot of my symptoms / traits are conflicting, I know I&amp;#39;m attractive and popular but it doesn&amp;#39;t help my crippling self-doubt, I&amp;#39;ve always felt depressed but have never wanted to be someone else. Would like to get over these things but feel a bit hopeless or pessimistic that I ever will&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi all. I'm a 23 y/o guy. For as long as I can remember I've suffered from what I'd describe as low self-esteem. But so many descriptions of what it's like to have low self-esteem and such online just... don't completely click with me. I've always felt like I was a walking contradiction in many senses. Let me give an overview...\n\nI am self-critical. I'm passive. I'm often scared to assert myself. I'm a pessimistic, and I'm often cynical, but also very trusting at once.\n\nI am happy with the way I look - very happy. I'm attractive and I know it... yet I don't feel like it I can take advantage of it. I have slept with four people, and been in two relationships (currently in the second). So while I'm not inept - I've always been terrified by the prospect of a hook-up or one night stand. I just can't bring myself to do it, I don't have the confidence in myself, which is why sexual encounters have been few and far between.\n\nI don't feel guilty about myself, I just feel disappointed in myself a lot of the time. And yet I've never once felt like I wanted to be another person. I've always wanted to be 'me'. I feel like this is crucial, as it goes against a lot of what I've read.\n\nI consider myself an introvert, *but* I do need social interaction and I've never had trouble making friends in my adult life - I would say I'm fairly popular, but don't entirely know what I do so right. I just be myself. Despite this, I'm still constantly anxious about what people think of me, and I have paranoid characteristics.\n\nI've always been scared of pursuing relationships because I rarely have strong enough feelings for someone to justify it. I've always been scared of pursuing a relationship which I couldn't commit to 100%. My first relationship was a couple years back - a girl with BPD. I truly loved her, but, I learned the hard way. In hindsight, I think it's clear why I fell for her - I think we each saw a lot of ourselves in each other, but inevitably it fell apart despite my best efforts.\n\nCurrently I'm in a relationship but I just don't feel that strongly towards the girl I'm with, yet I'm also scared of breaking up with her since I know she's good for me, and likes me a lot. I feel like I'd regret it. But I also feel a little trapped... despite this one being a healthy relationship with a regular girl.\n\nI should also mention that I'm ADHD, diagnosed, medicated; but I get tired of trying to pin all of my problems to that because there's never any resolution to be found and it often feels like I'm missing something. I've suffered from on-and-off mild depression for as long as I can remember too.\n\nI have a very loving and supportive family, and two successful older brothers, so the problem is not rooted with my childhood / parents. At least I wouldn't think so. But then I don't feel like I had a particularly happy childhood either, always did feel a bit distant and disconnected from the world around me.\n\n**TL;DR always felt that I have low self-esteem but a lot of my symptoms / traits are conflicting, I know I'm attractive and popular but it doesn't help my crippling self-doubt, I've always felt depressed but have never wanted to be someone else. Would like to get over these things but feel a bit hopeless or pessimistic that I ever will**", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65zyj4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 15, "report_reasons": null, "author": "TossThisItem", "saved": false, "mod_reports": [], "name": "t3_65zyj4", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": 1492481928.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/65zyj4/low_selfesteem_or_something_else/", "num_reports": null, "locked": false, "stickied": false, "created": 1492509169.0, "url": "https://www.reddit.com/r/selfimprovement/comments/65zyj4/low_selfesteem_or_something_else/", "author_flair_text": null, "quarantine": false, "title": "Low self-esteem, or something else?", "created_utc": 1492480369.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65zyj4", "likes": null, "replies": "", "user_reports": [], "id": "dgeuly1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Whitecrow1979", "parent_id": "t3_65zyj4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Wish I could offer some advice, but I'm not certain I have any. Just know you're not alone, I could have written nearly all of what you wrote. I was in a relationship for 11 years for almost exactly the same reasons you gave. After that ended I finally met someone who I consider a perfect match and we have been together for 6 years.\n\nThe best advice I have is try to find something you love and do it. This will give you more mental strength and drive. It could be art or literature or sport or volunteering. For me it was fighting (MMA and full contact armoured combat) and wild swimming. Both make me feel alive in a way not much else does. Also realise it is possible for you to have a happy relationship.\n\nOn top of this try mindful meditation, forcing yourself to be in the moment, without judgement. \n\nHope this is the kind of thing you're looking for.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wish I could offer some advice, but I&amp;#39;m not certain I have any. Just know you&amp;#39;re not alone, I could have written nearly all of what you wrote. I was in a relationship for 11 years for almost exactly the same reasons you gave. After that ended I finally met someone who I consider a perfect match and we have been together for 6 years.&lt;/p&gt;\n\n&lt;p&gt;The best advice I have is try to find something you love and do it. This will give you more mental strength and drive. It could be art or literature or sport or volunteering. For me it was fighting (MMA and full contact armoured combat) and wild swimming. Both make me feel alive in a way not much else does. Also realise it is possible for you to have a happy relationship.&lt;/p&gt;\n\n&lt;p&gt;On top of this try mindful meditation, forcing yourself to be in the moment, without judgement. &lt;/p&gt;\n\n&lt;p&gt;Hope this is the kind of thing you&amp;#39;re looking for.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgeuly1", "score_hidden": false, "stickied": false, "created": 1492529973.0, "created_utc": 1492501173.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65zyj4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65zyj4", "likes": null, "replies": "", "user_reports": [], "id": "dgew3zh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t1_dgew3zb", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "Your submission to /r/selfimprovement was automatically removed for including a photo, link, or video in violation of Rule #2. Please read the rules and post accordingly. Thank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/selfimprovement) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your submission to &lt;a href=\"/r/selfimprovement\"&gt;/r/selfimprovement&lt;/a&gt; was automatically removed for including a photo, link, or video in violation of Rule #2. Please read the rules and post accordingly. Thank you!&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/selfimprovement\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgew3zh", "score_hidden": false, "stickied": false, "created": 1492534747.0, "created_utc": 1492505947.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgew3zb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65zyj4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgew3zb", "score_hidden": false, "stickied": false, "created": 1492534746.0, "created_utc": 1492505946.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65zyj4", "likes": null, "replies": "", "user_reports": [], "id": "dgew68g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vishipedia", "parent_id": "t3_65zyj4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "IMHO, your esteem issues are a result of confusion and anxiety. I mean, if you're popular and attractive and not apologetic about who you are, you don't need to feel disappointed either, right?\n\nYou need a goal - something which makes you feel fulfilled. A goal worth pursuing will take your mind off relationships and people, and make you look deep within yourself. But to find that goal, dear friend, you'll have to look forward. I read a lot of what's happened in your past. Despite being popular, attractive and accepting of yourself, you're still stuck to the past - your childhood, relationships and more.\n\nYou're probably pessimistic because you feel like it'll happen again. Yes, that's pessimism, but it's also anxiety. It looks like there's a lot of repressed emotion in you which is bursting to erupt, and which is also impeding your ability to look at events around you in a logical fashion. To sharpen your ability to be discerning, the negative emotions need addressing.\n\nI won't suggest meditation, getting therapy, yada yada yada right now. All you've got to do is this: Make a gratitude journal. Each morning or night, write down 3 things you are grateful for. Just 3. And don't say, \"I've got nothing to be thankful for.\" Look for 3 things. Reflect on the day and pen down 3 things that make you feel grateful for being you.\n\nEasy? Good. Just follow this step (diligently) for 3 weeks. Then examine how you feel after.\n\nGood luck :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;IMHO, your esteem issues are a result of confusion and anxiety. I mean, if you&amp;#39;re popular and attractive and not apologetic about who you are, you don&amp;#39;t need to feel disappointed either, right?&lt;/p&gt;\n\n&lt;p&gt;You need a goal - something which makes you feel fulfilled. A goal worth pursuing will take your mind off relationships and people, and make you look deep within yourself. But to find that goal, dear friend, you&amp;#39;ll have to look forward. I read a lot of what&amp;#39;s happened in your past. Despite being popular, attractive and accepting of yourself, you&amp;#39;re still stuck to the past - your childhood, relationships and more.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re probably pessimistic because you feel like it&amp;#39;ll happen again. Yes, that&amp;#39;s pessimism, but it&amp;#39;s also anxiety. It looks like there&amp;#39;s a lot of repressed emotion in you which is bursting to erupt, and which is also impeding your ability to look at events around you in a logical fashion. To sharpen your ability to be discerning, the negative emotions need addressing.&lt;/p&gt;\n\n&lt;p&gt;I won&amp;#39;t suggest meditation, getting therapy, yada yada yada right now. All you&amp;#39;ve got to do is this: Make a gratitude journal. Each morning or night, write down 3 things you are grateful for. Just 3. And don&amp;#39;t say, &amp;quot;I&amp;#39;ve got nothing to be thankful for.&amp;quot; Look for 3 things. Reflect on the day and pen down 3 things that make you feel grateful for being you.&lt;/p&gt;\n\n&lt;p&gt;Easy? Good. Just follow this step (diligently) for 3 weeks. Then examine how you feel after.&lt;/p&gt;\n\n&lt;p&gt;Good luck :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgew68g", "score_hidden": false, "stickied": false, "created": 1492534947.0, "created_utc": 1492506147.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_65zyj4", "likes": null, "replies": "", "user_reports": [], "id": "dgew6cn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dirtydansie", "parent_id": "t3_65zyj4", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "I would highly recommend reading the book 'Six pillars of self-esteem' by  Nathaniel Branden, there will be at least one part that resonates with you. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would highly recommend reading the book &amp;#39;Six pillars of self-esteem&amp;#39; by  Nathaniel Branden, there will be at least one part that resonates with you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgew6cn", "score_hidden": false, "stickied": false, "created": 1492534957.0, "created_utc": 1492506157.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]