[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "selfimprovement", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for taking the time to hear me out. I&amp;#39;m noticing that, when I try and keep at something I don&amp;#39;t improve, and I wind up stagnating. There are times, were I&amp;#39;m incredibly good at something, but only in the beginning. I almost want to coin the term &amp;quot;reverse learning.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The biggest noticeable challenge I had, of hitting a brick wall was when I was learning to drive. My instructor and I would start off on a Monday really well, but as the week progressed, even for an hour at a time, I&amp;#39;d slip up and make mistakes, that I normally wouldn&amp;#39;t make. &lt;/p&gt;\n\n&lt;p&gt;People were quickly flying by the course; they&amp;#39;d be able have a few lessons, nail it down, and then got their license, yet I was stuck being called unteachable. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had some issues with hobby games and video games too. I&amp;#39;d practice tabletop battles with friends, and read tactics on 1d4chan.org for an army comp, yet...no matter how much time and effort Id put in, I&amp;#39;d still lose. I&amp;#39;ve had people explain things to me and show me different strategic positions, yet I can&amp;#39;t seem to grasp it with their help. &lt;/p&gt;\n\n&lt;p&gt;This is also effecting my areas of higher learning in college. I&amp;#39;ve needed specialized assistance in math, listened to what they were trying to explain and it&amp;#39;s like I can&amp;#39;t comprehend it. My music professors won&amp;#39;t wait up for me either, and just last month I had the professor jab at me saying, &amp;quot;there are some people that think they&amp;#39;re singing when they&amp;#39;re actually not&amp;quot; she didn&amp;#39;t refer to me, yet she glared in my direction when she said it. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m getting sick of getting left behind. I want to be good at what I set my mind to, and invest time in. There is a reason why my friend don&amp;#39;t want play me in soulcaliber anymore. I schooled them with astaroth. I practiced for weeks learning his ins and outs, yet I can&amp;#39;t seem to recapture that sense of accomplishment in anything I do anymore.&lt;/p&gt;\n\n&lt;p&gt;There are more examples like playing magic the gathering, or learning how to fight like Christopher Fiore.  I&amp;#39;m not going to get into that though because...its the same issue; Be good early on, falter the longer training goes.&lt;/p&gt;\n\n&lt;p&gt;There are times when the pieces feel like they fit, but it doesn&amp;#39;t last. Times were I can pick up a game, and for a round or two, come out of nowhere and blow the competition out of the water. Its a wonderful, yet fleeting moment, because it only lasts for a few moments. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Thanks for taking the time to hear me out. I'm noticing that, when I try and keep at something I don't improve, and I wind up stagnating. There are times, were I'm incredibly good at something, but only in the beginning. I almost want to coin the term \"reverse learning.\"\n\nThe biggest noticeable challenge I had, of hitting a brick wall was when I was learning to drive. My instructor and I would start off on a Monday really well, but as the week progressed, even for an hour at a time, I'd slip up and make mistakes, that I normally wouldn't make. \n\nPeople were quickly flying by the course; they'd be able have a few lessons, nail it down, and then got their license, yet I was stuck being called unteachable. \n\nI've had some issues with hobby games and video games too. I'd practice tabletop battles with friends, and read tactics on 1d4chan.org for an army comp, yet...no matter how much time and effort Id put in, I'd still lose. I've had people explain things to me and show me different strategic positions, yet I can't seem to grasp it with their help. \n\nThis is also effecting my areas of higher learning in college. I've needed specialized assistance in math, listened to what they were trying to explain and it's like I can't comprehend it. My music professors won't wait up for me either, and just last month I had the professor jab at me saying, \"there are some people that think they're singing when they're actually not\" she didn't refer to me, yet she glared in my direction when she said it. \n\nI'm getting sick of getting left behind. I want to be good at what I set my mind to, and invest time in. There is a reason why my friend don't want play me in soulcaliber anymore. I schooled them with astaroth. I practiced for weeks learning his ins and outs, yet I can't seem to recapture that sense of accomplishment in anything I do anymore.\n\nThere are more examples like playing magic the gathering, or learning how to fight like Christopher Fiore.  I'm not going to get into that though because...its the same issue; Be good early on, falter the longer training goes.\n\nThere are times when the pieces feel like they fit, but it doesn't last. Times were I can pick up a game, and for a round or two, come out of nowhere and blow the competition out of the water. Its a wonderful, yet fleeting moment, because it only lasts for a few moments. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "660zux", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "Vergil25", "saved": false, "mod_reports": [], "name": "t3_660zux", "subreddit_name_prefixed": "r/selfimprovement", "approved_by": null, "over_18": false, "domain": "self.selfimprovement", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmbm", "edited": 1492494165.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/selfimprovement/comments/660zux/practicing_with_no_improvement_need_to_fix_this/", "num_reports": null, "locked": false, "stickied": false, "created": 1492522509.0, "url": "https://www.reddit.com/r/selfimprovement/comments/660zux/practicing_with_no_improvement_need_to_fix_this/", "author_flair_text": null, "quarantine": false, "title": "Practicing with no improvement, need to fix this", "created_utc": 1492493709.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_660zux", "likes": null, "replies": "", "user_reports": [], "id": "dgetm6q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SolidEchos", "parent_id": "t3_660zux", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "There are a lot of ways to think about your situation. \n\n-One way is to learn different ways to manage your time. One technique I have used to do homework/study is pomodoro (25 minute studying with 5 minute breaks, this repeats four times then you can take a 30 minute break.) Obviously this depends on your situation and what you are trying to achieve. You also want to prioritize the important things in your life. For the driving, maybe make a mental list of certain steps that you need to do for that certain event. \n\n-Another way to look at it is realize your limitations. The feeling of being behind is a typical feeling in college since it's really competitive. I have felt behind before during certain classes I was taking, especially ones that contained friends or acquaintances since I knew how well they were doing. Only thing you can do is to focus on is yourself.  \nRealizing your limitations can also allow you know what works and doesn't. Don't let your slow progress discourage you since it's about the result. Also try to enjoy yourself because it seems like you are too concerned about being good at something, but never put enough time to actually know. It's about commitment and maybe some people will be more natural at it, but it's about the work you put into these activities. One example is sports: I have met some people who seemed like they have something going for them, but they didn't seize it and saw average individuals who worked really hard to make those small improvements. \n\n-Plateaus are a common occurrence and that usually is a sign that you need to change it up. When the situation needs to be thoroughly evaluated on why there hasn't been any improvements.\n\n-The reverse learning reminds me of burnout, but it could be that not enough hours are put in to maintain whatever it is that you are doing.\n\n-Acceptance might help you as well. Not going to be able to have those twinkle moments all the time and that's what all the practicing and studying is for. \n\n\nJust my 2 cents, hopefully it helps. \n\n*edited grammar mistakes.", "edited": 1492498753.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are a lot of ways to think about your situation. &lt;/p&gt;\n\n&lt;p&gt;-One way is to learn different ways to manage your time. One technique I have used to do homework/study is pomodoro (25 minute studying with 5 minute breaks, this repeats four times then you can take a 30 minute break.) Obviously this depends on your situation and what you are trying to achieve. You also want to prioritize the important things in your life. For the driving, maybe make a mental list of certain steps that you need to do for that certain event. &lt;/p&gt;\n\n&lt;p&gt;-Another way to look at it is realize your limitations. The feeling of being behind is a typical feeling in college since it&amp;#39;s really competitive. I have felt behind before during certain classes I was taking, especially ones that contained friends or acquaintances since I knew how well they were doing. Only thing you can do is to focus on is yourself.&lt;br/&gt;\nRealizing your limitations can also allow you know what works and doesn&amp;#39;t. Don&amp;#39;t let your slow progress discourage you since it&amp;#39;s about the result. Also try to enjoy yourself because it seems like you are too concerned about being good at something, but never put enough time to actually know. It&amp;#39;s about commitment and maybe some people will be more natural at it, but it&amp;#39;s about the work you put into these activities. One example is sports: I have met some people who seemed like they have something going for them, but they didn&amp;#39;t seize it and saw average individuals who worked really hard to make those small improvements. &lt;/p&gt;\n\n&lt;p&gt;-Plateaus are a common occurrence and that usually is a sign that you need to change it up. When the situation needs to be thoroughly evaluated on why there hasn&amp;#39;t been any improvements.&lt;/p&gt;\n\n&lt;p&gt;-The reverse learning reminds me of burnout, but it could be that not enough hours are put in to maintain whatever it is that you are doing.&lt;/p&gt;\n\n&lt;p&gt;-Acceptance might help you as well. Not going to be able to have those twinkle moments all the time and that&amp;#39;s what all the practicing and studying is for. &lt;/p&gt;\n\n&lt;p&gt;Just my 2 cents, hopefully it helps. &lt;/p&gt;\n\n&lt;p&gt;*edited grammar mistakes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgetm6q", "score_hidden": false, "stickied": false, "created": 1492527214.0, "created_utc": 1492498414.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmbm", "removal_reason": null, "link_id": "t3_660zux", "likes": null, "replies": "", "user_reports": [], "id": "dgewghc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ThinkingTiger", "parent_id": "t3_660zux", "subreddit_name_prefixed": "r/selfimprovement", "controversiality": 0, "body": "It's all about focus, will and discipline.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s all about focus, will and discipline.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "selfimprovement", "name": "t1_dgewghc", "score_hidden": false, "stickied": false, "created": 1492535849.0, "created_utc": 1492507049.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]