[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "MrRobot", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey y&amp;#39;all, I don&amp;#39;t post many theories here at all (please excuse my formatting and lack of photo evidence), but I&amp;#39;ve noticed something on a recent rewatch of S1E2.&lt;/p&gt;\n\n&lt;p&gt;At the end scene, when Elliot and Mr. Robot are talking on the railing, there are some very interesting details given. When Elliot is approaching the railing, he walks through the group of skaters, hanging on the bench and whatnot, and you&amp;#39;ll notice that one of the skaters on the right is holding up their phone and recording. We can assume this is the phone that shoots the video of Elliot falling of the railing by himself, which he later finds on the flash drive in Tyrell&amp;#39;s car. &lt;/p&gt;\n\n&lt;p&gt;What gets me is the last shot of the episode. The final shot is from the same angle that the &amp;quot;Boardwalk Fail&amp;quot; video was shot, but at this point, no one is there. No skateboarders, no pedestrians. Just Mr. Robot and the railing. When I saw that, I was entirely confused. This shot is only moments after Elliot falls off the railing. If there is no one there right after that moment, then who shot the video? We also know that in the next episode, Eliot was hurt pretty bad by the fall, including a hit to the head. I can&amp;#39;t remember if they bring that up specifically, but he definitely has bandages on his head when he wakes up. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re probably wondering &amp;quot;where is this dude going with this?&amp;quot;  Well, I&amp;#39;d like to theorize that the fall was an incredibly pivotal moment that we don&amp;#39;t fully understand yet. Esmail confirmed that there was still something from season 1 that isn&amp;#39;t real or is duping the audience, so to speak. I think the fall is that moment. Why was the area deserted immediately after Elliot fell? And what does that mean for the video that Elliot discovers later? &lt;/p&gt;\n\n&lt;p&gt;What I believe is that Elliot hit his head so hard on the fall, that he&amp;#39;s suffering a concussion or something that damaged his brain even more, catalyzing the surreal and meshing reality with fantasy. The video doesn&amp;#39;t actually exist. If we&amp;#39;re to believe the last shot of S1E2, no one was actually there to film Elliot&amp;#39;s tumble. The video could be another fabrication of Mr. Robot&amp;#39;s, exercising the control he has over Elliot. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m fully aware that I may be giving too much gravitas to seemingly inconsequential details, but this show has taught me that every detail has the potential to point to something bigger. I tagged all spoilers, in case this theory holds weight in other later episodes, but let me know what you think.&lt;/p&gt;\n\n&lt;p&gt;Cheers y&amp;#39;all!!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey y'all, I don't post many theories here at all (please excuse my formatting and lack of photo evidence), but I've noticed something on a recent rewatch of S1E2.\n\nAt the end scene, when Elliot and Mr. Robot are talking on the railing, there are some very interesting details given. When Elliot is approaching the railing, he walks through the group of skaters, hanging on the bench and whatnot, and you'll notice that one of the skaters on the right is holding up their phone and recording. We can assume this is the phone that shoots the video of Elliot falling of the railing by himself, which he later finds on the flash drive in Tyrell's car. \n\nWhat gets me is the last shot of the episode. The final shot is from the same angle that the \"Boardwalk Fail\" video was shot, but at this point, no one is there. No skateboarders, no pedestrians. Just Mr. Robot and the railing. When I saw that, I was entirely confused. This shot is only moments after Elliot falls off the railing. If there is no one there right after that moment, then who shot the video? We also know that in the next episode, Eliot was hurt pretty bad by the fall, including a hit to the head. I can't remember if they bring that up specifically, but he definitely has bandages on his head when he wakes up. \n\nYou're probably wondering \"where is this dude going with this?\"  Well, I'd like to theorize that the fall was an incredibly pivotal moment that we don't fully understand yet. Esmail confirmed that there was still something from season 1 that isn't real or is duping the audience, so to speak. I think the fall is that moment. Why was the area deserted immediately after Elliot fell? And what does that mean for the video that Elliot discovers later? \n\nWhat I believe is that Elliot hit his head so hard on the fall, that he's suffering a concussion or something that damaged his brain even more, catalyzing the surreal and meshing reality with fantasy. The video doesn't actually exist. If we're to believe the last shot of S1E2, no one was actually there to film Elliot's tumble. The video could be another fabrication of Mr. Robot's, exercising the control he has over Elliot. \n\n\nI'm fully aware that I may be giving too much gravitas to seemingly inconsequential details, but this show has taught me that every detail has the potential to point to something bigger. I tagged all spoilers, in case this theory holds weight in other later episodes, but let me know what you think.\n\nCheers y'all!!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65wk1w", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 29, "report_reasons": null, "author": "secret101", "saved": false, "mod_reports": [], "name": "t3_65wk1w", "subreddit_name_prefixed": "r/MrRobot", "approved_by": null, "over_18": false, "domain": "self.MrRobot", "hidden": false, "thumbnail": "", "subreddit_id": "t5_37dnc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": true, "permalink": "/r/MrRobot/comments/65wk1w/spoilers_s2e12_noticed_something_about_the_fall/", "num_reports": null, "locked": false, "stickied": false, "created": 1492474918.0, "url": "https://www.reddit.com/r/MrRobot/comments/65wk1w/spoilers_s2e12_noticed_something_about_the_fall/", "author_flair_text": null, "quarantine": false, "title": "[Spoilers S2E12] Noticed something about the fall", "created_utc": 1492446118.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 29}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_37dnc", "removal_reason": null, "link_id": "t3_65wk1w", "likes": null, "replies": "", "user_reports": [], "id": "dgdp7pm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_65wk1w", "subreddit_name_prefixed": "r/MrRobot", "controversiality": 0, "body": "**Attention! [Spoilers S2E12] Tag Notice**\n\n- Discussion on anything up to (and including) **S2E12** of Mr. Robot is fair-game.\n\n- Anything after **S2E12** must include spoiler tags. To use spoiler tags in comments, use this format - \\[Spoiler](#s \"Mr. Robot\") which becomes [Spoiler](#s \"Mr. Robot\").\n\n- Report comments that violate these rules.\n\n Thanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MrRobot) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Attention! [Spoilers S2E12] Tag Notice&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Discussion on anything up to (and including) &lt;strong&gt;S2E12&lt;/strong&gt; of Mr. Robot is fair-game.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Anything after &lt;strong&gt;S2E12&lt;/strong&gt; must include spoiler tags. To use spoiler tags in comments, use this format - [Spoiler](#s &amp;quot;Mr. Robot&amp;quot;) which becomes &lt;a href=\"#s\" title=\"Mr. Robot\"&gt;Spoiler&lt;/a&gt;.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Report comments that violate these rules.&lt;/p&gt;\n\n&lt;p&gt;Thanks for your cooperation and enjoy the discussion!&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/MrRobot\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "MrRobot", "name": "t1_dgdp7pm", "score_hidden": true, "stickied": true, "created": 1492474919.0, "created_utc": 1492446119.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_37dnc", "removal_reason": null, "link_id": "t3_65wk1w", "likes": null, "replies": "", "user_reports": [], "id": "dgdrdw0", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "bwandering", "parent_id": "t3_65wk1w", "subreddit_name_prefixed": "r/MrRobot", "controversiality": 0, "body": "There's pretty clearly two versions of that event, but neither of them are from Elliot's field of vision.\n\nHere's the first time we see [Elliot fall from the boardwalk](http://imgur.com/a/VxL0Z)\n\nHere's the [second time](http://imgur.com/a/MLfv5) from the video Elliot finds via the thumb drive.\n\nIn the on-line version the kids are actively skateboarding. In the first version they're just sitting around. Also, Mr. Robot is in the first version and not in the second.\n\nI don't think the differences have to do with Elliot's head trauma. I think they're related to the fact that everything we see is from Elliot's perspective, even when it seems like it's not. Elliot was never in a position to see himself on that boardwalk with Mr. Robot, and yet WE saw it from that perspective. That is how Elliot remembered it happening. And because Elliot remembered it that way, it is how we saw it too. \n\nThe big question this raises is whether every scene is shown from his perspective, including those where he's nowhere around.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s pretty clearly two versions of that event, but neither of them are from Elliot&amp;#39;s field of vision.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s the first time we see &lt;a href=\"http://imgur.com/a/VxL0Z\"&gt;Elliot fall from the boardwalk&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s the &lt;a href=\"http://imgur.com/a/MLfv5\"&gt;second time&lt;/a&gt; from the video Elliot finds via the thumb drive.&lt;/p&gt;\n\n&lt;p&gt;In the on-line version the kids are actively skateboarding. In the first version they&amp;#39;re just sitting around. Also, Mr. Robot is in the first version and not in the second.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think the differences have to do with Elliot&amp;#39;s head trauma. I think they&amp;#39;re related to the fact that everything we see is from Elliot&amp;#39;s perspective, even when it seems like it&amp;#39;s not. Elliot was never in a position to see himself on that boardwalk with Mr. Robot, and yet WE saw it from that perspective. That is how Elliot remembered it happening. And because Elliot remembered it that way, it is how we saw it too. &lt;/p&gt;\n\n&lt;p&gt;The big question this raises is whether every scene is shown from his perspective, including those where he&amp;#39;s nowhere around.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "MrRobot", "name": "t1_dgdrdw0", "score_hidden": false, "stickied": false, "created": 1492477327.0, "created_utc": 1492448527.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_37dnc", "removal_reason": null, "link_id": "t3_65wk1w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_37dnc", "removal_reason": null, "link_id": "t3_65wk1w", "likes": null, "replies": "", "user_reports": [], "id": "dge640q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "secret101", "parent_id": "t1_dgdueej", "subreddit_name_prefixed": "r/MrRobot", "controversiality": 0, "body": "You're so goddamn right about the benches. My mistake", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re so goddamn right about the benches. My mistake&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "MrRobot", "name": "t1_dge640q", "score_hidden": false, "stickied": false, "created": 1492493984.0, "created_utc": 1492465184.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdueej", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "mcgunn48", "parent_id": "t3_65wk1w", "subreddit_name_prefixed": "r/MrRobot", "controversiality": 0, "body": "Keep in mind that there is a row of benches in the foreground, that is occupied by the skaters, and another row between them and the railing. There isn't anyone hanging around there at any time, so when we see the shot of the empty benches, it makes sense. However, I do agree there are discrepancies with what the skaters are doing when we first see the event and when we see the uploaded video. It does seem weird that they are lined up and just standing around at one point but it could be nothing. Was Mr. Sutherland following him? Was that the Bitcoin van parked on the street in the background?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Keep in mind that there is a row of benches in the foreground, that is occupied by the skaters, and another row between them and the railing. There isn&amp;#39;t anyone hanging around there at any time, so when we see the shot of the empty benches, it makes sense. However, I do agree there are discrepancies with what the skaters are doing when we first see the event and when we see the uploaded video. It does seem weird that they are lined up and just standing around at one point but it could be nothing. Was Mr. Sutherland following him? Was that the Bitcoin van parked on the street in the background?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "MrRobot", "name": "t1_dgdueej", "score_hidden": false, "stickied": false, "created": 1492480661.0, "created_utc": 1492451861.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_37dnc", "removal_reason": null, "link_id": "t3_65wk1w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_37dnc", "removal_reason": null, "link_id": "t3_65wk1w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_37dnc", "removal_reason": null, "link_id": "t3_65wk1w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_37dnc", "removal_reason": null, "link_id": "t3_65wk1w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_37dnc", "removal_reason": null, "link_id": "t3_65wk1w", "likes": null, "replies": "", "user_reports": [], "id": "dge87y6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ypsifactj48", "parent_id": "t1_dge8457", "subreddit_name_prefixed": "r/MrRobot", "controversiality": 0, "body": "Mind awake...Body asleep...Enjoy!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mind awake...Body asleep...Enjoy!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "MrRobot", "name": "t1_dge87y6", "score_hidden": false, "stickied": false, "created": 1492496628.0, "created_utc": 1492467828.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dge8457", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "secret101", "parent_id": "t1_dge71ci", "subreddit_name_prefixed": "r/MrRobot", "controversiality": 0, "body": "Oh, I totally believe lucid dreaming is real and have tried many times before (I've only ever failed, though), it's just whether or not I believe it's an encompassing thing for the entire series. I'll look out for it, though, in my current rewatch!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, I totally believe lucid dreaming is real and have tried many times before (I&amp;#39;ve only ever failed, though), it&amp;#39;s just whether or not I believe it&amp;#39;s an encompassing thing for the entire series. I&amp;#39;ll look out for it, though, in my current rewatch!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "MrRobot", "name": "t1_dge8457", "score_hidden": false, "stickied": false, "created": 1492496493.0, "created_utc": 1492467693.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dge71ci", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ypsifactj48", "parent_id": "t1_dge62hg", "subreddit_name_prefixed": "r/MrRobot", "controversiality": 0, "body": "One person is reliving the events of a previous encounter where other people were present. BTW, zero tinfoil required, Scientific American had done multiple pieces on Lucid Dreaming (it is real) and both the show and Red Wheelbarrow have talked about it explicitly (Elliot learned it from \"his friend\" Sam. I did ask Sam about it when I interviewed him...But he did not answer. I suspect that he is a practitioner.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One person is reliving the events of a previous encounter where other people were present. BTW, zero tinfoil required, Scientific American had done multiple pieces on Lucid Dreaming (it is real) and both the show and Red Wheelbarrow have talked about it explicitly (Elliot learned it from &amp;quot;his friend&amp;quot; Sam. I did ask Sam about it when I interviewed him...But he did not answer. I suspect that he is a practitioner.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "MrRobot", "name": "t1_dge71ci", "score_hidden": false, "stickied": false, "created": 1492495140.0, "created_utc": 1492466340.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge62hg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "secret101", "parent_id": "t1_dge53eu", "subreddit_name_prefixed": "r/MrRobot", "controversiality": 0, "body": "I get what you're saying. I added that last little paragraph at the end because i realize it could just be continuity issues with editing, and what show doesn't have those? \n\nYour theory intrigues me more than the \"Mr. Robot is a computer simulation\" theory because I feel like less tinfoil is required to wrap your head around it. I like how you implicate Angela and Whiterose as a part of it. The one thing I have to ask is what's going on when more than one of them is together? Is it a shared dream space of one person's dream?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get what you&amp;#39;re saying. I added that last little paragraph at the end because i realize it could just be continuity issues with editing, and what show doesn&amp;#39;t have those? &lt;/p&gt;\n\n&lt;p&gt;Your theory intrigues me more than the &amp;quot;Mr. Robot is a computer simulation&amp;quot; theory because I feel like less tinfoil is required to wrap your head around it. I like how you implicate Angela and Whiterose as a part of it. The one thing I have to ask is what&amp;#39;s going on when more than one of them is together? Is it a shared dream space of one person&amp;#39;s dream?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "MrRobot", "name": "t1_dge62hg", "score_hidden": false, "stickied": false, "created": 1492493932.0, "created_utc": 1492465132.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dge53eu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ypsifactj48", "parent_id": "t3_65wk1w", "subreddit_name_prefixed": "r/MrRobot", "controversiality": 0, "body": "Interesting theory. I think, however, you could literally take 100 different incongruent moments from either season of the show and make them the \"key\" moment. \n\nPart of the fabric of the show is that the accuracy of Elliot's perception is always in play. \n\nIn particular, Elliot's perception of \"the Fall\" is tied to a particular childhood event (being pushed out of his window by his Father). It is very likely that the way we would experience his perception of this new fall (which did not likely happen, at least not in the way we are seeing it).\n\nI personally believe that what we often see from Elliot and Angela (and theoretically from Whiterose) is them revisiting experiences while Lucidly Dreaming. This perspective explains the omnipresent surrealism (dream logic) and many of the incongruities throughout the show.\n\nIn other words, what we are seeing often comes from the perspective of people re-living experiences through dreams. This also explains the ouroboros references (see August Kekule's work on Lucid Dreaming in regards to Benzene Rings).\n\nNot meaning, at all, to be critical. Much of the fun of Mr. Robot (to me) is in the theorizing around the shows many corners.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting theory. I think, however, you could literally take 100 different incongruent moments from either season of the show and make them the &amp;quot;key&amp;quot; moment. &lt;/p&gt;\n\n&lt;p&gt;Part of the fabric of the show is that the accuracy of Elliot&amp;#39;s perception is always in play. &lt;/p&gt;\n\n&lt;p&gt;In particular, Elliot&amp;#39;s perception of &amp;quot;the Fall&amp;quot; is tied to a particular childhood event (being pushed out of his window by his Father). It is very likely that the way we would experience his perception of this new fall (which did not likely happen, at least not in the way we are seeing it).&lt;/p&gt;\n\n&lt;p&gt;I personally believe that what we often see from Elliot and Angela (and theoretically from Whiterose) is them revisiting experiences while Lucidly Dreaming. This perspective explains the omnipresent surrealism (dream logic) and many of the incongruities throughout the show.&lt;/p&gt;\n\n&lt;p&gt;In other words, what we are seeing often comes from the perspective of people re-living experiences through dreams. This also explains the ouroboros references (see August Kekule&amp;#39;s work on Lucid Dreaming in regards to Benzene Rings).&lt;/p&gt;\n\n&lt;p&gt;Not meaning, at all, to be critical. Much of the fun of Mr. Robot (to me) is in the theorizing around the shows many corners.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "MrRobot", "name": "t1_dge53eu", "score_hidden": false, "stickied": false, "created": 1492492748.0, "created_utc": 1492463948.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_37dnc", "removal_reason": null, "link_id": "t3_65wk1w", "likes": null, "replies": "", "user_reports": [], "id": "dgeg5tq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "face_the_strange", "parent_id": "t3_65wk1w", "subreddit_name_prefixed": "r/MrRobot", "controversiality": 0, "body": "I believe even more clues hide within the opening scenes of the following episode (S01E03).\n\nThe episode opens with the very strange scene of Tyrell viciously assaulting the homeless man underneath the train line. Then immediately cuts to Elliot's, scratched and beaten face lying in the hospital bed.\n\nThis all follows immediately after the scenes of him falling from the boardwalk at the end up the previous episode. I have no solid theories to add, however I believe we are being misled in some way due to the order the scenes and the way they were cut together.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe even more clues hide within the opening scenes of the following episode (S01E03).&lt;/p&gt;\n\n&lt;p&gt;The episode opens with the very strange scene of Tyrell viciously assaulting the homeless man underneath the train line. Then immediately cuts to Elliot&amp;#39;s, scratched and beaten face lying in the hospital bed.&lt;/p&gt;\n\n&lt;p&gt;This all follows immediately after the scenes of him falling from the boardwalk at the end up the previous episode. I have no solid theories to add, however I believe we are being misled in some way due to the order the scenes and the way they were cut together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "MrRobot", "name": "t1_dgeg5tq", "score_hidden": false, "stickied": false, "created": 1492506780.0, "created_utc": 1492477980.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]