[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "3DS", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Where are all the WiiU announcements?&lt;/p&gt;\n\n&lt;p&gt;Link to presentation: &lt;a href=\"https://m.youtube.com/watch?v=6X06fvObnG0\"&gt;https://m.youtube.com/watch?v=6X06fvObnG0&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;With E3 coming around the corner in only a couple months and Nintendo stating how it would return to having a proper presentation unlike last year, it’s not wrong to believe how all future announcements for the Switch and 3DS would be made there. Or, apparently, it is considering how a Nintendo Direct was broadcasted on April 12th. Even though this was surprising, expecting it to contain news about anything other than the main target games of Splatoon 2 and Arms was preposterous, or that would have been so if I wasn’t mistaken yet again. To my great delight, this Nintendo Direct was, in actuality, rife with updates on existing games and announcements for new games on both Nintendo Switch and 3DS.&lt;/p&gt;\n\n&lt;p&gt;Nintendo 3DS&lt;/p&gt;\n\n&lt;p&gt;Hey! Pikmin&lt;/p&gt;\n\n&lt;p&gt;Initially revealed in the 3DS Direct a couple months ago, Hey! Pikmin not only returns to us with a generic title but with little promise yet again. Since I’ve never played a Pikmin game, I’m not one of the people generating hype behind this game simply because it is the first handheld entry in the franchise. With that point of view, I perceive this 2-D sidescrolling platformer puzzler as a poor looking attempt to bring a well-known series mainly seen on consoles to a portable with its only factor piquing my interest being its mildly promising controls and puzzles.&lt;/p&gt;\n\n&lt;p&gt;Hey! Pikmin along with its new Amiibo releases July 28th&lt;/p&gt;\n\n&lt;p&gt;Ever Oasis&lt;/p&gt;\n\n&lt;p&gt;Now here’s an already announced 3DS game that actually contains loads of promise and potential. We already know how (from what little footage was shown of the game at previous presentations featuring it) Ever Oasis has slight similarities to The Legend of Zelda: Ocarina of Time and Majora’s Mask in terms of combat. Additionally, it is also known how the game includes dungeons with AI companions which can be taken control of in order to solve puzzles. Since there is a lot of details open to the public about Ever Oasis such as these factors, it’s not surprising how this Nintendo Direct merely explained some light plot elements that won’t seem to add much but will be a nice addition none-the-less.&lt;/p&gt;\n\n&lt;p&gt;Ever Oasis releases June 23rd&lt;/p&gt;\n\n&lt;p&gt;Monster Hunter Stories&lt;/p&gt;\n\n&lt;p&gt;Monster Hunter, while revolving around slaying countless overwhelmingly powerful monsters with a moderate amount of blood being spilled along the way, is an overall lighthearted series. Though, because of the aforementioned blood, the franchise is not really appropriate for all demographics. Enter Monster Hunter Stories, a turn-based entry in the Monster Hunter series that places you in the role of a tamer of beasts rather than a hunter of them with some damn fine cel-shaded visuals to boot, making it a more kid-friendly experience. This change of gameplay and tone along with the ability to befriend most monsters from the main series makes waiting to play Monster Hunter Stories harder than ever before.&lt;/p&gt;\n\n&lt;p&gt;Monster Hunter Stories releases fall.&lt;/p&gt;\n\n&lt;p&gt;Yokai Watch 2: Psychic Spectres&lt;/p&gt;\n\n&lt;p&gt;The original Yo-Kai Watch attempted to take aspects from the popular formula of Pokémon and revitalize it by adding elements of its own. While it succeeded in offering helpings of originality here and there, it failed to be a direct competitor to Pokémon as it hoped to be and instead was a respectable average game that was not special, but still enjoyable. Yokai Watch 2, although only having a minute amount of footage shown, seems to have more creative missions, Yo-kai, and a new online mode similar to the likes of games such as Pokémon Rumble Blast. Not the most promising of announcements, but holds some potential with its new inclusions and general quirky nature.&lt;/p&gt;\n\n&lt;p&gt;Yokai Watch 2: Psychic Spectres releases fall.&lt;/p&gt;\n\n&lt;p&gt;Culdcept Revolt&lt;/p&gt;\n\n&lt;p&gt;Having an exclusive Nintendo Direct broadcasted only in Japan, it’s safe to say that Culdcept Revolt is one of the more obscure games. For those who (most likely) don’t know what the heck the game I just mentioned is, Culdcept Revolt is, based off of what was shown in this direct, a title which consists of a card-based battle system where players can build decks to take both locally and online to compete against other players. Culdcept Revolt doesn’t seem interesting or even remotely enjoyable, leaving it to be something that I’ll just come to forget rather quickly.&lt;/p&gt;\n\n&lt;p&gt;Culdcept Revolt releases August 29th&lt;/p&gt;\n\n&lt;p&gt;RPG Maker Fes&lt;/p&gt;\n\n&lt;p&gt;The 3DS is, with a few exceptions, not known for being a platform for games which allow you to share user created levels online. With that being said, RPG Maker Fes is mainly exciting because of its ability to do just that. Furthermore, RPG Maker Fes will also contain skins for Disgaea entries and other RPG games…nothing random about that aspect at all. Not much else is known about this title, but that doesn’t change how promising it \nlooks.&lt;/p&gt;\n\n&lt;p&gt;RPG Maker Fes releases June 27&lt;/p&gt;\n\n&lt;p&gt;Miitopia&lt;/p&gt;\n\n&lt;p&gt;With Tomodachi Life, we received one of the only Mii-centered titles to grace the 3DS. Even though it was considered pretty average by consumers and critics alike, Tomodachi Life sold fairly well. This game’s success is assumedly why Nintendo decided to localize Miitopia to the West. Starring the Miis, Miitopia allows you to place any of these eccentric avatars in roles ranging from a wizard, to a warrior, to even a pop star in order to save the land after most of society’s faces have been stolen (a fantastically light-hearted narrative which makes this game seem even better). Also, the game holds another interesting factor through the fact that battles aren’t based on player input, but through the relationships your Miis craft with one another. Similar to Culdcept Revolt, Miitopia is a bit niche, but unlike Culdcept, it seems a lot more interesting and makes me want to see more of it in the future.&lt;/p&gt;\n\n&lt;p&gt;Miitopia releases 2017&lt;/p&gt;\n\n&lt;p&gt;Fire Emblem Echoes: Shadows of Valentia&lt;/p&gt;\n\n&lt;p&gt;I’d rather not dedicate an entire section to this since I’ve already spoken about it in depth before, but information was given about it, so I sadly have to. Nintendo, the all-knowing god it is, believed that people wanted to have an update on news about the upcoming Fire Emblem that let people know how the game would have free and paid DLC which will be payable alone, in packs, or through a season pass. Certainly not a waste of time.&lt;/p&gt;\n\n&lt;p&gt;Fire Emblem Echoes: Shadows of Valentia releases May 19&lt;/p&gt;\n\n&lt;p&gt;HAL Laboratory&lt;/p&gt;\n\n&lt;p&gt;HAL Laboratory had a lot of attention shifted toward them in this direct thanks to them having four games being covered. These games were: Team Kirby Clash Deluxe, Kirby’s Blowout Blast, Bye-Bye-Boxboy, and an untitled game. Kirby Clash Deluxe and Blowout Blast are both great mini games which were featured in Kirby: Planet Robobot that are getting a full Eshop release like Kirby Fighters Deluxe did. As for the untitled game, that was said to be an upcoming co-op action game set in the Kirby universe. Finally, the last game developed by HAL Lab to have information divulged to us was the intriguing final entry in the Boxboy series, Bye-Bye-Boxboy boasting new mechanics and puzzles along with Kirby Amiibo support with the functions of giving Quby Kirby-themed outfits. Certainly a bright future for fans of games of HAL Laboratory.&lt;/p&gt;\n\n&lt;p&gt;Team Kirby Clash Deluxe released the day this direct was broadcasted&lt;/p&gt;\n\n&lt;p&gt;Kirby’s Blowout Blast releases this Summer&lt;/p&gt;\n\n&lt;p&gt;Bye-Bye-Boxboy released the day this direct was broadcasted&lt;/p&gt;\n\n&lt;p&gt;Nintendo Switch&lt;/p&gt;\n\n&lt;p&gt;Arms&lt;/p&gt;\n\n&lt;p&gt;Ever since the Nintendo Switch presentation, little has been divulged to us about Nintendo’s new IP, Arms. However, this Nintendo Direct, being centered around the game as previously mentioned, drastically changed that fact. For starters, it was stated how every character could equip interchangeable arms which each have unique abilities. To purchase these, players will have to earn in-game currency by partaking in fights as well as minigames. In addition to this, not only was each character explained to have a special ability and a mode where teams of two fight against each other, but a new character by the name of Minmin, AKA the Ramen Bomber, was revealed. All of this information adds a new layer of depth to Arms and makes this once unknown IP shrouded in mystery one of the most anticipated releases of the year.&lt;/p&gt;\n\n&lt;p&gt;Arms, along with a yellow Joy-Con and extension that makes the battery life of Joy-Con last longer, releases June 16th.&lt;/p&gt;\n\n&lt;p&gt;Splatoon 2&lt;/p&gt;\n\n&lt;p&gt;Although only coming into fruition during the lifespan of the WiiU, Splatoon has become popular in a fairly short amount of time. So, when a sequel to the great first entry was announced, it was only natural for the hype to generate. This hype only grew with Nintendo hosting a Splatoon 2 beta a couple weeks ago giving us a slight taste of its gameplay. Though, this beta and information given to us about the game prior to the existence of this direct only consisted of showing off new maps, weapons, and letting players know that the main mode of turf war would be included into it. Despite this, this direct confirmed that Splatoon 2 is going to have a co-op mode alongside its competitive ones. This co-op mode. Salmon Run, places four players into a horde mode against salmon like enemies with different variants. Also, Splatoon 2 was confirmed to have a campaign like its predecessor did and have three Amiibo (Inkling Boy, Girl, and Squid) where players can inherit the costumes the Amiibo are wearing. I was already planning on buying Splatoon 2, but the announcement of Salmon Run ensured that that would happen for sure.&lt;/p&gt;\n\n&lt;p&gt;Splatoon 2 and its Amiibo release July 21st.&lt;/p&gt;\n\n&lt;p&gt;Ultimate Street Fighter 2: The Final Challengers&lt;/p&gt;\n\n&lt;p&gt;Street Fighter II is a good game. And, it getting a remaster isn’t outrageous considering how many are released every year. But, does it really need NINE REMASTERS!? With the exception of the utilization of the touch screen to make special moves accessible at the press of a button and the addition of online play, there is little here to justify yet another remaster. The updated visuals don’t look as polished as they could be, the co-op battles (where two players share a health bar whilst fighting one opponent) are an interesting use of the Joy-Con, but are only a small inclusion. Furthermore, the game attempts to justify its existence by adding a motion control mode where players can Hadouken Shadaloo minions. Literally, there is close to nothing here to make this a worthy addition to the Nintendo Switch library.&lt;/p&gt;\n\n&lt;p&gt;Ultimate Street Fighter 2: The Final Challengers releases May 26th.&lt;/p&gt;\n\n&lt;p&gt;Nintendo Switch Games With Little Information &amp;amp; Miscellaneous Announcements&lt;/p&gt;\n\n&lt;p&gt;Since some games announced had little information revealed about them, it’s not possible to dedicate an entire section them. So, I’ve decided to compile them into one section and give brief descriptions of all these remaining Switch games which lack details.&lt;/p&gt;\n\n&lt;p&gt;Minecraft: Switch Edition: The same Minecraft we all know and love with local and online multiplayer, but this version also includes the Mario skins and maps from the WiiU version. &lt;/p&gt;\n\n&lt;p&gt;Minecraft: Switch Edition releases May 11th&lt;/p&gt;\n\n&lt;p&gt;Mario Kart 8 Deluxe: An announcement that just reaffirms its new tracks, refined battle mode, new characters, and local/online functionalities&lt;/p&gt;\n\n&lt;p&gt;Mario Kart 8 Deluxe releases April 28th&lt;/p&gt;\n\n&lt;p&gt;Sonic: Announcements that just regurgitate information we already knew about Sonic Forces and Sonic Mania&lt;/p&gt;\n\n&lt;p&gt;Sonic Forces releases holiday 2017&lt;/p&gt;\n\n&lt;p&gt;Sonic Mania releases summer&lt;/p&gt;\n\n&lt;p&gt;Project Mekuru: An interesting new title where players have to jump on tiles to change their color and need to make sure that their color maintains dominance over all tiles&lt;/p&gt;\n\n&lt;p&gt;Project Mekuru releases summer&lt;/p&gt;\n\n&lt;p&gt;Fate/Extella: The Umbral Star: Some random anime-styled game with gameplay akin to the likes of the Dynasty Warriors franchise&lt;/p&gt;\n\n&lt;p&gt;Fate/Extella: The Umbral Star releases July 25th&lt;/p&gt;\n\n&lt;p&gt;Disgaea 5: The complete edition of the turn-based game with both its base content and DLC included&lt;/p&gt;\n\n&lt;p&gt;Disgaea 5 releases May 23rd&lt;/p&gt;\n\n&lt;p&gt;Puyo Puyo Tetris: A form of Tetris with its original gameplay that also has a new Puyo mode where players have to, instead of making a line with any block, line up Puyo of the same color to gain points.&lt;/p&gt;\n\n&lt;p&gt;Puyo Puyo Tetris releases April 25th while its demo released the day this direct was broadcasted&lt;/p&gt;\n\n&lt;p&gt;Monopoly: No joke, they made Monopoly for the Switch. What has the world come to?&lt;/p&gt;\n\n&lt;p&gt;Monopoly releases fall&lt;/p&gt;\n\n&lt;p&gt;Rayman Legends: Definitive Edition: Contains the standard cartoonish action platformer goodness alongside two new modes with one being a multiplayer mode where players slap soccer balls into goals&lt;/p&gt;\n\n&lt;p&gt;Rayman Legends: Definitive Edition releases 2017&lt;/p&gt;\n\n&lt;p&gt;Sine Mora EX: A beautiful side-scrolling shoot em’ up with time mechanics being boasted as its distinguishing aspects&lt;/p&gt;\n\n&lt;p&gt;Sine Mora EX releases summer&lt;/p&gt;\n\n&lt;p&gt;Battle Chasers: Nightwar: Mildly stylized graphics mixed with generally good looking models and scenery are the only details shown to us about this turn-based RPG.&lt;/p&gt;\n\n&lt;p&gt;Battle Chasers: Nightwar releases summer&lt;/p&gt;\n\n&lt;p&gt;Payday 2: Perhaps the most surprising and exciting reveal of this direct, this co-op game where you rob banks hopefully is a representative for a good future of third party support for the Switch&lt;/p&gt;\n\n&lt;p&gt;Payday 2 releases 2017&lt;/p&gt;\n\n&lt;p&gt;Namco Museum: Collection of classic games such as Pacman and Dig-Dug with an all new challenge mode&lt;/p&gt;\n\n&lt;p&gt;Namco Museum releases summer &lt;/p&gt;\n\n&lt;p&gt;Individual Nintendo Switch docks will begin to be sold on May 19th&lt;/p&gt;\n\n&lt;p&gt;New Link Amiibo release June 23rd&lt;/p&gt;\n\n&lt;p&gt;Cloud, Corrin, and Bayonetta Amiibo with costume variations release July 21st&lt;/p&gt;\n\n&lt;p&gt;The Nintendo Switch and 3DS both have a promising future ahead of them if these are the kind of promising titles that will continue to release on them. 3DS owners are seemingly guaranteed to continue receiving a healthy mix of both first and third party games which each hold great promise. Switch owners, on the other hand, will (hopefully) get more games such as Payday 2 and Fate/Extella alongside first-party games that will open this console rife with potential to new audiences and lead to it getting more diverse and enjoyable experiences/surprises such as the ones we saw in this direct. Funny, all this happened before E3 2017 even began delving out details about itself. I wonder what surprises E3 has in store for us if this was just a Nintendo Direct.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Where are all the WiiU announcements?\n\nLink to presentation: https://m.youtube.com/watch?v=6X06fvObnG0\n\nWith E3 coming around the corner in only a couple months and Nintendo stating how it would return to having a proper presentation unlike last year, it’s not wrong to believe how all future announcements for the Switch and 3DS would be made there. Or, apparently, it is considering how a Nintendo Direct was broadcasted on April 12th. Even though this was surprising, expecting it to contain news about anything other than the main target games of Splatoon 2 and Arms was preposterous, or that would have been so if I wasn’t mistaken yet again. To my great delight, this Nintendo Direct was, in actuality, rife with updates on existing games and announcements for new games on both Nintendo Switch and 3DS.\n\nNintendo 3DS\n\nHey! Pikmin\n\nInitially revealed in the 3DS Direct a couple months ago, Hey! Pikmin not only returns to us with a generic title but with little promise yet again. Since I’ve never played a Pikmin game, I’m not one of the people generating hype behind this game simply because it is the first handheld entry in the franchise. With that point of view, I perceive this 2-D sidescrolling platformer puzzler as a poor looking attempt to bring a well-known series mainly seen on consoles to a portable with its only factor piquing my interest being its mildly promising controls and puzzles.\n\nHey! Pikmin along with its new Amiibo releases July 28th\n\nEver Oasis\n\nNow here’s an already announced 3DS game that actually contains loads of promise and potential. We already know how (from what little footage was shown of the game at previous presentations featuring it) Ever Oasis has slight similarities to The Legend of Zelda: Ocarina of Time and Majora’s Mask in terms of combat. Additionally, it is also known how the game includes dungeons with AI companions which can be taken control of in order to solve puzzles. Since there is a lot of details open to the public about Ever Oasis such as these factors, it’s not surprising how this Nintendo Direct merely explained some light plot elements that won’t seem to add much but will be a nice addition none-the-less.\n\nEver Oasis releases June 23rd\n\nMonster Hunter Stories\n\nMonster Hunter, while revolving around slaying countless overwhelmingly powerful monsters with a moderate amount of blood being spilled along the way, is an overall lighthearted series. Though, because of the aforementioned blood, the franchise is not really appropriate for all demographics. Enter Monster Hunter Stories, a turn-based entry in the Monster Hunter series that places you in the role of a tamer of beasts rather than a hunter of them with some damn fine cel-shaded visuals to boot, making it a more kid-friendly experience. This change of gameplay and tone along with the ability to befriend most monsters from the main series makes waiting to play Monster Hunter Stories harder than ever before.\n\nMonster Hunter Stories releases fall.\n\nYokai Watch 2: Psychic Spectres\n\nThe original Yo-Kai Watch attempted to take aspects from the popular formula of Pokémon and revitalize it by adding elements of its own. While it succeeded in offering helpings of originality here and there, it failed to be a direct competitor to Pokémon as it hoped to be and instead was a respectable average game that was not special, but still enjoyable. Yokai Watch 2, although only having a minute amount of footage shown, seems to have more creative missions, Yo-kai, and a new online mode similar to the likes of games such as Pokémon Rumble Blast. Not the most promising of announcements, but holds some potential with its new inclusions and general quirky nature.\n\nYokai Watch 2: Psychic Spectres releases fall.\n\nCuldcept Revolt\n\nHaving an exclusive Nintendo Direct broadcasted only in Japan, it’s safe to say that Culdcept Revolt is one of the more obscure games. For those who (most likely) don’t know what the heck the game I just mentioned is, Culdcept Revolt is, based off of what was shown in this direct, a title which consists of a card-based battle system where players can build decks to take both locally and online to compete against other players. Culdcept Revolt doesn’t seem interesting or even remotely enjoyable, leaving it to be something that I’ll just come to forget rather quickly.\n\nCuldcept Revolt releases August 29th\n\nRPG Maker Fes\n\nThe 3DS is, with a few exceptions, not known for being a platform for games which allow you to share user created levels online. With that being said, RPG Maker Fes is mainly exciting because of its ability to do just that. Furthermore, RPG Maker Fes will also contain skins for Disgaea entries and other RPG games…nothing random about that aspect at all. Not much else is known about this title, but that doesn’t change how promising it \nlooks.\n\nRPG Maker Fes releases June 27\n\nMiitopia\n\nWith Tomodachi Life, we received one of the only Mii-centered titles to grace the 3DS. Even though it was considered pretty average by consumers and critics alike, Tomodachi Life sold fairly well. This game’s success is assumedly why Nintendo decided to localize Miitopia to the West. Starring the Miis, Miitopia allows you to place any of these eccentric avatars in roles ranging from a wizard, to a warrior, to even a pop star in order to save the land after most of society’s faces have been stolen (a fantastically light-hearted narrative which makes this game seem even better). Also, the game holds another interesting factor through the fact that battles aren’t based on player input, but through the relationships your Miis craft with one another. Similar to Culdcept Revolt, Miitopia is a bit niche, but unlike Culdcept, it seems a lot more interesting and makes me want to see more of it in the future.\n\nMiitopia releases 2017\n\nFire Emblem Echoes: Shadows of Valentia\n\nI’d rather not dedicate an entire section to this since I’ve already spoken about it in depth before, but information was given about it, so I sadly have to. Nintendo, the all-knowing god it is, believed that people wanted to have an update on news about the upcoming Fire Emblem that let people know how the game would have free and paid DLC which will be payable alone, in packs, or through a season pass. Certainly not a waste of time.\n\nFire Emblem Echoes: Shadows of Valentia releases May 19\n\nHAL Laboratory\n\nHAL Laboratory had a lot of attention shifted toward them in this direct thanks to them having four games being covered. These games were: Team Kirby Clash Deluxe, Kirby’s Blowout Blast, Bye-Bye-Boxboy, and an untitled game. Kirby Clash Deluxe and Blowout Blast are both great mini games which were featured in Kirby: Planet Robobot that are getting a full Eshop release like Kirby Fighters Deluxe did. As for the untitled game, that was said to be an upcoming co-op action game set in the Kirby universe. Finally, the last game developed by HAL Lab to have information divulged to us was the intriguing final entry in the Boxboy series, Bye-Bye-Boxboy boasting new mechanics and puzzles along with Kirby Amiibo support with the functions of giving Quby Kirby-themed outfits. Certainly a bright future for fans of games of HAL Laboratory.\n\nTeam Kirby Clash Deluxe released the day this direct was broadcasted\n\nKirby’s Blowout Blast releases this Summer\n\nBye-Bye-Boxboy released the day this direct was broadcasted\n\nNintendo Switch\n\nArms\n\nEver since the Nintendo Switch presentation, little has been divulged to us about Nintendo’s new IP, Arms. However, this Nintendo Direct, being centered around the game as previously mentioned, drastically changed that fact. For starters, it was stated how every character could equip interchangeable arms which each have unique abilities. To purchase these, players will have to earn in-game currency by partaking in fights as well as minigames. In addition to this, not only was each character explained to have a special ability and a mode where teams of two fight against each other, but a new character by the name of Minmin, AKA the Ramen Bomber, was revealed. All of this information adds a new layer of depth to Arms and makes this once unknown IP shrouded in mystery one of the most anticipated releases of the year.\n\nArms, along with a yellow Joy-Con and extension that makes the battery life of Joy-Con last longer, releases June 16th.\n\nSplatoon 2\n\nAlthough only coming into fruition during the lifespan of the WiiU, Splatoon has become popular in a fairly short amount of time. So, when a sequel to the great first entry was announced, it was only natural for the hype to generate. This hype only grew with Nintendo hosting a Splatoon 2 beta a couple weeks ago giving us a slight taste of its gameplay. Though, this beta and information given to us about the game prior to the existence of this direct only consisted of showing off new maps, weapons, and letting players know that the main mode of turf war would be included into it. Despite this, this direct confirmed that Splatoon 2 is going to have a co-op mode alongside its competitive ones. This co-op mode. Salmon Run, places four players into a horde mode against salmon like enemies with different variants. Also, Splatoon 2 was confirmed to have a campaign like its predecessor did and have three Amiibo (Inkling Boy, Girl, and Squid) where players can inherit the costumes the Amiibo are wearing. I was already planning on buying Splatoon 2, but the announcement of Salmon Run ensured that that would happen for sure.\n\nSplatoon 2 and its Amiibo release July 21st.\n\nUltimate Street Fighter 2: The Final Challengers\n\nStreet Fighter II is a good game. And, it getting a remaster isn’t outrageous considering how many are released every year. But, does it really need NINE REMASTERS!? With the exception of the utilization of the touch screen to make special moves accessible at the press of a button and the addition of online play, there is little here to justify yet another remaster. The updated visuals don’t look as polished as they could be, the co-op battles (where two players share a health bar whilst fighting one opponent) are an interesting use of the Joy-Con, but are only a small inclusion. Furthermore, the game attempts to justify its existence by adding a motion control mode where players can Hadouken Shadaloo minions. Literally, there is close to nothing here to make this a worthy addition to the Nintendo Switch library.\n\nUltimate Street Fighter 2: The Final Challengers releases May 26th.\n\nNintendo Switch Games With Little Information &amp; Miscellaneous Announcements\n\nSince some games announced had little information revealed about them, it’s not possible to dedicate an entire section them. So, I’ve decided to compile them into one section and give brief descriptions of all these remaining Switch games which lack details.\n\nMinecraft: Switch Edition: The same Minecraft we all know and love with local and online multiplayer, but this version also includes the Mario skins and maps from the WiiU version. \n\nMinecraft: Switch Edition releases May 11th\n\nMario Kart 8 Deluxe: An announcement that just reaffirms its new tracks, refined battle mode, new characters, and local/online functionalities\n\nMario Kart 8 Deluxe releases April 28th\n\nSonic: Announcements that just regurgitate information we already knew about Sonic Forces and Sonic Mania\n\nSonic Forces releases holiday 2017\n\nSonic Mania releases summer\n\nProject Mekuru: An interesting new title where players have to jump on tiles to change their color and need to make sure that their color maintains dominance over all tiles\n\nProject Mekuru releases summer\n\nFate/Extella: The Umbral Star: Some random anime-styled game with gameplay akin to the likes of the Dynasty Warriors franchise\n\nFate/Extella: The Umbral Star releases July 25th\n\nDisgaea 5: The complete edition of the turn-based game with both its base content and DLC included\n\nDisgaea 5 releases May 23rd\n\nPuyo Puyo Tetris: A form of Tetris with its original gameplay that also has a new Puyo mode where players have to, instead of making a line with any block, line up Puyo of the same color to gain points.\n\nPuyo Puyo Tetris releases April 25th while its demo released the day this direct was broadcasted\n\nMonopoly: No joke, they made Monopoly for the Switch. What has the world come to?\n\nMonopoly releases fall\n\nRayman Legends: Definitive Edition: Contains the standard cartoonish action platformer goodness alongside two new modes with one being a multiplayer mode where players slap soccer balls into goals\n\nRayman Legends: Definitive Edition releases 2017\n\nSine Mora EX: A beautiful side-scrolling shoot em’ up with time mechanics being boasted as its distinguishing aspects\n\nSine Mora EX releases summer\n\nBattle Chasers: Nightwar: Mildly stylized graphics mixed with generally good looking models and scenery are the only details shown to us about this turn-based RPG.\n\nBattle Chasers: Nightwar releases summer\n\nPayday 2: Perhaps the most surprising and exciting reveal of this direct, this co-op game where you rob banks hopefully is a representative for a good future of third party support for the Switch\n\nPayday 2 releases 2017\n\nNamco Museum: Collection of classic games such as Pacman and Dig-Dug with an all new challenge mode\n\nNamco Museum releases summer \n\nIndividual Nintendo Switch docks will begin to be sold on May 19th\n\nNew Link Amiibo release June 23rd\n\nCloud, Corrin, and Bayonetta Amiibo with costume variations release July 21st\n\nThe Nintendo Switch and 3DS both have a promising future ahead of them if these are the kind of promising titles that will continue to release on them. 3DS owners are seemingly guaranteed to continue receiving a healthy mix of both first and third party games which each hold great promise. Switch owners, on the other hand, will (hopefully) get more games such as Payday 2 and Fate/Extella alongside first-party games that will open this console rife with potential to new audiences and lead to it getting more diverse and enjoyable experiences/surprises such as the ones we saw in this direct. Funny, all this happened before E3 2017 even began delving out details about itself. I wonder what surprises E3 has in store for us if this was just a Nintendo Direct.", "likes": null, "suggested_sort": "top", "user_reports": [], "secure_media": null, "link_flair_text": "Discussion", "id": "65lrl0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 19, "report_reasons": null, "author": "Ultimategamer132", "saved": false, "mod_reports": [], "name": "t3_65lrl0", "subreddit_name_prefixed": "r/3DS", "approved_by": null, "over_18": false, "domain": "self.3DS", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/8Be7JD2oV3dANCmyq_IByX-mjQ9uxXXcw_SYd6O27tg.jpg?s=0db20374fb166588b1c4eb35574e29b6", "width": 480, "height": 360}, "resolutions": [{"url": "https://i.redditmedia.com/8Be7JD2oV3dANCmyq_IByX-mjQ9uxXXcw_SYd6O27tg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=47e2dda139c7b1709c1192effb37ce0d", "width": 108, "height": 81}, {"url": "https://i.redditmedia.com/8Be7JD2oV3dANCmyq_IByX-mjQ9uxXXcw_SYd6O27tg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=ea17a1a18e243e0b27b635c9f7a2a5fb", "width": 216, "height": 162}, {"url": "https://i.redditmedia.com/8Be7JD2oV3dANCmyq_IByX-mjQ9uxXXcw_SYd6O27tg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=1693c2452b92c50dc3a90bede25987f3", "width": 320, "height": 240}], "variants": {}, "id": "oP-I4b7behSuny119I-dDEVrq3ftECyTpHacXK6t7HA"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2ruhy", "edited": false, "link_flair_css_class": "discussion", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/3DS/comments/65lrl0/nintendo_direct_of_41217_information_and_thoughts/", "num_reports": null, "locked": false, "stickied": false, "created": 1492323141.0, "url": "https://www.reddit.com/r/3DS/comments/65lrl0/nintendo_direct_of_41217_information_and_thoughts/", "author_flair_text": null, "quarantine": false, "title": "Nintendo Direct of 4/12/17 Information and Thoughts", "created_utc": 1492294341.0, "distinguished": null, "media": null, "upvote_ratio": 0.7, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ruhy", "removal_reason": null, "link_id": "t3_65lrl0", "likes": null, "replies": "", "user_reports": [], "id": "dgd8l7z", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Pixelated_Fudge", "parent_id": "t3_65lrl0", "subreddit_name_prefixed": "r/3DS", "controversiality": 0, "body": "k", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;k&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "3DS", "name": "t1_dgd8l7z", "score_hidden": false, "stickied": false, "created": 1492441876.0, "created_utc": 1492413076.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]