[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "3DS", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi everyone, and welcome back to the world of Media Create! Anime Boston&amp;#39;s come and gone, and I&amp;#39;ve pretty much reached the final stages of that other thing I&amp;#39;m working on, which means I&amp;#39;m back in the saddle. (Quick note: great to meet the folks who came to the panel! You all rock.) &lt;/p&gt;\n\n&lt;p&gt;The past two weeks have been exciting, though. two weeks ago, the Switch crossed 500K, and Monster Hunter XX broke a million units. We saw a new Musou game launch (Musou Stars - which did &lt;em&gt;not&lt;/em&gt; impress - 60% sell-through week-one = ouch), and the return of Mario Sports (which, again, didn&amp;#39;t really excite sales-wise last week).&lt;/p&gt;\n\n&lt;p&gt;As for Microsoft: Be glad I was gone, because I&amp;#39;d have had stories for that week you did 115 sales. Really... the Wii U sold 3.57 times more that week. Ouch. Just ouch.&lt;/p&gt;\n\n&lt;p&gt;That said, it&amp;#39;s good to be back, and there&amp;#39;s numbers to look at. So let&amp;#39;s take a look at the big board.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Note:&lt;/strong&gt; Apologies for the delay - Verizon FiOS was out for most of Rhode Island yesterday - I was kind of on pins and needles waiting for things to go back on… at 9:30PM. On the plus side, I finally got to put some quality time into Persona 5?&lt;/p&gt;\n\n&lt;h1&gt;Nintendo&lt;/h1&gt;\n\n&lt;p&gt;This week saw titles on the Big N&amp;#39;s hardware take eleven spaces on the big board. Of those, the breakdown is as follows:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Switch:&lt;/strong&gt; 3&lt;/li&gt;\n&lt;li&gt;**3DS: 6&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Wii U:&lt;/strong&gt; 2&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The lure of the most dangerous game of all (no, not humanity - I&amp;#39;m talking Massacre Demon Diabolos) has adventurers lining up with their weapons at the ready for &lt;strong&gt;&lt;em&gt;Monster Hunter XX&lt;/em&gt;&lt;/strong&gt;. The title held onto first place this period, with 65,672 units sold (1,322,152 LTD). We should see this cruise by 1.5 million in short order and, given the momentum, I wouldn&amp;#39;t be shocked to see it beat two million by mid-autumn. The sales are still low for a &lt;em&gt;Monster Hunter&lt;/em&gt; game, but &amp;quot;Low for MonHun&amp;quot; is still pretty freaking fantastic overall. I do wonder if we&amp;#39;ll see some folks at Capcom paying attention to the criticisms come MonHun 5, though...&lt;/p&gt;\n\n&lt;p&gt;Those who weren&amp;#39;t looking to hunt massive mythical monsters found their own adventures in the open plains of Hyrule. &lt;strong&gt;&lt;em&gt;The Legend of Zelda: Breath of the Wild&lt;/em&gt;&lt;/strong&gt; (Switch) climbed up to second place this period, with 23,016 units sold (354,404 LTD). The Wii U version also charted this period, taking 10th place with 6,487 sales (95,806 LTD). Combined, the two SKUs sold through 450,210 copies. We should see this hit 500K (combined) before long and, again - I&amp;#39;m being bullish here - but there is a real possibility of a million-seller if (and it&amp;#39;s a &lt;strong&gt;big&lt;/strong&gt; &amp;quot;if&amp;quot;) we continue to see a roughly 1:2 attach rate with the Switch going forward. &lt;/p&gt;\n\n&lt;p&gt;Of course, sometimes, you don&amp;#39;t want a grand adventure. Sometimes, you just want to play a game of soccer, baseball, tennis, golf. And sometimes you just want to race a horse (wait, what?). &lt;strong&gt;&lt;em&gt;Mario Sports Superstars&lt;/em&gt;&lt;/strong&gt; (3DS) scored a third place position, selling through 18,765 copies (51,181 LTD) this period. The second-week hold is surprisingly strong, as we&amp;#39;re seeing just 42% dropoff week-over-week. Still, the game &lt;em&gt;did&lt;/em&gt; open poorly. I&amp;#39;ll be keeping an eye on this one, as many were pretty shocked by Mario Party: Star Rush&amp;#39;s seemingly endless parade through the charts during the holidays.&lt;/p&gt;\n\n&lt;p&gt;And, really, some people just want to (1-2) Switch things up, so to speak. &lt;strong&gt;&lt;em&gt;1-2-Switch&lt;/em&gt;&lt;/strong&gt; (Switch) took fourth place this period, with 12,418 units sold (166,319 LTD). Seeing this crack 200K is almost a given at this point, and I&amp;#39;m pretty confident that &lt;em&gt;1-2-Switch&lt;/em&gt; will cross that milestone around the launch of Mario Kart 8 Deluxe... plus or minus a week.&lt;/p&gt;\n\n&lt;p&gt;For those seeking Pocket Beasts (and where to find them), Alola continues to be a welcoming destination. &lt;strong&gt;&lt;em&gt;Pokémon Sun &amp;amp; Moon&lt;/em&gt;&lt;/strong&gt; (3DS) caught 8th place this period, with 6,972 copies (3,236,826 LTD) copies reaching customers. In our downtime, the title officially crossed 3.25 million sales, which is nothing short of fantastic. Adding in the sales of the double-pack, though, which rests at 157,492 last charting, we&amp;#39;re looking at total cumulative sales of 3,394,318. We should be seeing combined sales cross 3.5 million by summer, considering the current trajectory.&lt;/p&gt;\n\n&lt;p&gt;The quest for the Perfect Mario Trap (TM) also reached new heights in the downtime. &lt;strong&gt;&lt;em&gt;Super Mario Maker 3DS&lt;/em&gt;&lt;/strong&gt; (3DS) moved another 5,717 copies this period (1,015,110 LTD), which was enough to build a path to 13th place. The title crossed the million sales mark which is nothing short of amazing. I&amp;#39;m genuinely curious to see how Nintendo reads this and acts, going forward.&lt;/p&gt;\n\n&lt;p&gt;That said, some people just want to make the world blow up. &lt;strong&gt;&lt;em&gt;Super Bomberman R&lt;/em&gt;&lt;/strong&gt; (Switch) continues to hang tight in the charts. The title moved 4,233 copies (66,617 LTD), which was enough to blast up the #15 space for the period. Again, kudos to Konami for making their biggest &lt;em&gt;Bomberman&lt;/em&gt; success story in ages. Here&amp;#39;s hoping they can improve on the title in a potential sequel!&lt;/p&gt;\n\n&lt;p&gt;Beyond the bombs and globe-trotting adventures, though, is a little slice of home. &lt;strong&gt;&lt;em&gt;Animal Crossing: New Leaf&lt;/em&gt;&lt;/strong&gt;&amp;#39;s Welcome amiibo SKU (3DS) helped 4,017 customers move into a new virtual hometown this time around (159,150 LTD), which was enough to capture 18th place. This is the fourth release of the game, and it&amp;#39;s still clearing 150K. Simply incredible.&lt;/p&gt;\n\n&lt;p&gt;Speaking of incredible, can we take a moment to highlight the longevity of &lt;strong&gt;&lt;em&gt;Minecraft&lt;/em&gt;&lt;/strong&gt; for Wii U? Though it&amp;#39;s dipped off the charts a few times, the title has been a regular sight since its debut on June 23. This week saw another 4,014 adventurers stepping into the sandbox (313,703 LTD) to take 19th place. I don&amp;#39;t expect it to last much longer, but 313K on a sinking (now retired) console does warrant some attention.&lt;/p&gt;\n\n&lt;p&gt;Sadly, that doggie in the window must have cost too much. Yes, the one with the waggly tail. 3DS game &lt;strong&gt;&lt;em&gt;Kawaii Pet to Kurasou! Wan Nyan &amp;amp; Mini Mini Animal&lt;/em&gt;&lt;/strong&gt; managed to move just 3,631 copies in its opening week.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Additional commentary&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll be saying this now, about three weeks ahead of the numbers: Mario Kart 8 Deluxe will hit stores on April 28 - one day before Golden Week kicks off. If the rumors of a Switch bundle are true, I expect a larger-scale restock on the 28th, which should lead to a decent-sized jump for the period.&lt;/p&gt;\n\n&lt;p&gt;Mario Kart 7 saw 3DS hardware sales spike to about 200,000 when it launched on December 1, 2011. Mario Kart 8 doubled Wii U sales, and opened at #1 with 325,892 when it hit stores on May 29, 2014. I&amp;#39;m not expecting anything as crazy as Mario Kart 7&amp;#39;s launch, but we should see a spike nonetheless.&lt;/p&gt;\n\n&lt;h2&gt;On the Hardware Front&lt;/h2&gt;\n\n&lt;p&gt;This week saw the Switch take top honors, with 41,193 units reaching customers. Lifetime sales crossed 600K this period, with the final tally resting at 606,206. I&amp;#39;m genuinely curious to see how Mario Kart affects sales in the near term, not to mention Splatoon and Fire Emblem Warriors.&lt;/p&gt;\n\n&lt;p&gt;The 3DS family moved just over half of its newer sibling, with 25,685 handhelds sold. Meanwhile, the Wii U just continues to meander down its ultimate path, moving just 358 units over the week.&lt;/p&gt;\n\n&lt;h1&gt;Sony&lt;/h1&gt;\n\n&lt;p&gt;The PlayStation family managed to capture nine titles on the big board this week, with eight PS4 games and a lone Vita title making the cut.&lt;/p&gt;\n\n&lt;p&gt;Leading the way was everyone&amp;#39;s favorite building block (and sole-destroyer if you&amp;#39;re not careful while barefoot), LEGO. &lt;strong&gt;&lt;em&gt;LEGO Worlds&lt;/em&gt;&lt;/strong&gt; (PS4) constructed a path to fifth place this period, with 11,578 sales. This is the second-best launch for a Lego game to date, falling just behind &lt;em&gt;Lego City Undercover&lt;/em&gt; (Wii U), and just barely edging out 3DS game &lt;em&gt;LEGO City Undercover: The Chase Begins&lt;/em&gt;. So, kudos, Lego Worlds. Hopefully, we&amp;#39;ll it form a decent set of legs.&lt;/p&gt;\n\n&lt;p&gt;Sadly, it looks like the All-Stars are crashing down to earth. &lt;strong&gt;&lt;em&gt;Warriors All-Stars&lt;/em&gt;&lt;/strong&gt; (PS4) dipped down to the #6 space this time around, with 8,577 units sold (48,946 LTD). The Vita version also charted at 14th, moving 4,527 copies this period (22,393 LTD). Combined, the two SKUs sold through 71,339 units to date. That said - I do make the sardonic jokes, as intial sales were low. However, trajectory is about what I expected, and falls firmly in that 73-83% &amp;quot;week-two&amp;quot; window. We should see the game cross 75K next sales period, and ultimately around 85-110K by the time it exits the charts. This is poor for a Musou game, though, and I don&amp;#39;t doubt that Koei Tecmo&amp;#39;s hoping for a miracle in the west.&lt;/p&gt;\n\n&lt;p&gt;It looks like folks are still heading out the wild lands for guerrilla action. &lt;strong&gt;&lt;em&gt;Tom Clancy&amp;#39;s Ghost Recon: Wildlands&lt;/em&gt;&lt;/strong&gt; managed to rise to 8th place this period, moving 7,907 units (153,408 LTD). The continued strong performance is fantastic to see, and points to a bright future for &lt;em&gt;Ghost Recon&lt;/em&gt; going forward.&lt;/p&gt;\n\n&lt;p&gt;For those wanting something a bit more symbolic... or those who want to see 2B&amp;#39;s butt, &lt;strong&gt;&lt;em&gt;NieR: Automata&lt;/em&gt;&lt;/strong&gt; (PS4) continues to impress. Yoko Taro&amp;#39;s latest epic moved another 5,593 units (294,694 LTD) to claim the #9 spot. The title is on the cusp of crushing 300K. This is beyond all original estimations, and a resounding success for Square Enix. I can&amp;#39;t wait to see where this finally comes to rest by the time it exits the big board.&lt;/p&gt;\n\n&lt;p&gt;At 11th place, RPG fans found a new title to reflect on, so to speak. &lt;strong&gt;&lt;em&gt;Blue Reflection: Maboroshi ni Mau - Shoujo no Ken&lt;/em&gt;&lt;/strong&gt; (PS4) dropped down to 11th place this period, with 6,100 units sold (40,691 LTD). The 82% drop is ont he higher end of the &amp;quot;week-2 drop&amp;quot; range, so I&amp;#39;m not anticipating any real legs growing out. I could be proven wrong, but we should see this drop out by the end of the month.&lt;/p&gt;\n\n&lt;p&gt;ON the flip side, fans have been setting their Horizons toward the west. &lt;strong&gt;&lt;em&gt;Horizon: Zero Dawn&lt;/em&gt;&lt;/strong&gt; (PS4) moved 6,018 copies (196,661 LTD), to take 12th place. We should see this cross the 200K mark next time around, which is nothing short of phenomenal. I don&amp;#39;t see a 250K with its current trajectory, but I&amp;#39;d love to be proven wrong.&lt;/p&gt;\n\n&lt;p&gt;Meanwhile, the Magic Kingdom continues to be a decent draw for children of all ages. &lt;strong&gt;&lt;em&gt;Kingdom Hearts I.5 + II.5 ReMIX&lt;/em&gt;&lt;/strong&gt; (PS4) managed to hold onto 16th place this period, with 4,218 units sold (98,725 LTD). We should see this cross 100K next week.&lt;/p&gt;\n\n&lt;p&gt;At the back of the pack is the merry band of thieves of San Andreas. &lt;strong&gt;&lt;em&gt;Grand Theft Auto V&lt;/em&gt;&lt;/strong&gt;&amp;#39;s budget-priced re-release (PS4) continues to hold on, with 4,094 copies reaching customers this period (318,014 LTD). I&amp;#39;m not sure what else I can really say here, as this is a phenomenal performance overall. &lt;/p&gt;\n\n&lt;h2&gt;On the Hardware Front&lt;/h2&gt;\n\n&lt;p&gt;The PlayStation 4 took third place this period, with 24,512 units sold. Of those, 6,490 were PlayStation Pro consoles. The Vita took a distant fourth, selling just 5,987 handhelds.&lt;/p&gt;\n\n&lt;p&gt;Meanwhile, the PS3 dropped back down to triple digits with 704 consoles sold.&lt;/p&gt;\n\n&lt;h1&gt;Microsoft&lt;/h1&gt;\n\n&lt;p&gt;In New York, 132nd Street is a throughfare in Harlem. The road runs east to west above Central Park, and reaches from Frederick Douglass Boulevard to Park Avenue. There&amp;#39;s a community garden on the road, between Adam Clayton Powell Jr. Boulevard and Malcolm X Boulevard, which is tended to by locals to the area.&lt;/p&gt;\n\n&lt;p&gt;In the world of Japanese console sales, I can only imagine a few Microsoft employees hoping to escape to gardens of their own after seeing 132 XBox One sales come through.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.4gamer.net/games/117/G011794/20170412086/\"&gt;[Original Charts at 4Gamer]&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.neogaf.com/forum/showthread.php?t=1359882\"&gt;[Discussion at NeoGAF]&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi everyone, and welcome back to the world of Media Create! Anime Boston's come and gone, and I've pretty much reached the final stages of that other thing I'm working on, which means I'm back in the saddle. (Quick note: great to meet the folks who came to the panel! You all rock.) \n\nThe past two weeks have been exciting, though. two weeks ago, the Switch crossed 500K, and Monster Hunter XX broke a million units. We saw a new Musou game launch (Musou Stars - which did *not* impress - 60% sell-through week-one = ouch), and the return of Mario Sports (which, again, didn't really excite sales-wise last week).\n\nAs for Microsoft: Be glad I was gone, because I'd have had stories for that week you did 115 sales. Really... the Wii U sold 3.57 times more that week. Ouch. Just ouch.\n\nThat said, it's good to be back, and there's numbers to look at. So let's take a look at the big board.\n\n**Note:** Apologies for the delay - Verizon FiOS was out for most of Rhode Island yesterday - I was kind of on pins and needles waiting for things to go back on… at 9:30PM. On the plus side, I finally got to put some quality time into Persona 5?\n\n#Nintendo\n\nThis week saw titles on the Big N's hardware take eleven spaces on the big board. Of those, the breakdown is as follows:\n\n* **Switch:** 3\n* **3DS: 6\n* **Wii U:** 2\n\nThe lure of the most dangerous game of all (no, not humanity - I'm talking Massacre Demon Diabolos) has adventurers lining up with their weapons at the ready for ***Monster Hunter XX***. The title held onto first place this period, with 65,672 units sold (1,322,152 LTD). We should see this cruise by 1.5 million in short order and, given the momentum, I wouldn't be shocked to see it beat two million by mid-autumn. The sales are still low for a *Monster Hunter* game, but \"Low for MonHun\" is still pretty freaking fantastic overall. I do wonder if we'll see some folks at Capcom paying attention to the criticisms come MonHun 5, though...\n\nThose who weren't looking to hunt massive mythical monsters found their own adventures in the open plains of Hyrule. ***The Legend of Zelda: Breath of the Wild*** (Switch) climbed up to second place this period, with 23,016 units sold (354,404 LTD). The Wii U version also charted this period, taking 10th place with 6,487 sales (95,806 LTD). Combined, the two SKUs sold through 450,210 copies. We should see this hit 500K (combined) before long and, again - I'm being bullish here - but there is a real possibility of a million-seller if (and it's a **big** \"if\") we continue to see a roughly 1:2 attach rate with the Switch going forward. \n\nOf course, sometimes, you don't want a grand adventure. Sometimes, you just want to play a game of soccer, baseball, tennis, golf. And sometimes you just want to race a horse (wait, what?). ***Mario Sports Superstars*** (3DS) scored a third place position, selling through 18,765 copies (51,181 LTD) this period. The second-week hold is surprisingly strong, as we're seeing just 42% dropoff week-over-week. Still, the game *did* open poorly. I'll be keeping an eye on this one, as many were pretty shocked by Mario Party: Star Rush's seemingly endless parade through the charts during the holidays.\n\nAnd, really, some people just want to (1-2) Switch things up, so to speak. ***1-2-Switch*** (Switch) took fourth place this period, with 12,418 units sold (166,319 LTD). Seeing this crack 200K is almost a given at this point, and I'm pretty confident that *1-2-Switch* will cross that milestone around the launch of Mario Kart 8 Deluxe... plus or minus a week.\n\nFor those seeking Pocket Beasts (and where to find them), Alola continues to be a welcoming destination. ***Pokémon Sun &amp; Moon*** (3DS) caught 8th place this period, with 6,972 copies (3,236,826 LTD) copies reaching customers. In our downtime, the title officially crossed 3.25 million sales, which is nothing short of fantastic. Adding in the sales of the double-pack, though, which rests at 157,492 last charting, we're looking at total cumulative sales of 3,394,318. We should be seeing combined sales cross 3.5 million by summer, considering the current trajectory.\n\nThe quest for the Perfect Mario Trap (TM) also reached new heights in the downtime. ***Super Mario Maker 3DS*** (3DS) moved another 5,717 copies this period (1,015,110 LTD), which was enough to build a path to 13th place. The title crossed the million sales mark which is nothing short of amazing. I'm genuinely curious to see how Nintendo reads this and acts, going forward.\n\nThat said, some people just want to make the world blow up. ***Super Bomberman R*** (Switch) continues to hang tight in the charts. The title moved 4,233 copies (66,617 LTD), which was enough to blast up the #15 space for the period. Again, kudos to Konami for making their biggest *Bomberman* success story in ages. Here's hoping they can improve on the title in a potential sequel!\n\nBeyond the bombs and globe-trotting adventures, though, is a little slice of home. ***Animal Crossing: New Leaf***'s Welcome amiibo SKU (3DS) helped 4,017 customers move into a new virtual hometown this time around (159,150 LTD), which was enough to capture 18th place. This is the fourth release of the game, and it's still clearing 150K. Simply incredible.\n\nSpeaking of incredible, can we take a moment to highlight the longevity of ***Minecraft*** for Wii U? Though it's dipped off the charts a few times, the title has been a regular sight since its debut on June 23. This week saw another 4,014 adventurers stepping into the sandbox (313,703 LTD) to take 19th place. I don't expect it to last much longer, but 313K on a sinking (now retired) console does warrant some attention.\n\nSadly, that doggie in the window must have cost too much. Yes, the one with the waggly tail. 3DS game ***Kawaii Pet to Kurasou! Wan Nyan &amp; Mini Mini Animal*** managed to move just 3,631 copies in its opening week.\n\n***Additional commentary***\n\nI'll be saying this now, about three weeks ahead of the numbers: Mario Kart 8 Deluxe will hit stores on April 28 - one day before Golden Week kicks off. If the rumors of a Switch bundle are true, I expect a larger-scale restock on the 28th, which should lead to a decent-sized jump for the period.\n\nMario Kart 7 saw 3DS hardware sales spike to about 200,000 when it launched on December 1, 2011. Mario Kart 8 doubled Wii U sales, and opened at #1 with 325,892 when it hit stores on May 29, 2014. I'm not expecting anything as crazy as Mario Kart 7's launch, but we should see a spike nonetheless.\n\n##On the Hardware Front\n\nThis week saw the Switch take top honors, with 41,193 units reaching customers. Lifetime sales crossed 600K this period, with the final tally resting at 606,206. I'm genuinely curious to see how Mario Kart affects sales in the near term, not to mention Splatoon and Fire Emblem Warriors.\n\nThe 3DS family moved just over half of its newer sibling, with 25,685 handhelds sold. Meanwhile, the Wii U just continues to meander down its ultimate path, moving just 358 units over the week.\n\n#Sony\n\nThe PlayStation family managed to capture nine titles on the big board this week, with eight PS4 games and a lone Vita title making the cut.\n\nLeading the way was everyone's favorite building block (and sole-destroyer if you're not careful while barefoot), LEGO. ***LEGO Worlds*** (PS4) constructed a path to fifth place this period, with 11,578 sales. This is the second-best launch for a Lego game to date, falling just behind *Lego City Undercover* (Wii U), and just barely edging out 3DS game *LEGO City Undercover: The Chase Begins*. So, kudos, Lego Worlds. Hopefully, we'll it form a decent set of legs.\n\nSadly, it looks like the All-Stars are crashing down to earth. ***Warriors All-Stars*** (PS4) dipped down to the #6 space this time around, with 8,577 units sold (48,946 LTD). The Vita version also charted at 14th, moving 4,527 copies this period (22,393 LTD). Combined, the two SKUs sold through 71,339 units to date. That said - I do make the sardonic jokes, as intial sales were low. However, trajectory is about what I expected, and falls firmly in that 73-83% \"week-two\" window. We should see the game cross 75K next sales period, and ultimately around 85-110K by the time it exits the charts. This is poor for a Musou game, though, and I don't doubt that Koei Tecmo's hoping for a miracle in the west.\n\nIt looks like folks are still heading out the wild lands for guerrilla action. ***Tom Clancy's Ghost Recon: Wildlands*** managed to rise to 8th place this period, moving 7,907 units (153,408 LTD). The continued strong performance is fantastic to see, and points to a bright future for *Ghost Recon* going forward.\n\nFor those wanting something a bit more symbolic... or those who want to see 2B's butt, ***NieR: Automata*** (PS4) continues to impress. Yoko Taro's latest epic moved another 5,593 units (294,694 LTD) to claim the #9 spot. The title is on the cusp of crushing 300K. This is beyond all original estimations, and a resounding success for Square Enix. I can't wait to see where this finally comes to rest by the time it exits the big board.\n\nAt 11th place, RPG fans found a new title to reflect on, so to speak. ***Blue Reflection: Maboroshi ni Mau - Shoujo no Ken*** (PS4) dropped down to 11th place this period, with 6,100 units sold (40,691 LTD). The 82% drop is ont he higher end of the \"week-2 drop\" range, so I'm not anticipating any real legs growing out. I could be proven wrong, but we should see this drop out by the end of the month.\n\nON the flip side, fans have been setting their Horizons toward the west. ***Horizon: Zero Dawn*** (PS4) moved 6,018 copies (196,661 LTD), to take 12th place. We should see this cross the 200K mark next time around, which is nothing short of phenomenal. I don't see a 250K with its current trajectory, but I'd love to be proven wrong.\n\nMeanwhile, the Magic Kingdom continues to be a decent draw for children of all ages. ***Kingdom Hearts I.5 + II.5 ReMIX*** (PS4) managed to hold onto 16th place this period, with 4,218 units sold (98,725 LTD). We should see this cross 100K next week.\n\nAt the back of the pack is the merry band of thieves of San Andreas. ***Grand Theft Auto V***'s budget-priced re-release (PS4) continues to hold on, with 4,094 copies reaching customers this period (318,014 LTD). I'm not sure what else I can really say here, as this is a phenomenal performance overall. \n\n##On the Hardware Front\n\nThe PlayStation 4 took third place this period, with 24,512 units sold. Of those, 6,490 were PlayStation Pro consoles. The Vita took a distant fourth, selling just 5,987 handhelds.\n\nMeanwhile, the PS3 dropped back down to triple digits with 704 consoles sold.\n\n#Microsoft\n\nIn New York, 132nd Street is a throughfare in Harlem. The road runs east to west above Central Park, and reaches from Frederick Douglass Boulevard to Park Avenue. There's a community garden on the road, between Adam Clayton Powell Jr. Boulevard and Malcolm X Boulevard, which is tended to by locals to the area.\n\nIn the world of Japanese console sales, I can only imagine a few Microsoft employees hoping to escape to gardens of their own after seeing 132 XBox One sales come through.\n\n[\\[Original Charts at 4Gamer\\]](http://www.4gamer.net/games/117/G011794/20170412086/)\n\n[\\[Discussion at NeoGAF\\]](http://www.neogaf.com/forum/showthread.php?t=1359882)", "likes": null, "suggested_sort": "top", "user_reports": [], "secure_media": null, "link_flair_text": "Miscellaneous", "id": "65ssek", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 88, "report_reasons": null, "author": "maturra", "saved": false, "mod_reports": [], "name": "t3_65ssek", "subreddit_name_prefixed": "r/3DS", "approved_by": null, "over_18": false, "domain": "self.3DS", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/wuegHeitMr5My9hzH7NgLv_Yu07wWoQ1FSPeqUEMKzo.jpg?s=1dcbfabff0b2cd4ccb8a8383ccf300a4", "width": 240, "height": 180}, "resolutions": [{"url": "https://i.redditmedia.com/wuegHeitMr5My9hzH7NgLv_Yu07wWoQ1FSPeqUEMKzo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=5335c69349cb28e32411dc437fa73684", "width": 108, "height": 81}, {"url": "https://i.redditmedia.com/wuegHeitMr5My9hzH7NgLv_Yu07wWoQ1FSPeqUEMKzo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=2b7491f45a4735fce2a8178e04c22cb1", "width": 216, "height": 162}], "variants": {}, "id": "uZwmSm6t5gteDVZ5dQ-IpJJei-r53OW7Zpq1UJaErAs"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2ruhy", "edited": false, "link_flair_css_class": "misc", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/3DS/comments/65ssek/media_create_japan_sales_432017_492017_monster/", "num_reports": null, "locked": false, "stickied": false, "created": 1492422235.0, "url": "https://www.reddit.com/r/3DS/comments/65ssek/media_create_japan_sales_432017_492017_monster/", "author_flair_text": null, "quarantine": false, "title": "Media Create (Japan Sales) 4/3/2017 - 4/9/2017: Monster Hunter Double Cross Moves 65,672, Mario Sports Superstars Shifts 18,765, 3DS Pushes 25,685 Units", "created_utc": 1492393435.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 88}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ruhy", "removal_reason": null, "link_id": "t3_65ssek", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ruhy", "removal_reason": null, "link_id": "t3_65ssek", "likes": null, "replies": "", "user_reports": [], "id": "dgdf5x8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "maturra", "parent_id": "t1_dgd2mg5", "subreddit_name_prefixed": "r/3DS", "controversiality": 0, "body": "Glad to be back. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad to be back. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "3DS", "name": "t1_dgdf5x8", "score_hidden": false, "stickied": false, "created": 1492461132.0, "created_utc": 1492432332.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ruhy", "removal_reason": null, "link_id": "t3_65ssek", "likes": null, "replies": "", "user_reports": [], "id": "dgdefai", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kimonogurls", "parent_id": "t1_dgd2mg5", "subreddit_name_prefixed": "r/3DS", "controversiality": 0, "body": "Came here to say that! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Came here to say that! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "3DS", "name": "t1_dgdefai", "score_hidden": false, "stickied": false, "created": 1492459608.0, "created_utc": 1492430808.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2mg5", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "NCan", "parent_id": "t3_65ssek", "subreddit_name_prefixed": "r/3DS", "controversiality": 0, "body": "Glad to have you back!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad to have you back!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "3DS", "name": "t1_dgd2mg5", "score_hidden": false, "stickied": false, "created": 1492429992.0, "created_utc": 1492401192.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ruhy", "removal_reason": null, "link_id": "t3_65ssek", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ruhy", "removal_reason": null, "link_id": "t3_65ssek", "likes": null, "replies": "", "user_reports": [], "id": "dgdg7g0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "maturra", "parent_id": "t1_dgdcy82", "subreddit_name_prefixed": "r/3DS", "controversiality": 0, "body": "Thanks much! :D Glad you enjoyed it. I'm here every week.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks much! :D Glad you enjoyed it. I&amp;#39;m here every week.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "3DS", "name": "t1_dgdg7g0", "score_hidden": false, "stickied": false, "created": 1492463059.0, "created_utc": 1492434259.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdcy82", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DracoMagnusRufus", "parent_id": "t3_65ssek", "subreddit_name_prefixed": "r/3DS", "controversiality": 0, "body": "Since there's not a lot of comments here, thought I'd leave one saying this is a really well written and thorough overview. Good stuff!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since there&amp;#39;s not a lot of comments here, thought I&amp;#39;d leave one saying this is a really well written and thorough overview. Good stuff!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "3DS", "name": "t1_dgdcy82", "score_hidden": false, "stickied": false, "created": 1492455925.0, "created_utc": 1492427125.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ruhy", "removal_reason": null, "link_id": "t3_65ssek", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ruhy", "removal_reason": null, "link_id": "t3_65ssek", "likes": null, "replies": "", "user_reports": [], "id": "dgdg8hu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "maturra", "parent_id": "t1_dgdestu", "subreddit_name_prefixed": "r/3DS", "controversiality": 0, "body": "Missed you guys, too. c: Seriously, glad to be back - it felt strange not poring over the numbers on Wednesday morning. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Missed you guys, too. c: Seriously, glad to be back - it felt strange not poring over the numbers on Wednesday morning. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "3DS", "name": "t1_dgdg8hu", "score_hidden": false, "stickied": false, "created": 1492463109.0, "created_utc": 1492434309.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdestu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "hur_hur_boobs", "parent_id": "t3_65ssek", "subreddit_name_prefixed": "r/3DS", "controversiality": 0, "body": "I missed you so much &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I missed you so much &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "3DS", "name": "t1_dgdestu", "score_hidden": false, "stickied": false, "created": 1492460404.0, "created_utc": 1492431604.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]