[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "graphic_design", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going to attempt to make this short.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m an 18 year old guy living in San Jose and I still don&amp;#39;t really know exactly what I&amp;#39;d like to do in the future. The four I have in mind right now are graphic/industrial design, physical therapy, biology, and maybe Computer Engineering (But I&amp;#39;m pretty trash at math). And then maybe something in music if something down the line opens up, but that seems almost like a dead end at this point.&lt;/p&gt;\n\n&lt;p&gt;My second oldest sister is almost done with her BFA at San Jose State, so she&amp;#39;s already gone through pretty much the entire program and could help me. She&amp;#39;s the one that kept telling me to look into it (A little too often, it was like every second word).&lt;/p&gt;\n\n&lt;p&gt;A couple problems are I have no artistic talent (Drawing, painting, though apparently they aren&amp;#39;t necessary, just being to sketch well which I can) though I am a very devoted musician I think that&amp;#39;s a different category. I don&amp;#39;t really have much experience in anything Graphic Design/Industrial Product Design. As in, I haven&amp;#39;t done any projects and examples of what I can come up with (Also makes me wonder how well I&amp;#39;d do, since I don&amp;#39;t really know if I&amp;#39;d do well that this point).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a very creative person, I like to sit and think and ideas come to mind. I&amp;#39;m mainly a guitar player (Though a multitude of other instruments as well haha) and for me it&amp;#39;s a way of communication and I almost use it as a talking mechanism compared to singing, drawing, or writing. But it&amp;#39;s just to give you an example of the different mindset I&amp;#39;m in and the type of mindset someone who draws or puts ideas on paper may have.&lt;/p&gt;\n\n&lt;p&gt;One last thing is that my dad, every time it&amp;#39;s even mentioned and 95% of the time it isn&amp;#39;t me who mentions it, he starts on about (like I said) how I have no experience and have done nothing etc., and should maybe look somewhere else. I don&amp;#39;t know how to get passed that.&lt;/p&gt;\n\n&lt;p&gt;This is a bit longer than I expected now, but whatever.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm going to attempt to make this short.\n\nI'm an 18 year old guy living in San Jose and I still don't really know exactly what I'd like to do in the future. The four I have in mind right now are graphic/industrial design, physical therapy, biology, and maybe Computer Engineering (But I'm pretty trash at math). And then maybe something in music if something down the line opens up, but that seems almost like a dead end at this point.\n\nMy second oldest sister is almost done with her BFA at San Jose State, so she's already gone through pretty much the entire program and could help me. She's the one that kept telling me to look into it (A little too often, it was like every second word).\n\nA couple problems are I have no artistic talent (Drawing, painting, though apparently they aren't necessary, just being to sketch well which I can) though I am a very devoted musician I think that's a different category. I don't really have much experience in anything Graphic Design/Industrial Product Design. As in, I haven't done any projects and examples of what I can come up with (Also makes me wonder how well I'd do, since I don't really know if I'd do well that this point).\n\nI'm a very creative person, I like to sit and think and ideas come to mind. I'm mainly a guitar player (Though a multitude of other instruments as well haha) and for me it's a way of communication and I almost use it as a talking mechanism compared to singing, drawing, or writing. But it's just to give you an example of the different mindset I'm in and the type of mindset someone who draws or puts ideas on paper may have.\n\nOne last thing is that my dad, every time it's even mentioned and 95% of the time it isn't me who mentions it, he starts on about (like I said) how I have no experience and have done nothing etc., and should maybe look somewhere else. I don't know how to get passed that.\n\nThis is a bit longer than I expected now, but whatever.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65kq3t", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "SanarySurMer", "saved": false, "mod_reports": [], "name": "t3_65kq3t", "subreddit_name_prefixed": "r/graphic_design", "approved_by": null, "over_18": false, "domain": "self.graphic_design", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmtk", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/graphic_design/comments/65kq3t/should_i_lookgo_into_graphic_design_help_opinions/", "num_reports": null, "locked": false, "stickied": false, "created": 1492311019.0, "url": "https://www.reddit.com/r/graphic_design/comments/65kq3t/should_i_lookgo_into_graphic_design_help_opinions/", "author_flair_text": null, "quarantine": false, "title": "Should I Look/go into Graphic Design? (Help + Opinions Please?)", "created_utc": 1492282219.0, "distinguished": null, "media": null, "upvote_ratio": 0.5, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmtk", "removal_reason": null, "link_id": "t3_65kq3t", "likes": null, "replies": "", "user_reports": [], "id": "dgb9s6t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mateybob", "parent_id": "t3_65kq3t", "subreddit_name_prefixed": "r/graphic_design", "controversiality": 0, "body": "Hey! Not sure how much I can help but we seem very similar. I'm a first year graphic design student at Falmouth University in the UK. Similarly to you, I've never been particularly artistic (can't even sketch that well lol), but I've always been good on a computer with photoshop etc. I'm also a musician (drums were my main instrument, but I've taught myself guitar, piano and I sing).\n\nAnyway, before going to uni I had never studied any sort of graphic design, which made it quite hard for me to get in as almost everyone else on my course has done graphics at A level or a foundation course (sorry I'm not sure what the American equivalents are). Falmouth was actually the only uni I got accepted in to, which is pretty interesting seeing as it's one of the best in the UK for graphic design. You will definitely need a portfolio, but it's not too important for it to be any legitimate projects or anything. Most of my portfolio was me just making random posters or logos for my friends, and were all pretty basic and uninspired designs (in comparison to what I'm doing now). The main legit project I had done was for a friend of my brothers which was a poster for a theatre performance at the Edinburgh Fringe Festival - I think it definitely helped that I had a legitimate project in my portfolio, but they did like all my self directed stuff too. Mostly it's just about showing them that you really are interested in graphic design. If you're not that bothered about pursuing it then I'd maybe explore one of your other options, but if it's something you could really see yourself doing and would like to improve whatever skill set you might already have in the subject, I'd definitely recommend it. I've improved so so much since coming to university, especially as my skills were pretty limited before. \n\nAs far as music goes, unless it really is your main passion, I'd just keep it as a hobby. I still find the time to do covers and write songs in my spare time because it's something I really enjoy. \n\nSorry for the length of my comment haha, just hope I've helped in some way! If you have any other questions feel free to ask and I'll do my best to answer :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey! Not sure how much I can help but we seem very similar. I&amp;#39;m a first year graphic design student at Falmouth University in the UK. Similarly to you, I&amp;#39;ve never been particularly artistic (can&amp;#39;t even sketch that well lol), but I&amp;#39;ve always been good on a computer with photoshop etc. I&amp;#39;m also a musician (drums were my main instrument, but I&amp;#39;ve taught myself guitar, piano and I sing).&lt;/p&gt;\n\n&lt;p&gt;Anyway, before going to uni I had never studied any sort of graphic design, which made it quite hard for me to get in as almost everyone else on my course has done graphics at A level or a foundation course (sorry I&amp;#39;m not sure what the American equivalents are). Falmouth was actually the only uni I got accepted in to, which is pretty interesting seeing as it&amp;#39;s one of the best in the UK for graphic design. You will definitely need a portfolio, but it&amp;#39;s not too important for it to be any legitimate projects or anything. Most of my portfolio was me just making random posters or logos for my friends, and were all pretty basic and uninspired designs (in comparison to what I&amp;#39;m doing now). The main legit project I had done was for a friend of my brothers which was a poster for a theatre performance at the Edinburgh Fringe Festival - I think it definitely helped that I had a legitimate project in my portfolio, but they did like all my self directed stuff too. Mostly it&amp;#39;s just about showing them that you really are interested in graphic design. If you&amp;#39;re not that bothered about pursuing it then I&amp;#39;d maybe explore one of your other options, but if it&amp;#39;s something you could really see yourself doing and would like to improve whatever skill set you might already have in the subject, I&amp;#39;d definitely recommend it. I&amp;#39;ve improved so so much since coming to university, especially as my skills were pretty limited before. &lt;/p&gt;\n\n&lt;p&gt;As far as music goes, unless it really is your main passion, I&amp;#39;d just keep it as a hobby. I still find the time to do covers and write songs in my spare time because it&amp;#39;s something I really enjoy. &lt;/p&gt;\n\n&lt;p&gt;Sorry for the length of my comment haha, just hope I&amp;#39;ve helped in some way! If you have any other questions feel free to ask and I&amp;#39;ll do my best to answer :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "graphic_design", "name": "t1_dgb9s6t", "score_hidden": false, "stickied": false, "created": 1492323977.0, "created_utc": 1492295177.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmtk", "removal_reason": null, "link_id": "t3_65kq3t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmtk", "removal_reason": null, "link_id": "t3_65kq3t", "likes": null, "replies": "", "user_reports": [], "id": "dgcckwr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SanarySurMer", "parent_id": "t1_dgbzl9g", "subreddit_name_prefixed": "r/graphic_design", "controversiality": 0, "body": "Are you in a program right now? How much of an advantage does confidence in your drawing have for you ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you in a program right now? How much of an advantage does confidence in your drawing have for you &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "graphic_design", "name": "t1_dgcckwr", "score_hidden": false, "stickied": false, "created": 1492394843.0, "created_utc": 1492366043.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbzl9g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "opertin1", "parent_id": "t3_65kq3t", "subreddit_name_prefixed": "r/graphic_design", "controversiality": 0, "body": "I can't draw for crap but since graphic design is digital so it's much easier to edit a piece than when actually drawing ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t draw for crap but since graphic design is digital so it&amp;#39;s much easier to edit a piece than when actually drawing &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "graphic_design", "name": "t1_dgbzl9g", "score_hidden": false, "stickied": false, "created": 1492375458.0, "created_utc": 1492346658.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmtk", "removal_reason": null, "link_id": "t3_65kq3t", "likes": null, "replies": "", "user_reports": [], "id": "dgdlhnm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "moreexclamationmarks", "parent_id": "t3_65kq3t", "subreddit_name_prefixed": "r/graphic_design", "controversiality": 0, "body": "It might help to step back for a second, and look at what design is about. \n\nIt's more about problem solving and communication than art. You're always trying to communicate a message, and achieve an objective, basically coming up with the best solution to a problem. If you like being analytical, combined with creativity, brainstorming, idea generation and looking at things differently, then you'd probably like design. \n\nIt's also a relatively stable career compared to other more typically \"art-oriented\" jobs. You have the option to go freelance, or pursue full-time positions. It's a prevalent enough field that you can avoid the 'starving artist' cliche. It may not be the most lucrative field, but you can pretty reliably end up in the $50k-75k+ range if you build up adequate ability and experience. (As per a quick Google, \"the median salary for a graphic designer in California is $54,070 per year. Salaries typically start from $30,270 and go up to $97,600.\"\n\nAlso, go Sharks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It might help to step back for a second, and look at what design is about. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s more about problem solving and communication than art. You&amp;#39;re always trying to communicate a message, and achieve an objective, basically coming up with the best solution to a problem. If you like being analytical, combined with creativity, brainstorming, idea generation and looking at things differently, then you&amp;#39;d probably like design. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also a relatively stable career compared to other more typically &amp;quot;art-oriented&amp;quot; jobs. You have the option to go freelance, or pursue full-time positions. It&amp;#39;s a prevalent enough field that you can avoid the &amp;#39;starving artist&amp;#39; cliche. It may not be the most lucrative field, but you can pretty reliably end up in the $50k-75k+ range if you build up adequate ability and experience. (As per a quick Google, &amp;quot;the median salary for a graphic designer in California is $54,070 per year. Salaries typically start from $30,270 and go up to $97,600.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Also, go Sharks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "graphic_design", "name": "t1_dgdlhnm", "score_hidden": false, "stickied": false, "created": 1492470620.0, "created_utc": 1492441820.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]