[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "networking", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This one is out there for all you collaboration engineers out there. I am about half way through the CCNA Collaboration track and it occurred to me that while I may understand on a technical level how collaboration technologies work. I&amp;#39;ve become interested how to make people more collaborative using technology? What makes people want to use technology to collaborate and what makes people more collaborative in general? I understand that this might not be the best place to ask this as its not a networking question but I feel that I am within the community guidelines because it is important topic for the design of our networks. If anyone has any recommended reads or anything on these topics I felt there was no one better to ask then &lt;a href=\"/r/networking\"&gt;/r/networking&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This one is out there for all you collaboration engineers out there. I am about half way through the CCNA Collaboration track and it occurred to me that while I may understand on a technical level how collaboration technologies work. I've become interested how to make people more collaborative using technology? What makes people want to use technology to collaborate and what makes people more collaborative in general? I understand that this might not be the best place to ask this as its not a networking question but I feel that I am within the community guidelines because it is important topic for the design of our networks. If anyone has any recommended reads or anything on these topics I felt there was no one better to ask then /r/networking.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "659f4g", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "Jeffdit", "saved": false, "mod_reports": [], "name": "t3_659f4g", "subreddit_name_prefixed": "r/networking", "approved_by": null, "over_18": false, "domain": "self.networking", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qkaf", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/networking/comments/659f4g/digging_deeper_on_collaboration/", "num_reports": null, "locked": false, "stickied": false, "created": 1492158446.0, "url": "https://www.reddit.com/r/networking/comments/659f4g/digging_deeper_on_collaboration/", "author_flair_text": "CCNA Voice", "quarantine": false, "title": "Digging Deeper on Collaboration", "created_utc": 1492129646.0, "distinguished": null, "media": null, "upvote_ratio": 0.74, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_659f4g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_659f4g", "likes": null, "replies": "", "user_reports": [], "id": "dgc5kxe", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "xXShatter_ForceXx", "parent_id": "t1_dg8l0hq", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "One thing to consider. Each of those topics you listed has a lot of different protocols and use-cases behind it. From a high level collaboration seems easy and I can understand why somebody would say \"Why not make one service or product that does all of the collaboration stuff?\"\n\nExamples:\n\nPhone A Calls Phone B and we talk. I check my voicemail from John who called while I was at lunch. I send a fax and it shows up in the other person's email. I add Suzie to a group IM chat with Myself, Mark and John. I join a video conference call and have a meeting with the other folks on my project. I send a file to Suzie via email.\n\nThese are all day to day things we probably do and don't think about how much is going on behind the scenes. When you do that you see that even basic use-cases are somewhat complex. With that being said you could probably do all of those above in one application. However we knows users and companies. This is not how they function. Nobody does just the easy use-cases. They will come up with crazy one-off use-cases that nobody else in the world is doing but them. So splitting the collaboration portfolio into different products that each attempt to service a group of use-cases very well is better than one product that does them all \"kind of okay\". Doing this would cause scaleability issues when the customer brings in a complex use-case to the table.\n\nAnother thing to consider. From a resourcing and deployment standpoint you cannot develop CUCM/UCCX/UCCE/CUC/IMP/VCS/CUSP/CUBE as one application. There is so much going on that you almost have to split them out into individual parts that together make the whole solution. This modularity also allows you the ability plug and play with other services/applications that specialize on other user-case like Microsoft Lync/Exchange/Office 365 or Avaya systems.\n\nThe last thing to consider is cost. The cost of developing an application that does EVERYTHING is crazy which would also lead the product to be really expensive for a bunch of stuff you may not need or ever use. This could be circumvented by licensing where you buy a license for each set of use-cases you actually need and forgo the rest. However, none of us like licensing so I am going to gloss over this topic. \n\nI think these are some of the reasons why companies choose one group of use cases and then develop a kickass application that *tries* to do those very well.\n\nAlso you didn't mention faxing when listing collaboration topics. That is part of collaboration and it isn't going anywhere anytime soon unfortunately. :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One thing to consider. Each of those topics you listed has a lot of different protocols and use-cases behind it. From a high level collaboration seems easy and I can understand why somebody would say &amp;quot;Why not make one service or product that does all of the collaboration stuff?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Examples:&lt;/p&gt;\n\n&lt;p&gt;Phone A Calls Phone B and we talk. I check my voicemail from John who called while I was at lunch. I send a fax and it shows up in the other person&amp;#39;s email. I add Suzie to a group IM chat with Myself, Mark and John. I join a video conference call and have a meeting with the other folks on my project. I send a file to Suzie via email.&lt;/p&gt;\n\n&lt;p&gt;These are all day to day things we probably do and don&amp;#39;t think about how much is going on behind the scenes. When you do that you see that even basic use-cases are somewhat complex. With that being said you could probably do all of those above in one application. However we knows users and companies. This is not how they function. Nobody does just the easy use-cases. They will come up with crazy one-off use-cases that nobody else in the world is doing but them. So splitting the collaboration portfolio into different products that each attempt to service a group of use-cases very well is better than one product that does them all &amp;quot;kind of okay&amp;quot;. Doing this would cause scaleability issues when the customer brings in a complex use-case to the table.&lt;/p&gt;\n\n&lt;p&gt;Another thing to consider. From a resourcing and deployment standpoint you cannot develop CUCM/UCCX/UCCE/CUC/IMP/VCS/CUSP/CUBE as one application. There is so much going on that you almost have to split them out into individual parts that together make the whole solution. This modularity also allows you the ability plug and play with other services/applications that specialize on other user-case like Microsoft Lync/Exchange/Office 365 or Avaya systems.&lt;/p&gt;\n\n&lt;p&gt;The last thing to consider is cost. The cost of developing an application that does EVERYTHING is crazy which would also lead the product to be really expensive for a bunch of stuff you may not need or ever use. This could be circumvented by licensing where you buy a license for each set of use-cases you actually need and forgo the rest. However, none of us like licensing so I am going to gloss over this topic. &lt;/p&gt;\n\n&lt;p&gt;I think these are some of the reasons why companies choose one group of use cases and then develop a kickass application that &lt;em&gt;tries&lt;/em&gt; to do those very well.&lt;/p&gt;\n\n&lt;p&gt;Also you didn&amp;#39;t mention faxing when listing collaboration topics. That is part of collaboration and it isn&amp;#39;t going anywhere anytime soon unfortunately. :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dgc5kxe", "score_hidden": false, "stickied": false, "created": 1492385567.0, "created_utc": 1492356767.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_659f4g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_659f4g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_659f4g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_659f4g", "likes": null, "replies": "", "user_reports": [], "id": "dg9l9r6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jeffdit", "parent_id": "t1_dg9etac", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "What do you guys think about the Cisco TC series of devices. Where Android based OS allows a feel of centralization? You can have device input from your PC for your normal work flows but have this platform built over it that ties together the collaboration tech? Do you think that feels more uniform to the user or just more cumbersome?", "edited": 1492197394.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What do you guys think about the Cisco TC series of devices. Where Android based OS allows a feel of centralization? You can have device input from your PC for your normal work flows but have this platform built over it that ties together the collaboration tech? Do you think that feels more uniform to the user or just more cumbersome?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dg9l9r6", "score_hidden": false, "stickied": false, "created": 1492225693.0, "created_utc": 1492196893.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9etac", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sinfuste", "parent_id": "t1_dg9bgf7", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "Agree. It takes real effort to keep an enterprise-wide set of procedures and culture for videoconferencing. It's very hard to have users understand when it is useful and when it is a waste of time for both them and the technicians. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agree. It takes real effort to keep an enterprise-wide set of procedures and culture for videoconferencing. It&amp;#39;s very hard to have users understand when it is useful and when it is a waste of time for both them and the technicians. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dg9etac", "score_hidden": false, "stickied": false, "created": 1492218083.0, "created_utc": 1492189283.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9bgf7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pdp10", "parent_id": "t1_dg8mmnp", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "&gt; So, what are the important parts that NEED to be seamless for clients to adopt and make them happy with a product?\n\nUnified contacts, single authentication, probably cross-device synchronization are the important things. If the flashy things are being emphasized it's mostly because sales is targeted at high-level decision makers and it's easy to demonstrate video conferencing, and probably still new to quite a few people.\n\nIt's about two decades since I first worked on enterprise video-conferencing systems and they're more common and less unreliable today, but not any more useful. Most video at most times is not a good use of bandwidth or people's time.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;So, what are the important parts that NEED to be seamless for clients to adopt and make them happy with a product?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Unified contacts, single authentication, probably cross-device synchronization are the important things. If the flashy things are being emphasized it&amp;#39;s mostly because sales is targeted at high-level decision makers and it&amp;#39;s easy to demonstrate video conferencing, and probably still new to quite a few people.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s about two decades since I first worked on enterprise video-conferencing systems and they&amp;#39;re more common and less unreliable today, but not any more useful. Most video at most times is not a good use of bandwidth or people&amp;#39;s time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dg9bgf7", "score_hidden": false, "stickied": false, "created": 1492214341.0, "created_utc": 1492185541.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mmnp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jeffdit", "parent_id": "t1_dg8l0hq", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "That is exactly what I'm talking about right. Even IT people see these technologies clunky and we are usually the most forgiving when it comes to learning user interfaces. So, what are the important parts that NEED to be seamless for clients to adopt and make them happy with a product? There is a lot of focus on quality of video/voice communications but sometimes that seems only skin deep. Centralized authentication and single number reach are just as important if not more. I've installed phone systems where users never touch their desk phone and businesses dont utilize 90% of the features that are in place. I am hoping to find materials on design of these collab systems that make them intuitive to the users.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is exactly what I&amp;#39;m talking about right. Even IT people see these technologies clunky and we are usually the most forgiving when it comes to learning user interfaces. So, what are the important parts that NEED to be seamless for clients to adopt and make them happy with a product? There is a lot of focus on quality of video/voice communications but sometimes that seems only skin deep. Centralized authentication and single number reach are just as important if not more. I&amp;#39;ve installed phone systems where users never touch their desk phone and businesses dont utilize 90% of the features that are in place. I am hoping to find materials on design of these collab systems that make them intuitive to the users.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dg8mmnp", "score_hidden": false, "stickied": false, "created": 1492165654.0, "created_utc": 1492136854.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_659f4g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_659f4g", "likes": null, "replies": "", "user_reports": [], "id": "dg9b966", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vtbrian", "parent_id": "t1_dg8zdw3", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "I don't think they've really broke Acano.  Only real gripe I've seen was that people liked their hardware offering but Cisco definitely wasn't going to have a separate hardware offering for one product.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think they&amp;#39;ve really broke Acano.  Only real gripe I&amp;#39;ve seen was that people liked their hardware offering but Cisco definitely wasn&amp;#39;t going to have a separate hardware offering for one product.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dg9b966", "score_hidden": false, "stickied": false, "created": 1492214107.0, "created_utc": 1492185307.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zdw3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sinfuste", "parent_id": "t1_dg8l0hq", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "According to my calculations, Cisco will get it right in about 30 years, when they have bought and screwed up about the same amount of great products from other companies. \n\nThey recently bought the kickass integrated Acano solution and they are already breaking it trying to find the best way to sell the maximum amount of servers and licenses. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;According to my calculations, Cisco will get it right in about 30 years, when they have bought and screwed up about the same amount of great products from other companies. &lt;/p&gt;\n\n&lt;p&gt;They recently bought the kickass integrated Acano solution and they are already breaking it trying to find the best way to sell the maximum amount of servers and licenses. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dg8zdw3", "score_hidden": false, "stickied": false, "created": 1492193700.0, "created_utc": 1492164900.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8l0hq", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "vlan-whisperer", "parent_id": "t3_659f4g", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "So voice, video, IM'ing, texting, e-mailing, conferencing (voice, video, desktop/screen share) are the main components of collaboration in the business environment.  \n\nThe trend is to try to offer all of these services integrated into one platform, managed under a single, centralized application.  That's \"Unified Capabilities\" or UC (often incorrectly called unified communications.)\n\nTo me no one out there really offers a viable product that truly does all in one.  Take Cisco's UC portfolio for example.  Each one of those components listed above is basically a separate product you have to buy, and then you have to buy Prime to manage it all in one place.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So voice, video, IM&amp;#39;ing, texting, e-mailing, conferencing (voice, video, desktop/screen share) are the main components of collaboration in the business environment.  &lt;/p&gt;\n\n&lt;p&gt;The trend is to try to offer all of these services integrated into one platform, managed under a single, centralized application.  That&amp;#39;s &amp;quot;Unified Capabilities&amp;quot; or UC (often incorrectly called unified communications.)&lt;/p&gt;\n\n&lt;p&gt;To me no one out there really offers a viable product that truly does all in one.  Take Cisco&amp;#39;s UC portfolio for example.  Each one of those components listed above is basically a separate product you have to buy, and then you have to buy Prime to manage it all in one place.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dg8l0hq", "score_hidden": false, "stickied": false, "created": 1492163384.0, "created_utc": 1492134584.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_659f4g", "likes": null, "replies": "", "user_reports": [], "id": "dg8p19g", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Azarias59", "parent_id": "t3_659f4g", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "I think you misspelled your flair", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you misspelled your flair&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dg8p19g", "score_hidden": false, "stickied": false, "created": 1492169234.0, "created_utc": 1492140434.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]