[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "networking", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Like the title says, in a few weeks I&amp;#39;m making the move from being a Systems Engineer for a MSP to a Level 1 network engineer at a somewhat large healthcare organization. I&amp;#39;m going from being a jack of all trades (Servers, workstations, automation, networking, databases) to just networking. They have all of their departments siloed out into networking, security, servers, applications, and desktop support.&lt;/p&gt;\n\n&lt;p&gt;From the sound of it, my job will pretty much entail rolling upgrades, troubleshooting after the help desk escalates, and edge config changes. I&amp;#39;ve previously done all the course work for a CCNA - Routing and Switching, done a good bit of network support in the past, and my current MSP does work for a lot of small health care companies, so I&amp;#39;m familiar with the standards. They say they also have a lab with at least one piece of equipment matching anything deployed for any testing before config changes. Between the two jobs I&amp;#39;m also going to take a two week break to recharge, and refresh knowledge.&lt;/p&gt;\n\n&lt;p&gt;Basically, I&amp;#39;m kind of wondering, are there any gotchas I should really be watching for in this move, that I might not really expect. I&amp;#39;ve never completely specialized in networking before, and the closest I&amp;#39;d gotten was a three month stretch where about half of my job was equipment replacement and config.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Like the title says, in a few weeks I'm making the move from being a Systems Engineer for a MSP to a Level 1 network engineer at a somewhat large healthcare organization. I'm going from being a jack of all trades (Servers, workstations, automation, networking, databases) to just networking. They have all of their departments siloed out into networking, security, servers, applications, and desktop support.\n\nFrom the sound of it, my job will pretty much entail rolling upgrades, troubleshooting after the help desk escalates, and edge config changes. I've previously done all the course work for a CCNA - Routing and Switching, done a good bit of network support in the past, and my current MSP does work for a lot of small health care companies, so I'm familiar with the standards. They say they also have a lab with at least one piece of equipment matching anything deployed for any testing before config changes. Between the two jobs I'm also going to take a two week break to recharge, and refresh knowledge.\n\nBasically, I'm kind of wondering, are there any gotchas I should really be watching for in this move, that I might not really expect. I've never completely specialized in networking before, and the closest I'd gotten was a three month stretch where about half of my job was equipment replacement and config.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65d1zo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "JL421", "saved": false, "mod_reports": [], "name": "t3_65d1zo", "subreddit_name_prefixed": "r/networking", "approved_by": null, "over_18": false, "domain": "self.networking", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qkaf", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/networking/comments/65d1zo/moving_from_msp_systems_engineer_to_large/", "num_reports": null, "locked": false, "stickied": false, "created": 1492211333.0, "url": "https://www.reddit.com/r/networking/comments/65d1zo/moving_from_msp_systems_engineer_to_large/", "author_flair_text": null, "quarantine": false, "title": "Moving from MSP Systems Engineer to Large Healthcare Network Engineer", "created_utc": 1492182533.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_65d1zo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_65d1zo", "likes": null, "replies": "", "user_reports": [], "id": "dgbb6jr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "vlan-whisperer", "parent_id": "t1_dg9p0l4", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "You're describing pretty much any corporate network outside of provider/carrier nets.  If you're in an environment where the network isn't the top product your company is delivering, it's gonna be a similar situation, to varying extremes of course.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re describing pretty much any corporate network outside of provider/carrier nets.  If you&amp;#39;re in an environment where the network isn&amp;#39;t the top product your company is delivering, it&amp;#39;s gonna be a similar situation, to varying extremes of course.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dgbb6jr", "score_hidden": false, "stickied": false, "created": 1492326040.0, "created_utc": 1492297240.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_65d1zo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_65d1zo", "likes": null, "replies": "", "user_reports": [], "id": "dgdk1fn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ariesgeek", "parent_id": "t1_dgbe65j", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "Your words need to be chosen carefully. Regardless of your intentions, if you accidentally insult them or make them feel as though they are not right or they are not important, it's your ass. Always make sure they feel that their problem is the priority and that what they tell you is 100% correct and accurate. If they tell you at 3:30am that you need to decrease the mtu on your wireless access points to 1479, thank them for the suggestion and tell them you will put in a change request to make that change and will look for other possible solutions while waiting for approval. Once fixed, you're not sure which change fixed the problem. It could have been the mtu change (that you didn't make) or it could have been the fact that storage team finished with their scheduled maintenance on this particular array that was clearly communicated weeks in advance.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your words need to be chosen carefully. Regardless of your intentions, if you accidentally insult them or make them feel as though they are not right or they are not important, it&amp;#39;s your ass. Always make sure they feel that their problem is the priority and that what they tell you is 100% correct and accurate. If they tell you at 3:30am that you need to decrease the mtu on your wireless access points to 1479, thank them for the suggestion and tell them you will put in a change request to make that change and will look for other possible solutions while waiting for approval. Once fixed, you&amp;#39;re not sure which change fixed the problem. It could have been the mtu change (that you didn&amp;#39;t make) or it could have been the fact that storage team finished with their scheduled maintenance on this particular array that was clearly communicated weeks in advance.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dgdk1fn", "score_hidden": false, "stickied": false, "created": 1492468786.0, "created_utc": 1492439986.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbe65j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mythosmc", "parent_id": "t1_dg9p0l4", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "Mind elaborating on or giving tips on how to deal with physicians/surgeons?\n\nthanks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mind elaborating on or giving tips on how to deal with physicians/surgeons?&lt;/p&gt;\n\n&lt;p&gt;thanks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dgbe65j", "score_hidden": false, "stickied": false, "created": 1492330254.0, "created_utc": 1492301454.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_65d1zo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_65d1zo", "likes": null, "replies": "", "user_reports": [], "id": "dgdk4hh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ariesgeek", "parent_id": "t1_dgboirg", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "Yeah, I know. That was a horrible Aerosmith song.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I know. That was a horrible Aerosmith song.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dgdk4hh", "score_hidden": false, "stickied": false, "created": 1492468897.0, "created_utc": 1492440097.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgboirg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "UDP4789", "parent_id": "t1_dg9p0l4", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "Lol it's good you aren't jaded. 😂😃", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol it&amp;#39;s good you aren&amp;#39;t jaded. 😂😃&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dgboirg", "score_hidden": false, "stickied": false, "created": 1492345766.0, "created_utc": 1492316966.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9p0l4", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "ariesgeek", "parent_id": "t3_65d1zo", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "You won't be a jack-of-all-trades for long.  Expect to get very specialized.  Your department will be understaffed despite consisting of 15 to 20 extremely busy network engineers.  You won't just be a network guy.  You might be a wireless guy.  Or a VPN guy.  Or the poor young sap who does physical installations.  Oh..  But don't expect to be a routing / switching guy.  Those guys won't retire for at least another 10 years.\n\nThat said, you won't have time to do your actual job.  You will be putting out fires more than anything else.  Why?  I'll let you figure that out for yourself, but will tell you this:  Get used to seeing /20 and /21, and on devices that are running deferred code revs.  You can't have the downtime window you requested to upgrade code.  Sorry.  Find another way to fix the problem that will be non-disruptive.\n\nNo downtime, scheduled or otherwise.\n\nYou will have a change control PROCESS in place that is built around a TOOL that ceased to exist 10 years ago and is managed by those who honestly just don't understand the realities of what your job entails.  This will prevent you from getting anything done.  Don't try to circumvent the process.  Because that will be the one time when you do a \"switchport allowed vlan 123\" instead of \"switchport allowed vlan add 123\".  But it's okay, because you're not a manager, so you won't be fired.  But you screwed up, and it will not be forgotten.\n\nZero downtime.  Not even scheduled.  Sorry, find another, non-disruptive way to do it.\n\nDon't like the way the network has been architected?  Or the way a process works?  Suck it up and deal with it.  It's how they've always done it.  Don't question that.  Just don't.  Trust me.\n\nAlong those same lines, avoid physicians, especially surgeons.  Stay away from them until you fully understand how to talk to them.  If you piss them off, you may wind up without a job, even if you're not a manager.  Seriously.\n\nOh yeah.  No downtime.  They fear downtime.\n\nOn the plus side, expect amazing benefits.  Everyone has been there for 20 to 30 years, and there's a reason for it.  If you are a match for their culture, you will be as well.  The pay isn't top-notch, but it's on the higher end of the typical salary range.  Obey the golden rule, and you will always have job security.  YOU will be valued as a human being.  It may not feel like it most of the time, but when things are at their worst, you will be reminded of it.  You will be given a high amount of autonomy and accountability.  Don't take advantage of that, and you will ultimately earn a high amount of respect among your peers and bosses.  Over time, you will realize that your job has REAL meaning. \n You might even find that you wound up helping the same physician who saved your son's life.\n\nSource:  15+ years as a Sr. Network Engineer for a health care system that consists of about 30 hospitals and a few hundred \"branch locations\" (physician practices, urgent care facilities, etc).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You won&amp;#39;t be a jack-of-all-trades for long.  Expect to get very specialized.  Your department will be understaffed despite consisting of 15 to 20 extremely busy network engineers.  You won&amp;#39;t just be a network guy.  You might be a wireless guy.  Or a VPN guy.  Or the poor young sap who does physical installations.  Oh..  But don&amp;#39;t expect to be a routing / switching guy.  Those guys won&amp;#39;t retire for at least another 10 years.&lt;/p&gt;\n\n&lt;p&gt;That said, you won&amp;#39;t have time to do your actual job.  You will be putting out fires more than anything else.  Why?  I&amp;#39;ll let you figure that out for yourself, but will tell you this:  Get used to seeing /20 and /21, and on devices that are running deferred code revs.  You can&amp;#39;t have the downtime window you requested to upgrade code.  Sorry.  Find another way to fix the problem that will be non-disruptive.&lt;/p&gt;\n\n&lt;p&gt;No downtime, scheduled or otherwise.&lt;/p&gt;\n\n&lt;p&gt;You will have a change control PROCESS in place that is built around a TOOL that ceased to exist 10 years ago and is managed by those who honestly just don&amp;#39;t understand the realities of what your job entails.  This will prevent you from getting anything done.  Don&amp;#39;t try to circumvent the process.  Because that will be the one time when you do a &amp;quot;switchport allowed vlan 123&amp;quot; instead of &amp;quot;switchport allowed vlan add 123&amp;quot;.  But it&amp;#39;s okay, because you&amp;#39;re not a manager, so you won&amp;#39;t be fired.  But you screwed up, and it will not be forgotten.&lt;/p&gt;\n\n&lt;p&gt;Zero downtime.  Not even scheduled.  Sorry, find another, non-disruptive way to do it.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t like the way the network has been architected?  Or the way a process works?  Suck it up and deal with it.  It&amp;#39;s how they&amp;#39;ve always done it.  Don&amp;#39;t question that.  Just don&amp;#39;t.  Trust me.&lt;/p&gt;\n\n&lt;p&gt;Along those same lines, avoid physicians, especially surgeons.  Stay away from them until you fully understand how to talk to them.  If you piss them off, you may wind up without a job, even if you&amp;#39;re not a manager.  Seriously.&lt;/p&gt;\n\n&lt;p&gt;Oh yeah.  No downtime.  They fear downtime.&lt;/p&gt;\n\n&lt;p&gt;On the plus side, expect amazing benefits.  Everyone has been there for 20 to 30 years, and there&amp;#39;s a reason for it.  If you are a match for their culture, you will be as well.  The pay isn&amp;#39;t top-notch, but it&amp;#39;s on the higher end of the typical salary range.  Obey the golden rule, and you will always have job security.  YOU will be valued as a human being.  It may not feel like it most of the time, but when things are at their worst, you will be reminded of it.  You will be given a high amount of autonomy and accountability.  Don&amp;#39;t take advantage of that, and you will ultimately earn a high amount of respect among your peers and bosses.  Over time, you will realize that your job has REAL meaning. \n You might even find that you wound up helping the same physician who saved your son&amp;#39;s life.&lt;/p&gt;\n\n&lt;p&gt;Source:  15+ years as a Sr. Network Engineer for a health care system that consists of about 30 hospitals and a few hundred &amp;quot;branch locations&amp;quot; (physician practices, urgent care facilities, etc).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dg9p0l4", "score_hidden": false, "stickied": false, "created": 1492230198.0, "created_utc": 1492201398.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_65d1zo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_65d1zo", "likes": null, "replies": "", "user_reports": [], "id": "dg9p3km", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Cheeze_It", "parent_id": "t1_dg9g8zn", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "Everything that is said above. EVERYTHING.\n\n&gt;  In my experience, learning to focus more on your own responsibilities while trying to accept that other parts of the organization have their own responsibilities and that they'll almost certainly be doing things that you think are \"less than optimal\" (i.e. stupid)\n\nThis has been my struggle now for 8 years.....enough to make me want to literally work blue collar/fast food jobs and just not give a fack.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everything that is said above. EVERYTHING.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In my experience, learning to focus more on your own responsibilities while trying to accept that other parts of the organization have their own responsibilities and that they&amp;#39;ll almost certainly be doing things that you think are &amp;quot;less than optimal&amp;quot; (i.e. stupid)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This has been my struggle now for 8 years.....enough to make me want to literally work blue collar/fast food jobs and just not give a fack.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dg9p3km", "score_hidden": false, "stickied": false, "created": 1492230299.0, "created_utc": 1492201499.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_65d1zo", "likes": null, "replies": "", "user_reports": [], "id": "dgdk6cy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ariesgeek", "parent_id": "t1_dg9g8zn", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "This.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dgdk6cy", "score_hidden": false, "stickied": false, "created": 1492468965.0, "created_utc": 1492440165.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9g8zn", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "djdawson", "parent_id": "t3_65d1zo", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "Large organizations tend to be more process oriented, so don't be surprised if there are ITIL-like things you have to deal with.  I'd also expect such an organization to leverage some amount of automation in their network, at least for monitoring, so ramping up your scripting skills (often Python) may also be useful.  Finally, you'll probably have to develop some stress-management skills to help deal with the frustrations that come with most large organizations.  In my experience, learning to focus more on your own responsibilities while trying to accept that other parts of the organization have their own responsibilities and that they'll almost certainly be doing things that you think are \"less than optimal\" (i.e. stupid).  Perhaps they have processes that allow you to provide constructive input, but I'm guessing not (few large organizations do).\n\nIn general, try to get as much experience out of the new job as you can, and take satisfaction in the things you're able to do to help the organization be successful.\n\nGood luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Large organizations tend to be more process oriented, so don&amp;#39;t be surprised if there are ITIL-like things you have to deal with.  I&amp;#39;d also expect such an organization to leverage some amount of automation in their network, at least for monitoring, so ramping up your scripting skills (often Python) may also be useful.  Finally, you&amp;#39;ll probably have to develop some stress-management skills to help deal with the frustrations that come with most large organizations.  In my experience, learning to focus more on your own responsibilities while trying to accept that other parts of the organization have their own responsibilities and that they&amp;#39;ll almost certainly be doing things that you think are &amp;quot;less than optimal&amp;quot; (i.e. stupid).  Perhaps they have processes that allow you to provide constructive input, but I&amp;#39;m guessing not (few large organizations do).&lt;/p&gt;\n\n&lt;p&gt;In general, try to get as much experience out of the new job as you can, and take satisfaction in the things you&amp;#39;re able to do to help the organization be successful.&lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dg9g8zn", "score_hidden": false, "stickied": false, "created": 1492219735.0, "created_utc": 1492190935.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_65d1zo", "likes": null, "replies": "", "user_reports": [], "id": "dg9bgx7", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "bobdawonderweasel", "parent_id": "t3_65d1zo", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "In healthcare welcome to HIPAA regulations.  I'm on mobile otherwise I'd link a few things for you.  HIPAA Hitech is what you most likely be dealing with.  Good luck on the new job!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In healthcare welcome to HIPAA regulations.  I&amp;#39;m on mobile otherwise I&amp;#39;d link a few things for you.  HIPAA Hitech is what you most likely be dealing with.  Good luck on the new job!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dg9bgx7", "score_hidden": false, "stickied": false, "created": 1492214357.0, "created_utc": 1492185557.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_65d1zo", "likes": null, "replies": "", "user_reports": [], "id": "dg9m7b0", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Jeffdit", "parent_id": "t3_65d1zo", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "Im just getting finished with a large wifi deployment on a major health care organization. Working in hospitals is an extremely people orientated environment to work in. There are so many processes and hands involved in everything that it is important to know who to talk to to get any particular task done and to have a good working relationship with these people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im just getting finished with a large wifi deployment on a major health care organization. Working in hospitals is an extremely people orientated environment to work in. There are so many processes and hands involved in everything that it is important to know who to talk to to get any particular task done and to have a good working relationship with these people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dg9m7b0", "score_hidden": false, "stickied": false, "created": 1492226821.0, "created_utc": 1492198021.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_65d1zo", "likes": null, "replies": "", "user_reports": [], "id": "dg9nriq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "nnichols", "parent_id": "t3_65d1zo", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "13 year healthcare network engineer here.  It's not too bad.  Most people mention HIPAA, but honestly I don't find it to be much trouble to work with.  Be prepared to deal with really lousy clinical devices and their vendors.  Seriously.  The network side of most clinical technologies moves at a glacial pace, and some devices are kept in production for a very long time.\n\nStability is king.  Over time it is becoming harder to fall back to paper in the case of an outage.  Down windows are harder to come by or not at all without some political back-and-forth.  EMR vendors are the big gorilla app-wise.  For example, if Epic or Cerner prescribes that something should be done a certain way, expect that you will probably be doing it that way or have to do quite a bit of work to convince folks to do otherwise.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;13 year healthcare network engineer here.  It&amp;#39;s not too bad.  Most people mention HIPAA, but honestly I don&amp;#39;t find it to be much trouble to work with.  Be prepared to deal with really lousy clinical devices and their vendors.  Seriously.  The network side of most clinical technologies moves at a glacial pace, and some devices are kept in production for a very long time.&lt;/p&gt;\n\n&lt;p&gt;Stability is king.  Over time it is becoming harder to fall back to paper in the case of an outage.  Down windows are harder to come by or not at all without some political back-and-forth.  EMR vendors are the big gorilla app-wise.  For example, if Epic or Cerner prescribes that something should be done a certain way, expect that you will probably be doing it that way or have to do quite a bit of work to convince folks to do otherwise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dg9nriq", "score_hidden": false, "stickied": false, "created": 1492228692.0, "created_utc": 1492199892.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qkaf", "removal_reason": null, "link_id": "t3_65d1zo", "likes": null, "replies": "", "user_reports": [], "id": "dg9a8kl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "elaboratedreams", "parent_id": "t3_65d1zo", "subreddit_name_prefixed": "r/networking", "controversiality": 0, "body": "I have nothing useful for you, but good luck with your new job!  I hope it is everything you're looking for.  :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have nothing useful for you, but good luck with your new job!  I hope it is everything you&amp;#39;re looking for.  :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "networking", "name": "t1_dg9a8kl", "score_hidden": false, "stickied": false, "created": 1492212928.0, "created_utc": 1492184128.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]