[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am increasingly concerned with the direction the US is going. It&amp;#39;s no secret at this point that money buys political influence in America and I can&amp;#39;t see that changing anytime soon. For now things are okay because the rich need the poor to generate wealth for them, but automation will change this. There will be a large portion of the population who are poor, unskilled, and incapable of creating value for companies. Even as the need for a greater social safety net and universal basic income become blatantly obvious, business interests and the rich will ensure that this does not happen. Any resistance the poor may put up due to not being able to afford food, healthcare, and other necessities would quickly be crushed with automated security systems. In other civil rights movements, the poor putting financial pressure on businesses to change their stances played a key role, now it will be impossible. The law and more advanced technology will protect the wealthy from any financial consequences of their cruelty. Private prison companies will continue to successfully lobby for more policies to imprison the poor, taking away their right to any remaining political power they had in the process. The 1% (super rich) and the 14% (well off) will live out their lives in a utopian society driven by automation while everyone else gets by on inadequate government programs or works the few shitty remaining low level jobs that have not been automated, slaves to the rich that they will view much like their machines. I see this as the endgame in an America where money has such a powerful influence over politics. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;This is a footnote from the CMV moderators. We&amp;#39;d like to remind you of a couple of things. Firstly, please&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules\"&gt;read through our rules&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting\"&gt;downvotes don&amp;#39;t change views&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;! Any questions or concerns? Feel free to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/message/compose?to=/r/changemyview\"&gt;message us&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;Happy CMVing!&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am increasingly concerned with the direction the US is going. It's no secret at this point that money buys political influence in America and I can't see that changing anytime soon. For now things are okay because the rich need the poor to generate wealth for them, but automation will change this. There will be a large portion of the population who are poor, unskilled, and incapable of creating value for companies. Even as the need for a greater social safety net and universal basic income become blatantly obvious, business interests and the rich will ensure that this does not happen. Any resistance the poor may put up due to not being able to afford food, healthcare, and other necessities would quickly be crushed with automated security systems. In other civil rights movements, the poor putting financial pressure on businesses to change their stances played a key role, now it will be impossible. The law and more advanced technology will protect the wealthy from any financial consequences of their cruelty. Private prison companies will continue to successfully lobby for more policies to imprison the poor, taking away their right to any remaining political power they had in the process. The 1% (super rich) and the 14% (well off) will live out their lives in a utopian society driven by automation while everyone else gets by on inadequate government programs or works the few shitty remaining low level jobs that have not been automated, slaves to the rich that they will view much like their machines. I see this as the endgame in an America where money has such a powerful influence over politics. \n\n_____\n\n&gt; *This is a footnote from the CMV moderators. We'd like to remind you of a couple of things. Firstly, please* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64orrh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "DoctorHour", "saved": false, "mod_reports": [], "name": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/64orrh/cmv_americas_rich_will_kill_the_poor/", "num_reports": null, "locked": false, "stickied": false, "created": 1491914316.0, "url": "https://www.reddit.com/r/changemyview/comments/64orrh/cmv_americas_rich_will_kill_the_poor/", "author_flair_text": null, "quarantine": false, "title": "CMV: America's Rich Will Kill The Poor", "created_utc": 1491885516.0, "distinguished": null, "media": null, "upvote_ratio": 0.68, "num_comments": 39, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg3xli0", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "swearrengen", "parent_id": "t1_dg3wxw0", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Different business men aim to make a profit wherever they can. A bigger market allows more profits to be made than a smaller market.\n\nThere are no billionaires in existence, I don't think, that sell only to other billionaires as their market. There are not enough billionaires! You would have to have a very unusual and rare item to sell to become a billionaire this way... e.g. Tickets to the moon for $100 million each, or something like that. Most billionaires rely on the existence of a large financially healthy middle class. E.g. selling software or a computer at $500 each - you need tens of millions of buyers to become a billionaire.\n\nAnd a billion spoons at 1 cent profit equals 1 luxury-yacht at a billion cents profit. \n\nBusinessmen with high end expensive niche products wish there were *more* rich people that can afford those products.\n\nAutomation first allows very physically draining work to be done easier and cheaper - like mining and farming. Then another entrepreneur comes along and makes an even better machine that automates it further, because if you can automate better than the next businessman, you can win market share by offering a cheaper product and make more profits. This competition makes everything cheaper and benefits the poor greatly.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Different business men aim to make a profit wherever they can. A bigger market allows more profits to be made than a smaller market.&lt;/p&gt;\n\n&lt;p&gt;There are no billionaires in existence, I don&amp;#39;t think, that sell only to other billionaires as their market. There are not enough billionaires! You would have to have a very unusual and rare item to sell to become a billionaire this way... e.g. Tickets to the moon for $100 million each, or something like that. Most billionaires rely on the existence of a large financially healthy middle class. E.g. selling software or a computer at $500 each - you need tens of millions of buyers to become a billionaire.&lt;/p&gt;\n\n&lt;p&gt;And a billion spoons at 1 cent profit equals 1 luxury-yacht at a billion cents profit. &lt;/p&gt;\n\n&lt;p&gt;Businessmen with high end expensive niche products wish there were &lt;em&gt;more&lt;/em&gt; rich people that can afford those products.&lt;/p&gt;\n\n&lt;p&gt;Automation first allows very physically draining work to be done easier and cheaper - like mining and farming. Then another entrepreneur comes along and makes an even better machine that automates it further, because if you can automate better than the next businessman, you can win market share by offering a cheaper product and make more profits. This competition makes everything cheaper and benefits the poor greatly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg3xli0", "score_hidden": false, "stickied": false, "created": 1491919020.0, "created_utc": 1491890220.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": "", "user_reports": [], "id": "dg46ll3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Freevoulous", "parent_id": "t1_dg3wxw0", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Wouldn't the 15% just use automation to create things for themselves and to trade with other members of their class?\n\nsome, small minority does that, and protects their profit jalously. The rest of the rich is only rich as long as they sell cheap stuff to average people. They cannot simply re-do their entire business, especially when faced with stiff competition.\n\n&gt; This will immediately put the rich who get their wealth from mass production against the rich who get their wealth from elite services and detail production. You'll see micro-loan bankers fight tooth and claw again investment bankers, or rent-house developers vs mansion developers due to conflict of interest. The first group will effortlessly win due to sheer numbers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Wouldn&amp;#39;t the 15% just use automation to create things for themselves and to trade with other members of their class?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;some, small minority does that, and protects their profit jalously. The rest of the rich is only rich as long as they sell cheap stuff to average people. They cannot simply re-do their entire business, especially when faced with stiff competition.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;This will immediately put the rich who get their wealth from mass production against the rich who get their wealth from elite services and detail production. You&amp;#39;ll see micro-loan bankers fight tooth and claw again investment bankers, or rent-house developers vs mansion developers due to conflict of interest. The first group will effortlessly win due to sheer numbers.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg46ll3", "score_hidden": false, "stickied": false, "created": 1491942575.0, "created_utc": 1491913775.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3wxw0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "DoctorHour", "parent_id": "t1_dg3wid6", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Okay, this is a point I see brought up all the time and I don't quite get it. Wouldn't the 15% just use automation to create things for themselves and to trade with other members of their class? Why do the rich need a large diverse base of people to buy products rather than just a smaller higher paying base? A lot of companies in the US are sifting their business model away from selling to the poor and middle classes and instead making more money selling to the rich. Rising prices and a greater focus on high end product in real estate and theme parks for example.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, this is a point I see brought up all the time and I don&amp;#39;t quite get it. Wouldn&amp;#39;t the 15% just use automation to create things for themselves and to trade with other members of their class? Why do the rich need a large diverse base of people to buy products rather than just a smaller higher paying base? A lot of companies in the US are sifting their business model away from selling to the poor and middle classes and instead making more money selling to the rich. Rising prices and a greater focus on high end product in real estate and theme parks for example.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg3wxw0", "score_hidden": false, "stickied": false, "created": 1491917626.0, "created_utc": 1491888826.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg3wid6", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "swearrengen", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The rich need the poor as buyers of goods produced by their automation!\n\nThe rich compete with each other to automate better and cheaper - so that they can gain larger market share of buyers.\n\nSo as the poor's wages decrease - so does the goods they are buying. They benefit too!\n\nSo long as anyone (rich or poor) is legally allowed to offer a cheaper/better product, automation is nothing to worry about.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The rich need the poor as buyers of goods produced by their automation!&lt;/p&gt;\n\n&lt;p&gt;The rich compete with each other to automate better and cheaper - so that they can gain larger market share of buyers.&lt;/p&gt;\n\n&lt;p&gt;So as the poor&amp;#39;s wages decrease - so does the goods they are buying. They benefit too!&lt;/p&gt;\n\n&lt;p&gt;So long as anyone (rich or poor) is legally allowed to offer a cheaper/better product, automation is nothing to worry about.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg3wid6", "score_hidden": false, "stickied": false, "created": 1491916770.0, "created_utc": 1491887970.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": "", "user_reports": [], "id": "dg3xrxm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Havenkeld", "parent_id": "t1_dg3wsqp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Part of Obamacare is all about constituents. Politicians have to appeal to their voters, and in this case the issue was far more than just about healthcare, it was about a president people were freaked out about in general for many reasons - reasons I wouldn't defend, but it's not a case where it's neatly top down. Supporting anything Obama became politically unfeasible for most republicans. And to be fair, a few republicans tried to work with him but were harshly treated by their party - including voters as a result. They have to concern themselves with being primaried. To an extent they're between a rock and hard place on many issues. There's a really interesting Frontline documentary called \"Divided States of America\" that gives a good look at some of the internal politics that I'd recommend. Then there's also, well, the only way to put it nicely is just \"Lieberman\". \n\nIt's not as clear cut as the upper class controlling the lower class opinion. It can actually in some cases be lower class pressure on politicians which causes political issues. And some of that is more due to talk radio and internet media rather than mainstream media.\n\nAs for the military, I think you're assuming a lot about how AI and automation will evolve that we aren't at all certain about yet. \n\nThe particular directions in multiple complex areas the country and culture would have to go in are just way too particular for your bleak future to be a likely one, I think.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Part of Obamacare is all about constituents. Politicians have to appeal to their voters, and in this case the issue was far more than just about healthcare, it was about a president people were freaked out about in general for many reasons - reasons I wouldn&amp;#39;t defend, but it&amp;#39;s not a case where it&amp;#39;s neatly top down. Supporting anything Obama became politically unfeasible for most republicans. And to be fair, a few republicans tried to work with him but were harshly treated by their party - including voters as a result. They have to concern themselves with being primaried. To an extent they&amp;#39;re between a rock and hard place on many issues. There&amp;#39;s a really interesting Frontline documentary called &amp;quot;Divided States of America&amp;quot; that gives a good look at some of the internal politics that I&amp;#39;d recommend. Then there&amp;#39;s also, well, the only way to put it nicely is just &amp;quot;Lieberman&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not as clear cut as the upper class controlling the lower class opinion. It can actually in some cases be lower class pressure on politicians which causes political issues. And some of that is more due to talk radio and internet media rather than mainstream media.&lt;/p&gt;\n\n&lt;p&gt;As for the military, I think you&amp;#39;re assuming a lot about how AI and automation will evolve that we aren&amp;#39;t at all certain about yet. &lt;/p&gt;\n\n&lt;p&gt;The particular directions in multiple complex areas the country and culture would have to go in are just way too particular for your bleak future to be a likely one, I think.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg3xrxm", "score_hidden": false, "stickied": false, "created": 1491919422.0, "created_utc": 1491890622.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3wsqp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DoctorHour", "parent_id": "t1_dg3vwql", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I was pretty dramatic in my post I must admit! I really hope what you are saying about the upper classes not being morally okay with this, but then again look at the support for repealing Obamacare, something which would kill millions. The government just needs to be corrupt enough and the public just needs to be stupid/controlled enough. Do you have any evidence of this morality ratio?\n\nThe military won't be made up of many people, it will just be people controlling machines which operate independently using AI for the most part. \n\nI don't think the poor would be genocidally murdered or starved to death, just systematically oppressed more and more and potentially imprisoned on a massive scale.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was pretty dramatic in my post I must admit! I really hope what you are saying about the upper classes not being morally okay with this, but then again look at the support for repealing Obamacare, something which would kill millions. The government just needs to be corrupt enough and the public just needs to be stupid/controlled enough. Do you have any evidence of this morality ratio?&lt;/p&gt;\n\n&lt;p&gt;The military won&amp;#39;t be made up of many people, it will just be people controlling machines which operate independently using AI for the most part. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think the poor would be genocidally murdered or starved to death, just systematically oppressed more and more and potentially imprisoned on a massive scale.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg3wsqp", "score_hidden": false, "stickied": false, "created": 1491917342.0, "created_utc": 1491888542.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg3vwql", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Havenkeld", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "First of all, a substantial portion of the 1% and 14% would not be morally okay with this. Some of them come from lower class backgrounds. They're not monsters, just a bit detached in some cases. There are a few individuals you could probably point to as particularly psychopathic but it's not enough that something this dramatic would be allowed. \n\nSecond, it's not even in their self-interest to allow 85% of the population to starve. Automation won't destroy all jobs that rich people don't want to do. Many jobs that will still be around post-automation, including jobs related to building, maintaining, improving automation related stuff. A substantial portion of the population will still be valued for labor.\n\nThird, automated security systems aren't going to be enough to stop 85% of the population from taking issue with starving to death. And our military isn't made up of rich people. Our whole political system makes this highly unlikely considering we're a democracy. People are already pushing for ideas like socialized healthcare and UBI. We also don't have that much of a food issue, and people can eat without money. \n\nFourth, the US has tons of unused land, overpopulation isn't happening. We're clustering around particularly developed cities, but with more automation we may spread and expand cities faster. If we're at the point where automated security systems can be so advanced and widespread, we're probably at the point where 3D printing and other technologies has allowed for cheaper/faster construction and infrastructure. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First of all, a substantial portion of the 1% and 14% would not be morally okay with this. Some of them come from lower class backgrounds. They&amp;#39;re not monsters, just a bit detached in some cases. There are a few individuals you could probably point to as particularly psychopathic but it&amp;#39;s not enough that something this dramatic would be allowed. &lt;/p&gt;\n\n&lt;p&gt;Second, it&amp;#39;s not even in their self-interest to allow 85% of the population to starve. Automation won&amp;#39;t destroy all jobs that rich people don&amp;#39;t want to do. Many jobs that will still be around post-automation, including jobs related to building, maintaining, improving automation related stuff. A substantial portion of the population will still be valued for labor.&lt;/p&gt;\n\n&lt;p&gt;Third, automated security systems aren&amp;#39;t going to be enough to stop 85% of the population from taking issue with starving to death. And our military isn&amp;#39;t made up of rich people. Our whole political system makes this highly unlikely considering we&amp;#39;re a democracy. People are already pushing for ideas like socialized healthcare and UBI. We also don&amp;#39;t have that much of a food issue, and people can eat without money. &lt;/p&gt;\n\n&lt;p&gt;Fourth, the US has tons of unused land, overpopulation isn&amp;#39;t happening. We&amp;#39;re clustering around particularly developed cities, but with more automation we may spread and expand cities faster. If we&amp;#39;re at the point where automated security systems can be so advanced and widespread, we&amp;#39;re probably at the point where 3D printing and other technologies has allowed for cheaper/faster construction and infrastructure. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg3vwql", "score_hidden": false, "stickied": false, "created": 1491915658.0, "created_utc": 1491886858.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": "", "user_reports": [], "id": "dg4dotz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "uyoos2uyoos2", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Your view of the future I think relies on the \"rich\" still being \"rich\" after they drive off all the \"poor\". The problem with that is how money works. \n\nIt used to be when you had a dollar that dollar was a note representing wealth you actually had - but was being kept somewhere else. It was an IOU essentially. After this it was just issue against a standard (gold and silver). \n\nThese days currency (as we tend to refer to it) is a function of its relationship to the whole. But not just this - it's also a function of currencies relationship to individual currency holders. \n\nIn effect - you are wealthy BECAUSE you have substantially MORE money than other people and not just because you have a certain amount of money. This is because goods are priced as a function of their potential earnings and the customer base as a whole. \n\nMore than likely, if there were some \"culling\" of the poor - as you say - the effect of this would effectively to reduce population size and would NOT remove poor people. More than likely if there is still market conditions in this new society a smaller poor class and smaller rich class would be created. \n\nTLDR; IF what you describe happened, prices of goods would change the dynamics would largely stay the same. \n\n ", "edited": 1491934334.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your view of the future I think relies on the &amp;quot;rich&amp;quot; still being &amp;quot;rich&amp;quot; after they drive off all the &amp;quot;poor&amp;quot;. The problem with that is how money works. &lt;/p&gt;\n\n&lt;p&gt;It used to be when you had a dollar that dollar was a note representing wealth you actually had - but was being kept somewhere else. It was an IOU essentially. After this it was just issue against a standard (gold and silver). &lt;/p&gt;\n\n&lt;p&gt;These days currency (as we tend to refer to it) is a function of its relationship to the whole. But not just this - it&amp;#39;s also a function of currencies relationship to individual currency holders. &lt;/p&gt;\n\n&lt;p&gt;In effect - you are wealthy BECAUSE you have substantially MORE money than other people and not just because you have a certain amount of money. This is because goods are priced as a function of their potential earnings and the customer base as a whole. &lt;/p&gt;\n\n&lt;p&gt;More than likely, if there were some &amp;quot;culling&amp;quot; of the poor - as you say - the effect of this would effectively to reduce population size and would NOT remove poor people. More than likely if there is still market conditions in this new society a smaller poor class and smaller rich class would be created. &lt;/p&gt;\n\n&lt;p&gt;TLDR; IF what you describe happened, prices of goods would change the dynamics would largely stay the same. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg4dotz", "score_hidden": false, "stickied": false, "created": 1491952070.0, "created_utc": 1491923270.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": "", "user_reports": [], "id": "dg46hqo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Freevoulous", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "self-quote:\n\n&gt;The vast, vast majority of the rich upper class get so by providing service to the common man. Usually, you don't get to be a billionaire by selling diamonds to other billionaires, but by selling burgers or cellphones to the Average Joe.\n\nFor the majority of the rich, it is of vital importance that the Average Joe has purchasing power to buy their product, even long after the machines take over and he becomes jobless. Without it, their business model will collapse and they know it.\n\nThis will immediately put the rich who get their wealth from mass production against the rich who get their wealth from elite services and detail production. You'll see micro-loan bankers fight tooth and claw again investment bankers, or rent-house developers vs mansion developers due to conflict of interest. The first group will effortlessly win due to sheer numbers.\n\nIn a 15-20 years you will start to see the super-rich owners of the mass production speak in favor of UBI, because without UBI their corporate business model has no chance of survival.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;self-quote:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The vast, vast majority of the rich upper class get so by providing service to the common man. Usually, you don&amp;#39;t get to be a billionaire by selling diamonds to other billionaires, but by selling burgers or cellphones to the Average Joe.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;For the majority of the rich, it is of vital importance that the Average Joe has purchasing power to buy their product, even long after the machines take over and he becomes jobless. Without it, their business model will collapse and they know it.&lt;/p&gt;\n\n&lt;p&gt;This will immediately put the rich who get their wealth from mass production against the rich who get their wealth from elite services and detail production. You&amp;#39;ll see micro-loan bankers fight tooth and claw again investment bankers, or rent-house developers vs mansion developers due to conflict of interest. The first group will effortlessly win due to sheer numbers.&lt;/p&gt;\n\n&lt;p&gt;In a 15-20 years you will start to see the super-rich owners of the mass production speak in favor of UBI, because without UBI their corporate business model has no chance of survival.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg46hqo", "score_hidden": false, "stickied": false, "created": 1491942382.0, "created_utc": 1491913582.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg4bx8j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "One_Winged_Rook", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Looking at the demographics, if the poor are in terribly shitty conditions... non-livable conditions... they have enough physical power to up-end all of society through violent means.\n\nWhile, yes, this is a very bleak outlook, in reality it is in the rich people's best interest to keep the poor happy *enough* that they won't commit wide acts of violence.\n\nThis explains the majority of modern history and automation doesn't change that dynamic in anyway. It just changes the poor's mode of income from crappy jobs to crappy welfare and other crappy social programs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Looking at the demographics, if the poor are in terribly shitty conditions... non-livable conditions... they have enough physical power to up-end all of society through violent means.&lt;/p&gt;\n\n&lt;p&gt;While, yes, this is a very bleak outlook, in reality it is in the rich people&amp;#39;s best interest to keep the poor happy &lt;em&gt;enough&lt;/em&gt; that they won&amp;#39;t commit wide acts of violence.&lt;/p&gt;\n\n&lt;p&gt;This explains the majority of modern history and automation doesn&amp;#39;t change that dynamic in anyway. It just changes the poor&amp;#39;s mode of income from crappy jobs to crappy welfare and other crappy social programs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg4bx8j", "score_hidden": false, "stickied": false, "created": 1491950035.0, "created_utc": 1491921235.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg3w1ai", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "john_gee", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Any resistance the poor may put up due to not being able to afford food, healthcare, and other necessities...\n\nYour premise here is that the rich need the poor as *labor* and when automation replaces that labor, then the poor can just cease to exist. But in order to be rich and stay rich, the rich don't just need labor, they need *consumers* to profit from. It's in the interest of the rich for the poor to always have at least enough money to buy things at Walmart. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Any resistance the poor may put up due to not being able to afford food, healthcare, and other necessities...&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Your premise here is that the rich need the poor as &lt;em&gt;labor&lt;/em&gt; and when automation replaces that labor, then the poor can just cease to exist. But in order to be rich and stay rich, the rich don&amp;#39;t just need labor, they need &lt;em&gt;consumers&lt;/em&gt; to profit from. It&amp;#39;s in the interest of the rich for the poor to always have at least enough money to buy things at Walmart. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg3w1ai", "score_hidden": false, "stickied": false, "created": 1491915892.0, "created_utc": 1491887092.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": "", "user_reports": [], "id": "dg5o3mq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Vicious43", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "As a robotic Engineer, I do have to say that the fear of robots taking all the jobs is never going to happen. Robots have the major issues of physical limitations and expense.\n\nThere's a reason that only heavy manufacturing uses robots, and even then, they only use robots in certain areas.\nA major reason is cost. The workhorse of the biggest robotics company in the U.S. Fanuc Robotics, is the P-250. The cost of a single robot, to include both robot cost and installation, is 300,000k a piece, and that's not including the piping, electrical work, PLC, and actual creation of the booth to put the robot it. The \"cheapest\" robot that they sell costs 120k for purchase and install. On top of this, these robots take a lot of maintenance work, robotic techs typically make 60k+ a year, and robotic engineers often make 80k+, so hiring people to maintain these robots is expensive. The maintenance itself can be very costly. Everything in robotics is marked up at insanely high prices, so replacing parts can get insanely pricey. I remember being shocked when told that the 1mm x 1mm x 2mm piece of aluminum I was holding cost $250 dollars. \nConsequently robots are only used where they are really needed, companies like GM mainly use robots for painting and welding.\nRobots aren't as nimble as people think as well, they're generally used for simple tasks. i.e. paint this car, move this part, weld this shut, because they have very limited dexterity in what they're able to do. The most expensive part of a robot is the Servomotor, and a big way to make robots capable of doing more tasks, is to add more of them, which of course leads back to the first problem.\nThis idea is nothing to be afraid of.\n\nAlso, here's the P-250 in action because it's cool https://www.youtube.com/watch?v=KMuXraKeS-c", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a robotic Engineer, I do have to say that the fear of robots taking all the jobs is never going to happen. Robots have the major issues of physical limitations and expense.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a reason that only heavy manufacturing uses robots, and even then, they only use robots in certain areas.\nA major reason is cost. The workhorse of the biggest robotics company in the U.S. Fanuc Robotics, is the P-250. The cost of a single robot, to include both robot cost and installation, is 300,000k a piece, and that&amp;#39;s not including the piping, electrical work, PLC, and actual creation of the booth to put the robot it. The &amp;quot;cheapest&amp;quot; robot that they sell costs 120k for purchase and install. On top of this, these robots take a lot of maintenance work, robotic techs typically make 60k+ a year, and robotic engineers often make 80k+, so hiring people to maintain these robots is expensive. The maintenance itself can be very costly. Everything in robotics is marked up at insanely high prices, so replacing parts can get insanely pricey. I remember being shocked when told that the 1mm x 1mm x 2mm piece of aluminum I was holding cost $250 dollars. \nConsequently robots are only used where they are really needed, companies like GM mainly use robots for painting and welding.\nRobots aren&amp;#39;t as nimble as people think as well, they&amp;#39;re generally used for simple tasks. i.e. paint this car, move this part, weld this shut, because they have very limited dexterity in what they&amp;#39;re able to do. The most expensive part of a robot is the Servomotor, and a big way to make robots capable of doing more tasks, is to add more of them, which of course leads back to the first problem.\nThis idea is nothing to be afraid of.&lt;/p&gt;\n\n&lt;p&gt;Also, here&amp;#39;s the P-250 in action because it&amp;#39;s cool &lt;a href=\"https://www.youtube.com/watch?v=KMuXraKeS-c\"&gt;https://www.youtube.com/watch?v=KMuXraKeS-c&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5o3mq", "score_hidden": false, "stickied": false, "created": 1492017909.0, "created_utc": 1491989109.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": "", "user_reports": [], "id": "dg48b1k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "davidthetechgeek", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Economy is the backbone of society. As long as there is money, there will be influence that money provides. No matter how you word it, unless everybody has the same amount of money, no more and no less, whatever you argue will remain the same. The problem with everybody having the same amount of money is that it becomes impossible for the economy to grow since there will be no motivation to work, since you cannot accumulate any money. If we just have the same amount of money, why work to produce anything? Nothing will be produced, we will have nothing, and we all either revolt or die. Business interests will always have an influence on society as well. Since business is what dictates literally everything we do, business will further always have an influence. With no business, corruption from the governmental monopoly ensues. It's a double edged sword. In regards to your private prison point, I do not understand this at all. Are you saying that private prisons will imprison people because they're poor? That will never happen, as long as our police system is government owned, as it is now. Private prisons have no, and will never have any authority over the people. They only take in prisoners. Your point about the super rich to well off living in a utopian society is in itself a utopian idea. Automation will never have a full takeover, people won't let that happen. Further, automation is expensive to transition to. Your idea is in the very, very, very far future at best. Income inequality drives the economy via competition, so removing that piece of income destroys the economy. We won't let that happen, which is why companies still employ people. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Economy is the backbone of society. As long as there is money, there will be influence that money provides. No matter how you word it, unless everybody has the same amount of money, no more and no less, whatever you argue will remain the same. The problem with everybody having the same amount of money is that it becomes impossible for the economy to grow since there will be no motivation to work, since you cannot accumulate any money. If we just have the same amount of money, why work to produce anything? Nothing will be produced, we will have nothing, and we all either revolt or die. Business interests will always have an influence on society as well. Since business is what dictates literally everything we do, business will further always have an influence. With no business, corruption from the governmental monopoly ensues. It&amp;#39;s a double edged sword. In regards to your private prison point, I do not understand this at all. Are you saying that private prisons will imprison people because they&amp;#39;re poor? That will never happen, as long as our police system is government owned, as it is now. Private prisons have no, and will never have any authority over the people. They only take in prisoners. Your point about the super rich to well off living in a utopian society is in itself a utopian idea. Automation will never have a full takeover, people won&amp;#39;t let that happen. Further, automation is expensive to transition to. Your idea is in the very, very, very far future at best. Income inequality drives the economy via competition, so removing that piece of income destroys the economy. We won&amp;#39;t let that happen, which is why companies still employ people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg48b1k", "score_hidden": false, "stickied": false, "created": 1491945297.0, "created_utc": 1491916497.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg45yfu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IlllIIIIIIlllll", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "What makes you think the automation will be so far out of the reach of everyday people? Smartphones are filled with amazing technology that would have been unfathomable even 20 years ago. Yet it's perfectly within reach of even the poor.\n\nCan you think of any examples of technology today that is able to put rich people so far ahead of poor people?\n\nEven if the poor have access to lesser technology, it's still something they can use to survive. Let's go forward 50 years into this society that you're thinking of. Why can't the poor just move to some uninhabited land far away from the rich and set up a parallel society. With the technology available to them they'll probably still have far better standards of living than even the rich today have.\n\nLastly I think the automation and unemployment fears are overblown. What does automation happening really mean? It means more income. Those rich people with automation have more money to spend on other things. They'll buy things they previously wouldn't have. Maybe they'll spend absurd amounts of money on artisinal cow milk produced by a \"poor\" person who owns only a single cow but treats that cow like a god in order to produce higher quality milk. We're already seeing similar things happen with the explosion of organic, and ethically sourced products.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What makes you think the automation will be so far out of the reach of everyday people? Smartphones are filled with amazing technology that would have been unfathomable even 20 years ago. Yet it&amp;#39;s perfectly within reach of even the poor.&lt;/p&gt;\n\n&lt;p&gt;Can you think of any examples of technology today that is able to put rich people so far ahead of poor people?&lt;/p&gt;\n\n&lt;p&gt;Even if the poor have access to lesser technology, it&amp;#39;s still something they can use to survive. Let&amp;#39;s go forward 50 years into this society that you&amp;#39;re thinking of. Why can&amp;#39;t the poor just move to some uninhabited land far away from the rich and set up a parallel society. With the technology available to them they&amp;#39;ll probably still have far better standards of living than even the rich today have.&lt;/p&gt;\n\n&lt;p&gt;Lastly I think the automation and unemployment fears are overblown. What does automation happening really mean? It means more income. Those rich people with automation have more money to spend on other things. They&amp;#39;ll buy things they previously wouldn&amp;#39;t have. Maybe they&amp;#39;ll spend absurd amounts of money on artisinal cow milk produced by a &amp;quot;poor&amp;quot; person who owns only a single cow but treats that cow like a god in order to produce higher quality milk. We&amp;#39;re already seeing similar things happen with the explosion of organic, and ethically sourced products.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg45yfu", "score_hidden": false, "stickied": false, "created": 1491941414.0, "created_utc": 1491912614.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": "", "user_reports": [], "id": "dg400p3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VigilantRESOLVE", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Where do you get 14% is well off? Top 1% is less than 400k, that't a good living but no where near millions. My family was in the 5% and we had our own struggles. Especially if you are self-employed. Paying both 7.5% of social security, paying a higher tax rate and reinvesting into their business. Starting their business a couple years before 2007-08. Now paying more money per year on health insurance than a mortgage on a decent house in a middle-class neighborhood, in Georgia for that matter. Parents trying to take their children on a single 5 day vacation. Putting us in 4-year universities, (in-state, hell I lived at home 3 of 4 years). My parents saving for retirement. I drive a 20 year old hand me down car, my other sibling doesn't drive. One parent recently just got a new car after our oldest car died. Its no Mercedes. We are not part of the country that buys senators or even donate $1000 in an election.\n\nThe biggest thing is education. Not finishing high school and then not learning a skill/trait, working up the ladder in a company, or going to college is what the problem is. The eleminates the problem of \"labor\". Just because the 1% has billions doesn't mean they can control our lives. While I agree with the fact that private prisons or private companies run probation in many municipalities, this has no control over people breaking the law or not.\n\nAlso while companies do need labor, there are plenty of jobs that I do not see being replaced by robots or computers. Plus without jobs, these companies wouldn't have consumers to purchase their products. Jobs flipping burgers, working the cash register at a supermarket, should be taken by high school/college students or people looking for a bit of extra income.\n\nTwo last things. We could easily make it so smaller amounts of money can be spent on campaigns, lower lobbyists power, ect. But what I hope I never see people stop trying to climb the economic ladder. My dad was the first of him family to attend college, and it was on a basketball scholarship. These days with decent grades you can go to college, have a job and take $5000 loan and get a degree from a state school. Or if you live in a state like GA where they have the hope scholarship, which I was on, pays your tuition. College and trade schools are obtainable to anyone who seeks it. It just might take a little bit more work than others that already have money.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where do you get 14% is well off? Top 1% is less than 400k, that&amp;#39;t a good living but no where near millions. My family was in the 5% and we had our own struggles. Especially if you are self-employed. Paying both 7.5% of social security, paying a higher tax rate and reinvesting into their business. Starting their business a couple years before 2007-08. Now paying more money per year on health insurance than a mortgage on a decent house in a middle-class neighborhood, in Georgia for that matter. Parents trying to take their children on a single 5 day vacation. Putting us in 4-year universities, (in-state, hell I lived at home 3 of 4 years). My parents saving for retirement. I drive a 20 year old hand me down car, my other sibling doesn&amp;#39;t drive. One parent recently just got a new car after our oldest car died. Its no Mercedes. We are not part of the country that buys senators or even donate $1000 in an election.&lt;/p&gt;\n\n&lt;p&gt;The biggest thing is education. Not finishing high school and then not learning a skill/trait, working up the ladder in a company, or going to college is what the problem is. The eleminates the problem of &amp;quot;labor&amp;quot;. Just because the 1% has billions doesn&amp;#39;t mean they can control our lives. While I agree with the fact that private prisons or private companies run probation in many municipalities, this has no control over people breaking the law or not.&lt;/p&gt;\n\n&lt;p&gt;Also while companies do need labor, there are plenty of jobs that I do not see being replaced by robots or computers. Plus without jobs, these companies wouldn&amp;#39;t have consumers to purchase their products. Jobs flipping burgers, working the cash register at a supermarket, should be taken by high school/college students or people looking for a bit of extra income.&lt;/p&gt;\n\n&lt;p&gt;Two last things. We could easily make it so smaller amounts of money can be spent on campaigns, lower lobbyists power, ect. But what I hope I never see people stop trying to climb the economic ladder. My dad was the first of him family to attend college, and it was on a basketball scholarship. These days with decent grades you can go to college, have a job and take $5000 loan and get a degree from a state school. Or if you live in a state like GA where they have the hope scholarship, which I was on, pays your tuition. College and trade schools are obtainable to anyone who seeks it. It just might take a little bit more work than others that already have money.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg400p3", "score_hidden": false, "stickied": false, "created": 1491925107.0, "created_utc": 1491896307.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg4lykk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OGHuggles", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Why would the rich systematically wipe out people? Seems like a waste of resources when they can just ignore them. And there's plenty of charities and philanthropies and technologies being built that don't generate profits or have much public following, so it's really hard to say that those are all done in the name of PR. \n\nThis fat cat monocle mustache twirling image people have of the rich is largely a fantasy. \n\nThe only reason the rich have to fear the general public is because the rabble tends to get rather irritated for stupid reasons. Mob rule is terrifying, and people form mindless mobs far too often. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why would the rich systematically wipe out people? Seems like a waste of resources when they can just ignore them. And there&amp;#39;s plenty of charities and philanthropies and technologies being built that don&amp;#39;t generate profits or have much public following, so it&amp;#39;s really hard to say that those are all done in the name of PR. &lt;/p&gt;\n\n&lt;p&gt;This fat cat monocle mustache twirling image people have of the rich is largely a fantasy. &lt;/p&gt;\n\n&lt;p&gt;The only reason the rich have to fear the general public is because the rabble tends to get rather irritated for stupid reasons. Mob rule is terrifying, and people form mindless mobs far too often. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg4lykk", "score_hidden": false, "stickied": false, "created": 1491961152.0, "created_utc": 1491932352.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": "", "user_reports": [], "id": "dg4p9pn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KumarLittleJeans", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Or the opposite could occur. As the poor become more and more reliant on government transfers to live they could increasingly vote for the candidate promising the most benefits. 50.0001% wins the day and there's more and more people that get more from the government than they pay in taxes. All the big money was against Trump, both in the GOP primary and in the general and he was elected anyway. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or the opposite could occur. As the poor become more and more reliant on government transfers to live they could increasingly vote for the candidate promising the most benefits. 50.0001% wins the day and there&amp;#39;s more and more people that get more from the government than they pay in taxes. All the big money was against Trump, both in the GOP primary and in the general and he was elected anyway. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg4p9pn", "score_hidden": false, "stickied": false, "created": 1491964788.0, "created_utc": 1491935988.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": "", "user_reports": [], "id": "dg4q7zx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Glory2Hypnotoad", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The rich aren't a single unified interest and likely won't ever be. I could similarly point out that just under 1% of the world is in some form of military yet they could take over the world if they all joined forces, yet we rightly don't consider that prospect a realistic threat.", "edited": 1491940548.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The rich aren&amp;#39;t a single unified interest and likely won&amp;#39;t ever be. I could similarly point out that just under 1% of the world is in some form of military yet they could take over the world if they all joined forces, yet we rightly don&amp;#39;t consider that prospect a realistic threat.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg4q7zx", "score_hidden": false, "stickied": false, "created": 1491965793.0, "created_utc": 1491936993.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": "", "user_reports": [], "id": "dg51u8d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spoopsnloops", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "If it really came down to it, America's poor will run amok on the rich. There are more rich than poor, even within the military.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it really came down to it, America&amp;#39;s poor will run amok on the rich. There are more rich than poor, even within the military.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg51u8d", "score_hidden": false, "stickied": false, "created": 1491979183.0, "created_utc": 1491950383.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": "", "user_reports": [], "id": "dg4u6eb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pensivegargoyle", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Why? It's the work and consumption of the poor that makes them rich.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why? It&amp;#39;s the work and consumption of the poor that makes them rich.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg4u6eb", "score_hidden": false, "stickied": false, "created": 1491970051.0, "created_utc": 1491941251.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64orrh", "likes": null, "replies": "", "user_reports": [], "id": "dg5kjd3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "alexd1976", "parent_id": "t3_64orrh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Why do you think they are banning abortion and pushing religion?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why do you think they are banning abortion and pushing religion?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5kjd3", "score_hidden": false, "stickied": false, "created": 1492007541.0, "created_utc": 1491978741.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]