[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The neoconservatives who sold the Iraq War to the Bush Administration were among the same small group whose members authored &lt;a href=\"https://en.wikipedia.org/wiki/A_Clean_Break:_A_New_Strategy_for_Securing_the_Realm\"&gt;A Clean Break: A New Strategy for Securing the Realm&lt;/a&gt; for the Israeli government in 1996, which advocated &amp;quot;removing Saddam Hussein from power in Iraq—an important Israeli strategic objective in its own right—as a means of foiling Syria’s regional ambitions&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The neocons joined the Bush administration, and succeeded in exploiting fears of terrorism to achieve the Iraq objective, which has been disastrous for the Arab world and destabilized the region. As the Arabs fight among each other in sectarian conflicts, Israel &lt;a href=\"http://www.latimes.com/world/middleeast/la-fg-syrian-refugees-israel-20150906-story.html\"&gt;refuses to accept refugees&lt;/a&gt; in large numbers, and has achieved its goal of getting rid of a powerful state enemy. &lt;/p&gt;\n\n&lt;p&gt;Moreover, these not unintelligent neoconservatives, who dominated the Bush Administration -- have seemed to learn nothing from the disaster that was the Iraq War, and are now advocating regime change in Syria and even Iran (see &lt;a href=\"https://twitter.com/BillKristol/status/850753242711695360\"&gt;Bill Kristol&lt;/a&gt; and &lt;a href=\"https://www.wsj.com/articles/what-comes-after-the-syria-strikes-1491865034\"&gt;Paul Wolfowitz&lt;/a&gt; ). &lt;/p&gt;\n\n&lt;p&gt;By following the playbook in &amp;quot;A Clean Break&amp;quot;, they have brought disasters to the Muslim world (hundreds of thousands of deaths due to sectarian conflict) and the West (refugee crisis, right wing populism, etc.), yet continue to press forward with the same regime-toppling ideology. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been trying to understand why the US invaded Iraq, why its leaders are appealing to &amp;quot;humanitarian&amp;quot; values in Syria while simultaneously helping Saudi Arabia bring about a &lt;a href=\"https://www.mintpressnews.com/saudi-arabia-devastating-yemen-into-famine-u-s-refuses-to-comment/226548/\"&gt;famine in Yemen&lt;/a&gt;, and have come to the conclusion that it only makes sense from the perspective of Israel&amp;#39;s interests.&lt;/p&gt;\n\n&lt;p&gt;These interests have been explicitly written out by many of the Iraq War architects in &amp;quot;A Clean Break&amp;quot;, and are also similar to those expressed in the &lt;a href=\"https://en.wikipedia.org/wiki/Yinon_Plan\"&gt;Yinon Plan&lt;/a&gt;, whose right wing Israeli author said it was only natural &amp;quot;that Israel will seek to destabilize the surrounding states... with much of the region fragmented into ethnic religions communities, preferably mutually hostile&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;In my opinion, those sympathetic to this ideology have made a disproportionate percentage of the American foreign policy elite, which has lead the US to adopt a strategy of toppling Middle Eastern regimes at the expense of US and Western interests. &lt;/p&gt;\n\n&lt;p&gt;Please feel free to CMV&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;This is a footnote from the CMV moderators. We&amp;#39;d like to remind you of a couple of things. Firstly, please&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules\"&gt;read through our rules&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting\"&gt;downvotes don&amp;#39;t change views&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;! Any questions or concerns? Feel free to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/message/compose?to=/r/changemyview\"&gt;message us&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;Happy CMVing!&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The neoconservatives who sold the Iraq War to the Bush Administration were among the same small group whose members authored [A Clean Break: A New Strategy for Securing the Realm](https://en.wikipedia.org/wiki/A_Clean_Break:_A_New_Strategy_for_Securing_the_Realm) for the Israeli government in 1996, which advocated \"removing Saddam Hussein from power in Iraq—an important Israeli strategic objective in its own right—as a means of foiling Syria’s regional ambitions\"\n\nThe neocons joined the Bush administration, and succeeded in exploiting fears of terrorism to achieve the Iraq objective, which has been disastrous for the Arab world and destabilized the region. As the Arabs fight among each other in sectarian conflicts, Israel [refuses to accept refugees](http://www.latimes.com/world/middleeast/la-fg-syrian-refugees-israel-20150906-story.html) in large numbers, and has achieved its goal of getting rid of a powerful state enemy. \n\nMoreover, these not unintelligent neoconservatives, who dominated the Bush Administration -- have seemed to learn nothing from the disaster that was the Iraq War, and are now advocating regime change in Syria and even Iran (see [Bill Kristol](https://twitter.com/BillKristol/status/850753242711695360) and [Paul Wolfowitz](https://www.wsj.com/articles/what-comes-after-the-syria-strikes-1491865034) ). \n\nBy following the playbook in \"A Clean Break\", they have brought disasters to the Muslim world (hundreds of thousands of deaths due to sectarian conflict) and the West (refugee crisis, right wing populism, etc.), yet continue to press forward with the same regime-toppling ideology. \n\nI've been trying to understand why the US invaded Iraq, why its leaders are appealing to \"humanitarian\" values in Syria while simultaneously helping Saudi Arabia bring about a [famine in Yemen](https://www.mintpressnews.com/saudi-arabia-devastating-yemen-into-famine-u-s-refuses-to-comment/226548/), and have come to the conclusion that it only makes sense from the perspective of Israel's interests.\n\nThese interests have been explicitly written out by many of the Iraq War architects in \"A Clean Break\", and are also similar to those expressed in the [Yinon Plan](https://en.wikipedia.org/wiki/Yinon_Plan), whose right wing Israeli author said it was only natural \"that Israel will seek to destabilize the surrounding states... with much of the region fragmented into ethnic religions communities, preferably mutually hostile\"\n\nIn my opinion, those sympathetic to this ideology have made a disproportionate percentage of the American foreign policy elite, which has lead the US to adopt a strategy of toppling Middle Eastern regimes at the expense of US and Western interests. \n\nPlease feel free to CMV\n\n_____\n\n&gt; *This is a footnote from the CMV moderators. We'd like to remind you of a couple of things. Firstly, please* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64tkrg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "rackham15", "saved": false, "mod_reports": [], "name": "t3_64tkrg", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": 1491943564.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/64tkrg/cmv_the_disastrous_iraq_war_and_hostility_towards/", "num_reports": null, "locked": false, "stickied": false, "created": 1491972148.0, "url": "https://www.reddit.com/r/changemyview/comments/64tkrg/cmv_the_disastrous_iraq_war_and_hostility_towards/", "author_flair_text": null, "quarantine": false, "title": "CMV: The disastrous Iraq War and hostility towards Assad come mainly from an ideology designed to help Israel at the expense of unified Arab nations, and has little benefit to Americans and the non-Israeli West", "created_utc": 1491943348.0, "distinguished": null, "media": null, "upvote_ratio": 0.72, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64tkrg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64tkrg", "likes": null, "replies": "", "user_reports": [], "id": "dg6ubz2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rackham15", "parent_id": "t1_dg5bhm3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Removing Saddam Hussein has been discussed by Republicans and Democrats for a good amount of time. Many people have advocated that, and the Bush administration consulted many experts in the region. Sometimes, bad things just happen.\n\nFor what reason was it discussed? It seems like pre-neocon, pre-PNAC Cheney had a good idea of exactly [what would happen in 1994](https://www.youtube.com/watch?v=S9YuD9kYK9I). \n\n&gt; Israel is also incredibly wary of insurgent groups like ISIS taking control because they are more likely to break previous ceasefire agreements and enact violence. In short, it is by no means obvious that sectarian conflict benefits Israel at all. They obviously have no reason to support Assad. Not taking in refugees does not suggest that they benefit from the situation.\n\nRegardless of whether sectarian conflict *actually* helps Israel, neoconservatives have openly argued that having hostile leaders of stable neighboring nations is more dangerous for Israel than sectarian strife, which much of the Israeli right has explicitly advocated as a foreign policy goal. Unlike most who initially supported the war (ex: [Andrew Sullivan](https://www.theatlantic.com/daily-dish/archive/2009/02/-a-false-premise/205994/)), neocons like Bill Kristol and Wolfowitz have still not retracted their support for the invasion of Iraq, and continue to push for further regime-toppling. \n\n&gt;This is somewhat akin to the Texas Sharpshooter Fallacy. Namely, the Yinon Plan stands out because that's the outcome that has (roughly) happened. There have been countless articles and papers written on Israeli foreign policy and strategy that are wildly different. I doubt there is anyone in Israel thinking \"wow, the current geopolitical landscape in the region is great for us!\"\n\nI don't think all Israel foreign policy thinkers have the same views, but a small ideological group of 20 or so neoconservatives architected the Iraq War, and they had openly advocated the removal of specific hostile world leaders as a way to protect Israel's interests, and the Yinon Plan has largely been the template for the way the Israeli right conceives of foreign policy. \n\n&gt; Israel is the only liberal democracy in the region. Its interests will always overlap with US interests to a large degree. The US benefits from having more liberal, Western-style democracies and opening new markets. \n\nThe US trades about $45 billion with Israel a year, while the Iraq War cost over $2 trillion. Israel's security goals have clearly played an outsized role in our foreign policy strategy. \n\n&gt; Also, since World War I, the US has been sympathetic to using military action for humanitarian purposes (AKA, \"to make the world free for democracy\"). There are horrific human rights abuses being committed by these regimes (Hussein, Assad, the Kim dynasty, etc.) and there is an argument to be made that the US has a moral imperative to end the abuse because it's the only power capable of it. You can argue that that's just a post hoc justification, but that doesn't mean it's not a serious consideration.\n\nWe are extremely selective in who we apply these rules to, and they always overlap with our interests. US bombs are currently blowing up Yemeni civilians and bringing them to the point of famine (we're helping Saudi Arabia fight ethnic/religious rivals).   The rationale for the Iraq War was a potential terrorist attack on the US, not humanitarian in nature (the rationale for Syria regime-toppling). It's extremely easy to create a humanitarian rationale for toppling most Middle East governments, because they are all so lacking in the humanitarian quality. \n\nI still agree with Andrew Sullivan, who initially was a huge war supporter, but came to the conclusion that: \"The closer you examine it, the clearer it is that neoconservatism, in large part, is simply about enabling the most irredentist elements in Israel and sustaining a permanent war against anyone or any country who disagrees with the Israeli right. That's the conclusion I've been forced to these last few years.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Removing Saddam Hussein has been discussed by Republicans and Democrats for a good amount of time. Many people have advocated that, and the Bush administration consulted many experts in the region. Sometimes, bad things just happen.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;For what reason was it discussed? It seems like pre-neocon, pre-PNAC Cheney had a good idea of exactly &lt;a href=\"https://www.youtube.com/watch?v=S9YuD9kYK9I\"&gt;what would happen in 1994&lt;/a&gt;. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Israel is also incredibly wary of insurgent groups like ISIS taking control because they are more likely to break previous ceasefire agreements and enact violence. In short, it is by no means obvious that sectarian conflict benefits Israel at all. They obviously have no reason to support Assad. Not taking in refugees does not suggest that they benefit from the situation.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Regardless of whether sectarian conflict &lt;em&gt;actually&lt;/em&gt; helps Israel, neoconservatives have openly argued that having hostile leaders of stable neighboring nations is more dangerous for Israel than sectarian strife, which much of the Israeli right has explicitly advocated as a foreign policy goal. Unlike most who initially supported the war (ex: &lt;a href=\"https://www.theatlantic.com/daily-dish/archive/2009/02/-a-false-premise/205994/\"&gt;Andrew Sullivan&lt;/a&gt;), neocons like Bill Kristol and Wolfowitz have still not retracted their support for the invasion of Iraq, and continue to push for further regime-toppling. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;This is somewhat akin to the Texas Sharpshooter Fallacy. Namely, the Yinon Plan stands out because that&amp;#39;s the outcome that has (roughly) happened. There have been countless articles and papers written on Israeli foreign policy and strategy that are wildly different. I doubt there is anyone in Israel thinking &amp;quot;wow, the current geopolitical landscape in the region is great for us!&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think all Israel foreign policy thinkers have the same views, but a small ideological group of 20 or so neoconservatives architected the Iraq War, and they had openly advocated the removal of specific hostile world leaders as a way to protect Israel&amp;#39;s interests, and the Yinon Plan has largely been the template for the way the Israeli right conceives of foreign policy. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Israel is the only liberal democracy in the region. Its interests will always overlap with US interests to a large degree. The US benefits from having more liberal, Western-style democracies and opening new markets. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The US trades about $45 billion with Israel a year, while the Iraq War cost over $2 trillion. Israel&amp;#39;s security goals have clearly played an outsized role in our foreign policy strategy. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Also, since World War I, the US has been sympathetic to using military action for humanitarian purposes (AKA, &amp;quot;to make the world free for democracy&amp;quot;). There are horrific human rights abuses being committed by these regimes (Hussein, Assad, the Kim dynasty, etc.) and there is an argument to be made that the US has a moral imperative to end the abuse because it&amp;#39;s the only power capable of it. You can argue that that&amp;#39;s just a post hoc justification, but that doesn&amp;#39;t mean it&amp;#39;s not a serious consideration.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;We are extremely selective in who we apply these rules to, and they always overlap with our interests. US bombs are currently blowing up Yemeni civilians and bringing them to the point of famine (we&amp;#39;re helping Saudi Arabia fight ethnic/religious rivals).   The rationale for the Iraq War was a potential terrorist attack on the US, not humanitarian in nature (the rationale for Syria regime-toppling). It&amp;#39;s extremely easy to create a humanitarian rationale for toppling most Middle East governments, because they are all so lacking in the humanitarian quality. &lt;/p&gt;\n\n&lt;p&gt;I still agree with Andrew Sullivan, who initially was a huge war supporter, but came to the conclusion that: &amp;quot;The closer you examine it, the clearer it is that neoconservatism, in large part, is simply about enabling the most irredentist elements in Israel and sustaining a permanent war against anyone or any country who disagrees with the Israeli right. That&amp;#39;s the conclusion I&amp;#39;ve been forced to these last few years.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6ubz2", "score_hidden": false, "stickied": false, "created": 1492072296.0, "created_utc": 1492043496.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5bhm3", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "wugglesthemule", "parent_id": "t3_64tkrg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'll start by saying that I'm not a neoconservative, and I disagree with much of US foreign policy. That being said, I think your view is inaccurate.\n\n&gt; The neoconservatives who sold the Iraq War to the Bush Administration were among the same small group... which advocated \"removing Saddam Hussein from power in Iraq\"\n\nRemoving Saddam Hussein has been discussed by Republicans and Democrats for a good amount of time. Many people have advocated that, and the Bush administration consulted many experts in the region. Sometimes, bad things just happen.\n\n&gt;  As the Arabs fight among each other in sectarian conflicts, Israel refuses to accept refugees in large numbers, and has achieved its goal of getting rid of a powerful state enemy.\n\nIsrael is also incredibly wary of insurgent groups like ISIS taking control because they are more likely to break previous ceasefire agreements and enact violence. In short, it is by no means obvious that sectarian conflict benefits Israel at all. They obviously have no reason to support Assad. Not taking in refugees does not suggest that they benefit from the situation.\n\n&gt; These interests have been explicitly written out by many of the Iraq War architects in \"A Clean Break\", and are also similar to those expressed in the Yinon Plan,\n\nThis is somewhat akin to the [Texas Sharpshooter Fallacy](https://en.wikipedia.org/wiki/Texas_sharpshooter_fallacy). Namely, the Yinon Plan stands out because that's the outcome that has (roughly) happened. There have been countless articles and papers written on Israeli foreign policy and strategy that are wildly different. I doubt there is anyone in Israel thinking \"wow, the current geopolitical landscape in the region is great for us!\"\n\n&gt; In my opinion, those sympathetic to this ideology have made a disproportionate percentage of the American foreign policy elite, which has lead the US to adopt a strategy of toppling Middle Eastern regimes at the expense of US and Western interests.\n\nIsrael is the only liberal democracy in the region. Its interests will always overlap with US interests to a large degree. The US benefits from having more liberal, Western-style democracies and opening new markets. Also, since World War I, the US has been sympathetic to using military action for humanitarian purposes (AKA, \"to make the world free for democracy\"). There are horrific human rights abuses being committed by these regimes (Hussein, Assad, the Kim dynasty, etc.) and there is an argument to be made that the US has a moral imperative to end the abuse because it's the only power capable of it. You can argue that that's just a *post hoc* justification, but that doesn't mean it's not a serious consideration.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll start by saying that I&amp;#39;m not a neoconservative, and I disagree with much of US foreign policy. That being said, I think your view is inaccurate.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The neoconservatives who sold the Iraq War to the Bush Administration were among the same small group... which advocated &amp;quot;removing Saddam Hussein from power in Iraq&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Removing Saddam Hussein has been discussed by Republicans and Democrats for a good amount of time. Many people have advocated that, and the Bush administration consulted many experts in the region. Sometimes, bad things just happen.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As the Arabs fight among each other in sectarian conflicts, Israel refuses to accept refugees in large numbers, and has achieved its goal of getting rid of a powerful state enemy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Israel is also incredibly wary of insurgent groups like ISIS taking control because they are more likely to break previous ceasefire agreements and enact violence. In short, it is by no means obvious that sectarian conflict benefits Israel at all. They obviously have no reason to support Assad. Not taking in refugees does not suggest that they benefit from the situation.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;These interests have been explicitly written out by many of the Iraq War architects in &amp;quot;A Clean Break&amp;quot;, and are also similar to those expressed in the Yinon Plan,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is somewhat akin to the &lt;a href=\"https://en.wikipedia.org/wiki/Texas_sharpshooter_fallacy\"&gt;Texas Sharpshooter Fallacy&lt;/a&gt;. Namely, the Yinon Plan stands out because that&amp;#39;s the outcome that has (roughly) happened. There have been countless articles and papers written on Israeli foreign policy and strategy that are wildly different. I doubt there is anyone in Israel thinking &amp;quot;wow, the current geopolitical landscape in the region is great for us!&amp;quot;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In my opinion, those sympathetic to this ideology have made a disproportionate percentage of the American foreign policy elite, which has lead the US to adopt a strategy of toppling Middle Eastern regimes at the expense of US and Western interests.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Israel is the only liberal democracy in the region. Its interests will always overlap with US interests to a large degree. The US benefits from having more liberal, Western-style democracies and opening new markets. Also, since World War I, the US has been sympathetic to using military action for humanitarian purposes (AKA, &amp;quot;to make the world free for democracy&amp;quot;). There are horrific human rights abuses being committed by these regimes (Hussein, Assad, the Kim dynasty, etc.) and there is an argument to be made that the US has a moral imperative to end the abuse because it&amp;#39;s the only power capable of it. You can argue that that&amp;#39;s just a &lt;em&gt;post hoc&lt;/em&gt; justification, but that doesn&amp;#39;t mean it&amp;#39;s not a serious consideration.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5bhm3", "score_hidden": false, "stickied": false, "created": 1491991955.0, "created_utc": 1491963155.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64tkrg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64tkrg", "likes": null, "replies": "", "user_reports": [], "id": "dg6uv5b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rackham15", "parent_id": "t1_dg5884e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; This isn't exactly a fair argument. You can't expect a nation to accept large numbers of refugees from a hostile nation- especially when you're already at a greater risk of terrorism.\n\nI think that if Israel had to accept refugees like the West has been doing for humanitarian reasons, the neoconservatives and Israeli right would change their tune about regime-toppling.\n\nIn many ways, Israel has the Jewish version of what Richard Spencer advocates -- an ethnic homeland and an arguably Apartheid society, which allows them to benefit from the breakdown of stable surrounding states into sectarian wars, while insulating their nation from much of the demographic/terror consequences that Europe faces. \n\nI'll try to answer the rest of your points when I have more time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;This isn&amp;#39;t exactly a fair argument. You can&amp;#39;t expect a nation to accept large numbers of refugees from a hostile nation- especially when you&amp;#39;re already at a greater risk of terrorism.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think that if Israel had to accept refugees like the West has been doing for humanitarian reasons, the neoconservatives and Israeli right would change their tune about regime-toppling.&lt;/p&gt;\n\n&lt;p&gt;In many ways, Israel has the Jewish version of what Richard Spencer advocates -- an ethnic homeland and an arguably Apartheid society, which allows them to benefit from the breakdown of stable surrounding states into sectarian wars, while insulating their nation from much of the demographic/terror consequences that Europe faces. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll try to answer the rest of your points when I have more time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6uv5b", "score_hidden": false, "stickied": false, "created": 1492072921.0, "created_utc": 1492044121.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5884e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MrGraeme", "parent_id": "t3_64tkrg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;As the Arabs fight among each other in sectarian conflicts, Israel refuses to accept refugees in large numbers,\n\nThis isn't exactly a fair argument. You can't expect a nation to accept large numbers of refugees from a hostile nation- especially when you're already at a greater risk of terrorism.\n\n&gt;yet continue to press forward with the same regime-toppling ideology. \n\nIt's not the \"same\" ideology, though. Syria's conflict and Iraq's conflict are rooted in completely different things.\n\nFirst of all, Syria is not Iraq. There was no civil war in Iraq when the United States got involved. There wasn't a substantial amount of Russian influence. There wasn't a refugee crisis. It was not done following a major uprising across the Arab world. They're not the same situation, and they're not being handled in the same way.\n\nThe primary goal of the United States in Syria is to reduce Russian influence, full stop. Syria is arguably the last relevant state which the Russian Federation maintains a heavy level of influence over. It's in a strategic location from both an economic and militaristic perspective, and without it Russia will largely lose the ability to project force outside of countries they immediately border. By limiting this influence(through civil war, regime change, whatever) the United States is weakening a geopolitical rival. \n\nWhile yes, there is some overlap and spillover(Americans advocating for Israel advocate for the removal of Assad, Israel benefits by having a hostile nation incapacitated), that doesn't mean that these are the primary causes of the conflict or the actions of the United States. Correlation does *not* guarantee causation. \n\nFurther, if we were to believe that US foreign policy in the Middle East is centered around Israel's well being, then why has Iran not been eliminated? Why hasn't there been a regime change in Iran? A crippled Iran would benefit Israel more than a crippled Iraq or Syria ever could. Iran directly and substantially funds terror groups such as Hezbollah in the region and has made it clear that their position is to destroy the nation of Israel. Why would the United States bother with a nation in chaos(with limited American influence) such as Syria when they could be focusing their efforts on a legitimate threat to Israel's security and prosperity- Iran.\n\n&gt;In my opinion, those sympathetic to this ideology have made a disproportionate percentage of the American foreign policy elite, which has lead the US to adopt a strategy of toppling Middle Eastern regimes at the expense of US and Western interests. \n\nHow does this explain the European led campaign in the Libyan civil war?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;As the Arabs fight among each other in sectarian conflicts, Israel refuses to accept refugees in large numbers,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This isn&amp;#39;t exactly a fair argument. You can&amp;#39;t expect a nation to accept large numbers of refugees from a hostile nation- especially when you&amp;#39;re already at a greater risk of terrorism.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;yet continue to press forward with the same regime-toppling ideology. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s not the &amp;quot;same&amp;quot; ideology, though. Syria&amp;#39;s conflict and Iraq&amp;#39;s conflict are rooted in completely different things.&lt;/p&gt;\n\n&lt;p&gt;First of all, Syria is not Iraq. There was no civil war in Iraq when the United States got involved. There wasn&amp;#39;t a substantial amount of Russian influence. There wasn&amp;#39;t a refugee crisis. It was not done following a major uprising across the Arab world. They&amp;#39;re not the same situation, and they&amp;#39;re not being handled in the same way.&lt;/p&gt;\n\n&lt;p&gt;The primary goal of the United States in Syria is to reduce Russian influence, full stop. Syria is arguably the last relevant state which the Russian Federation maintains a heavy level of influence over. It&amp;#39;s in a strategic location from both an economic and militaristic perspective, and without it Russia will largely lose the ability to project force outside of countries they immediately border. By limiting this influence(through civil war, regime change, whatever) the United States is weakening a geopolitical rival. &lt;/p&gt;\n\n&lt;p&gt;While yes, there is some overlap and spillover(Americans advocating for Israel advocate for the removal of Assad, Israel benefits by having a hostile nation incapacitated), that doesn&amp;#39;t mean that these are the primary causes of the conflict or the actions of the United States. Correlation does &lt;em&gt;not&lt;/em&gt; guarantee causation. &lt;/p&gt;\n\n&lt;p&gt;Further, if we were to believe that US foreign policy in the Middle East is centered around Israel&amp;#39;s well being, then why has Iran not been eliminated? Why hasn&amp;#39;t there been a regime change in Iran? A crippled Iran would benefit Israel more than a crippled Iraq or Syria ever could. Iran directly and substantially funds terror groups such as Hezbollah in the region and has made it clear that their position is to destroy the nation of Israel. Why would the United States bother with a nation in chaos(with limited American influence) such as Syria when they could be focusing their efforts on a legitimate threat to Israel&amp;#39;s security and prosperity- Iran.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In my opinion, those sympathetic to this ideology have made a disproportionate percentage of the American foreign policy elite, which has lead the US to adopt a strategy of toppling Middle Eastern regimes at the expense of US and Western interests. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How does this explain the European led campaign in the Libyan civil war?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5884e", "score_hidden": false, "stickied": false, "created": 1491987706.0, "created_utc": 1491958906.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64tkrg", "likes": null, "replies": "", "user_reports": [], "id": "dg5j7uh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cdb03b", "parent_id": "t3_64tkrg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The only time there has ever been a unified Arab world was when it was under the control of the Ottoman Empire (Who were lead by Turks not Arabs). Even during the eras of the Caliphates there were multiple kingdoms in conflict with each other. So US activity does very little to cause the infighting that is going on in the Middle East. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only time there has ever been a unified Arab world was when it was under the control of the Ottoman Empire (Who were lead by Turks not Arabs). Even during the eras of the Caliphates there were multiple kingdoms in conflict with each other. So US activity does very little to cause the infighting that is going on in the Middle East. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5j7uh", "score_hidden": false, "stickied": false, "created": 1492004503.0, "created_utc": 1491975703.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64tkrg", "likes": null, "replies": "", "user_reports": [], "id": "dg5g7tu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kebababab", "parent_id": "t3_64tkrg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The oil rich gulf Arab countries are on the same page with Israel when it comes to Iran and Syria.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The oil rich gulf Arab countries are on the same page with Israel when it comes to Iran and Syria.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5g7tu", "score_hidden": false, "stickied": false, "created": 1491998922.0, "created_utc": 1491970122.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64tkrg", "likes": null, "replies": "", "user_reports": [], "id": "dg5gn07", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RajonRondoIsTurtle", "parent_id": "t3_64tkrg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; I've been trying to understand why the US invaded Iraq, why its leaders are appealing to \"humanitarian\" values in Syria while simultaneously helping Saudi Arabia bring about a famine in Yemen, and have come to the conclusion that it only makes sense from the perspective of Israel's interests.\n\n\nIraq's oil reserves are likely the [\"one of the biggest material prizes in the world history\"](http://www.youtube.com/watch?v=C5dwDzHXPdY&amp;t=36m10s).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;ve been trying to understand why the US invaded Iraq, why its leaders are appealing to &amp;quot;humanitarian&amp;quot; values in Syria while simultaneously helping Saudi Arabia bring about a famine in Yemen, and have come to the conclusion that it only makes sense from the perspective of Israel&amp;#39;s interests.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Iraq&amp;#39;s oil reserves are likely the &lt;a href=\"http://www.youtube.com/watch?v=C5dwDzHXPdY&amp;amp;t=36m10s\"&gt;&amp;quot;one of the biggest material prizes in the world history&amp;quot;&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5gn07", "score_hidden": false, "stickied": false, "created": 1491999639.0, "created_utc": 1491970839.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]