[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 18 and I&amp;#39;ve been questioning my own gender for a while. I&amp;#39;ve read numerous articles from the time I was about 13/14 until now. This is my educated opinion based on what I&amp;#39;ve read. I&amp;#39;m only talking about actual scientific articles and not tumblr bullshit articles. &lt;/p&gt;\n\n&lt;p&gt;I think that hormone blockers are great and should be used if someone wants them. On the other hand, I don&amp;#39;t think that hormones should be used at that age. Some studies have been done that say up to 1/5 of transgender people regret their transition. That is insanely high, but due to the low percentage of the population that is actually transgender (1/300 people) and the short amount of time it&amp;#39;s been studied, it is hard to know how accurate this is. One of the main reasons I&amp;#39;ve been afraid to actually start doing anything myself is due to statistics like these. &lt;/p&gt;\n\n&lt;p&gt;I also believe that it is hard to explain the risks to a younger teen. Both ftm and mtf hormones lead to an increased risk in heart problems and other possible side effects. They also can make you infertile and the changes in some cases aren&amp;#39;t reversible if you&amp;#39;ve been on them a long time. When I was 14, I thought as soon as I was 18 I was going to go to a doctor and start the process. Now knowing and understanding the risks, I have yet to see a gender therapist. &lt;/p&gt;\n\n&lt;p&gt;Your teens are a time of exploration and really figuring yourself out.  I still don&amp;#39;t have myself figured out. I know some people figure themselves out sooner than others and that&amp;#39;s great. I just don&amp;#39;t think that teens younger than 16 should be allowed to medically transition and they should have to be diagnosed with gender disphoria. &lt;/p&gt;\n\n&lt;p&gt;Gender disphoria is the hate and discomfort that a transgender person feels about their body. In most cases, it is treated by transitioning. Interesting though is that some cases go away with age around or before age 30. This seems to be pretty uncommon, but I believe it is worth mentioning. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t understand the point of transitioning if you don&amp;#39;t have gender disphoria. It isn&amp;#39;t medically necessary and it is more likely for you to regret your transition if you don&amp;#39;t have it. Many people who appear to be going along with the &amp;quot;trend&amp;quot; of transgenderism say they don&amp;#39;t have to have gender disphoria to transition. It&amp;#39;s concerns me that they say this because I don&amp;#39;t want people who are going to be unhappy transitioning to transition. It could possibly make it harder for transgender people to transition in the future if a large number of people choose to detransition or commit suicide. &lt;/p&gt;\n\n&lt;p&gt;Over all, it&amp;#39;s probably best for someone to speak to their doctor. Be a better person than I am. Don&amp;#39;t just keep your feelings to yourself hoping they go away and spending your time lurking on trans subreddits. &lt;/p&gt;\n\n&lt;p&gt;Tl:dr: I&amp;#39;m a teen who has done some research myself and has the opinions stated in the title. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm 18 and I've been questioning my own gender for a while. I've read numerous articles from the time I was about 13/14 until now. This is my educated opinion based on what I've read. I'm only talking about actual scientific articles and not tumblr bullshit articles. \n\nI think that hormone blockers are great and should be used if someone wants them. On the other hand, I don't think that hormones should be used at that age. Some studies have been done that say up to 1/5 of transgender people regret their transition. That is insanely high, but due to the low percentage of the population that is actually transgender (1/300 people) and the short amount of time it's been studied, it is hard to know how accurate this is. One of the main reasons I've been afraid to actually start doing anything myself is due to statistics like these. \n\nI also believe that it is hard to explain the risks to a younger teen. Both ftm and mtf hormones lead to an increased risk in heart problems and other possible side effects. They also can make you infertile and the changes in some cases aren't reversible if you've been on them a long time. When I was 14, I thought as soon as I was 18 I was going to go to a doctor and start the process. Now knowing and understanding the risks, I have yet to see a gender therapist. \n \nYour teens are a time of exploration and really figuring yourself out.  I still don't have myself figured out. I know some people figure themselves out sooner than others and that's great. I just don't think that teens younger than 16 should be allowed to medically transition and they should have to be diagnosed with gender disphoria. \n\nGender disphoria is the hate and discomfort that a transgender person feels about their body. In most cases, it is treated by transitioning. Interesting though is that some cases go away with age around or before age 30. This seems to be pretty uncommon, but I believe it is worth mentioning. \n\nI don't understand the point of transitioning if you don't have gender disphoria. It isn't medically necessary and it is more likely for you to regret your transition if you don't have it. Many people who appear to be going along with the \"trend\" of transgenderism say they don't have to have gender disphoria to transition. It's concerns me that they say this because I don't want people who are going to be unhappy transitioning to transition. It could possibly make it harder for transgender people to transition in the future if a large number of people choose to detransition or commit suicide. \n\nOver all, it's probably best for someone to speak to their doctor. Be a better person than I am. Don't just keep your feelings to yourself hoping they go away and spending your time lurking on trans subreddits. \n\nTl:dr: I'm a teen who has done some research myself and has the opinions stated in the title. ", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "[∆(s) from OP]", "id": "64vno9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 30, "report_reasons": null, "author": "Eli5678", "saved": false, "mod_reports": [], "name": "t3_64vno9", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": false, "link_flair_css_class": "OPdelta", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/64vno9/cmv_transgender_individuals_should_not_be_able_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1491994914.0, "url": "https://www.reddit.com/r/changemyview/comments/64vno9/cmv_transgender_individuals_should_not_be_able_to/", "author_flair_text": null, "quarantine": false, "title": "CMV: transgender individuals should not be able to start hormone treatment until they're at least 16 and you should have to be diagnosed with gender disphoria.", "created_utc": 1491966114.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 108, "visited": false, "subreddit_type": "public", "ups": 30}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": "", "user_reports": [], "id": "dg5fb4n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t3_64vno9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "/u/Eli5678 (OP) has awarded 2 deltas in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [**here**](/r/DeltaLog/comments/64vuxq), in /r/DeltaLog.\n\nPlease note that a change of view [doesn't necessarily mean a reversal](https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F), or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)", "edited": 1492049840.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/Eli5678\"&gt;/u/Eli5678&lt;/a&gt; (OP) has awarded 2 deltas in this post.&lt;/p&gt;\n\n&lt;p&gt;All comments that earned deltas (from OP or other users) are listed &lt;a href=\"/r/DeltaLog/comments/64vuxq\"&gt;&lt;strong&gt;here&lt;/strong&gt;&lt;/a&gt;, in &lt;a href=\"/r/DeltaLog\"&gt;/r/DeltaLog&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Please note that a change of view &lt;a href=\"https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F\"&gt;doesn&amp;#39;t necessarily mean a reversal&lt;/a&gt;, or that the conversation has ended.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5fb4n", "score_hidden": true, "stickied": true, "created": 1491997453.0, "created_utc": 1491968653.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5f4il", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Peakini", "parent_id": "t1_dg5ey5r", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Hey and for a lot of 14 year olds you might be right, but I think that's for a 14 year old to demonstrate, not for you to dictate.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey and for a lot of 14 year olds you might be right, but I think that&amp;#39;s for a 14 year old to demonstrate, not for you to dictate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5f4il", "score_hidden": false, "stickied": false, "created": 1491997166.0, "created_utc": 1491968366.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": "", "user_reports": [], "id": "dg6mqe9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "silverducttape", "parent_id": "t1_dg5ey5r", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Is a non-trans 14-year-old capable of consenting to undergo puberty? Why or why not? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is a non-trans 14-year-old capable of consenting to undergo puberty? Why or why not? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6mqe9", "score_hidden": false, "stickied": false, "created": 1492062898.0, "created_utc": 1492034098.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ey5r", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Eli5678", "parent_id": "t1_dg5ekbz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I don't think that a 14 year old had the mental compactly to make those types of choices ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think that a 14 year old had the mental compactly to make those types of choices &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5ey5r", "score_hidden": false, "stickied": false, "created": 1491996890.0, "created_utc": 1491968090.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ekbz", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Peakini", "parent_id": "t3_64vno9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So your post seems to mostly concern whether transitioning early is a good idea or not. Pros, cons, risks, etc. All good. I think everyone can agree that it's important that people who undertake these treatments understand all of these before choosing to move forward. People should make informed choices.\n\nBut then your title is something else entirely - people *shouldn't be able* to make that choice themselves? Even if they are informed of all the risks, pros, cons? You would deny them the choice, because sometimes they might make the wrong one? If I chose to undertake this treatment at 14, and demonstrated an understanding of that choice, would you deny me that self control? Do I not have the right to make those choices for myself - even if I will sometimes make mistakes?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So your post seems to mostly concern whether transitioning early is a good idea or not. Pros, cons, risks, etc. All good. I think everyone can agree that it&amp;#39;s important that people who undertake these treatments understand all of these before choosing to move forward. People should make informed choices.&lt;/p&gt;\n\n&lt;p&gt;But then your title is something else entirely - people &lt;em&gt;shouldn&amp;#39;t be able&lt;/em&gt; to make that choice themselves? Even if they are informed of all the risks, pros, cons? You would deny them the choice, because sometimes they might make the wrong one? If I chose to undertake this treatment at 14, and demonstrated an understanding of that choice, would you deny me that self control? Do I not have the right to make those choices for myself - even if I will sometimes make mistakes?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5ekbz", "score_hidden": false, "stickied": false, "created": 1491996308.0, "created_utc": 1491967508.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": "", "user_reports": [], "id": "dg5ews1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Eli5678", "parent_id": "t1_dg5e9at", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "ADD medication being over prescribed is another issue all of its own. \n\nI don't believe it should be easier to get on hormones. It takes about a year on average for most people currently because you have to go through therapy to ensure it's not another issue. If it got easier in the short end then 10 years down the line when people who realize it wasn't meant for them because they didn't have gender disphoria, it will make it harder. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ADD medication being over prescribed is another issue all of its own. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t believe it should be easier to get on hormones. It takes about a year on average for most people currently because you have to go through therapy to ensure it&amp;#39;s not another issue. If it got easier in the short end then 10 years down the line when people who realize it wasn&amp;#39;t meant for them because they didn&amp;#39;t have gender disphoria, it will make it harder. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5ews1", "score_hidden": false, "stickied": false, "created": 1491996833.0, "created_utc": 1491968033.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5e9at", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "aleph473", "parent_id": "t3_64vno9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Both ftm and mtf hormones lead to an increased risk in heart problems and other possible side effects.\n\nI don't know about this.  We freely put 9-year-olds on Adderall on the off chance that their school problems are due to a mental health issue, those can also cause heart problems, and I think that if we can justify that then we can justify hormone replacement.  \n\n&gt;I don't understand the point of transitioning if you don't have gender disphoria.\n\nI'll explain it from my own perspective, then.  In my case, it's not that I have any self-hate or misery as a result of being male, just this nagging feeling that it wouldn't have been my first choice.  I don't really feel right now that I have any interest in transitioning, but I also feel that the only thing really holding me back is how long it would take and how unpleasant the transition would be, and if one day I felt that it would be easy enough to transition and decided to do so then I don't feel like it's something that should be pathologized.  \n\nBasically, I kind of just see it this way: some people are unhappy with their hair, some people are unhappy with their weight, and some people are unhappy with their gender presentation and sex characteristics.  \n\n&gt;It's concerns me that they say this because I don't want people who are going to be unhappy transitioning to transition.\n\nI think that the solution isn't to make transitioning harder but rather to make it even easier, to the point where it's feasible to go back and forth.  Obviously this would be quite a feat of medical science, but that's as good a reason to invest in research as any.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Both ftm and mtf hormones lead to an increased risk in heart problems and other possible side effects.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t know about this.  We freely put 9-year-olds on Adderall on the off chance that their school problems are due to a mental health issue, those can also cause heart problems, and I think that if we can justify that then we can justify hormone replacement.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t understand the point of transitioning if you don&amp;#39;t have gender disphoria.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;ll explain it from my own perspective, then.  In my case, it&amp;#39;s not that I have any self-hate or misery as a result of being male, just this nagging feeling that it wouldn&amp;#39;t have been my first choice.  I don&amp;#39;t really feel right now that I have any interest in transitioning, but I also feel that the only thing really holding me back is how long it would take and how unpleasant the transition would be, and if one day I felt that it would be easy enough to transition and decided to do so then I don&amp;#39;t feel like it&amp;#39;s something that should be pathologized.  &lt;/p&gt;\n\n&lt;p&gt;Basically, I kind of just see it this way: some people are unhappy with their hair, some people are unhappy with their weight, and some people are unhappy with their gender presentation and sex characteristics.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s concerns me that they say this because I don&amp;#39;t want people who are going to be unhappy transitioning to transition.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think that the solution isn&amp;#39;t to make transitioning harder but rather to make it even easier, to the point where it&amp;#39;s feasible to go back and forth.  Obviously this would be quite a feat of medical science, but that&amp;#39;s as good a reason to invest in research as any.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5e9at", "score_hidden": false, "stickied": false, "created": 1491995848.0, "created_utc": 1491967048.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": "", "user_reports": [], "id": "dg5ucmd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Eli5678", "parent_id": "t1_dg5ru2u", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I can't remember to be honest. I have a habit of reading tons of scientific articles and memorizing the facts in them and using them as fun little party tricks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t remember to be honest. I have a habit of reading tons of scientific articles and memorizing the facts in them and using them as fun little party tricks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5ucmd", "score_hidden": false, "stickied": false, "created": 1492031917.0, "created_utc": 1492003117.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ru2u", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "QuarrelsomeQualia", "parent_id": "t3_64vno9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Out of curiosity, where did you get the 1/5 statistic? Most of the recent studies have found from what i can tell much lower rates. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Out of curiosity, where did you get the 1/5 statistic? Most of the recent studies have found from what i can tell much lower rates. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5ru2u", "score_hidden": false, "stickied": false, "created": 1492027719.0, "created_utc": 1491998919.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5u9ol", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Eli5678", "parent_id": "t1_dg5lx9x", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Nah. It's not a big deal it's more me personally being a very secretive person who doesn't like to tell people about shit unless it's necessary. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah. It&amp;#39;s not a big deal it&amp;#39;s more me personally being a very secretive person who doesn&amp;#39;t like to tell people about shit unless it&amp;#39;s necessary. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5u9ol", "score_hidden": false, "stickied": false, "created": 1492031797.0, "created_utc": 1492002997.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5lx9x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "otakuman", "parent_id": "t1_dg5iblf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "How about seeing a psychologist first? Those family issues should be addressed before the sex change.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How about seeing a psychologist first? Those family issues should be addressed before the sex change.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5lx9x", "score_hidden": false, "stickied": false, "created": 1492011220.0, "created_utc": 1491982420.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5iblf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Eli5678", "parent_id": "t1_dg5i7bh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm just a fucking scaredy cat who is too timid to do anything. I probably wouldn't even be man enough to kill myself if I decided I wanted to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m just a fucking scaredy cat who is too timid to do anything. I probably wouldn&amp;#39;t even be man enough to kill myself if I decided I wanted to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5iblf", "score_hidden": false, "stickied": false, "created": 1492002717.0, "created_utc": 1491973917.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5i7bh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "aggsalad", "parent_id": "t1_dg5hxbf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You can tell them you're seeing a therapist for reasons that aren't dysphoria.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can tell them you&amp;#39;re seeing a therapist for reasons that aren&amp;#39;t dysphoria.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5i7bh", "score_hidden": false, "stickied": false, "created": 1492002496.0, "created_utc": 1491973696.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": "", "user_reports": [], "id": "dg5m2ix", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IIIBlackhartIII", "parent_id": "t1_dg5hxcx", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sorry YabbitBot, your comment has been removed: \n\n&gt; Comment Rule 5\\. \"No low effort comments. Comments that are only jokes, links, or 'written upvotes', for example. Humor, links, and affirmations of agreement can be contained within more substantial comments.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5)\n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Rule+5+Appeal+YabbitBot&amp;message=YabbitBot+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/64vno9/cmv_transgender_individuals_should_not_be_able_to/dg5hxcx/\\))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry YabbitBot, your comment has been removed: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 5. &amp;quot;No low effort comments. Comments that are only jokes, links, or &amp;#39;written upvotes&amp;#39;, for example. Humor, links, and affirmations of agreement can be contained within more substantial comments.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5\"&gt;See the wiki page for more information.&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Rule+5+Appeal+YabbitBot&amp;amp;message=YabbitBot+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/64vno9/cmv_transgender_individuals_should_not_be_able_to/dg5hxcx/)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5m2ix", "score_hidden": false, "stickied": false, "created": 1492011632.0, "created_utc": 1491982832.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5hxcx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg5hxbf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5hxcx", "score_hidden": false, "stickied": false, "created": 1492001966.0, "created_utc": 1491973166.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5hxbf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Eli5678", "parent_id": "t1_dg5hurn", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Yeah but I'm still under my parents insurance. They'll probably send record of the insurance covering it to my house. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah but I&amp;#39;m still under my parents insurance. They&amp;#39;ll probably send record of the insurance covering it to my house. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5hxbf", "score_hidden": false, "stickied": false, "created": 1492001963.0, "created_utc": 1491973163.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5hurn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aggsalad", "parent_id": "t1_dg5ft3q", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Plenty of therapists will maintain confidentiality, especially if you're 18.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Plenty of therapists will maintain confidentiality, especially if you&amp;#39;re 18.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5hurn", "score_hidden": false, "stickied": false, "created": 1492001830.0, "created_utc": 1491973030.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ft3q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Eli5678", "parent_id": "t1_dg5fm23", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I don't want my parents finding out in case I'm not. Ya feel me? It's not even like I live in an area where it'd be too hard to find a dr. I live in the DC metro area and I know there is shit available. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t want my parents finding out in case I&amp;#39;m not. Ya feel me? It&amp;#39;s not even like I live in an area where it&amp;#39;d be too hard to find a dr. I live in the DC metro area and I know there is shit available. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5ft3q", "score_hidden": false, "stickied": false, "created": 1491998253.0, "created_utc": 1491969453.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5fm23", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "aggsalad", "parent_id": "t1_dg5fate", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Hell I guess I'm just pissed off that I can't work up the guts to actually do anything about how I currently feel.\n\nRemember, just because you try to talk with a therapist doesn't mean you're going to have to go down that path. A therapist can help you realize whether or not it is right for you. So if this is hurting you as bad as it seems you should talk to someone. The first step is the hardest but trust me you can always turn back if you want to.\n\n&gt;We all die and I kinda wanna to die\n\nI've been there. Thought everything would never change. Things did change. For me it changed when I got help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Hell I guess I&amp;#39;m just pissed off that I can&amp;#39;t work up the guts to actually do anything about how I currently feel.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Remember, just because you try to talk with a therapist doesn&amp;#39;t mean you&amp;#39;re going to have to go down that path. A therapist can help you realize whether or not it is right for you. So if this is hurting you as bad as it seems you should talk to someone. The first step is the hardest but trust me you can always turn back if you want to.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We all die and I kinda wanna to die&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;ve been there. Thought everything would never change. Things did change. For me it changed when I got help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5fm23", "score_hidden": false, "stickied": false, "created": 1491997936.0, "created_utc": 1491969136.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": "", "user_reports": [], "id": "dg5fb3v", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dg5fate", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/aggsalad ([8∆](/r/changemyview/wiki/user/aggsalad)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"aggsalad\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/aggsalad\"&gt;/u/aggsalad&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/aggsalad\"&gt;8∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22aggsalad%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5fb3v", "score_hidden": false, "stickied": false, "created": 1491997452.0, "created_utc": 1491968652.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5fate", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Eli5678", "parent_id": "t1_dg5f13h", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I guess I had forgotten how I felt when I was younger. Hell I guess I'm just pissed off that I can't work up the guts to actually do anything about how I currently feel. Fuck man. We all die and I kinda wanna to die. Have your fucking delta !delta (the reason I deleted the first comment and reposted this one is because I forgot the delta) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess I had forgotten how I felt when I was younger. Hell I guess I&amp;#39;m just pissed off that I can&amp;#39;t work up the guts to actually do anything about how I currently feel. Fuck man. We all die and I kinda wanna to die. Have your fucking delta !delta (the reason I deleted the first comment and reposted this one is because I forgot the delta) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5fate", "score_hidden": false, "stickied": false, "created": 1491997439.0, "created_utc": 1491968639.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": "", "user_reports": [], "id": "dg5f5hu", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dg5f5ef", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "This delta has been rejected. The length of your comment suggests that you haven't properly explained how /u/aggsalad changed your view (comment rule 4).\n\nDeltaBot is able to rescan edited comments. Please edit your comment with the required explanation.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {\n    \"littleText\": 1\n  },\n  \"parentUserName\": \"aggsalad\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This delta has been rejected. The length of your comment suggests that you haven&amp;#39;t properly explained how &lt;a href=\"/u/aggsalad\"&gt;/u/aggsalad&lt;/a&gt; changed your view (comment rule 4).&lt;/p&gt;\n\n&lt;p&gt;DeltaBot is able to rescan edited comments. Please edit your comment with the required explanation.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%0A%20%20%20%20%22littleText%22:%201%0A%20%20%7D,%0A%20%20%22parentUserName%22:%20%22aggsalad%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5f5hu", "score_hidden": false, "stickied": false, "created": 1491997207.0, "created_utc": 1491968407.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5f5ef", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg5f13h", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5f5ef", "score_hidden": false, "stickied": false, "created": 1491997204.0, "created_utc": 1491968404.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5f13h", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "aggsalad", "parent_id": "t3_64vno9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Some studies have been done that say up to 1/5 of transgender people regret their transition.\n\nWhether a patient is notably at risk of being one of these individuals is something I think a licensed professional should assess, not laymen.\n\n&gt;I also believe that it is hard to explain the risks to a younger teen. \n\nIt is. That's why patients receive thorough amounts of information on the risks and effects of treatment, as well as possible alternatives.\n\n&gt;Both ftm and mtf hormones lead to an increased risk in heart problems and other possible side effects.\n\nThe risks of these versus the negative effects of untreated dysphoria is a consideration to be made between a patient and their doctor. We get blood tests to make sure things are going reasonably safely. There are plenty of life-saving drugs with side-effects of similar intensity (not very).\n\n&gt;When I was 14, I thought as soon as I was 18 I was going to go to a doctor and start the process\n\nhahaha. no fam. You don't just walk into the doctor's and start HRT. I went through 14 months of consultation before receiving anything. And this is after I've become a legal adult. Wait-lists are many months long usually just to see someone who might treat you.\n\n&gt;Interesting though is that some cases go away with age around or before age 30. This seems to be pretty uncommon, but I believe it is worth mentioning.\n\nIf that is worth mentioning, than every case of someone transitioning successfully under age 16 is worth mentioning.\n\n&gt; It could possibly make it harder for transgender people to transition in the future if a large number of people choose to detransition or commit suicide.\n\nYou're quite literally forwarding this process by putting restrictions on how someone can access the medical care they might need.\n\n&gt;Over all, it's probably best for someone to speak to their doctor.\n\nPrecisely. And if a doctor thinks someone is at significant enough risk from dysphoria that they should receive treatment, they should.\n\nYes. There is an inherent risk to medical transition. However, there will be cases where someone is already suffering greatly from their condition. Cases where alternatives are not effective. To restrict their access to what might be life-saving medication sounds like complete negligence to me. Someone can commit suicide before they reach 16. I attempted suicide at 15.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Some studies have been done that say up to 1/5 of transgender people regret their transition.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Whether a patient is notably at risk of being one of these individuals is something I think a licensed professional should assess, not laymen.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I also believe that it is hard to explain the risks to a younger teen. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It is. That&amp;#39;s why patients receive thorough amounts of information on the risks and effects of treatment, as well as possible alternatives.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Both ftm and mtf hormones lead to an increased risk in heart problems and other possible side effects.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The risks of these versus the negative effects of untreated dysphoria is a consideration to be made between a patient and their doctor. We get blood tests to make sure things are going reasonably safely. There are plenty of life-saving drugs with side-effects of similar intensity (not very).&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;When I was 14, I thought as soon as I was 18 I was going to go to a doctor and start the process&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;hahaha. no fam. You don&amp;#39;t just walk into the doctor&amp;#39;s and start HRT. I went through 14 months of consultation before receiving anything. And this is after I&amp;#39;ve become a legal adult. Wait-lists are many months long usually just to see someone who might treat you.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Interesting though is that some cases go away with age around or before age 30. This seems to be pretty uncommon, but I believe it is worth mentioning.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If that is worth mentioning, than every case of someone transitioning successfully under age 16 is worth mentioning.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It could possibly make it harder for transgender people to transition in the future if a large number of people choose to detransition or commit suicide.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re quite literally forwarding this process by putting restrictions on how someone can access the medical care they might need.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Over all, it&amp;#39;s probably best for someone to speak to their doctor.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Precisely. And if a doctor thinks someone is at significant enough risk from dysphoria that they should receive treatment, they should.&lt;/p&gt;\n\n&lt;p&gt;Yes. There is an inherent risk to medical transition. However, there will be cases where someone is already suffering greatly from their condition. Cases where alternatives are not effective. To restrict their access to what might be life-saving medication sounds like complete negligence to me. Someone can commit suicide before they reach 16. I attempted suicide at 15.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5f13h", "score_hidden": false, "stickied": false, "created": 1491997018.0, "created_utc": 1491968218.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": "", "user_reports": [], "id": "dg5h8x6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Neuro_nerdo", "parent_id": "t1_dg5f0t9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Not sure which allergy medicine you take, but there are several allergy medicines that have been well studied and are known to be just as safe in younger children.  The age limit on drugs is normally not because of a specific danger, but really just because it hasn't been well studied in younger kids, and so we can't say for sure that it's safe in them.  \n\nOne example of a drug that *is* contraindicated in younger children due to the risk of a serious side effect is Aspirin because it can cause a rare complication called Reye's Syndrome which has a high mortality rate.  \n\nAs far as medicines for transitioning, there haven't been a lot of studies in younger kids because there simply aren't that many people who transition that young, oftentimes due to a lack of access and support.  So far, there aren't any obvious contradictions on the level of Reye's Syndrome that have come up.\n\nAlso, many kids and parents take a middle road where they take medicine to pause puberty, but wait a bit longer before starting hormonal therapy.  The benefit of this is that it gives them more time to be absolutely sure about it, but it also prevents the unfortunate circumstance where they start to develop the mature traits of the gender that they don't identify as, and now they are going to need multiple other surgeries just to get rid of those traits when they transition.  Having more of those traits also makes it harder for them to pass in the rest of society and puts them at a higher risk of people targeting them and reacting violently because they know (or think they know) that the person is trans.  Stopping puberty before it starts in many ways is much safer for a transgender person because it helps them pass as the gender that they identify as later on.  They can also allow puberty to restart later without significant harm if they ultimately decided that they don't want to transition.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not sure which allergy medicine you take, but there are several allergy medicines that have been well studied and are known to be just as safe in younger children.  The age limit on drugs is normally not because of a specific danger, but really just because it hasn&amp;#39;t been well studied in younger kids, and so we can&amp;#39;t say for sure that it&amp;#39;s safe in them.  &lt;/p&gt;\n\n&lt;p&gt;One example of a drug that &lt;em&gt;is&lt;/em&gt; contraindicated in younger children due to the risk of a serious side effect is Aspirin because it can cause a rare complication called Reye&amp;#39;s Syndrome which has a high mortality rate.  &lt;/p&gt;\n\n&lt;p&gt;As far as medicines for transitioning, there haven&amp;#39;t been a lot of studies in younger kids because there simply aren&amp;#39;t that many people who transition that young, oftentimes due to a lack of access and support.  So far, there aren&amp;#39;t any obvious contradictions on the level of Reye&amp;#39;s Syndrome that have come up.&lt;/p&gt;\n\n&lt;p&gt;Also, many kids and parents take a middle road where they take medicine to pause puberty, but wait a bit longer before starting hormonal therapy.  The benefit of this is that it gives them more time to be absolutely sure about it, but it also prevents the unfortunate circumstance where they start to develop the mature traits of the gender that they don&amp;#39;t identify as, and now they are going to need multiple other surgeries just to get rid of those traits when they transition.  Having more of those traits also makes it harder for them to pass in the rest of society and puts them at a higher risk of people targeting them and reacting violently because they know (or think they know) that the person is trans.  Stopping puberty before it starts in many ways is much safer for a transgender person because it helps them pass as the gender that they identify as later on.  They can also allow puberty to restart later without significant harm if they ultimately decided that they don&amp;#39;t want to transition.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5h8x6", "score_hidden": false, "stickied": false, "created": 1492000714.0, "created_utc": 1491971914.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5f0t9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Eli5678", "parent_id": "t1_dg5ewtr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "But aren't there are already some drugs that you have to be a certain age to take. I can't think of them off the top of my head but I'm fairly sure they do exist. \n\nEdit: like you have to be over 12 to take the allergy medicine that I take! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But aren&amp;#39;t there are already some drugs that you have to be a certain age to take. I can&amp;#39;t think of them off the top of my head but I&amp;#39;m fairly sure they do exist. &lt;/p&gt;\n\n&lt;p&gt;Edit: like you have to be over 12 to take the allergy medicine that I take! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5f0t9", "score_hidden": false, "stickied": false, "created": 1491997006.0, "created_utc": 1491968206.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ewtr", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Exis007", "parent_id": "t1_dg5es71", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "This isn't the same realm. Medical decisions are different. You wouldn't be saying that a 15-year-old couldn't take the drugs. It would be saying that a 35-year-old parent can't ask for medical intervention for their child. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t the same realm. Medical decisions are different. You wouldn&amp;#39;t be saying that a 15-year-old couldn&amp;#39;t take the drugs. It would be saying that a 35-year-old parent can&amp;#39;t ask for medical intervention for their child. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5ewtr", "score_hidden": false, "stickied": false, "created": 1491996834.0, "created_utc": 1491968034.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5es71", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Klarkson1273", "parent_id": "t1_dg5egcq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Unfortunately we just make up magic ages for everything else. Driving, voting, concent laws, tobacco, alcohol, going to war. Those laws arent perfect by any means. The difference between 2 different 16 year olds can be massive. It is difficult to establish any until X age law. Most conversations Ive heard are wait until 18 since you are legally an adult. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unfortunately we just make up magic ages for everything else. Driving, voting, concent laws, tobacco, alcohol, going to war. Those laws arent perfect by any means. The difference between 2 different 16 year olds can be massive. It is difficult to establish any until X age law. Most conversations Ive heard are wait until 18 since you are legally an adult. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5es71", "score_hidden": false, "stickied": false, "created": 1491996636.0, "created_utc": 1491967836.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": "", "user_reports": [], "id": "dg5gryu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dg5grdd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "This delta has been rejected. The length of your comment suggests that you haven't properly explained how /u/Exis007 changed your view (comment rule 4).\n\nDeltaBot is able to rescan edited comments. Please edit your comment with the required explanation.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {\n    \"littleText\": 1\n  },\n  \"parentUserName\": \"Exis007\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This delta has been rejected. The length of your comment suggests that you haven&amp;#39;t properly explained how &lt;a href=\"/u/Exis007\"&gt;/u/Exis007&lt;/a&gt; changed your view (comment rule 4).&lt;/p&gt;\n\n&lt;p&gt;DeltaBot is able to rescan edited comments. Please edit your comment with the required explanation.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%0A%20%20%20%20%22littleText%22:%201%0A%20%20%7D,%0A%20%20%22parentUserName%22:%20%22Exis007%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5gryu", "score_hidden": false, "stickied": false, "created": 1491999881.0, "created_utc": 1491971081.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5grdd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg5egcq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5grdd", "score_hidden": false, "stickied": false, "created": 1491999852.0, "created_utc": 1491971052.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5egcq", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Exis007", "parent_id": "t3_64vno9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Let's say you have a child with a male biology (and let's stipulate that there's such a thing, I don't want to go into the whole sex-is-really-complicated-outside-of-gender debate). Since she could even make choices, she's consistently asserted she is female. She's never wavered or stumbled, this wasn't a question for her but a decisive statement. \n\nNow she's twelve. What is more dangerous? Putting her on the hormones that will allow her body to develop through puberty in a way that matches her body to her gender, or putting her through the trauma and the psychic dysfunction of going through male puberty? \n\nI honestly don't know. But knowing how hard puberty is in the first place...jesus, I'd be hard-pressed as a parent to say that forcing someone to grow taller, develop a deeper voice, experience male desires, to not develop breasts, to take on all the sex characteristics of a man when everything inside them is screaming \"WOMAN\" wouldn't be riskier. I'd be worried about depression, suicide, shame, and fear. I'd worry, just as you have, that altering the hormonal makeup might have irreversible consequences. It would be a really, really tough choice. \n\nBut then, I wouldn't make it alone. I'd made it with the help of my child. I'd make it with the help and support of doctors and therapists and any number of professionals. **In other words** I don't think there's a right answer about how young someone can be, how old someone should have to be, to take hormones. I think you make a great case that it should be an incredibly careful, weighted decision with all the pros and cons clearly on the table. And, even if you do that, there's no telling what the right choice might be. Even fully informed, you might not get it right. But I'd refuse to stipulate there aren't cases on both sides where hormones are either a good idea or a terrible one. It is always going to depend on the child, on the situation, on the specifics. \n\nIf you want to argue that there should be a great deal of hoop jumping and information and informed consent and therapy and consultation, I'll get on board. I just don't believe there's a magic age line that works for everyone. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Let&amp;#39;s say you have a child with a male biology (and let&amp;#39;s stipulate that there&amp;#39;s such a thing, I don&amp;#39;t want to go into the whole sex-is-really-complicated-outside-of-gender debate). Since she could even make choices, she&amp;#39;s consistently asserted she is female. She&amp;#39;s never wavered or stumbled, this wasn&amp;#39;t a question for her but a decisive statement. &lt;/p&gt;\n\n&lt;p&gt;Now she&amp;#39;s twelve. What is more dangerous? Putting her on the hormones that will allow her body to develop through puberty in a way that matches her body to her gender, or putting her through the trauma and the psychic dysfunction of going through male puberty? &lt;/p&gt;\n\n&lt;p&gt;I honestly don&amp;#39;t know. But knowing how hard puberty is in the first place...jesus, I&amp;#39;d be hard-pressed as a parent to say that forcing someone to grow taller, develop a deeper voice, experience male desires, to not develop breasts, to take on all the sex characteristics of a man when everything inside them is screaming &amp;quot;WOMAN&amp;quot; wouldn&amp;#39;t be riskier. I&amp;#39;d be worried about depression, suicide, shame, and fear. I&amp;#39;d worry, just as you have, that altering the hormonal makeup might have irreversible consequences. It would be a really, really tough choice. &lt;/p&gt;\n\n&lt;p&gt;But then, I wouldn&amp;#39;t make it alone. I&amp;#39;d made it with the help of my child. I&amp;#39;d make it with the help and support of doctors and therapists and any number of professionals. &lt;strong&gt;In other words&lt;/strong&gt; I don&amp;#39;t think there&amp;#39;s a right answer about how young someone can be, how old someone should have to be, to take hormones. I think you make a great case that it should be an incredibly careful, weighted decision with all the pros and cons clearly on the table. And, even if you do that, there&amp;#39;s no telling what the right choice might be. Even fully informed, you might not get it right. But I&amp;#39;d refuse to stipulate there aren&amp;#39;t cases on both sides where hormones are either a good idea or a terrible one. It is always going to depend on the child, on the situation, on the specifics. &lt;/p&gt;\n\n&lt;p&gt;If you want to argue that there should be a great deal of hoop jumping and information and informed consent and therapy and consultation, I&amp;#39;ll get on board. I just don&amp;#39;t believe there&amp;#39;s a magic age line that works for everyone. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5egcq", "score_hidden": false, "stickied": false, "created": 1491996139.0, "created_utc": 1491967339.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": "", "user_reports": [], "id": "dg9dfsw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ShreddingRoses", "parent_id": "t3_64vno9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Some studies have been done that say up to 1/5 of transgender people regret their transition\n\nPlease link these studies. The studies I've seen indicate around 1-2% regret rates which is a far cry from as high as 20%. Those same studies also carefully clarify that one of the strongest factors in regret was the loss of personal relationships due to negative reactions to the transition, so saying that someone \"regrets their transition\" is often overly broad. Do they regret the physical changes? Is it the loss of certain privileges they regret? Is it their treatment at the hands of society they regret? Are their regrets based in religious guilt? Are their regrets due to loss of close family or friend relationships? Are their regrets due to poor surgical outcomes/complications? There is a lot to isolate before you can really understand \"transition regret\" fully.\n\n&gt;and the short amount of time it's been studied, it is hard to know how accurate this is.\n\nI wouldn't say that roughly 5 decades of formal research on the topic is a \"short amount of time\". I will certainly concede that a lot of the most important research has hit the floor in the last two decades, but we actually have been studying this issue for a long time.\n\n&gt;Gender disphoria is the hate and discomfort that a transgender person feels about their body. In most cases, it is treated by transitioning. Interesting though is that some cases go away with age around or before age 30. This seems to be pretty uncommon, but I believe it is worth mentioning. \n\nI don't know how accurately we can say that something like gender dysphoria has \"gone away\". There were times in my life that it \"went away\" but that was solely a short-sighted perspective on my part. The reality was that I had just convinced myself to ignore it and then began developing coping mechanisms around the practice of ignoring it. This lead to dysfunctions in other aspects of my life which did not seem to be related to gender dysphoria. It was only retrospectively that I recognized that repression is less of a surgical knife cut on the parts of your psyche that you don't like and more like using a shotgun to kill a spider in your home. There's a lot of collateral damage and it effects you in a lot of ways that don't seem entirely obvious at first.\n\nWhen people tell me their trans feelings \"went away\" I'm inclined to take it with a grain of salt simply by virtue of my own (limited) experience. At 11 my trans feelings hit me with full force. I hated the effects of male puberty. I wanted to crawl out of my own skin. I decided that I had to learn to live with my body (because I did not know transition was an option) and I built coping mechanisms around dissociating from my body. I became a very dysfunctional being for this period of time but one could easily say that my trans feelings had \"gone away\".\n\nAt 23-24 I started to struggle with my gender dysphoria again but this time very openly. I was much more aware of trans issues and the option of transition so for the first time I was struggling not just with feelings and internal pain I didn't understand but with an issue I could put a name on. Around the late part of my 24th year of life I officially diagnosed myself as \"not trans\" on the tail end of a particular mushroom trip and my feelings seemingly \"went away\". By 26 I was such a miserable wreck of a person that I was seriously considering putting a bullet in my own head. By that summer I decided to transition and all the struggle and the dysfunction seemingly disappeared over night. But if you'd asked me at 14 or 17 or 25 if my trans feelings had gone away I would have said yes. Yet here I am.\n\nI've seen this particular narrative reflected by a lot of older transitioners who started in their late thirties or even as late as their 50s. They all will readily tell you that there were points in their life that the feelings \"went away\" but be quick to amend that really the feelings hadn't gone away, they had just mustered enough psychic strength to repress the feelings for a time.\n\n&gt;I don't understand the point of transitioning if you don't have gender disphoria. It isn't medically necessary and it is more likely for you to regret your transition if you don't have it. Many people who appear to be going along with the \"trend\" of transgenderism say they don't have to have gender disphoria to transition. It's concerns me that they say this because I don't want people who are going to be unhappy transitioning to transition. It could possibly make it harder for transgender people to transition in the future if a large number of people choose to detransition or commit suicide. \n\nI would probably entirely agree with this point honestly. I hate the \"you don't have to have gender dysphoria to be trans\" bullshit. That's an argument for another day but I think it's as absurd as saying \"you don't have to sexually prefer men to be a gay man\". You are arguing for a total lack of borders around any label in order to be as inclusive as possible, even when it robs your labels of any potency of meaning whatsoever. It's dialectal nihilism.\n\nSo I'm not arguing against your total view here actually as much as trying to weaken some of your black and white certainty in it. While I'm personally a little uncomfortable with actually allowing anyone younger than 16 to transition, I prefer to remain mostly agnostic on that issue since by and large it's not up to me to dictate the terms of a treatment that should be between a patient and a qualified medical professional. I also understand that if I'd known at 13 what I do now, I would have signed up for at minimum puberty blockers right away, so that stays my judgement a little bit as well.\n\nI would also like to talk about you a little bit. It seems like one of your main contentions is that people absent gender dysphoria should transition, and you describe how destransition regrets contribute to your own reluctance to transition, but do you not have gender dysphoria yourself? It seems that if you have gender dysphoria, then you're not actually included in your own arguments and thus what should be a consideration for people without gender dysphoria shouldn't be a consideration for yourself. If you want to transition and you have gender dysphoria, I cannot promise you that it won't be a deep internal struggle for years to come. I cannot promise you that transitioning will entirely put to bed your struggle with your gender identity or your body. I can promise you that for those of us who are gender dysphoric it makes our lives a great deal easier than they were.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Some studies have been done that say up to 1/5 of transgender people regret their transition&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Please link these studies. The studies I&amp;#39;ve seen indicate around 1-2% regret rates which is a far cry from as high as 20%. Those same studies also carefully clarify that one of the strongest factors in regret was the loss of personal relationships due to negative reactions to the transition, so saying that someone &amp;quot;regrets their transition&amp;quot; is often overly broad. Do they regret the physical changes? Is it the loss of certain privileges they regret? Is it their treatment at the hands of society they regret? Are their regrets based in religious guilt? Are their regrets due to loss of close family or friend relationships? Are their regrets due to poor surgical outcomes/complications? There is a lot to isolate before you can really understand &amp;quot;transition regret&amp;quot; fully.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;and the short amount of time it&amp;#39;s been studied, it is hard to know how accurate this is.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t say that roughly 5 decades of formal research on the topic is a &amp;quot;short amount of time&amp;quot;. I will certainly concede that a lot of the most important research has hit the floor in the last two decades, but we actually have been studying this issue for a long time.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Gender disphoria is the hate and discomfort that a transgender person feels about their body. In most cases, it is treated by transitioning. Interesting though is that some cases go away with age around or before age 30. This seems to be pretty uncommon, but I believe it is worth mentioning. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t know how accurately we can say that something like gender dysphoria has &amp;quot;gone away&amp;quot;. There were times in my life that it &amp;quot;went away&amp;quot; but that was solely a short-sighted perspective on my part. The reality was that I had just convinced myself to ignore it and then began developing coping mechanisms around the practice of ignoring it. This lead to dysfunctions in other aspects of my life which did not seem to be related to gender dysphoria. It was only retrospectively that I recognized that repression is less of a surgical knife cut on the parts of your psyche that you don&amp;#39;t like and more like using a shotgun to kill a spider in your home. There&amp;#39;s a lot of collateral damage and it effects you in a lot of ways that don&amp;#39;t seem entirely obvious at first.&lt;/p&gt;\n\n&lt;p&gt;When people tell me their trans feelings &amp;quot;went away&amp;quot; I&amp;#39;m inclined to take it with a grain of salt simply by virtue of my own (limited) experience. At 11 my trans feelings hit me with full force. I hated the effects of male puberty. I wanted to crawl out of my own skin. I decided that I had to learn to live with my body (because I did not know transition was an option) and I built coping mechanisms around dissociating from my body. I became a very dysfunctional being for this period of time but one could easily say that my trans feelings had &amp;quot;gone away&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;At 23-24 I started to struggle with my gender dysphoria again but this time very openly. I was much more aware of trans issues and the option of transition so for the first time I was struggling not just with feelings and internal pain I didn&amp;#39;t understand but with an issue I could put a name on. Around the late part of my 24th year of life I officially diagnosed myself as &amp;quot;not trans&amp;quot; on the tail end of a particular mushroom trip and my feelings seemingly &amp;quot;went away&amp;quot;. By 26 I was such a miserable wreck of a person that I was seriously considering putting a bullet in my own head. By that summer I decided to transition and all the struggle and the dysfunction seemingly disappeared over night. But if you&amp;#39;d asked me at 14 or 17 or 25 if my trans feelings had gone away I would have said yes. Yet here I am.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen this particular narrative reflected by a lot of older transitioners who started in their late thirties or even as late as their 50s. They all will readily tell you that there were points in their life that the feelings &amp;quot;went away&amp;quot; but be quick to amend that really the feelings hadn&amp;#39;t gone away, they had just mustered enough psychic strength to repress the feelings for a time.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t understand the point of transitioning if you don&amp;#39;t have gender disphoria. It isn&amp;#39;t medically necessary and it is more likely for you to regret your transition if you don&amp;#39;t have it. Many people who appear to be going along with the &amp;quot;trend&amp;quot; of transgenderism say they don&amp;#39;t have to have gender disphoria to transition. It&amp;#39;s concerns me that they say this because I don&amp;#39;t want people who are going to be unhappy transitioning to transition. It could possibly make it harder for transgender people to transition in the future if a large number of people choose to detransition or commit suicide. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I would probably entirely agree with this point honestly. I hate the &amp;quot;you don&amp;#39;t have to have gender dysphoria to be trans&amp;quot; bullshit. That&amp;#39;s an argument for another day but I think it&amp;#39;s as absurd as saying &amp;quot;you don&amp;#39;t have to sexually prefer men to be a gay man&amp;quot;. You are arguing for a total lack of borders around any label in order to be as inclusive as possible, even when it robs your labels of any potency of meaning whatsoever. It&amp;#39;s dialectal nihilism.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m not arguing against your total view here actually as much as trying to weaken some of your black and white certainty in it. While I&amp;#39;m personally a little uncomfortable with actually allowing anyone younger than 16 to transition, I prefer to remain mostly agnostic on that issue since by and large it&amp;#39;s not up to me to dictate the terms of a treatment that should be between a patient and a qualified medical professional. I also understand that if I&amp;#39;d known at 13 what I do now, I would have signed up for at minimum puberty blockers right away, so that stays my judgement a little bit as well.&lt;/p&gt;\n\n&lt;p&gt;I would also like to talk about you a little bit. It seems like one of your main contentions is that people absent gender dysphoria should transition, and you describe how destransition regrets contribute to your own reluctance to transition, but do you not have gender dysphoria yourself? It seems that if you have gender dysphoria, then you&amp;#39;re not actually included in your own arguments and thus what should be a consideration for people without gender dysphoria shouldn&amp;#39;t be a consideration for yourself. If you want to transition and you have gender dysphoria, I cannot promise you that it won&amp;#39;t be a deep internal struggle for years to come. I cannot promise you that transitioning will entirely put to bed your struggle with your gender identity or your body. I can promise you that for those of us who are gender dysphoric it makes our lives a great deal easier than they were.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9dfsw", "score_hidden": false, "stickied": false, "created": 1492216537.0, "created_utc": 1492187737.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": "", "user_reports": [], "id": "dg5en8f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Eli5678", "parent_id": "t1_dg5e64o", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm fine with the parents raising them as the other gender, I just don't think that they should go on hormones. \n\nAlso, some parents see it as my child doesn't like traditionally masculine/feminine things they must be transgender. I don't believe most 4 year olds fully understand the concept of gender yet and there are parents claiming their toddlers are transgender. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m fine with the parents raising them as the other gender, I just don&amp;#39;t think that they should go on hormones. &lt;/p&gt;\n\n&lt;p&gt;Also, some parents see it as my child doesn&amp;#39;t like traditionally masculine/feminine things they must be transgender. I don&amp;#39;t believe most 4 year olds fully understand the concept of gender yet and there are parents claiming their toddlers are transgender. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5en8f", "score_hidden": false, "stickied": false, "created": 1491996426.0, "created_utc": 1491967626.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5e64o", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "cupcakesarethedevil", "parent_id": "t3_64vno9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "There are plenty of infants with serious birth defects, shouldn't their parents be able to make a call for them sooner and raise them one way or the other? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are plenty of infants with serious birth defects, shouldn&amp;#39;t their parents be able to make a call for them sooner and raise them one way or the other? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5e64o", "score_hidden": false, "stickied": false, "created": 1491995719.0, "created_utc": 1491966919.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5t2br", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kluizenaer", "parent_id": "t3_64vno9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I offer a radically opposed view. I think everyone should be able to start hormones for any reason they want even if it has nothing to do with gender identity shit.\n\nIf a cis woman just wants the benefit of increased muscles why should she not be allowed? If a boy doesn't want a lower voice for singing reasons why should he not be allowed?\n\nYeah, some people might regret it? So what, people including children make decisions they regret all the time.\n\nI really hate the idea that it _has_ to be about gender.\n\nI will say that in order for health insurance to cover it though it has to in the opinion of a psychiatrist be a medical thing. So indeed to treat some form of dysphoria maybe something else. Testosterone has been effectively used as an antidepressant in some cases so why not?\n\n&gt; I don't understand the point of transitioning if you don't have gender disphoria.\n\nMen have superior strength to women; why should a woman be denied that when it is medically available to her and she wants it?\n\n&gt; and it is more likely for you to regret your transition if you don't have it. Many people who appear to be going along with the \"trend\" of transgenderism say they don't have to have gender disphoria to transition. It's concerns me that they say this because I don't want people who are going to be unhappy transitioning to transition. It could possibly make it harder for transgender people to transition in the future if a large number of people choose to detransition or commit suicide.\n\nIt stands to reason that people who _don't_ have dysphoria are people for whom gender presentation is less to not important, as such they are less likely to care about it.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I offer a radically opposed view. I think everyone should be able to start hormones for any reason they want even if it has nothing to do with gender identity shit.&lt;/p&gt;\n\n&lt;p&gt;If a cis woman just wants the benefit of increased muscles why should she not be allowed? If a boy doesn&amp;#39;t want a lower voice for singing reasons why should he not be allowed?&lt;/p&gt;\n\n&lt;p&gt;Yeah, some people might regret it? So what, people including children make decisions they regret all the time.&lt;/p&gt;\n\n&lt;p&gt;I really hate the idea that it &lt;em&gt;has&lt;/em&gt; to be about gender.&lt;/p&gt;\n\n&lt;p&gt;I will say that in order for health insurance to cover it though it has to in the opinion of a psychiatrist be a medical thing. So indeed to treat some form of dysphoria maybe something else. Testosterone has been effectively used as an antidepressant in some cases so why not?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t understand the point of transitioning if you don&amp;#39;t have gender disphoria.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Men have superior strength to women; why should a woman be denied that when it is medically available to her and she wants it?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;and it is more likely for you to regret your transition if you don&amp;#39;t have it. Many people who appear to be going along with the &amp;quot;trend&amp;quot; of transgenderism say they don&amp;#39;t have to have gender disphoria to transition. It&amp;#39;s concerns me that they say this because I don&amp;#39;t want people who are going to be unhappy transitioning to transition. It could possibly make it harder for transgender people to transition in the future if a large number of people choose to detransition or commit suicide.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It stands to reason that people who &lt;em&gt;don&amp;#39;t&lt;/em&gt; have dysphoria are people for whom gender presentation is less to not important, as such they are less likely to care about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5t2br", "score_hidden": false, "stickied": false, "created": 1492029915.0, "created_utc": 1492001115.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": "", "user_reports": [], "id": "dgcvagy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jdm1891", "parent_id": "t3_64vno9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Under your line of thinking, no teenager has the mental capacity to consent to their own puberty. It has permanent effects right? You may like it you may not, but tough luck you get what you're given! Right? \n\nNow another thing, if you simply resort to puberty blockers, the brain doesn't develop. If you say a 12 year old should stay on blockers until their 16th birthday to make the decision, they haven't developed mentally in the slightest because you blocked the process that does that.\n\nFinally, if a child goes on hormones they will know if they don't like it. Just like trans people 'know' they don't like normal puberty. So there is a simple solution, try it, if it is not right for them they will know within a month long before any major effects. Sure there will always be people who regret it but this is inevitable no matter the age you start.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Under your line of thinking, no teenager has the mental capacity to consent to their own puberty. It has permanent effects right? You may like it you may not, but tough luck you get what you&amp;#39;re given! Right? &lt;/p&gt;\n\n&lt;p&gt;Now another thing, if you simply resort to puberty blockers, the brain doesn&amp;#39;t develop. If you say a 12 year old should stay on blockers until their 16th birthday to make the decision, they haven&amp;#39;t developed mentally in the slightest because you blocked the process that does that.&lt;/p&gt;\n\n&lt;p&gt;Finally, if a child goes on hormones they will know if they don&amp;#39;t like it. Just like trans people &amp;#39;know&amp;#39; they don&amp;#39;t like normal puberty. So there is a simple solution, try it, if it is not right for them they will know within a month long before any major effects. Sure there will always be people who regret it but this is inevitable no matter the age you start.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgcvagy", "score_hidden": true, "stickied": false, "created": 1492419766.0, "created_utc": 1492390966.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": "", "user_reports": [], "id": "dg6ziha", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dg6zi3m", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/kaijyuu ([3∆](/r/changemyview/wiki/user/kaijyuu)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"kaijyuu\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/kaijyuu\"&gt;/u/kaijyuu&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/kaijyuu\"&gt;3∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22kaijyuu%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6ziha", "score_hidden": false, "stickied": false, "created": 1492078639.0, "created_utc": 1492049839.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": "", "user_reports": [], "id": "dg7280x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kaijyuu", "parent_id": "t1_dg7113e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "it does matter, though. we'll all be dead eventually, but there's stuff worth doing in the meantime.\n\ni'd recommend talking to someone about how you're feeling. you deserve good things too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it does matter, though. we&amp;#39;ll all be dead eventually, but there&amp;#39;s stuff worth doing in the meantime.&lt;/p&gt;\n\n&lt;p&gt;i&amp;#39;d recommend talking to someone about how you&amp;#39;re feeling. you deserve good things too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg7280x", "score_hidden": false, "stickied": false, "created": 1492082158.0, "created_utc": 1492053358.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7113e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Eli5678", "parent_id": "t1_dg6zmqe", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It doesn't matter I'll be dead eventually anyways. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It doesn&amp;#39;t matter I&amp;#39;ll be dead eventually anyways. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg7113e", "score_hidden": false, "stickied": false, "created": 1492080561.0, "created_utc": 1492051761.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6zmqe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kaijyuu", "parent_id": "t1_dg6zi3m", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "thanks for the delta, but i hope you come to some peace about your situation, as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thanks for the delta, but i hope you come to some peace about your situation, as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6zmqe", "score_hidden": false, "stickied": false, "created": 1492078785.0, "created_utc": 1492049985.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6zi3m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Eli5678", "parent_id": "t1_dg6x09b", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm kinda too lazy to find it again. I can't remember where I heard it. You're right on that point it probably isn't 100% true !delta ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m kinda too lazy to find it again. I can&amp;#39;t remember where I heard it. You&amp;#39;re right on that point it probably isn&amp;#39;t 100% true !delta &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6zi3m", "score_hidden": false, "stickied": false, "created": 1492078625.0, "created_utc": 1492049825.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6x09b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kaijyuu", "parent_id": "t1_dg6vdlc", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "that's possible, sure, though i don't think there's any studies that have specifically followed up on that particular reasoning.\n\nas i said, i'd like to see a citation. because in the research *i* have done, nowhere does it say that 1/5 regret transitioning at all - at least, in reputable studies where the results aren't misread.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;that&amp;#39;s possible, sure, though i don&amp;#39;t think there&amp;#39;s any studies that have specifically followed up on that particular reasoning.&lt;/p&gt;\n\n&lt;p&gt;as i said, i&amp;#39;d like to see a citation. because in the research &lt;em&gt;i&lt;/em&gt; have done, nowhere does it say that 1/5 regret transitioning at all - at least, in reputable studies where the results aren&amp;#39;t misread.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6x09b", "score_hidden": false, "stickied": false, "created": 1492075530.0, "created_utc": 1492046730.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6vdlc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Eli5678", "parent_id": "t1_dg6ovh2", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Failure in transition (not passing) can also prompt suicide. I understand that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Failure in transition (not passing) can also prompt suicide. I understand that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6vdlc", "score_hidden": false, "stickied": false, "created": 1492073513.0, "created_utc": 1492044713.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ovh2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kaijyuu", "parent_id": "t3_64vno9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Some studies have been done that say up to 1/5 of transgender people regret their transition\n\ni'd like to see a citation regarding this that is vaguely recent and isn't quoted by [walt heyer](https://mediamatters.org/blog/2015/06/02/what-the-media-should-know-about-walt-heyer-and/203855). as far as i understand things, regret is not common, but suicide-wise, this is a population that already has a higher rate for suicide and the study results reflect that aspect, not that transition itself is necessarily what prompts the suicide.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Some studies have been done that say up to 1/5 of transgender people regret their transition&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;i&amp;#39;d like to see a citation regarding this that is vaguely recent and isn&amp;#39;t quoted by &lt;a href=\"https://mediamatters.org/blog/2015/06/02/what-the-media-should-know-about-walt-heyer-and/203855\"&gt;walt heyer&lt;/a&gt;. as far as i understand things, regret is not common, but suicide-wise, this is a population that already has a higher rate for suicide and the study results reflect that aspect, not that transition itself is necessarily what prompts the suicide.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6ovh2", "score_hidden": false, "stickied": false, "created": 1492065554.0, "created_utc": 1492036754.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64vno9", "likes": null, "replies": "", "user_reports": [], "id": "dga4rwm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GrandMa5TR", "parent_id": "t3_64vno9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sticky issue. On the one hand \"We don't let you get a tattoo before 18 so why the hell would we let you change your gender!\". But there is another side to it I assure you.\n\n1. Biologically you want to transition as early as possible to have a smooth transition. \n\n2. By not taking hormones, they are already experiencing the very feeling you are scared they will if they do take them. They have to watch their body grow and develop and further, and further  from how they see themselves. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sticky issue. On the one hand &amp;quot;We don&amp;#39;t let you get a tattoo before 18 so why the hell would we let you change your gender!&amp;quot;. But there is another side to it I assure you.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Biologically you want to transition as early as possible to have a smooth transition. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;By not taking hormones, they are already experiencing the very feeling you are scared they will if they do take them. They have to watch their body grow and develop and further, and further  from how they see themselves. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dga4rwm", "score_hidden": false, "stickied": false, "created": 1492250987.0, "created_utc": 1492222187.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]