[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A &amp;quot;smurf&amp;quot; is a player of a higher level who creates a new account to play with lower level players, they often self righteously claim that it helps the players, others are more honest and say that they do it to blow off steam from playing on a higher leveled account. (I don&amp;#39;t count alt characters in mmos as a smurf, because it&amp;#39;s not always directly pvp and opens a new experience leveling up). This cmv applies only for competitive ladders, I have no issues with having fun with friends.&lt;/p&gt;\n\n&lt;p&gt;In my eyes this is wrong for a number of reasons. It creates a steeper learning curve, which deters new players from wanting to play. It makes the queue timers at higher ranks longer, it wastes everyone&amp;#39;s time, and generally the account owners always end up winning a lot and getting it close to the rank they are smurfing from.&lt;/p&gt;\n\n&lt;p&gt;Here are a few examples I&amp;#39;ve heard as to why it&amp;#39;s a good think, and what I think of these reasons.&lt;/p&gt;\n\n&lt;p&gt;-blows off steam.\nThere are better ways to blow off steam, spend a few minutes playing html Tetris or a popular app.&lt;/p&gt;\n\n&lt;p&gt;-helps lower level players\nLower level players tend to not have enough game knowledge, or be introspective enough to be able to make an analysis of why they did poorly.&lt;/p&gt;\n\n&lt;p&gt;I would love to hear your responses, as I don&amp;#39;t enjoy having negative views on things. Thank you c:&lt;/p&gt;\n\n&lt;p&gt;Edit: competitive ladders, smurfing to have fun with friends is not an issue c:&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A \"smurf\" is a player of a higher level who creates a new account to play with lower level players, they often self righteously claim that it helps the players, others are more honest and say that they do it to blow off steam from playing on a higher leveled account. (I don't count alt characters in mmos as a smurf, because it's not always directly pvp and opens a new experience leveling up). This cmv applies only for competitive ladders, I have no issues with having fun with friends.\n\nIn my eyes this is wrong for a number of reasons. It creates a steeper learning curve, which deters new players from wanting to play. It makes the queue timers at higher ranks longer, it wastes everyone's time, and generally the account owners always end up winning a lot and getting it close to the rank they are smurfing from.\n\nHere are a few examples I've heard as to why it's a good think, and what I think of these reasons.\n\n-blows off steam.\nThere are better ways to blow off steam, spend a few minutes playing html Tetris or a popular app.\n\n-helps lower level players\nLower level players tend to not have enough game knowledge, or be introspective enough to be able to make an analysis of why they did poorly.\n\n\nI would love to hear your responses, as I don't enjoy having negative views on things. Thank you c:\n\nEdit: competitive ladders, smurfing to have fun with friends is not an issue c:", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64wbs4", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "Erynfi", "saved": false, "mod_reports": [], "name": "t3_64wbs4", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": 1491977791.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/64wbs4/cmv_in_video_gaming_smurf_accounts_are/", "num_reports": null, "locked": false, "stickied": false, "created": 1492004135.0, "url": "https://www.reddit.com/r/changemyview/comments/64wbs4/cmv_in_video_gaming_smurf_accounts_are/", "author_flair_text": null, "quarantine": false, "title": "CMV: In video gaming: smurf accounts are objectively bad for the community.", "created_utc": 1491975335.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5k8sg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "XXX69694206969XXX", "parent_id": "t1_dg5k1ez", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Maybe they rarely do that in your experience but not in mine. Most people who are better than me when I'm starting are either neutral or helpful. I remember back when I played WoW a dude explained all the tricks of the Deadmines to me. I was able to use the knowledge when I went back with groups of players of my same skill level. \n\nAnd if those game require a second copy or account that means that those people are contributing more the the developers. That in turn funds expansion and DLC development and the forums that noobs can go to if they need help. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe they rarely do that in your experience but not in mine. Most people who are better than me when I&amp;#39;m starting are either neutral or helpful. I remember back when I played WoW a dude explained all the tricks of the Deadmines to me. I was able to use the knowledge when I went back with groups of players of my same skill level. &lt;/p&gt;\n\n&lt;p&gt;And if those game require a second copy or account that means that those people are contributing more the the developers. That in turn funds expansion and DLC development and the forums that noobs can go to if they need help. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5k8sg", "score_hidden": false, "stickied": false, "created": 1492006818.0, "created_utc": 1491978018.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5k1ez", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Erynfi", "parent_id": "t1_dg5jye3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "See, but they rarely ever do. How many smurfs were you crushed by on the ladder who said nothing or called you bad? Yeah you bought it, but if you can't have fun at your rank then why play, why ruin someone else's fun when they paid money for it? And many games where people smurf ex: starcraft 2, CoD, LOL, csgo, require you to either buy another copy to smurf, or make a new account and level it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;See, but they rarely ever do. How many smurfs were you crushed by on the ladder who said nothing or called you bad? Yeah you bought it, but if you can&amp;#39;t have fun at your rank then why play, why ruin someone else&amp;#39;s fun when they paid money for it? And many games where people smurf ex: starcraft 2, CoD, LOL, csgo, require you to either buy another copy to smurf, or make a new account and level it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5k1ez", "score_hidden": false, "stickied": false, "created": 1492006336.0, "created_utc": 1491977536.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jye3", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "XXX69694206969XXX", "parent_id": "t3_64wbs4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "If I want to buy a game I'm going to play it. I shouldn't have to switch to Tetris because some moons might have a slightly less fun time. And you know what is an even less fun time? Me ganking some moons because I couldn't blow off steam and don't want to play Tetris. \n\nAnd a better player can explain to a noob what he did wrong so he can improve. I know that better players certainly have me some good tips back when I was a noob. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I want to buy a game I&amp;#39;m going to play it. I shouldn&amp;#39;t have to switch to Tetris because some moons might have a slightly less fun time. And you know what is an even less fun time? Me ganking some moons because I couldn&amp;#39;t blow off steam and don&amp;#39;t want to play Tetris. &lt;/p&gt;\n\n&lt;p&gt;And a better player can explain to a noob what he did wrong so he can improve. I know that better players certainly have me some good tips back when I was a noob. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5jye3", "score_hidden": false, "stickied": false, "created": 1492006135.0, "created_utc": 1491977335.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": "", "user_reports": [], "id": "dg5k3qs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Erynfi", "parent_id": "t1_dg5jyn2", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I should've specified, I meant mainly for competitive play, but you do make a good point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I should&amp;#39;ve specified, I meant mainly for competitive play, but you do make a good point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5k3qs", "score_hidden": false, "stickied": false, "created": 1492006492.0, "created_utc": 1491977692.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jyn2", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "HarpyBane", "parent_id": "t3_64wbs4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The point of many video games is to *have fun*. Depending on the game, playing on a smurf can significantly improve the ability to have fun with lower-skilled friends. \n\nSometimes, it's simply not feasible to play with friends on a non-smurf account. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The point of many video games is to &lt;em&gt;have fun&lt;/em&gt;. Depending on the game, playing on a smurf can significantly improve the ability to have fun with lower-skilled friends. &lt;/p&gt;\n\n&lt;p&gt;Sometimes, it&amp;#39;s simply not feasible to play with friends on a non-smurf account. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5jyn2", "score_hidden": false, "stickied": false, "created": 1492006152.0, "created_utc": 1491977352.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": "", "user_reports": [], "id": "dg6gks9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "championofobscurity", "parent_id": "t1_dg6fpto", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;&gt;the enjoyment of the stronger and happier the community is, the stronger and happier you should be\n\nThis isn't true at all. If I can login into a game and play with a minimal queue time that's all that matters. That is achieved without inviting every player on the street to play the game. That still happens despite smurfing.\n\n\n&gt;&gt;, it's making surfing seem like a selfish thing, and often the games who have players who surf require you to level up a new account, buy a New copy , or buy another premium account.\n\nSo? That is a person's prerogative to buy a new account. Again personal enjoyment.\n\n&gt;&gt;games need new players, there is an influx of new players and retiring players for every game, if the retiring players outnumber the new ones, a fame is considered dead. (Ex: Starcraft 2, the old metal of honor games, old unreal tournament games, really any call of Duty game, battlefield 3, etc.) The fewer players, the longer the queue times.\n\nThis isn't true. Starcraft II for example is only \"Dead\" because nobody watches it for Esports. It's still extremely playable. Shooters have a very fast shelf life no matter what, so they aren't a very good example of a lasting community anyway.\n\n\n&gt;&gt;3) assume it's like Challenger in LoL, there are (around?) 200 Challenger players on any given server, if 25 of them smurf (a relatively small amount) go to smurf, then the queue time gets around 1/4 longer, this is the difference between a 45 minute queue timer and a 60 minute (for example) which is a decent chunk of time. If you want to include the league below that then it would be around 1/8 of the players. So you're correct in saying that fewer players smurf because there aren't that many aren't the higher ranks, but the fewer players that do smurf make up aren't larger portion of the higher ranks.\n\nThis still doesn't answer my argument about your baseline assumption that if a person isn't going to smurf they are playing the game regardless. If you somehow disallowed them to smurf, there's nothing to suggest they would contribute to smaller queue times elsewhere because there is a third option of not playing the game in the first place.\n\n\n&gt;&gt;4) you're taking it out of context, a waste of time as far as video games go. If you consider that it is an entertainment medium, then getting pubstomped by players who are better effectively wastes time that you could use getting more entertainment out of a game, a close match is more entertaining than one team getting stomped. As for the higher level players, it wastes the time that they could spend practicing to get better, which is often the reason higher level competitive players play.\n\nIf that's your argument, then you might as well abstain from playing online games altogether. Even if player statistics SHOULD indicate a dead heat between two teams that doesn't mean a game will somehow not always come out one sided. Since developers cannot impliment a perfect system, there is just as much chance of having a one sided game regardless of smurfing, because eve with 0 smurfs accross your whole population you are still going to have pubstomps and one sided matches, and again since smurfs are a minority of a minority, they aren't going to impact the whole larger population.\n\n\n\n&gt;&gt;6) you're Correct that people should be playing games for enjoyment, but isn't it selfish to ruin the enjoyment of many others just so you can get a few kicks? See above for the reasons why it's bad.\n\nSo now you're making a moral argument. This goes beyond the scope of any of your other arguments and frankly goes outside the bounds of what I want to discuss with you. All I will say is this. It's equally selfish of you, to deny me the ability to play the game I want to play it. As an ethical egoist, I believe morals are subjective. I don't particularly care that the act is selfish personally. I don't buy games so that you can enjoy them. I buy them so I can enjoy them and with or without you playing the game, I am capable of doing that.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;the enjoyment of the stronger and happier the community is, the stronger and happier you should be&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This isn&amp;#39;t true at all. If I can login into a game and play with a minimal queue time that&amp;#39;s all that matters. That is achieved without inviting every player on the street to play the game. That still happens despite smurfing.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;, it&amp;#39;s making surfing seem like a selfish thing, and often the games who have players who surf require you to level up a new account, buy a New copy , or buy another premium account.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So? That is a person&amp;#39;s prerogative to buy a new account. Again personal enjoyment.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;games need new players, there is an influx of new players and retiring players for every game, if the retiring players outnumber the new ones, a fame is considered dead. (Ex: Starcraft 2, the old metal of honor games, old unreal tournament games, really any call of Duty game, battlefield 3, etc.) The fewer players, the longer the queue times.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This isn&amp;#39;t true. Starcraft II for example is only &amp;quot;Dead&amp;quot; because nobody watches it for Esports. It&amp;#39;s still extremely playable. Shooters have a very fast shelf life no matter what, so they aren&amp;#39;t a very good example of a lasting community anyway.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;3) assume it&amp;#39;s like Challenger in LoL, there are (around?) 200 Challenger players on any given server, if 25 of them smurf (a relatively small amount) go to smurf, then the queue time gets around 1/4 longer, this is the difference between a 45 minute queue timer and a 60 minute (for example) which is a decent chunk of time. If you want to include the league below that then it would be around 1/8 of the players. So you&amp;#39;re correct in saying that fewer players smurf because there aren&amp;#39;t that many aren&amp;#39;t the higher ranks, but the fewer players that do smurf make up aren&amp;#39;t larger portion of the higher ranks.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This still doesn&amp;#39;t answer my argument about your baseline assumption that if a person isn&amp;#39;t going to smurf they are playing the game regardless. If you somehow disallowed them to smurf, there&amp;#39;s nothing to suggest they would contribute to smaller queue times elsewhere because there is a third option of not playing the game in the first place.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;4) you&amp;#39;re taking it out of context, a waste of time as far as video games go. If you consider that it is an entertainment medium, then getting pubstomped by players who are better effectively wastes time that you could use getting more entertainment out of a game, a close match is more entertaining than one team getting stomped. As for the higher level players, it wastes the time that they could spend practicing to get better, which is often the reason higher level competitive players play.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If that&amp;#39;s your argument, then you might as well abstain from playing online games altogether. Even if player statistics SHOULD indicate a dead heat between two teams that doesn&amp;#39;t mean a game will somehow not always come out one sided. Since developers cannot impliment a perfect system, there is just as much chance of having a one sided game regardless of smurfing, because eve with 0 smurfs accross your whole population you are still going to have pubstomps and one sided matches, and again since smurfs are a minority of a minority, they aren&amp;#39;t going to impact the whole larger population.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;6) you&amp;#39;re Correct that people should be playing games for enjoyment, but isn&amp;#39;t it selfish to ruin the enjoyment of many others just so you can get a few kicks? See above for the reasons why it&amp;#39;s bad.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So now you&amp;#39;re making a moral argument. This goes beyond the scope of any of your other arguments and frankly goes outside the bounds of what I want to discuss with you. All I will say is this. It&amp;#39;s equally selfish of you, to deny me the ability to play the game I want to play it. As an ethical egoist, I believe morals are subjective. I don&amp;#39;t particularly care that the act is selfish personally. I don&amp;#39;t buy games so that you can enjoy them. I buy them so I can enjoy them and with or without you playing the game, I am capable of doing that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6gks9", "score_hidden": false, "stickied": false, "created": 1492056099.0, "created_utc": 1492027299.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6fpto", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Erynfi", "parent_id": "t1_dg6eiox", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "1) doesn't matter that you don't buy it for others enjoyment, the enjoyment of the stronger and happier the community is, the stronger and happier you should be, it's making surfing seem like a selfish thing, and often the games who have players who surf require you to level up a new account, buy a New copy , or buy another premium account.\n\n2) games need new players, there is an influx of new players and retiring players for every game, if the retiring players outnumber the new ones, a fame is considered dead. (Ex: Starcraft 2, the old metal of honor games, old unreal tournament games, really any call of Duty game, battlefield 3, etc.) The fewer players, the longer the queue times.\n\n3) assume it's like Challenger in LoL, there are (around?) 200 Challenger players on any given server, if 25 of them smurf (a relatively small amount) go to smurf, then the queue time gets around 1/4 longer, this is the difference between a 45 minute queue timer and a 60 minute (for example) which is a decent chunk of time. If you want to include the league below that then it would be around 1/8 of the players. So you're correct in saying that fewer players smurf because there aren't that many aren't the higher ranks, but the fewer players that do smurf make up aren't larger portion of the higher ranks.\n\n4) you're taking it out of context, a waste of time as far as video games go. If you consider that it is an *entertainment* medium, then getting pubstomped by players who are better effectively wastes time that you could use getting more entertainment out of a game, a close match is more entertaining than one team getting stomped. As for the higher level players, it wastes the time that they could spend practicing to get better, which is often the reason higher level competitive players play.\n\n5) that went along with the wasting of time part, because all it does is prevents players from climbing, and eliminates the whole reason of doing it in the first place, to play with lower level players.\n\n6) you're Correct that people should be playing games for enjoyment, but isn't it selfish to ruin the enjoyment of many others just so you can get a few kicks? See above for the reasons why it's bad.\n\nThank you for responding! Have a good day, and I can't wait to hear back from you again!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1) doesn&amp;#39;t matter that you don&amp;#39;t buy it for others enjoyment, the enjoyment of the stronger and happier the community is, the stronger and happier you should be, it&amp;#39;s making surfing seem like a selfish thing, and often the games who have players who surf require you to level up a new account, buy a New copy , or buy another premium account.&lt;/p&gt;\n\n&lt;p&gt;2) games need new players, there is an influx of new players and retiring players for every game, if the retiring players outnumber the new ones, a fame is considered dead. (Ex: Starcraft 2, the old metal of honor games, old unreal tournament games, really any call of Duty game, battlefield 3, etc.) The fewer players, the longer the queue times.&lt;/p&gt;\n\n&lt;p&gt;3) assume it&amp;#39;s like Challenger in LoL, there are (around?) 200 Challenger players on any given server, if 25 of them smurf (a relatively small amount) go to smurf, then the queue time gets around 1/4 longer, this is the difference between a 45 minute queue timer and a 60 minute (for example) which is a decent chunk of time. If you want to include the league below that then it would be around 1/8 of the players. So you&amp;#39;re correct in saying that fewer players smurf because there aren&amp;#39;t that many aren&amp;#39;t the higher ranks, but the fewer players that do smurf make up aren&amp;#39;t larger portion of the higher ranks.&lt;/p&gt;\n\n&lt;p&gt;4) you&amp;#39;re taking it out of context, a waste of time as far as video games go. If you consider that it is an &lt;em&gt;entertainment&lt;/em&gt; medium, then getting pubstomped by players who are better effectively wastes time that you could use getting more entertainment out of a game, a close match is more entertaining than one team getting stomped. As for the higher level players, it wastes the time that they could spend practicing to get better, which is often the reason higher level competitive players play.&lt;/p&gt;\n\n&lt;p&gt;5) that went along with the wasting of time part, because all it does is prevents players from climbing, and eliminates the whole reason of doing it in the first place, to play with lower level players.&lt;/p&gt;\n\n&lt;p&gt;6) you&amp;#39;re Correct that people should be playing games for enjoyment, but isn&amp;#39;t it selfish to ruin the enjoyment of many others just so you can get a few kicks? See above for the reasons why it&amp;#39;s bad.&lt;/p&gt;\n\n&lt;p&gt;Thank you for responding! Have a good day, and I can&amp;#39;t wait to hear back from you again!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6fpto", "score_hidden": false, "stickied": false, "created": 1492055225.0, "created_utc": 1492026425.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6eiox", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "championofobscurity", "parent_id": "t3_64wbs4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Frankly your argument is fundamentally counterintuitive. I don't buy/play video games for other people's enjoyment. I don't buy and play video games for \"our\" enjoyment. I buy and play them for *my* enjoyment. How I derive that enjoyment is a moot talking point as long as it follows the ToS and I do not risk having my license to the game  revoked.\n\n&gt;&gt;It creates a steeper learning curve, which deters new players from wanting to play. \n\nFor starters, you have to somehow substantiate the argument that a game needs new players in the first place. This \"the more the merrier\" argument is super flawed every time someone makes it. Passed a certain point (in the case of video games this is usually the point of low queue times) there's no *actual* practical reason to encourage new players to play. The people who play the game get what they want out of it, and that's really the end all be all outcome.\n\n\n&gt;&gt;It makes the queue timers at higher ranks longer\n\nThis is statistically immaterial. There are inherently less players at higher ranks because as the competition for anything gets more difficult the pool of players will be smaller. But just because people smurf does not meaningfully add to this queue time. Weather or not people smurf, higher rank queue times will be long and smurfing has little to no impact on this because smurfers at higher levels are bound to be an infinitesimally small minority of a minority. This also presupposes that they would be playing high ranked ladder matches if they weren't smurfing or allowed to smurf. That's not true at all, they could simply abstain from playing if they weren't smurfing so this argument kind of falls flat on its face. Unless you're blaming people not playing for long queue times as negative/bad people also.\n\n&gt;&gt;it wastes everyone's time\n\nWhen doesn't playing a videogame waste everyone's time? If this is honestly your concern you should study, or pick up extra shifts at work etc.\n\n\n&gt;&gt;and generally the account owners always end up winning a lot and getting it close to the rank they are smurfing from.\n\nI fail to see how this makes smurfing somehow worse than not smurfing? So they start a new account and do it all again?\n\n\n\n&gt;&gt;Here are a few examples I've heard as to why it's a good think, and what I think of these reasons.\n\nThere doesn't need to be a reason. People smurf for personal enjoyment. They are participating in a game in a capacity that brings them fulfillment. That's the only qualifier  that needs to be met here when we are talking about playing a game. Smurfing needs no counter arguments as to why it's good. You haven't really provided an argument as to why it's actually bad in the first place.\n\n\n\n\n\n", "edited": 1492025412.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Frankly your argument is fundamentally counterintuitive. I don&amp;#39;t buy/play video games for other people&amp;#39;s enjoyment. I don&amp;#39;t buy and play video games for &amp;quot;our&amp;quot; enjoyment. I buy and play them for &lt;em&gt;my&lt;/em&gt; enjoyment. How I derive that enjoyment is a moot talking point as long as it follows the ToS and I do not risk having my license to the game  revoked.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;It creates a steeper learning curve, which deters new players from wanting to play. &lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;For starters, you have to somehow substantiate the argument that a game needs new players in the first place. This &amp;quot;the more the merrier&amp;quot; argument is super flawed every time someone makes it. Passed a certain point (in the case of video games this is usually the point of low queue times) there&amp;#39;s no &lt;em&gt;actual&lt;/em&gt; practical reason to encourage new players to play. The people who play the game get what they want out of it, and that&amp;#39;s really the end all be all outcome.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;It makes the queue timers at higher ranks longer&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is statistically immaterial. There are inherently less players at higher ranks because as the competition for anything gets more difficult the pool of players will be smaller. But just because people smurf does not meaningfully add to this queue time. Weather or not people smurf, higher rank queue times will be long and smurfing has little to no impact on this because smurfers at higher levels are bound to be an infinitesimally small minority of a minority. This also presupposes that they would be playing high ranked ladder matches if they weren&amp;#39;t smurfing or allowed to smurf. That&amp;#39;s not true at all, they could simply abstain from playing if they weren&amp;#39;t smurfing so this argument kind of falls flat on its face. Unless you&amp;#39;re blaming people not playing for long queue times as negative/bad people also.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;it wastes everyone&amp;#39;s time&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;When doesn&amp;#39;t playing a videogame waste everyone&amp;#39;s time? If this is honestly your concern you should study, or pick up extra shifts at work etc.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;and generally the account owners always end up winning a lot and getting it close to the rank they are smurfing from.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I fail to see how this makes smurfing somehow worse than not smurfing? So they start a new account and do it all again?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Here are a few examples I&amp;#39;ve heard as to why it&amp;#39;s a good think, and what I think of these reasons.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There doesn&amp;#39;t need to be a reason. People smurf for personal enjoyment. They are participating in a game in a capacity that brings them fulfillment. That&amp;#39;s the only qualifier  that needs to be met here when we are talking about playing a game. Smurfing needs no counter arguments as to why it&amp;#39;s good. You haven&amp;#39;t really provided an argument as to why it&amp;#39;s actually bad in the first place.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6eiox", "score_hidden": false, "stickied": false, "created": 1492054000.0, "created_utc": 1492025200.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v1ls", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Jaysank", "parent_id": "t3_64wbs4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "My best reason is streaming. Some people make their entire lives streaming video games for a living. Take for example Niklas Högström, or Wagamama. He streams dor a living. At any time, he could have well over 10,000 people watching him play Dota 2. \n\nHowever, he plays so well that any account he plays on rapidly reaches the highest 1% of the 1% of MMR. This could mean queue times of up to an HOUR! In an hour, his entire viewership could plummet. How would you keep people here for DOTA entertained for an hour without playing? Right now, he is on his 4th smurf. Queue times are rarely longer than 10min and his viewers are happy. This is a good reason in my book.\n\nEdit: typo, also, tagging r/WagamamaW just in case.", "edited": 1492005312.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My best reason is streaming. Some people make their entire lives streaming video games for a living. Take for example Niklas Högström, or Wagamama. He streams dor a living. At any time, he could have well over 10,000 people watching him play Dota 2. &lt;/p&gt;\n\n&lt;p&gt;However, he plays so well that any account he plays on rapidly reaches the highest 1% of the 1% of MMR. This could mean queue times of up to an HOUR! In an hour, his entire viewership could plummet. How would you keep people here for DOTA entertained for an hour without playing? Right now, he is on his 4th smurf. Queue times are rarely longer than 10min and his viewers are happy. This is a good reason in my book.&lt;/p&gt;\n\n&lt;p&gt;Edit: typo, also, tagging &lt;a href=\"/r/WagamamaW\"&gt;r/WagamamaW&lt;/a&gt; just in case.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5v1ls", "score_hidden": false, "stickied": false, "created": 1492032903.0, "created_utc": 1492004103.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": "", "user_reports": [], "id": "dg5k5tx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LamiaQueen", "parent_id": "t3_64wbs4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Well, for starters, queue times can legitimately be much longer at higher levels because there's simply less people to play with. Yes, smurfing contributes to this, but it isn't the sole cause. And even if it is the sole cause, should people at that skill level be forced to wait for 30+ minutes just for a game waiting for enough people of their skill tier to want to join? Smurfing is a symptom of the queue times as much as a cause. \n\nMost multiplayer games have a steep learning curve to begin with, it's a matter of gitting gud enough to make a difference. Smurfing isn't going to make it steeper when it's such an individualized thing. \n\nWhy should people have to play a game they may not feel like playing like Tetris if they can't get a match in on the one they want to play? Yeah, they could, but they don't have to switch to Tetris or Solitaire. That's like telling someone if they want to go to a movie that they should just wait until it comes out on Netflix. If they don't want to wait, they shouldn't have to just because you think they might save a couple bucks. If they want to make a new account so they can play the game they want to play why shouldn't they?\n\nPlus there can be some subtle benefits to it. The more smurfs there are, the more devs can say their game is growing more popular. If it's a good game that's already spreading then people might jump on the bandwagon and also buy/play it, even though its popularity is a bit inflated. People may also spend more money on smurfs to get things like skins they like on both accounts, further supporting the game. Smurfs can also allow you to play in regions with friends in other countries or continents, making connections you otherwise wouldn't. \n\nSo yes, smurfing is annoying. There's nothing worse than getting pubstomped by a solo smurfer in a team game, for example. But it's not all bad on their end so at the very least you can just roll with it and move on if you get matched with a smurfer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, for starters, queue times can legitimately be much longer at higher levels because there&amp;#39;s simply less people to play with. Yes, smurfing contributes to this, but it isn&amp;#39;t the sole cause. And even if it is the sole cause, should people at that skill level be forced to wait for 30+ minutes just for a game waiting for enough people of their skill tier to want to join? Smurfing is a symptom of the queue times as much as a cause. &lt;/p&gt;\n\n&lt;p&gt;Most multiplayer games have a steep learning curve to begin with, it&amp;#39;s a matter of gitting gud enough to make a difference. Smurfing isn&amp;#39;t going to make it steeper when it&amp;#39;s such an individualized thing. &lt;/p&gt;\n\n&lt;p&gt;Why should people have to play a game they may not feel like playing like Tetris if they can&amp;#39;t get a match in on the one they want to play? Yeah, they could, but they don&amp;#39;t have to switch to Tetris or Solitaire. That&amp;#39;s like telling someone if they want to go to a movie that they should just wait until it comes out on Netflix. If they don&amp;#39;t want to wait, they shouldn&amp;#39;t have to just because you think they might save a couple bucks. If they want to make a new account so they can play the game they want to play why shouldn&amp;#39;t they?&lt;/p&gt;\n\n&lt;p&gt;Plus there can be some subtle benefits to it. The more smurfs there are, the more devs can say their game is growing more popular. If it&amp;#39;s a good game that&amp;#39;s already spreading then people might jump on the bandwagon and also buy/play it, even though its popularity is a bit inflated. People may also spend more money on smurfs to get things like skins they like on both accounts, further supporting the game. Smurfs can also allow you to play in regions with friends in other countries or continents, making connections you otherwise wouldn&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;So yes, smurfing is annoying. There&amp;#39;s nothing worse than getting pubstomped by a solo smurfer in a team game, for example. But it&amp;#39;s not all bad on their end so at the very least you can just roll with it and move on if you get matched with a smurfer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5k5tx", "score_hidden": false, "stickied": false, "created": 1492006626.0, "created_utc": 1491977826.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5l1e1", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Klarkson1273", "parent_id": "t3_64wbs4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I frequently will play my smurf account when practicing roles I am not as good at. For instance, in LoL I used to primarily play Mid lane, when the matchmaking system changed to make you select 2 lanes I practiced Top lane on my smurf account a lot do that I wouldn't drop ranks on my high level account. I have done the same thing now with jungling and will likely later practice other lanes like ADC. This allows me to play with people who are closer to the skill level of my non main lanes. Rather than playing against people who are substantially better than me and just ruining my random teammates game because I want to practice an off lane.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I frequently will play my smurf account when practicing roles I am not as good at. For instance, in LoL I used to primarily play Mid lane, when the matchmaking system changed to make you select 2 lanes I practiced Top lane on my smurf account a lot do that I wouldn&amp;#39;t drop ranks on my high level account. I have done the same thing now with jungling and will likely later practice other lanes like ADC. This allows me to play with people who are closer to the skill level of my non main lanes. Rather than playing against people who are substantially better than me and just ruining my random teammates game because I want to practice an off lane.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5l1e1", "score_hidden": false, "stickied": false, "created": 1492008807.0, "created_utc": 1491980007.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": "", "user_reports": [], "id": "dg5kvsz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PsychoPhilosopher", "parent_id": "t3_64wbs4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It really comes down to the number and pervasiveness of those accounts.\n\nGetting smoked by someone once in a while is no big deal, especially as it really can help in learning to play the game more effectively.  I particularly enjoyed playing Starcraft 2 and realizing partway through a match that I was horrendously behind (I never quite got the hang of managing a fourth base).  It gave me a chance to try pulling something weird and unexpected to see if I couldn't squeeze out a win or at least threaten someone well above.\n\nThe issue is when that becomes too common.  \n\nI'd say that having 1 in 10 matches be with a 'smurf' is probably the line for me.   Any more than that and it would be extremely frustrating.\n\nSo a small number of smurf accounts is fine (&lt;10% of the active playerbase), but it would be smart for community managers to seek out alternatives if it's starting to become an epidemic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It really comes down to the number and pervasiveness of those accounts.&lt;/p&gt;\n\n&lt;p&gt;Getting smoked by someone once in a while is no big deal, especially as it really can help in learning to play the game more effectively.  I particularly enjoyed playing Starcraft 2 and realizing partway through a match that I was horrendously behind (I never quite got the hang of managing a fourth base).  It gave me a chance to try pulling something weird and unexpected to see if I couldn&amp;#39;t squeeze out a win or at least threaten someone well above.&lt;/p&gt;\n\n&lt;p&gt;The issue is when that becomes too common.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d say that having 1 in 10 matches be with a &amp;#39;smurf&amp;#39; is probably the line for me.   Any more than that and it would be extremely frustrating.&lt;/p&gt;\n\n&lt;p&gt;So a small number of smurf accounts is fine (&amp;lt;10% of the active playerbase), but it would be smart for community managers to seek out alternatives if it&amp;#39;s starting to become an epidemic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5kvsz", "score_hidden": false, "stickied": false, "created": 1492008410.0, "created_utc": 1491979610.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": "", "user_reports": [], "id": "dg64rcs", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jark831", "parent_id": "t3_64wbs4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I would agree that smurfing is objectively bad, but only if the reasonable incentives to smurf were resolved.\n\nIn CSGO, it is impossible to play competitively with friends whose ranks differ significantly enough UNLESS you have a group of five friends. Many people don't have four other friends who all want to play the same game, at the same time, and competitively. Usually people are in groups of 2-3. If their ranks aren't close enough, the game does not allow them to play together. As a result, the only solution is to smurf. You might say that this ruins the game for others, but the inability to play with his friends ruins the game for the smurf. Smurfing isn't objectively bad as it currently stands because for some of them, it's the way to play with friends and have fun.\n\nIt's still always objectively bad if you're doing it just to be an asshole though.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would agree that smurfing is objectively bad, but only if the reasonable incentives to smurf were resolved.&lt;/p&gt;\n\n&lt;p&gt;In CSGO, it is impossible to play competitively with friends whose ranks differ significantly enough UNLESS you have a group of five friends. Many people don&amp;#39;t have four other friends who all want to play the same game, at the same time, and competitively. Usually people are in groups of 2-3. If their ranks aren&amp;#39;t close enough, the game does not allow them to play together. As a result, the only solution is to smurf. You might say that this ruins the game for others, but the inability to play with his friends ruins the game for the smurf. Smurfing isn&amp;#39;t objectively bad as it currently stands because for some of them, it&amp;#39;s the way to play with friends and have fun.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s still always objectively bad if you&amp;#39;re doing it just to be an asshole though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg64rcs", "score_hidden": false, "stickied": false, "created": 1492044019.0, "created_utc": 1492015219.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": "", "user_reports": [], "id": "dg5oetr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Erynfi", "parent_id": "t1_dg5oakp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I did a poor job of explaining it in the post because I was salty about losing my diamond starcraft tournament match to someone who was too good to be diamond, but I meant mainly for the purpose of only playing competitively, not with friends or anything, just to crush low ranked players because funsies", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did a poor job of explaining it in the post because I was salty about losing my diamond starcraft tournament match to someone who was too good to be diamond, but I meant mainly for the purpose of only playing competitively, not with friends or anything, just to crush low ranked players because funsies&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5oetr", "score_hidden": false, "stickied": false, "created": 1492018883.0, "created_utc": 1491990083.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5oakp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Vicious43", "parent_id": "t3_64wbs4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm actually guilty of smurfing myself. I'm the highest rank in rainbow six siege, arguably the most complex shooter out there. \n\nHowever, my friends are a bunch of scrubs, and if we go into a game together, the players who we play against will have ranks closer to mine, where my friends cannot even hope to compete. \n\nBy creating a smurf account, I'm able to play with my friend without him being completely destroyed. This allows better players to play with their friends who they ordinarily would have issues with, when gaming is meant to be about playing together. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m actually guilty of smurfing myself. I&amp;#39;m the highest rank in rainbow six siege, arguably the most complex shooter out there. &lt;/p&gt;\n\n&lt;p&gt;However, my friends are a bunch of scrubs, and if we go into a game together, the players who we play against will have ranks closer to mine, where my friends cannot even hope to compete. &lt;/p&gt;\n\n&lt;p&gt;By creating a smurf account, I&amp;#39;m able to play with my friend without him being completely destroyed. This allows better players to play with their friends who they ordinarily would have issues with, when gaming is meant to be about playing together. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5oakp", "score_hidden": false, "stickied": false, "created": 1492018511.0, "created_utc": 1491989711.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64wbs4", "likes": null, "replies": "", "user_reports": [], "id": "dg5krzg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "henrebotha", "parent_id": "t3_64wbs4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "One way in which competitive team games get new players is by recommendations from friends. I am more likely to try a new game if I know I can play it with my brother. However, most competitive games place limits on the allowable Elo difference between teammates. \n\nSmurfing solves this by giving experienced players a way to get new people into the game. Growing the player base is almost always good. \n\nTherefore, there exist at least some situations where smurfing is good for the community. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One way in which competitive team games get new players is by recommendations from friends. I am more likely to try a new game if I know I can play it with my brother. However, most competitive games place limits on the allowable Elo difference between teammates. &lt;/p&gt;\n\n&lt;p&gt;Smurfing solves this by giving experienced players a way to get new people into the game. Growing the player base is almost always good. &lt;/p&gt;\n\n&lt;p&gt;Therefore, there exist at least some situations where smurfing is good for the community. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5krzg", "score_hidden": false, "stickied": false, "created": 1492008139.0, "created_utc": 1491979339.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]