[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;During the last election, I was a Bernie supporter. Not because I agreed with everything he proposed, but because I agreed with his core strategy of focusing on issues of economic inequality and other issues that affect all or lots of Americans, and which have the potential to unite rather than divide most of the electorate.&lt;/p&gt;\n\n&lt;p&gt;But many of my liberal friends, as well as the HRC campaign, seemed to be following a two-pronged strategy of: 1) highlight grievances of various &amp;quot;marginalized&amp;quot; groups and 2) focus on flaws of Trump and Republicans. Conspicuously absent, in my view, was any focus on proposals that would make life better for a plurality of Americans (who weren&amp;#39;t in a marginalized group). I am not saying those proposals didn&amp;#39;t exist, I am saying I perceived a lack of focus on them. Moreover, concerns about economic issues, concerns about eternal middle East wars, lack of science funding, etc, were and are IMO generally swept aside on the grounds that the concerns of marginalized groups such as immigrants, LGBT, racial minorities, etc, trump issues that are of broader interest or of (subjectively to me) greater importance.&lt;/p&gt;\n\n&lt;p&gt;A common strategy to belittle those interested in these broader issues was to say that we just don&amp;#39;t understand the importance of, say, LGBT issues because we&amp;#39;re white males, &amp;quot;privileged&amp;quot;, &amp;quot;Berniebros&amp;quot;, etc.&lt;/p&gt;\n\n&lt;p&gt;I am not saying that &amp;quot;minority special-interest&amp;quot; issues aren&amp;#39;t important or shouldn&amp;#39;t be addressed, but that an obsessive focus on these issues by the left has and will continue to cost it dearly electorally. Essentially, that it is a bad strategy even if we were to assume that the primary goal should be to advance these minority interests, because there will not be sufficient votes using this strategy to get the power needed to advance them. This strategy is also a loser because it polarizes the electorate in a way that essentially pits the presumably privileged males and especially whites against everyone else, which writes off many potential voters.&lt;/p&gt;\n\n&lt;p&gt;WRT the second prong of the left&amp;#39;s current strategy, a focus on the problems of the Republicans, it suffers from the basic problem that, even if a potential voter agrees the Republicans are wrong, it doesn&amp;#39;t make the Democrats right, especially if the criticism is superficial and not based on policy (e.g., all the variants of &amp;quot;Trump is racist&amp;quot;).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;In short, my view is that Democrats and liberals should change their messaging and legislative strategy to focus primarily on a positive agenda to change things in a way that helps the greatest number of potential voters (issues like economics, science, etc), while not neglecting the concerns of its minority constituents, and that until they do so, they will continue to lose elections.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;This is a footnote from the CMV moderators. We&amp;#39;d like to remind you of a couple of things. Firstly, please&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules\"&gt;read through our rules&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting\"&gt;downvotes don&amp;#39;t change views&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;! Any questions or concerns? Feel free to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/message/compose?to=/r/changemyview\"&gt;message us&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;Happy CMVing!&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "During the last election, I was a Bernie supporter. Not because I agreed with everything he proposed, but because I agreed with his core strategy of focusing on issues of economic inequality and other issues that affect all or lots of Americans, and which have the potential to unite rather than divide most of the electorate.\n\nBut many of my liberal friends, as well as the HRC campaign, seemed to be following a two-pronged strategy of: 1) highlight grievances of various \"marginalized\" groups and 2) focus on flaws of Trump and Republicans. Conspicuously absent, in my view, was any focus on proposals that would make life better for a plurality of Americans (who weren't in a marginalized group). I am not saying those proposals didn't exist, I am saying I perceived a lack of focus on them. Moreover, concerns about economic issues, concerns about eternal middle East wars, lack of science funding, etc, were and are IMO generally swept aside on the grounds that the concerns of marginalized groups such as immigrants, LGBT, racial minorities, etc, trump issues that are of broader interest or of (subjectively to me) greater importance.\n\nA common strategy to belittle those interested in these broader issues was to say that we just don't understand the importance of, say, LGBT issues because we're white males, \"privileged\", \"Berniebros\", etc.\n\nI am not saying that \"minority special-interest\" issues aren't important or shouldn't be addressed, but that an obsessive focus on these issues by the left has and will continue to cost it dearly electorally. Essentially, that it is a bad strategy even if we were to assume that the primary goal should be to advance these minority interests, because there will not be sufficient votes using this strategy to get the power needed to advance them. This strategy is also a loser because it polarizes the electorate in a way that essentially pits the presumably privileged males and especially whites against everyone else, which writes off many potential voters.\n\nWRT the second prong of the left's current strategy, a focus on the problems of the Republicans, it suffers from the basic problem that, even if a potential voter agrees the Republicans are wrong, it doesn't make the Democrats right, especially if the criticism is superficial and not based on policy (e.g., all the variants of \"Trump is racist\").\n\n**In short, my view is that Democrats and liberals should change their messaging and legislative strategy to focus primarily on a positive agenda to change things in a way that helps the greatest number of potential voters (issues like economics, science, etc), while not neglecting the concerns of its minority constituents, and that until they do so, they will continue to lose elections.**\n_____\n\n&gt; *This is a footnote from the CMV moderators. We'd like to remind you of a couple of things. Firstly, please* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "[∆(s) from OP]", "id": "64xiv8", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 74, "report_reasons": null, "author": "gilescb", "saved": false, "mod_reports": [], "name": "t3_64xiv8", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": false, "link_flair_css_class": "OPdelta", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/64xiv8/cmv_american_liberalsdemocrats_are_making_a/", "num_reports": null, "locked": false, "stickied": false, "created": 1492024909.0, "url": "https://www.reddit.com/r/changemyview/comments/64xiv8/cmv_american_liberalsdemocrats_are_making_a/", "author_flair_text": null, "quarantine": false, "title": "CMV: American liberals/Democrats are making a long-term strategic mistake by focusing on social issues and Republicans' flaws rather than issues affecting many/most Americans", "created_utc": 1491996109.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 73, "visited": false, "subreddit_type": "public", "ups": 74}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg5sra1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t3_64xiv8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "/u/gilescb (OP) has awarded 4 deltas in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [**here**](/r/DeltaLog/comments/64xv9z), in /r/DeltaLog.\n\nPlease note that a change of view [doesn't necessarily mean a reversal](https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F), or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)", "edited": 1492035534.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/gilescb\"&gt;/u/gilescb&lt;/a&gt; (OP) has awarded 4 deltas in this post.&lt;/p&gt;\n\n&lt;p&gt;All comments that earned deltas (from OP or other users) are listed &lt;a href=\"/r/DeltaLog/comments/64xv9z\"&gt;&lt;strong&gt;here&lt;/strong&gt;&lt;/a&gt;, in &lt;a href=\"/r/DeltaLog\"&gt;/r/DeltaLog&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Please note that a change of view &lt;a href=\"https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F\"&gt;doesn&amp;#39;t necessarily mean a reversal&lt;/a&gt;, or that the conversation has ended.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5sra1", "score_hidden": true, "stickied": true, "created": 1492029399.0, "created_utc": 1492000599.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg66wzz", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg63ptr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Just so you know, these people aren't foreign to me\n\nGreat. I didn't know that before, obviously, but the fact that we come from similar backgrounds and have come to such different conclusions is all the more fascinating.\n\n&gt; Disadvantage for black people equals advantage for white people. period.\n\n&gt; liberals...want to achieve a better life for minorities at their expense.\n&gt;&gt; And they're wrong.\n\nAren't these two propositions mutually exclusive, or very close to it? Combined with these quotes:\n\n&gt; Gains before justice are thefts and exploitation\n\n&gt; Oh yes, we'll help black folks with that 10% pay gap someday, but for now let's just focus on getting everyone a 5% raise.\n\nI get the distinct impression you see almost all progress as zero-sum. Now, I know Reaganesque \"grow the pie\" philosophy has its limits, but in the grand scheme, there is some truth to it. Take the really long view: starting in 1600 to today, *everyone* is orders of magnitude better off, thanks to science and industry primarily, though inequality remains, both economic and demographic.\n\nAnd is it not true that if everyone in fact gets a 5% raise (ignore inflation), blacks are, in fact, better off? I am not excusing things like the pay gap, although I do think they are primarily a legacy phenomenon and have, and will continue to, decrease over time. Not to say that direct action isn't required.\n\nBut your concept, and I hope this isn't a caricature, that all demographic inequality must be eliminated before we address income/economic inequality seems absurd to me. You have agreed that being poor is worse than being black, ceteris paribus, so doesn't that imply that economic inequality is more burdensome than racial inequality and should therefore be tackled first? I do agree that a poor black gets more shit in life than a poor white, of course. It just seems that we agree that (rich - poor) &gt; (white - black), yes?\n\n&gt; Blue collar conservative whites choose not to listen to Democrats when they push for infrastructure overhauls...they take that, filter it through their lens of racial resentment, and decide they'd rather forgo ALL of that because a dime of it might go to a black person.\n\nThis is about the most uncharitable possible interpretation of their motives, and it doesn't align with my experience. There are a lot of reasons these people vote Republican, as you surely know, and many of the reasons have zero to do (directly) with bigotry. Religious reasons for one. They are being massively brainwashed is another. There is some truth in what you say but it is far from complete.\n\n&gt; If they want empathy, they have to show it, that's the compact within the Democratic party...The fact that they're willing to vote GOP at all is a huge red flag that they're fundamentally bereft of empathy.\n\nSo to be deserving of Democratic empathy, you have to be a Democrat. Got it. You know that \"you-scratch-my-back-and-I'll-scratch-yours\" empathy isn't really empathy, right? It's self-interest. So what happens when some previously marginalized group in the Democratic coalition \"gets theirs\"? Think they'll keep up with this bargain out of the goodness of their hearts?\n\nThis is actually extremely cynical, and it would confirm some of the worst fears of blue-collar whites (and me) if true: that the Democrats really aren't about justice, they're a collective bargaining agency for aligned groups to get as much as they possibly can out of everyone else. Every time someone asks \"how will we measure when equality has been reached for &lt;demographic group&gt;?\" and a Democrat has no cogent reply, a kitten dies.\n\n&gt; They're coming from a position from which practically zero empathy flows and demanding an extremely multicultural, multiracial, pluralistic party sideline everything to give them (what amounts to) near-exclusive attention. \n\nWhat? Suppose blue-collar whites said to the D party, \"we'll join up if you agree to focus on income inequality, unions, worker rights, and infrastructure\". This would amount to \"near-exclusive attention\"? When have blue-collar whites ever demanded they want policies to focus exclusively on them? Unlike other groups I could name.\n\nAnyway, I can tell this is a personal issue for you, as it is for me, and I just want to emphasize that even though some of our language is getting slightly heated, I very much appreciate your time here and hope to learn more from you.", "edited": 1492017670.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Just so you know, these people aren&amp;#39;t foreign to me&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Great. I didn&amp;#39;t know that before, obviously, but the fact that we come from similar backgrounds and have come to such different conclusions is all the more fascinating.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Disadvantage for black people equals advantage for white people. period.&lt;/p&gt;\n\n&lt;p&gt;liberals...want to achieve a better life for minorities at their expense.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And they&amp;#39;re wrong.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Aren&amp;#39;t these two propositions mutually exclusive, or very close to it? Combined with these quotes:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Gains before justice are thefts and exploitation&lt;/p&gt;\n\n&lt;p&gt;Oh yes, we&amp;#39;ll help black folks with that 10% pay gap someday, but for now let&amp;#39;s just focus on getting everyone a 5% raise.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I get the distinct impression you see almost all progress as zero-sum. Now, I know Reaganesque &amp;quot;grow the pie&amp;quot; philosophy has its limits, but in the grand scheme, there is some truth to it. Take the really long view: starting in 1600 to today, &lt;em&gt;everyone&lt;/em&gt; is orders of magnitude better off, thanks to science and industry primarily, though inequality remains, both economic and demographic.&lt;/p&gt;\n\n&lt;p&gt;And is it not true that if everyone in fact gets a 5% raise (ignore inflation), blacks are, in fact, better off? I am not excusing things like the pay gap, although I do think they are primarily a legacy phenomenon and have, and will continue to, decrease over time. Not to say that direct action isn&amp;#39;t required.&lt;/p&gt;\n\n&lt;p&gt;But your concept, and I hope this isn&amp;#39;t a caricature, that all demographic inequality must be eliminated before we address income/economic inequality seems absurd to me. You have agreed that being poor is worse than being black, ceteris paribus, so doesn&amp;#39;t that imply that economic inequality is more burdensome than racial inequality and should therefore be tackled first? I do agree that a poor black gets more shit in life than a poor white, of course. It just seems that we agree that (rich - poor) &amp;gt; (white - black), yes?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Blue collar conservative whites choose not to listen to Democrats when they push for infrastructure overhauls...they take that, filter it through their lens of racial resentment, and decide they&amp;#39;d rather forgo ALL of that because a dime of it might go to a black person.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is about the most uncharitable possible interpretation of their motives, and it doesn&amp;#39;t align with my experience. There are a lot of reasons these people vote Republican, as you surely know, and many of the reasons have zero to do (directly) with bigotry. Religious reasons for one. They are being massively brainwashed is another. There is some truth in what you say but it is far from complete.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If they want empathy, they have to show it, that&amp;#39;s the compact within the Democratic party...The fact that they&amp;#39;re willing to vote GOP at all is a huge red flag that they&amp;#39;re fundamentally bereft of empathy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So to be deserving of Democratic empathy, you have to be a Democrat. Got it. You know that &amp;quot;you-scratch-my-back-and-I&amp;#39;ll-scratch-yours&amp;quot; empathy isn&amp;#39;t really empathy, right? It&amp;#39;s self-interest. So what happens when some previously marginalized group in the Democratic coalition &amp;quot;gets theirs&amp;quot;? Think they&amp;#39;ll keep up with this bargain out of the goodness of their hearts?&lt;/p&gt;\n\n&lt;p&gt;This is actually extremely cynical, and it would confirm some of the worst fears of blue-collar whites (and me) if true: that the Democrats really aren&amp;#39;t about justice, they&amp;#39;re a collective bargaining agency for aligned groups to get as much as they possibly can out of everyone else. Every time someone asks &amp;quot;how will we measure when equality has been reached for &amp;lt;demographic group&amp;gt;?&amp;quot; and a Democrat has no cogent reply, a kitten dies.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;They&amp;#39;re coming from a position from which practically zero empathy flows and demanding an extremely multicultural, multiracial, pluralistic party sideline everything to give them (what amounts to) near-exclusive attention. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What? Suppose blue-collar whites said to the D party, &amp;quot;we&amp;#39;ll join up if you agree to focus on income inequality, unions, worker rights, and infrastructure&amp;quot;. This would amount to &amp;quot;near-exclusive attention&amp;quot;? When have blue-collar whites ever demanded they want policies to focus exclusively on them? Unlike other groups I could name.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I can tell this is a personal issue for you, as it is for me, and I just want to emphasize that even though some of our language is getting slightly heated, I very much appreciate your time here and hope to learn more from you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg66wzz", "score_hidden": false, "stickied": false, "created": 1492046235.0, "created_utc": 1492017435.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg7t04w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg7ob4v", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You make many great points. I wish I could award you a delta for sheer insightfulness but unfortunately I agree with pretty much everything you say.\n\n&gt; I don't exactly know to what extent this holds for Trump-supporters, but a significant amount of right-wing populist-voters are former (center)-left labor party voters. So even though such voters tend to hold bigotted views they can be won over, as long as they feel they have something to show for it.\n\nYes! This is one of my key points, expressed much more succinctly.\n\n&gt; The other (separate) dimension to consider whether it is also strategic to do so. The obvious advantage seems to me that a critique that is intersectional both recognizes the unique (dis)advantages of particular group, whilst still also offering a set of policies that are to the advantage of all the least well-off. By being systemic and economical in its approach you can also more easily counter racist narratives by pointing out that your motivation is to eventually help everyone.\n\nI'm not sure I follow, but I think the disconnect has to do with this:\n\n&gt; So the first factor for privileging a systemic critique (which I understand also as intersectional)\n\nThis is not what I understand \"intersectional\" to mean in practice in the US left. In practice, it means just what /u/groman28 was saying about identity-based coalitions: various marginalized *demographic* groups agree basically to collectively bargain.\n\nYou are saying, I think, that an \"help-all-poor\"/systematic/economic critique is by its very nature intersectional because it encompasses all the marginalized demographics at once, plus the poor from non-marginalized demographics. But this is not quite correct. For example, a rich Hollywood gay person would be fully covered and included under the Democrats' definition of intersectionality, whereas Bernie-style progressives would probably say that yes, that person shouldn't be discriminated against either and we should try to help, but they are not our primary area of focus. \n\nIn short, the conflict between the two definitions comes into play when you have a rich member of some marginalized demographic. Or, if you have a demographic that is a minority and historically persecuted, but generally is economically doing quite well (many Asians, Jews). \n\nOr even more basic, the conflict is about whether a person's primary *political* identity is based on class or demographics. And if, as the \"Democratic\" faction believes, it is based on demographics, then they feel slighted when class is given policy priority. I think these concepts are harder for us in the US to grasp because we have never really had a equivalent to a Labour party, and also because demographic conflicts are bigger for us because we're more demographically heterogeneous than most European countries.", "edited": 1492101663.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You make many great points. I wish I could award you a delta for sheer insightfulness but unfortunately I agree with pretty much everything you say.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t exactly know to what extent this holds for Trump-supporters, but a significant amount of right-wing populist-voters are former (center)-left labor party voters. So even though such voters tend to hold bigotted views they can be won over, as long as they feel they have something to show for it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes! This is one of my key points, expressed much more succinctly.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The other (separate) dimension to consider whether it is also strategic to do so. The obvious advantage seems to me that a critique that is intersectional both recognizes the unique (dis)advantages of particular group, whilst still also offering a set of policies that are to the advantage of all the least well-off. By being systemic and economical in its approach you can also more easily counter racist narratives by pointing out that your motivation is to eventually help everyone.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not sure I follow, but I think the disconnect has to do with this:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So the first factor for privileging a systemic critique (which I understand also as intersectional)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is not what I understand &amp;quot;intersectional&amp;quot; to mean in practice in the US left. In practice, it means just what &lt;a href=\"/u/groman28\"&gt;/u/groman28&lt;/a&gt; was saying about identity-based coalitions: various marginalized &lt;em&gt;demographic&lt;/em&gt; groups agree basically to collectively bargain.&lt;/p&gt;\n\n&lt;p&gt;You are saying, I think, that an &amp;quot;help-all-poor&amp;quot;/systematic/economic critique is by its very nature intersectional because it encompasses all the marginalized demographics at once, plus the poor from non-marginalized demographics. But this is not quite correct. For example, a rich Hollywood gay person would be fully covered and included under the Democrats&amp;#39; definition of intersectionality, whereas Bernie-style progressives would probably say that yes, that person shouldn&amp;#39;t be discriminated against either and we should try to help, but they are not our primary area of focus. &lt;/p&gt;\n\n&lt;p&gt;In short, the conflict between the two definitions comes into play when you have a rich member of some marginalized demographic. Or, if you have a demographic that is a minority and historically persecuted, but generally is economically doing quite well (many Asians, Jews). &lt;/p&gt;\n\n&lt;p&gt;Or even more basic, the conflict is about whether a person&amp;#39;s primary &lt;em&gt;political&lt;/em&gt; identity is based on class or demographics. And if, as the &amp;quot;Democratic&amp;quot; faction believes, it is based on demographics, then they feel slighted when class is given policy priority. I think these concepts are harder for us in the US to grasp because we have never really had a equivalent to a Labour party, and also because demographic conflicts are bigger for us because we&amp;#39;re more demographically heterogeneous than most European countries.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg7t04w", "score_hidden": false, "stickied": false, "created": 1492129927.0, "created_utc": 1492101127.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ob4v", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Kaasmoneyplaya", "parent_id": "t1_dg63ptr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "In my opinion there is a mix of factors that are at play here. The primary one being an ideological disagreement with the liberal establishment in the Democratic party, and the non-liberal/progressive left. Namely that Liberals basically adhere to capitalism, and therefore fail to recognize that capitalism is at the base of a lot of the problems people face today. It is this difference that is crucial and part of the reason that the democratic narrative on social justice issues falls flat. Because they are liberal, Democrats do not take the notion of intersectionality seriously. The abhorrent standards of living of female African-Americans for example, is not just explained by the fact that they are black and that they are women, but also their relative economic position. Any narrative that primarily focuses on the first two 'identity'-aspects is incomplete, for you cannot wholly separate social injustice from economic injustice. Because democrats do not engage in systematic critiques, they can never truly address social injustice. \n\nI remember this tweet going something along the lines of:\nBernie-supporter: we must fight racism and sexism\nHillary-supporter: yaassss\nBernie-supporter: ...and classism\nHillary-supporter: But what about sexism?\n\nAnd this really gets to the heart of the disagreements between the establishment and the proper left: the latter is systematic, and therefore more thorough, in its critique. \n\nIt also explains why a Hillary-supporter can honestly view Clinton as an outsider, as she is a women, while such notions are ridiculous to a Bernie-supporter, who also recognizes that Clinton is particularly privileged in her class (where I assume that these supporters have honest reasons for supporting either). \n\nSo the first factor for privileging a systemic critique (which I understand also as intersectional) is that it is simply more thorough and complete in its critique of society. \n\nThe other (separate) dimension to consider whether it is also strategic to do so. The obvious advantage seems to me that a critique that is intersectional both recognizes the unique (dis)advantages of particular group, whilst still also offering a set of policies that are to the advantage of all the least well-off. By being systemic and economical in its approach you can also more easily counter racist narratives by pointing out that your motivation is to eventually help everyone. This is easier if you are, again, systematic in your approach, instead of a more ad hoc 'public pressure' approach to identity politics. \n\nFinally it is important to be realistic about who you are trying to convince here. Right of the bat, I think it is 5-10% tops of Trump-supporters, an already small group of people (with disproportionate political power), that can be persuaded by such a message. Which would have been more then enough to ensure a Trump loss.\n\nI don't exactly know to what extent this holds for Trump-supporters, but a significant amount of right-wing populist-voters are former (center)-left labor party voters. So even though such voters tend to hold bigotted views they can be won over, as long as they feel they have something to show for it. I remember reading some qualitative research into (iirc) Rhode Island Trump-voters, where the racist language was often coated in 'I see all these minorities getting social benefits, why can't I get that?' indicating that there is room here to appeal to them without not appealing to minorities. \n\nIn my own country we had a liberal-labor coalition, where the labor party basically caved to the liberal party on economic issues, whilst it was probably most prolific when it comes to our policies towards refugees. That party suffered the biggest loss in seats in our history. I'm sure a significant part of their base isn't comfortable at all with the amount of muslim immigrants, but they also rationally have very little to show for their labor-vote. Again, there is room for an economic message here.\n\nSo basically in my mind it comes down to this: the Democratic party does too little for increasing the living standards for everyone in the US, whilst being heavily minority-focused when compared to the Republican Party. With the common sentiment being that both parties are subject to their 'corporate overlords' anyway. So in the minds of the stereotypical blue collar worker there is absolutely no reason to vote Democratic, at least the Republicans hate gays, blacks, foreigners and try to stop the 'killing of babies'. However, if the democrats also explicitly promote policies that benefit low-skill workers who feel they have little prospect of a better life, then all of a sudden they do have a reason to vote democratic. \n\nThat doesn't mean that a large part of them will switch, but the very least you can do is offer them a good reason to vote for you. ", "edited": 1492096376.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my opinion there is a mix of factors that are at play here. The primary one being an ideological disagreement with the liberal establishment in the Democratic party, and the non-liberal/progressive left. Namely that Liberals basically adhere to capitalism, and therefore fail to recognize that capitalism is at the base of a lot of the problems people face today. It is this difference that is crucial and part of the reason that the democratic narrative on social justice issues falls flat. Because they are liberal, Democrats do not take the notion of intersectionality seriously. The abhorrent standards of living of female African-Americans for example, is not just explained by the fact that they are black and that they are women, but also their relative economic position. Any narrative that primarily focuses on the first two &amp;#39;identity&amp;#39;-aspects is incomplete, for you cannot wholly separate social injustice from economic injustice. Because democrats do not engage in systematic critiques, they can never truly address social injustice. &lt;/p&gt;\n\n&lt;p&gt;I remember this tweet going something along the lines of:\nBernie-supporter: we must fight racism and sexism\nHillary-supporter: yaassss\nBernie-supporter: ...and classism\nHillary-supporter: But what about sexism?&lt;/p&gt;\n\n&lt;p&gt;And this really gets to the heart of the disagreements between the establishment and the proper left: the latter is systematic, and therefore more thorough, in its critique. &lt;/p&gt;\n\n&lt;p&gt;It also explains why a Hillary-supporter can honestly view Clinton as an outsider, as she is a women, while such notions are ridiculous to a Bernie-supporter, who also recognizes that Clinton is particularly privileged in her class (where I assume that these supporters have honest reasons for supporting either). &lt;/p&gt;\n\n&lt;p&gt;So the first factor for privileging a systemic critique (which I understand also as intersectional) is that it is simply more thorough and complete in its critique of society. &lt;/p&gt;\n\n&lt;p&gt;The other (separate) dimension to consider whether it is also strategic to do so. The obvious advantage seems to me that a critique that is intersectional both recognizes the unique (dis)advantages of particular group, whilst still also offering a set of policies that are to the advantage of all the least well-off. By being systemic and economical in its approach you can also more easily counter racist narratives by pointing out that your motivation is to eventually help everyone. This is easier if you are, again, systematic in your approach, instead of a more ad hoc &amp;#39;public pressure&amp;#39; approach to identity politics. &lt;/p&gt;\n\n&lt;p&gt;Finally it is important to be realistic about who you are trying to convince here. Right of the bat, I think it is 5-10% tops of Trump-supporters, an already small group of people (with disproportionate political power), that can be persuaded by such a message. Which would have been more then enough to ensure a Trump loss.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t exactly know to what extent this holds for Trump-supporters, but a significant amount of right-wing populist-voters are former (center)-left labor party voters. So even though such voters tend to hold bigotted views they can be won over, as long as they feel they have something to show for it. I remember reading some qualitative research into (iirc) Rhode Island Trump-voters, where the racist language was often coated in &amp;#39;I see all these minorities getting social benefits, why can&amp;#39;t I get that?&amp;#39; indicating that there is room here to appeal to them without not appealing to minorities. &lt;/p&gt;\n\n&lt;p&gt;In my own country we had a liberal-labor coalition, where the labor party basically caved to the liberal party on economic issues, whilst it was probably most prolific when it comes to our policies towards refugees. That party suffered the biggest loss in seats in our history. I&amp;#39;m sure a significant part of their base isn&amp;#39;t comfortable at all with the amount of muslim immigrants, but they also rationally have very little to show for their labor-vote. Again, there is room for an economic message here.&lt;/p&gt;\n\n&lt;p&gt;So basically in my mind it comes down to this: the Democratic party does too little for increasing the living standards for everyone in the US, whilst being heavily minority-focused when compared to the Republican Party. With the common sentiment being that both parties are subject to their &amp;#39;corporate overlords&amp;#39; anyway. So in the minds of the stereotypical blue collar worker there is absolutely no reason to vote Democratic, at least the Republicans hate gays, blacks, foreigners and try to stop the &amp;#39;killing of babies&amp;#39;. However, if the democrats also explicitly promote policies that benefit low-skill workers who feel they have little prospect of a better life, then all of a sudden they do have a reason to vote democratic. &lt;/p&gt;\n\n&lt;p&gt;That doesn&amp;#39;t mean that a large part of them will switch, but the very least you can do is offer them a good reason to vote for you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg7ob4v", "score_hidden": false, "stickied": false, "created": 1492124908.0, "created_utc": 1492096108.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg63ptr", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "groman28", "parent_id": "t1_dg60w69", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; First, would you agree that there is quite a lot of middle ground between \"social justice is the top priority\" and \"complete apathy towards it in an attempt to appease racists and bigots\"? \n\nThere is, but all of that middle ground is abhorrent to me. Gains before justice are thefts and exploitation, and those attitudes are exactly why so many of the marches we've taken towards social progress have taken *centuries* when they could have taken decades.\n\n&gt;I live in a deeply red state. Most of my family and many close friends are (mostly blue-collar) Republicans. Certainly they are straight and white. \n\nI lived in a deep red, rural county in the rust belt for the first 22 years of my life. Literally everyone there, including my family, are straight, white, blue-collar Republicans. Just so you know, these people aren't foreign to me, I don't hypothesize about them from my ivory tower in New York City. I know them intimately and I've spent more than my share of time at bars, bonfires, and shooting ranges with them.\n\n&gt;Privileged is debatable.\n\nIt's only debatable because most of these towns have &lt;1% non-white people, so the privilege is entirely invisible to them, not non-existent. Both political parties go out of their way to lionize coal miners and farmers and drill press operators, and to *never* blame them for their problems, *never* chide them for making use of government services, which is completely *opposite* how they themselves tend talk about minorities, single mothers, gay people, etc.\n\n&gt;\"Self-interest obsessed\" is really stretching it. Certainly they have self-interest in mind, just like every other demographic does.\n\nSure, but the demographics that make up the Democratic party balance self interest with mutual interest. Part of being on the left is learning about solidarity, paying it forward, and protesting on behalf of people whose problems are not the same as yours. You protest with and on behalf of each other, with the understanding that it comes back around. The one and only time I saw the right wing turn out for mass protests was when a black man was elected president.\n\n&gt;But they are also decent people who generally want to see injustice and discrimination addressed as long as it doesn't come primarily at their expense. Which is actually fair, I think, although it may sound a little selfish.\n\nNo, it's not fair, and it represents a fundamental misunderstanding of how injustice and discrimination work. You can't have your cake and eat it too. Disadvantage for black people equals advantage for white people. period. Every time a black resume is thrown in the garbage, all the white ones move that much closer to the top. Every black home buyer who's directed by real estate agents into shittier parts of town results in making those homes more sellable to racist whites. Every job that goes to a white person because racism knocked a black person out equals money in their pockets, equals investment into their communities, equals tax dollars for their schools. \n\n&gt;A lot of them know they are being screwed by the wealthy. A lot of them are very pro-union. They are reachable -- but the truth is they feel, and there is some validity to this, that liberals see them as the enemy rather than the real enemy, the super-rich, and want to achieve a better life for minorities at their expense.\n\nAnd they're wrong. None of the Democratic policies have \"non-whites only\" attached to them. The problem is that they're indignant not being the center of attention. When you go to a left wing event or activist circle, you go in knowing that the stage must be shared. Muslims get some time, Immigrants get some time, Black people get some time. Even then, at the end of the day, the majority of Democrats on TV are white people, but that's not enough for blue collar rural whites, for some reason. They must be on some kind of confirmation bias where they only notice the minorities speaking and tune out the 90% white people. \n\nI also highly doubt that this comes to them naturally. What you describe is a narrative that has been pumped into them for decades on talk radio and television, and it stretches back into the Civil Rights era, then back to Jim Crow. This state of affairs now is not distinct from the history of civil rights, it's only the latest chapter, these attitudes and resentments are the *direct descendents* of the ones that fought tooth and nail against equality every step of the way. I'm not willing to give up the ship now just because these people don't realize where they actually fit into history. Even many liberals simply don't understand this, they have a sort of blank slate image of social attitudes and don't understand how cultural transmission works between generations. What you're \"observing\" about the Democrats \"talking so much about minorities\" is a trope that's been rattling around in American politics for almost half a century now. \n\n&gt;Essentially I think that, although marginalized demographics face special challenges, it is much more of a handicap to be poor than it is to be a minority, although certainly being a minority increases the likelihood of you being poor. \n\nSure, but you put a poor black man and a poor white man next to each other, who's going to get more shit in life? Privilege must be examined on the basis of \"all else being equal\" or else it's inconclusive and has to be discarded. \n\n&gt;Social and economic issues are intertwined but not synonymous.\n\nI just don't see it that way. I think the division between the two is an illusion, set up by people who want to make the all-too-familiar pitch: \"Oh yes, we'll help black folks with that 10% pay gap someday, but for now let's just focus on getting **everyone** a 5% raise.\" Progress before equality is a promise that's been made and broken over, and over, and over again.\n\n&gt;I fit into a few marginalized categories myself. But I do know enough white conservatives personally to agree with the charge that liberals, while so full of empathy towards racial, ethnic, and religious minorities, are almost completely devoid of it towards blue-collar whites. Even assuming blue-collar whites are relatively better off than the other groups we're talking about, why does empathy have to be zero-sum?\n\nBlue collar conservative whites choose not to listen to Democrats when they push for infrastructure overhauls, minimum wage increases, protections for unions, universal healthcare and higher education, paid parental leave, subsidized or government-provided daycare, the list goes on. They take that, filter it through their lens of racial resentment, and decide they'd rather forgo ALL of that because a dime of it might go to a black person. As I said, I spent the first 22 years of my life in a deep red county in the rust belt, and all the conversations I had with white, blue collar conservatives eventually led to this. Sometimes you'd have to get them really angry before they'd admit it, but at the end of the day the attitude comes down to, \"Keep your hands out of my pocket, nigger.\" and as a result they're willing to cut off their noses to spite their faces.\n\nIf they want empathy, they have to show it, that's the compact within the Democratic party. Black activists chip in empathy for LGBT causes. White atheists chip in empathy for protecting Muslims from Islamophobia. Rich celebrities chip in empathy for the working poor. 10th generation Americans stand up for immigrants. Blue collar whites are welcome to join the coalition, but they have to see past themselves first, but instead they have a tendency to be bigoted themselves, or *at the very best* are quietly unbigoted and do nothing to fight bigotry. The fact that they're willing to vote GOP at all is a huge red flag that they're fundamentally bereft of empathy. As a result, any alliance extended to them by Democrats is by nature precarious and short-lived, and **necessarily** means sidelining all of the groups whom, when attention is paid to them, makes blue collar whites indignant. \n\nIt's just gross to me that someone defending blue collar conservative whites demand Democrats show some empathy. They're coming from a position from which practically zero empathy flows and demanding an extremely multicultural, multiracial, pluralistic party sideline everything to give them (what amounts to) near-exclusive attention. It's the most bratty and entitled and oblivious mindset I can imagine. Again, this is largely based on the people I know in the rust belt. They offer no sympathy to anyone unlike themselves (except the occasional black child in Africa, as long as that child *stays* in Africa), but expect everybody all over the country to drop what they're doing and solve their problems and theirs alone.\n\nI admire that you want to mend the relationship between Democrats and blue collar whites, but it's dismaying to me that your idea of mending it is 100% about Democrats bending and shirking their commitments and principles, while those blue collar whites get to stay the same forever and never fix the really stupid and shitty parts of their culture that they inherited and cling to. To me that just sounds like making their party into a populist Republican party clone, using the government to solve problems but through a lens where only solutions that benefit straight white men are prioritized. I'm going to go out on a limb here and say that the Democrats are fine, it's blue collar whites that need to improve, and as I said, I will spoil the shit out of every election from here on out if the Democrats bend on the fundamental identity of the party as one of a pluralistic compact between equals sharing a stage.  I could not bear to vote for a party that regularly abandons principles to protect the fragile egos of straight white men, and I've held my nose and pulled the lever for a **lot** of elections. If anything, the voice that Democrats offer to marginalized groups has been the one good that's kept me voting for them.", "edited": 1492014762.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;First, would you agree that there is quite a lot of middle ground between &amp;quot;social justice is the top priority&amp;quot; and &amp;quot;complete apathy towards it in an attempt to appease racists and bigots&amp;quot;? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There is, but all of that middle ground is abhorrent to me. Gains before justice are thefts and exploitation, and those attitudes are exactly why so many of the marches we&amp;#39;ve taken towards social progress have taken &lt;em&gt;centuries&lt;/em&gt; when they could have taken decades.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I live in a deeply red state. Most of my family and many close friends are (mostly blue-collar) Republicans. Certainly they are straight and white. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I lived in a deep red, rural county in the rust belt for the first 22 years of my life. Literally everyone there, including my family, are straight, white, blue-collar Republicans. Just so you know, these people aren&amp;#39;t foreign to me, I don&amp;#39;t hypothesize about them from my ivory tower in New York City. I know them intimately and I&amp;#39;ve spent more than my share of time at bars, bonfires, and shooting ranges with them.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Privileged is debatable.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s only debatable because most of these towns have &amp;lt;1% non-white people, so the privilege is entirely invisible to them, not non-existent. Both political parties go out of their way to lionize coal miners and farmers and drill press operators, and to &lt;em&gt;never&lt;/em&gt; blame them for their problems, &lt;em&gt;never&lt;/em&gt; chide them for making use of government services, which is completely &lt;em&gt;opposite&lt;/em&gt; how they themselves tend talk about minorities, single mothers, gay people, etc.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Self-interest obsessed&amp;quot; is really stretching it. Certainly they have self-interest in mind, just like every other demographic does.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sure, but the demographics that make up the Democratic party balance self interest with mutual interest. Part of being on the left is learning about solidarity, paying it forward, and protesting on behalf of people whose problems are not the same as yours. You protest with and on behalf of each other, with the understanding that it comes back around. The one and only time I saw the right wing turn out for mass protests was when a black man was elected president.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But they are also decent people who generally want to see injustice and discrimination addressed as long as it doesn&amp;#39;t come primarily at their expense. Which is actually fair, I think, although it may sound a little selfish.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, it&amp;#39;s not fair, and it represents a fundamental misunderstanding of how injustice and discrimination work. You can&amp;#39;t have your cake and eat it too. Disadvantage for black people equals advantage for white people. period. Every time a black resume is thrown in the garbage, all the white ones move that much closer to the top. Every black home buyer who&amp;#39;s directed by real estate agents into shittier parts of town results in making those homes more sellable to racist whites. Every job that goes to a white person because racism knocked a black person out equals money in their pockets, equals investment into their communities, equals tax dollars for their schools. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A lot of them know they are being screwed by the wealthy. A lot of them are very pro-union. They are reachable -- but the truth is they feel, and there is some validity to this, that liberals see them as the enemy rather than the real enemy, the super-rich, and want to achieve a better life for minorities at their expense.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And they&amp;#39;re wrong. None of the Democratic policies have &amp;quot;non-whites only&amp;quot; attached to them. The problem is that they&amp;#39;re indignant not being the center of attention. When you go to a left wing event or activist circle, you go in knowing that the stage must be shared. Muslims get some time, Immigrants get some time, Black people get some time. Even then, at the end of the day, the majority of Democrats on TV are white people, but that&amp;#39;s not enough for blue collar rural whites, for some reason. They must be on some kind of confirmation bias where they only notice the minorities speaking and tune out the 90% white people. &lt;/p&gt;\n\n&lt;p&gt;I also highly doubt that this comes to them naturally. What you describe is a narrative that has been pumped into them for decades on talk radio and television, and it stretches back into the Civil Rights era, then back to Jim Crow. This state of affairs now is not distinct from the history of civil rights, it&amp;#39;s only the latest chapter, these attitudes and resentments are the &lt;em&gt;direct descendents&lt;/em&gt; of the ones that fought tooth and nail against equality every step of the way. I&amp;#39;m not willing to give up the ship now just because these people don&amp;#39;t realize where they actually fit into history. Even many liberals simply don&amp;#39;t understand this, they have a sort of blank slate image of social attitudes and don&amp;#39;t understand how cultural transmission works between generations. What you&amp;#39;re &amp;quot;observing&amp;quot; about the Democrats &amp;quot;talking so much about minorities&amp;quot; is a trope that&amp;#39;s been rattling around in American politics for almost half a century now. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Essentially I think that, although marginalized demographics face special challenges, it is much more of a handicap to be poor than it is to be a minority, although certainly being a minority increases the likelihood of you being poor. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sure, but you put a poor black man and a poor white man next to each other, who&amp;#39;s going to get more shit in life? Privilege must be examined on the basis of &amp;quot;all else being equal&amp;quot; or else it&amp;#39;s inconclusive and has to be discarded. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Social and economic issues are intertwined but not synonymous.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I just don&amp;#39;t see it that way. I think the division between the two is an illusion, set up by people who want to make the all-too-familiar pitch: &amp;quot;Oh yes, we&amp;#39;ll help black folks with that 10% pay gap someday, but for now let&amp;#39;s just focus on getting &lt;strong&gt;everyone&lt;/strong&gt; a 5% raise.&amp;quot; Progress before equality is a promise that&amp;#39;s been made and broken over, and over, and over again.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I fit into a few marginalized categories myself. But I do know enough white conservatives personally to agree with the charge that liberals, while so full of empathy towards racial, ethnic, and religious minorities, are almost completely devoid of it towards blue-collar whites. Even assuming blue-collar whites are relatively better off than the other groups we&amp;#39;re talking about, why does empathy have to be zero-sum?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Blue collar conservative whites choose not to listen to Democrats when they push for infrastructure overhauls, minimum wage increases, protections for unions, universal healthcare and higher education, paid parental leave, subsidized or government-provided daycare, the list goes on. They take that, filter it through their lens of racial resentment, and decide they&amp;#39;d rather forgo ALL of that because a dime of it might go to a black person. As I said, I spent the first 22 years of my life in a deep red county in the rust belt, and all the conversations I had with white, blue collar conservatives eventually led to this. Sometimes you&amp;#39;d have to get them really angry before they&amp;#39;d admit it, but at the end of the day the attitude comes down to, &amp;quot;Keep your hands out of my pocket, nigger.&amp;quot; and as a result they&amp;#39;re willing to cut off their noses to spite their faces.&lt;/p&gt;\n\n&lt;p&gt;If they want empathy, they have to show it, that&amp;#39;s the compact within the Democratic party. Black activists chip in empathy for LGBT causes. White atheists chip in empathy for protecting Muslims from Islamophobia. Rich celebrities chip in empathy for the working poor. 10th generation Americans stand up for immigrants. Blue collar whites are welcome to join the coalition, but they have to see past themselves first, but instead they have a tendency to be bigoted themselves, or &lt;em&gt;at the very best&lt;/em&gt; are quietly unbigoted and do nothing to fight bigotry. The fact that they&amp;#39;re willing to vote GOP at all is a huge red flag that they&amp;#39;re fundamentally bereft of empathy. As a result, any alliance extended to them by Democrats is by nature precarious and short-lived, and &lt;strong&gt;necessarily&lt;/strong&gt; means sidelining all of the groups whom, when attention is paid to them, makes blue collar whites indignant. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just gross to me that someone defending blue collar conservative whites demand Democrats show some empathy. They&amp;#39;re coming from a position from which practically zero empathy flows and demanding an extremely multicultural, multiracial, pluralistic party sideline everything to give them (what amounts to) near-exclusive attention. It&amp;#39;s the most bratty and entitled and oblivious mindset I can imagine. Again, this is largely based on the people I know in the rust belt. They offer no sympathy to anyone unlike themselves (except the occasional black child in Africa, as long as that child &lt;em&gt;stays&lt;/em&gt; in Africa), but expect everybody all over the country to drop what they&amp;#39;re doing and solve their problems and theirs alone.&lt;/p&gt;\n\n&lt;p&gt;I admire that you want to mend the relationship between Democrats and blue collar whites, but it&amp;#39;s dismaying to me that your idea of mending it is 100% about Democrats bending and shirking their commitments and principles, while those blue collar whites get to stay the same forever and never fix the really stupid and shitty parts of their culture that they inherited and cling to. To me that just sounds like making their party into a populist Republican party clone, using the government to solve problems but through a lens where only solutions that benefit straight white men are prioritized. I&amp;#39;m going to go out on a limb here and say that the Democrats are fine, it&amp;#39;s blue collar whites that need to improve, and as I said, I will spoil the shit out of every election from here on out if the Democrats bend on the fundamental identity of the party as one of a pluralistic compact between equals sharing a stage.  I could not bear to vote for a party that regularly abandons principles to protect the fragile egos of straight white men, and I&amp;#39;ve held my nose and pulled the lever for a &lt;strong&gt;lot&lt;/strong&gt; of elections. If anything, the voice that Democrats offer to marginalized groups has been the one good that&amp;#39;s kept me voting for them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg63ptr", "score_hidden": false, "stickied": false, "created": 1492042933.0, "created_utc": 1492014133.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 39}}], "after": null, "before": null}}, "user_reports": [], "id": "dg60w69", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg5u2rf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Perfect. Your position was exactly what I had in mind when I wrote this post, and I look forward to hearing your perspective.\n\nFirst, would you agree that there is quite a lot of middle ground between \"social justice is the top priority\" and \"complete apathy towards it in an attempt to appease racists and bigots\"? \n\nI'm certainly not suggesting liberals stop talking about these issues or attempting to fight for them, only that they be repositioned as part of a more general message: there are a lot of Americans who are not doing well, for various reasons. Some of those reasons are institutionalized discrimination. Some of them, like the woes of Appalachian and blue-collar whites, are economic. We want justice for all, and we want everyone to be able to live a decent life, regardless of demographics. The solution to these problems will be multifaceted and may include both targeted efforts to reduce discrimination towards specific groups as well as broader efforts to help the poor of all backgrounds.\n\n&gt; Do you really think they can compete with the Republicans for the \"self-interest obsessed, privileged, straight white men and women\" demographic, while losing people who are disgusted by that kind of political opportunism?\n\nI live in a deeply red state. Most of my family and many close friends are (mostly blue-collar) Republicans. Certainly they are straight and white. Privileged is debatable. \"Self-interest obsessed\" is really stretching it. Certainly they have self-interest in mind, just like every other demographic does. But they are also decent people who generally want to see injustice and discrimination addressed *as long as it doesn't come primarily at their expense*. Which is actually fair, I think, although it may sound a little selfish.\n\nA lot of them know they are being screwed by the wealthy. A lot of them are very pro-union. They *are* reachable -- but the truth is they feel, and there is some validity to this, that liberals see *them* as the enemy rather than the real enemy, the super-rich, and want to achieve a better life for minorities at their expense.\n\n&gt; Social issues are economic issues. Minimum wage increases don't mean shit if racist or homophobic employers are dumping your resumes in the garbage, and the distribution of things like tax burden impact the overall social stratification of our society.\n\nThis is partially true but goes too far IMO. Tax is a very good example. If you tax the poor less and the rich more, then everyone at the bottom benefits, regardless of their race, etc. Essentially I think that, although marginalized demographics face special challenges, it is much more of a handicap to be poor than it is to be a minority, although certainly being a minority increases the likelihood of you being poor. Social and economic issues are intertwined but not synonymous.\n\nI'm not a conservative, and if we have to go there, I fit into a few marginalized categories myself. But I do know enough white conservatives personally to agree with the charge that liberals, while so full of empathy towards racial, ethnic, and religious minorities, are almost completely devoid of it towards blue-collar whites. Even assuming blue-collar whites are relatively better off than the other groups we're talking about, why does empathy have to be zero-sum?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Perfect. Your position was exactly what I had in mind when I wrote this post, and I look forward to hearing your perspective.&lt;/p&gt;\n\n&lt;p&gt;First, would you agree that there is quite a lot of middle ground between &amp;quot;social justice is the top priority&amp;quot; and &amp;quot;complete apathy towards it in an attempt to appease racists and bigots&amp;quot;? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m certainly not suggesting liberals stop talking about these issues or attempting to fight for them, only that they be repositioned as part of a more general message: there are a lot of Americans who are not doing well, for various reasons. Some of those reasons are institutionalized discrimination. Some of them, like the woes of Appalachian and blue-collar whites, are economic. We want justice for all, and we want everyone to be able to live a decent life, regardless of demographics. The solution to these problems will be multifaceted and may include both targeted efforts to reduce discrimination towards specific groups as well as broader efforts to help the poor of all backgrounds.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Do you really think they can compete with the Republicans for the &amp;quot;self-interest obsessed, privileged, straight white men and women&amp;quot; demographic, while losing people who are disgusted by that kind of political opportunism?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I live in a deeply red state. Most of my family and many close friends are (mostly blue-collar) Republicans. Certainly they are straight and white. Privileged is debatable. &amp;quot;Self-interest obsessed&amp;quot; is really stretching it. Certainly they have self-interest in mind, just like every other demographic does. But they are also decent people who generally want to see injustice and discrimination addressed &lt;em&gt;as long as it doesn&amp;#39;t come primarily at their expense&lt;/em&gt;. Which is actually fair, I think, although it may sound a little selfish.&lt;/p&gt;\n\n&lt;p&gt;A lot of them know they are being screwed by the wealthy. A lot of them are very pro-union. They &lt;em&gt;are&lt;/em&gt; reachable -- but the truth is they feel, and there is some validity to this, that liberals see &lt;em&gt;them&lt;/em&gt; as the enemy rather than the real enemy, the super-rich, and want to achieve a better life for minorities at their expense.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Social issues are economic issues. Minimum wage increases don&amp;#39;t mean shit if racist or homophobic employers are dumping your resumes in the garbage, and the distribution of things like tax burden impact the overall social stratification of our society.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is partially true but goes too far IMO. Tax is a very good example. If you tax the poor less and the rich more, then everyone at the bottom benefits, regardless of their race, etc. Essentially I think that, although marginalized demographics face special challenges, it is much more of a handicap to be poor than it is to be a minority, although certainly being a minority increases the likelihood of you being poor. Social and economic issues are intertwined but not synonymous.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not a conservative, and if we have to go there, I fit into a few marginalized categories myself. But I do know enough white conservatives personally to agree with the charge that liberals, while so full of empathy towards racial, ethnic, and religious minorities, are almost completely devoid of it towards blue-collar whites. Even assuming blue-collar whites are relatively better off than the other groups we&amp;#39;re talking about, why does empathy have to be zero-sum?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg60w69", "score_hidden": false, "stickied": false, "created": 1492039871.0, "created_utc": 1492011071.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5u2rf", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "groman28", "parent_id": "t3_64xiv8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;This strategy is also a loser because it polarizes the electorate in a way that essentially pits the presumably privileged males and especially whites against everyone else, which writes off many potential voters.\n\nI'm a white male who votes Democratic because they at least make an effort at justice and fairness. I don't care one lick for advancing my personal interests if it comes at the cost of ignoring issues of more vulnerable social groups, those would be ill-gotten gains. Once you do that, in my opinion, you become directly complicit in the power structures that have been fucking them over for so long. The moment Democrats start to sideline minority or LGBT issues for \"broader appeal\" (read: try harder to not alienate racists and other bigots) then they lose my vote, and the votes of **a lot** of people like me. \n\nDemocrats can maybe snag a number of moderates who feel roughly the same way as you, and maybe they can get some white males who don't care about justice or fairness, but they will lose the soul of their party and all the voters like me in the process. Democrats already offer plenty of policies and programs that affect the vast, vast majority of Americans, but they get flak like the kind you're dishing out here simply for *talking* about helping minorities and women, for *making speeches*. If the Democratic party becomes afraid to *even talk* about social issues where justice and fairness are at stake, and justice and fairness are top priorities for voters like me, why should I turn out to vote at all? Why shouldn't I just endlessly try to spoil elections for them by voting third party or turning their primaries into zoos until they get the message that justice is non-negotiable?\n\nDo you really think they can compete with the Republicans for the \"self-interest obsessed, privileged, straight white men and women\" demographic, *while* losing people who are disgusted by that kind of political opportunism? \n\nAnd that's just *me*, a white male. What is going to happen to turnout on the part of actual minority groups when the Democrats wont even recognize in public the issues they face uniquely because of their position as minorities? How, then, are they any different from Republicans? Social issues *are* economic issues. Minimum wage increases don't mean shit if racist or homophobic employers are dumping your resumes in the garbage, and the distribution of things like tax burden impact the overall social stratification of our society.", "edited": 1492005974.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;This strategy is also a loser because it polarizes the electorate in a way that essentially pits the presumably privileged males and especially whites against everyone else, which writes off many potential voters.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m a white male who votes Democratic because they at least make an effort at justice and fairness. I don&amp;#39;t care one lick for advancing my personal interests if it comes at the cost of ignoring issues of more vulnerable social groups, those would be ill-gotten gains. Once you do that, in my opinion, you become directly complicit in the power structures that have been fucking them over for so long. The moment Democrats start to sideline minority or LGBT issues for &amp;quot;broader appeal&amp;quot; (read: try harder to not alienate racists and other bigots) then they lose my vote, and the votes of &lt;strong&gt;a lot&lt;/strong&gt; of people like me. &lt;/p&gt;\n\n&lt;p&gt;Democrats can maybe snag a number of moderates who feel roughly the same way as you, and maybe they can get some white males who don&amp;#39;t care about justice or fairness, but they will lose the soul of their party and all the voters like me in the process. Democrats already offer plenty of policies and programs that affect the vast, vast majority of Americans, but they get flak like the kind you&amp;#39;re dishing out here simply for &lt;em&gt;talking&lt;/em&gt; about helping minorities and women, for &lt;em&gt;making speeches&lt;/em&gt;. If the Democratic party becomes afraid to &lt;em&gt;even talk&lt;/em&gt; about social issues where justice and fairness are at stake, and justice and fairness are top priorities for voters like me, why should I turn out to vote at all? Why shouldn&amp;#39;t I just endlessly try to spoil elections for them by voting third party or turning their primaries into zoos until they get the message that justice is non-negotiable?&lt;/p&gt;\n\n&lt;p&gt;Do you really think they can compete with the Republicans for the &amp;quot;self-interest obsessed, privileged, straight white men and women&amp;quot; demographic, &lt;em&gt;while&lt;/em&gt; losing people who are disgusted by that kind of political opportunism? &lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s just &lt;em&gt;me&lt;/em&gt;, a white male. What is going to happen to turnout on the part of actual minority groups when the Democrats wont even recognize in public the issues they face uniquely because of their position as minorities? How, then, are they any different from Republicans? Social issues &lt;em&gt;are&lt;/em&gt; economic issues. Minimum wage increases don&amp;#39;t mean shit if racist or homophobic employers are dumping your resumes in the garbage, and the distribution of things like tax burden impact the overall social stratification of our society.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5u2rf", "score_hidden": false, "stickied": false, "created": 1492031512.0, "created_utc": 1492002712.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg6gdmj", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "FelixFelicia", "parent_id": "t1_dg6cc9n", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The difference between the two examples is that in #1 a person with real-life experience has a more credible viewpoint than a person without that experience and in #2 a person with tangential experience is telling something without that experience that their opinion has no value at all.  A black person will almost always be more credible on black issues than a non black person.  But just because you are an outsider and come from a privileged position doesn't mean your opinion has no value at all-- and as you point out there are times when people treat the privileged that way (like they have no business even having an opinion on something).  What is important is that the privileged person recognize their privilege and not discount the real-life experience of the person inside the situation.  It is possible that John, being a white guy with a PhD and relevant field experience in race politics might actually be more credible than random Brenda but I think it is unlikely.  For instance, say Brenda was actually African and came from an economically privileged position in a black African nation.  She likely wouldn't be as credible as John in that scenario on BLM issues. \n\nExample: Abe is in a wheel chair and Jenny is able-bodied.  Abe tells Jenny how he hard it is for him because his bank has crappy accomodations for the disabled-- he has to enter through the ramp at the back of the building where they haul out the trash; he has to wait for someone at the desk to service him because he can't reach the teller windows; he always has to go inside because the ATM is too high, etc.  Jenny tells Abe that's not a big deal because he can still use the bank services, totally missing the many ways those issues effect Abe's dignity because Jenny has never experienced the many indignities of being disabled.  Now Jenny and Abe can't even talk about ways to solve the bank problem because Jenny fails to even acknowledge that there IS a bank problem.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The difference between the two examples is that in #1 a person with real-life experience has a more credible viewpoint than a person without that experience and in #2 a person with tangential experience is telling something without that experience that their opinion has no value at all.  A black person will almost always be more credible on black issues than a non black person.  But just because you are an outsider and come from a privileged position doesn&amp;#39;t mean your opinion has no value at all-- and as you point out there are times when people treat the privileged that way (like they have no business even having an opinion on something).  What is important is that the privileged person recognize their privilege and not discount the real-life experience of the person inside the situation.  It is possible that John, being a white guy with a PhD and relevant field experience in race politics might actually be more credible than random Brenda but I think it is unlikely.  For instance, say Brenda was actually African and came from an economically privileged position in a black African nation.  She likely wouldn&amp;#39;t be as credible as John in that scenario on BLM issues. &lt;/p&gt;\n\n&lt;p&gt;Example: Abe is in a wheel chair and Jenny is able-bodied.  Abe tells Jenny how he hard it is for him because his bank has crappy accomodations for the disabled-- he has to enter through the ramp at the back of the building where they haul out the trash; he has to wait for someone at the desk to service him because he can&amp;#39;t reach the teller windows; he always has to go inside because the ATM is too high, etc.  Jenny tells Abe that&amp;#39;s not a big deal because he can still use the bank services, totally missing the many ways those issues effect Abe&amp;#39;s dignity because Jenny has never experienced the many indignities of being disabled.  Now Jenny and Abe can&amp;#39;t even talk about ways to solve the bank problem because Jenny fails to even acknowledge that there IS a bank problem.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6gdmj", "score_hidden": false, "stickied": false, "created": 1492055895.0, "created_utc": 1492027095.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6cc9n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg6bhkp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I am not entirely sure I see the difference between the examples. Is it that in #1, the speaker is an outside observer, and in #2, the speaker is a participant?\n\nI am also curious if there is something else relevant here besides knowledge. Is the idea that a black person is more credible than a non-black person on BLM based purely on the assumption the black person knows more about BLM/black issues? \n\nSuppose for example John has a PhD in a relevant field and studies BLM-related issues whereas Brenda is a random (black) person. Would your conclusion still hold?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am not entirely sure I see the difference between the examples. Is it that in #1, the speaker is an outside observer, and in #2, the speaker is a participant?&lt;/p&gt;\n\n&lt;p&gt;I am also curious if there is something else relevant here besides knowledge. Is the idea that a black person is more credible than a non-black person on BLM based purely on the assumption the black person knows more about BLM/black issues? &lt;/p&gt;\n\n&lt;p&gt;Suppose for example John has a PhD in a relevant field and studies BLM-related issues whereas Brenda is a random (black) person. Would your conclusion still hold?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6cc9n", "score_hidden": false, "stickied": false, "created": 1492051736.0, "created_utc": 1492022936.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6bhkp", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "FelixFelicia", "parent_id": "t1_dg691ez", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "This goes back to my comment earlier that too many people don't know how to talk about or hear about privilege.  I'm seeing little kids being taught about it in elementary school so I hope that, over time, it will be a more innate concept and people will have a better hold on it.  \n\nIn your example I think it would be fine to say \"John is white and Brenda is black.  Brenda's opinion on the role of BLM is more credible than John's.\"  But I think sometimes it gets used to say \"I am gay and you are straight so I don't care what you have to say about Caitlin Jenner,\" which isn't as fair.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This goes back to my comment earlier that too many people don&amp;#39;t know how to talk about or hear about privilege.  I&amp;#39;m seeing little kids being taught about it in elementary school so I hope that, over time, it will be a more innate concept and people will have a better hold on it.  &lt;/p&gt;\n\n&lt;p&gt;In your example I think it would be fine to say &amp;quot;John is white and Brenda is black.  Brenda&amp;#39;s opinion on the role of BLM is more credible than John&amp;#39;s.&amp;quot;  But I think sometimes it gets used to say &amp;quot;I am gay and you are straight so I don&amp;#39;t care what you have to say about Caitlin Jenner,&amp;quot; which isn&amp;#39;t as fair.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6bhkp", "score_hidden": false, "stickied": false, "created": 1492050865.0, "created_utc": 1492022065.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg691ez", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg66xqj", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think the concept of privilege has a role to play when you are talking, person-to-person, with someone of a different background. It does help build empathy and understanding, and encourages you to look at things from other perspectives.\n\nWhere I get off the bus is when it is used to justify arguments, as in \"X is more privileged than Y, therefore we should ignore X and listen to Y\". It is not a tool that can be used to decide who is right on an issue, nor should it be used to say that some people are more worth listening to than others.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the concept of privilege has a role to play when you are talking, person-to-person, with someone of a different background. It does help build empathy and understanding, and encourages you to look at things from other perspectives.&lt;/p&gt;\n\n&lt;p&gt;Where I get off the bus is when it is used to justify arguments, as in &amp;quot;X is more privileged than Y, therefore we should ignore X and listen to Y&amp;quot;. It is not a tool that can be used to decide who is right on an issue, nor should it be used to say that some people are more worth listening to than others.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg691ez", "score_hidden": false, "stickied": false, "created": 1492048357.0, "created_utc": 1492019557.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66xqj", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "FelixFelicia", "parent_id": "t1_dg62etv", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I generally agree with most of what you said though I still think you are discounting the role privilege plays.  It is more than valuing one's own perspective over someone else's.  When you are the default (white or male or able-bodied or christian or straight or cis or whatever) your perspective is also, more often than not, the perspective of society at large.  When you are non-default, an \"other,\" your perspective is often not in line with much of society.  That creates a hugely unequal footing and makes it challenging to come together on even common issues.  Acknowledging that you come from a place of privilege helps level the playing field and equalizes the foundations on which both parties stand.  If you recognize that there are aspects of this other person's experience that is different from yours in major ways and that perhaps you can never really understand what that is like you are in a better place to understand why maybe they don't agree with you about something or think your approach might not work.  \n\nI'll give you an example: I am white. After the election I posted something to facebook where I said that despite being liberal I was optimistic that the GOP congress would work for the country as a whole and represent my interests against the tyranny I feared coming from the White House.  I figured we were now all in this mess together (clearly I was wrong). My black friend commented that the GOP has never represented him or his interests and he has no reason to think they would do so now. I recognized in that moment that my opinion came from a place of privilege and my friend, having very different life experiences than me could not see eye to eye with me on that issue.  I am also a woman so I can see where he is coming from, as the GOP isn't super supportive of women's issues either.  But I at least recognized that he had a perspective that was different than mine for reasons I didn't have experience with and it helped me to understand him better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I generally agree with most of what you said though I still think you are discounting the role privilege plays.  It is more than valuing one&amp;#39;s own perspective over someone else&amp;#39;s.  When you are the default (white or male or able-bodied or christian or straight or cis or whatever) your perspective is also, more often than not, the perspective of society at large.  When you are non-default, an &amp;quot;other,&amp;quot; your perspective is often not in line with much of society.  That creates a hugely unequal footing and makes it challenging to come together on even common issues.  Acknowledging that you come from a place of privilege helps level the playing field and equalizes the foundations on which both parties stand.  If you recognize that there are aspects of this other person&amp;#39;s experience that is different from yours in major ways and that perhaps you can never really understand what that is like you are in a better place to understand why maybe they don&amp;#39;t agree with you about something or think your approach might not work.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll give you an example: I am white. After the election I posted something to facebook where I said that despite being liberal I was optimistic that the GOP congress would work for the country as a whole and represent my interests against the tyranny I feared coming from the White House.  I figured we were now all in this mess together (clearly I was wrong). My black friend commented that the GOP has never represented him or his interests and he has no reason to think they would do so now. I recognized in that moment that my opinion came from a place of privilege and my friend, having very different life experiences than me could not see eye to eye with me on that issue.  I am also a woman so I can see where he is coming from, as the GOP isn&amp;#39;t super supportive of women&amp;#39;s issues either.  But I at least recognized that he had a perspective that was different than mine for reasons I didn&amp;#39;t have experience with and it helped me to understand him better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg66xqj", "score_hidden": false, "stickied": false, "created": 1492046256.0, "created_utc": 1492017456.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg85nmj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg84wgu", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "My wife is Japanese, but thanks for playing. Or are Japanese people basically white now because they're doing economically just fine? \n\n&gt; Economic equality is still not going to solve racial equality. Even if we removed money and class from the world, racism would still exist.\n\nI agree entirely. But the tale of Asians in America, along with that of the Scots-Irish and Catholics, are very instructive. There is still discrimination against them today. But it is orders of magnitude less than it was, and she and her family see it as a very minor issue at most. \n\nIt is important to address racism. It is still severe for some groups. But it is also important to remember that it is actually solvable. She and her family would be the first to say that a victim mentality does not really help, because for one thing it only exacerbates a group's \"othering\".\n\n&gt; His isn't necessarily more right. It still alienates people.\n\nYeah. All politicians and political statements alienate people. We could take a pragmatic view and ask what alienates less people, or we could take a moral view and ask what's the right answer regardless of who gets alienated. But I do agree his message certainly didn't appeal equally to everyone. That would be impossible.\n\nBut I never took him to be saying, nor was I ever saying, racism wasn't a problem or that we should ignore it. Just that, bluntly, as I have said above, it is worse to be poor than &lt;insert demographic group here&gt;, ceteris paribus, and it is better to be a rich minority than a poor white.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My wife is Japanese, but thanks for playing. Or are Japanese people basically white now because they&amp;#39;re doing economically just fine? &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Economic equality is still not going to solve racial equality. Even if we removed money and class from the world, racism would still exist.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I agree entirely. But the tale of Asians in America, along with that of the Scots-Irish and Catholics, are very instructive. There is still discrimination against them today. But it is orders of magnitude less than it was, and she and her family see it as a very minor issue at most. &lt;/p&gt;\n\n&lt;p&gt;It is important to address racism. It is still severe for some groups. But it is also important to remember that it is actually solvable. She and her family would be the first to say that a victim mentality does not really help, because for one thing it only exacerbates a group&amp;#39;s &amp;quot;othering&amp;quot;.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;His isn&amp;#39;t necessarily more right. It still alienates people.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah. All politicians and political statements alienate people. We could take a pragmatic view and ask what alienates less people, or we could take a moral view and ask what&amp;#39;s the right answer regardless of who gets alienated. But I do agree his message certainly didn&amp;#39;t appeal equally to everyone. That would be impossible.&lt;/p&gt;\n\n&lt;p&gt;But I never took him to be saying, nor was I ever saying, racism wasn&amp;#39;t a problem or that we should ignore it. Just that, bluntly, as I have said above, it is worse to be poor than &amp;lt;insert demographic group here&amp;gt;, ceteris paribus, and it is better to be a rich minority than a poor white.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg85nmj", "score_hidden": false, "stickied": false, "created": 1492143520.0, "created_utc": 1492114720.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84wgu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Galentines_day", "parent_id": "t1_dg82u4y", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;they seemed to take them in the sense of \"yes, choice is important, but inequality is more important\"\n\nAnd now I know your girlfriend is white because \"inequality\" is only shorthand for \"economic inequality\" for white people. \n\nEconomic equality is still not going to solve racial equality. Even if we removed money and class from the world, racism would still exist. \n\nAnyway your girlfriend's opinion is just as valid as mine. But her not caring about his statements that I mentioned doesn't negate those who did care about them. His message *was* problematic to many, and I bring that up only to show that he didn't have the perfect message that appeals to everyone. While Clinton's message alienated some people and appealed to others, Sanders' message appealed to some people and alienated others. His isn't necessarily more right.  It still alienates people. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;they seemed to take them in the sense of &amp;quot;yes, choice is important, but inequality is more important&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And now I know your girlfriend is white because &amp;quot;inequality&amp;quot; is only shorthand for &amp;quot;economic inequality&amp;quot; for white people. &lt;/p&gt;\n\n&lt;p&gt;Economic equality is still not going to solve racial equality. Even if we removed money and class from the world, racism would still exist. &lt;/p&gt;\n\n&lt;p&gt;Anyway your girlfriend&amp;#39;s opinion is just as valid as mine. But her not caring about his statements that I mentioned doesn&amp;#39;t negate those who did care about them. His message &lt;em&gt;was&lt;/em&gt; problematic to many, and I bring that up only to show that he didn&amp;#39;t have the perfect message that appeals to everyone. While Clinton&amp;#39;s message alienated some people and appealed to others, Sanders&amp;#39; message appealed to some people and alienated others. His isn&amp;#39;t necessarily more right.  It still alienates people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg84wgu", "score_hidden": false, "stickied": false, "created": 1492142689.0, "created_utc": 1492113889.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82u4y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg822v9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Yes, it's true. I am. However, I originally heard about Bernie from my wife and her friends. They didn't care about the comments you're referring to WRT abortion and PP, because they seemed to take them in the sense of \"yes, choice is important, but inequality is more important\". Who knows if their interpretation was correct -- I tended to stay out of such things, on the theory that issues involving women's rights should be decided on by women.\n\nThey were much more incensed by Albright, Steinem, and other repeated suggestions that it was somehow their duty to vote HRC just because they shared genitalia. Overall, I knew more female Bernie supporters than male, and they tended to be more passionate. If anything their support only hardened over time.\n\nI also live in the South. I don't know about \"low-information voters\", because those exist everywhere, but I certainly had sympathy with the argument that primary votes in non-swing states, especially deep red states, are kind of useless in determining who the nominee should be. If the DNC had decided only states in play should get primary votes, I would have been happy to forfeit my vote, and I would have, because I live in a deep red state.\n\nCalling Bernie a bigot is a nonstarter. If he's a bigot, everyone's a bigot, and the term is meaningless. ", "edited": 1492112234.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, it&amp;#39;s true. I am. However, I originally heard about Bernie from my wife and her friends. They didn&amp;#39;t care about the comments you&amp;#39;re referring to WRT abortion and PP, because they seemed to take them in the sense of &amp;quot;yes, choice is important, but inequality is more important&amp;quot;. Who knows if their interpretation was correct -- I tended to stay out of such things, on the theory that issues involving women&amp;#39;s rights should be decided on by women.&lt;/p&gt;\n\n&lt;p&gt;They were much more incensed by Albright, Steinem, and other repeated suggestions that it was somehow their duty to vote HRC just because they shared genitalia. Overall, I knew more female Bernie supporters than male, and they tended to be more passionate. If anything their support only hardened over time.&lt;/p&gt;\n\n&lt;p&gt;I also live in the South. I don&amp;#39;t know about &amp;quot;low-information voters&amp;quot;, because those exist everywhere, but I certainly had sympathy with the argument that primary votes in non-swing states, especially deep red states, are kind of useless in determining who the nominee should be. If the DNC had decided only states in play should get primary votes, I would have been happy to forfeit my vote, and I would have, because I live in a deep red state.&lt;/p&gt;\n\n&lt;p&gt;Calling Bernie a bigot is a nonstarter. If he&amp;#39;s a bigot, everyone&amp;#39;s a bigot, and the term is meaningless. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg82u4y", "score_hidden": false, "stickied": false, "created": 1492140442.0, "created_utc": 1492111642.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg822v9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Galentines_day", "parent_id": "t1_dg62etv", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; But I do think Bernie's essential message and focus were correct. \n\nFrom your male POV. I make this assumption, but I bet you are a male. A *LOT* of women were very pissed off at Bernie when he said talking about abortion is a \"distraction\" and called Planned Parenthood \"establishment\" at a time when he was using that as a dirty word. His supporters (representing him to the masses) also called the south \"Low information voters\" which was pretty dang racist. \n\nYou may not have noticed or cared about those instances. But women sure did, and black people sure did. Those were examples of when his message was not correct - and specifically because he was saying to ignore these \"special interests\" and focus on the economy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But I do think Bernie&amp;#39;s essential message and focus were correct. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;From your male POV. I make this assumption, but I bet you are a male. A &lt;em&gt;LOT&lt;/em&gt; of women were very pissed off at Bernie when he said talking about abortion is a &amp;quot;distraction&amp;quot; and called Planned Parenthood &amp;quot;establishment&amp;quot; at a time when he was using that as a dirty word. His supporters (representing him to the masses) also called the south &amp;quot;Low information voters&amp;quot; which was pretty dang racist. &lt;/p&gt;\n\n&lt;p&gt;You may not have noticed or cared about those instances. But women sure did, and black people sure did. Those were examples of when his message was not correct - and specifically because he was saying to ignore these &amp;quot;special interests&amp;quot; and focus on the economy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg822v9", "score_hidden": false, "stickied": false, "created": 1492139618.0, "created_utc": 1492110818.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg62gt4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dg62etv", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/FelixFelicia ([1∆](/r/changemyview/wiki/user/FelixFelicia)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"FelixFelicia\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/FelixFelicia\"&gt;/u/FelixFelicia&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/FelixFelicia\"&gt;1∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22FelixFelicia%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg62gt4", "score_hidden": false, "stickied": false, "created": 1492041592.0, "created_utc": 1492012792.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg62etv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg5v3x7", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I don't want to make this about Bernie. He had many flaws and no one knows if he was electable. But I do think Bernie's essential message and focus were correct. I want to separate the message and messenger.\n\n&gt; I think the problem isn't a hyper-focus on social issues, I think its a messaging problem that failed to convey to people that social issues are economic issues, and \"minority special interest issues\" are everyone issues.\n\nTo the extent that BLM, for example, is advocating for solutions to general problems that affect everyone even if they disproportionately affect a particular group (like police brutality, drug law, etc), I am totally behind them and give you a partial ∆ just for that point. I think I was underestimating the extent to which they are doing this. And if they would frame these things as an \"everyone problem\" rather than a \"black problem\", \"LGBT problem\", etc, that would go a very long way towards addressing my concerns. \n\nHowever, and I think you agree, they are generally not doing that. Indeed, sometimes they seem actively hostile to this kind of reframing, as with the BLM vs ALM brouhaha. In my view, when an unarmed black teenager gets shot, it is indeed a tragedy, but it is both morally and strategically better to emphasize the *unarmed teenager* over the *black*.\n\n&gt; The reality is that \"Bernie-Bros\" didn't really understand the importance of LGBT issues or BLM or whatever other social movements you want to include, but not because they were racist or sexist or intentionally biased, but because they were valuing their own experience above the experience of the \"others\" because they genuinely believed that to be the more important issue.\n\nWell, in any political discussion or debate, people always value their own logic and perspective over others', no \"-ism\" or privilege required for that. That said, \"Berniebros\" would frame the matter differently: they want general solutions, not group-specific solutions. If a special-interest group can advocate for solutions to a GENERAL problem, I and I think most Bernie supporters would have zero problem with that. Indeed Bernie was fairly vocal about the incarceration problem, and rightly so.\n\nNow, there may be very legitimate problems that are truly group-specific and can only be addressed in a group-specific way, like Jim Crow laws or segregation. And if that is the case, fine. But a case has to be made that the problem is truly group-specific rather than just group-disproportionate. And if it is group-disproportionate, like most of these issues are, then I think it should be framed as a general problem.\n\n&gt; The message that economic inequality is the source of all societies ills and fixing that will fix everything\n\nI don't think this, although I see how you might get that impression. In its strongest form, my view would be something like \"fixing economic inequality is not a complete solution and other, group-specific measures are needed, but fixing economic inequality is the most important component of a general solution\".", "edited": 1492013844.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t want to make this about Bernie. He had many flaws and no one knows if he was electable. But I do think Bernie&amp;#39;s essential message and focus were correct. I want to separate the message and messenger.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I think the problem isn&amp;#39;t a hyper-focus on social issues, I think its a messaging problem that failed to convey to people that social issues are economic issues, and &amp;quot;minority special interest issues&amp;quot; are everyone issues.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To the extent that BLM, for example, is advocating for solutions to general problems that affect everyone even if they disproportionately affect a particular group (like police brutality, drug law, etc), I am totally behind them and give you a partial ∆ just for that point. I think I was underestimating the extent to which they are doing this. And if they would frame these things as an &amp;quot;everyone problem&amp;quot; rather than a &amp;quot;black problem&amp;quot;, &amp;quot;LGBT problem&amp;quot;, etc, that would go a very long way towards addressing my concerns. &lt;/p&gt;\n\n&lt;p&gt;However, and I think you agree, they are generally not doing that. Indeed, sometimes they seem actively hostile to this kind of reframing, as with the BLM vs ALM brouhaha. In my view, when an unarmed black teenager gets shot, it is indeed a tragedy, but it is both morally and strategically better to emphasize the &lt;em&gt;unarmed teenager&lt;/em&gt; over the &lt;em&gt;black&lt;/em&gt;.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The reality is that &amp;quot;Bernie-Bros&amp;quot; didn&amp;#39;t really understand the importance of LGBT issues or BLM or whatever other social movements you want to include, but not because they were racist or sexist or intentionally biased, but because they were valuing their own experience above the experience of the &amp;quot;others&amp;quot; because they genuinely believed that to be the more important issue.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, in any political discussion or debate, people always value their own logic and perspective over others&amp;#39;, no &amp;quot;-ism&amp;quot; or privilege required for that. That said, &amp;quot;Berniebros&amp;quot; would frame the matter differently: they want general solutions, not group-specific solutions. If a special-interest group can advocate for solutions to a GENERAL problem, I and I think most Bernie supporters would have zero problem with that. Indeed Bernie was fairly vocal about the incarceration problem, and rightly so.&lt;/p&gt;\n\n&lt;p&gt;Now, there may be very legitimate problems that are truly group-specific and can only be addressed in a group-specific way, like Jim Crow laws or segregation. And if that is the case, fine. But a case has to be made that the problem is truly group-specific rather than just group-disproportionate. And if it is group-disproportionate, like most of these issues are, then I think it should be framed as a general problem.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The message that economic inequality is the source of all societies ills and fixing that will fix everything&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think this, although I see how you might get that impression. In its strongest form, my view would be something like &amp;quot;fixing economic inequality is not a complete solution and other, group-specific measures are needed, but fixing economic inequality is the most important component of a general solution&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg62etv", "score_hidden": false, "stickied": false, "created": 1492041533.0, "created_utc": 1492012733.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v3x7", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "FelixFelicia", "parent_id": "t3_64xiv8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think the problem isn't a hyper-focus on social issues, I think its a messaging problem that failed to convey to people that social issues are economic issues, and \"minority special interest issues\" are everyone issues.  \n\nTo frame things like LGBT rights and BLM as \"minority special-interest issues\" is to ignore the fact that equal rights and police brutality and lack of access to healthcare and poorly funded public schools are an everyone problem, not a minority problem.  It also fails to capture how things like low-graduation rates, high incarceration rates and teen pregnancy, which disproportionately affect poor communities (both rural and urban, white and black) are ultimately economic issues because they effectively remove people from the labor market. That attitude is polarizing.  When you say that the dems should focus on issues facing all Americans you are discounting the experience of tens of millions of Americans and what they deal with every day.  The message that economic inequality is the source of all societies ills and fixing that will fix everything invalidates the very real experience of people who are discriminated against because of their skin color or religion or sexual orientation or gender.  \n\nCommunication and messaging were a problem during this campaign, not just from the candidates but from supporters as well. There were HUGE privilege issues at play here but too many people don't know how to talk about or hear about privilege without getting aggressive/defensive.  \n\n&gt;A common strategy to belittle those interested in these broader issues was to say that we just don't understand the importance of, say, LGBT issues because we're white males, \"privileged\", \"Berniebros\", etc.\"\n\nI don't think the intent of most people discussing this was to belittle, its just that many people are terrible at communicating what privilege means.  At this point I think we need to jettison the word entirely because it is far too loaded.  When talking about how \"privilege\" affects one's ability to understand the importance of an issue all that really means is that is very easy for a white person to look at a black person, or a man to look at a woman, or a christian to look at a muslim, or a straight person to look at a gay person, or an able-bodied person to look at a disabled person, and say \"your problems are like my problems, we are the same.\"  And that is great.  It is important to find common ground and face common issues in a united way.  But too often you see the person in the privileged position discounting the experiences of the other person because they themselves have never experienced it.  \"That wasn't sexism, you just didn't interview well,\" or \"That wasn't racism, you were just dressed like a thug.\"  That attitude is dismissive of the reality \"others\" experience and perpetuates the privilege and superiority of the privileged person-- I'm sure most people don't intend to convey that message and don't even realize they are doing it, but they are.  \n\nThe reality is that \"Bernie-Bros\" didn't really understand the importance of LGBT issues or BLM or whatever other social movements you want to include, but not because they were racist or sexist or intentionally biased, but because they were valuing their own experience above the experience of the \"others\" because they genuinely believed that to be the more important issue.  That made those in the other category feel discounted.  \n\nI am not convinced Bernie would have won the general. \"Socialist\" is a dirty word in much of America.  His message was very polarizing because it was so laser-focused on economic inequality.  A Joe Biden, on the other hand, would have wiped the floor with the whole field because of his ability to bring people together without making some people feel left out--  His ability to talk about economic issues without making it seem like market forces are the only thing keeping the black man down.  Joe Biden needs to be shaping the dem message during the next 4 years.\n\n\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the problem isn&amp;#39;t a hyper-focus on social issues, I think its a messaging problem that failed to convey to people that social issues are economic issues, and &amp;quot;minority special interest issues&amp;quot; are everyone issues.  &lt;/p&gt;\n\n&lt;p&gt;To frame things like LGBT rights and BLM as &amp;quot;minority special-interest issues&amp;quot; is to ignore the fact that equal rights and police brutality and lack of access to healthcare and poorly funded public schools are an everyone problem, not a minority problem.  It also fails to capture how things like low-graduation rates, high incarceration rates and teen pregnancy, which disproportionately affect poor communities (both rural and urban, white and black) are ultimately economic issues because they effectively remove people from the labor market. That attitude is polarizing.  When you say that the dems should focus on issues facing all Americans you are discounting the experience of tens of millions of Americans and what they deal with every day.  The message that economic inequality is the source of all societies ills and fixing that will fix everything invalidates the very real experience of people who are discriminated against because of their skin color or religion or sexual orientation or gender.  &lt;/p&gt;\n\n&lt;p&gt;Communication and messaging were a problem during this campaign, not just from the candidates but from supporters as well. There were HUGE privilege issues at play here but too many people don&amp;#39;t know how to talk about or hear about privilege without getting aggressive/defensive.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A common strategy to belittle those interested in these broader issues was to say that we just don&amp;#39;t understand the importance of, say, LGBT issues because we&amp;#39;re white males, &amp;quot;privileged&amp;quot;, &amp;quot;Berniebros&amp;quot;, etc.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think the intent of most people discussing this was to belittle, its just that many people are terrible at communicating what privilege means.  At this point I think we need to jettison the word entirely because it is far too loaded.  When talking about how &amp;quot;privilege&amp;quot; affects one&amp;#39;s ability to understand the importance of an issue all that really means is that is very easy for a white person to look at a black person, or a man to look at a woman, or a christian to look at a muslim, or a straight person to look at a gay person, or an able-bodied person to look at a disabled person, and say &amp;quot;your problems are like my problems, we are the same.&amp;quot;  And that is great.  It is important to find common ground and face common issues in a united way.  But too often you see the person in the privileged position discounting the experiences of the other person because they themselves have never experienced it.  &amp;quot;That wasn&amp;#39;t sexism, you just didn&amp;#39;t interview well,&amp;quot; or &amp;quot;That wasn&amp;#39;t racism, you were just dressed like a thug.&amp;quot;  That attitude is dismissive of the reality &amp;quot;others&amp;quot; experience and perpetuates the privilege and superiority of the privileged person-- I&amp;#39;m sure most people don&amp;#39;t intend to convey that message and don&amp;#39;t even realize they are doing it, but they are.  &lt;/p&gt;\n\n&lt;p&gt;The reality is that &amp;quot;Bernie-Bros&amp;quot; didn&amp;#39;t really understand the importance of LGBT issues or BLM or whatever other social movements you want to include, but not because they were racist or sexist or intentionally biased, but because they were valuing their own experience above the experience of the &amp;quot;others&amp;quot; because they genuinely believed that to be the more important issue.  That made those in the other category feel discounted.  &lt;/p&gt;\n\n&lt;p&gt;I am not convinced Bernie would have won the general. &amp;quot;Socialist&amp;quot; is a dirty word in much of America.  His message was very polarizing because it was so laser-focused on economic inequality.  A Joe Biden, on the other hand, would have wiped the floor with the whole field because of his ability to bring people together without making some people feel left out--  His ability to talk about economic issues without making it seem like market forces are the only thing keeping the black man down.  Joe Biden needs to be shaping the dem message during the next 4 years.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5v3x7", "score_hidden": false, "stickied": false, "created": 1492032993.0, "created_utc": 1492004193.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg5thaj", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "SleeplessinRedditle", "parent_id": "t1_dg5se0f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Oh. You won't hear that from me. I'm all for social justice. But I don't think it's a smart strategy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh. You won&amp;#39;t hear that from me. I&amp;#39;m all for social justice. But I don&amp;#39;t think it&amp;#39;s a smart strategy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5thaj", "score_hidden": false, "stickied": false, "created": 1492030582.0, "created_utc": 1492001782.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5se0f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg5s104", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I generally agree with your analysis. I'm not necessarily advocating that the Democrats should adopt one particular economic platform or another: from a purely strategic perspective, Bill Clintonesque \"Third Way\" economics would be just as much an improvement as pinko Berniecratism, just because both actually *are* some approach to the problem. I agree there seems to be a (slow) shift occurring but we will see how far it goes.\n\nBy posting to CMV I am primarily hoping to hear from those people who really think (or are willing to argue) that yes, the social issues deserve top priority, and preferably also an argument that such a focus can be sustained strategically. Perhaps I am missing something due to my privilege or some other reason.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I generally agree with your analysis. I&amp;#39;m not necessarily advocating that the Democrats should adopt one particular economic platform or another: from a purely strategic perspective, Bill Clintonesque &amp;quot;Third Way&amp;quot; economics would be just as much an improvement as pinko Berniecratism, just because both actually &lt;em&gt;are&lt;/em&gt; some approach to the problem. I agree there seems to be a (slow) shift occurring but we will see how far it goes.&lt;/p&gt;\n\n&lt;p&gt;By posting to CMV I am primarily hoping to hear from those people who really think (or are willing to argue) that yes, the social issues deserve top priority, and preferably also an argument that such a focus can be sustained strategically. Perhaps I am missing something due to my privilege or some other reason.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5se0f", "score_hidden": false, "stickied": false, "created": 1492028757.0, "created_utc": 1491999957.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5s104", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "SleeplessinRedditle", "parent_id": "t3_64xiv8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[This was just released today](http://www.politico.com/story/2017/04/dems-populist-agenda-sanders-trump-237114). Bit light on details but it does seem the party is leaning that way. If that's the case, this will be a dramatic change to the party. The wing defined by Clintonian third way politics (social left, fiscal right) are still very much a part of the party. The Dems haven't talked like that since the New Deal era died. They are likely licking their wounds and redrawing battle lines in the wake of the defeat. \n\nIf the Dems embrace Sanders style progressivism, the old guard will effectively be shut out of the game. They currently have all of the power. Adopting Sanders message would place them behind the members with a stronger progressive image. Nancy Pelosi isn't going to be able to convincingly become a pinko berniecrat without losing much face. There may also be some Dems whose constituencies may not be so welcoming to an injection of socialism into the party. Remember the blue dogs during the original Obamacare negotiations? \n\nI've always figured that the reason they focused on social issues so much was for cheap support. Fiddling with taxes on tampons for cheap points is easy. But economic justice is disruptive and likely directly opposed to their coffers' interests. Saying they are making a mistake implies that they aren't aware of the current political climate and haven't considered these actions fully. And while that may be true to some extent, the Dems do seem to be remarkably tone deaf at times, it seems quite unlikely to me that this is an innocent and ignorant mistep. \n\nBut we will see. I'm no Democrat or Republican. I rejected both long ago. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://www.politico.com/story/2017/04/dems-populist-agenda-sanders-trump-237114\"&gt;This was just released today&lt;/a&gt;. Bit light on details but it does seem the party is leaning that way. If that&amp;#39;s the case, this will be a dramatic change to the party. The wing defined by Clintonian third way politics (social left, fiscal right) are still very much a part of the party. The Dems haven&amp;#39;t talked like that since the New Deal era died. They are likely licking their wounds and redrawing battle lines in the wake of the defeat. &lt;/p&gt;\n\n&lt;p&gt;If the Dems embrace Sanders style progressivism, the old guard will effectively be shut out of the game. They currently have all of the power. Adopting Sanders message would place them behind the members with a stronger progressive image. Nancy Pelosi isn&amp;#39;t going to be able to convincingly become a pinko berniecrat without losing much face. There may also be some Dems whose constituencies may not be so welcoming to an injection of socialism into the party. Remember the blue dogs during the original Obamacare negotiations? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always figured that the reason they focused on social issues so much was for cheap support. Fiddling with taxes on tampons for cheap points is easy. But economic justice is disruptive and likely directly opposed to their coffers&amp;#39; interests. Saying they are making a mistake implies that they aren&amp;#39;t aware of the current political climate and haven&amp;#39;t considered these actions fully. And while that may be true to some extent, the Dems do seem to be remarkably tone deaf at times, it seems quite unlikely to me that this is an innocent and ignorant mistep. &lt;/p&gt;\n\n&lt;p&gt;But we will see. I&amp;#39;m no Democrat or Republican. I rejected both long ago. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5s104", "score_hidden": false, "stickied": false, "created": 1492028090.0, "created_utc": 1491999290.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg6cemg", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "awa64", "parent_id": "t1_dg63yfu", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "There's no good-faith argument to be made for those policies on non-racist grounds. They're proposed as solutions to \"problems\" that only exist if a) you're racist or b) you're under the influence of misconceptions peddled by racists, and once you've committed to believing those misconceptions in the face of someone trying to debunk them, you're racist.\n\n&gt; I completely agree. And you seem to concede that, as I have said, it is unknowable and ultimately irrelevant what the motives are of people proposing this type of policy. So again, why is it necessary to lob the unsubstantiated (or perhaps subjective is a better adjective) \"racist\" moniker at someone if we can just oppose the policy?\n\nBecause policies are a means to an end. I'm willing to point out the flaws in the proposed means, but it's the end that I'm ultimately objecting to.\n\nThe motives behind these policy suggestions aren't some kind of inscrutable, unknowable mystery. None of this stuff is happening in a vacuum. The people proposing it give speeches explaining what they intend to accomplish. The specifics of the proposals speak to their priorities. And when those specifics don't make sense in relation to those stated motives, it speaks to what motives they have that they might not be vocalizing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s no good-faith argument to be made for those policies on non-racist grounds. They&amp;#39;re proposed as solutions to &amp;quot;problems&amp;quot; that only exist if a) you&amp;#39;re racist or b) you&amp;#39;re under the influence of misconceptions peddled by racists, and once you&amp;#39;ve committed to believing those misconceptions in the face of someone trying to debunk them, you&amp;#39;re racist.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I completely agree. And you seem to concede that, as I have said, it is unknowable and ultimately irrelevant what the motives are of people proposing this type of policy. So again, why is it necessary to lob the unsubstantiated (or perhaps subjective is a better adjective) &amp;quot;racist&amp;quot; moniker at someone if we can just oppose the policy?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Because policies are a means to an end. I&amp;#39;m willing to point out the flaws in the proposed means, but it&amp;#39;s the end that I&amp;#39;m ultimately objecting to.&lt;/p&gt;\n\n&lt;p&gt;The motives behind these policy suggestions aren&amp;#39;t some kind of inscrutable, unknowable mystery. None of this stuff is happening in a vacuum. The people proposing it give speeches explaining what they intend to accomplish. The specifics of the proposals speak to their priorities. And when those specifics don&amp;#39;t make sense in relation to those stated motives, it speaks to what motives they have that they might not be vocalizing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6cemg", "score_hidden": false, "stickied": false, "created": 1492051804.0, "created_utc": 1492023004.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg63yfu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg611o9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; No, it couldn't. The math simply doesn't add up for those arguments, unless you're starting from a racist belief or incorporating a racist falsehood into your calculations.\n\nI don't agree. Anyway, I am only saying that a good-faith argument could be made for these things on non-racist grounds, not that I agree with the arguments or that those arguments would be winners. \n\nA crude analogy could be made with vaccine opponents: someone could honestly oppose vaccines based on the mistaken belief that they are net harmful. They would be mistaken, but honestly mistaken. Others might oppose it on the more dubious philosophical grounds of \"the government should never tell me what to do\". We can't easily know who is who.\n\n&gt; It's not lobbing an ad hominem to point out the discriminatory consequences of these policies.\n\nI completely agree. And you seem to concede that, as I have said, it is unknowable and ultimately irrelevant what the motives are of people proposing this type of policy. So again, why is it necessary to lob the unsubstantiated (or perhaps subjective is a better adjective) \"racist\" moniker at someone if we can just oppose the policy?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;No, it couldn&amp;#39;t. The math simply doesn&amp;#39;t add up for those arguments, unless you&amp;#39;re starting from a racist belief or incorporating a racist falsehood into your calculations.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t agree. Anyway, I am only saying that a good-faith argument could be made for these things on non-racist grounds, not that I agree with the arguments or that those arguments would be winners. &lt;/p&gt;\n\n&lt;p&gt;A crude analogy could be made with vaccine opponents: someone could honestly oppose vaccines based on the mistaken belief that they are net harmful. They would be mistaken, but honestly mistaken. Others might oppose it on the more dubious philosophical grounds of &amp;quot;the government should never tell me what to do&amp;quot;. We can&amp;#39;t easily know who is who.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s not lobbing an ad hominem to point out the discriminatory consequences of these policies.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I completely agree. And you seem to concede that, as I have said, it is unknowable and ultimately irrelevant what the motives are of people proposing this type of policy. So again, why is it necessary to lob the unsubstantiated (or perhaps subjective is a better adjective) &amp;quot;racist&amp;quot; moniker at someone if we can just oppose the policy?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg63yfu", "score_hidden": false, "stickied": false, "created": 1492043185.0, "created_utc": 1492014385.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg6a0et", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg611o9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Technically though, you are correct that there was evidence, IDK about \"substantial\", long before his run. I had forgotten about that. \n\nI am new to this sub so I am not sure if this type of small correction warrants a delta since it doesn't change my overall view, but if it does, I'll be happy to add it. (advice on this welcomed)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Technically though, you are correct that there was evidence, IDK about &amp;quot;substantial&amp;quot;, long before his run. I had forgotten about that. &lt;/p&gt;\n\n&lt;p&gt;I am new to this sub so I am not sure if this type of small correction warrants a delta since it doesn&amp;#39;t change my overall view, but if it does, I&amp;#39;ll be happy to add it. (advice on this welcomed)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6a0et", "score_hidden": false, "stickied": false, "created": 1492049356.0, "created_utc": 1492020556.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg611o9", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "awa64", "parent_id": "t1_dg5zxoy", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Well, for me, part of the problem is that he was being called racist long before there was any substantial evidence for or against it.\n\nThere was substantial evidence of it as far back as 1973, when Trump was sued for refusing to rent apartments to black tenants, settled out of court, and was sued again for not obeying the terms of the settlement. In 1989, when he took out a full-page ad in the New York Times demanding the execution of five black and hispanic teenagers who were later exonerated of the crime they were accused of by DNA evidence, and in 2002, when he publicly disputed the exoneration. In 2015, when he straight up made a blanket statement that most (or even a significant number of) Mexican immigrants to the US are rapists, drug dealers, or otherwise criminals, when that belief is completely unhinged from reality.\n\nIt's not a matter of crying wolf. It's a matter of not wanting to deal with the elephant in the room so badly that you ostracize the people pointing out the existence of the elephant and ignore the elephant.\n\n&gt; Justification of restricting Hispanic immigration could be made on economic grounds, just as restricting Muslim immigration could be made on security or economic grounds.\n\nNo, it couldn't. The math simply doesn't add up for those arguments, unless you're starting from a racist belief or incorporating a racist falsehood into your calculations.\n\n&gt; I don't take a position on whether or not Trump or Sessions are racist because I think it is A) impossible to determine someone's internal motivations with certainty and B) a relatively meaningless statement anyway. If the policies themselves are harmful, and they may well be, why not oppose them for their consequences rather than lobbing ad hominems?\n\nIt's not lobbing an ad hominem to point out the discriminatory consequences of these policies. At that point, the only question is whether the people supporting those policies are in favor of those discriminatory consequences or are merely indifferent to them.\n\nAt that point, I think it's splitting hairs to say \"Hey, maybe they're not racist themselves, maybe they're just 100% OK with other people being racist, we should give them the benefit of the doubt.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Well, for me, part of the problem is that he was being called racist long before there was any substantial evidence for or against it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There was substantial evidence of it as far back as 1973, when Trump was sued for refusing to rent apartments to black tenants, settled out of court, and was sued again for not obeying the terms of the settlement. In 1989, when he took out a full-page ad in the New York Times demanding the execution of five black and hispanic teenagers who were later exonerated of the crime they were accused of by DNA evidence, and in 2002, when he publicly disputed the exoneration. In 2015, when he straight up made a blanket statement that most (or even a significant number of) Mexican immigrants to the US are rapists, drug dealers, or otherwise criminals, when that belief is completely unhinged from reality.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not a matter of crying wolf. It&amp;#39;s a matter of not wanting to deal with the elephant in the room so badly that you ostracize the people pointing out the existence of the elephant and ignore the elephant.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Justification of restricting Hispanic immigration could be made on economic grounds, just as restricting Muslim immigration could be made on security or economic grounds.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, it couldn&amp;#39;t. The math simply doesn&amp;#39;t add up for those arguments, unless you&amp;#39;re starting from a racist belief or incorporating a racist falsehood into your calculations.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t take a position on whether or not Trump or Sessions are racist because I think it is A) impossible to determine someone&amp;#39;s internal motivations with certainty and B) a relatively meaningless statement anyway. If the policies themselves are harmful, and they may well be, why not oppose them for their consequences rather than lobbing ad hominems?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s not lobbing an ad hominem to point out the discriminatory consequences of these policies. At that point, the only question is whether the people supporting those policies are in favor of those discriminatory consequences or are merely indifferent to them.&lt;/p&gt;\n\n&lt;p&gt;At that point, I think it&amp;#39;s splitting hairs to say &amp;quot;Hey, maybe they&amp;#39;re not racist themselves, maybe they&amp;#39;re just 100% OK with other people being racist, we should give them the benefit of the doubt.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg611o9", "score_hidden": false, "stickied": false, "created": 1492040040.0, "created_utc": 1492011240.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zxoy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg5wgzx", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Well, for me, part of the problem is that he was being called racist long before there was any substantial evidence for or against it. So whether or not it is true now, which probably depends substantially on one's definition of \"racism\", it is a term that has been used a lot to cry wolf.\n\nRestricting immigration, whether across the southern border, or from Muslim-majority countries, is a tricky thing because while it may be motivated by racism, it isn't *necessarily*. Advocacy of these kinds of policy isn't, to me, prima facie evidence of racism. Justification of restricting Hispanic immigration *could be* made on economic grounds, just as restricting Muslim immigration could be made on security or cultural grounds.\n\nI don't take a position on whether or not Trump or Sessions are racist because I think it is A) impossible to determine someone's internal motivations with certainty and B) a relatively meaningless statement anyway. If the policies themselves are harmful, and they may well be, why not oppose them for their consequences rather than lobbing ad hominems?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, for me, part of the problem is that he was being called racist long before there was any substantial evidence for or against it. So whether or not it is true now, which probably depends substantially on one&amp;#39;s definition of &amp;quot;racism&amp;quot;, it is a term that has been used a lot to cry wolf.&lt;/p&gt;\n\n&lt;p&gt;Restricting immigration, whether across the southern border, or from Muslim-majority countries, is a tricky thing because while it may be motivated by racism, it isn&amp;#39;t &lt;em&gt;necessarily&lt;/em&gt;. Advocacy of these kinds of policy isn&amp;#39;t, to me, prima facie evidence of racism. Justification of restricting Hispanic immigration &lt;em&gt;could be&lt;/em&gt; made on economic grounds, just as restricting Muslim immigration could be made on security or cultural grounds.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t take a position on whether or not Trump or Sessions are racist because I think it is A) impossible to determine someone&amp;#39;s internal motivations with certainty and B) a relatively meaningless statement anyway. If the policies themselves are harmful, and they may well be, why not oppose them for their consequences rather than lobbing ad hominems?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5zxoy", "score_hidden": false, "stickied": false, "created": 1492038820.0, "created_utc": 1492010020.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wgzx", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "awa64", "parent_id": "t3_64xiv8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; especially if the criticism is superficial and not based on policy (e.g., all the variants of \"Trump is racist\").\n\nHow is Trump's racism \"superficial\" or \"not based on policy?\"\n\nSpending tens of billions of dollars on an ineffectual, irresponsible, disruptive border wall is justified solely by racism but still has clear negative downsides, even above and beyond being spectacularly racist (and fuck, why isn't that enough)?\n\nRefusals to accept refugees based on their ethnic and religious background is fueled by racism and has concrete negative effects on those people's lives. Sure, spend $60 million bombing the shit out of an airfield, but god forbid you let the people you supposedly did it to protect move to Dearborn, MI.\n\nAppointing a notorious racist as Attorney General means the federal government has essentially bowed out of enforcing civil rights law, or attempts at reforming brutal and discriminatory police departments, or even attempts at making sure forensic science isn't abused. We're in for four years of a justice department whose main objective is being \"tough on crime,\" and by crime they mean black and hispanic people existing.\n\n\"Racism\" isn't just a buzzword. There are concrete and extremely troubling effects when racists are allowed to base their policy decisions on their racist beliefs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;especially if the criticism is superficial and not based on policy (e.g., all the variants of &amp;quot;Trump is racist&amp;quot;).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How is Trump&amp;#39;s racism &amp;quot;superficial&amp;quot; or &amp;quot;not based on policy?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Spending tens of billions of dollars on an ineffectual, irresponsible, disruptive border wall is justified solely by racism but still has clear negative downsides, even above and beyond being spectacularly racist (and fuck, why isn&amp;#39;t that enough)?&lt;/p&gt;\n\n&lt;p&gt;Refusals to accept refugees based on their ethnic and religious background is fueled by racism and has concrete negative effects on those people&amp;#39;s lives. Sure, spend $60 million bombing the shit out of an airfield, but god forbid you let the people you supposedly did it to protect move to Dearborn, MI.&lt;/p&gt;\n\n&lt;p&gt;Appointing a notorious racist as Attorney General means the federal government has essentially bowed out of enforcing civil rights law, or attempts at reforming brutal and discriminatory police departments, or even attempts at making sure forensic science isn&amp;#39;t abused. We&amp;#39;re in for four years of a justice department whose main objective is being &amp;quot;tough on crime,&amp;quot; and by crime they mean black and hispanic people existing.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Racism&amp;quot; isn&amp;#39;t just a buzzword. There are concrete and extremely troubling effects when racists are allowed to base their policy decisions on their racist beliefs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5wgzx", "score_hidden": false, "stickied": false, "created": 1492034785.0, "created_utc": 1492005985.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg5ti92", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Nepene", "parent_id": "t1_dg5tc5f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;but that is the place I perceived the focus to be oriented in the news and in speeches.\n\nAnd I'm noting that Hillary obviously did have a lot of focus on economic issues in her speeches, but she lacked the charisma of Bernie to get it across. It was more of a message issue than a policy issue. \n\nPeople should, in reality, care more about someone who is actually good at fixing things than someone who tries really hard and is passionant, but regardless, it's not a policy issue.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;but that is the place I perceived the focus to be oriented in the news and in speeches.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And I&amp;#39;m noting that Hillary obviously did have a lot of focus on economic issues in her speeches, but she lacked the charisma of Bernie to get it across. It was more of a message issue than a policy issue. &lt;/p&gt;\n\n&lt;p&gt;People should, in reality, care more about someone who is actually good at fixing things than someone who tries really hard and is passionant, but regardless, it&amp;#39;s not a policy issue.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5ti92", "score_hidden": false, "stickied": false, "created": 1492030624.0, "created_utc": 1492001824.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5tc5f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg5t0s4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Yes, as I noted in my OP, those proposals existed during the primaries and generals. The platform wasn't *in reality* all about minorities and social issues, but that is the place I perceived the focus to be oriented in the news and in speeches. The problem that I am highlighting is that, if someone asked, why should I vote Democratic, the answer was \"Because minorities need help and because Trump is bad\", and I am suggesting that is the wrong answer strategically.\n\nMy perception that her focus was wrong could be for a variety of reasons. It could be that, in fact, HRC tried hard to keep the focus on these proposals, but it was only the identity politics and attacks on Trump that got reported. Or it could be that the social / identity politics issues were actually her focus. I don't know.\n\nI am definitely not looking for a Hillary vs Bernie debate. I *think* the difference between them was one of emphasis. Bernie was perceived to have more credibility on economic issues purely because he was passionate about them and kept the focus on them, not necessarily because his proposals or understanding were better. And therefore I think his *messaging strategy* was better, not necessarily his specific proposals, and that Democrats should try to emulate his messaging strategy and shift the rhetorical/policy focus towards his.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, as I noted in my OP, those proposals existed during the primaries and generals. The platform wasn&amp;#39;t &lt;em&gt;in reality&lt;/em&gt; all about minorities and social issues, but that is the place I perceived the focus to be oriented in the news and in speeches. The problem that I am highlighting is that, if someone asked, why should I vote Democratic, the answer was &amp;quot;Because minorities need help and because Trump is bad&amp;quot;, and I am suggesting that is the wrong answer strategically.&lt;/p&gt;\n\n&lt;p&gt;My perception that her focus was wrong could be for a variety of reasons. It could be that, in fact, HRC tried hard to keep the focus on these proposals, but it was only the identity politics and attacks on Trump that got reported. Or it could be that the social / identity politics issues were actually her focus. I don&amp;#39;t know.&lt;/p&gt;\n\n&lt;p&gt;I am definitely not looking for a Hillary vs Bernie debate. I &lt;em&gt;think&lt;/em&gt; the difference between them was one of emphasis. Bernie was perceived to have more credibility on economic issues purely because he was passionate about them and kept the focus on them, not necessarily because his proposals or understanding were better. And therefore I think his &lt;em&gt;messaging strategy&lt;/em&gt; was better, not necessarily his specific proposals, and that Democrats should try to emulate his messaging strategy and shift the rhetorical/policy focus towards his.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5tc5f", "score_hidden": false, "stickied": false, "created": 1492030352.0, "created_utc": 1492001552.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5t0s4", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "Nepene", "parent_id": "t3_64xiv8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "http://www.vox.com/2016/4/13/11415772/clinton-sanders-daily-news\n\nHillary's attention to detail on economic matters has been well noted. She gave very detailed, precise plans on how to fix banks and fix the economy while Bernie gave much more vague feel good nonsense.\n\nHowever, the average person understands vague feel good nonsense, and Hillary's approach, actual solutions to fix the problems, go over their heads.\n\n&gt;There are two approaches. There's Section 121, Section 165, and both of them can be used by regulators to either require a bank to sell off businesses, lines of businesses or assets, because of the finding that is made by two-thirds of the financial regulators that the institution poses a grave threat, or if the Fed and the FDIC conclude that the institutions' living will resolution is inadequate and is not going to get any better, there can also be requirements that they do so.\n\nWho really knows what that means? \n\nSo Hillary's actual plans got ignored while Bernie got a reputation as a problem solver for vague nonsense.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://www.vox.com/2016/4/13/11415772/clinton-sanders-daily-news\"&gt;http://www.vox.com/2016/4/13/11415772/clinton-sanders-daily-news&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Hillary&amp;#39;s attention to detail on economic matters has been well noted. She gave very detailed, precise plans on how to fix banks and fix the economy while Bernie gave much more vague feel good nonsense.&lt;/p&gt;\n\n&lt;p&gt;However, the average person understands vague feel good nonsense, and Hillary&amp;#39;s approach, actual solutions to fix the problems, go over their heads.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;There are two approaches. There&amp;#39;s Section 121, Section 165, and both of them can be used by regulators to either require a bank to sell off businesses, lines of businesses or assets, because of the finding that is made by two-thirds of the financial regulators that the institution poses a grave threat, or if the Fed and the FDIC conclude that the institutions&amp;#39; living will resolution is inadequate and is not going to get any better, there can also be requirements that they do so.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Who really knows what that means? &lt;/p&gt;\n\n&lt;p&gt;So Hillary&amp;#39;s actual plans got ignored while Bernie got a reputation as a problem solver for vague nonsense.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5t0s4", "score_hidden": false, "stickied": false, "created": 1492029843.0, "created_utc": 1492001043.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg6nw2t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dg6nvs0", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/hacksoncode ([231∆](/r/changemyview/wiki/user/hacksoncode)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"hacksoncode\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/hacksoncode\"&gt;/u/hacksoncode&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/hacksoncode\"&gt;231∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22hacksoncode%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6nw2t", "score_hidden": false, "stickied": false, "created": 1492064333.0, "created_utc": 1492035533.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg6ra5y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg6q2vd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I am lazy, so here is the first Google result on this subject, but it is confirmed by more reputable sources if you care to look:\n\nhttp://www.commondreams.org/views/2016/10/11/labor-secretary-advised-clinton-cast-sanders-candidate-whites-turn-minorities\n\nYes, HRC herself delegated the dirty work to others, like Albright, Steinem, Perez, and others. Nevertheless, there is ample evidence her team was intentionally weaponizing identity politics.\n\nAs for the \"proper proportion\", of course that is unanswerable. I would be satisfied if the subject were used in good faith rather than as a political weapon, though.\n\nEDIT: This is well-known but I'll include it anyway: https://www.nytimes.com/2016/02/08/us/politics/gloria-steinem-madeleine-albright-hillary-clinton-bernie-sanders.html?_r=0", "edited": 1492040539.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am lazy, so here is the first Google result on this subject, but it is confirmed by more reputable sources if you care to look:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.commondreams.org/views/2016/10/11/labor-secretary-advised-clinton-cast-sanders-candidate-whites-turn-minorities\"&gt;http://www.commondreams.org/views/2016/10/11/labor-secretary-advised-clinton-cast-sanders-candidate-whites-turn-minorities&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Yes, HRC herself delegated the dirty work to others, like Albright, Steinem, Perez, and others. Nevertheless, there is ample evidence her team was intentionally weaponizing identity politics.&lt;/p&gt;\n\n&lt;p&gt;As for the &amp;quot;proper proportion&amp;quot;, of course that is unanswerable. I would be satisfied if the subject were used in good faith rather than as a political weapon, though.&lt;/p&gt;\n\n&lt;p&gt;EDIT: This is well-known but I&amp;#39;ll include it anyway: &lt;a href=\"https://www.nytimes.com/2016/02/08/us/politics/gloria-steinem-madeleine-albright-hillary-clinton-bernie-sanders.html?_r=0\"&gt;https://www.nytimes.com/2016/02/08/us/politics/gloria-steinem-madeleine-albright-hillary-clinton-bernie-sanders.html?_r=0&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6ra5y", "score_hidden": false, "stickied": false, "created": 1492068533.0, "created_utc": 1492039733.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6q2vd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hacksoncode", "parent_id": "t1_dg6nvs0", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Glad to help... \n\n&gt; I still don't agree that it's just \"the others\" blowing it out of proportion, however.\n\nI'd be interested in seeing what evidence you have of that. And what you think the proper proportion is... \n\nFrom what I can remember of the campaign, these issues were mentioned by Clinton very infrequently compared to everything else. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad to help... &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I still don&amp;#39;t agree that it&amp;#39;s just &amp;quot;the others&amp;quot; blowing it out of proportion, however.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;d be interested in seeing what evidence you have of that. And what you think the proper proportion is... &lt;/p&gt;\n\n&lt;p&gt;From what I can remember of the campaign, these issues were mentioned by Clinton very infrequently compared to everything else. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6q2vd", "score_hidden": false, "stickied": false, "created": 1492067042.0, "created_utc": 1492038242.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6nvs0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg6m8ye", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "OK. I'm not convinced that the perception of the campaign being focused on identity politics was entirely out of its control and undeserved, but it is true that it would have been hard to avoid it completely. ∆.\n\nI still don't agree that it's just \"the others\" blowing it out of proportion, however.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OK. I&amp;#39;m not convinced that the perception of the campaign being focused on identity politics was entirely out of its control and undeserved, but it is true that it would have been hard to avoid it completely. ∆.&lt;/p&gt;\n\n&lt;p&gt;I still don&amp;#39;t agree that it&amp;#39;s just &amp;quot;the others&amp;quot; blowing it out of proportion, however.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6nvs0", "score_hidden": false, "stickied": false, "created": 1492064322.0, "created_utc": 1492035522.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6m8ye", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "hacksoncode", "parent_id": "t1_dg6kmue", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The only way to avoid that would be to *completely ignore* and utterly avoid at all times this core Democratic principle. \n\nYou're basically asking Democrats to avoid entirely something which is a significant (but not sole or even primary) issue for them. \n\nThey aren't \"focusing\" on it as your view implies. It just comes up occasionally in their talking points, at a completely reasonable ratio to other \"issues affecting many/most Americans\". \n\nAnd I'll point out as a side point that racism and sexism are both \"issues affecting many/most Americans\". \n\nIt's really only corporate media and Republicans that are blowing it out of proportion. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only way to avoid that would be to &lt;em&gt;completely ignore&lt;/em&gt; and utterly avoid at all times this core Democratic principle. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re basically asking Democrats to avoid entirely something which is a significant (but not sole or even primary) issue for them. &lt;/p&gt;\n\n&lt;p&gt;They aren&amp;#39;t &amp;quot;focusing&amp;quot; on it as your view implies. It just comes up occasionally in their talking points, at a completely reasonable ratio to other &amp;quot;issues affecting many/most Americans&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;And I&amp;#39;ll point out as a side point that racism and sexism are both &amp;quot;issues affecting many/most Americans&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s really only corporate media and Republicans that are blowing it out of proportion. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6m8ye", "score_hidden": false, "stickied": false, "created": 1492062312.0, "created_utc": 1492033512.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6kmue", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg6ia60", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; If you can show that a majority of Clinton's campaign ads, position papers, and debate responses were about these topics, I'll be very surprised... because they weren't.\n\nI, too, doubt they were. But you have changed your argument. You originally argued the Republicans were responsible for the accusation that the HRC campaign was playing identity politics. Now you seem to be saying that the campaign did engage in it, but that the media amplified the identity politics more than they did her policy proposals.\n\nThis is quite likely. But in that case, there are two possibilities: the campaign either anticipated this from the media, or they didn't. If they did, the strategy was as good as intentional. If they didn't, it reeks of a bit of incompetence. It doesn't take a PR professional to know that a sound-bite accusation of racism (or whatever) will get more press than a 100-page position paper.", "edited": 1492031799.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If you can show that a majority of Clinton&amp;#39;s campaign ads, position papers, and debate responses were about these topics, I&amp;#39;ll be very surprised... because they weren&amp;#39;t.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I, too, doubt they were. But you have changed your argument. You originally argued the Republicans were responsible for the accusation that the HRC campaign was playing identity politics. Now you seem to be saying that the campaign did engage in it, but that the media amplified the identity politics more than they did her policy proposals.&lt;/p&gt;\n\n&lt;p&gt;This is quite likely. But in that case, there are two possibilities: the campaign either anticipated this from the media, or they didn&amp;#39;t. If they did, the strategy was as good as intentional. If they didn&amp;#39;t, it reeks of a bit of incompetence. It doesn&amp;#39;t take a PR professional to know that a sound-bite accusation of racism (or whatever) will get more press than a 100-page position paper.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6kmue", "score_hidden": false, "stickied": false, "created": 1492060409.0, "created_utc": 1492031609.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ia60", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hacksoncode", "parent_id": "t1_dg685a6", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; It was their main line of attack, and it is inherently identity politics to do so.\n\nIt was one of the main lines of attack *reported by the mass media*. Calling it a major portion of their strategy is basically letting the media set the agenda for a political party. \n\nThis is the most *sensational* of the (valid) attacks on Trump, so of course it was Trumpeted (hehe) the loudest in the media, and decried the loudest by the Republicans (largely because they had to defend against these  correct accusations *somehow*).\n\nIf you can show that a majority of Clinton's campaign ads, position papers, and debate responses were about these topics, I'll be very surprised... because they weren't.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It was their main line of attack, and it is inherently identity politics to do so.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It was one of the main lines of attack &lt;em&gt;reported by the mass media&lt;/em&gt;. Calling it a major portion of their strategy is basically letting the media set the agenda for a political party. &lt;/p&gt;\n\n&lt;p&gt;This is the most &lt;em&gt;sensational&lt;/em&gt; of the (valid) attacks on Trump, so of course it was Trumpeted (hehe) the loudest in the media, and decried the loudest by the Republicans (largely because they had to defend against these  correct accusations &lt;em&gt;somehow&lt;/em&gt;).&lt;/p&gt;\n\n&lt;p&gt;If you can show that a majority of Clinton&amp;#39;s campaign ads, position papers, and debate responses were about these topics, I&amp;#39;ll be very surprised... because they weren&amp;#39;t.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6ia60", "score_hidden": false, "stickied": false, "created": 1492057851.0, "created_utc": 1492029051.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg6nmz5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thatoneguy54", "parent_id": "t1_dg685a6", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; There was also the implicit, and sometimes explicit, suggestion throughout the whole campaign that it would be sexist to deny HRC the chance to break that glass ceiling, no matter why you cast your vote a certain way.\n\nI think this was more because, holy shit, Hillary Clinton was one of the single most qualified people to run for president, and, in part because she's a woman, couldn't succeed over the single most unqualified, sexist, racist, garbage piece of shit to ever run for office ever in the history of ever. \n\nLike, Jesus Christ, how much more proof of a glass ceiling do you need than a woman who was the secretary of state, a congresswoman, a skilled diplomat, with actual, real plans to help loads of people losing against someone so unfit to be president that he literally cries on twitter when someone says he's unqualified.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;There was also the implicit, and sometimes explicit, suggestion throughout the whole campaign that it would be sexist to deny HRC the chance to break that glass ceiling, no matter why you cast your vote a certain way.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think this was more because, holy shit, Hillary Clinton was one of the single most qualified people to run for president, and, in part because she&amp;#39;s a woman, couldn&amp;#39;t succeed over the single most unqualified, sexist, racist, garbage piece of shit to ever run for office ever in the history of ever. &lt;/p&gt;\n\n&lt;p&gt;Like, Jesus Christ, how much more proof of a glass ceiling do you need than a woman who was the secretary of state, a congresswoman, a skilled diplomat, with actual, real plans to help loads of people losing against someone so unfit to be president that he literally cries on twitter when someone says he&amp;#39;s unqualified.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6nmz5", "score_hidden": false, "stickied": false, "created": 1492064015.0, "created_utc": 1492035215.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg829ek", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Galentines_day", "parent_id": "t1_dg685a6", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; But if the Republican propaganda machine is so powerful it can dictate the media's impression of a candidate's overall message, why was it unable to also do the same to Sanders?\n&gt; \n\nBecause Sanders was not the Republican's opponent; Clinton was. Sanders and Clinton were Democratic opponents in the Democratic primary. Clinton defeated Sanders and then became the Republican opponent. At no point was Sanders the Republican's opponent. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But if the Republican propaganda machine is so powerful it can dictate the media&amp;#39;s impression of a candidate&amp;#39;s overall message, why was it unable to also do the same to Sanders?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Because Sanders was not the Republican&amp;#39;s opponent; Clinton was. Sanders and Clinton were Democratic opponents in the Democratic primary. Clinton defeated Sanders and then became the Republican opponent. At no point was Sanders the Republican&amp;#39;s opponent. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg829ek", "score_hidden": false, "stickied": false, "created": 1492139812.0, "created_utc": 1492111012.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg685a6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg63ev6", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I am sure this is partially true. Absolutely she had policy papers on, and talked about many other non-identity politics issues.\n\nBut if the Republican propaganda machine is so powerful it can dictate the media's impression of a candidate's overall message, why was it unable to also do the same to Sanders?\n\nMore to the point, it was HRC's campaign that voluntarily associated itself with identity politics, very early on, by using it as a potent weapon against Sanders. Madeleine \"special place in hell\" Albright and Gloria \"they just want attention from the boys\" Steinem, presumably working under our new DNC chair's direction, for example.\n\nAnd they made no effort to stop in the generals, either. They constantly lobbed every \"-ist\" in the book at Trump. It was their main line of attack, and it is inherently identity politics to do so. There was also the implicit, and sometimes explicit, suggestion throughout the whole campaign that it would be sexist to deny HRC the chance to break that glass ceiling, no matter *why* you cast your vote a certain way. \n\nTo blame all this on the Republicans is insupportable, IMO. This is a classic case of foot-gunning. I am not saying that her campaign was necessarily incorrect in all of these cases, but they did more than dabble in identity politics.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am sure this is partially true. Absolutely she had policy papers on, and talked about many other non-identity politics issues.&lt;/p&gt;\n\n&lt;p&gt;But if the Republican propaganda machine is so powerful it can dictate the media&amp;#39;s impression of a candidate&amp;#39;s overall message, why was it unable to also do the same to Sanders?&lt;/p&gt;\n\n&lt;p&gt;More to the point, it was HRC&amp;#39;s campaign that voluntarily associated itself with identity politics, very early on, by using it as a potent weapon against Sanders. Madeleine &amp;quot;special place in hell&amp;quot; Albright and Gloria &amp;quot;they just want attention from the boys&amp;quot; Steinem, presumably working under our new DNC chair&amp;#39;s direction, for example.&lt;/p&gt;\n\n&lt;p&gt;And they made no effort to stop in the generals, either. They constantly lobbed every &amp;quot;-ist&amp;quot; in the book at Trump. It was their main line of attack, and it is inherently identity politics to do so. There was also the implicit, and sometimes explicit, suggestion throughout the whole campaign that it would be sexist to deny HRC the chance to break that glass ceiling, no matter &lt;em&gt;why&lt;/em&gt; you cast your vote a certain way. &lt;/p&gt;\n\n&lt;p&gt;To blame all this on the Republicans is insupportable, IMO. This is a classic case of foot-gunning. I am not saying that her campaign was necessarily incorrect in all of these cases, but they did more than dabble in identity politics.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg685a6", "score_hidden": false, "stickied": false, "created": 1492047463.0, "created_utc": 1492018663.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg63ev6", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "hacksoncode", "parent_id": "t3_64xiv8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So is this actually a problem with Democrats? Or is it a problem with Republicans painting the Democrats that way as a political dirty trick?\n\nLook at [the actual Hillary Clinton positions on the issues](https://www.hillaryclinton.com/issues/). \n\nCount the number of \"identity politics\" issues vs. the kinds of issues that you are talking about. \n\nNever mind, I'll do it for you:\n\nEconomic and governmental issues substantially unrelated to identity issues: 41\n\nIssues related to identity politics: 4\n\nThere are long and detailed position statements about every one of these issues for anyone with the will and interest to read them. \n\nThe vast majority of what the Democratic Party's Presidential Candidate focused on were *exactly* those economic and political agenda issues that constitute a positive agenda to help the greatest number of potential voters.\n\nUnless you think that 10% of her policies dealing with the issues of civil rights of minorities is *excessive*, the problem is not the Democrats, it's people painting them as SJWs to the exclusion of everything else. \n\nThe only way she could have done *less* of this \"identity politics stuff\" is if she ignored it completely. \n\nWhat happened was the Republicans and their supporters (c.f. Milo and others) making a giant deal about the \"fact\" that Democrats were nothing but Social Justice Warriors, and that they were sick of \"political correctness\". \n\nIt was they who made this race about these issues, not Clinton. \n\nBy contrast, what did the Republicans have to offer? Racism in the form of walls and exclusion of Muslims, tax cuts for the wealthy, protectionism (not in the interest of common Americans), making common American's lives worse by repealing the ACA, a complete hatred for science, theocratic rabble rousing, etc., etc., etc.\n\nThey *had* to make this about the identity politics of the Democrats, because they literally had nothing to say that wasn't blithering stupidity.", "edited": 1492014060.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So is this actually a problem with Democrats? Or is it a problem with Republicans painting the Democrats that way as a political dirty trick?&lt;/p&gt;\n\n&lt;p&gt;Look at &lt;a href=\"https://www.hillaryclinton.com/issues/\"&gt;the actual Hillary Clinton positions on the issues&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;Count the number of &amp;quot;identity politics&amp;quot; issues vs. the kinds of issues that you are talking about. &lt;/p&gt;\n\n&lt;p&gt;Never mind, I&amp;#39;ll do it for you:&lt;/p&gt;\n\n&lt;p&gt;Economic and governmental issues substantially unrelated to identity issues: 41&lt;/p&gt;\n\n&lt;p&gt;Issues related to identity politics: 4&lt;/p&gt;\n\n&lt;p&gt;There are long and detailed position statements about every one of these issues for anyone with the will and interest to read them. &lt;/p&gt;\n\n&lt;p&gt;The vast majority of what the Democratic Party&amp;#39;s Presidential Candidate focused on were &lt;em&gt;exactly&lt;/em&gt; those economic and political agenda issues that constitute a positive agenda to help the greatest number of potential voters.&lt;/p&gt;\n\n&lt;p&gt;Unless you think that 10% of her policies dealing with the issues of civil rights of minorities is &lt;em&gt;excessive&lt;/em&gt;, the problem is not the Democrats, it&amp;#39;s people painting them as SJWs to the exclusion of everything else. &lt;/p&gt;\n\n&lt;p&gt;The only way she could have done &lt;em&gt;less&lt;/em&gt; of this &amp;quot;identity politics stuff&amp;quot; is if she ignored it completely. &lt;/p&gt;\n\n&lt;p&gt;What happened was the Republicans and their supporters (c.f. Milo and others) making a giant deal about the &amp;quot;fact&amp;quot; that Democrats were nothing but Social Justice Warriors, and that they were sick of &amp;quot;political correctness&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;It was they who made this race about these issues, not Clinton. &lt;/p&gt;\n\n&lt;p&gt;By contrast, what did the Republicans have to offer? Racism in the form of walls and exclusion of Muslims, tax cuts for the wealthy, protectionism (not in the interest of common Americans), making common American&amp;#39;s lives worse by repealing the ACA, a complete hatred for science, theocratic rabble rousing, etc., etc., etc.&lt;/p&gt;\n\n&lt;p&gt;They &lt;em&gt;had&lt;/em&gt; to make this about the identity politics of the Democrats, because they literally had nothing to say that wasn&amp;#39;t blithering stupidity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg63ev6", "score_hidden": false, "stickied": false, "created": 1492042612.0, "created_utc": 1492013812.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg5vx8u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "theshantanu", "parent_id": "t1_dg5tvc8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Last time I checked, that post was heavily moderated and had a lot of removed comments so I don't think linking it now would much. [here](https://www.reddit.com/r/SubredditDrama/search?q=bernie+&amp;restrict_sr=on) is a good place to start though.\n\n&gt;what arguments could be made to persuade me, a generic white male, that it is both morally and strategically correct to make these issues the top priority over the other, more generally applicable issues I listed?\n\nI was addressing that specific portion of your post. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Last time I checked, that post was heavily moderated and had a lot of removed comments so I don&amp;#39;t think linking it now would much. &lt;a href=\"https://www.reddit.com/r/SubredditDrama/search?q=bernie+&amp;amp;restrict_sr=on\"&gt;here&lt;/a&gt; is a good place to start though.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;what arguments could be made to persuade me, a generic white male, that it is both morally and strategically correct to make these issues the top priority over the other, more generally applicable issues I listed?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I was addressing that specific portion of your post. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5vx8u", "score_hidden": false, "stickied": false, "created": 1492034081.0, "created_utc": 1492005281.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5tvc8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg5tg44", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I have not. Do you have a link?\n\nBut assuming the criticism is justified, what arguments could be made to persuade me, a generic white male, that it is both morally and strategically correct to make these issues the top priority over the other, more generally applicable issues I listed? \n\nI am willing to vote for issues that don't affect me directly over those that do, if the imperative is great enough and the arguments are good enough.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have not. Do you have a link?&lt;/p&gt;\n\n&lt;p&gt;But assuming the criticism is justified, what arguments could be made to persuade me, a generic white male, that it is both morally and strategically correct to make these issues the top priority over the other, more generally applicable issues I listed? &lt;/p&gt;\n\n&lt;p&gt;I am willing to vote for issues that don&amp;#39;t affect me directly over those that do, if the imperative is great enough and the arguments are good enough.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5tvc8", "score_hidden": false, "stickied": false, "created": 1492031193.0, "created_utc": 1492002393.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5tg44", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "theshantanu", "parent_id": "t3_64xiv8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;A common strategy to belittle those interested in these broader issues was to say that we just don't understand the importance of, say, LGBT issues because we're white males, \"privileged\", \"Berniebros\", etc.\n\n\nDid you see S4P when those BLM activists interrupted Sanders? This criticism is not unjustified.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;A common strategy to belittle those interested in these broader issues was to say that we just don&amp;#39;t understand the importance of, say, LGBT issues because we&amp;#39;re white males, &amp;quot;privileged&amp;quot;, &amp;quot;Berniebros&amp;quot;, etc.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Did you see S4P when those BLM activists interrupted Sanders? This criticism is not unjustified.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5tg44", "score_hidden": false, "stickied": false, "created": 1492030530.0, "created_utc": 1492001730.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg5ucp7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "natha105", "parent_id": "t1_dg5u3it", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I guess my rebutal is that there are certianly things we can target: welfare, food stamps, unemployment benefits, etc.  But ultimately what we want is for a 17 year old black boy in a high school in down town Baltimore to say \"When I graduate I want to get a job at the local X.  I think if I work hard and maybe do community college at night then within three years I can be a X there.  My parents are going to be so proud of me if I am an X, and my friends will be so jealous.  As soon as I get that promotion I'll buy a house with a lawn!\"\n\nFor that we need jobs, good jobs, jobs that carry respect and pride.  That isn't a DMV job.  I'm not sure what exactly that job would be, but I know that to create the kind of economic activity necessary to make those jobs available we need to have a real mind to broader economic issues that are general, not targeted.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess my rebutal is that there are certianly things we can target: welfare, food stamps, unemployment benefits, etc.  But ultimately what we want is for a 17 year old black boy in a high school in down town Baltimore to say &amp;quot;When I graduate I want to get a job at the local X.  I think if I work hard and maybe do community college at night then within three years I can be a X there.  My parents are going to be so proud of me if I am an X, and my friends will be so jealous.  As soon as I get that promotion I&amp;#39;ll buy a house with a lawn!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;For that we need jobs, good jobs, jobs that carry respect and pride.  That isn&amp;#39;t a DMV job.  I&amp;#39;m not sure what exactly that job would be, but I know that to create the kind of economic activity necessary to make those jobs available we need to have a real mind to broader economic issues that are general, not targeted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5ucp7", "score_hidden": false, "stickied": false, "created": 1492031920.0, "created_utc": 1492003120.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5u3it", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg5t5rt", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "That is very true. To try to keep things simple, for the purposes of this discussion, I would lump \"some economic change that targets a specific group, especially a group based on race/gender\" into the social rather than economic category.\n\nI'm using these labels vaguely. Maybe better terminology would be \"focus on problems of specific groups\" versus \"focus on problems that affect most people/everyone\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is very true. To try to keep things simple, for the purposes of this discussion, I would lump &amp;quot;some economic change that targets a specific group, especially a group based on race/gender&amp;quot; into the social rather than economic category.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m using these labels vaguely. Maybe better terminology would be &amp;quot;focus on problems of specific groups&amp;quot; versus &amp;quot;focus on problems that affect most people/everyone&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5u3it", "score_hidden": false, "stickied": false, "created": 1492031544.0, "created_utc": 1492002744.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5t5rt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "natha105", "parent_id": "t1_dg5sr7b", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Thanks.  \n\nTo respond to your point, I think there can be some conflation on these issues.  Lets say my number 1 issue is improving the lives of blacks.  I might want to improve government benefits and assistance programs.  But is there anyone who thinks that even if I doubled what we spend on social assistance in black neighborhoods we would solve the problem?\n\nIncreased social spending is one part of a very politically complex knot.  To really help black americans we need to look at the US criminal justice system (and ask why america locks up like 5X as many people as its next nearest western country).  We need to look at america's economy and ask what it is going to take to get your typical black worker a respected, well paying, job (meaning we need to help industry grow).  We need to look at the education system and ask what it is going to take to get black kids today to be the best educated children on the planet (which goes to the HORRIFICALLY challenging topics for the democrats of teachers unions, and black single parenthood/social forces within black communities).  \n\nAnd in fact there can be some competition between groups.  I think there is a very good chance that if we deported all illegal immigrants low wage workers would see their hourly pay rise and a massive increase in demand for their time.  So far as democrats are concerned though that is the absolute worst possible outcome you could have.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks.  &lt;/p&gt;\n\n&lt;p&gt;To respond to your point, I think there can be some conflation on these issues.  Lets say my number 1 issue is improving the lives of blacks.  I might want to improve government benefits and assistance programs.  But is there anyone who thinks that even if I doubled what we spend on social assistance in black neighborhoods we would solve the problem?&lt;/p&gt;\n\n&lt;p&gt;Increased social spending is one part of a very politically complex knot.  To really help black americans we need to look at the US criminal justice system (and ask why america locks up like 5X as many people as its next nearest western country).  We need to look at america&amp;#39;s economy and ask what it is going to take to get your typical black worker a respected, well paying, job (meaning we need to help industry grow).  We need to look at the education system and ask what it is going to take to get black kids today to be the best educated children on the planet (which goes to the HORRIFICALLY challenging topics for the democrats of teachers unions, and black single parenthood/social forces within black communities).  &lt;/p&gt;\n\n&lt;p&gt;And in fact there can be some competition between groups.  I think there is a very good chance that if we deported all illegal immigrants low wage workers would see their hourly pay rise and a massive increase in demand for their time.  So far as democrats are concerned though that is the absolute worst possible outcome you could have.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5t5rt", "score_hidden": false, "stickied": false, "created": 1492030071.0, "created_utc": 1492001271.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg5sr8x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dg5sr7b", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/natha105 ([46∆](/r/changemyview/wiki/user/natha105)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"natha105\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/natha105\"&gt;/u/natha105&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/natha105\"&gt;46∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22natha105%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5sr8x", "score_hidden": false, "stickied": false, "created": 1492029398.0, "created_utc": 1492000598.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5sr7b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg5s8eb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Hmm. Partial ∆ because I hadn't considered that their focus on these social issues might be essentially because they can't/won't address the economic ones. \n\nThe rhetoric seems to indicate that they do so because they truly think the social issues deserve top priority. Even if the politicians themselves don't believe that, I've met a number of individual liberals who genuinely seem to.\n\nNote also that for the purposes of this CMV, I don't really care what their economic platform would be, it could be identical to the Republicans', and it would still be *strategically* better than the goose egg they have now.", "edited": 1492000821.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmm. Partial ∆ because I hadn&amp;#39;t considered that their focus on these social issues might be essentially because they can&amp;#39;t/won&amp;#39;t address the economic ones. &lt;/p&gt;\n\n&lt;p&gt;The rhetoric seems to indicate that they do so because they truly think the social issues deserve top priority. Even if the politicians themselves don&amp;#39;t believe that, I&amp;#39;ve met a number of individual liberals who genuinely seem to.&lt;/p&gt;\n\n&lt;p&gt;Note also that for the purposes of this CMV, I don&amp;#39;t really care what their economic platform would be, it could be identical to the Republicans&amp;#39;, and it would still be &lt;em&gt;strategically&lt;/em&gt; better than the goose egg they have now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5sr7b", "score_hidden": false, "stickied": false, "created": 1492029395.0, "created_utc": 1492000595.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5s8eb", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "natha105", "parent_id": "t3_64xiv8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The real problem is even worse for the democrats: there is nowhere else to go.\n\nYou want the democrats to focus on economic issues, but what would that look like?  This was the fundamental problem of occupy wallstreet: there is no solution.\n\nThere are certainly proposals but once you start to dig into them you realize not even democrats are truly on board with what it means.  In fact a lot of the generally acceptable economic reform ideas are actually longstanding republican ones.  The tax code needs to be completely overhauled for example.  We can argue about tax rates till the cows come home but basically every kind of reform is going to involve killing a huge number of benefits that were hard fought for on the left.\n\nSame thing with regulatory control of the financial industry.  We figure we need to do something different but what the hell do you even do?\n\nOutside of minority rights democrats are running on empty in terms of ideas that a) people want b) the entire party can agree on, and c) would actually result in a good outcome.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The real problem is even worse for the democrats: there is nowhere else to go.&lt;/p&gt;\n\n&lt;p&gt;You want the democrats to focus on economic issues, but what would that look like?  This was the fundamental problem of occupy wallstreet: there is no solution.&lt;/p&gt;\n\n&lt;p&gt;There are certainly proposals but once you start to dig into them you realize not even democrats are truly on board with what it means.  In fact a lot of the generally acceptable economic reform ideas are actually longstanding republican ones.  The tax code needs to be completely overhauled for example.  We can argue about tax rates till the cows come home but basically every kind of reform is going to involve killing a huge number of benefits that were hard fought for on the left.&lt;/p&gt;\n\n&lt;p&gt;Same thing with regulatory control of the financial industry.  We figure we need to do something different but what the hell do you even do?&lt;/p&gt;\n\n&lt;p&gt;Outside of minority rights democrats are running on empty in terms of ideas that a) people want b) the entire party can agree on, and c) would actually result in a good outcome.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5s8eb", "score_hidden": false, "stickied": false, "created": 1492028473.0, "created_utc": 1491999673.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg6htin", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dg6hr5u", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/definitely_right ([1∆](/r/changemyview/wiki/user/definitely_right)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"definitely_right\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/definitely_right\"&gt;/u/definitely_right&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/definitely_right\"&gt;1∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22definitely_right%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6htin", "score_hidden": false, "stickied": false, "created": 1492057375.0, "created_utc": 1492028575.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6hr5u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg6h6c0", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "This is an extremely interesting and useful point. ∆. Essentially you are saying that we have a situation where there is a conflict between the interests of individual members of the party and the party's stated goals as a whole. That makes a lot of sense and explains a lot of seemingly irrational and self-immolating behavior.\n\nI have always thought Democrats fail to sufficiently distinguish between \"what should we say to win elections\" and \"what we should actually do once we win them\". The other side understands the difference quite well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is an extremely interesting and useful point. ∆. Essentially you are saying that we have a situation where there is a conflict between the interests of individual members of the party and the party&amp;#39;s stated goals as a whole. That makes a lot of sense and explains a lot of seemingly irrational and self-immolating behavior.&lt;/p&gt;\n\n&lt;p&gt;I have always thought Democrats fail to sufficiently distinguish between &amp;quot;what should we say to win elections&amp;quot; and &amp;quot;what we should actually do once we win them&amp;quot;. The other side understands the difference quite well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6hr5u", "score_hidden": false, "stickied": false, "created": 1492057312.0, "created_utc": 1492028512.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6h6c0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "definitely_right", "parent_id": "t3_64xiv8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Coming from a conservative who voted for Trump, I will reply with the following:\n\n&gt; Essentially, that it is a bad strategy even if we were to assume that the primary goal should be to advance these minority interests, because there will not be sufficient votes using this strategy to get the power needed to advance them.\n\nIt would be a bad strategy if virtue signaling were not as big a thing as it is. Issues of identity politics may be tertiary for most people (in the sense that issues about marriage equality, racism, etc. don't *directly* impact a majority of voters), but what also matters in politicking is **how others perceive you or your actions.** \n\nThis is the inherent premise of virtue signaling. Many liberals (not *all*) may only halfheartedly support/not support these issues on a personal or moral level. But they will advocate for those issues, or vote for candidates advocating these issues, because they know that such a choice will increase public perception that that individual is a \"good person\" or \"tolerant\" or \"(insert your phrase here)\".\n\nThat's partially why so many young white millennials voted for Hillary and Bernie. They are trying to construct new norms about what is morally right and wrong, and then projecting those norms on the electorate so that the act of voting translates into an expression of conformity to that new norm.\n\nGroup psychology is powerful. We *want* to be perceived as tolerant, moral, etc. I believe you are correct when you say that this strategy will continue to cost the Left elections, but the strategy makes sense if you consider it this way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Coming from a conservative who voted for Trump, I will reply with the following:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Essentially, that it is a bad strategy even if we were to assume that the primary goal should be to advance these minority interests, because there will not be sufficient votes using this strategy to get the power needed to advance them.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It would be a bad strategy if virtue signaling were not as big a thing as it is. Issues of identity politics may be tertiary for most people (in the sense that issues about marriage equality, racism, etc. don&amp;#39;t &lt;em&gt;directly&lt;/em&gt; impact a majority of voters), but what also matters in politicking is &lt;strong&gt;how others perceive you or your actions.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;This is the inherent premise of virtue signaling. Many liberals (not &lt;em&gt;all&lt;/em&gt;) may only halfheartedly support/not support these issues on a personal or moral level. But they will advocate for those issues, or vote for candidates advocating these issues, because they know that such a choice will increase public perception that that individual is a &amp;quot;good person&amp;quot; or &amp;quot;tolerant&amp;quot; or &amp;quot;(insert your phrase here)&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s partially why so many young white millennials voted for Hillary and Bernie. They are trying to construct new norms about what is morally right and wrong, and then projecting those norms on the electorate so that the act of voting translates into an expression of conformity to that new norm.&lt;/p&gt;\n\n&lt;p&gt;Group psychology is powerful. We &lt;em&gt;want&lt;/em&gt; to be perceived as tolerant, moral, etc. I believe you are correct when you say that this strategy will continue to cost the Left elections, but the strategy makes sense if you consider it this way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6h6c0", "score_hidden": false, "stickied": false, "created": 1492056717.0, "created_utc": 1492027917.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg7piqv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gilescb", "parent_id": "t1_dg7jqh4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I know it's hard, and I share your pessimism in general. But it's obviously false if you think about it. We all start with a completely blank slate and end up with *some* view. That's a change.\n\nOn top of that, I've had my own politics and religious views change several times in my life as an adult. It doesn't happen often, or easily. But if nothing else, my secondary goal is to at least understand other views better, what motivates them, and what we might share in common.\n\nAlso, I like to periodically re-check my assumptions to make sure I haven't missed something. I didn't *expect* my views to radically change as a result of this CMV, but I *hoped* they would, and I was open to it. When I CMV, that means I was wrong and I learned something, and I consider it a very big gift if someone can help me refine my beliefs to be more accurate.\n\nEven in this thread, I did CMV. Not in a large way, but in small ways. In both directions: in some ways towards the \"liberal\" position, and in some ways away from it. I was hoping /u/groman28 would keep going a little longer. I think he could have persuaded me further, because he was addressing my core points and concerns rather than the peripheral points others were addressing. Although, with no disrespect intended to him, I think his persuasive technique is a little lacking. As the sidebar/wiki points out, self-righteousness and aggressiveness is generally not the best way to go to persuade people.", "edited": 1492098088.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know it&amp;#39;s hard, and I share your pessimism in general. But it&amp;#39;s obviously false if you think about it. We all start with a completely blank slate and end up with &lt;em&gt;some&lt;/em&gt; view. That&amp;#39;s a change.&lt;/p&gt;\n\n&lt;p&gt;On top of that, I&amp;#39;ve had my own politics and religious views change several times in my life as an adult. It doesn&amp;#39;t happen often, or easily. But if nothing else, my secondary goal is to at least understand other views better, what motivates them, and what we might share in common.&lt;/p&gt;\n\n&lt;p&gt;Also, I like to periodically re-check my assumptions to make sure I haven&amp;#39;t missed something. I didn&amp;#39;t &lt;em&gt;expect&lt;/em&gt; my views to radically change as a result of this CMV, but I &lt;em&gt;hoped&lt;/em&gt; they would, and I was open to it. When I CMV, that means I was wrong and I learned something, and I consider it a very big gift if someone can help me refine my beliefs to be more accurate.&lt;/p&gt;\n\n&lt;p&gt;Even in this thread, I did CMV. Not in a large way, but in small ways. In both directions: in some ways towards the &amp;quot;liberal&amp;quot; position, and in some ways away from it. I was hoping &lt;a href=\"/u/groman28\"&gt;/u/groman28&lt;/a&gt; would keep going a little longer. I think he could have persuaded me further, because he was addressing my core points and concerns rather than the peripheral points others were addressing. Although, with no disrespect intended to him, I think his persuasive technique is a little lacking. As the sidebar/wiki points out, self-righteousness and aggressiveness is generally not the best way to go to persuade people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg7piqv", "score_hidden": false, "stickied": false, "created": 1492126223.0, "created_utc": 1492097423.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg7qwvu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "etquod", "parent_id": "t1_dg7jqh4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sorry H42, your comment has been removed:\n\n&gt; Comment Rule 1\\. \"Direct responses to a CMV post must challenge at least one aspect of OP’s current view (however minor), unless they are asking a clarifying question. Arguments in favor of the view OP is willing to change must be restricted to replies to comments.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)  \n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Rule+1+Appeal+H42&amp;message=H42+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/64xiv8/cmv_american_liberalsdemocrats_are_making_a/dg7jqh4/\\))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry H42, your comment has been removed:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 1. &amp;quot;Direct responses to a CMV post must challenge at least one aspect of OP’s current view (however minor), unless they are asking a clarifying question. Arguments in favor of the view OP is willing to change must be restricted to replies to comments.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1\"&gt;See the wiki page for more information.&lt;/a&gt;  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Rule+1+Appeal+H42&amp;amp;message=H42+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/64xiv8/cmv_american_liberalsdemocrats_are_making_a/dg7jqh4/)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg7qwvu", "score_hidden": false, "stickied": false, "created": 1492127704.0, "created_utc": 1492098904.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jqh4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64xiv8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg7jqh4", "score_hidden": false, "stickied": false, "created": 1492119429.0, "created_utc": 1492090629.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg8w9x0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BaronBifford", "parent_id": "t3_64xiv8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I remember during the Obama years, the Republicans took a very obstructionist attitude.  They basically opposed everything Obama did.  Any well-meaning ideas the Democrats had would be automatically sabotaged by the Republicans.  I don't think the Democrats have forgotten this.  Their current disposition is a reaction to the Republicans.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remember during the Obama years, the Republicans took a very obstructionist attitude.  They basically opposed everything Obama did.  Any well-meaning ideas the Democrats had would be automatically sabotaged by the Republicans.  I don&amp;#39;t think the Democrats have forgotten this.  Their current disposition is a reaction to the Republicans.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8w9x0", "score_hidden": false, "stickied": false, "created": 1492183828.0, "created_utc": 1492155028.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg6qgj5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theonewhowillbe", "parent_id": "t3_64xiv8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;a plurality of Americans (who weren't in a marginalized group)\n\nThey are, for the most part, since most of them aren't wealthy. \n\nBut the wealthy (and thus, in turn, the media they control) don't want class issues discussed because the solutions cost them money.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;a plurality of Americans (who weren&amp;#39;t in a marginalized group)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They are, for the most part, since most of them aren&amp;#39;t wealthy. &lt;/p&gt;\n\n&lt;p&gt;But the wealthy (and thus, in turn, the media they control) don&amp;#39;t want class issues discussed because the solutions cost them money.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6qgj5", "score_hidden": false, "stickied": false, "created": 1492067523.0, "created_utc": 1492038723.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64xiv8", "likes": null, "replies": "", "user_reports": [], "id": "dg8tcwg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bunchanumbersandshit", "parent_id": "t3_64xiv8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "That's ignorant.  The biggest thing they've focused on in the past decade was health care for most Americans.  Your entire CMV is uninformed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s ignorant.  The biggest thing they&amp;#39;ve focused on in the past decade was health care for most Americans.  Your entire CMV is uninformed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8tcwg", "score_hidden": false, "stickied": false, "created": 1492176777.0, "created_utc": 1492147977.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]