[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen semi-recent posts on reddit where a person, often in a non-customer business situation, has been asked how they were doing. And when they replied that they were not doing well, or could have been doing better, they were &amp;#39;corrected&amp;#39; into answering that they were &amp;#39;fine&amp;#39;. These have fit my own experiences as well, of people asking me how I was, to which I answer honestly, and they say something along the lines of &amp;quot;Oh my god I don&amp;#39;t care.&amp;quot; In which case, I assert they shouldn&amp;#39;t have asked.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m fine&amp;quot; or &amp;quot;I&amp;#39;m okay&amp;quot; has become the default, expected response to the question of &amp;quot;How are you?&amp;quot;, and I believe that it is not only lacking in any type of social empathy, but actually detrimental to mental health in general.&lt;/p&gt;\n\n&lt;p&gt;The question &amp;quot;How are you?&amp;quot; was introduced as genuine inquiry. &amp;quot;How are you in health?&amp;quot; &amp;quot;How do you?&amp;quot; were optional greetings that involved a sincere question, separated from the traditional greetings of &amp;quot;Hello&amp;quot; or &amp;quot;Hi&amp;quot;. In this manner, the addition of &amp;quot;How are you&amp;quot; as a more commonplace greeting is an extension of empathy. Its more commonplace adoption was people actually caring about the response, which was not yet rigidly defined into &amp;quot;I&amp;#39;m fine&amp;quot; or &amp;quot;I&amp;#39;m okay&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Further than this, however, I believe that the question - particularly when asked insincerely, but perhaps even the question itself, by the social stigma that has now developed around it - is detrimental to mental health. If someone is &lt;em&gt;not&lt;/em&gt; fine, they are presented with a choice. Are they going to answer a social custom &amp;#39;incorrectly&amp;#39;, and thus have the social pressure and expectation be a burden upon them to correct (shame and embarrassment), or are they going to falsely state that they are &amp;quot;Fine&amp;quot; or &amp;quot;Okay&amp;quot;, even though social psychology shows us that stating something aloud hardens the mind against other concepts. If someone says &amp;quot;My favorite color is blue&amp;quot;, they are less likely to change their mind later. This social effect is a large reason why people have such strong reactions to hypocrisy. So, in saying &amp;quot;I&amp;#39;m fine&amp;quot; or &amp;quot;I&amp;#39;m okay&amp;quot;, when someone isn&amp;#39;t actually fine or okay, it is, in effect, painting over a crumbling wall and insisting to themselves that the problem has been solved. The slight reinforcement of that belief that they are okay is a veneer of polish over crumbling support in a country where there is still a massive stigma against admitting that someone has a mental health problem, much less actually getting help for it.&lt;/p&gt;\n\n&lt;p&gt;The only thing that an insincere &amp;quot;How are you&amp;quot; does, therefore, is drive people further into denial, and further away from help, ultimately harming them in the long run, and hardening them from the belief that anyone actually does care. As such, &amp;quot;How are you&amp;quot; should only be asked by people who legitimately care about the answer, and if someone doesn&amp;#39;t have the necessary empathy to care or talk about the issue, it shouldn&amp;#39;t be asked at all.&lt;/p&gt;\n\n&lt;p&gt;I am willing to consider alternatives to &amp;quot;How are you?&amp;quot; for more legitimate inquiries (In the hopes that slight modifications to the question would elicit more genuine results), but I am firm in my belief that the insincere version must be removed.&lt;/p&gt;\n\n&lt;p&gt;Edit: To clarify, since everyone thinks I must be just &amp;#39;too detailed&amp;#39; about things, and talking to everyone &amp;#39;as though they were my therapist&amp;#39;: I have had &amp;quot;Hanging in there&amp;quot; rebuked as being &amp;quot;More than they wanted to know.&amp;quot; I have had &amp;quot;Not so good&amp;quot; replied to as &amp;quot;The answer is &amp;#39;I&amp;#39;m fine&amp;#39;.&amp;quot; These are people asking the question in an insincere, formulaic manner, and, in my experience, it&amp;#39;s rather rampant. (I&amp;#39;ve had my own family respond in such a manner before, outside of special events).&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;This is a footnote from the CMV moderators. We&amp;#39;d like to remind you of a couple of things. Firstly, please&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules\"&gt;read through our rules&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting\"&gt;downvotes don&amp;#39;t change views&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;! Any questions or concerns? Feel free to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/message/compose?to=/r/changemyview\"&gt;message us&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;Happy CMVing!&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've seen semi-recent posts on reddit where a person, often in a non-customer business situation, has been asked how they were doing. And when they replied that they were not doing well, or could have been doing better, they were 'corrected' into answering that they were 'fine'. These have fit my own experiences as well, of people asking me how I was, to which I answer honestly, and they say something along the lines of \"Oh my god I don't care.\" In which case, I assert they shouldn't have asked.\n\n\"I'm fine\" or \"I'm okay\" has become the default, expected response to the question of \"How are you?\", and I believe that it is not only lacking in any type of social empathy, but actually detrimental to mental health in general.\n\nThe question \"How are you?\" was introduced as genuine inquiry. \"How are you in health?\" \"How do you?\" were optional greetings that involved a sincere question, separated from the traditional greetings of \"Hello\" or \"Hi\". In this manner, the addition of \"How are you\" as a more commonplace greeting is an extension of empathy. Its more commonplace adoption was people actually caring about the response, which was not yet rigidly defined into \"I'm fine\" or \"I'm okay\".\n\nFurther than this, however, I believe that the question - particularly when asked insincerely, but perhaps even the question itself, by the social stigma that has now developed around it - is detrimental to mental health. If someone is *not* fine, they are presented with a choice. Are they going to answer a social custom 'incorrectly', and thus have the social pressure and expectation be a burden upon them to correct (shame and embarrassment), or are they going to falsely state that they are \"Fine\" or \"Okay\", even though social psychology shows us that stating something aloud hardens the mind against other concepts. If someone says \"My favorite color is blue\", they are less likely to change their mind later. This social effect is a large reason why people have such strong reactions to hypocrisy. So, in saying \"I'm fine\" or \"I'm okay\", when someone isn't actually fine or okay, it is, in effect, painting over a crumbling wall and insisting to themselves that the problem has been solved. The slight reinforcement of that belief that they are okay is a veneer of polish over crumbling support in a country where there is still a massive stigma against admitting that someone has a mental health problem, much less actually getting help for it.\n\nThe only thing that an insincere \"How are you\" does, therefore, is drive people further into denial, and further away from help, ultimately harming them in the long run, and hardening them from the belief that anyone actually does care. As such, \"How are you\" should only be asked by people who legitimately care about the answer, and if someone doesn't have the necessary empathy to care or talk about the issue, it shouldn't be asked at all.\n\nI am willing to consider alternatives to \"How are you?\" for more legitimate inquiries (In the hopes that slight modifications to the question would elicit more genuine results), but I am firm in my belief that the insincere version must be removed.\n\nEdit: To clarify, since everyone thinks I must be just 'too detailed' about things, and talking to everyone 'as though they were my therapist': I have had \"Hanging in there\" rebuked as being \"More than they wanted to know.\" I have had \"Not so good\" replied to as \"The answer is 'I'm fine'.\" These are people asking the question in an insincere, formulaic manner, and, in my experience, it's rather rampant. (I've had my own family respond in such a manner before, outside of special events).\n\n_____\n\n&gt; *This is a footnote from the CMV moderators. We'd like to remind you of a couple of things. Firstly, please* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64y2fa", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 88, "report_reasons": null, "author": "Recognizant", "saved": false, "mod_reports": [], "name": "t3_64y2fa", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": 1492004525.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/64y2fa/cmv_i_believe_that_the_question_how_are_you_which/", "num_reports": null, "locked": false, "stickied": false, "created": 1492031754.0, "url": "https://www.reddit.com/r/changemyview/comments/64y2fa/cmv_i_believe_that_the_question_how_are_you_which/", "author_flair_text": "10∆", "quarantine": false, "title": "CMV: I believe that the question \"How are you?\" which has become a norm in American greetings should be asked sincerely, or not at all.", "created_utc": 1492002954.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 80, "visited": false, "subreddit_type": "public", "ups": 88}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ycc5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg5xz6n", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It's a belief, not a social movement. What is outlandish about holding a specific belief?\n\nDo you have a reason to hold onto \"How are you\" as a socially normative conversation starter other than the fact that, traditionally, we're already using it? \n\nDo you argue that there is no social pressure for someone to reply \"I'm fine\" when they aren't? \n\nDo you argue that there is no harm done in responding that you are fine when you are not?\n\nDo you argue that there is no stigma towards mental illness in this country which prevents people from seeking or getting the help that they may need when things aren't fine?\n\nDo you argue that there is no better phrase to initiate a conversation than \"How are you?\" which could be adapted as a new social norm?\n\nBecause as it stands, you are just claiming that my idea is 'outlandish' for no supporting reason.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a belief, not a social movement. What is outlandish about holding a specific belief?&lt;/p&gt;\n\n&lt;p&gt;Do you have a reason to hold onto &amp;quot;How are you&amp;quot; as a socially normative conversation starter other than the fact that, traditionally, we&amp;#39;re already using it? &lt;/p&gt;\n\n&lt;p&gt;Do you argue that there is no social pressure for someone to reply &amp;quot;I&amp;#39;m fine&amp;quot; when they aren&amp;#39;t? &lt;/p&gt;\n\n&lt;p&gt;Do you argue that there is no harm done in responding that you are fine when you are not?&lt;/p&gt;\n\n&lt;p&gt;Do you argue that there is no stigma towards mental illness in this country which prevents people from seeking or getting the help that they may need when things aren&amp;#39;t fine?&lt;/p&gt;\n\n&lt;p&gt;Do you argue that there is no better phrase to initiate a conversation than &amp;quot;How are you?&amp;quot; which could be adapted as a new social norm?&lt;/p&gt;\n\n&lt;p&gt;Because as it stands, you are just claiming that my idea is &amp;#39;outlandish&amp;#39; for no supporting reason.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5ycc5", "score_hidden": false, "stickied": false, "created": 1492037022.0, "created_utc": 1492008222.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5xz6n", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "pfinny22", "parent_id": "t1_dg5xglf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Now this seems to me to be an outlandish claim. You are proposing a social movement to elimate the use of \"How are you?\" as a conversation initiaion question just so it is easier to discern who is genuinely interested in the answer and so those who are not fine do not feel socially obligated to answer in a certain way?", "edited": 1492007996.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Now this seems to me to be an outlandish claim. You are proposing a social movement to elimate the use of &amp;quot;How are you?&amp;quot; as a conversation initiaion question just so it is easier to discern who is genuinely interested in the answer and so those who are not fine do not feel socially obligated to answer in a certain way?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5xz6n", "score_hidden": false, "stickied": false, "created": 1492036600.0, "created_utc": 1492007800.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5xz22", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg5xlk4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; I think that it is a good thing to have pleasantries and good will statements be a social norm.\n\nSo do I. I'm a big fan of \"Hello.\" I simply think that \"How are you\" as an expected social question is a high bar that hurts more than it helps precisely because of how formulaic it is. Inquiring after someone's general wellbeing *should* be something that is mildly personal.\n\n&gt; You say it is insincere.\n\nI say that, in some cases, \"How are you\" is being used in an insincere manner, when it would be better off having been avoided entirely.\n\nI have repeated my stance on this issue several times now, if you cannot even properly repeat my own stance back to me without inflating it to contain large generalities that it specifically does not contain, I don't think we're going to get very far.\n\n&gt;  I say that that there is sincerity behind wanting to say something nice to someone even if you don't have the time to handle every kind of response you might get from someone. \n\nHow is dictating back to me how I feel as a 'correct' response sincere at all? It's the epitome of not caring.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I think that it is a good thing to have pleasantries and good will statements be a social norm.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So do I. I&amp;#39;m a big fan of &amp;quot;Hello.&amp;quot; I simply think that &amp;quot;How are you&amp;quot; as an expected social question is a high bar that hurts more than it helps precisely because of how formulaic it is. Inquiring after someone&amp;#39;s general wellbeing &lt;em&gt;should&lt;/em&gt; be something that is mildly personal.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You say it is insincere.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I say that, in some cases, &amp;quot;How are you&amp;quot; is being used in an insincere manner, when it would be better off having been avoided entirely.&lt;/p&gt;\n\n&lt;p&gt;I have repeated my stance on this issue several times now, if you cannot even properly repeat my own stance back to me without inflating it to contain large generalities that it specifically does not contain, I don&amp;#39;t think we&amp;#39;re going to get very far.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I say that that there is sincerity behind wanting to say something nice to someone even if you don&amp;#39;t have the time to handle every kind of response you might get from someone. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How is dictating back to me how I feel as a &amp;#39;correct&amp;#39; response sincere at all? It&amp;#39;s the epitome of not caring.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5xz22", "score_hidden": false, "stickied": false, "created": 1492036595.0, "created_utc": 1492007795.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5xlk4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MasterGrok", "parent_id": "t1_dg5xglf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think that it is a good thing to have pleasantries and good will statements be a social norm. You say it is insincere. I say that that there is sincerity behind wanting to say something nice to someone even if you don't have the time and possibly capability  (not everyone handles negative feelings well) to handle every kind of response you might get from someone. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that it is a good thing to have pleasantries and good will statements be a social norm. You say it is insincere. I say that that there is sincerity behind wanting to say something nice to someone even if you don&amp;#39;t have the time and possibly capability  (not everyone handles negative feelings well) to handle every kind of response you might get from someone. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5xlk4", "score_hidden": false, "stickied": false, "created": 1492036155.0, "created_utc": 1492007355.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5xglf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg5wtrq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "* I am saying that there is a supermajority of American people who ask \"How are you\". \n\n* I am saying that, because of that supermajority, asking the question \"How are you\" has become a social norm. \n\n* I am saying that because it is a social norm, there is a minority of people who ask \"How are you\" because they feel obligated to, but do not want to hear a non-positive answer.\n\n* I am saying that we should remove the socially normative expectation of the question being asked, so that the only people asking are the people who actually care about the response.\n\nIn other words: It should be okay to *not* ask \"How are you\", so it is *always* okay to respond \"I've been better.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;I am saying that there is a supermajority of American people who ask &amp;quot;How are you&amp;quot;. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I am saying that, because of that supermajority, asking the question &amp;quot;How are you&amp;quot; has become a social norm. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I am saying that because it is a social norm, there is a minority of people who ask &amp;quot;How are you&amp;quot; because they feel obligated to, but do not want to hear a non-positive answer.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I am saying that we should remove the socially normative expectation of the question being asked, so that the only people asking are the people who actually care about the response.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;In other words: It should be okay to &lt;em&gt;not&lt;/em&gt; ask &amp;quot;How are you&amp;quot;, so it is &lt;em&gt;always&lt;/em&gt; okay to respond &amp;quot;I&amp;#39;ve been better.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5xglf", "score_hidden": false, "stickied": false, "created": 1492035989.0, "created_utc": 1492007189.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wtrq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MasterGrok", "parent_id": "t1_dg5wiln", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Wait are you saying everyone responds in this way or a worse way to you in this situation? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait are you saying everyone responds in this way or a worse way to you in this situation? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5wtrq", "score_hidden": false, "stickied": false, "created": 1492035230.0, "created_utc": 1492006430.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wiln", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg5w70u", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I am aware of it. Which is why I used the word \"seem\". However, I have no other plausible reason for why someone would ask the question, and then dictate to me my answer to it, other than a complete lack of sincerity, which is my original point. \n\n&gt;  I believe it is an unnecessary generalization to expand that instance to everyone and conclude that they are all insincere.\n\nFeel free to offer other reasons why that might be their response. But this is the thrust of my argument. If you are rejecting that anyone does this ever, I don't know what to tell you, except perhaps be thankful you haven't had to deal with it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am aware of it. Which is why I used the word &amp;quot;seem&amp;quot;. However, I have no other plausible reason for why someone would ask the question, and then dictate to me my answer to it, other than a complete lack of sincerity, which is my original point. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I believe it is an unnecessary generalization to expand that instance to everyone and conclude that they are all insincere.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Feel free to offer other reasons why that might be their response. But this is the thrust of my argument. If you are rejecting that anyone does this ever, I don&amp;#39;t know what to tell you, except perhaps be thankful you haven&amp;#39;t had to deal with it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5wiln", "score_hidden": false, "stickied": false, "created": 1492034841.0, "created_utc": 1492006041.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5w70u", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "MasterGrok", "parent_id": "t1_dg5vpmw", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "No we arent in agreement. I believe it is an unnecessary generalization to expand that instance to everyone and conclude that they are all insincere. I also think you should at least consider that your judgement of how people \"seem\" is skewed by your admittedly low mood. One of the hallmark features of feeling bad or depressed is that everything and everyone seems more negative. This is the blue lens that we wear when we are down. It makes sense to be aware of that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No we arent in agreement. I believe it is an unnecessary generalization to expand that instance to everyone and conclude that they are all insincere. I also think you should at least consider that your judgement of how people &amp;quot;seem&amp;quot; is skewed by your admittedly low mood. One of the hallmark features of feeling bad or depressed is that everything and everyone seems more negative. This is the blue lens that we wear when we are down. It makes sense to be aware of that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5w70u", "score_hidden": false, "stickied": false, "created": 1492034435.0, "created_utc": 1492005635.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5vpmw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg5vevf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; I would say that a person who socially rebukes you for a \"been better\" is clearly in the wrong.\n\nThen we are in agreement. Yet I have met a rather large number of such people who were seemingly insincere in their asking of the question, and put their expectation solely upon a formulaic response by the other party that everything is okay, seemingly so that they can appear to have some form of empathy which they actually lack.\n\nTherefore, it is my view that if they don't care about the answer, they shouldn't ask the question.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I would say that a person who socially rebukes you for a &amp;quot;been better&amp;quot; is clearly in the wrong.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Then we are in agreement. Yet I have met a rather large number of such people who were seemingly insincere in their asking of the question, and put their expectation solely upon a formulaic response by the other party that everything is okay, seemingly so that they can appear to have some form of empathy which they actually lack.&lt;/p&gt;\n\n&lt;p&gt;Therefore, it is my view that if they don&amp;#39;t care about the answer, they shouldn&amp;#39;t ask the question.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5vpmw", "score_hidden": false, "stickied": false, "created": 1492033806.0, "created_utc": 1492005006.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5vevf", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "MasterGrok", "parent_id": "t1_dg5v074", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I would say that a person who socially rebukes you for a \"been better\" is clearly in the wrong. That isn't normal behavior and it would be rash to draw generalizations based on one or even a few instances like that. The vast majority of people in my experience will give you a \"hang in there\" or something similar in that scenario. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would say that a person who socially rebukes you for a &amp;quot;been better&amp;quot; is clearly in the wrong. That isn&amp;#39;t normal behavior and it would be rash to draw generalizations based on one or even a few instances like that. The vast majority of people in my experience will give you a &amp;quot;hang in there&amp;quot; or something similar in that scenario. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5vevf", "score_hidden": false, "stickied": false, "created": 1492033406.0, "created_utc": 1492004606.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v074", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg5une6", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I've gotten a social rebuke from something as simple as \"Not so good\" or \"been better.\"\n\nSome random person or co-worker is not a therapist. But neither should I feel like I have to lie to them if they're the ones that asked for fear that the knowledge that someone is having a less than average day might somehow ruin the rest of theirs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve gotten a social rebuke from something as simple as &amp;quot;Not so good&amp;quot; or &amp;quot;been better.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Some random person or co-worker is not a therapist. But neither should I feel like I have to lie to them if they&amp;#39;re the ones that asked for fear that the knowledge that someone is having a less than average day might somehow ruin the rest of theirs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5v074", "score_hidden": false, "stickied": false, "created": 1492032850.0, "created_utc": 1492004050.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5une6", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "MasterGrok", "parent_id": "t3_64y2fa", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I wonder what kind of response you are giving that is receiving a \"I didn't want to know all that\" response. In my experience this greeting is meant to be a quick and informal way to say hi and get a quick read on a person's day. If you are responding like you would to a therapist or to a good friend after you've had a few drinks, then you are probably taking the greeting way too seriously. In my experience responding with a brief response that informally communicates a bad day like, \"let's just say I'm glad the work day is almost over,\" or \"this project is ruining me,\" or \"need sleep,\" then most people will reasonably respond with something like \"I've been there.\"\n\nNot every inquiry into someone's well being is meant to be a heart felt invitation to have a deep discussion and it shouldn't be taken that way. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wonder what kind of response you are giving that is receiving a &amp;quot;I didn&amp;#39;t want to know all that&amp;quot; response. In my experience this greeting is meant to be a quick and informal way to say hi and get a quick read on a person&amp;#39;s day. If you are responding like you would to a therapist or to a good friend after you&amp;#39;ve had a few drinks, then you are probably taking the greeting way too seriously. In my experience responding with a brief response that informally communicates a bad day like, &amp;quot;let&amp;#39;s just say I&amp;#39;m glad the work day is almost over,&amp;quot; or &amp;quot;this project is ruining me,&amp;quot; or &amp;quot;need sleep,&amp;quot; then most people will reasonably respond with something like &amp;quot;I&amp;#39;ve been there.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Not every inquiry into someone&amp;#39;s well being is meant to be a heart felt invitation to have a deep discussion and it shouldn&amp;#39;t be taken that way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5une6", "score_hidden": false, "stickied": false, "created": 1492032348.0, "created_utc": 1492003548.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": "", "user_reports": [], "id": "dg6qyiu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thewoodendesk", "parent_id": "t1_dg5x61l", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; One of the major problems is that it is difficult to tell who uses it formally, as an empty expression, and who uses it in an interpersonal fashion, who actually exhibits some manner of empathy.\n\nI see responding the question with a negative answer as a litmus test to determine whether someone cares about you beyond a superficial level or not. Someone who doesn't particularly care about you would respond with \"I hope you feel better soon\" and end the conversation while someone who actually wants to empathize with you would ask clarifying questions like \"what's bothering you?\" And people who apparently lecture you on what to say are just assholes, and now you know. So, the question does fulfill a purpose beyond a ice breaker.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;One of the major problems is that it is difficult to tell who uses it formally, as an empty expression, and who uses it in an interpersonal fashion, who actually exhibits some manner of empathy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I see responding the question with a negative answer as a litmus test to determine whether someone cares about you beyond a superficial level or not. Someone who doesn&amp;#39;t particularly care about you would respond with &amp;quot;I hope you feel better soon&amp;quot; and end the conversation while someone who actually wants to empathize with you would ask clarifying questions like &amp;quot;what&amp;#39;s bothering you?&amp;quot; And people who apparently lecture you on what to say are just assholes, and now you know. So, the question does fulfill a purpose beyond a ice breaker.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6qyiu", "score_hidden": false, "stickied": false, "created": 1492068141.0, "created_utc": 1492039341.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5x61l", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg5wolp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The issue for me is that the question being \"How are you?\" can come with two intentions.\n\nThe first is a formal intention - the person who is saying it just to say it.\n\nThe second is an interpersonal intention - the person who is saying it to determine your actual state of being.\n\nOne of the major problems is that it is difficult to tell who uses it formally, as an empty expression, and who uses it in an interpersonal fashion, who actually exhibits some manner of empathy.\n\nSince \"How are you\" has become an expected greeting, more people are using it formally, and therefore expecting a certain answer in response, using the formality of the setting to elicit an unhealthy response in others, particularly in the case of a situation involving a power dynamic. (Since one is more likely to offer a note of complaint to a coworker than a boss, for instance).\n\nI assert that the norm is to blame because it is encouraging people who otherwise wouldn't care to ask the question, because it's as just as much a societal norm to ask \"How are you\" as it is to answer \"I'm fine.\" Without the social norm, the individuals who ask the question insincerely would not feel the urge to 'fit in' by asking in the first place, and would not, therefore, be upset when the answer wasn't to their liking.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The issue for me is that the question being &amp;quot;How are you?&amp;quot; can come with two intentions.&lt;/p&gt;\n\n&lt;p&gt;The first is a formal intention - the person who is saying it just to say it.&lt;/p&gt;\n\n&lt;p&gt;The second is an interpersonal intention - the person who is saying it to determine your actual state of being.&lt;/p&gt;\n\n&lt;p&gt;One of the major problems is that it is difficult to tell who uses it formally, as an empty expression, and who uses it in an interpersonal fashion, who actually exhibits some manner of empathy.&lt;/p&gt;\n\n&lt;p&gt;Since &amp;quot;How are you&amp;quot; has become an expected greeting, more people are using it formally, and therefore expecting a certain answer in response, using the formality of the setting to elicit an unhealthy response in others, particularly in the case of a situation involving a power dynamic. (Since one is more likely to offer a note of complaint to a coworker than a boss, for instance).&lt;/p&gt;\n\n&lt;p&gt;I assert that the norm is to blame because it is encouraging people who otherwise wouldn&amp;#39;t care to ask the question, because it&amp;#39;s as just as much a societal norm to ask &amp;quot;How are you&amp;quot; as it is to answer &amp;quot;I&amp;#39;m fine.&amp;quot; Without the social norm, the individuals who ask the question insincerely would not feel the urge to &amp;#39;fit in&amp;#39; by asking in the first place, and would not, therefore, be upset when the answer wasn&amp;#39;t to their liking.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5x61l", "score_hidden": false, "stickied": false, "created": 1492035643.0, "created_utc": 1492006843.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wolp", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "AurelianoTampa", "parent_id": "t1_dg5vlzt", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;It's a bad social norm, because it forces people to answer untruthfully, or outside the accepted range if there is anything that is \"not fine\".\n\nReading this and your edit to the OP, it sounds more like the problem is with the people you encounter than with the social norm itself. Yes, those people sound unempathetic and insincere - but most people I've known who hear \"I'm not doing great\" or something similar will either followup or at least give a polite (albeit dismissive) \"I hope things get better soon\" in response. \n\nSince our experiences seem to differ wildly, how do you determine that the norm is to blame and not just the specific people you encounter?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s a bad social norm, because it forces people to answer untruthfully, or outside the accepted range if there is anything that is &amp;quot;not fine&amp;quot;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Reading this and your edit to the OP, it sounds more like the problem is with the people you encounter than with the social norm itself. Yes, those people sound unempathetic and insincere - but most people I&amp;#39;ve known who hear &amp;quot;I&amp;#39;m not doing great&amp;quot; or something similar will either followup or at least give a polite (albeit dismissive) &amp;quot;I hope things get better soon&amp;quot; in response. &lt;/p&gt;\n\n&lt;p&gt;Since our experiences seem to differ wildly, how do you determine that the norm is to blame and not just the specific people you encounter?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5wolp", "score_hidden": false, "stickied": false, "created": 1492035054.0, "created_utc": 1492006254.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": "", "user_reports": [], "id": "dg668f0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Goodlake", "parent_id": "t1_dg65m2k", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I agree that your main point is that social conventions (e.g. \"How are you?\") frequently require people to suppress/deny/conceal their true feelings, but I might argue that that is explicitly the point of social conventions. In your post, you argue that alternatives to \"How are you\" that don't require someone to lie about their general wellbeing are preferable, but my point is that any question for which the purpose is to establish some cultural norm rather than to seek specific information is going to run into this problem.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that your main point is that social conventions (e.g. &amp;quot;How are you?&amp;quot;) frequently require people to suppress/deny/conceal their true feelings, but I might argue that that is explicitly the point of social conventions. In your post, you argue that alternatives to &amp;quot;How are you&amp;quot; that don&amp;#39;t require someone to lie about their general wellbeing are preferable, but my point is that any question for which the purpose is to establish some cultural norm rather than to seek specific information is going to run into this problem.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg668f0", "score_hidden": false, "stickied": false, "created": 1492045540.0, "created_utc": 1492016740.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg65m2k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg6574q", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;  The point is that there's immense social pressure on such people, even if they're hungry, to say that yes, they have eaten.\n\nThis is my main point, though.\n\nI'm presuming what you mean to say is that any social normative statement inquiring after another's well-being is always going to have an issue where there are people who feel like they are outside the scope of the intended conversation. Which brings me back to the issue of - this shouldn't be a socially normative behavior.\n\nNo one should ever be compelled to ask if they don't actually care.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The point is that there&amp;#39;s immense social pressure on such people, even if they&amp;#39;re hungry, to say that yes, they have eaten.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is my main point, though.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m presuming what you mean to say is that any social normative statement inquiring after another&amp;#39;s well-being is always going to have an issue where there are people who feel like they are outside the scope of the intended conversation. Which brings me back to the issue of - this shouldn&amp;#39;t be a socially normative behavior.&lt;/p&gt;\n\n&lt;p&gt;No one should ever be compelled to ask if they don&amp;#39;t actually care.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg65m2k", "score_hidden": false, "stickied": false, "created": 1492044906.0, "created_utc": 1492016106.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6574q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Goodlake", "parent_id": "t1_dg64m1f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; If I ask someone if they've even, and they say no... I feed them.\n\nBut if you, a Westerner (I assume), ask someone if they've eaten, you're actually inquiring about their hunger. The phrase in China is idiomatic and someone in China being asked if he'd eaten wouldn't be expected to talk about his hunger. The point is that there's immense social pressure on such people, even if they're hungry, to say that yes, they have eaten. That's because the asker isn't literally inquiring about one's level of hunger, but about one's general well-being in the way that we ask \"How are you?\" \n\nI am speculating, but I imagine if you answered such a question in China by saying \"No, and I am hungry,\" that would be considered a faux pas and would likely not be followed by offers of food.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If I ask someone if they&amp;#39;ve even, and they say no... I feed them.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But if you, a Westerner (I assume), ask someone if they&amp;#39;ve eaten, you&amp;#39;re actually inquiring about their hunger. The phrase in China is idiomatic and someone in China being asked if he&amp;#39;d eaten wouldn&amp;#39;t be expected to talk about his hunger. The point is that there&amp;#39;s immense social pressure on such people, even if they&amp;#39;re hungry, to say that yes, they have eaten. That&amp;#39;s because the asker isn&amp;#39;t literally inquiring about one&amp;#39;s level of hunger, but about one&amp;#39;s general well-being in the way that we ask &amp;quot;How are you?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I am speculating, but I imagine if you answered such a question in China by saying &amp;quot;No, and I am hungry,&amp;quot; that would be considered a faux pas and would likely not be followed by offers of food.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6574q", "score_hidden": false, "stickied": false, "created": 1492044473.0, "created_utc": 1492015673.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg64m1f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg63yf0", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; \"Have you eaten\" as a customary social introduction surely might trigger hungry people into thinking they're not adapted to society?\n\nMaybe. But that's a problem with an immediate solution. If I ask someone if they've even, and they say no... I feed them. America has a 5% rate of people who are malnourished. America has 18.2% of the population as reporting some type of mental illness, to say nothing of the people who are just having a bad day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Have you eaten&amp;quot; as a customary social introduction surely might trigger hungry people into thinking they&amp;#39;re not adapted to society?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Maybe. But that&amp;#39;s a problem with an immediate solution. If I ask someone if they&amp;#39;ve even, and they say no... I feed them. America has a 5% rate of people who are malnourished. America has 18.2% of the population as reporting some type of mental illness, to say nothing of the people who are just having a bad day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg64m1f", "score_hidden": false, "stickied": false, "created": 1492043870.0, "created_utc": 1492015070.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg63yf0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Goodlake", "parent_id": "t1_dg5wopg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "There isn't a \"trap\" of inquiring about general welfare? \"Have you eaten\" as a customary social introduction surely might trigger hungry people into thinking they're not adapted to society? Surely asking a starving person if they've eaten might not only cause the hungry person to focus on his hunger, but to question whether or not he fits society's ideal of someone who has, in fact, eaten?\n\nIt seems like your broader problem might be that social customs generally may risk alienating those who do not or can not easily adhere to those customs, which is probably the case, but that's a different argument.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There isn&amp;#39;t a &amp;quot;trap&amp;quot; of inquiring about general welfare? &amp;quot;Have you eaten&amp;quot; as a customary social introduction surely might trigger hungry people into thinking they&amp;#39;re not adapted to society? Surely asking a starving person if they&amp;#39;ve eaten might not only cause the hungry person to focus on his hunger, but to question whether or not he fits society&amp;#39;s ideal of someone who has, in fact, eaten?&lt;/p&gt;\n\n&lt;p&gt;It seems like your broader problem might be that social customs generally may risk alienating those who do not or can not easily adhere to those customs, which is probably the case, but that&amp;#39;s a different argument.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg63yf0", "score_hidden": false, "stickied": false, "created": 1492043184.0, "created_utc": 1492014384.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": "", "user_reports": [], "id": "dg5wzil", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pfinny22", "parent_id": "t1_dg5wopg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I agree with everything you say here. When initiating a conversation, both people are attempting to gauge the other parties general mood and interest and also establish a level of comfort in conversing. Thats why most conversations begin with easy questions with generally predictable answers, e.g. \"How are you?\" \"What's up?\" \"How is your day going?\". A lot of time people will ask several of these questions in a row in order to buy time while establishing the flow and tone of the interaction.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with everything you say here. When initiating a conversation, both people are attempting to gauge the other parties general mood and interest and also establish a level of comfort in conversing. Thats why most conversations begin with easy questions with generally predictable answers, e.g. &amp;quot;How are you?&amp;quot; &amp;quot;What&amp;#39;s up?&amp;quot; &amp;quot;How is your day going?&amp;quot;. A lot of time people will ask several of these questions in a row in order to buy time while establishing the flow and tone of the interaction.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5wzil", "score_hidden": false, "stickied": false, "created": 1492035425.0, "created_utc": 1492006625.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wopg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg5w6yh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The same can be said of a number of phrases and responses. The tone of \"Hello\" varies widely, for instance, and starts up most of the same social responses in body language from entering a conversation. In Mandarin, the phrase is roughly, \"Have you eaten?\" A more specific question that follows the same line, but without any 'trap' of inquiring after general welfare.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The same can be said of a number of phrases and responses. The tone of &amp;quot;Hello&amp;quot; varies widely, for instance, and starts up most of the same social responses in body language from entering a conversation. In Mandarin, the phrase is roughly, &amp;quot;Have you eaten?&amp;quot; A more specific question that follows the same line, but without any &amp;#39;trap&amp;#39; of inquiring after general welfare.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5wopg", "score_hidden": false, "stickied": false, "created": 1492035058.0, "created_utc": 1492006258.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5w6yh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pfinny22", "parent_id": "t1_dg5vlzt", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Asking \"How are you?\" allows the inquirer to gauge the other person's general mood and level of interest in conversing. A lot can be learned from the tone and body language incorportaed into the answer even if the asker isn't genuinely interested in the answer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Asking &amp;quot;How are you?&amp;quot; allows the inquirer to gauge the other person&amp;#39;s general mood and level of interest in conversing. A lot can be learned from the tone and body language incorportaed into the answer even if the asker isn&amp;#39;t genuinely interested in the answer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5w6yh", "score_hidden": false, "stickied": false, "created": 1492034433.0, "created_utc": 1492005633.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": "", "user_reports": [], "id": "dg655b4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg63xy0", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Lying can actually have benefits. I'm not sure I agree that being \"forced\" to lie has negative effects on people.\n\nIn that article, it even states that depressed people are, on the whole, more honest. So they're asking someone who by all accounts wants to be honest in that moment, and telling them that socially, they're required to lie and pretend they're okay, and then you're telling me it's good for them?\n\n[Because it's not.](https://psychcentral.com/lib/denial-is-a-powerful-impediment-to-treatment/)\n\n&gt; Small talk is beneficial to building relationships. It generally doesn't start out as sincere, but thats how relationships are built.\n\nGood thing I'm not talking about banning small talk, then.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Lying can actually have benefits. I&amp;#39;m not sure I agree that being &amp;quot;forced&amp;quot; to lie has negative effects on people.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In that article, it even states that depressed people are, on the whole, more honest. So they&amp;#39;re asking someone who by all accounts wants to be honest in that moment, and telling them that socially, they&amp;#39;re required to lie and pretend they&amp;#39;re okay, and then you&amp;#39;re telling me it&amp;#39;s good for them?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://psychcentral.com/lib/denial-is-a-powerful-impediment-to-treatment/\"&gt;Because it&amp;#39;s not.&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Small talk is beneficial to building relationships. It generally doesn&amp;#39;t start out as sincere, but thats how relationships are built.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Good thing I&amp;#39;m not talking about banning small talk, then.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg655b4", "score_hidden": false, "stickied": false, "created": 1492044420.0, "created_utc": 1492015620.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg63xy0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tweetypi", "parent_id": "t1_dg62ott", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You created your view based on unrelated studies, it's not really significant evidence. Why do you need significant evidence to feel that it's just as likely your view is wrong. I don't know what kind of studies would change your mind, because you didn't actually pull your idea from studies, but assumptions you made with them.\n\n\nhttp://www.readersdigest.ca/health/relationships/benefits-small-talk/\n\n\n\nSmall talk is beneficial to building relationships. It generally doesn't start out as sincere, but thats how relationships are built.\n\n\nAlso lying is not always negative\n\n\nhttps://www.forbes.com/2005/10/19/lying-dishonesty-psychology_cx_lr_comm05_1024lie.html\n\n\n\nLying can actually have benefits. I'm not sure I agree that being \"forced\" to lie has negative effects on people.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You created your view based on unrelated studies, it&amp;#39;s not really significant evidence. Why do you need significant evidence to feel that it&amp;#39;s just as likely your view is wrong. I don&amp;#39;t know what kind of studies would change your mind, because you didn&amp;#39;t actually pull your idea from studies, but assumptions you made with them.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.readersdigest.ca/health/relationships/benefits-small-talk/\"&gt;http://www.readersdigest.ca/health/relationships/benefits-small-talk/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Small talk is beneficial to building relationships. It generally doesn&amp;#39;t start out as sincere, but thats how relationships are built.&lt;/p&gt;\n\n&lt;p&gt;Also lying is not always negative&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.forbes.com/2005/10/19/lying-dishonesty-psychology_cx_lr_comm05_1024lie.html\"&gt;https://www.forbes.com/2005/10/19/lying-dishonesty-psychology_cx_lr_comm05_1024lie.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Lying can actually have benefits. I&amp;#39;m not sure I agree that being &amp;quot;forced&amp;quot; to lie has negative effects on people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg63xy0", "score_hidden": false, "stickied": false, "created": 1492043170.0, "created_utc": 1492014370.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg62ott", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg623dp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Is it possible that the idea you extrapolated from other studies is wrong?\n\nAbsolutely. But I would need sufficient evidence to the contrary in regards to the seemingly innocuous nature of \"How are You\" in order to convince me of that, or, in absence of such a study,  sufficient evidence regarding the three listed pillars that support the idea. As it stands, it is a simple logical assumption based on evidence.\n\n&gt; Is is not just as possible for their to be a positive or neutral response to the question?\n\nI'm sure it is possible. But I would need to see significant evidence in order to convince me that an insincere question with a socially forced answer pinning someone between the stresses of social pressures and lying is more likely to have a positive result than a negative one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Is it possible that the idea you extrapolated from other studies is wrong?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Absolutely. But I would need sufficient evidence to the contrary in regards to the seemingly innocuous nature of &amp;quot;How are You&amp;quot; in order to convince me of that, or, in absence of such a study,  sufficient evidence regarding the three listed pillars that support the idea. As it stands, it is a simple logical assumption based on evidence.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Is is not just as possible for their to be a positive or neutral response to the question?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m sure it is possible. But I would need to see significant evidence in order to convince me that an insincere question with a socially forced answer pinning someone between the stresses of social pressures and lying is more likely to have a positive result than a negative one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg62ott", "score_hidden": false, "stickied": false, "created": 1492041830.0, "created_utc": 1492013030.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg623dp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "tweetypi", "parent_id": "t1_dg60sne", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;I have extrapolated it from other findings.\n\n\n\n\nIs it possible that the idea you extrapolated from other studies is wrong? I have never heard anyone but you talk about negative consequences of \"how are you?\" on the mentally ill.\n\n\n\nYou kinda go down a slipped slope of why it will whitewash their feelings (as assertion you cannot prove), affect how they perceive what happened (also unproved), and then end with them deciding they don't have a problem (compleaty unproved).\n\n\n\nIs is not just as possible for their to be a positive or neutral response to the question?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have extrapolated it from other findings.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Is it possible that the idea you extrapolated from other studies is wrong? I have never heard anyone but you talk about negative consequences of &amp;quot;how are you?&amp;quot; on the mentally ill.&lt;/p&gt;\n\n&lt;p&gt;You kinda go down a slipped slope of why it will whitewash their feelings (as assertion you cannot prove), affect how they perceive what happened (also unproved), and then end with them deciding they don&amp;#39;t have a problem (compleaty unproved).&lt;/p&gt;\n\n&lt;p&gt;Is is not just as possible for their to be a positive or neutral response to the question?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg623dp", "score_hidden": false, "stickied": false, "created": 1492041193.0, "created_utc": 1492012393.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": "", "user_reports": [], "id": "dg632jd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg62s5g", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "There are other phrases which can inquire about the same transaction without the emotional baggage of a perceived 'expected' response.\n\nFor instance: \"What's up?\"/\"What are you currently up to?\"\n\nThese still leave the door open to major life events while not socially presupposing a state of positivity.\n\nThere is body language and tone of voice, and plenty of other questions for establishing a conversational baseline, of which \"How are you\" can certainly remain an option, but should not be something which is asked when the answer is a moot question out of pure formality.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are other phrases which can inquire about the same transaction without the emotional baggage of a perceived &amp;#39;expected&amp;#39; response.&lt;/p&gt;\n\n&lt;p&gt;For instance: &amp;quot;What&amp;#39;s up?&amp;quot;/&amp;quot;What are you currently up to?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;These still leave the door open to major life events while not socially presupposing a state of positivity.&lt;/p&gt;\n\n&lt;p&gt;There is body language and tone of voice, and plenty of other questions for establishing a conversational baseline, of which &amp;quot;How are you&amp;quot; can certainly remain an option, but should not be something which is asked when the answer is a moot question out of pure formality.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg632jd", "score_hidden": false, "stickied": false, "created": 1492042245.0, "created_utc": 1492013445.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg62s5g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Goodlake", "parent_id": "t1_dg60sne", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Hence, 'more harm than good', because I see no advantage at all to the custom at large.\n\nEstablishing that both parties to a conversation or transaction have no material issues outstanding (e.g. my wife is divorcing me, I'm distracted, my emotions are more important to me than whatever business we need to conduct) that might impair their ability to conduct business is an advantage. In that sense, someone's inability to simply say \"I'm fine\" is actually tremendously informative in certain contexts and will allow other parties to proceed with caution.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Hence, &amp;#39;more harm than good&amp;#39;, because I see no advantage at all to the custom at large.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Establishing that both parties to a conversation or transaction have no material issues outstanding (e.g. my wife is divorcing me, I&amp;#39;m distracted, my emotions are more important to me than whatever business we need to conduct) that might impair their ability to conduct business is an advantage. In that sense, someone&amp;#39;s inability to simply say &amp;quot;I&amp;#39;m fine&amp;quot; is actually tremendously informative in certain contexts and will allow other parties to proceed with caution.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg62s5g", "score_hidden": false, "stickied": false, "created": 1492041933.0, "created_utc": 1492013133.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg60sne", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg5yyiw", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Do you have evidence that suggests saying \"I'm fine\" in casual contexts (i.e. contexts where someone doesn't actually expect you to describe how you're feeling), when one in fact feels other than \"fine,\" harms one's mental health?\n\nI do not have a specific study on this condition.\n\nI have extrapolated it from other findings.\n\n* Studies show that speaking a belief aloud reinforces that belief.\n\n* Studies show that speaking aloud encourages memory.\n\n* Studies show that the memorable parts of an event, which more often include spoken words than internal feelings, shape recollection of that event.\n\n(I don't have access to these studies at the moment, google is not being my friend [It rarely is for studies anyways], and my social psych book isn't with me at the moment.)\n\nTherefore, we can extrapolate that a situation in which someone is not doing fine (Let's say their dog just died and they're struggling with the situation) talks to Bob, and Bob asks how they are, and they respond with a rote \"I am fine\". In the moment, this reinforces a belief - that they will get over it. This is a good thing, but it's fleeting. Later on, thinking back on it, with both the passage of time dulling pain, and memory recollection focusing on the statements more than feelings, it will be easier to picture themselves as having no real problems at all.\n\nThe issue comes in through repetition, however. Bad events are whitewashed with this response, and further decision making is altered by what was deemed normative in the past. Grief can become a new 'normal' over the course of a few weeks, and continue in its ignored state because they have convinced themselves that they are fine. All it does it prolong a stage of denial and make people less likely to seek help for things they need help with in a country where most people wait too long to seek help anyways.\n\n&gt; For whom?\n\nAnyone who is not \"fine\" or \"good\".\n\n&gt; Your argument seems to be that for people for whom this is harmful, this is harmful, which one could apply to literally any custom imaginable.\n\nYes. Hence, 'more harm than good', because I see no advantage at all to the custom at large. \"How are you?\" could be changed into any other conversation starter and this problem would vanish. Since it does no good, and some harm, the custom is bad.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Do you have evidence that suggests saying &amp;quot;I&amp;#39;m fine&amp;quot; in casual contexts (i.e. contexts where someone doesn&amp;#39;t actually expect you to describe how you&amp;#39;re feeling), when one in fact feels other than &amp;quot;fine,&amp;quot; harms one&amp;#39;s mental health?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I do not have a specific study on this condition.&lt;/p&gt;\n\n&lt;p&gt;I have extrapolated it from other findings.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Studies show that speaking a belief aloud reinforces that belief.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Studies show that speaking aloud encourages memory.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Studies show that the memorable parts of an event, which more often include spoken words than internal feelings, shape recollection of that event.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;(I don&amp;#39;t have access to these studies at the moment, google is not being my friend [It rarely is for studies anyways], and my social psych book isn&amp;#39;t with me at the moment.)&lt;/p&gt;\n\n&lt;p&gt;Therefore, we can extrapolate that a situation in which someone is not doing fine (Let&amp;#39;s say their dog just died and they&amp;#39;re struggling with the situation) talks to Bob, and Bob asks how they are, and they respond with a rote &amp;quot;I am fine&amp;quot;. In the moment, this reinforces a belief - that they will get over it. This is a good thing, but it&amp;#39;s fleeting. Later on, thinking back on it, with both the passage of time dulling pain, and memory recollection focusing on the statements more than feelings, it will be easier to picture themselves as having no real problems at all.&lt;/p&gt;\n\n&lt;p&gt;The issue comes in through repetition, however. Bad events are whitewashed with this response, and further decision making is altered by what was deemed normative in the past. Grief can become a new &amp;#39;normal&amp;#39; over the course of a few weeks, and continue in its ignored state because they have convinced themselves that they are fine. All it does it prolong a stage of denial and make people less likely to seek help for things they need help with in a country where most people wait too long to seek help anyways.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;For whom?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Anyone who is not &amp;quot;fine&amp;quot; or &amp;quot;good&amp;quot;.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Your argument seems to be that for people for whom this is harmful, this is harmful, which one could apply to literally any custom imaginable.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes. Hence, &amp;#39;more harm than good&amp;#39;, because I see no advantage at all to the custom at large. &amp;quot;How are you?&amp;quot; could be changed into any other conversation starter and this problem would vanish. Since it does no good, and some harm, the custom is bad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg60sne", "score_hidden": false, "stickied": false, "created": 1492039764.0, "created_utc": 1492010964.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5yyiw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Goodlake", "parent_id": "t1_dg5yi99", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Do you have evidence that suggests saying \"I'm fine\" in casual contexts (i.e. contexts where someone doesn't actually expect you to describe how you're feeling), when one in fact feels other than \"fine,\" harms one's mental health? It's possible, I suppose, but it seems to me that the vast majority of people have no problem participating in this ritual. If someone is suffering mental health issues to such a degree that casually responding \"I'm fine\" causes harm, then that person should be seeking professional help, rather than seeking to change popular custom to suit one's needs.\n\n&gt; because it causes more harm than good.\n\nFor whom? I think most people either enjoy the custom or have no feelings on it and they are able to get on with the conversation or the task at hand. Your argument seems to be that for people for whom this is harmful, this is harmful, which one could apply to literally any custom imaginable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have evidence that suggests saying &amp;quot;I&amp;#39;m fine&amp;quot; in casual contexts (i.e. contexts where someone doesn&amp;#39;t actually expect you to describe how you&amp;#39;re feeling), when one in fact feels other than &amp;quot;fine,&amp;quot; harms one&amp;#39;s mental health? It&amp;#39;s possible, I suppose, but it seems to me that the vast majority of people have no problem participating in this ritual. If someone is suffering mental health issues to such a degree that casually responding &amp;quot;I&amp;#39;m fine&amp;quot; causes harm, then that person should be seeking professional help, rather than seeking to change popular custom to suit one&amp;#39;s needs.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;because it causes more harm than good.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;For whom? I think most people either enjoy the custom or have no feelings on it and they are able to get on with the conversation or the task at hand. Your argument seems to be that for people for whom this is harmful, this is harmful, which one could apply to literally any custom imaginable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5yyiw", "score_hidden": false, "stickied": false, "created": 1492037718.0, "created_utc": 1492008918.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5yi99", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg5yani", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; No, he should rightly expect \"Good\" or \"Fine, you?\" because that's what social norms dictate.\n\nThis is my point. Answering \"Good\" or \"Fine, You?\" is often a bad response for one's own mental health, because if someone is not \"Good\" or \"Fine\", they are publically vocally stating that they are. This has a significant effect on the mind. One that could easily prevent someone from getting help through repetition and normalizing negative situations.\n\n&gt; Suggesting it's a \"bad social norm\" is a fine opinion, but social norms and idiomatic expressions aren't developed according to how logically sound they are.\n\nThis is my opinion, yes. It is a social norm that has an expectedly positive answer, and therefore, should not be a social norm, because it causes more harm than good.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;No, he should rightly expect &amp;quot;Good&amp;quot; or &amp;quot;Fine, you?&amp;quot; because that&amp;#39;s what social norms dictate.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is my point. Answering &amp;quot;Good&amp;quot; or &amp;quot;Fine, You?&amp;quot; is often a bad response for one&amp;#39;s own mental health, because if someone is not &amp;quot;Good&amp;quot; or &amp;quot;Fine&amp;quot;, they are publically vocally stating that they are. This has a significant effect on the mind. One that could easily prevent someone from getting help through repetition and normalizing negative situations.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Suggesting it&amp;#39;s a &amp;quot;bad social norm&amp;quot; is a fine opinion, but social norms and idiomatic expressions aren&amp;#39;t developed according to how logically sound they are.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is my opinion, yes. It is a social norm that has an expectedly positive answer, and therefore, should not be a social norm, because it causes more harm than good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5yi99", "score_hidden": false, "stickied": false, "created": 1492037209.0, "created_utc": 1492008409.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5yani", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Goodlake", "parent_id": "t1_dg5vlzt", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; If Bob asks me \"How are you?\" he should rightly expect an answer regarding my general condition\n\nNo, he should rightly expect \"Good\" or \"Fine, you?\" because that's what social norms dictate. \"How are you\" from a coworker or a waiter or a taxi driver is essentially, if not literally, a different question than \"how are you\" from a doctor or a parent. \n\nSuggesting it's a \"bad social norm\" because there is some ambiguity in the question's meaning when divorced from the context in which the conversation takes place is a fine opinion (I suppose), but social norms and idiomatic expressions aren't developed according to how logically sound they are or with due consideration to how someone unfamiliar with or averse to said idiom might interpret these norms.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If Bob asks me &amp;quot;How are you?&amp;quot; he should rightly expect an answer regarding my general condition&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, he should rightly expect &amp;quot;Good&amp;quot; or &amp;quot;Fine, you?&amp;quot; because that&amp;#39;s what social norms dictate. &amp;quot;How are you&amp;quot; from a coworker or a waiter or a taxi driver is essentially, if not literally, a different question than &amp;quot;how are you&amp;quot; from a doctor or a parent. &lt;/p&gt;\n\n&lt;p&gt;Suggesting it&amp;#39;s a &amp;quot;bad social norm&amp;quot; because there is some ambiguity in the question&amp;#39;s meaning when divorced from the context in which the conversation takes place is a fine opinion (I suppose), but social norms and idiomatic expressions aren&amp;#39;t developed according to how logically sound they are or with due consideration to how someone unfamiliar with or averse to said idiom might interpret these norms.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5yani", "score_hidden": false, "stickied": false, "created": 1492036969.0, "created_utc": 1492008169.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": "", "user_reports": [], "id": "dg5wd2e", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Salanmander", "parent_id": "t1_dg5vlzt", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I've given many answers to \"how are you?\", including \"really good, actually!\", \"fine\", \"eh\", \"*tired*\", and \"bleaugghhg\". I've gotten appropriate expressions of excitement, neutral reaction, or sympathy. They've all be *quick* exchanges.\n\nI think that asking \"how are you?\" expecting a *quick* response is totally fine. I agree with you that \"correcting people into just saying fine\" is the wrong way to go, and that there should be at least some willingness to hear how the other person is doing. But I think it's fine to expect it to be general, and not long or specific.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve given many answers to &amp;quot;how are you?&amp;quot;, including &amp;quot;really good, actually!&amp;quot;, &amp;quot;fine&amp;quot;, &amp;quot;eh&amp;quot;, &amp;quot;&lt;em&gt;tired&lt;/em&gt;&amp;quot;, and &amp;quot;bleaugghhg&amp;quot;. I&amp;#39;ve gotten appropriate expressions of excitement, neutral reaction, or sympathy. They&amp;#39;ve all be &lt;em&gt;quick&lt;/em&gt; exchanges.&lt;/p&gt;\n\n&lt;p&gt;I think that asking &amp;quot;how are you?&amp;quot; expecting a &lt;em&gt;quick&lt;/em&gt; response is totally fine. I agree with you that &amp;quot;correcting people into just saying fine&amp;quot; is the wrong way to go, and that there should be at least some willingness to hear how the other person is doing. But I think it&amp;#39;s fine to expect it to be general, and not long or specific.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5wd2e", "score_hidden": false, "stickied": false, "created": 1492034648.0, "created_utc": 1492005848.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5vlzt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg5v4wh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I understand context. But that someone is asked a question to which there is only one response, while it ignores the other entirety of the human condition is absurd. We have other words for a reason. If we're at work, and Bob wants a work response, Bob could ask \"How is your work?\" Or even a more common and colloquial \"Busy lately?\"\n\nIf Bob asks me \"How are you?\" he should rightly expect an answer regarding my general condition - as he asked a general question about me. It's a bad social norm, because it forces people to answer untruthfully, or outside the accepted range if there is anything that is \"not fine\".\n\nThis was the crux of my argument.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand context. But that someone is asked a question to which there is only one response, while it ignores the other entirety of the human condition is absurd. We have other words for a reason. If we&amp;#39;re at work, and Bob wants a work response, Bob could ask &amp;quot;How is your work?&amp;quot; Or even a more common and colloquial &amp;quot;Busy lately?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;If Bob asks me &amp;quot;How are you?&amp;quot; he should rightly expect an answer regarding my general condition - as he asked a general question about me. It&amp;#39;s a bad social norm, because it forces people to answer untruthfully, or outside the accepted range if there is anything that is &amp;quot;not fine&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;This was the crux of my argument.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5vlzt", "score_hidden": false, "stickied": false, "created": 1492033672.0, "created_utc": 1492004872.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v4wh", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "AurelianoTampa", "parent_id": "t3_64y2fa", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Seems to me like you prefer a very low context style of interaction, where words are taken literally and at face value. But much of the world (and even much of US society) either prefers high context or a mixture of the two. As you said, asking \"how are you?\" isn't a inquiry into your most personal issues, but rather a social norm. It is not a low context greeting but rather a high context one that revolves around politeness. \n\nIncidentally, some situations do involve a low context meaning. If your friends or loved ones ask how you're doing, they generally should be willing to listen if you have a problem. Your coworker Bob probably doesn't much care, but he also doesn't know you outside of work. And now that I think of it, Bob's inquiry can merit a response - as long as it is related to work. The context of the situation matters.\n\nNavigating the differences between these types of situations is part of understanding our language and culture. It's not that asking \"how are you\" is insincere, but rather that you're attempting to take the context of it out of the equation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seems to me like you prefer a very low context style of interaction, where words are taken literally and at face value. But much of the world (and even much of US society) either prefers high context or a mixture of the two. As you said, asking &amp;quot;how are you?&amp;quot; isn&amp;#39;t a inquiry into your most personal issues, but rather a social norm. It is not a low context greeting but rather a high context one that revolves around politeness. &lt;/p&gt;\n\n&lt;p&gt;Incidentally, some situations do involve a low context meaning. If your friends or loved ones ask how you&amp;#39;re doing, they generally should be willing to listen if you have a problem. Your coworker Bob probably doesn&amp;#39;t much care, but he also doesn&amp;#39;t know you outside of work. And now that I think of it, Bob&amp;#39;s inquiry can merit a response - as long as it is related to work. The context of the situation matters.&lt;/p&gt;\n\n&lt;p&gt;Navigating the differences between these types of situations is part of understanding our language and culture. It&amp;#39;s not that asking &amp;quot;how are you&amp;quot; is insincere, but rather that you&amp;#39;re attempting to take the context of it out of the equation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5v4wh", "score_hidden": false, "stickied": false, "created": 1492033030.0, "created_utc": 1492004230.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": "", "user_reports": [], "id": "dg75wqv", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "CKReflux", "parent_id": "t1_dg63p1s", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I work in a job where I spend basically all day talking to a continuous stream of customers. I get a lot of \"so how's your day going?\". If it's a miserable day, I'll usually answer something along the lines of \"Ahhhhh not so well, but hey that's life sometimes right?\". The *vast* majority of the time people will express sympathy or acknowledgement, I don't think I've ever had someone be upset by it. From my experience and from a lot of the other comments In this thread, I get the feeling that what you are describing is far from the typical experience. \n\nI've always been a firm believer in \"it's not what you say, it's how you say it\". Do you think it's possible that the way you're delivering your negative responses is the reason for people's dismissal?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I work in a job where I spend basically all day talking to a continuous stream of customers. I get a lot of &amp;quot;so how&amp;#39;s your day going?&amp;quot;. If it&amp;#39;s a miserable day, I&amp;#39;ll usually answer something along the lines of &amp;quot;Ahhhhh not so well, but hey that&amp;#39;s life sometimes right?&amp;quot;. The &lt;em&gt;vast&lt;/em&gt; majority of the time people will express sympathy or acknowledgement, I don&amp;#39;t think I&amp;#39;ve ever had someone be upset by it. From my experience and from a lot of the other comments In this thread, I get the feeling that what you are describing is far from the typical experience. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always been a firm believer in &amp;quot;it&amp;#39;s not what you say, it&amp;#39;s how you say it&amp;quot;. Do you think it&amp;#39;s possible that the way you&amp;#39;re delivering your negative responses is the reason for people&amp;#39;s dismissal?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg75wqv", "score_hidden": false, "stickied": false, "created": 1492087769.0, "created_utc": 1492058969.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg63p1s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg62vda", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Yes. Two bosses, a cousin, three teachers, a professor, my paternal grandfather, and my maternal step-grandfather.\n\nAnd those are the ones that I remember offhand. I was raised with particular importance on honesty, and my early life has seen the loss of many people who were very dear to me, and significant hardship. As such, rather often truthfully reply to \"How are you\" in a less than positive manner, and it is not uncommon that someone is either completely apathetic or 'corrective'.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. Two bosses, a cousin, three teachers, a professor, my paternal grandfather, and my maternal step-grandfather.&lt;/p&gt;\n\n&lt;p&gt;And those are the ones that I remember offhand. I was raised with particular importance on honesty, and my early life has seen the loss of many people who were very dear to me, and significant hardship. As such, rather often truthfully reply to &amp;quot;How are you&amp;quot; in a less than positive manner, and it is not uncommon that someone is either completely apathetic or &amp;#39;corrective&amp;#39;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg63p1s", "score_hidden": false, "stickied": false, "created": 1492042909.0, "created_utc": 1492014109.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg62vda", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "FubsyGamr", "parent_id": "t1_dg5v9fb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "COME ON. You have had MULTIPLE interactions with people where you've given an answer like \"hanging in there\" and you've been REBUKED?\n\nYou are either:\n\n1. Lying and exaggerating to try to make your OP sound more legitimate\n2. You are surrounded by some of the most crass and socially awkward people on the planet\n3. You yourself are a crass and socially awkward person", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;COME ON. You have had MULTIPLE interactions with people where you&amp;#39;ve given an answer like &amp;quot;hanging in there&amp;quot; and you&amp;#39;ve been REBUKED?&lt;/p&gt;\n\n&lt;p&gt;You are either:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Lying and exaggerating to try to make your OP sound more legitimate&lt;/li&gt;\n&lt;li&gt;You are surrounded by some of the most crass and socially awkward people on the planet&lt;/li&gt;\n&lt;li&gt;You yourself are a crass and socially awkward person&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg62vda", "score_hidden": false, "stickied": false, "created": 1492042029.0, "created_utc": 1492013229.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v9fb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg5v51v", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I have had \"Hanging in there\" rebuked as being \"More than they wanted to know.\" I have had \"Not so good\" replied to as \"The answer is 'I'm fine'.\" Apparently, everyone thinks I'm an oversharer, though, so I'll edit this into my above post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have had &amp;quot;Hanging in there&amp;quot; rebuked as being &amp;quot;More than they wanted to know.&amp;quot; I have had &amp;quot;Not so good&amp;quot; replied to as &amp;quot;The answer is &amp;#39;I&amp;#39;m fine&amp;#39;.&amp;quot; Apparently, everyone thinks I&amp;#39;m an oversharer, though, so I&amp;#39;ll edit this into my above post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5v9fb", "score_hidden": false, "stickied": false, "created": 1492033202.0, "created_utc": 1492004402.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v51v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "neofederalist", "parent_id": "t3_64y2fa", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "There's a difference between an answer which is \"truthful\" and an answer which is \"complete and detailed\" and I think the detail with which you should be responding to people depends entirely on the context.\n\nConsider the two responses to \"Hi, How're you?\"\n\n&gt;\"Hanging in there, man.\"\n\nand\n\n&gt;\"I didn't get very good sleep last night, the dogs kept me up. I've been stressing out about this big meeting we've got with the director this afternoon, and I'll be a lot better when it's all over.\"\n\nI'd contend that both answers are truthful and sincere, but in some situations it's valid to say the second one, while in others you should limit yourself to the first. The better you know the person you're talking to, the more detailed of a response I think you can be expected to give, and I think the circumstances surrounding the question are also a factor. If you just got into the office and are walking into the break room to get coffee while they're heading back to their desk, it probably isn't appropriate to go into that level of detail, and something shorter is better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a difference between an answer which is &amp;quot;truthful&amp;quot; and an answer which is &amp;quot;complete and detailed&amp;quot; and I think the detail with which you should be responding to people depends entirely on the context.&lt;/p&gt;\n\n&lt;p&gt;Consider the two responses to &amp;quot;Hi, How&amp;#39;re you?&amp;quot;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Hanging in there, man.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;and&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;I didn&amp;#39;t get very good sleep last night, the dogs kept me up. I&amp;#39;ve been stressing out about this big meeting we&amp;#39;ve got with the director this afternoon, and I&amp;#39;ll be a lot better when it&amp;#39;s all over.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;d contend that both answers are truthful and sincere, but in some situations it&amp;#39;s valid to say the second one, while in others you should limit yourself to the first. The better you know the person you&amp;#39;re talking to, the more detailed of a response I think you can be expected to give, and I think the circumstances surrounding the question are also a factor. If you just got into the office and are walking into the break room to get coffee while they&amp;#39;re heading back to their desk, it probably isn&amp;#39;t appropriate to go into that level of detail, and something shorter is better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg5v51v", "score_hidden": false, "stickied": false, "created": 1492033036.0, "created_utc": 1492004236.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": "", "user_reports": [], "id": "dg6genr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg6f4u1", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Ballpark 30s. And I agree. If I was young, it could have just been rude people who were trying to teach me the expected response. But it certainly did not suddenly stop after I became an adult.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ballpark 30s. And I agree. If I was young, it could have just been rude people who were trying to teach me the expected response. But it certainly did not suddenly stop after I became an adult.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6genr", "score_hidden": false, "stickied": false, "created": 1492055924.0, "created_utc": 1492027124.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6f4u1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "on_my_lunch_break", "parent_id": "t1_dg6eyrp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": " Wait... If it's okay for me to ask,  how old are you, ballpark? I feel like your experience has very different implications if you're a high school or college student than it does if you're a working professional.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait... If it&amp;#39;s okay for me to ask,  how old are you, ballpark? I feel like your experience has very different implications if you&amp;#39;re a high school or college student than it does if you&amp;#39;re a working professional.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6f4u1", "score_hidden": false, "stickied": false, "created": 1492054627.0, "created_utc": 1492025827.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6eyrp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg6es6k", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Generally the context is one of assumed superiority. It tends to come from authority figures (teachers, professors, grandparents) who are either dismissive of the opinion of others or attempting to correct what they perceive to be 'wrong' behavior.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Generally the context is one of assumed superiority. It tends to come from authority figures (teachers, professors, grandparents) who are either dismissive of the opinion of others or attempting to correct what they perceive to be &amp;#39;wrong&amp;#39; behavior.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6eyrp", "score_hidden": false, "stickied": false, "created": 1492054456.0, "created_utc": 1492025656.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6es6k", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "on_my_lunch_break", "parent_id": "t3_64y2fa", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;  I have had \"Hanging in there\" rebuked as being \"More than they wanted to know.\" I have had \"Not so good\" replied to as \"The answer is 'I'm fine'.\"\n\nIn what contexts do people feel comfortable being so blatantly rude to you?  This seems like an unreasonable response. I try to answer this question honestly and I've *never* gotten a response other than genuine concern. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have had &amp;quot;Hanging in there&amp;quot; rebuked as being &amp;quot;More than they wanted to know.&amp;quot; I have had &amp;quot;Not so good&amp;quot; replied to as &amp;quot;The answer is &amp;#39;I&amp;#39;m fine&amp;#39;.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In what contexts do people feel comfortable being so blatantly rude to you?  This seems like an unreasonable response. I try to answer this question honestly and I&amp;#39;ve &lt;em&gt;never&lt;/em&gt; gotten a response other than genuine concern. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6es6k", "score_hidden": false, "stickied": false, "created": 1492054273.0, "created_utc": 1492025473.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": "", "user_reports": [], "id": "dg62u3v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg624aa", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It could be a regional difference. Without further evidence, I would assume that it is most likely a personal difference. Some specific people just not caring (sociopaths and people with particularly busy days coming to mind, among others).\n\nThe point is that it should be okay to not ask the question if you aren't interested in the response, rather than having a forced reply via a socially pre-written script.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It could be a regional difference. Without further evidence, I would assume that it is most likely a personal difference. Some specific people just not caring (sociopaths and people with particularly busy days coming to mind, among others).&lt;/p&gt;\n\n&lt;p&gt;The point is that it should be okay to not ask the question if you aren&amp;#39;t interested in the response, rather than having a forced reply via a socially pre-written script.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg62u3v", "score_hidden": false, "stickied": false, "created": 1492041992.0, "created_utc": 1492013192.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg624aa", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SchiferlED", "parent_id": "t3_64y2fa", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "In my experience, both professional and otherwise, when I respond honestly that I'm not feeling well (sick or something), the person who asked does not correct me to say \"I'm fine\". They usually respond with care and wish me to get better.\n\nMaybe this is a regional difference? I would see it as very rude to tell someone \"No, you are supposed to say you are fine\" if you are legitimately not fine.\n\nI find that the greeting \"How are you\" is a great way to prompt further conversation. If you just say \"Hello\", it's harder to lead into something else. I can respond \"I'm doing alright, but work is really busy right now!\" or something else.", "edited": 1492012662.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my experience, both professional and otherwise, when I respond honestly that I&amp;#39;m not feeling well (sick or something), the person who asked does not correct me to say &amp;quot;I&amp;#39;m fine&amp;quot;. They usually respond with care and wish me to get better.&lt;/p&gt;\n\n&lt;p&gt;Maybe this is a regional difference? I would see it as very rude to tell someone &amp;quot;No, you are supposed to say you are fine&amp;quot; if you are legitimately not fine.&lt;/p&gt;\n\n&lt;p&gt;I find that the greeting &amp;quot;How are you&amp;quot; is a great way to prompt further conversation. If you just say &amp;quot;Hello&amp;quot;, it&amp;#39;s harder to lead into something else. I can respond &amp;quot;I&amp;#39;m doing alright, but work is really busy right now!&amp;quot; or something else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg624aa", "score_hidden": false, "stickied": false, "created": 1492041219.0, "created_utc": 1492012419.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": "", "user_reports": [], "id": "dg7c258", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ed__", "parent_id": "t1_dg61okd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Yep and if you can imply some level of answer by tone but it's not expected.\n\nIf you are realy realy bad the answer would be \"no but, yeah\" Which answers honestly, removes any obligation for the other person to get stuck in and makes light of the sheer absurdity of the question.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep and if you can imply some level of answer by tone but it&amp;#39;s not expected.&lt;/p&gt;\n\n&lt;p&gt;If you are realy realy bad the answer would be &amp;quot;no but, yeah&amp;quot; Which answers honestly, removes any obligation for the other person to get stuck in and makes light of the sheer absurdity of the question.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg7c258", "score_hidden": false, "stickied": false, "created": 1492102884.0, "created_utc": 1492074084.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg61okd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg61h44", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Interesting. So if I understand this correctly, a sample conversation would be:\n\n\"Hello.\"\n\n\"Hello.\"\n\n\"You alright?\"\n\n\"You alright?\"\n\n\"&lt;Something about football or the weather&gt;?\"\n\nLike, there's no actual response, but the statement \"You alright?\" is both the question and response? That would absolutely avoid the problem of someone having to lie about it, while at the same time both parties are using the phrase to show interest in the other. Seems nifty.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting. So if I understand this correctly, a sample conversation would be:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hello.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hello.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You alright?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You alright?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;&amp;lt;Something about football or the weather&amp;gt;?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Like, there&amp;#39;s no actual response, but the statement &amp;quot;You alright?&amp;quot; is both the question and response? That would absolutely avoid the problem of someone having to lie about it, while at the same time both parties are using the phrase to show interest in the other. Seems nifty.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg61okd", "score_hidden": false, "stickied": false, "created": 1492040741.0, "created_utc": 1492011941.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg61h44", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Arkiasis", "parent_id": "t3_64y2fa", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "In the UK it's common to greet people with \"You alright?\" And they say the same thing back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the UK it&amp;#39;s common to greet people with &amp;quot;You alright?&amp;quot; And they say the same thing back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg61h44", "score_hidden": false, "stickied": false, "created": 1492040514.0, "created_utc": 1492011714.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": "", "user_reports": [], "id": "dg737mk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thekingearl", "parent_id": "t3_64y2fa", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It's an invitation to make small talk - if the other person wants to. There are plenty of situations where it might be nice to briefly get to know someone, pass the time, or kill an awkward silence, but the other person might not be interested.\n\nA conversation could go:\n\n*\"How are you doing?\"*\n\n*\"Pretty good. I just got back from a nice trip so I can't complain.\"*\n\n*\"Oh I love to travel. Where did you go?\"*\n\nEtc. Or whatever. A natural conversation begins. If the person asked wants to. Or it could go:\n\n*\"How are you doing?\"*\n\n*\"Fine, thanks.\"*\n\nThe end - if the asked person doesn't feel like chatting.\n\nWhile this effectively means sometimes it's used the same as \"hello\" it adds that extra option. Consider how this doesn't work to trigger casual conversation:\n\n*\"Hello.\"*\n\n*Oh hi! I just got back from a trip!\"*\n\n\"...? Uh, ok.\"*\n\nOr consider how direct questions to someone  you would only have a casual conversation with seems rude:\n\n*\"Hey, there! Tell me the most interesting going on in your life right now.\"*\n\n*\"Uh...I don't know you that well.\"*\n\nThe casual, \"How are you doing,\" solves all that. It allows the original greeter to invite light conversation without being to pointed, and it allows the respondent to either engage naturally or politely decline with no one getting ruffled either way.\n\nHaving any sort of social IQ at all allows a person to know the difference between someone close to them genuinely asking how they are and stranger or casual acquaintance offering small talk. Common sense says that your best friend is probably happy to empathize with you if you got dumped, fired and had your dog die all in the same week - but a acquaintance or stranger realistically has enough going on in their own life - and doesn't know you well enough for any advice or comfort to really matter - to spend time on your problems.\n\nFor the small amount of the population dealing with mental illness or depression the answer isn't completely altering societal norms to have strangers have to listen to you tell them how Nancy at the office is being a backstabbing bitch making your life hell again on the off chance you're going to also admit you're suicidal. It is to normalize seeking proper help from proper people in a position to help if you're experiencing true depression of mental illness.\n\nAfter all, if a stranger told you they were dealing with severe depression would/could you realistically do? If they said they were suicidal you might call the police or give them the number to your pastor or something. But if they told you, \"I'm just so depressed and need a psychiatrist but don't have the money are you personally going to walk this person, who has admitted to mental problems, to a mental health facility and pay for it? \n\nMoreover, the scenario where the person with severe depression recognizing it and admitting it is unlikely. In an honest answer they're more likely to just say, \"I've just been really down for a while...(etc).\" Are you really equipped to tell the difference between the person who is dealing with a normal run of bad luck / the blues but ultimately is going to be just fine and someone with true mental illness? I doubt most people are. Better to just reinforce seeking qualified help if you need it.\n\n**TL;DR: \"How are you doing?\" has advantages of politely opening up the possibility for small talk that other greetings don't. Whether it's an invitation for small talk or a genuine inquiry is obvious to the vast majority of people in context. People with genuine depression or other issues wouldn't receive any benefit from everyone wearing their emotions on their sleeves because to most people their complaints would be indistinguishable from persons just having a bad week. If you want to help people with mental illness / depression you advertise how to recognize the difference between mental illness and a normal run of the blues and normalize seeking help if you have the former.**\n\nEdit: typos ", "edited": 1492059355.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s an invitation to make small talk - if the other person wants to. There are plenty of situations where it might be nice to briefly get to know someone, pass the time, or kill an awkward silence, but the other person might not be interested.&lt;/p&gt;\n\n&lt;p&gt;A conversation could go:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;How are you doing?&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;Pretty good. I just got back from a nice trip so I can&amp;#39;t complain.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;Oh I love to travel. Where did you go?&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Etc. Or whatever. A natural conversation begins. If the person asked wants to. Or it could go:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;How are you doing?&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;Fine, thanks.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The end - if the asked person doesn&amp;#39;t feel like chatting.&lt;/p&gt;\n\n&lt;p&gt;While this effectively means sometimes it&amp;#39;s used the same as &amp;quot;hello&amp;quot; it adds that extra option. Consider how this doesn&amp;#39;t work to trigger casual conversation:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;Hello.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Oh hi! I just got back from a trip!&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;...? Uh, ok.&amp;quot;*&lt;/p&gt;\n\n&lt;p&gt;Or consider how direct questions to someone  you would only have a casual conversation with seems rude:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;Hey, there! Tell me the most interesting going on in your life right now.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;Uh...I don&amp;#39;t know you that well.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The casual, &amp;quot;How are you doing,&amp;quot; solves all that. It allows the original greeter to invite light conversation without being to pointed, and it allows the respondent to either engage naturally or politely decline with no one getting ruffled either way.&lt;/p&gt;\n\n&lt;p&gt;Having any sort of social IQ at all allows a person to know the difference between someone close to them genuinely asking how they are and stranger or casual acquaintance offering small talk. Common sense says that your best friend is probably happy to empathize with you if you got dumped, fired and had your dog die all in the same week - but a acquaintance or stranger realistically has enough going on in their own life - and doesn&amp;#39;t know you well enough for any advice or comfort to really matter - to spend time on your problems.&lt;/p&gt;\n\n&lt;p&gt;For the small amount of the population dealing with mental illness or depression the answer isn&amp;#39;t completely altering societal norms to have strangers have to listen to you tell them how Nancy at the office is being a backstabbing bitch making your life hell again on the off chance you&amp;#39;re going to also admit you&amp;#39;re suicidal. It is to normalize seeking proper help from proper people in a position to help if you&amp;#39;re experiencing true depression of mental illness.&lt;/p&gt;\n\n&lt;p&gt;After all, if a stranger told you they were dealing with severe depression would/could you realistically do? If they said they were suicidal you might call the police or give them the number to your pastor or something. But if they told you, &amp;quot;I&amp;#39;m just so depressed and need a psychiatrist but don&amp;#39;t have the money are you personally going to walk this person, who has admitted to mental problems, to a mental health facility and pay for it? &lt;/p&gt;\n\n&lt;p&gt;Moreover, the scenario where the person with severe depression recognizing it and admitting it is unlikely. In an honest answer they&amp;#39;re more likely to just say, &amp;quot;I&amp;#39;ve just been really down for a while...(etc).&amp;quot; Are you really equipped to tell the difference between the person who is dealing with a normal run of bad luck / the blues but ultimately is going to be just fine and someone with true mental illness? I doubt most people are. Better to just reinforce seeking qualified help if you need it.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR: &amp;quot;How are you doing?&amp;quot; has advantages of politely opening up the possibility for small talk that other greetings don&amp;#39;t. Whether it&amp;#39;s an invitation for small talk or a genuine inquiry is obvious to the vast majority of people in context. People with genuine depression or other issues wouldn&amp;#39;t receive any benefit from everyone wearing their emotions on their sleeves because to most people their complaints would be indistinguishable from persons just having a bad week. If you want to help people with mental illness / depression you advertise how to recognize the difference between mental illness and a normal run of the blues and normalize seeking help if you have the former.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Edit: typos &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg737mk", "score_hidden": false, "stickied": false, "created": 1492083569.0, "created_utc": 1492054769.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": "", "user_reports": [], "id": "dg6svq7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Recognizant", "parent_id": "t1_dg6noh4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Where I am, we use \"What's up\" for that function. And it's anything from &lt;big event&gt; to \"nothing much\" or \"same old\".\n\nThis is it works really well, too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where I am, we use &amp;quot;What&amp;#39;s up&amp;quot; for that function. And it&amp;#39;s anything from &amp;lt;big event&amp;gt; to &amp;quot;nothing much&amp;quot; or &amp;quot;same old&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;This is it works really well, too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6svq7", "score_hidden": false, "stickied": false, "created": 1492070514.0, "created_utc": 1492041714.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6noh4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "getintheVandell", "parent_id": "t3_64y2fa", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "In Newfoundland, where I live, we have a turn of phrase everyone uses:\n\n\"Whaddyat?\" (Pronounced: \"Wad-ya-at\", and means, what are you at, or, how are things?) The person is asking what are you doing and how are things going.\n\nThere's generally one accepted response: \"Thissisit\". (Pronounced: \"This-is-it\", and means, this is it, or not much.) This is the usual answer; it's a bit cynical in nature, because we all have an understanding that things are a bit messed up.\n\nIn regards to what you're saying.. the reason we do this is because people have an instinctual desire to keep their private lives private.. I do not think it's because they're trying to hide their personal feelings and problems away from others.\n\nBut let's assume it is: my reasoning for not espousing how I actually feel is because I do not want to burden the person listening to me with my problems. If I don't think I can handle them on my own, I'll go to people who I think can help me the best and I won't be burdening with my issues.\n\nIn short - I think everyone should use 'This is it'.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In Newfoundland, where I live, we have a turn of phrase everyone uses:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Whaddyat?&amp;quot; (Pronounced: &amp;quot;Wad-ya-at&amp;quot;, and means, what are you at, or, how are things?) The person is asking what are you doing and how are things going.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s generally one accepted response: &amp;quot;Thissisit&amp;quot;. (Pronounced: &amp;quot;This-is-it&amp;quot;, and means, this is it, or not much.) This is the usual answer; it&amp;#39;s a bit cynical in nature, because we all have an understanding that things are a bit messed up.&lt;/p&gt;\n\n&lt;p&gt;In regards to what you&amp;#39;re saying.. the reason we do this is because people have an instinctual desire to keep their private lives private.. I do not think it&amp;#39;s because they&amp;#39;re trying to hide their personal feelings and problems away from others.&lt;/p&gt;\n\n&lt;p&gt;But let&amp;#39;s assume it is: my reasoning for not espousing how I actually feel is because I do not want to burden the person listening to me with my problems. If I don&amp;#39;t think I can handle them on my own, I&amp;#39;ll go to people who I think can help me the best and I won&amp;#39;t be burdening with my issues.&lt;/p&gt;\n\n&lt;p&gt;In short - I think everyone should use &amp;#39;This is it&amp;#39;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6noh4", "score_hidden": false, "stickied": false, "created": 1492064070.0, "created_utc": 1492035270.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg6y9vd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MontiBurns", "parent_id": "t3_64y2fa", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Theres an area of linguistics called pragmatics, which studies what words and phrases mean in different contexts. If we're already immersed in a conversation, then yes \"How are you?\" does mean \"I want to know what is going on with your life. However, if we run into each other in passing or we are just starting a conversation,\" how are you?\" \"fine\" isn't a social norm, it's a greeting.\n\nIf you say to me \"what's up?\" and I turn my head to look at the sky and say \"oh, a few clouds, and I think that's an airplane.\" would that be a socially acceptable response?  No. I don't literally want to know what's up. I'm just saying hello, which the appropriate response is \"nothing.\" (\"what's up?\" can also mean \"what's wrong?\" or \"what do you need to talk to me about?\" in some contexts.) \"how are you?\" just happens to mean two things. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Theres an area of linguistics called pragmatics, which studies what words and phrases mean in different contexts. If we&amp;#39;re already immersed in a conversation, then yes &amp;quot;How are you?&amp;quot; does mean &amp;quot;I want to know what is going on with your life. However, if we run into each other in passing or we are just starting a conversation,&amp;quot; how are you?&amp;quot; &amp;quot;fine&amp;quot; isn&amp;#39;t a social norm, it&amp;#39;s a greeting.&lt;/p&gt;\n\n&lt;p&gt;If you say to me &amp;quot;what&amp;#39;s up?&amp;quot; and I turn my head to look at the sky and say &amp;quot;oh, a few clouds, and I think that&amp;#39;s an airplane.&amp;quot; would that be a socially acceptable response?  No. I don&amp;#39;t literally want to know what&amp;#39;s up. I&amp;#39;m just saying hello, which the appropriate response is &amp;quot;nothing.&amp;quot; (&amp;quot;what&amp;#39;s up?&amp;quot; can also mean &amp;quot;what&amp;#39;s wrong?&amp;quot; or &amp;quot;what do you need to talk to me about?&amp;quot; in some contexts.) &amp;quot;how are you?&amp;quot; just happens to mean two things. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg6y9vd", "score_hidden": false, "stickied": false, "created": 1492077088.0, "created_utc": 1492048288.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": "", "user_reports": [], "id": "dg7c9s1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Vicious43", "parent_id": "t3_64y2fa", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I've been to brazil where it's considered weird to greet somebody you don't know. I've done it and gotten blank eyed stares. \n\nI know that one of the most common complements from people visiting the U.S. is that the people are very friendly. I believe that this friendliness which extends is a strength of the U.S. in how it presents itself to the world, and in order to maintain this trait, simple kind greetings are necessary. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been to brazil where it&amp;#39;s considered weird to greet somebody you don&amp;#39;t know. I&amp;#39;ve done it and gotten blank eyed stares. &lt;/p&gt;\n\n&lt;p&gt;I know that one of the most common complements from people visiting the U.S. is that the people are very friendly. I believe that this friendliness which extends is a strength of the U.S. in how it presents itself to the world, and in order to maintain this trait, simple kind greetings are necessary. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg7c9s1", "score_hidden": false, "stickied": false, "created": 1492103535.0, "created_utc": 1492074735.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_64y2fa", "likes": null, "replies": "", "user_reports": [], "id": "dg65nwo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anonoman925", "parent_id": "t3_64y2fa", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Shaking hands is an old custom showing that you are hiding no weapons. \n\nGreetings are a vestigial way to check if you're in the level. \n\nWhat's the reaction if you don't respond now?  Threat or something is wrong. \n\nToday we are a more helpful culture, so we are concerned with well being. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Shaking hands is an old custom showing that you are hiding no weapons. &lt;/p&gt;\n\n&lt;p&gt;Greetings are a vestigial way to check if you&amp;#39;re in the level. &lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s the reaction if you don&amp;#39;t respond now?  Threat or something is wrong. &lt;/p&gt;\n\n&lt;p&gt;Today we are a more helpful culture, so we are concerned with well being. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg65nwo", "score_hidden": false, "stickied": false, "created": 1492044959.0, "created_utc": 1492016159.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]