[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is something that I&amp;#39;ve been thinking about lately and I&amp;#39;d like to have a discussion on it.  This discussion will obviously bring up some hot-button topics, but I ask that we all stay civil and that we stay on topic.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Introduction&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Most social injustices in the world today manifest themselves as a discrepancy between two groups when there is no real reason for that discrepancy to exist.  One example is the discrepancy for callbacks on resume submissions with a white sounding name vs. a black sounding name.  Another example is the discrepancy in salaries between men and women (related to the career choices they make).  These two discrepancies are talked about on a widespread basis.  There are other discrepancies such as the differences in child custody battles between men and women.  This is an example of a discrepancy that is often claimed to be &amp;quot;not talked about&amp;quot;, which I agree with to some extent but still there exist places on Reddit and other sites dedicated to addressing these issues.&lt;/p&gt;\n\n&lt;p&gt;However, I find it strange that one discrepancy that I have &lt;strong&gt;never&lt;/strong&gt; seen a conversation about in the real world or on reddit is the difference in how often men are put in jail as opposed to women.  According to &lt;a href=\"https://en.wikipedia.org/wiki/Incarceration_in_the_United_States#Gender\"&gt;wikipedia&lt;/a&gt; there were &amp;quot;111,300 adult females in state and federal prisons&amp;quot; and &amp;quot;1,463,500 adult males in state and federal prisons&amp;quot;.  That is over 13x as many men in prison as there are women.  That is an &lt;strong&gt;enormous&lt;/strong&gt; difference, much larger even than the gap between black people and white people.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;I believe that the fact that this gap is so enormous, combined with the virual non-existence of accepting that this is a problem implies that this is the single most overlooked social injustince in existence today&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Reasoning&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;When I have heard this topic brought up, it is never brought up with the tone that this is, in fact, a legitimate problem.  By far the most common line of reasoning that I see is this.  &amp;quot;Men commit more crimes than women, so of course there are more men in prison than there are women&amp;quot;.  However, I believe that this does not dismiss the fact that a problem still exists.  It is fairly well known that black people are incarcerated at higher rates than white people.  And part of that is due to the fact that black people do in fact commit more crimes than white people.  However, it is generally thought that this is not &lt;em&gt;because&lt;/em&gt; they are black, but rather due to a number of social and economic pressures that tend to drive black people towards commiting crimes (although it is also partially explained by harsher treatment from the justice system due to racial discrimination).&lt;/p&gt;\n\n&lt;p&gt;It is my firm belief that men are incarcerated at higher rates not due to some violent nature inherent to men, but rather due to a combination of social and economic pressures that drive men towards committing crime.  These social and economic pressures are at the root of the problem, and more work should be done to correct them.  Criminals do not tend to commit crime for no reason whatsoever.  It is far more common that they commit crimes due to being forced into horrible situations through no fault of their own, and they see crime as a way out.  Drug dealing, gang activity, robbery, etc. are all examples of crimes that are typically associated with desparation rather than deep psychological issues.&lt;/p&gt;\n\n&lt;p&gt;I believe that in a society in which men and women are seen as equals and are treated with equality, there would be a much more equal number of male and female inmates.  The fact that the discrepancy is often explained by claiming that men simply have inherent criminal tendencies is evidence that people are willing to overlook social causes when men are the victims.  I therefore believe that the incarceration discrepancy is the single most overlooked injustice in America today, and it absolutely disgusts me that there appear to be no movements aimed at correcting this discrepancy.  I&amp;#39;d like to discuss this, so please CMV!&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;This is a footnote from the CMV moderators. We&amp;#39;d like to remind you of a couple of things. Firstly, please&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules\"&gt;read through our rules&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting\"&gt;downvotes don&amp;#39;t change views&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;! Any questions or concerns? Feel free to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/message/compose?to=/r/changemyview\"&gt;message us&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;Happy CMVing!&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is something that I've been thinking about lately and I'd like to have a discussion on it.  This discussion will obviously bring up some hot-button topics, but I ask that we all stay civil and that we stay on topic.\n\n*Introduction*\n\nMost social injustices in the world today manifest themselves as a discrepancy between two groups when there is no real reason for that discrepancy to exist.  One example is the discrepancy for callbacks on resume submissions with a white sounding name vs. a black sounding name.  Another example is the discrepancy in salaries between men and women (related to the career choices they make).  These two discrepancies are talked about on a widespread basis.  There are other discrepancies such as the differences in child custody battles between men and women.  This is an example of a discrepancy that is often claimed to be \"not talked about\", which I agree with to some extent but still there exist places on Reddit and other sites dedicated to addressing these issues.\n\nHowever, I find it strange that one discrepancy that I have **never** seen a conversation about in the real world or on reddit is the difference in how often men are put in jail as opposed to women.  According to [wikipedia](https://en.wikipedia.org/wiki/Incarceration_in_the_United_States#Gender) there were \"111,300 adult females in state and federal prisons\" and \"1,463,500 adult males in state and federal prisons\".  That is over 13x as many men in prison as there are women.  That is an **enormous** difference, much larger even than the gap between black people and white people.  \n\n**I believe that the fact that this gap is so enormous, combined with the virual non-existence of accepting that this is a problem implies that this is the single most overlooked social injustince in existence today**.\n\n*Reasoning*\n\nWhen I have heard this topic brought up, it is never brought up with the tone that this is, in fact, a legitimate problem.  By far the most common line of reasoning that I see is this.  \"Men commit more crimes than women, so of course there are more men in prison than there are women\".  However, I believe that this does not dismiss the fact that a problem still exists.  It is fairly well known that black people are incarcerated at higher rates than white people.  And part of that is due to the fact that black people do in fact commit more crimes than white people.  However, it is generally thought that this is not *because* they are black, but rather due to a number of social and economic pressures that tend to drive black people towards commiting crimes (although it is also partially explained by harsher treatment from the justice system due to racial discrimination).\n\nIt is my firm belief that men are incarcerated at higher rates not due to some violent nature inherent to men, but rather due to a combination of social and economic pressures that drive men towards committing crime.  These social and economic pressures are at the root of the problem, and more work should be done to correct them.  Criminals do not tend to commit crime for no reason whatsoever.  It is far more common that they commit crimes due to being forced into horrible situations through no fault of their own, and they see crime as a way out.  Drug dealing, gang activity, robbery, etc. are all examples of crimes that are typically associated with desparation rather than deep psychological issues.\n\nI believe that in a society in which men and women are seen as equals and are treated with equality, there would be a much more equal number of male and female inmates.  The fact that the discrepancy is often explained by claiming that men simply have inherent criminal tendencies is evidence that people are willing to overlook social causes when men are the victims.  I therefore believe that the incarceration discrepancy is the single most overlooked injustice in America today, and it absolutely disgusts me that there appear to be no movements aimed at correcting this discrepancy.  I'd like to discuss this, so please CMV!\n\n_____\n\n&gt; *This is a footnote from the CMV moderators. We'd like to remind you of a couple of things. Firstly, please* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "659wew", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 321, "report_reasons": null, "author": "Rockmar1", "saved": false, "mod_reports": [], "name": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/", "num_reports": null, "locked": false, "stickied": false, "created": 1492164269.0, "url": "https://www.reddit.com/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/", "author_flair_text": "8∆", "quarantine": false, "title": "CMV: The disproportionate amount of men who are incarcerated is perhaps the most overlooked social injustice in existence today", "created_utc": 1492135469.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 366, "visited": false, "subreddit_type": "public", "ups": 321}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dgb4waw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "not_homestuck", "parent_id": "t1_dg9zc4o", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Oh, absolutely! Not arguing against it, just making a case for why it probably doesn't get as much mainstream attention", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, absolutely! Not arguing against it, just making a case for why it probably doesn&amp;#39;t get as much mainstream attention&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb4waw", "score_hidden": false, "stickied": false, "created": 1492317204.0, "created_utc": 1492288404.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9zc4o", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg9aytw", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "In my opinion, it is impossible to compare \"who has it worse\" so there's no point in trying.  Is it worse to not be taken seriously in the workplace, or is it worse to lose your kids in a custody battle?  I don't know, it's different for everyone.  So trying to figure out who has it worst is completely unproductive.\n\nWhat we need to do is say that we're going to try and fix all the problems regardless of who \"has it worse\".  There is no reason that we have to focus exclusively on one group.  Additionally, men make up half of society.  That's a lot of people who have to deal with this shit.  To me, that means that it is a problem that is worth trying to solve.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my opinion, it is impossible to compare &amp;quot;who has it worse&amp;quot; so there&amp;#39;s no point in trying.  Is it worse to not be taken seriously in the workplace, or is it worse to lose your kids in a custody battle?  I don&amp;#39;t know, it&amp;#39;s different for everyone.  So trying to figure out who has it worst is completely unproductive.&lt;/p&gt;\n\n&lt;p&gt;What we need to do is say that we&amp;#39;re going to try and fix all the problems regardless of who &amp;quot;has it worse&amp;quot;.  There is no reason that we have to focus exclusively on one group.  Additionally, men make up half of society.  That&amp;#39;s a lot of people who have to deal with this shit.  To me, that means that it is a problem that is worth trying to solve.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9zc4o", "score_hidden": false, "stickied": false, "created": 1492243569.0, "created_utc": 1492214769.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9aytw", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "not_homestuck", "parent_id": "t1_dg8mnp8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "I agree with you there, but I think the problem is less urgent because men *also* hold so many advantages in society as well. It's like saying that politicians hold the highest rates of incarceration for tax fraud, for example. Obviously that's a problem that needs to be addressed, social factors included, but it's not considered a 'minority issue' the way that the wage gap or other things that affect less affluent members of society are.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with you there, but I think the problem is less urgent because men &lt;em&gt;also&lt;/em&gt; hold so many advantages in society as well. It&amp;#39;s like saying that politicians hold the highest rates of incarceration for tax fraud, for example. Obviously that&amp;#39;s a problem that needs to be addressed, social factors included, but it&amp;#39;s not considered a &amp;#39;minority issue&amp;#39; the way that the wage gap or other things that affect less affluent members of society are.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9aytw", "score_hidden": false, "stickied": false, "created": 1492213777.0, "created_utc": 1492184977.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9e4tb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "garnteller", "parent_id": "t1_dg8ybwy", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sorry PsychoPhilosopher, your comment has been removed: \n\n&gt; Comment Rule 5\\. \"No low effort comments. Comments that are only jokes, links, or 'written upvotes', for example. Humor, links, and affirmations of agreement can be contained within more substantial comments.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5)\n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Rule+5+Appeal+PsychoPhilosopher&amp;message=PsychoPhilosopher+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/dg8ybwy/\\))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry PsychoPhilosopher, your comment has been removed: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 5. &amp;quot;No low effort comments. Comments that are only jokes, links, or &amp;#39;written upvotes&amp;#39;, for example. Humor, links, and affirmations of agreement can be contained within more substantial comments.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5\"&gt;See the wiki page for more information.&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Rule+5+Appeal+PsychoPhilosopher&amp;amp;message=PsychoPhilosopher+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/dg8ybwy/)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9e4tb", "score_hidden": false, "stickied": false, "created": 1492217320.0, "created_utc": 1492188520.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ybwy", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg8yaum", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8ybwy", "score_hidden": false, "stickied": false, "created": 1492190235.0, "created_utc": 1492161435.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8yaum", "gilded": 0, "archived": false, "score": -16, "report_reasons": null, "author": "Iswallowedafly", "parent_id": "t1_dg8y5vh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Since you have no evidence to support what you just wrote I'm going to ignore it. \n\nWhen given equal playing fields men and women are just as successful when it comes to being an engineer. \n\nHowever in every single Human culture ever men have committed far more violent crimes then women. \n\nSince you are simply making poor arguments and insulting people I'm going to talk to other people now. \n\nHave a good life. Enjoy. \n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since you have no evidence to support what you just wrote I&amp;#39;m going to ignore it. &lt;/p&gt;\n\n&lt;p&gt;When given equal playing fields men and women are just as successful when it comes to being an engineer. &lt;/p&gt;\n\n&lt;p&gt;However in every single Human culture ever men have committed far more violent crimes then women. &lt;/p&gt;\n\n&lt;p&gt;Since you are simply making poor arguments and insulting people I&amp;#39;m going to talk to other people now. &lt;/p&gt;\n\n&lt;p&gt;Have a good life. Enjoy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8yaum", "score_hidden": false, "stickied": false, "created": 1492190139.0, "created_utc": 1492161339.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": -16}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8y5vh", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "PsychoPhilosopher", "parent_id": "t1_dg8xw89", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "\"Women experience hormonal fluctuations throughout the month that create emotionality and irrationality, making their concentration and ability to reason lower when compared to men of the same age.  \n\nConcentration and ability to reason are important in STEM fields and in leadership positions, which seems to be connected to pay.\"\n\nSee how the same reasoning works to justify a very much less acceptable statement there?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Women experience hormonal fluctuations throughout the month that create emotionality and irrationality, making their concentration and ability to reason lower when compared to men of the same age.  &lt;/p&gt;\n\n&lt;p&gt;Concentration and ability to reason are important in STEM fields and in leadership positions, which seems to be connected to pay.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;See how the same reasoning works to justify a very much less acceptable statement there?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8y5vh", "score_hidden": false, "stickied": false, "created": 1492189683.0, "created_utc": 1492160883.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8xw89", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Iswallowedafly", "parent_id": "t1_dg8x613", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "Men mature slower then women. our brains are less developed when compared to women of the same age. That the area of the brain that develops slower in men also governs impulse control and risk assessment. Which seems to be connected to violent crime. \n\n\nI've never seen more people scared by facts. \n\n", "edited": 1492191225.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Men mature slower then women. our brains are less developed when compared to women of the same age. That the area of the brain that develops slower in men also governs impulse control and risk assessment. Which seems to be connected to violent crime. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never seen more people scared by facts. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8xw89", "score_hidden": false, "stickied": false, "created": 1492188803.0, "created_utc": 1492160003.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8x613", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "PsychoPhilosopher", "parent_id": "t1_dg8uo0h", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "That's the problem with that argument.\n\nIf genders are equal, they're equal *everywhere*.\n\nThis is just pure bias.\n\nIf the number of men in prison can be attributed to the internal traits of males, then it follows that other gender imbalances can be attributed to the internal traits of females.\n\nThere's really no excuses for it.\n\nUsing the argument that men are 'aggressive' because of testosterone leads into the argument that women are more 'emotional/illogical' because of their own hormones.  It's a proven fact! PMS is very real! \n\nBut no one would make the argument that this justifies excluding women from STEM.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the problem with that argument.&lt;/p&gt;\n\n&lt;p&gt;If genders are equal, they&amp;#39;re equal &lt;em&gt;everywhere&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;This is just pure bias.&lt;/p&gt;\n\n&lt;p&gt;If the number of men in prison can be attributed to the internal traits of males, then it follows that other gender imbalances can be attributed to the internal traits of females.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s really no excuses for it.&lt;/p&gt;\n\n&lt;p&gt;Using the argument that men are &amp;#39;aggressive&amp;#39; because of testosterone leads into the argument that women are more &amp;#39;emotional/illogical&amp;#39; because of their own hormones.  It&amp;#39;s a proven fact! PMS is very real! &lt;/p&gt;\n\n&lt;p&gt;But no one would make the argument that this justifies excluding women from STEM.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8x613", "score_hidden": false, "stickied": false, "created": 1492186455.0, "created_utc": 1492157655.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 38}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8uo0h", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "UrbanIsACommunist", "parent_id": "t1_dg8rg1p", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I don't think this is a very good argument at all, because it's also true that across all cultures, men have a virtual monopoly on positions of power (in politics, religion, business, etc.). You could make a strong argument that the tendency for men to be more violent and for men to have a monopoly on positions of power stems from the same thing--higher levels of testosterone, which leads to more aggressiveness, greater physical prowess (and ability to intimidate/coerce other individuals), greater confidence, and a higher likelihood of taking risky actions that offer the possibility of great rewards.\n\nWould you argue it isn't just \"society\" that makes men more likely to hold leadership positions? Because the logical extension of that is that men are just \"inherently\" more prone to hold leadership positions, and gender disparities in leadership positions are not a fundamental injustice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think this is a very good argument at all, because it&amp;#39;s also true that across all cultures, men have a virtual monopoly on positions of power (in politics, religion, business, etc.). You could make a strong argument that the tendency for men to be more violent and for men to have a monopoly on positions of power stems from the same thing--higher levels of testosterone, which leads to more aggressiveness, greater physical prowess (and ability to intimidate/coerce other individuals), greater confidence, and a higher likelihood of taking risky actions that offer the possibility of great rewards.&lt;/p&gt;\n\n&lt;p&gt;Would you argue it isn&amp;#39;t just &amp;quot;society&amp;quot; that makes men more likely to hold leadership positions? Because the logical extension of that is that men are just &amp;quot;inherently&amp;quot; more prone to hold leadership positions, and gender disparities in leadership positions are not a fundamental injustice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8uo0h", "score_hidden": false, "stickied": false, "created": 1492179659.0, "created_utc": 1492150859.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8rg1p", "gilded": 0, "archived": false, "score": 55, "report_reasons": null, "author": "daynightninja", "parent_id": "t1_dg8mnp8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;  I claim that the reason men are more likely to choose to commit these crimes is not because men are inherently more violent. I believe that the reason is society.\n\nBut men *are* inherently more violent, across all cultures. There's a [bunch](https://www.psychologytoday.com/blog/experiments-in-philosophy/201202/why-are-men-so-violent) of [reasons](http://rstb.royalsocietypublishing.org/content/367/1589/670) for why this might be the case. Definitely we need to decrease incarceration, but there's not a whole lot of evidence that \"society\" makes men more violent than women. Otherwise, we'd expect different societies have different differentials, but men are uniformly the violent sex across cultures.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I claim that the reason men are more likely to choose to commit these crimes is not because men are inherently more violent. I believe that the reason is society.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But men &lt;em&gt;are&lt;/em&gt; inherently more violent, across all cultures. There&amp;#39;s a &lt;a href=\"https://www.psychologytoday.com/blog/experiments-in-philosophy/201202/why-are-men-so-violent\"&gt;bunch&lt;/a&gt; of &lt;a href=\"http://rstb.royalsocietypublishing.org/content/367/1589/670\"&gt;reasons&lt;/a&gt; for why this might be the case. Definitely we need to decrease incarceration, but there&amp;#39;s not a whole lot of evidence that &amp;quot;society&amp;quot; makes men more violent than women. Otherwise, we&amp;#39;d expect different societies have different differentials, but men are uniformly the violent sex across cultures.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8rg1p", "score_hidden": false, "stickied": false, "created": 1492173159.0, "created_utc": 1492144359.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 55}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg9hu19", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "HedonisticFrog", "parent_id": "t1_dg8mnp8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Women also don't work on garbage trucks as often either, but there's no push for them to take those jobs. There's certainly no barrier to entry there. Just because women aren't interested in a field of work doesn't mean there aren't equal opportunities for it.\n\nIf a man decides to commit a crime it isn't societies fault, it's that individual's fault for doing it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Women also don&amp;#39;t work on garbage trucks as often either, but there&amp;#39;s no push for them to take those jobs. There&amp;#39;s certainly no barrier to entry there. Just because women aren&amp;#39;t interested in a field of work doesn&amp;#39;t mean there aren&amp;#39;t equal opportunities for it.&lt;/p&gt;\n\n&lt;p&gt;If a man decides to commit a crime it isn&amp;#39;t societies fault, it&amp;#39;s that individual&amp;#39;s fault for doing it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9hu19", "score_hidden": false, "stickied": false, "created": 1492221575.0, "created_utc": 1492192775.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg98cun", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "scottevil110", "parent_id": "t1_dg8mnp8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "Sorry, you've lost me.  This is the same \"logic\" that the feminist camp employs, that any discrepancy in the behavior of men and women is due to some societal influence that happened years or decades ago in their life.  You are an adult.  You are responsible for your decisions and actions.  End of story.  There is no blame to be cast on anyone else.  \n\nIt's flawed when feminists try to use it to explain why there are fewer women in science, and it's flawed when you try to claim that it's society's fault that more men commit violent crimes.  \n\nYou have 100% control over whether or not you choose to hurt another person.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry, you&amp;#39;ve lost me.  This is the same &amp;quot;logic&amp;quot; that the feminist camp employs, that any discrepancy in the behavior of men and women is due to some societal influence that happened years or decades ago in their life.  You are an adult.  You are responsible for your decisions and actions.  End of story.  There is no blame to be cast on anyone else.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s flawed when feminists try to use it to explain why there are fewer women in science, and it&amp;#39;s flawed when you try to claim that it&amp;#39;s society&amp;#39;s fault that more men commit violent crimes.  &lt;/p&gt;\n\n&lt;p&gt;You have 100% control over whether or not you choose to hurt another person.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg98cun", "score_hidden": false, "stickied": false, "created": 1492210650.0, "created_utc": 1492181850.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dgai3ao", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ondrap", "parent_id": "t1_dg8mnp8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm not sure if you are playing devil's advocate here; however have you considered that more men in prison AND more men in STEM fields might in the end not be society's pressure but their decision?\nOk, I'll play the devil's advocate: it _is_ their decision, not society pressure. Show me, why you are right and I am wrong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure if you are playing devil&amp;#39;s advocate here; however have you considered that more men in prison AND more men in STEM fields might in the end not be society&amp;#39;s pressure but their decision?\nOk, I&amp;#39;ll play the devil&amp;#39;s advocate: it &lt;em&gt;is&lt;/em&gt; their decision, not society pressure. Show me, why you are right and I am wrong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgai3ao", "score_hidden": false, "stickied": false, "created": 1492278820.0, "created_utc": 1492250020.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mnp8", "gilded": 0, "archived": false, "score": 70, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg8mbr1", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; If seems that based on your idea if I, a man, take a gun and shoot someone tomorrow I'm the victim. Is this really your take.\n\nTo some extent, yes.  Let me provide an analogy that I think will make this clearer.\n\nThere is a discrepancy in the number of men and women entering STEM fields.  This is important because STEM fields pay better than other fields in general, and as a result women tend to make less than men, leading to a lower quality of life.\n\nSo we have a situation where women are making decisions for themselves, and yet we still understand that it is a problem because society pushes women towards making those particular decisions.\n\nSimilarly, men are more likely to choose to commit a violent crime.  This leads to a lower quality of life for those men because many of them are caught and then put into prison.  I claim that the reason men are more likely to choose to commit these crimes is **not** because men are inherently more violent.  I believe that the reason is society.  Similar to how society pushes women away from STEM fields, society also pushes men towards committing crime.  And I see both as real problems.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If seems that based on your idea if I, a man, take a gun and shoot someone tomorrow I&amp;#39;m the victim. Is this really your take.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To some extent, yes.  Let me provide an analogy that I think will make this clearer.&lt;/p&gt;\n\n&lt;p&gt;There is a discrepancy in the number of men and women entering STEM fields.  This is important because STEM fields pay better than other fields in general, and as a result women tend to make less than men, leading to a lower quality of life.&lt;/p&gt;\n\n&lt;p&gt;So we have a situation where women are making decisions for themselves, and yet we still understand that it is a problem because society pushes women towards making those particular decisions.&lt;/p&gt;\n\n&lt;p&gt;Similarly, men are more likely to choose to commit a violent crime.  This leads to a lower quality of life for those men because many of them are caught and then put into prison.  I claim that the reason men are more likely to choose to commit these crimes is &lt;strong&gt;not&lt;/strong&gt; because men are inherently more violent.  I believe that the reason is society.  Similar to how society pushes women away from STEM fields, society also pushes men towards committing crime.  And I see both as real problems.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8mnp8", "score_hidden": false, "stickied": false, "created": 1492165695.0, "created_utc": 1492136895.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 70}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9vb22", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Grunt08", "parent_id": "t1_dg9r00a", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "AmoebaMan, your comment has been removed: \n\n&gt; Comment Rule 2\\. \"Don't be rude or hostile to other users. Your comment will be removed even if most of it is solid, another user was rude to you first, or you feel your remark was justified. Report other violations; do not retaliate.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2)\n\n**Please be aware that we take hostility extremely seriously. Repeated violations will result in a ban.**\n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Rule+2+Appeal+AmoebaMan&amp;message=AmoebaMan+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/dg9r00a/\\))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;AmoebaMan, your comment has been removed: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 2. &amp;quot;Don&amp;#39;t be rude or hostile to other users. Your comment will be removed even if most of it is solid, another user was rude to you first, or you feel your remark was justified. Report other violations; do not retaliate.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2\"&gt;See the wiki page for more information.&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;Please be aware that we take hostility extremely seriously. Repeated violations will result in a ban.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Rule+2+Appeal+AmoebaMan&amp;amp;message=AmoebaMan+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/dg9r00a/)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9vb22", "score_hidden": false, "stickied": false, "created": 1492238198.0, "created_utc": 1492209398.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9r00a", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg9ndiz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9r00a", "score_hidden": false, "stickied": false, "created": 1492232609.0, "created_utc": 1492203809.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ndiz", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ICE_Agent_4135", "parent_id": "t1_dg9fpqi", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; This is NOT the case for blacks vs. whites.\n\nFor Reddit gold, if there is no genetic or physiological difference between black people and white people, how do you know if you've ever seen a black person?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;This is NOT the case for blacks vs. whites.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;For Reddit gold, if there is no genetic or physiological difference between black people and white people, how do you know if you&amp;#39;ve ever seen a black person?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9ndiz", "score_hidden": false, "stickied": false, "created": 1492228226.0, "created_utc": 1492199426.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg9fpqi", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "AmoebaMan", "parent_id": "t1_dg9er0j", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Are you calling me bigoted because I'm acknowledging a scientific fact?\n\nIt is a scientific fact that genetic and physiological differences exist between men and women.\n\nThis is NOT the case for blacks vs. whites.\n\ne: To clarify, there are no differences in the way that racists will claim there are (intelligence, etc.)", "edited": 1492203847.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you calling me bigoted because I&amp;#39;m acknowledging a scientific fact?&lt;/p&gt;\n\n&lt;p&gt;It is a scientific fact that genetic and physiological differences exist between men and women.&lt;/p&gt;\n\n&lt;p&gt;This is NOT the case for blacks vs. whites.&lt;/p&gt;\n\n&lt;p&gt;e: To clarify, there are no differences in the way that racists will claim there are (intelligence, etc.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9fpqi", "score_hidden": false, "stickied": false, "created": 1492219117.0, "created_utc": 1492190317.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9er0j", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "ImNotContrarian", "parent_id": "t1_dg9cfmr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Men vs. women absolutely DO.\n\nA lot of race-bigoted people would argue the same gender-bigoted point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Men vs. women absolutely DO.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A lot of race-bigoted people would argue the same gender-bigoted point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9er0j", "score_hidden": false, "stickied": false, "created": 1492218011.0, "created_utc": 1492189211.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg9cfmr", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "AmoebaMan", "parent_id": "t1_dg8nsiv", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Not really, because the two aren't comparable.\n\nBlack men vs. white men don't demonstrate significant genetic or cognitive differences when controlled for environment. Men vs. women absolutely DO.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not really, because the two aren&amp;#39;t comparable.&lt;/p&gt;\n\n&lt;p&gt;Black men vs. white men don&amp;#39;t demonstrate significant genetic or cognitive differences when controlled for environment. Men vs. women absolutely DO.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9cfmr", "score_hidden": false, "stickied": false, "created": 1492215418.0, "created_utc": 1492186618.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8nsiv", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "ImNotContrarian", "parent_id": "t1_dg8mbr1", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Okay now take that whole comment, change \"men\" to \"black men\" and defend that comment.\n\n&gt; Let's take violent crime.\n\n&gt; **black** Men ~~commit 80 percent of those~~ **are 6% of Americans and commit** [**a monumentally disproportionate amount of all crime.**](http://imgur.com/gOxBIQp). That's a fact.\n\n&gt; As **a black** male, I do have a greater risk of being a victim of crime, but odds are that the person assaulting or killing me will be another **black** male.\n\n&gt; And **black** men are the actors in these crimes. They are choosing to commit these crimes and even if there is help or assistance available **black** men have made it a thing to see asking for help as a sign of weakness.\n\n&gt; If seems that based on your idea if I, a **black** man, take a gun and shoot someone tomorrow I'm the victim. Is this really your take.\n\nDoes this help you empathize?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay now take that whole comment, change &amp;quot;men&amp;quot; to &amp;quot;black men&amp;quot; and defend that comment.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Let&amp;#39;s take violent crime.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;black&lt;/strong&gt; Men &lt;del&gt;commit 80 percent of those&lt;/del&gt; &lt;strong&gt;are 6% of Americans and commit&lt;/strong&gt; &lt;a href=\"http://imgur.com/gOxBIQp\"&gt;&lt;strong&gt;a monumentally disproportionate amount of all crime.&lt;/strong&gt;&lt;/a&gt;. That&amp;#39;s a fact.&lt;/p&gt;\n\n&lt;p&gt;As &lt;strong&gt;a black&lt;/strong&gt; male, I do have a greater risk of being a victim of crime, but odds are that the person assaulting or killing me will be another &lt;strong&gt;black&lt;/strong&gt; male.&lt;/p&gt;\n\n&lt;p&gt;And &lt;strong&gt;black&lt;/strong&gt; men are the actors in these crimes. They are choosing to commit these crimes and even if there is help or assistance available &lt;strong&gt;black&lt;/strong&gt; men have made it a thing to see asking for help as a sign of weakness.&lt;/p&gt;\n\n&lt;p&gt;If seems that based on your idea if I, a &lt;strong&gt;black&lt;/strong&gt; man, take a gun and shoot someone tomorrow I&amp;#39;m the victim. Is this really your take.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Does this help you empathize?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8nsiv", "score_hidden": false, "stickied": false, "created": 1492167347.0, "created_utc": 1492138547.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9gctm", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Grunt08", "parent_id": "t1_dg97fbw", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Ryangyear, your comment has been removed: \n\n&gt; Comment Rule 2\\. \"Don't be rude or hostile to other users. Your comment will be removed even if most of it is solid, another user was rude to you first, or you feel your remark was justified. Report other violations; do not retaliate.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2)\n\n**Please be aware that we take hostility extremely seriously. Repeated violations will result in a ban.**\n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Rule+2+Appeal+Ryangyear&amp;message=Ryangyear+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/dg97fbw/\\))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ryangyear, your comment has been removed: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 2. &amp;quot;Don&amp;#39;t be rude or hostile to other users. Your comment will be removed even if most of it is solid, another user was rude to you first, or you feel your remark was justified. Report other violations; do not retaliate.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2\"&gt;See the wiki page for more information.&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;Please be aware that we take hostility extremely seriously. Repeated violations will result in a ban.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Rule+2+Appeal+Ryangyear&amp;amp;message=Ryangyear+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/dg97fbw/)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9gctm", "score_hidden": false, "stickied": false, "created": 1492219860.0, "created_utc": 1492191060.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97fbw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg8mbr1", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg97fbw", "score_hidden": false, "stickied": false, "created": 1492209459.0, "created_utc": 1492180659.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg935z2", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "garnteller", "parent_id": "t1_dg8mmwi", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sorry Sadsharks, your comment has been removed: \n\n&gt; Comment Rule 5\\. \"No low effort comments. Comments that are only jokes, links, or 'written upvotes', for example. Humor, links, and affirmations of agreement can be contained within more substantial comments.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5)\n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Rule+5+Appeal+Sadsharks&amp;message=Sadsharks+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/dg8mmwi/\\))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry Sadsharks, your comment has been removed: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 5. &amp;quot;No low effort comments. Comments that are only jokes, links, or &amp;#39;written upvotes&amp;#39;, for example. Humor, links, and affirmations of agreement can be contained within more substantial comments.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5\"&gt;See the wiki page for more information.&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Rule+5+Appeal+Sadsharks&amp;amp;message=Sadsharks+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/dg8mmwi/)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg935z2", "score_hidden": false, "stickied": false, "created": 1492203068.0, "created_utc": 1492174268.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mmwi", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg8mbr1", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8mmwi", "score_hidden": false, "stickied": false, "created": 1492165664.0, "created_utc": 1492136864.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mbr1", "gilded": 0, "archived": false, "score": 76, "report_reasons": null, "author": "Iswallowedafly", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Let's  take violent crime. \n\nMen commit 80 percent of those. That's a fact. \n\nAs male, I do have a greater risk of being a victim of crime, but odds are that the person assaulting or killing me will be another male. \n\nAnd men are the actors in these crimes. They are choosing to commit these crimes and even if there is help or assistance available men have made it a thing to see asking for help as a sign of weakness. \n\nIf seems that based on your idea if I, a man, take a gun and shoot someone tomorrow I'm the victim. Is this really your take. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Let&amp;#39;s  take violent crime. &lt;/p&gt;\n\n&lt;p&gt;Men commit 80 percent of those. That&amp;#39;s a fact. &lt;/p&gt;\n\n&lt;p&gt;As male, I do have a greater risk of being a victim of crime, but odds are that the person assaulting or killing me will be another male. &lt;/p&gt;\n\n&lt;p&gt;And men are the actors in these crimes. They are choosing to commit these crimes and even if there is help or assistance available men have made it a thing to see asking for help as a sign of weakness. &lt;/p&gt;\n\n&lt;p&gt;If seems that based on your idea if I, a man, take a gun and shoot someone tomorrow I&amp;#39;m the victim. Is this really your take. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8mbr1", "score_hidden": false, "stickied": false, "created": 1492165216.0, "created_utc": 1492136416.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 76}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg8q646", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dg8oczi", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It provides the feminist structure for analyzing any crime, but particularly violent ones. \n\nhttp://www.nordicwelfare.org/PageFiles/4207/Schnitzman.pdf\n\nThis paper shows drug users responses to asked questions about gendered drug taking. Here is a quote from the conclusion:\n\n&gt;Focusing on this cultural system, this\nstudy shows how gender constitutes a\nmoralising and normative system that sets\nthe criteria for what is seen as acceptable\nbehaviour in terms of drug taking. By following\na gendered norm system, the informants\nin this study hold others and\nthemselves accountable for drug-related\nbehaviour in ways that are appropriate\nfor their gender. This study makes evident\nthat gendered ideals, which promote\nmale strength and fearlessness and female\nweakness and obedience, encourage men\nand women to see the world in a different\nmanner. \n\nOne can see how a fearless attitude towards drug taking can quickly lead to more arrests. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It provides the feminist structure for analyzing any crime, but particularly violent ones. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.nordicwelfare.org/PageFiles/4207/Schnitzman.pdf\"&gt;http://www.nordicwelfare.org/PageFiles/4207/Schnitzman.pdf&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This paper shows drug users responses to asked questions about gendered drug taking. Here is a quote from the conclusion:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Focusing on this cultural system, this\nstudy shows how gender constitutes a\nmoralising and normative system that sets\nthe criteria for what is seen as acceptable\nbehaviour in terms of drug taking. By following\na gendered norm system, the informants\nin this study hold others and\nthemselves accountable for drug-related\nbehaviour in ways that are appropriate\nfor their gender. This study makes evident\nthat gendered ideals, which promote\nmale strength and fearlessness and female\nweakness and obedience, encourage men\nand women to see the world in a different\nmanner. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;One can see how a fearless attitude towards drug taking can quickly lead to more arrests. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8q646", "score_hidden": false, "stickied": false, "created": 1492171048.0, "created_utc": 1492142248.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg94to6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Satafly", "parent_id": "t1_dg8oczi", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; men aren't the nasty violent brutes that society tends to portray them as.\n\nWhat society has told you this, if I may ask?\n\nI'm not from America, and I've been told that some areas of America have taken a warped view of gender politics. But I've not really felt this since I first became aware of feminism and inevitably found my way to the most toxic parts of it.\n\nMost aspects of society haven't given me the impression that the reason for all men's crimes is because they're just violent.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;men aren&amp;#39;t the nasty violent brutes that society tends to portray them as.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What society has told you this, if I may ask?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not from America, and I&amp;#39;ve been told that some areas of America have taken a warped view of gender politics. But I&amp;#39;ve not really felt this since I first became aware of feminism and inevitably found my way to the most toxic parts of it.&lt;/p&gt;\n\n&lt;p&gt;Most aspects of society haven&amp;#39;t given me the impression that the reason for all men&amp;#39;s crimes is because they&amp;#39;re just violent.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg94to6", "score_hidden": false, "stickied": false, "created": 1492205830.0, "created_utc": 1492177030.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8oczi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg8ntwq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "This is a good source!  It gives me hope to see that some people recognize that society is driving men to commit crimes, and that men aren't the nasty violent brutes that society tends to portray them as.  As far as raising awareness goes, I am happy to see that at least some discussion is being had.\n\nHowever, the problem that I have with this particular source is that it is highly centered around the role of domestic violence.  I have no doubt that violent behavior that men commit against their female partners is an easy stepping stone to more violent behavior in general.  That being said, the discussion seems to focus around ending domestic violence to end violent criminal behavior.  I think that this is likely to help, but violent crime is not the only kind of crime where men are disproportionately incarcerated.  Other crimes such as drug dealing are, in my opinion, unlikely to result from domestic violence.  Is there any feminist discussion regarding these?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a good source!  It gives me hope to see that some people recognize that society is driving men to commit crimes, and that men aren&amp;#39;t the nasty violent brutes that society tends to portray them as.  As far as raising awareness goes, I am happy to see that at least some discussion is being had.&lt;/p&gt;\n\n&lt;p&gt;However, the problem that I have with this particular source is that it is highly centered around the role of domestic violence.  I have no doubt that violent behavior that men commit against their female partners is an easy stepping stone to more violent behavior in general.  That being said, the discussion seems to focus around ending domestic violence to end violent criminal behavior.  I think that this is likely to help, but violent crime is not the only kind of crime where men are disproportionately incarcerated.  Other crimes such as drug dealing are, in my opinion, unlikely to result from domestic violence.  Is there any feminist discussion regarding these?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8oczi", "score_hidden": false, "stickied": false, "created": 1492168202.0, "created_utc": 1492139402.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ntwq", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dg8nc80", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It all comes down to the feminist discussion of the root of sexism, which is the enforcement of gender roles and the punishment for breaking from those roles. The feminist solution would be to challenge the gender roles placed on men to be aggressive, to be active, to provide, and to be individualistic.\n\nhttps://thinkprogress.org/the-role-of-toxic-masculinity-in-mass-shootings-dd3edeab42cc\n\nHere's a relevant quote:\n\n&gt;Employing harassment, violence, and coercion against women has long been considered a normal way for men to behave in romantic relationships, as deeply ingrained gender norms teach men that they’re entitled to women’s bodies. This toxic approach to masculinity has been directly linked to the sense of entitlement that drives many mass shooters to commit their crimes.\n\nI.E., Men are poorly equipped by society via their gender role to be humbled, to fit in, and to abstain from aggressive behaviour.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It all comes down to the feminist discussion of the root of sexism, which is the enforcement of gender roles and the punishment for breaking from those roles. The feminist solution would be to challenge the gender roles placed on men to be aggressive, to be active, to provide, and to be individualistic.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://thinkprogress.org/the-role-of-toxic-masculinity-in-mass-shootings-dd3edeab42cc\"&gt;https://thinkprogress.org/the-role-of-toxic-masculinity-in-mass-shootings-dd3edeab42cc&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s a relevant quote:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Employing harassment, violence, and coercion against women has long been considered a normal way for men to behave in romantic relationships, as deeply ingrained gender norms teach men that they’re entitled to women’s bodies. This toxic approach to masculinity has been directly linked to the sense of entitlement that drives many mass shooters to commit their crimes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I.E., Men are poorly equipped by society via their gender role to be humbled, to fit in, and to abstain from aggressive behaviour.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8ntwq", "score_hidden": false, "stickied": false, "created": 1492167406.0, "created_utc": 1492138606.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9dsnc", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Galentines_day", "parent_id": "t1_dg8nc80", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Surely you've heard of the idea of \"toxic masculinity\" if you follow feminist ideology, right? That's what this is. \"Toxic masculinity\" is a form of the gender roles that negatively affect men and lead to men taking bigger risks, engaging in more violence, and suppressing all their emotions besides the anger emotion, leading to things like the current incarceration rates. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Surely you&amp;#39;ve heard of the idea of &amp;quot;toxic masculinity&amp;quot; if you follow feminist ideology, right? That&amp;#39;s what this is. &amp;quot;Toxic masculinity&amp;quot; is a form of the gender roles that negatively affect men and lead to men taking bigger risks, engaging in more violence, and suppressing all their emotions besides the anger emotion, leading to things like the current incarceration rates. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9dsnc", "score_hidden": false, "stickied": false, "created": 1492216939.0, "created_utc": 1492188139.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg8w3vw", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Istie", "parent_id": "t1_dg8nc80", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Where do you go to stay up to date on social justice and feminist ideology? What do you read?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where do you go to stay up to date on social justice and feminist ideology? What do you read?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8w3vw", "score_hidden": false, "stickied": false, "created": 1492183354.0, "created_utc": 1492154554.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9b1zv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "raltodd", "parent_id": "t1_dg8nc80", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; I have never seen a feminist discussion on this\n\nNeither had I, but I feel like this is what this thread is doing! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have never seen a feminist discussion on this&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Neither had I, but I feel like this is what this thread is doing! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9b1zv", "score_hidden": false, "stickied": false, "created": 1492213881.0, "created_utc": 1492185081.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8nc80", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg8n3rx", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; You'll find that the idea that men commit disproportionate amount of crimes because of their enforced gender role is in line with feminist discussion.\n\nThis is interesting because I try very hard to stay up to date on social justice and feminist ideology, and I have never seen a feminist discussion on this.  Do you have any examples of feminists discussing the gap in crime, and possible solutions to the gap?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You&amp;#39;ll find that the idea that men commit disproportionate amount of crimes because of their enforced gender role is in line with feminist discussion.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is interesting because I try very hard to stay up to date on social justice and feminist ideology, and I have never seen a feminist discussion on this.  Do you have any examples of feminists discussing the gap in crime, and possible solutions to the gap?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8nc80", "score_hidden": false, "stickied": false, "created": 1492166685.0, "created_utc": 1492137885.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8n3rx", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dg8mvvh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I assumed you were talking about the gap in sentencing because you were using incarceration to make your case, and your benchmark for an equal society was equal numbers of male and female inmates.\n\nYou'll find that the idea that men commit disproportionate amount of crimes because of their enforced gender role is in line with feminist discussion. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I assumed you were talking about the gap in sentencing because you were using incarceration to make your case, and your benchmark for an equal society was equal numbers of male and female inmates.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll find that the idea that men commit disproportionate amount of crimes because of their enforced gender role is in line with feminist discussion. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8n3rx", "score_hidden": false, "stickied": false, "created": 1492166349.0, "created_utc": 1492137549.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dgaccdd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "trashmid", "parent_id": "t1_dg8mvvh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "As another item of support, I would point out that men are typically expected to be caregivers/providers - and shamed should they be unable to do so in an above average manner - this could lead to men dealing drugs/stealing/whatnot at a higher rate than women. No proof to support this, just an idea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As another item of support, I would point out that men are typically expected to be caregivers/providers - and shamed should they be unable to do so in an above average manner - this could lead to men dealing drugs/stealing/whatnot at a higher rate than women. No proof to support this, just an idea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaccdd", "score_hidden": false, "stickied": false, "created": 1492263389.0, "created_utc": 1492234589.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dga5p22", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MMountain_", "parent_id": "t1_dg8mvvh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I disagree with both of those positions.  \n\nWomen don't pick STEM because they are naturally disinclined.  If you look at med students and law students you'll see pretty close to a 50/50 split.  So why is society pushing them only out of STEM?  The answer: its not.\n\nSimilarly, men are more inclined towards violence as a result of testosterone.  To be sure, women can commit violence they just are not as aggressive or violent as men due to hormonal differences.\n\n  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I disagree with both of those positions.  &lt;/p&gt;\n\n&lt;p&gt;Women don&amp;#39;t pick STEM because they are naturally disinclined.  If you look at med students and law students you&amp;#39;ll see pretty close to a 50/50 split.  So why is society pushing them only out of STEM?  The answer: its not.&lt;/p&gt;\n\n&lt;p&gt;Similarly, men are more inclined towards violence as a result of testosterone.  To be sure, women can commit violence they just are not as aggressive or violent as men due to hormonal differences.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dga5p22", "score_hidden": false, "stickied": false, "created": 1492252329.0, "created_utc": 1492223529.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mvvh", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg8mgpc", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Yes, the sentencing gap is quite real and is definitely a problem.  This is related, but I'm not talking about the sentencing gap.  The sentencing gap refers to the fact that men who commit a crime are more likely to be sentenced harshly compared to women who commit the same crime.\n\nI am talking about the act of committing the crime in the first place.  Men *do* commit crimes more than women do.  But I don't think this is because men are inherently more likely to be criminals.  I think it is due to the fact that society puts pressures on men that can lead to them committing crimes.  I've replied to someone else with this example, but it's like the STEM gap.\n\nOnly an idiot would claim that women don't choose to go into fields other that STEM.  But the issue here is *why* do they choose to go into other fields?  That is likely due to sexism.  Similarly, only an idiot would claim that men don't choose to commit crimes.  But the issue here is *why* do they choose to commit crimes?  I believe that is also likely due to sexism (against men).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, the sentencing gap is quite real and is definitely a problem.  This is related, but I&amp;#39;m not talking about the sentencing gap.  The sentencing gap refers to the fact that men who commit a crime are more likely to be sentenced harshly compared to women who commit the same crime.&lt;/p&gt;\n\n&lt;p&gt;I am talking about the act of committing the crime in the first place.  Men &lt;em&gt;do&lt;/em&gt; commit crimes more than women do.  But I don&amp;#39;t think this is because men are inherently more likely to be criminals.  I think it is due to the fact that society puts pressures on men that can lead to them committing crimes.  I&amp;#39;ve replied to someone else with this example, but it&amp;#39;s like the STEM gap.&lt;/p&gt;\n\n&lt;p&gt;Only an idiot would claim that women don&amp;#39;t choose to go into fields other that STEM.  But the issue here is &lt;em&gt;why&lt;/em&gt; do they choose to go into other fields?  That is likely due to sexism.  Similarly, only an idiot would claim that men don&amp;#39;t choose to commit crimes.  But the issue here is &lt;em&gt;why&lt;/em&gt; do they choose to commit crimes?  I believe that is also likely due to sexism (against men).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8mvvh", "score_hidden": false, "stickied": false, "created": 1492166030.0, "created_utc": 1492137230.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mgpc", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "Mitoza", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Men's Rights Activists actually bring up the \"sentencing gap\" quite often. \n\nEdit: Not to mention activists trying to dismantle the school to prison pipeline affecting primarily men of color.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Men&amp;#39;s Rights Activists actually bring up the &amp;quot;sentencing gap&amp;quot; quite often. &lt;/p&gt;\n\n&lt;p&gt;Edit: Not to mention activists trying to dismantle the school to prison pipeline affecting primarily men of color.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8mgpc", "score_hidden": false, "stickied": false, "created": 1492165414.0, "created_utc": 1492136614.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8uqsr", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "princessbynature", "parent_id": "t1_dg8owm3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[The following paragraph](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3693622/) is from a study on testosterone and behavior:\n\nTestosterone plays a significant role in the arousal of these behavioral manifestations in the brain centers involved in aggression and on the development of the muscular system that enables their realization. There is evidence that testosterone levels are higher in individuals with aggressive behavior, such as prisoners who have committed violent crimes. Several field studies have also shown that testosterone levels increase during the aggressive phases of sports games. In more sensitive laboratory paradigms, it has been observed that participant’s testosterone rises in the winners of; competitions, dominance trials or in confrontations with factitious opponents. Aggressive behavior arises in the brain through interplay between subcortical structures in the amygdala and the hypothalamus in which emotions are born and the prefrontal cognitive centers where emotions are perceived and controlled.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3693622/\"&gt;The following paragraph&lt;/a&gt; is from a study on testosterone and behavior:&lt;/p&gt;\n\n&lt;p&gt;Testosterone plays a significant role in the arousal of these behavioral manifestations in the brain centers involved in aggression and on the development of the muscular system that enables their realization. There is evidence that testosterone levels are higher in individuals with aggressive behavior, such as prisoners who have committed violent crimes. Several field studies have also shown that testosterone levels increase during the aggressive phases of sports games. In more sensitive laboratory paradigms, it has been observed that participant’s testosterone rises in the winners of; competitions, dominance trials or in confrontations with factitious opponents. Aggressive behavior arises in the brain through interplay between subcortical structures in the amygdala and the hypothalamus in which emotions are born and the prefrontal cognitive centers where emotions are perceived and controlled.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8uqsr", "score_hidden": false, "stickied": false, "created": 1492179842.0, "created_utc": 1492151042.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8paha", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Iswallowedafly", "parent_id": "t1_dg8owm3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Medical science seems to strongly disagree with you. It has been studying the effects of testosterone on the brain for a long time. \n\nhttps://www.elsevier.com/about/press-releases/research-and-journals/testosterone-in-healthy-men-increases-their-brains-response-to-threat\n\nWhat you are saying does confuse me, but not because I'm not open to the idea. It confuses me because it seems to not be supported by medical evidence. \n\nHave you done your own research here? I did a three second Google search and I found multiple studies refuting your claims. \n\nAnd you can stop repeating your claim. I know your claim. I understand your claim. But just saying it over and over again doesn't make it true. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Medical science seems to strongly disagree with you. It has been studying the effects of testosterone on the brain for a long time. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.elsevier.com/about/press-releases/research-and-journals/testosterone-in-healthy-men-increases-their-brains-response-to-threat\"&gt;https://www.elsevier.com/about/press-releases/research-and-journals/testosterone-in-healthy-men-increases-their-brains-response-to-threat&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;What you are saying does confuse me, but not because I&amp;#39;m not open to the idea. It confuses me because it seems to not be supported by medical evidence. &lt;/p&gt;\n\n&lt;p&gt;Have you done your own research here? I did a three second Google search and I found multiple studies refuting your claims. &lt;/p&gt;\n\n&lt;p&gt;And you can stop repeating your claim. I know your claim. I understand your claim. But just saying it over and over again doesn&amp;#39;t make it true. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8paha", "score_hidden": false, "stickied": false, "created": 1492169635.0, "created_utc": 1492140835.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9fstv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "raltodd", "parent_id": "t1_dg8owm3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Thank you for making this thread. I agree that this is a topic that tends to be overlooked and I personally had never thought about it before.\n\nIt would seem very logical to me that a big part of the differences we see between men and women might be due to societal pressures and the way men and women are brought up. I can also understand your frustration at people refusing to look farther than hormones before declaring the matter closed. We are complicated beings and if one simple substance could account for our actions, we would live in a very different world ('Guilty! I sentence you to 4 licorice tablets a day!')\n\nHowever, your claim that testosterone has nothing to do with how violent a person is, goes too far. \n\nLook at some old studies by professor James Dabbs, one of the pioneers of the effects of testosterone on behaviour, demonstrating correlations between testosterone with dominance and antisocial behaviour:\n\nDabbs, Frady, Carr &amp; Besch (1987) Saliva testosterone and criminal violence in young adult prison inmates:\n&gt; Free testosterone was measured in the saliva of 89 male prison inmates. Inmates with higher testosterone concentrations had more often been convicted of violent crimes [...] 9 out of 11 inmates with the lowest testosterone concentrations had committed nonviolent crimes, and 10 out of 11 inmates with the highest testosterone concentrations had committed violent crimes.\n\nand Dabbs &amp; Morris, 1990: Testosterone, Social Class, and Antisocial Behavior in a Sample of 4,462 Men\n&gt; Analysis of archival data from 4,462 U.S. military veterans [...] Testosterone was correlated with a variety of antisocial behaviors among all individuals. However, socioeconomic status (SES) proved to be a moderating variable, with weaker testosterone-behavior relationships among high SES subjects.\n\nThese are just correlations, but there is some causal evidence from animal literature (where we can completely control for environmental factors): castrating mice after birth reduces adult agressive behaviour (Heino, Edwards &amp; Roffi, 1993: Intermale aggression in mice: does hour of castration after birth influence adult behavior)\n\nMore recently, the body of work of professor Jack van Honk addresses the direct (short-term) effects of administrating testosterone in people, showing that it increases risky behaviour (http://doi.org/10.1016/j.psyneuen.2003.08.007), reduces unconscious fear responses (http://doi.org/10.1016/j.biopsych.2005.04.003) and empathy (http://doi: 10.1073/pnas.1011891108).\n\n\nThis is not to say that men are, because of testosterone, destined to be these dominant reckless creatures incapable of empathy - far from it. The effects are small and I think the gender roles imposed on men might have a larger role for the prison gap you're talking about. But to claim that testosterone plays no role at all is to disregard a lot of research.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for making this thread. I agree that this is a topic that tends to be overlooked and I personally had never thought about it before.&lt;/p&gt;\n\n&lt;p&gt;It would seem very logical to me that a big part of the differences we see between men and women might be due to societal pressures and the way men and women are brought up. I can also understand your frustration at people refusing to look farther than hormones before declaring the matter closed. We are complicated beings and if one simple substance could account for our actions, we would live in a very different world (&amp;#39;Guilty! I sentence you to 4 licorice tablets a day!&amp;#39;)&lt;/p&gt;\n\n&lt;p&gt;However, your claim that testosterone has nothing to do with how violent a person is, goes too far. &lt;/p&gt;\n\n&lt;p&gt;Look at some old studies by professor James Dabbs, one of the pioneers of the effects of testosterone on behaviour, demonstrating correlations between testosterone with dominance and antisocial behaviour:&lt;/p&gt;\n\n&lt;p&gt;Dabbs, Frady, Carr &amp;amp; Besch (1987) Saliva testosterone and criminal violence in young adult prison inmates:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Free testosterone was measured in the saliva of 89 male prison inmates. Inmates with higher testosterone concentrations had more often been convicted of violent crimes [...] 9 out of 11 inmates with the lowest testosterone concentrations had committed nonviolent crimes, and 10 out of 11 inmates with the highest testosterone concentrations had committed violent crimes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;and Dabbs &amp;amp; Morris, 1990: Testosterone, Social Class, and Antisocial Behavior in a Sample of 4,462 Men&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Analysis of archival data from 4,462 U.S. military veterans [...] Testosterone was correlated with a variety of antisocial behaviors among all individuals. However, socioeconomic status (SES) proved to be a moderating variable, with weaker testosterone-behavior relationships among high SES subjects.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;These are just correlations, but there is some causal evidence from animal literature (where we can completely control for environmental factors): castrating mice after birth reduces adult agressive behaviour (Heino, Edwards &amp;amp; Roffi, 1993: Intermale aggression in mice: does hour of castration after birth influence adult behavior)&lt;/p&gt;\n\n&lt;p&gt;More recently, the body of work of professor Jack van Honk addresses the direct (short-term) effects of administrating testosterone in people, showing that it increases risky behaviour (&lt;a href=\"http://doi.org/10.1016/j.psyneuen.2003.08.007\"&gt;http://doi.org/10.1016/j.psyneuen.2003.08.007&lt;/a&gt;), reduces unconscious fear responses (&lt;a href=\"http://doi.org/10.1016/j.biopsych.2005.04.003\"&gt;http://doi.org/10.1016/j.biopsych.2005.04.003&lt;/a&gt;) and empathy (http://doi: 10.1073/pnas.1011891108).&lt;/p&gt;\n\n&lt;p&gt;This is not to say that men are, because of testosterone, destined to be these dominant reckless creatures incapable of empathy - far from it. The effects are small and I think the gender roles imposed on men might have a larger role for the prison gap you&amp;#39;re talking about. But to claim that testosterone plays no role at all is to disregard a lot of research.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9fstv", "score_hidden": false, "stickied": false, "created": 1492219215.0, "created_utc": 1492190415.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8owm3", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg8oq0n", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; More testosterone means that we tend to be more prone to violence, aggression and impulsive and risky activities.\n\nAnd again, I ask that you provide a source on this.  Because I disagree.  I feel like you're assuming that I just accept that testosterone makes people more violent.  I do not accept that, and in fact your assumption that I do just goes to show even more how much this is overlooked.  I said it before and I'll say it again, I don't think that testosterone has **anything** to do with how violent a person is.  But society tends to just accept that it is true so much that the fact that I am rejecting this confuses you.  So if you have a study that shows that testosterone leads to more violence, then please provide it.  And if not, then please stop assuming that I will agree with that claim.\n\n&gt; And yes, societal pressure like men thinking that they have to be tough like men and can't show weakness are killing us, but our brains are affecting us as well.\n\nThis is more in line with my claim because it acknowledges that men are driven to crime by society.  However, my claim is that our brains (in the way you meant it - i.e. brain chemistry) are **not** disproportionately driving men to crime.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;More testosterone means that we tend to be more prone to violence, aggression and impulsive and risky activities.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And again, I ask that you provide a source on this.  Because I disagree.  I feel like you&amp;#39;re assuming that I just accept that testosterone makes people more violent.  I do not accept that, and in fact your assumption that I do just goes to show even more how much this is overlooked.  I said it before and I&amp;#39;ll say it again, I don&amp;#39;t think that testosterone has &lt;strong&gt;anything&lt;/strong&gt; to do with how violent a person is.  But society tends to just accept that it is true so much that the fact that I am rejecting this confuses you.  So if you have a study that shows that testosterone leads to more violence, then please provide it.  And if not, then please stop assuming that I will agree with that claim.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And yes, societal pressure like men thinking that they have to be tough like men and can&amp;#39;t show weakness are killing us, but our brains are affecting us as well.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is more in line with my claim because it acknowledges that men are driven to crime by society.  However, my claim is that our brains (in the way you meant it - i.e. brain chemistry) are &lt;strong&gt;not&lt;/strong&gt; disproportionately driving men to crime.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8owm3", "score_hidden": false, "stickied": false, "created": 1492169034.0, "created_utc": 1492140234.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8oq0n", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Iswallowedafly", "parent_id": "t1_dg8nztr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "But there are two specific differences between the male and female brains. \n\nMen have a a lot more testosterone in our system. And that acts on the brain. More testosterone means that we tend to be more prone to violence, aggression and impulsive and risky activities. \n\nAlso the maturity rates for the brain in men and women are different. The brain is fully developed at 25.  Women have a head start by about two years. And this is the part of the brain that governs impulse control and risk assessment. \n\nAnd yes, societal pressure like men thinking that they have to be tough like men and can't show weakness are killing us, but our brains are affecting us as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But there are two specific differences between the male and female brains. &lt;/p&gt;\n\n&lt;p&gt;Men have a a lot more testosterone in our system. And that acts on the brain. More testosterone means that we tend to be more prone to violence, aggression and impulsive and risky activities. &lt;/p&gt;\n\n&lt;p&gt;Also the maturity rates for the brain in men and women are different. The brain is fully developed at 25.  Women have a head start by about two years. And this is the part of the brain that governs impulse control and risk assessment. &lt;/p&gt;\n\n&lt;p&gt;And yes, societal pressure like men thinking that they have to be tough like men and can&amp;#39;t show weakness are killing us, but our brains are affecting us as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8oq0n", "score_hidden": false, "stickied": false, "created": 1492168746.0, "created_utc": 1492139946.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg8oqif", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg8o1hp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I provided a source showing that men's brains are highly similar to women's brains.  This indicates that behavioral differences are much more tied to societal differences than genetic differences.  You are claiming that men are more violent due to genetic differences.  This goes in direct contradiction to my source.  So now I ask that you provide evidence to suggest that there are genetic differences that drive men to be more violent than women.\n\nI also feel that requiring sources on something that isn't well researched is counterproductive.  As far as I know, there are no studies that indicate that things are one way or the other (which I why I asked if you knew of any).  When we don't have science to guide us to the truth, the next best thing we've got is discussion and speculation.  I can say with complete certainty that I am not a violent individual.  I have also been tested and I have found that my testosterone levels are slightly higher than average.  Now, I don't want a lecture on anecdotal evidence, I am well aware that it is not any sort of proof.  That being said, there isn't any proof in the other direction either, so my own anecdotal experiences are enough for me to question whether testosterone really drives people to become violent.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I provided a source showing that men&amp;#39;s brains are highly similar to women&amp;#39;s brains.  This indicates that behavioral differences are much more tied to societal differences than genetic differences.  You are claiming that men are more violent due to genetic differences.  This goes in direct contradiction to my source.  So now I ask that you provide evidence to suggest that there are genetic differences that drive men to be more violent than women.&lt;/p&gt;\n\n&lt;p&gt;I also feel that requiring sources on something that isn&amp;#39;t well researched is counterproductive.  As far as I know, there are no studies that indicate that things are one way or the other (which I why I asked if you knew of any).  When we don&amp;#39;t have science to guide us to the truth, the next best thing we&amp;#39;ve got is discussion and speculation.  I can say with complete certainty that I am not a violent individual.  I have also been tested and I have found that my testosterone levels are slightly higher than average.  Now, I don&amp;#39;t want a lecture on anecdotal evidence, I am well aware that it is not any sort of proof.  That being said, there isn&amp;#39;t any proof in the other direction either, so my own anecdotal experiences are enough for me to question whether testosterone really drives people to become violent.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8oqif", "score_hidden": false, "stickied": false, "created": 1492168766.0, "created_utc": 1492139966.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8o1hp", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Iswallowedafly", "parent_id": "t1_dg8nztr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Because you are the one making the claim. \n\nWhen you make a claim you have to back it up with more then just I feel this way  and you kind of haven't done that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because you are the one making the claim. &lt;/p&gt;\n\n&lt;p&gt;When you make a claim you have to back it up with more then just I feel this way  and you kind of haven&amp;#39;t done that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8o1hp", "score_hidden": false, "stickied": false, "created": 1492167723.0, "created_utc": 1492138923.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ygf2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AloysiusC", "parent_id": "t1_dg8nztr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I wrote a post about this a while back [here](https://www.reddit.com/r/MensRights/comments/4i1nsk/violence_in_men_vs_women_things_arent_how_they/) if you're interested. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wrote a post about this a while back &lt;a href=\"https://www.reddit.com/r/MensRights/comments/4i1nsk/violence_in_men_vs_women_things_arent_how_they/\"&gt;here&lt;/a&gt; if you&amp;#39;re interested. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8ygf2", "score_hidden": false, "stickied": false, "created": 1492190637.0, "created_utc": 1492161837.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8nztr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg8npfo", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Do you have evidence to support what you think is true?\n\nI don't have any immediately available, but I see no reason why the burden of proof should be on me any more than someone who disagrees with me.  The reason I believe this is because I believe that men and women are fundamentally extremely similar.  There is evidence for that [source](http://www.sciencemag.org/news/2015/11/brains-men-and-women-aren-t-really-different-study-finds).  So I believe that if you claim that there is a difference, then the burden of proof is on you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Do you have evidence to support what you think is true?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t have any immediately available, but I see no reason why the burden of proof should be on me any more than someone who disagrees with me.  The reason I believe this is because I believe that men and women are fundamentally extremely similar.  There is evidence for that &lt;a href=\"http://www.sciencemag.org/news/2015/11/brains-men-and-women-aren-t-really-different-study-finds\"&gt;source&lt;/a&gt;.  So I believe that if you claim that there is a difference, then the burden of proof is on you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8nztr", "score_hidden": false, "stickied": false, "created": 1492167653.0, "created_utc": 1492138853.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8npfo", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Iswallowedafly", "parent_id": "t1_dg8n6u5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You can believe what you want here, but you are making a bold claim. \n\nDo you have evidence to support what you think is true?\n\nThere are poor men and poor women. At around equal amounts. \n\nBut men commit 80 percent of all violent crimes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can believe what you want here, but you are making a bold claim. &lt;/p&gt;\n\n&lt;p&gt;Do you have evidence to support what you think is true?&lt;/p&gt;\n\n&lt;p&gt;There are poor men and poor women. At around equal amounts. &lt;/p&gt;\n\n&lt;p&gt;But men commit 80 percent of all violent crimes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8npfo", "score_hidden": false, "stickied": false, "created": 1492167217.0, "created_utc": 1492138417.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg9d34y", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "AmoebaMan", "parent_id": "t1_dg8n6u5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;I do not believe that men are more violent than women due to any sort of genetic or biological factor.\n\nThis belief flies in the face of of science in a way that really is only matched by people who believe climate change is a hoax.\n\nThere is an absurd abundance of examples throughout the natural world where one sex of a species is far more aggressive and violent than the other - it's the *rule* in fact, not the exception. Pick just about animal you can think of, and odds are this will be the case.\n\nIn addition, studies on humans have further confirmed a direct link between testosterone and aggression (just as in animals). Here is [one study](https://www.ncbi.nlm.nih.gov/m/pubmed/2029601/) demonstrating this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I do not believe that men are more violent than women due to any sort of genetic or biological factor.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This belief flies in the face of of science in a way that really is only matched by people who believe climate change is a hoax.&lt;/p&gt;\n\n&lt;p&gt;There is an absurd abundance of examples throughout the natural world where one sex of a species is far more aggressive and violent than the other - it&amp;#39;s the &lt;em&gt;rule&lt;/em&gt; in fact, not the exception. Pick just about animal you can think of, and odds are this will be the case.&lt;/p&gt;\n\n&lt;p&gt;In addition, studies on humans have further confirmed a direct link between testosterone and aggression (just as in animals). Here is &lt;a href=\"https://www.ncbi.nlm.nih.gov/m/pubmed/2029601/\"&gt;one study&lt;/a&gt; demonstrating this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9d34y", "score_hidden": false, "stickied": false, "created": 1492216138.0, "created_utc": 1492187338.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg93yh7", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "samsonkeane", "parent_id": "t1_dg8n6u5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Blank slate theories fall apart when you look at the evidence.\n\nhttps://www.psychologytoday.com/blog/the-athletes-way/201310/testosterone-fuels-both-competition-and-protectiveness", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Blank slate theories fall apart when you look at the evidence.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.psychologytoday.com/blog/the-athletes-way/201310/testosterone-fuels-both-competition-and-protectiveness\"&gt;https://www.psychologytoday.com/blog/the-athletes-way/201310/testosterone-fuels-both-competition-and-protectiveness&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg93yh7", "score_hidden": false, "stickied": false, "created": 1492204461.0, "created_utc": 1492175661.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg8wkg5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "UnauthorizedUnderdog", "parent_id": "t1_dg8n6u5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3693622/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3693622/\"&gt;https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3693622/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8wkg5", "score_hidden": false, "stickied": false, "created": 1492184671.0, "created_utc": 1492155871.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9h1r5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "shredler", "parent_id": "t1_dg8n6u5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "http://open.lib.umn.edu/socialpsychology/chapter/10-2-the-biological-and-emotional-causes-of-aggression/\n\n&gt;Hormones are also important in creating aggression. Most important in this regard is the male sex hormone testosterone, which is associated with increased aggression in both animals and in humans. Research conducted on a variety of animals has found a strong correlation between levels of testosterone and aggression. This relationship seems to be weaker among humans than among animals, yet it is still significant (Dabbs, Hargrove, &amp; Heusel, 1996)\n\n\n&gt;The male sex hormone testosterone is closely associated with aggression in both men and women. The neurotransmitter serotonin helps us inhibit aggression.\n\nhttps://en.wikipedia.org/wiki/Testosterone\n\nMen have a much higher Testosterone level than women.. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://open.lib.umn.edu/socialpsychology/chapter/10-2-the-biological-and-emotional-causes-of-aggression/\"&gt;http://open.lib.umn.edu/socialpsychology/chapter/10-2-the-biological-and-emotional-causes-of-aggression/&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Hormones are also important in creating aggression. Most important in this regard is the male sex hormone testosterone, which is associated with increased aggression in both animals and in humans. Research conducted on a variety of animals has found a strong correlation between levels of testosterone and aggression. This relationship seems to be weaker among humans than among animals, yet it is still significant (Dabbs, Hargrove, &amp;amp; Heusel, 1996)&lt;/p&gt;\n\n&lt;p&gt;The male sex hormone testosterone is closely associated with aggression in both men and women. The neurotransmitter serotonin helps us inhibit aggression.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Testosterone\"&gt;https://en.wikipedia.org/wiki/Testosterone&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Men have a much higher Testosterone level than women.. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9h1r5", "score_hidden": false, "stickied": false, "created": 1492220665.0, "created_utc": 1492191865.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dgbb73p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aesthesia1", "parent_id": "t1_dg9yz78", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Then, you've got to present some sort of evidence to suggest or back up that counter idea; that society pushes men to crime. \nAs it is, the fact that men commit more crimes is enough reason for them to end up incarcerated more often. That's a simple line of logic.\n\nCrime is punished by incarceration-&gt; Men commit more crime-&gt; Men are incarcerated more because they commit more crime.\n\nSo what you need to do to have a convincing argument as to why it is a social injustice to incarcerate people who commit crime is attack it from different angles. You've got to discredit the premises in an honest, and legitimate fashion, and not for the sake of proving yourself correct. As an example You could attempt to prove/argue that most of the criminal charges which are brought against men are false or illegitimate. Are these behaviors not worthy of being considered crimes? Are men innocent of what they've been accused of in great proportion, or more likely to be caught? BUT, since there is legitimate scientific basis to the point of biological predisposition, you're going to need more than theorycraft to wager against that. When you cross science, belief is *worthless*. You either accept convincing evidence, prove that the evidence is not convincing, or refuse to admit that you are actually wrong/don't have a competitive basis for your beliefs.\n\n Remember the basics of critical thinking. One hole I can automatically pick in your initial reasoning is that while you explain a general questioning of the idea of heritability of criminality by sex, and use race-based incarceration as a supportive example, you do not delve into depth/specific possibilities for what those social triggers to sex-imbalanced criminality could be. You need to go more in-depth--especially if you do not have as much evidence to your viewpoint as the viewpoint you are challenging. Skepticism is only a virtue when you have something better in mind, and is a farce when you are replacing scientific evidence with vague speculation.\n\n", "edited": 1492297804.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Then, you&amp;#39;ve got to present some sort of evidence to suggest or back up that counter idea; that society pushes men to crime. \nAs it is, the fact that men commit more crimes is enough reason for them to end up incarcerated more often. That&amp;#39;s a simple line of logic.&lt;/p&gt;\n\n&lt;p&gt;Crime is punished by incarceration-&amp;gt; Men commit more crime-&amp;gt; Men are incarcerated more because they commit more crime.&lt;/p&gt;\n\n&lt;p&gt;So what you need to do to have a convincing argument as to why it is a social injustice to incarcerate people who commit crime is attack it from different angles. You&amp;#39;ve got to discredit the premises in an honest, and legitimate fashion, and not for the sake of proving yourself correct. As an example You could attempt to prove/argue that most of the criminal charges which are brought against men are false or illegitimate. Are these behaviors not worthy of being considered crimes? Are men innocent of what they&amp;#39;ve been accused of in great proportion, or more likely to be caught? BUT, since there is legitimate scientific basis to the point of biological predisposition, you&amp;#39;re going to need more than theorycraft to wager against that. When you cross science, belief is &lt;em&gt;worthless&lt;/em&gt;. You either accept convincing evidence, prove that the evidence is not convincing, or refuse to admit that you are actually wrong/don&amp;#39;t have a competitive basis for your beliefs.&lt;/p&gt;\n\n&lt;p&gt;Remember the basics of critical thinking. One hole I can automatically pick in your initial reasoning is that while you explain a general questioning of the idea of heritability of criminality by sex, and use race-based incarceration as a supportive example, you do not delve into depth/specific possibilities for what those social triggers to sex-imbalanced criminality could be. You need to go more in-depth--especially if you do not have as much evidence to your viewpoint as the viewpoint you are challenging. Skepticism is only a virtue when you have something better in mind, and is a farce when you are replacing scientific evidence with vague speculation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbb73p", "score_hidden": false, "stickied": false, "created": 1492326061.0, "created_utc": 1492297261.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9yz78", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg9funv", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Men are not only much more likely to commit violent crime, but they are more likely to commit nonviolent crimes as well\n\nThis is evidence that crime rates are societal, not biological.  If there were a biological aspect, it would be more likely that men would commit more violent crime, but roughly equal amounts of other crimes.  Since this is not the case, it is obvious to me that society pushes men towards crime more often.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Men are not only much more likely to commit violent crime, but they are more likely to commit nonviolent crimes as well&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is evidence that crime rates are societal, not biological.  If there were a biological aspect, it would be more likely that men would commit more violent crime, but roughly equal amounts of other crimes.  Since this is not the case, it is obvious to me that society pushes men towards crime more often.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9yz78", "score_hidden": false, "stickied": false, "created": 1492243089.0, "created_utc": 1492214289.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9funv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aesthesia1", "parent_id": "t1_dg8n6u5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You are denying a ton of scientific evidence given against this claim with a statement that starts with \"I believe\", and no given support behind it. To add, throughout human history, even dating back to the long expanse of time humankind spent in tribal state, it has always been primarily men which wage battle. Even in these relatively egalitarian(when compared to other descending forms of society) societies with no direct rulership or formal circumscription, men would be the ones to perform in warfare and do most of the hunting. Women comparitively rarely participated in war. Men are not only much more likely to commit violent crime, but they are more likely to commit nonviolent crimes as well, with no distinction wherein women commit more of the same crime than men do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are denying a ton of scientific evidence given against this claim with a statement that starts with &amp;quot;I believe&amp;quot;, and no given support behind it. To add, throughout human history, even dating back to the long expanse of time humankind spent in tribal state, it has always been primarily men which wage battle. Even in these relatively egalitarian(when compared to other descending forms of society) societies with no direct rulership or formal circumscription, men would be the ones to perform in warfare and do most of the hunting. Women comparitively rarely participated in war. Men are not only much more likely to commit violent crime, but they are more likely to commit nonviolent crimes as well, with no distinction wherein women commit more of the same crime than men do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9funv", "score_hidden": false, "stickied": false, "created": 1492219274.0, "created_utc": 1492190474.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9a5zo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nathanv221", "parent_id": "t1_dg8n6u5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I was looking for the data to prove you wrong on this, but I'm not so sure now. You have a more valid point than I thought.\n\nThis one disagrees with you, but is a study on testosterone (steroid) abuse.\n\n\nhttp://jamanetwork.com/journals/jamapsychiatry/fullarticle/481565\n\n\nThis article however looks at normal men given small amounts of testosterone, and supports your beliefs (except on rates of hostility) I recommend checking out table 2.\n\nhttps://academic.oup.com/jcem/article-lookup/doi/10.1210/jc.2003-031354\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was looking for the data to prove you wrong on this, but I&amp;#39;m not so sure now. You have a more valid point than I thought.&lt;/p&gt;\n\n&lt;p&gt;This one disagrees with you, but is a study on testosterone (steroid) abuse.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://jamanetwork.com/journals/jamapsychiatry/fullarticle/481565\"&gt;http://jamanetwork.com/journals/jamapsychiatry/fullarticle/481565&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This article however looks at normal men given small amounts of testosterone, and supports your beliefs (except on rates of hostility) I recommend checking out table 2.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://academic.oup.com/jcem/article-lookup/doi/10.1210/jc.2003-031354\"&gt;https://academic.oup.com/jcem/article-lookup/doi/10.1210/jc.2003-031354&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9a5zo", "score_hidden": false, "stickied": false, "created": 1492212844.0, "created_utc": 1492184044.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9b6yc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RustyRook", "parent_id": "t1_dg99wlg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sorry UnauthorizedUnderdog, your comment has been removed: \n\n&gt; Comment Rule 5\\. \"No low effort comments. Comments that are only jokes, links, or 'written upvotes', for example. Humor, links, and affirmations of agreement can be contained within more substantial comments.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5)\n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Rule+5+Appeal+UnauthorizedUnderdog&amp;message=UnauthorizedUnderdog+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/dg99wlg/\\))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry UnauthorizedUnderdog, your comment has been removed: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 5. &amp;quot;No low effort comments. Comments that are only jokes, links, or &amp;#39;written upvotes&amp;#39;, for example. Humor, links, and affirmations of agreement can be contained within more substantial comments.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5\"&gt;See the wiki page for more information.&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Rule+5+Appeal+UnauthorizedUnderdog&amp;amp;message=UnauthorizedUnderdog+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/dg99wlg/)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9b6yc", "score_hidden": false, "stickied": false, "created": 1492214037.0, "created_utc": 1492185237.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg99wlg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg8n6u5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg99wlg", "score_hidden": false, "stickied": false, "created": 1492212533.0, "created_utc": 1492183733.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8n6u5", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg8n1ti", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "&gt; Testosterone is directly correlated with male secondary sex characteristics, such as aggression, facial hair and yes, risk taking.\n\nDo you have a source for this?  If you think that I accept this at face value, then you have misunderstood my post.  My claim is highly centered around the fact that **I do not believe that men are more violent than women due to any sort of genetic or biological factor.  I believe that the difference in risk taking and violence between men and women can be completely explained by societal factors**.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Testosterone is directly correlated with male secondary sex characteristics, such as aggression, facial hair and yes, risk taking.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Do you have a source for this?  If you think that I accept this at face value, then you have misunderstood my post.  My claim is highly centered around the fact that &lt;strong&gt;I do not believe that men are more violent than women due to any sort of genetic or biological factor.  I believe that the difference in risk taking and violence between men and women can be completely explained by societal factors&lt;/strong&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8n6u5", "score_hidden": false, "stickied": false, "created": 1492166467.0, "created_utc": 1492137667.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8n1ti", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "UnauthorizedUnderdog", "parent_id": "t1_dg8mha5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Testosterone is directly correlated with male secondary sex characteristics, such as aggression, facial hair and yes, risk taking. So denying that fact is denying the effects that testosterone has on male brains. This is why males fight males for females in most species and why males across most species try and show off. It's all in your DNA. \n\n\nSociety does groom men, however across all ages of history men have been the ones fighting the wars, hunting the bears and blowing themselves up in an effort to discover elements because they are men with testosterone and not because of society. There was no \"society\" when we were neanderthals. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Testosterone is directly correlated with male secondary sex characteristics, such as aggression, facial hair and yes, risk taking. So denying that fact is denying the effects that testosterone has on male brains. This is why males fight males for females in most species and why males across most species try and show off. It&amp;#39;s all in your DNA. &lt;/p&gt;\n\n&lt;p&gt;Society does groom men, however across all ages of history men have been the ones fighting the wars, hunting the bears and blowing themselves up in an effort to discover elements because they are men with testosterone and not because of society. There was no &amp;quot;society&amp;quot; when we were neanderthals. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8n1ti", "score_hidden": false, "stickied": false, "created": 1492166272.0, "created_utc": 1492137472.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9gwti", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dg9gv44", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/the_well_hung_jury ([1∆](/r/changemyview/wiki/user/the_well_hung_jury)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"the_well_hung_jury\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/the_well_hung_jury\"&gt;/u/the_well_hung_jury&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/the_well_hung_jury\"&gt;1∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22the_well_hung_jury%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9gwti", "score_hidden": false, "stickied": false, "created": 1492220507.0, "created_utc": 1492191707.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9gv44", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "raltodd", "parent_id": "t1_dg8xare", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Thank you for a very insightful comment!\n\n!delta I shared OP's view that a big part of the difference in violent crime rates is likely due to gender roles putting pressure on men to be strong / breadwinners / tough / thick-skinned which may make them more likely to blow a fuse once it all becomes too much.\n\nI now realise that huge difference in crime rate is mostly due to desperate men not having the opportunity to do some of the less violent crime that desperate women can engage in (like shoplifting and prostitution). \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for a very insightful comment!&lt;/p&gt;\n\n&lt;p&gt;!delta I shared OP&amp;#39;s view that a big part of the difference in violent crime rates is likely due to gender roles putting pressure on men to be strong / breadwinners / tough / thick-skinned which may make them more likely to blow a fuse once it all becomes too much.&lt;/p&gt;\n\n&lt;p&gt;I now realise that huge difference in crime rate is mostly due to desperate men not having the opportunity to do some of the less violent crime that desperate women can engage in (like shoplifting and prostitution). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9gv44", "score_hidden": false, "stickied": false, "created": 1492220451.0, "created_utc": 1492191651.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8xare", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "the_well_hung_jury", "parent_id": "t1_dg8mha5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; And I am saying that this is a horrible injustice because, for example, if someone needs to rob a bank to feed their family there should be no reason that it's just expected of the man to be the one to do it.\n\nI don't mean to sound condescending, but this is quite a charmed view of crime. That's not really something that happens in real life. You don't typically have a homeless family stay together where the man is out hunting and gathering for the family. Instead, to survive, men and women seek different methods to make a quick buck because what each has to offer from their place in society differs by gender.\n\nSince we're taking pause for examples and anecdotes, I will chime in with what my experience has been in criminal defense work. Most crime is committed by a small proportion of individuals and the primary causes of the vast majority are poverty, drug addiction, and mental illness (or some combination of the three). Those things affect men and women equally. However, they do not respond to such environments in the same way because men and women are resourceful in different ways. \n\nFor example, a homeless woman suffering from mental illness or substance abuse might turn a trick or shoplift and sell her wares on the street to support her addiction. The types of crimes women tend to commit reflect the fact that they are physiologically less prone to violence and aggression than men. \n\nComparatively, a homeless male with a substance abuse disorder doesn't really have the same options as the female above. No one's paying for that dude's tricks. A lot of people are frightened by the presence of an obviously homeless man, and anyway, he's going to get booted from most stores before he can steal anything. So what are his next best options to support his habit? \n\nWell, he's either going to sell drugs, rob someone, or steal. Well, if he's selling drugs, that disparity you can blame on the war on drugs. The reason more men sell drugs than women is because women aren't great candidates for this position. Generally speaking, female drug dealers are substantially more likely to get jumped and robbed because it's an easy crime of opportunity for her drug using customers. \n\nIf he's robbing another person to support himself, now you have a violent crime and a victim so he's much more likely to face incarceration in his disposition. Alternatively, if he gets caught stealing, he's more likely to face an aggressive confrontation upon arrest which of course yield additional charges for him. Now you have multiple charges instead of the sole shoplifting charge. Whereas if a woman gets caught stealing, she's probably not going to have 10 officers kneeing her in the back where she feels like she needs to defend herself. A single shoplifting charge will yield a slap on the wrist; no harm, no foul. \n\nSo, while I'd agree with you on the general point that overincarceration is the real crime here, it's not because men are out trying to do noble things for women and children as society mandates. It's because they have no way to make a living outside of crime and their underlying issues hinder their ability to get to a place where they can support themselves -- whether that be because he lacked any kind of familial structure of support growing up or now, lack of education, substance abuse, untreated mental illness, a history of physical and/or sexual abuse, etc. If you grew up in foster care or got into Juvie, you don't get the opportunity to learn healthy emotional coping skills and how to operate in a functioning society because you're always lacking some basic human need. (Obviously this applies equally to women). As an individual stuck in the cycle of poverty, you don't get an opportunity to develop patience or gratitude and without basic coping or life skills, your testosterone manifests as outward aggression because you have no healthy alternative outlet -- especially for young adult men. So now you have adult men in the cycle of incarceration, part of the cycle of poverty, which leads to more desperation, likely depression or some other mood disorder development, and more crime. Repeat. \n\nThe disparity is not because of society's gendered expectations so much so that men and women are just different, with different tendencies, and that once you get into this cycle it becomes increasingly difficult to manage a way out. With each crime, you face more time than the last one, and life becomes a treadmill of anger, fighting, pain, and emptiness. It's easier for men to get swept up in this system, and earlier, which isn't necessarily their fault, but nor is it an issue of any kind of societal expectations -- generally people who are in a place of desperation don't place such a high value on providing for others. Our problem with overincarceration stems from poverty and men who are victims of poverty are the ones who wind up incarcerated. \n\n \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;And I am saying that this is a horrible injustice because, for example, if someone needs to rob a bank to feed their family there should be no reason that it&amp;#39;s just expected of the man to be the one to do it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t mean to sound condescending, but this is quite a charmed view of crime. That&amp;#39;s not really something that happens in real life. You don&amp;#39;t typically have a homeless family stay together where the man is out hunting and gathering for the family. Instead, to survive, men and women seek different methods to make a quick buck because what each has to offer from their place in society differs by gender.&lt;/p&gt;\n\n&lt;p&gt;Since we&amp;#39;re taking pause for examples and anecdotes, I will chime in with what my experience has been in criminal defense work. Most crime is committed by a small proportion of individuals and the primary causes of the vast majority are poverty, drug addiction, and mental illness (or some combination of the three). Those things affect men and women equally. However, they do not respond to such environments in the same way because men and women are resourceful in different ways. &lt;/p&gt;\n\n&lt;p&gt;For example, a homeless woman suffering from mental illness or substance abuse might turn a trick or shoplift and sell her wares on the street to support her addiction. The types of crimes women tend to commit reflect the fact that they are physiologically less prone to violence and aggression than men. &lt;/p&gt;\n\n&lt;p&gt;Comparatively, a homeless male with a substance abuse disorder doesn&amp;#39;t really have the same options as the female above. No one&amp;#39;s paying for that dude&amp;#39;s tricks. A lot of people are frightened by the presence of an obviously homeless man, and anyway, he&amp;#39;s going to get booted from most stores before he can steal anything. So what are his next best options to support his habit? &lt;/p&gt;\n\n&lt;p&gt;Well, he&amp;#39;s either going to sell drugs, rob someone, or steal. Well, if he&amp;#39;s selling drugs, that disparity you can blame on the war on drugs. The reason more men sell drugs than women is because women aren&amp;#39;t great candidates for this position. Generally speaking, female drug dealers are substantially more likely to get jumped and robbed because it&amp;#39;s an easy crime of opportunity for her drug using customers. &lt;/p&gt;\n\n&lt;p&gt;If he&amp;#39;s robbing another person to support himself, now you have a violent crime and a victim so he&amp;#39;s much more likely to face incarceration in his disposition. Alternatively, if he gets caught stealing, he&amp;#39;s more likely to face an aggressive confrontation upon arrest which of course yield additional charges for him. Now you have multiple charges instead of the sole shoplifting charge. Whereas if a woman gets caught stealing, she&amp;#39;s probably not going to have 10 officers kneeing her in the back where she feels like she needs to defend herself. A single shoplifting charge will yield a slap on the wrist; no harm, no foul. &lt;/p&gt;\n\n&lt;p&gt;So, while I&amp;#39;d agree with you on the general point that overincarceration is the real crime here, it&amp;#39;s not because men are out trying to do noble things for women and children as society mandates. It&amp;#39;s because they have no way to make a living outside of crime and their underlying issues hinder their ability to get to a place where they can support themselves -- whether that be because he lacked any kind of familial structure of support growing up or now, lack of education, substance abuse, untreated mental illness, a history of physical and/or sexual abuse, etc. If you grew up in foster care or got into Juvie, you don&amp;#39;t get the opportunity to learn healthy emotional coping skills and how to operate in a functioning society because you&amp;#39;re always lacking some basic human need. (Obviously this applies equally to women). As an individual stuck in the cycle of poverty, you don&amp;#39;t get an opportunity to develop patience or gratitude and without basic coping or life skills, your testosterone manifests as outward aggression because you have no healthy alternative outlet -- especially for young adult men. So now you have adult men in the cycle of incarceration, part of the cycle of poverty, which leads to more desperation, likely depression or some other mood disorder development, and more crime. Repeat. &lt;/p&gt;\n\n&lt;p&gt;The disparity is not because of society&amp;#39;s gendered expectations so much so that men and women are just different, with different tendencies, and that once you get into this cycle it becomes increasingly difficult to manage a way out. With each crime, you face more time than the last one, and life becomes a treadmill of anger, fighting, pain, and emptiness. It&amp;#39;s easier for men to get swept up in this system, and earlier, which isn&amp;#39;t necessarily their fault, but nor is it an issue of any kind of societal expectations -- generally people who are in a place of desperation don&amp;#39;t place such a high value on providing for others. Our problem with overincarceration stems from poverty and men who are victims of poverty are the ones who wind up incarcerated. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8xare", "score_hidden": false, "stickied": false, "created": 1492186865.0, "created_utc": 1492158065.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg95j8j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "energirl", "parent_id": "t1_dg8mha5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I've been teaching kindergarten for a lot of years. While there are few differences between boys and girls that age (including love of pink, princesses, sports, and fart jokes), the boys are already far more violent. They push more, wrestle more, and are obsessed with blood and weapons. Even my tomboys cannot compare to the average boy in this respect. In the same vein, I think of all the hospital visits my friends and family have had to make for their pre-pubescent boys versus pre-pubescent girls. It's not even close! \n\nSure this is just my experience and therefore anecdotal. So how about some actual research? [Here's](https://fistfulofscience.wordpress.com/2010/08/09/are-boys-more-aggressive-than-girls/amp/) an article about the difference in aggression which starts as early as birth and continues through childhood. It says \"That difference is linked to prenatal testosterone but not, surprisingly, to the resurgence in boys’ testosterone level in adolescence, because boys do not suddenly become more aggressive when they go through puberty, as Archer’s work also indicates.\"\n\nI would cite more articles, but anyone can find what I'm finding if they just google it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been teaching kindergarten for a lot of years. While there are few differences between boys and girls that age (including love of pink, princesses, sports, and fart jokes), the boys are already far more violent. They push more, wrestle more, and are obsessed with blood and weapons. Even my tomboys cannot compare to the average boy in this respect. In the same vein, I think of all the hospital visits my friends and family have had to make for their pre-pubescent boys versus pre-pubescent girls. It&amp;#39;s not even close! &lt;/p&gt;\n\n&lt;p&gt;Sure this is just my experience and therefore anecdotal. So how about some actual research? &lt;a href=\"https://fistfulofscience.wordpress.com/2010/08/09/are-boys-more-aggressive-than-girls/amp/\"&gt;Here&amp;#39;s&lt;/a&gt; an article about the difference in aggression which starts as early as birth and continues through childhood. It says &amp;quot;That difference is linked to prenatal testosterone but not, surprisingly, to the resurgence in boys’ testosterone level in adolescence, because boys do not suddenly become more aggressive when they go through puberty, as Archer’s work also indicates.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I would cite more articles, but anyone can find what I&amp;#39;m finding if they just google it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg95j8j", "score_hidden": false, "stickied": false, "created": 1492206870.0, "created_utc": 1492178070.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9hmg9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "zimtamslam", "parent_id": "t1_dg8mha5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "There is something about your scenario that feels off to me. It's a little reductive. it also leaves about a crucial gender difference that matters; pregnancy. The burden of childcare falls heavily on women, not only because of the social norms, but from the biological reality of caring for children.  Considering the connection between crime and poverty, as well as the connection between poverty and youth pregnancy, it's possible that having children is more of a deterrent for women then men. Meaning in the unlikely scenario you mention where a couple is discussing who will rob the bank, fear of what will happen to the children may be a greater deterrent for mothers due greater concern for the welfare of children. Now this isn't to say that father's aren't concerned for children for that there aren't social norms at play here as well, however it is I.possible for someone to not know they mothered a child, so there is an argument to be made for greater sense of connection. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is something about your scenario that feels off to me. It&amp;#39;s a little reductive. it also leaves about a crucial gender difference that matters; pregnancy. The burden of childcare falls heavily on women, not only because of the social norms, but from the biological reality of caring for children.  Considering the connection between crime and poverty, as well as the connection between poverty and youth pregnancy, it&amp;#39;s possible that having children is more of a deterrent for women then men. Meaning in the unlikely scenario you mention where a couple is discussing who will rob the bank, fear of what will happen to the children may be a greater deterrent for mothers due greater concern for the welfare of children. Now this isn&amp;#39;t to say that father&amp;#39;s aren&amp;#39;t concerned for children for that there aren&amp;#39;t social norms at play here as well, however it is I.possible for someone to not know they mothered a child, so there is an argument to be made for greater sense of connection. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9hmg9", "score_hidden": false, "stickied": false, "created": 1492221333.0, "created_utc": 1492192533.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dgaedmd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "orionbeltblues", "parent_id": "t1_dg8mha5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;  I do not believe that men are inherently more prone to risk taking due to having more testosterone.\n\nThat is an non-scientific belief that directly contradicts empirical evidence.  [[source](http://www.open.edu/openlearn/science-maths-technology/science/biology/how-testosterone-affects-risk-taking-behaviour#)].  The relevant section:\n\n&gt;Research has shown that testosterone has particular effects within the brain where it can alter the reactivity of areas of the brain that use the neurotransmitter dopamine for neuronal communication. What does this mean? Neurons (a type of brain cell) use chemical substances called ‘neurotransmitters’ to communicate with one another across the gaps that exist between them. The release of neurotransmitter by a neuron is therefore a form of neuron to neuron signalling.  Dopamine is an important brain substance for behavior.  For example, it has been described as ‘the pleasure chemical’ because dopamine release by neurons in a part of the brain called the ventral tegmental area has been shown to underlie all forms of pleasure motivated behavior.  That is; things like sex, eating (chocolate for example), drinking (alcohol for example) but also other addictive behaviors such as smoking and even financial addictions like gambling. In essence when a person is driven to engage in all of these behaviors there will be dopamine signalling by neurons that form the part of the brain known as the ventral tegmental area.\n\n&gt;Testosterone is therefore likely to achieve its effects on risk taking behavior because it affects the level of dopamine activity arising from neurons in the ventral tegmental area. For example, larger amounts of testosterone are associated with having more dopamine neurons, and more dopamine neurons could mean more dopamine will be released by ventral tegmental area neurons.  It has, for example, also been shown that individuals who seem to display a greater level of risk taking behaviour have less of a certain type of dopamine receptor.\n\nI can cite many more studies that show links between testosterone and risk-taking if you need them.\n\n&gt; I believe that they are more prone to risk taking because society forces them to. So in your example, if there is a man, his wife, and they have two kids, and they are a poor family, the man is more expected to take risks to try and get them out of poverty than the rest of them. He would be taking those risks not due to testosterone in his veins, but rather due to his wife and children depending on him. And I am saying that this is a horrible injustice because, for example, if someone needs to rob a bank to feed their family there should be no reason that it's just expected of the man to be the one to do it.\n\nThe problem with your theory is that all the evidence suggests that marriage significantly reduces the likelihood of ever engaging in criminal behavior [[source](http://scholar.harvard.edu/files/sampson/files/2006_criminology_laubwimer_1.pdf), PDF], and also reduces the likelihood of recidivism [[source](https://aspe.hhs.gov/basic-report/impact-marital-and-relationship-status-social-outcomes-returning-prisoners)].\n\nThe typical criminal is under 25, unmarried and not a father.\n\n&gt;So my main point is that society grooms men to become criminals, and that is not the fault of men. It is the fault of society for pushing them down that path to begin with, and yet no one acts like it's an issue.\n\nIt would be far more accurate to say that society *criminalizes* the behavior of young urban males.  \n\nFor example, an impoverished male under the age of 25 is mostly likely to live with a parent (typically a single mother) in a cramped living quarters.  The mother typically forces the young man to spend the majority of his time outside the house, while young women are not subject to the same pressures.\n\nHe can't afford to drink in bars, so he and his young friends gather in semi-public spaces (parks, stoops, etc.) and do what young men of *all* social classes do: they drink alcohol.  Thus laws against the consumption of alcohol in public are most likely to affect young urban men.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I do not believe that men are inherently more prone to risk taking due to having more testosterone.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That is an non-scientific belief that directly contradicts empirical evidence.  [&lt;a href=\"http://www.open.edu/openlearn/science-maths-technology/science/biology/how-testosterone-affects-risk-taking-behaviour#\"&gt;source&lt;/a&gt;].  The relevant section:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Research has shown that testosterone has particular effects within the brain where it can alter the reactivity of areas of the brain that use the neurotransmitter dopamine for neuronal communication. What does this mean? Neurons (a type of brain cell) use chemical substances called ‘neurotransmitters’ to communicate with one another across the gaps that exist between them. The release of neurotransmitter by a neuron is therefore a form of neuron to neuron signalling.  Dopamine is an important brain substance for behavior.  For example, it has been described as ‘the pleasure chemical’ because dopamine release by neurons in a part of the brain called the ventral tegmental area has been shown to underlie all forms of pleasure motivated behavior.  That is; things like sex, eating (chocolate for example), drinking (alcohol for example) but also other addictive behaviors such as smoking and even financial addictions like gambling. In essence when a person is driven to engage in all of these behaviors there will be dopamine signalling by neurons that form the part of the brain known as the ventral tegmental area.&lt;/p&gt;\n\n&lt;p&gt;Testosterone is therefore likely to achieve its effects on risk taking behavior because it affects the level of dopamine activity arising from neurons in the ventral tegmental area. For example, larger amounts of testosterone are associated with having more dopamine neurons, and more dopamine neurons could mean more dopamine will be released by ventral tegmental area neurons.  It has, for example, also been shown that individuals who seem to display a greater level of risk taking behaviour have less of a certain type of dopamine receptor.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I can cite many more studies that show links between testosterone and risk-taking if you need them.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I believe that they are more prone to risk taking because society forces them to. So in your example, if there is a man, his wife, and they have two kids, and they are a poor family, the man is more expected to take risks to try and get them out of poverty than the rest of them. He would be taking those risks not due to testosterone in his veins, but rather due to his wife and children depending on him. And I am saying that this is a horrible injustice because, for example, if someone needs to rob a bank to feed their family there should be no reason that it&amp;#39;s just expected of the man to be the one to do it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The problem with your theory is that all the evidence suggests that marriage significantly reduces the likelihood of ever engaging in criminal behavior [&lt;a href=\"http://scholar.harvard.edu/files/sampson/files/2006_criminology_laubwimer_1.pdf\"&gt;source&lt;/a&gt;, PDF], and also reduces the likelihood of recidivism [&lt;a href=\"https://aspe.hhs.gov/basic-report/impact-marital-and-relationship-status-social-outcomes-returning-prisoners\"&gt;source&lt;/a&gt;].&lt;/p&gt;\n\n&lt;p&gt;The typical criminal is under 25, unmarried and not a father.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So my main point is that society grooms men to become criminals, and that is not the fault of men. It is the fault of society for pushing them down that path to begin with, and yet no one acts like it&amp;#39;s an issue.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It would be far more accurate to say that society &lt;em&gt;criminalizes&lt;/em&gt; the behavior of young urban males.  &lt;/p&gt;\n\n&lt;p&gt;For example, an impoverished male under the age of 25 is mostly likely to live with a parent (typically a single mother) in a cramped living quarters.  The mother typically forces the young man to spend the majority of his time outside the house, while young women are not subject to the same pressures.&lt;/p&gt;\n\n&lt;p&gt;He can&amp;#39;t afford to drink in bars, so he and his young friends gather in semi-public spaces (parks, stoops, etc.) and do what young men of &lt;em&gt;all&lt;/em&gt; social classes do: they drink alcohol.  Thus laws against the consumption of alcohol in public are most likely to affect young urban men.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaedmd", "score_hidden": false, "stickied": false, "created": 1492267978.0, "created_utc": 1492239178.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg957hn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RYouNotEntertained", "parent_id": "t1_dg8mha5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;I do not believe that men are inherently more prone to risk taking\n\nWhy don't you believe this?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I do not believe that men are inherently more prone to risk taking&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Why don&amp;#39;t you believe this?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg957hn", "score_hidden": false, "stickied": false, "created": 1492206401.0, "created_utc": 1492177601.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mha5", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg8m854", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; 3 men, 3 women and 4 children, who do you believe is going to be more inclined to risk their freedom by committing crimes to survive?\n\nThe men obviously, but that's exactly my point.  I do not believe that men are inherently more prone to risk taking due to having more testosterone.  I believe that they are more prone to risk taking because society forces them to.  So in your example, if there is a man, his wife, and they have two kids, and they are a poor family, the man is more expected to take risks to try and get them out of poverty than the rest of them.  He would be taking those risks not due to testosterone in his veins, but rather due to his wife and children depending on him.  And I am saying that this is a horrible injustice because, for example, if someone needs to rob a bank to feed their family there should be no reason that it's just expected of the man to be the one to do it.\n\nSo my main point is that society grooms men to become criminals, and that is not the fault of men.  It is the fault of society for pushing them down that path to begin with, and yet no one acts like it's an issue.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;3 men, 3 women and 4 children, who do you believe is going to be more inclined to risk their freedom by committing crimes to survive?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The men obviously, but that&amp;#39;s exactly my point.  I do not believe that men are inherently more prone to risk taking due to having more testosterone.  I believe that they are more prone to risk taking because society forces them to.  So in your example, if there is a man, his wife, and they have two kids, and they are a poor family, the man is more expected to take risks to try and get them out of poverty than the rest of them.  He would be taking those risks not due to testosterone in his veins, but rather due to his wife and children depending on him.  And I am saying that this is a horrible injustice because, for example, if someone needs to rob a bank to feed their family there should be no reason that it&amp;#39;s just expected of the man to be the one to do it.&lt;/p&gt;\n\n&lt;p&gt;So my main point is that society grooms men to become criminals, and that is not the fault of men.  It is the fault of society for pushing them down that path to begin with, and yet no one acts like it&amp;#39;s an issue.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8mha5", "score_hidden": false, "stickied": false, "created": 1492165436.0, "created_utc": 1492136636.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8m854", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "UnauthorizedUnderdog", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Men have always been prone to risk taking- it's part of having testosterone pumping through your veins. Men have also always been inclined to take action. There is no social injustice, what you have touched on is a deeper rooted problem called the poverty cycle. If you have 10 impoverished individuals living in a home: 3 men, 3 women and 4 children, who do you believe is going to be more inclined to risk their freedom by committing crimes to survive? \n\nThis isn't a social injustice, this is a broader problem called poverty.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Men have always been prone to risk taking- it&amp;#39;s part of having testosterone pumping through your veins. Men have also always been inclined to take action. There is no social injustice, what you have touched on is a deeper rooted problem called the poverty cycle. If you have 10 impoverished individuals living in a home: 3 men, 3 women and 4 children, who do you believe is going to be more inclined to risk their freedom by committing crimes to survive? &lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t a social injustice, this is a broader problem called poverty.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8m854", "score_hidden": false, "stickied": false, "created": 1492165078.0, "created_utc": 1492136278.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zulh", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Genoscythe_", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; the incarceration discrepancy is the single most overlooked injustice in America today, and it absolutely disgusts me that there appear to be no movements aimed at correcting this discrepancy.\n\nI think your problem is that you are looking for people to handle this issue in particular, *as it's own standalone social injustice*, but there are logical reasons why no one is interested in that. \n\nThe gap that you described, has been persistent through most of history, from ancient Rome to Victorian England, and survives in places like present day Saudi Arabia and Iran. \n\nAll of these places could be intuitively and inarguably described as cultures that perpetrate gross social injustice *directed at women*, and have structures that are  rooted in women being so oppressed, that they are rarely even given the opportunity to independently commit any crime any more than children are, and when they do they are similarly treated as wards of their fathers and husbands.   \n\nSo how does  this relate to the modern first world? Well, you have two kinds of answers. Certain people would say that it has a lot to do with it, that this history explains our own power structures and lingering gender stereotypes the best. \n\nOthers, (including many of the replies in this thread), would say that it doesn't, that we have a free society based on individual choice and agency, the past is in the past. Women choose to stay away from STEM, men choose to commit crime, etc, it's all a result of biology. \n\nThe point is, that **there is no third alternative**. Between academic feminist theory's view of patriarchy, and anti-feminist MRA \"egalitarians'\" view of individual freedom, there is no room for a legitimate academic masculist theory on the \"matriarcy\", that explains how male imprisonment was perpetuated specifically on it's own by an anti-male culture, *because it really wasn't*. \n\nYou can look at a historical tradition, or you can look at ad hoc double standards existing in bubbles, and thus explained by \"choices\", but not both. \n\nIf you do want to look into the complex sociological basis for how male gender roles came to be, than there is no getting around the fact that they came to be through a brutally woman-oppressing double standard, withing which imprisonment rates were just a minor quirk. And you can't blame the people who approach social injustice from that angle, for continuing to see it as such. \n\nFeminism is the movement for gender equality, because gender inequality is rooted in the subjugation of women, (which also has negative effects on men).  \n\nBut that latter part logically *has to be in parentheses*, becuse taking it out, and treating gender inequality as  justa back and forth between various distinct \"inequalities\" that exist separately from each other, would mean ignoring or downplaying their true source, and eventually subscribing to an \"egalitarian\" denial of the explaining power of traditional gender roles' effect.  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;the incarceration discrepancy is the single most overlooked injustice in America today, and it absolutely disgusts me that there appear to be no movements aimed at correcting this discrepancy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think your problem is that you are looking for people to handle this issue in particular, &lt;em&gt;as it&amp;#39;s own standalone social injustice&lt;/em&gt;, but there are logical reasons why no one is interested in that. &lt;/p&gt;\n\n&lt;p&gt;The gap that you described, has been persistent through most of history, from ancient Rome to Victorian England, and survives in places like present day Saudi Arabia and Iran. &lt;/p&gt;\n\n&lt;p&gt;All of these places could be intuitively and inarguably described as cultures that perpetrate gross social injustice &lt;em&gt;directed at women&lt;/em&gt;, and have structures that are  rooted in women being so oppressed, that they are rarely even given the opportunity to independently commit any crime any more than children are, and when they do they are similarly treated as wards of their fathers and husbands.   &lt;/p&gt;\n\n&lt;p&gt;So how does  this relate to the modern first world? Well, you have two kinds of answers. Certain people would say that it has a lot to do with it, that this history explains our own power structures and lingering gender stereotypes the best. &lt;/p&gt;\n\n&lt;p&gt;Others, (including many of the replies in this thread), would say that it doesn&amp;#39;t, that we have a free society based on individual choice and agency, the past is in the past. Women choose to stay away from STEM, men choose to commit crime, etc, it&amp;#39;s all a result of biology. &lt;/p&gt;\n\n&lt;p&gt;The point is, that &lt;strong&gt;there is no third alternative&lt;/strong&gt;. Between academic feminist theory&amp;#39;s view of patriarchy, and anti-feminist MRA &amp;quot;egalitarians&amp;#39;&amp;quot; view of individual freedom, there is no room for a legitimate academic masculist theory on the &amp;quot;matriarcy&amp;quot;, that explains how male imprisonment was perpetuated specifically on it&amp;#39;s own by an anti-male culture, &lt;em&gt;because it really wasn&amp;#39;t&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;You can look at a historical tradition, or you can look at ad hoc double standards existing in bubbles, and thus explained by &amp;quot;choices&amp;quot;, but not both. &lt;/p&gt;\n\n&lt;p&gt;If you do want to look into the complex sociological basis for how male gender roles came to be, than there is no getting around the fact that they came to be through a brutally woman-oppressing double standard, withing which imprisonment rates were just a minor quirk. And you can&amp;#39;t blame the people who approach social injustice from that angle, for continuing to see it as such. &lt;/p&gt;\n\n&lt;p&gt;Feminism is the movement for gender equality, because gender inequality is rooted in the subjugation of women, (which also has negative effects on men).  &lt;/p&gt;\n\n&lt;p&gt;But that latter part logically &lt;em&gt;has to be in parentheses&lt;/em&gt;, becuse taking it out, and treating gender inequality as  justa back and forth between various distinct &amp;quot;inequalities&amp;quot; that exist separately from each other, would mean ignoring or downplaying their true source, and eventually subscribing to an &amp;quot;egalitarian&amp;quot; denial of the explaining power of traditional gender roles&amp;#39; effect.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8zulh", "score_hidden": false, "stickied": false, "created": 1492195168.0, "created_utc": 1492166368.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9qkns", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dg9qhzg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/dokushin ([1∆](/r/changemyview/wiki/user/dokushin)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"dokushin\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/dokushin\"&gt;/u/dokushin&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/dokushin\"&gt;1∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22dokushin%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9qkns", "score_hidden": false, "stickied": false, "created": 1492232079.0, "created_utc": 1492203279.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg9qhzg", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "grass_type", "parent_id": "t1_dg9q4jn", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "!delta\n\nThat paper is a great read and uses some very solid methodology to prove that a disparity does indeed exist with almost all other aspects of the criminal justice system controlled for.\n\nHowever, I do maintain the following two positions:\n\n1. While Prof. Starr makes a compelling case for women essentially being sentenced ~60% more leniently than men (and often given non-prison sentences in lieu of prison time) that does not change the fact that men are responsible for most violent crime. These two factors - the actual differential in crime rate and the bias in the system vis-a-vis gender - compound one another, but neither negates the other's existence.\n2. While evidently a serious problem in our already-flawed CJS, this is not anywhere near the \"most overlooked\" social injustice in existence today.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;!delta&lt;/p&gt;\n\n&lt;p&gt;That paper is a great read and uses some very solid methodology to prove that a disparity does indeed exist with almost all other aspects of the criminal justice system controlled for.&lt;/p&gt;\n\n&lt;p&gt;However, I do maintain the following two positions:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;While Prof. Starr makes a compelling case for women essentially being sentenced ~60% more leniently than men (and often given non-prison sentences in lieu of prison time) that does not change the fact that men are responsible for most violent crime. These two factors - the actual differential in crime rate and the bias in the system vis-a-vis gender - compound one another, but neither negates the other&amp;#39;s existence.&lt;/li&gt;\n&lt;li&gt;While evidently a serious problem in our already-flawed CJS, this is not anywhere near the &amp;quot;most overlooked&amp;quot; social injustice in existence today.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9qhzg", "score_hidden": false, "stickied": false, "created": 1492231989.0, "created_utc": 1492203189.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9q4jn", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "dokushin", "parent_id": "t1_dg8sdoj", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;  The sentencing is legitimate- unless women are murdering lots of people we don't hear about, the sentencing matches the criminality of men.\n\n[Men receieve more frequent incarceration, and for much longer time periods, than women convicted of the same crime in the same circumstances.](https://www.law.umich.edu/newsandinfo/features/Pages/starr_gender_disparities.aspx)\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The sentencing is legitimate- unless women are murdering lots of people we don&amp;#39;t hear about, the sentencing matches the criminality of men.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.law.umich.edu/newsandinfo/features/Pages/starr_gender_disparities.aspx\"&gt;Men receieve more frequent incarceration, and for much longer time periods, than women convicted of the same crime in the same circumstances.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9q4jn", "score_hidden": false, "stickied": false, "created": 1492231536.0, "created_utc": 1492202736.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8sdoj", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "grass_type", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So, the crux of your argument, or at least your defense of it, seems to be equivocating the \"STEM gap\" and the \"prison gap\", as well as equivocating bias against men in the criminal justice system with bias against african americans. I'm going to address this specifically, because there are a number of good general critiques of your argument by other commenters.\n\n* We can identify the \"legitimate\" cause of imprisonment: men are more likely to commit violent crime - and we can identify the \"ilegitimate\" cause: bias in the judicial system against men.\n* Similarly, we can identify the \"legitimate\" cause of male dominance in STEM: men are supposedly better at it, and the \"ilegitimate\" cause: societal factors discourage women from entering STEM.\n\nNow, as others have said, the statistical evidence is there: 80% violent crimes are done by men. Whether or not you can argue for bias against men (this would be tricky, but I could see a few arguments for it that I could believe), the fact of the matter is that the crime *is there*. The sentencing is legitimate- unless women are murdering lots of people we don't hear about, the sentencing matches the criminality of men. Women just don't do as many violent crimes.\n\nLet's compare this first to the \"STEM gap\" and then to racial profiling in sentencing.\n\n* When women get into STEM, there is no evidence they are inferior at it.\n* On the other hand, there is strong societal evidence - toy marketing is probably the most obvious - that women are far less encouraged to engage in analytical thinking than men at a young age.\n\nThe difference should be clear: the \"legitimate\" cause of the gap is dubious, and the \"ilegitimate\" cause is prominent- the opposite of the case for biased male incarceration.\n\nNow let's look at bias against black people in sentencing, which is itself a large reason why male incarceration is so common: the criminal justice system is, fairly objectively, biased against black men (and black women, but black men most prominently).\n\nThe big one here is drug offenses. Black offenders are something like 5x more likely to be incarcerated for drug possession than white offenders committing the *exact* same offense.\n\nThat discrepancy doesn't exist for men as a whole, though: a man and a woman committing similar crimes will - I believe - receive roughly equal sentences most of the time.\n\ntl;dr- everything suggests that, unlike the situations you have cited as similar, male incarceration is due to male criminality, not bias against men. There is no conceptual argument I see for that bias' existence, and there is immense statistical evidence that men perform most violent crimes. Furthermore, your argument largely ignores the other demographic issues in favor of pushing a male victimization narrative.\n\nIn fact, I'd like to address that, because I firmly believe that men, as a monolithic demographic, are probably the least-victimized group in all of society, with the possible exception of heterosexual white christian men in western countries.\n\n&gt;  It is far more common that they commit crimes due to being forced into horrible situations through no fault of their own, and they see crime as a way out. Drug dealing, gang activity, robbery, etc. are all examples of crimes that are typically associated with desparation rather than deep psychological issues.\n\nI am sorry to be blunt, but this is completely beside the point. Doing a bad thing because bad things happened to you and made you a bad person is not being a victim- under this definition, there is no such thing as criminality.\n\n\"Victimhood\", to the extent that it is a legitimate category and not a rhetorical tool, means something bad happened to you, and by extension your demographic, that you had NO responsibility for. Criminality due to nebulous psychological problems is not that, at all.\n\nFor example: starving because you can't get a job makes you a victim. Mugging someone for food because you're starving makes you a criminal, even if you were a victim beforehand.\n\nCrimes are crimes, no matter who does them. That is one of the most basic ideas of human societies that follow rule of law.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, the crux of your argument, or at least your defense of it, seems to be equivocating the &amp;quot;STEM gap&amp;quot; and the &amp;quot;prison gap&amp;quot;, as well as equivocating bias against men in the criminal justice system with bias against african americans. I&amp;#39;m going to address this specifically, because there are a number of good general critiques of your argument by other commenters.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;We can identify the &amp;quot;legitimate&amp;quot; cause of imprisonment: men are more likely to commit violent crime - and we can identify the &amp;quot;ilegitimate&amp;quot; cause: bias in the judicial system against men.&lt;/li&gt;\n&lt;li&gt;Similarly, we can identify the &amp;quot;legitimate&amp;quot; cause of male dominance in STEM: men are supposedly better at it, and the &amp;quot;ilegitimate&amp;quot; cause: societal factors discourage women from entering STEM.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Now, as others have said, the statistical evidence is there: 80% violent crimes are done by men. Whether or not you can argue for bias against men (this would be tricky, but I could see a few arguments for it that I could believe), the fact of the matter is that the crime &lt;em&gt;is there&lt;/em&gt;. The sentencing is legitimate- unless women are murdering lots of people we don&amp;#39;t hear about, the sentencing matches the criminality of men. Women just don&amp;#39;t do as many violent crimes.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s compare this first to the &amp;quot;STEM gap&amp;quot; and then to racial profiling in sentencing.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;When women get into STEM, there is no evidence they are inferior at it.&lt;/li&gt;\n&lt;li&gt;On the other hand, there is strong societal evidence - toy marketing is probably the most obvious - that women are far less encouraged to engage in analytical thinking than men at a young age.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The difference should be clear: the &amp;quot;legitimate&amp;quot; cause of the gap is dubious, and the &amp;quot;ilegitimate&amp;quot; cause is prominent- the opposite of the case for biased male incarceration.&lt;/p&gt;\n\n&lt;p&gt;Now let&amp;#39;s look at bias against black people in sentencing, which is itself a large reason why male incarceration is so common: the criminal justice system is, fairly objectively, biased against black men (and black women, but black men most prominently).&lt;/p&gt;\n\n&lt;p&gt;The big one here is drug offenses. Black offenders are something like 5x more likely to be incarcerated for drug possession than white offenders committing the &lt;em&gt;exact&lt;/em&gt; same offense.&lt;/p&gt;\n\n&lt;p&gt;That discrepancy doesn&amp;#39;t exist for men as a whole, though: a man and a woman committing similar crimes will - I believe - receive roughly equal sentences most of the time.&lt;/p&gt;\n\n&lt;p&gt;tl;dr- everything suggests that, unlike the situations you have cited as similar, male incarceration is due to male criminality, not bias against men. There is no conceptual argument I see for that bias&amp;#39; existence, and there is immense statistical evidence that men perform most violent crimes. Furthermore, your argument largely ignores the other demographic issues in favor of pushing a male victimization narrative.&lt;/p&gt;\n\n&lt;p&gt;In fact, I&amp;#39;d like to address that, because I firmly believe that men, as a monolithic demographic, are probably the least-victimized group in all of society, with the possible exception of heterosexual white christian men in western countries.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It is far more common that they commit crimes due to being forced into horrible situations through no fault of their own, and they see crime as a way out. Drug dealing, gang activity, robbery, etc. are all examples of crimes that are typically associated with desparation rather than deep psychological issues.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I am sorry to be blunt, but this is completely beside the point. Doing a bad thing because bad things happened to you and made you a bad person is not being a victim- under this definition, there is no such thing as criminality.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Victimhood&amp;quot;, to the extent that it is a legitimate category and not a rhetorical tool, means something bad happened to you, and by extension your demographic, that you had NO responsibility for. Criminality due to nebulous psychological problems is not that, at all.&lt;/p&gt;\n\n&lt;p&gt;For example: starving because you can&amp;#39;t get a job makes you a victim. Mugging someone for food because you&amp;#39;re starving makes you a criminal, even if you were a victim beforehand.&lt;/p&gt;\n\n&lt;p&gt;Crimes are crimes, no matter who does them. That is one of the most basic ideas of human societies that follow rule of law.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8sdoj", "score_hidden": false, "stickied": false, "created": 1492174871.0, "created_utc": 1492146071.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8nhxu", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg8nc95", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Ok I don't think we're on the same page here.  Let me ask you a few questions that I think will help me understand you better.\n\n1.  Do you believe that the fact that there are more male CEOs is evidence of sexism in society?\n\n2.  Do you believe that the fact that women are more likely to gain custody of children even when the man fights for custody is evidence of sexism in society?\n\n3.  If you do not believe that one or both of these situations are evidence of sexism, then what do you believe the cause is?\n\n4.  If you DO believe that one or both of these situations are evidence of sexism, then do you see that as a problem that society should try to fix?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok I don&amp;#39;t think we&amp;#39;re on the same page here.  Let me ask you a few questions that I think will help me understand you better.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Do you believe that the fact that there are more male CEOs is evidence of sexism in society?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Do you believe that the fact that women are more likely to gain custody of children even when the man fights for custody is evidence of sexism in society?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If you do not believe that one or both of these situations are evidence of sexism, then what do you believe the cause is?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If you DO believe that one or both of these situations are evidence of sexism, then do you see that as a problem that society should try to fix?&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8nhxu", "score_hidden": false, "stickied": false, "created": 1492166913.0, "created_utc": 1492138113.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8nc95", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "FiveofSwords", "parent_id": "t1_dg8n18a", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "well you havent figured out the reason why women are incarcerated more or go in stem fields more. You simply decided it must be injustice. Your only reason for thinking that is the different incarceration rates. The same logic would make us punish gold medal winners.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;well you havent figured out the reason why women are incarcerated more or go in stem fields more. You simply decided it must be injustice. Your only reason for thinking that is the different incarceration rates. The same logic would make us punish gold medal winners.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8nc95", "score_hidden": false, "stickied": false, "created": 1492166686.0, "created_utc": 1492137886.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8n18a", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg8mvqr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; then maybe there is a NON obvious reason.\n\nYes, and maybe there isn't.  Maybe men are simply better than women at STEM.  Maybe women feel intimidated by sexism in STEM.  Maybe aliens come down every night and whisper in womens' ears that bad things will happen if they go into STEM.\n\nMy point is that we need to discover *why* things are the way they are before we can say with certainty that they are the way they should be.  Maybe women really are terrible at STEM.  In that case, it's totally fine that there are more men than women.  But maybe women do face a lot of sexism in STEM.  In that case, it is NOT fine that there are more men than women.  \n\nI'm saying that people tend to just assume that it's totally fine that there are more men in prison than there are women.  And I am saying that I do not agree with that assumption.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;then maybe there is a NON obvious reason.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, and maybe there isn&amp;#39;t.  Maybe men are simply better than women at STEM.  Maybe women feel intimidated by sexism in STEM.  Maybe aliens come down every night and whisper in womens&amp;#39; ears that bad things will happen if they go into STEM.&lt;/p&gt;\n\n&lt;p&gt;My point is that we need to discover &lt;em&gt;why&lt;/em&gt; things are the way they are before we can say with certainty that they are the way they should be.  Maybe women really are terrible at STEM.  In that case, it&amp;#39;s totally fine that there are more men than women.  But maybe women do face a lot of sexism in STEM.  In that case, it is NOT fine that there are more men than women.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m saying that people tend to just assume that it&amp;#39;s totally fine that there are more men in prison than there are women.  And I am saying that I do not agree with that assumption.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8n18a", "score_hidden": false, "stickied": false, "created": 1492166249.0, "created_utc": 1492137449.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mvqr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FiveofSwords", "parent_id": "t1_dg8mr19", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "\" For example, there is no obvious reason for why women should choose to turn away from STEM fields more than men do\"\n\nthen maybe there is a NON obvious reason. thats my point. You do not know the reason for all things.\n\nMaybe the only way you can imagine that one athlete ran faster than another is because they cheated. Well, that means you have a limited imagination. Unless you have evidence that they cheated your theory is useless.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot; For example, there is no obvious reason for why women should choose to turn away from STEM fields more than men do&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;then maybe there is a NON obvious reason. thats my point. You do not know the reason for all things.&lt;/p&gt;\n\n&lt;p&gt;Maybe the only way you can imagine that one athlete ran faster than another is because they cheated. Well, that means you have a limited imagination. Unless you have evidence that they cheated your theory is useless.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8mvqr", "score_hidden": false, "stickied": false, "created": 1492166024.0, "created_utc": 1492137224.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mr19", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg8mdrf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "That's what I meant when I said \"for no good reason\".  In the olympics, there are good reasons.  Namely, there is an objective measure that someone ran faster than the other so they deserve the gold medal.\n\nHowever, quite often there is not a good reason for a discrepancy.  For example, there is no obvious reason for why women should choose to turn away from STEM fields more than men do.  So we tend to try and address this discrepancy by uncovering the source.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what I meant when I said &amp;quot;for no good reason&amp;quot;.  In the olympics, there are good reasons.  Namely, there is an objective measure that someone ran faster than the other so they deserve the gold medal.&lt;/p&gt;\n\n&lt;p&gt;However, quite often there is not a good reason for a discrepancy.  For example, there is no obvious reason for why women should choose to turn away from STEM fields more than men do.  So we tend to try and address this discrepancy by uncovering the source.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8mr19", "score_hidden": false, "stickied": false, "created": 1492165830.0, "created_utc": 1492137030.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mdrf", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "FiveofSwords", "parent_id": "t1_dg8ma85", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Having different outcomes is by itself in no way evidence of oppression or unfair treatment. If you really believed that, you would need to punish gold medal winners in the olympics for oppressing the other contestants.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having different outcomes is by itself in no way evidence of oppression or unfair treatment. If you really believed that, you would need to punish gold medal winners in the olympics for oppressing the other contestants.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8mdrf", "score_hidden": false, "stickied": false, "created": 1492165295.0, "created_utc": 1492136495.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ma85", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg8m628", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm sorry, you'll have to clarify because I really don't understand what your point is or how it relates to my post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry, you&amp;#39;ll have to clarify because I really don&amp;#39;t understand what your point is or how it relates to my post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8ma85", "score_hidden": false, "stickied": false, "created": 1492165158.0, "created_utc": 1492136358.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8m628", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "FiveofSwords", "parent_id": "t1_dg8m1bh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "slavery is evidence of slavery.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;slavery is evidence of slavery.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8m628", "score_hidden": false, "stickied": false, "created": 1492165002.0, "created_utc": 1492136202.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8m1bh", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Rockmar1", "parent_id": "t1_dg8lw4a", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "Are you claiming that all discrepancies that have ever existed were justified?  I'm not sure what your point is.  If that's really your point, then I don't even know where to begin... Was slavery justified?  That was a pretty big discrepancy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you claiming that all discrepancies that have ever existed were justified?  I&amp;#39;m not sure what your point is.  If that&amp;#39;s really your point, then I don&amp;#39;t even know where to begin... Was slavery justified?  That was a pretty big discrepancy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8m1bh", "score_hidden": false, "stickied": false, "created": 1492164825.0, "created_utc": 1492136025.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8lw4a", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "FiveofSwords", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "\"Most social injustices in the world today manifest themselves as a discrepancy between two groups when there is no real reason for that discrepancy to exist. \"\n\nThis is fine as long as you actually know the cause of all things in the universe. Otherwise, an observed discrepancy between groups is evidence that a discrepancy does exist. You dont need to understand why.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Most social injustices in the world today manifest themselves as a discrepancy between two groups when there is no real reason for that discrepancy to exist. &amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This is fine as long as you actually know the cause of all things in the universe. Otherwise, an observed discrepancy between groups is evidence that a discrepancy does exist. You dont need to understand why.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8lw4a", "score_hidden": false, "stickied": false, "created": 1492164628.0, "created_utc": 1492135828.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg928th", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "ExploreMeDora", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "If you were to say that the mass incarceration of African American men is a social issue I would agree. But if you were to say that it has been completely overlooked and misunderstood I would disagree. \n\n\nMass incarceration is seen as a big problem in America and there have been lots of discussion and articles about it. **America has the highest prison population of all the industrialized countries despite having dropping crime rates.** Perhaps you just weren't privy to this. However, it is largely understood by the criminal justice community and by the sociology community. We are upset that the government and police are not doing anything about this. While they are to blame, the issue actually lies largely within the public sphere as well, particularly thanks to white Americans.\n\n\nCrime is seen as a social issue, without a doubt. The social workers who are meant to correct this issue are the government and people on the ground such as police, who are making the arrests. Despite the fact that [crime rates have been dropping](https://c24215cec6c97b637db6-9c0895f07c3474f6636f95b6bf3db172.ssl.cf1.rackcdn.com/interactives/2014/ten-economic-facts-about-crime/assets/crimefig1.png) American's still have the impression that [crime rates are on the rise](http://content.gallup.com/origin/gallupinc/GallupSpaces/Production/Cms/POLL/_aofmj0eh0yfrcsddxpmtq.gif). The American people have a polarizing fear of crime, particularly street level crime. We are confronted with horrific stories of crime in the news and the media constantly. The media follows the narrative that street level crime is a terrible burden of America and that nobody is safe. In fact, as crime rates drop, media reporting about crime increases. This draws the greatest ratings, because American people have a vested interest in crime reporting. The media constantly paints the criminal as the problem. **The social issue is not mass incarceration, or the failure of public education, or racial inequality - the problem is the criminal.** This is the narrative that the media reports and this is what we want to see because it is the easiest pill to swallow. Out of this grows a moral panic and a desire for aggressive police tactics. **This is an attitude particularly favorable for white Americans, who see black men as the perpetrator of all crime, thanks to media focus.** We turn a blind eye to corporate crime although it occurs very frequently and causes far more financial harm to far more people, because shows like Cops that depict black drug users being thrown to the ground is far more riveting TV than a white man in a suit surrendering to police when his Ponzi scheme is discovered. \n\n**People fear that by acknowledging that social structures create these criminals it would lend credence to reform, which will put them in danger of these criminals.** The media is aware of this and does not want to challenge that perspective or their ratings will drop. Furthermore, politicians are aware of this and appearing \"tough on crime\" is what people want to hear to earn their vote. You won't get very far in a campaign by appearing soft on crime. **Clearly, these high incarceration rates are not the result of increasing crime rates, but a result of public reaction and the government's horrible response to this moral panic.**\n\n**The moral panic that grows out of this puts pressure on the government and police to provide a fast solution to this issue of street level crime. That solution is \"lock-em-up and throw away the key.\" And who is the greatest victim of that? Well, black men of course - because they are the ones the media paints as the scariest criminal of them all.** You cannot understand mass incarceration without understanding the war on drugs. This was a response to American's fears about drug use and once again the governments horrible response to it. The prison population is made up largely by [drug offenders](https://www.bop.gov/about/statistics/statistics_inmate_offenses.jsp). Specifically, black drug offenders. However, [although black's and whites are committing drug offenses at around the same rate, blacks are incarcerated at a MUCH higher rate] (https://www.psychologytoday.com/files/u712/prison4.jpg). This can be explained by racial bias constructed by the media. Laws like mandatory minimums and three strikes laws keep these prison populations booming as the government and police do their job in protecting white Americans by racially profiling, stopping and frisking black men, using excessive force, and hauling in as many black men as they can. Although this is met with resistance by people who fear that rights are being violated (most of these stops are unwarranted harassment and don't result in an arrest because no crime was committed) there is just as much pressure for police to by hard on crime by white Americans who are afraid of crime. At the end of the day, this government and America in general are owned by Whites, so who do you think will win this one?\n\nIn conclusion, the issue of mass incarceration is discussed and is known. We even understand what causes it. However, because of conflicting pressures from whites and non-whites police and the government have had issues handling the problem.", "edited": 1492172835.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you were to say that the mass incarceration of African American men is a social issue I would agree. But if you were to say that it has been completely overlooked and misunderstood I would disagree. &lt;/p&gt;\n\n&lt;p&gt;Mass incarceration is seen as a big problem in America and there have been lots of discussion and articles about it. &lt;strong&gt;America has the highest prison population of all the industrialized countries despite having dropping crime rates.&lt;/strong&gt; Perhaps you just weren&amp;#39;t privy to this. However, it is largely understood by the criminal justice community and by the sociology community. We are upset that the government and police are not doing anything about this. While they are to blame, the issue actually lies largely within the public sphere as well, particularly thanks to white Americans.&lt;/p&gt;\n\n&lt;p&gt;Crime is seen as a social issue, without a doubt. The social workers who are meant to correct this issue are the government and people on the ground such as police, who are making the arrests. Despite the fact that &lt;a href=\"https://c24215cec6c97b637db6-9c0895f07c3474f6636f95b6bf3db172.ssl.cf1.rackcdn.com/interactives/2014/ten-economic-facts-about-crime/assets/crimefig1.png\"&gt;crime rates have been dropping&lt;/a&gt; American&amp;#39;s still have the impression that &lt;a href=\"http://content.gallup.com/origin/gallupinc/GallupSpaces/Production/Cms/POLL/_aofmj0eh0yfrcsddxpmtq.gif\"&gt;crime rates are on the rise&lt;/a&gt;. The American people have a polarizing fear of crime, particularly street level crime. We are confronted with horrific stories of crime in the news and the media constantly. The media follows the narrative that street level crime is a terrible burden of America and that nobody is safe. In fact, as crime rates drop, media reporting about crime increases. This draws the greatest ratings, because American people have a vested interest in crime reporting. The media constantly paints the criminal as the problem. &lt;strong&gt;The social issue is not mass incarceration, or the failure of public education, or racial inequality - the problem is the criminal.&lt;/strong&gt; This is the narrative that the media reports and this is what we want to see because it is the easiest pill to swallow. Out of this grows a moral panic and a desire for aggressive police tactics. &lt;strong&gt;This is an attitude particularly favorable for white Americans, who see black men as the perpetrator of all crime, thanks to media focus.&lt;/strong&gt; We turn a blind eye to corporate crime although it occurs very frequently and causes far more financial harm to far more people, because shows like Cops that depict black drug users being thrown to the ground is far more riveting TV than a white man in a suit surrendering to police when his Ponzi scheme is discovered. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;People fear that by acknowledging that social structures create these criminals it would lend credence to reform, which will put them in danger of these criminals.&lt;/strong&gt; The media is aware of this and does not want to challenge that perspective or their ratings will drop. Furthermore, politicians are aware of this and appearing &amp;quot;tough on crime&amp;quot; is what people want to hear to earn their vote. You won&amp;#39;t get very far in a campaign by appearing soft on crime. &lt;strong&gt;Clearly, these high incarceration rates are not the result of increasing crime rates, but a result of public reaction and the government&amp;#39;s horrible response to this moral panic.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The moral panic that grows out of this puts pressure on the government and police to provide a fast solution to this issue of street level crime. That solution is &amp;quot;lock-em-up and throw away the key.&amp;quot; And who is the greatest victim of that? Well, black men of course - because they are the ones the media paints as the scariest criminal of them all.&lt;/strong&gt; You cannot understand mass incarceration without understanding the war on drugs. This was a response to American&amp;#39;s fears about drug use and once again the governments horrible response to it. The prison population is made up largely by &lt;a href=\"https://www.bop.gov/about/statistics/statistics_inmate_offenses.jsp\"&gt;drug offenders&lt;/a&gt;. Specifically, black drug offenders. However, &lt;a href=\"https://www.psychologytoday.com/files/u712/prison4.jpg\"&gt;although black&amp;#39;s and whites are committing drug offenses at around the same rate, blacks are incarcerated at a MUCH higher rate&lt;/a&gt;. This can be explained by racial bias constructed by the media. Laws like mandatory minimums and three strikes laws keep these prison populations booming as the government and police do their job in protecting white Americans by racially profiling, stopping and frisking black men, using excessive force, and hauling in as many black men as they can. Although this is met with resistance by people who fear that rights are being violated (most of these stops are unwarranted harassment and don&amp;#39;t result in an arrest because no crime was committed) there is just as much pressure for police to by hard on crime by white Americans who are afraid of crime. At the end of the day, this government and America in general are owned by Whites, so who do you think will win this one?&lt;/p&gt;\n\n&lt;p&gt;In conclusion, the issue of mass incarceration is discussed and is known. We even understand what causes it. However, because of conflicting pressures from whites and non-whites police and the government have had issues handling the problem.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg928th", "score_hidden": false, "stickied": false, "created": 1492201286.0, "created_utc": 1492172486.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8y27l", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "Stokkolm", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; I believe that in a society in which men and women are seen as equals and are treated with equality\n\nMen and women are not seen as equals, nor will they ever be. You might be misunderstanding the struggle for gender equality, which is about equality of opportunity and equality of treatment in the face of the law, not about denying there is sexual dimorphism in humans. The people who say men and women are the same are in the minority and they are ignoring the scientific knowledge.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I believe that in a society in which men and women are seen as equals and are treated with equality&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Men and women are not seen as equals, nor will they ever be. You might be misunderstanding the struggle for gender equality, which is about equality of opportunity and equality of treatment in the face of the law, not about denying there is sexual dimorphism in humans. The people who say men and women are the same are in the minority and they are ignoring the scientific knowledge.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8y27l", "score_hidden": false, "stickied": false, "created": 1492189345.0, "created_utc": 1492160545.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg959cr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "themcos", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; According to wikipedia there were \"111,300 adult females in state and federal prisons\" and \"1,463,500 adult males in state and federal prisons\". That is over 13x as many men in prison as there are women.\n\nAnother way of phrasing these numbers is that 92% of the state and federal prison population is men. In light of this, I challenge your assertion that this problem is \"overlooked\" as a social justice issue. The united states massive prison population is a problem that is commonly [discussed by members across the political spectrum](https://www.washingtonpost.com/news/fact-checker/wp/2015/04/30/does-the-united-states-really-have-five-percent-of-worlds-population-and-one-quarter-of-the-worlds-prisoners/?utm_term=.e802cf6848e0). The focus isn't always on the gender gap, but the impact of this is commonly discussed. \n\nAnd the way the conversation is framed is necessarily going to be different than say, something like the STEM gap, due to the nature of prison versus STEM jobs. STEM jobs are something desirable, prison obviously isn't. So for STEM jobs, the focus of the discussion is around the minority who we want to get more of something, while for prison populations, the discussion is around the majority who we want to have less of something (given that we already have such a disproportionate prison population, presumably the solution in general here is to incarcerate fewer men, not more women). But given that the majority population is the one impacted, its feels unnecessary to explicitly frame it that way. When men are 92% of the prison population, the phrases \"we have an incarceration problem\" and \"we have a male incarceration problem\" are basically redundant. In most contexts, they're saying the exact same thing, and is widely acknowledged as a problem.\n\nBut getting a bit broader, as I don't think you're just talking about actual incarceration rates. In terms of men's apparent proclivity towards crime and violence, this is also a widely discussed issue. A google search of \"are men more violent than women\" will yield a ton of articles and studies examining the causes of this. I don't know if its in the scope of this CMV to debate any particular theory, but they range from biological / evolutionary causes to social discussions of gender roles and power dynamics.\n\nTo summarize, people have extensively discussed why in practice men seem prone to violence and crime (both from a biological and a social standpoint), and the end result of this (high incarceration rates), is widely considered a national embarrassment. So when you say this is \"overlooked\", what do you mean by that? You say at the end of your post:\n\n&gt;  it absolutely disgusts me that there appear to be no movements aimed at correcting this discrepancy\n\nCould you describe in more detail what specific type of \"movements\" you want to see, if not protest against our prison system in general or movements about deconstructing gender roles (often aligned with feminism)? Are there policy changes you're advocating for? Are there studies you think we should be doing that we haven't done?", "edited": 1492177918.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;According to wikipedia there were &amp;quot;111,300 adult females in state and federal prisons&amp;quot; and &amp;quot;1,463,500 adult males in state and federal prisons&amp;quot;. That is over 13x as many men in prison as there are women.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Another way of phrasing these numbers is that 92% of the state and federal prison population is men. In light of this, I challenge your assertion that this problem is &amp;quot;overlooked&amp;quot; as a social justice issue. The united states massive prison population is a problem that is commonly &lt;a href=\"https://www.washingtonpost.com/news/fact-checker/wp/2015/04/30/does-the-united-states-really-have-five-percent-of-worlds-population-and-one-quarter-of-the-worlds-prisoners/?utm_term=.e802cf6848e0\"&gt;discussed by members across the political spectrum&lt;/a&gt;. The focus isn&amp;#39;t always on the gender gap, but the impact of this is commonly discussed. &lt;/p&gt;\n\n&lt;p&gt;And the way the conversation is framed is necessarily going to be different than say, something like the STEM gap, due to the nature of prison versus STEM jobs. STEM jobs are something desirable, prison obviously isn&amp;#39;t. So for STEM jobs, the focus of the discussion is around the minority who we want to get more of something, while for prison populations, the discussion is around the majority who we want to have less of something (given that we already have such a disproportionate prison population, presumably the solution in general here is to incarcerate fewer men, not more women). But given that the majority population is the one impacted, its feels unnecessary to explicitly frame it that way. When men are 92% of the prison population, the phrases &amp;quot;we have an incarceration problem&amp;quot; and &amp;quot;we have a male incarceration problem&amp;quot; are basically redundant. In most contexts, they&amp;#39;re saying the exact same thing, and is widely acknowledged as a problem.&lt;/p&gt;\n\n&lt;p&gt;But getting a bit broader, as I don&amp;#39;t think you&amp;#39;re just talking about actual incarceration rates. In terms of men&amp;#39;s apparent proclivity towards crime and violence, this is also a widely discussed issue. A google search of &amp;quot;are men more violent than women&amp;quot; will yield a ton of articles and studies examining the causes of this. I don&amp;#39;t know if its in the scope of this CMV to debate any particular theory, but they range from biological / evolutionary causes to social discussions of gender roles and power dynamics.&lt;/p&gt;\n\n&lt;p&gt;To summarize, people have extensively discussed why in practice men seem prone to violence and crime (both from a biological and a social standpoint), and the end result of this (high incarceration rates), is widely considered a national embarrassment. So when you say this is &amp;quot;overlooked&amp;quot;, what do you mean by that? You say at the end of your post:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;it absolutely disgusts me that there appear to be no movements aimed at correcting this discrepancy&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Could you describe in more detail what specific type of &amp;quot;movements&amp;quot; you want to see, if not protest against our prison system in general or movements about deconstructing gender roles (often aligned with feminism)? Are there policy changes you&amp;#39;re advocating for? Are there studies you think we should be doing that we haven&amp;#39;t done?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg959cr", "score_hidden": false, "stickied": false, "created": 1492206476.0, "created_utc": 1492177676.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg9cc9q", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AmoebaMan", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;I believe that in a society in which men and women are seen as equals and are treated as equals, you would see more equal levels of incarceration between men and women.\n\nForgive me if I slightly misquote you, I can't copy the text directly on mobile.\n\nI think this is the part where your argument collapses. A society in which men and women are seen as equals is deluding itself.\n\nThis is not to say that men and women deserve different rights or opportunities; they absolutely do. But based on every scrap of evidence available, men and women think and act differently on fundamental levels. And part of this is that men are much more inclined towards physical violence than women.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I believe that in a society in which men and women are seen as equals and are treated as equals, you would see more equal levels of incarceration between men and women.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Forgive me if I slightly misquote you, I can&amp;#39;t copy the text directly on mobile.&lt;/p&gt;\n\n&lt;p&gt;I think this is the part where your argument collapses. A society in which men and women are seen as equals is deluding itself.&lt;/p&gt;\n\n&lt;p&gt;This is not to say that men and women deserve different rights or opportunities; they absolutely do. But based on every scrap of evidence available, men and women think and act differently on fundamental levels. And part of this is that men are much more inclined towards physical violence than women.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9cc9q", "score_hidden": false, "stickied": false, "created": 1492215317.0, "created_utc": 1492186517.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg98cti", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "VortexMagus", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The sentencing gap, in my opinion, is a big deal. Men and women, given equal crimes and equal history, are given different sentences. THAT is a huge problem because it suggests that men and women are treated differently for the exact same things.\n\n---\n\nThe gap between incarceration numbers is not, because it just means that men are more likely to be caught in process or aftermath of doing a crime. That's a completely different root issue, in that men are more likely to be criminals, and in my opinion social justice is the most likely means to prevent or mitigate this. \n\nBy addressing socioeconomic inequality, homelessness, hunger, and other things that cause low and inadequate quality of life, we can make it less likely that ANY crime will take place, and therefore disproportionately benefit men who are the ones most likely to be criminal in the first place.\n\nThis involves investing better into social safety nets, improving the education system, offering job retraining to workers laid off, and giving people in low-income households and neighborhoods other, more attractive options for their life, aside from criminal activity and joining a gang. It also means giving more funding to Child Protective Services, improving our foster care system, and otherwise giving children in bad places better opportunities. It also means dealing with systematic racial inequality on multiple levels of society.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The sentencing gap, in my opinion, is a big deal. Men and women, given equal crimes and equal history, are given different sentences. THAT is a huge problem because it suggests that men and women are treated differently for the exact same things.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The gap between incarceration numbers is not, because it just means that men are more likely to be caught in process or aftermath of doing a crime. That&amp;#39;s a completely different root issue, in that men are more likely to be criminals, and in my opinion social justice is the most likely means to prevent or mitigate this. &lt;/p&gt;\n\n&lt;p&gt;By addressing socioeconomic inequality, homelessness, hunger, and other things that cause low and inadequate quality of life, we can make it less likely that ANY crime will take place, and therefore disproportionately benefit men who are the ones most likely to be criminal in the first place.&lt;/p&gt;\n\n&lt;p&gt;This involves investing better into social safety nets, improving the education system, offering job retraining to workers laid off, and giving people in low-income households and neighborhoods other, more attractive options for their life, aside from criminal activity and joining a gang. It also means giving more funding to Child Protective Services, improving our foster care system, and otherwise giving children in bad places better opportunities. It also means dealing with systematic racial inequality on multiple levels of society.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg98cti", "score_hidden": false, "stickied": false, "created": 1492210649.0, "created_utc": 1492181849.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg8pvxs", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "just_lesbian_things", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The issue you're talking about generally falls under toxic masculinity. Violent and sociopathic behavior (rough housing, physical bullying, sexual harassment) from men and boys are passed off as typical and expected and empathy and kindness is perceived as weak. Boys who do not exhibit those behaviors are told to \"man up\". Men are socialized to feel entitled to certain things, whether it's economic success or romantic relationships. They blame and lash out at people when reality falls short of the expectation they've been socialized for. It's quite unfortunate. Attempts to address this have been labelled by the general public as misandry, \"war on boys\", and \"cuckoldry\". It's not being overlooked by \"social justice\", it's being rejected by men. Men don't want to correct their behavior because they've been socialized to defend their masculinity. It's a vicious cycle. The more we try to address it, the angrier and more defensive men get, so most feminists decide to focus on helping women and empowering women instead. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The issue you&amp;#39;re talking about generally falls under toxic masculinity. Violent and sociopathic behavior (rough housing, physical bullying, sexual harassment) from men and boys are passed off as typical and expected and empathy and kindness is perceived as weak. Boys who do not exhibit those behaviors are told to &amp;quot;man up&amp;quot;. Men are socialized to feel entitled to certain things, whether it&amp;#39;s economic success or romantic relationships. They blame and lash out at people when reality falls short of the expectation they&amp;#39;ve been socialized for. It&amp;#39;s quite unfortunate. Attempts to address this have been labelled by the general public as misandry, &amp;quot;war on boys&amp;quot;, and &amp;quot;cuckoldry&amp;quot;. It&amp;#39;s not being overlooked by &amp;quot;social justice&amp;quot;, it&amp;#39;s being rejected by men. Men don&amp;#39;t want to correct their behavior because they&amp;#39;ve been socialized to defend their masculinity. It&amp;#39;s a vicious cycle. The more we try to address it, the angrier and more defensive men get, so most feminists decide to focus on helping women and empowering women instead. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8pvxs", "score_hidden": false, "stickied": false, "created": 1492170585.0, "created_utc": 1492141785.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9a567", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jesse0", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; It is my firm belief that men are incarcerated at higher rates not due to some violent nature inherent to men, but rather due to a combination of social and economic pressures that drive men towards committing crime.\n\nAt this point, you would have to begin listing your evidence for this belief, in order to persuade a disinterested person that your opinion is a valid candidate for the truth. You haven't presented any evidence, so there's not much anyone can do to C your V.\n\nIf this is something you really want to put out there,  better hit the field with your social work!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It is my firm belief that men are incarcerated at higher rates not due to some violent nature inherent to men, but rather due to a combination of social and economic pressures that drive men towards committing crime.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;At this point, you would have to begin listing your evidence for this belief, in order to persuade a disinterested person that your opinion is a valid candidate for the truth. You haven&amp;#39;t presented any evidence, so there&amp;#39;s not much anyone can do to C your V.&lt;/p&gt;\n\n&lt;p&gt;If this is something you really want to put out there,  better hit the field with your social work!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9a567", "score_hidden": false, "stickied": false, "created": 1492212819.0, "created_utc": 1492184019.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dga15mn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Springbks7", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "While there are disparities in sentencing for men vs. women for similar crimes, I think your point is misguided.\n\nFirst off, do you know anyone that works in criminal justice reform or has studied criminal justice? The U.S. has a huge incarcerated population, and this is for a variety of reasons including an aggressive war on drugs and minimum sentencing, as well as treating criminals as people to be shut away rather than reformed. This is a huge, recurring topic in all manner of political discussion and circles. Ask anyone in criminal justice or working in law\\enforcement but especially justice reform and they can speak to you about this.\n\nIf you are however referencing that far more men are jailed than women, that's consistent with the rates at which men commit crime, especially violent crime. Before we sidetrack or this gets turned into a \"if you use race as an example that would be racist!\" this is not necessarily the case for all crimes and race, like drug use for example, which is equal across racial lines, but for which minorities are much more likely to be incarcerated for.\n\nNow, while I mentioned that women will be more likely to not be convicted or with lesser sentences for the same crimes like whites will be vs. minorities, the discrepancies in conviction there are not large enough to match discrepancies in crimes committed. The reason why more men are arrested, imprisoned, etc. are because men commit more crimes across all levels of society (race, location, income, area, etc.).\n\nSo what your argument should be rather than simply this existing discrepancy being a huge social justice issue, is not that these arrests (especially for violent crime) are somehow unjust, though of course for individual cases this may be the case.\n\nWhat you should be asking about is what about society and the way we view men/masculinity should we change so that these violent, illegal tendencies are no longer present or at least limited? What can we do about poverty to change the options or access people have in relation to crime?\n\nThe main thing I would take away from this is not that most of these people in jail are in jail because they are men, which is why it's not exactly an issue of systemic gender oppression. Unlike drug use for example, my previous point, men are not targeted for some of these crimes by police instead of women like minorities are targeted more often than whites. There aren't much more levels of violent crime committed by women that we don't know about compared to violent crimes by men. And yes some are innocent, and that's a fault of the justice system, and some females are free that shouldn't be, but that's also an issue for the justice system.\n\nIt's not the best analogy but men being in prison to me is more like women being discouraged from / not interested in STEM or male students from studying abroad rather than biology or innate brain chemistry. I'm not a biologist or a neuroscientist or psychologist so I can't in full authority comment on that. I think biology and brain chemistry plays a role though, bonobos and chimpanzees make an interesting comparison between male and female dominated societies in the primate world. Like I said I can't comment that much about it, but brain chemistry is really important. Anyone that is really hungry or sleep deprived may act like a different person from who they normally are and that can be due to something as simple as a drop in blood sugar levels. Of course being hangry and committing crimes can't be compared, but while I think it can have an effect, it's not fate. Therapy can help with anger management, depression, anxiety, etc.\n\nDo we need to change certain things about the justice system? Absolutely. Does it the into fighting poverty and other issues in society? Absolutely. If men commit more crimes and violent crimes than women, do we need to reevaluate how to change those behaviors in society? I think so. \n\nDo I think justice system issues are one of the worst things about America that need changing? I do. But I don't know if it outranks medical access / care as the most in need of improvement. That's just a personal thing for me, and of course it's subjective.\n\nApologies for any syntax or spelling errors, I'm typing this on my Kindle. I hope eve of we disagree we can politely discuss :)", "edited": 1492217699.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While there are disparities in sentencing for men vs. women for similar crimes, I think your point is misguided.&lt;/p&gt;\n\n&lt;p&gt;First off, do you know anyone that works in criminal justice reform or has studied criminal justice? The U.S. has a huge incarcerated population, and this is for a variety of reasons including an aggressive war on drugs and minimum sentencing, as well as treating criminals as people to be shut away rather than reformed. This is a huge, recurring topic in all manner of political discussion and circles. Ask anyone in criminal justice or working in law\\enforcement but especially justice reform and they can speak to you about this.&lt;/p&gt;\n\n&lt;p&gt;If you are however referencing that far more men are jailed than women, that&amp;#39;s consistent with the rates at which men commit crime, especially violent crime. Before we sidetrack or this gets turned into a &amp;quot;if you use race as an example that would be racist!&amp;quot; this is not necessarily the case for all crimes and race, like drug use for example, which is equal across racial lines, but for which minorities are much more likely to be incarcerated for.&lt;/p&gt;\n\n&lt;p&gt;Now, while I mentioned that women will be more likely to not be convicted or with lesser sentences for the same crimes like whites will be vs. minorities, the discrepancies in conviction there are not large enough to match discrepancies in crimes committed. The reason why more men are arrested, imprisoned, etc. are because men commit more crimes across all levels of society (race, location, income, area, etc.).&lt;/p&gt;\n\n&lt;p&gt;So what your argument should be rather than simply this existing discrepancy being a huge social justice issue, is not that these arrests (especially for violent crime) are somehow unjust, though of course for individual cases this may be the case.&lt;/p&gt;\n\n&lt;p&gt;What you should be asking about is what about society and the way we view men/masculinity should we change so that these violent, illegal tendencies are no longer present or at least limited? What can we do about poverty to change the options or access people have in relation to crime?&lt;/p&gt;\n\n&lt;p&gt;The main thing I would take away from this is not that most of these people in jail are in jail because they are men, which is why it&amp;#39;s not exactly an issue of systemic gender oppression. Unlike drug use for example, my previous point, men are not targeted for some of these crimes by police instead of women like minorities are targeted more often than whites. There aren&amp;#39;t much more levels of violent crime committed by women that we don&amp;#39;t know about compared to violent crimes by men. And yes some are innocent, and that&amp;#39;s a fault of the justice system, and some females are free that shouldn&amp;#39;t be, but that&amp;#39;s also an issue for the justice system.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not the best analogy but men being in prison to me is more like women being discouraged from / not interested in STEM or male students from studying abroad rather than biology or innate brain chemistry. I&amp;#39;m not a biologist or a neuroscientist or psychologist so I can&amp;#39;t in full authority comment on that. I think biology and brain chemistry plays a role though, bonobos and chimpanzees make an interesting comparison between male and female dominated societies in the primate world. Like I said I can&amp;#39;t comment that much about it, but brain chemistry is really important. Anyone that is really hungry or sleep deprived may act like a different person from who they normally are and that can be due to something as simple as a drop in blood sugar levels. Of course being hangry and committing crimes can&amp;#39;t be compared, but while I think it can have an effect, it&amp;#39;s not fate. Therapy can help with anger management, depression, anxiety, etc.&lt;/p&gt;\n\n&lt;p&gt;Do we need to change certain things about the justice system? Absolutely. Does it the into fighting poverty and other issues in society? Absolutely. If men commit more crimes and violent crimes than women, do we need to reevaluate how to change those behaviors in society? I think so. &lt;/p&gt;\n\n&lt;p&gt;Do I think justice system issues are one of the worst things about America that need changing? I do. But I don&amp;#39;t know if it outranks medical access / care as the most in need of improvement. That&amp;#39;s just a personal thing for me, and of course it&amp;#39;s subjective.&lt;/p&gt;\n\n&lt;p&gt;Apologies for any syntax or spelling errors, I&amp;#39;m typing this on my Kindle. I hope eve of we disagree we can politely discuss :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dga15mn", "score_hidden": false, "stickied": false, "created": 1492245984.0, "created_utc": 1492217184.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9da0l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thanden", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I don't think the fact that there are more men than women in prisons is evidence of a problem - that's simply because men commit more violent crimes than women. But there is also evidence that a man who commits the same crime as a woman, in the same circumstances, will tend to receive a significantly longer sentence - that I agree is a problem.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think the fact that there are more men than women in prisons is evidence of a problem - that&amp;#39;s simply because men commit more violent crimes than women. But there is also evidence that a man who commits the same crime as a woman, in the same circumstances, will tend to receive a significantly longer sentence - that I agree is a problem.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9da0l", "score_hidden": false, "stickied": false, "created": 1492216353.0, "created_utc": 1492187553.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg99qgg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gqcwwjtg", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The disproportionate number of incarcerated men can be explained with two facts: men tend to commit more violent crimes, and men tend to receive longer sentences. The latter is an inequality of opportunity, the former is just an inequality. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The disproportionate number of incarcerated men can be explained with two facts: men tend to commit more violent crimes, and men tend to receive longer sentences. The latter is an inequality of opportunity, the former is just an inequality. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg99qgg", "score_hidden": false, "stickied": false, "created": 1492212329.0, "created_utc": 1492183529.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg94xxx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "beer_demon", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Blacks are incarcerated [5 times more than whites](https://www.theguardian.com/us-news/2016/jun/18/mass-incarceration-black-americans-higher-rates-disparities-report) in US.  Is this racist?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Blacks are incarcerated &lt;a href=\"https://www.theguardian.com/us-news/2016/jun/18/mass-incarceration-black-americans-higher-rates-disparities-report\"&gt;5 times more than whites&lt;/a&gt; in US.  Is this racist?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg94xxx", "score_hidden": false, "stickied": false, "created": 1492206010.0, "created_utc": 1492177210.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9on00", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GhostPantsMcGee", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "This may be hard for a social justice warrior to answer but it's dead easy for any rational person:\n\nMen commit more crimes by a large margin. \n\nNow I'm sure that some women are getting light sentences and some men getting heavier, but in sure it's reversed at times as well. \n\nThe world makes a lot more sense when you realize we are not all equal. There are genetic predispositions to behavior which are tempered by experience.   Men are more likely to commit violence or other crime to enhance their social position than women are.  A man can be a saint and a woman a ruthless criminal, but it simply is not the general pattern. \n\nSo my answer to why there isn't more outcry is because there isn't really injustice going on.  Sure, that applies to almost any SJW topic, but since this one negatively affects men they don't really care. \n\nThere are many ways men are treated unfairly by society.  This is not one of them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This may be hard for a social justice warrior to answer but it&amp;#39;s dead easy for any rational person:&lt;/p&gt;\n\n&lt;p&gt;Men commit more crimes by a large margin. &lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;m sure that some women are getting light sentences and some men getting heavier, but in sure it&amp;#39;s reversed at times as well. &lt;/p&gt;\n\n&lt;p&gt;The world makes a lot more sense when you realize we are not all equal. There are genetic predispositions to behavior which are tempered by experience.   Men are more likely to commit violence or other crime to enhance their social position than women are.  A man can be a saint and a woman a ruthless criminal, but it simply is not the general pattern. &lt;/p&gt;\n\n&lt;p&gt;So my answer to why there isn&amp;#39;t more outcry is because there isn&amp;#39;t really injustice going on.  Sure, that applies to almost any SJW topic, but since this one negatively affects men they don&amp;#39;t really care. &lt;/p&gt;\n\n&lt;p&gt;There are many ways men are treated unfairly by society.  This is not one of them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9on00", "score_hidden": false, "stickied": false, "created": 1492229744.0, "created_utc": 1492200944.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg986ox", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "QuasiJL", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "This is commonly discussed and believed in the field of social work. The predictive demographic figures for incarceration is young, male, and minority. Due to resources though, we tend to tend to group risk factors. At the very least, all the explanations you gave could be grouped with young and male, which is a very common topic. If you look at diversion programs, they often target young males. See here: https://www.crimesolutions.gov/PracticeDetails.aspx?ID=37.\n\nMost people in the field consider the bigger injustice to be the fact that given the exact same crime, african americans are more likely to be incarcerated, receive longer sentences and receive harsher sentences. \nReddit is best for new, popular media. It's unlikely to be on here, except in a specific subreddit. Also, the average person doesn't really interact with the criminal justice system so it would make sense not to hear too much about it. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is commonly discussed and believed in the field of social work. The predictive demographic figures for incarceration is young, male, and minority. Due to resources though, we tend to tend to group risk factors. At the very least, all the explanations you gave could be grouped with young and male, which is a very common topic. If you look at diversion programs, they often target young males. See here: &lt;a href=\"https://www.crimesolutions.gov/PracticeDetails.aspx?ID=37\"&gt;https://www.crimesolutions.gov/PracticeDetails.aspx?ID=37&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Most people in the field consider the bigger injustice to be the fact that given the exact same crime, african americans are more likely to be incarcerated, receive longer sentences and receive harsher sentences. \nReddit is best for new, popular media. It&amp;#39;s unlikely to be on here, except in a specific subreddit. Also, the average person doesn&amp;#39;t really interact with the criminal justice system so it would make sense not to hear too much about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg986ox", "score_hidden": false, "stickied": false, "created": 1492210434.0, "created_utc": 1492181634.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg98xcc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "uselesstriviadude", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Although it is true that there is a discrepancy in incarceration rates between men and women, I think that is because men are the overwhelming majority of offenders. Similarly, it is my belief that African Americans are the majority offenders in other crimes, which may contribute to their higher rates of incarceration. That is not to say that is the sole reason, or even the primary reason for this discrepancy, but a contributing factor in an already complicated and contentious matter. This could similarly be attributed not to inherent violent tendencies by African American men, but by the different cultures that they have. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Although it is true that there is a discrepancy in incarceration rates between men and women, I think that is because men are the overwhelming majority of offenders. Similarly, it is my belief that African Americans are the majority offenders in other crimes, which may contribute to their higher rates of incarceration. That is not to say that is the sole reason, or even the primary reason for this discrepancy, but a contributing factor in an already complicated and contentious matter. This could similarly be attributed not to inherent violent tendencies by African American men, but by the different cultures that they have. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg98xcc", "score_hidden": false, "stickied": false, "created": 1492211356.0, "created_utc": 1492182556.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg989ny", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoneApplicable", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; However, it is generally thought that this is not because they are black, but rather due to a number of social and economic pressures that tend to drive black people towards committing crimes.\n\nNow let's consider men in general. If it is truly something societal then we should find at least one society in which men do no have the highest crime rates. I don't believe you can name a single one. This isn't direct proof, but it does seem a bit dubious that these societal pressures you speak of exist in absolutely every society and culture across time ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;However, it is generally thought that this is not because they are black, but rather due to a number of social and economic pressures that tend to drive black people towards committing crimes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Now let&amp;#39;s consider men in general. If it is truly something societal then we should find at least one society in which men do no have the highest crime rates. I don&amp;#39;t believe you can name a single one. This isn&amp;#39;t direct proof, but it does seem a bit dubious that these societal pressures you speak of exist in absolutely every society and culture across time &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg989ny", "score_hidden": false, "stickied": false, "created": 1492210539.0, "created_utc": 1492181739.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg90xxx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yitzaklr", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I posted this elsewhere in the thread but I'll repost it in a parent comment\n\nIn my opinion it's because men have something to prove and less to fall back. When a woman hits rock bottom there's going to be plenty of guys eager for a desperate girl, and not just unattractive guys. When a guy hits rock bottom he's got to get out of it on his own.\n\nAnd for a lot of high school geeks, that's what STEM is - a way to climb out of low status. Women are starting to migrate into STEM now because it's a good life path, but men really flooded in which explains the initial disparity and the increasing gender balance.\n\nSame with crime, when a man hits rock bottom he's willing to do something drastic, whereas a woman at rock bottom has better options", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I posted this elsewhere in the thread but I&amp;#39;ll repost it in a parent comment&lt;/p&gt;\n\n&lt;p&gt;In my opinion it&amp;#39;s because men have something to prove and less to fall back. When a woman hits rock bottom there&amp;#39;s going to be plenty of guys eager for a desperate girl, and not just unattractive guys. When a guy hits rock bottom he&amp;#39;s got to get out of it on his own.&lt;/p&gt;\n\n&lt;p&gt;And for a lot of high school geeks, that&amp;#39;s what STEM is - a way to climb out of low status. Women are starting to migrate into STEM now because it&amp;#39;s a good life path, but men really flooded in which explains the initial disparity and the increasing gender balance.&lt;/p&gt;\n\n&lt;p&gt;Same with crime, when a man hits rock bottom he&amp;#39;s willing to do something drastic, whereas a woman at rock bottom has better options&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg90xxx", "score_hidden": false, "stickied": false, "created": 1492198287.0, "created_utc": 1492169487.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9jbgp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EconomistMagazine", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "What about male rape in prison? More men are raped annually than women, the reason it's not talked about it that most of that rape occurs in jail or prison. \n\nIf rape isn't already under through umbrella of jail time then I think it's worse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What about male rape in prison? More men are raped annually than women, the reason it&amp;#39;s not talked about it that most of that rape occurs in jail or prison. &lt;/p&gt;\n\n&lt;p&gt;If rape isn&amp;#39;t already under through umbrella of jail time then I think it&amp;#39;s worse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9jbgp", "score_hidden": false, "stickied": false, "created": 1492223335.0, "created_utc": 1492194535.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg95tio", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JNelson_", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I see *society* being thrown around a lot like society is coherent entity that influences people. Could someone give me a clear definition for society and how it influences people?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see &lt;em&gt;society&lt;/em&gt; being thrown around a lot like society is coherent entity that influences people. Could someone give me a clear definition for society and how it influences people?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg95tio", "score_hidden": false, "stickied": false, "created": 1492207279.0, "created_utc": 1492178479.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg8vlk1", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "EvilVargon", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "In several comments, you equate men being more violent to fewer women in STEM fields. Both of these are caused not entirely by society, but by biological differences. Men are naturally more violent. Men are naturally risk takers and more interested in STEM fields.\n\nWhile yes, there are aspects of the justice system that favours women, it is not black and white. There are a whole host of issues that affect how many men get sent to prison. While there is a slight discrimination, the primary issue is that men are just more violent than women.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In several comments, you equate men being more violent to fewer women in STEM fields. Both of these are caused not entirely by society, but by biological differences. Men are naturally more violent. Men are naturally risk takers and more interested in STEM fields.&lt;/p&gt;\n\n&lt;p&gt;While yes, there are aspects of the justice system that favours women, it is not black and white. There are a whole host of issues that affect how many men get sent to prison. While there is a slight discrimination, the primary issue is that men are just more violent than women.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8vlk1", "score_hidden": false, "stickied": false, "created": 1492181985.0, "created_utc": 1492153185.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9ee1i", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "nimmer44", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I do not think you are wrong about the societal pressures playing a role in the decision making of any human being. Nature vs nurture. It's a beautiful and unique combination of the two. I think the science backing up that viewpoint is pretty solid. \nMy problem with your viewpoint is the issue of sexism or social injustice. As men, we are in the position of power or we are the oppressors. So, and this is the hard part to swallow, we do not get to decide what is or is not sexism. There can not be institutional sexism against men for as long as the power dynamic is the way it is. \n\n\nAs for why men choose to commit crimes, just spitballing here, it is a byproduct of our sexist society perpetuating aggressive men and docile women. Or the video games. Or rap, that is my favorite, blame rap.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do not think you are wrong about the societal pressures playing a role in the decision making of any human being. Nature vs nurture. It&amp;#39;s a beautiful and unique combination of the two. I think the science backing up that viewpoint is pretty solid. \nMy problem with your viewpoint is the issue of sexism or social injustice. As men, we are in the position of power or we are the oppressors. So, and this is the hard part to swallow, we do not get to decide what is or is not sexism. There can not be institutional sexism against men for as long as the power dynamic is the way it is. &lt;/p&gt;\n\n&lt;p&gt;As for why men choose to commit crimes, just spitballing here, it is a byproduct of our sexist society perpetuating aggressive men and docile women. Or the video games. Or rap, that is my favorite, blame rap.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9ee1i", "score_hidden": false, "stickied": false, "created": 1492217607.0, "created_utc": 1492188807.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg9nsff", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "garnteller", "parent_id": "t1_dg9nrmv", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sorry GrandMa5TR, your comment has been removed: \n\n&gt; Comment Rule 5\\. \"No low effort comments. Comments that are only jokes, links, or 'written upvotes', for example. Humor, links, and affirmations of agreement can be contained within more substantial comments.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5)\n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Rule+5+Appeal+GrandMa5TR&amp;message=GrandMa5TR+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/dg9nrmv/\\))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry GrandMa5TR, your comment has been removed: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 5. &amp;quot;No low effort comments. Comments that are only jokes, links, or &amp;#39;written upvotes&amp;#39;, for example. Humor, links, and affirmations of agreement can be contained within more substantial comments.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5\"&gt;See the wiki page for more information.&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Rule+5+Appeal+GrandMa5TR&amp;amp;message=GrandMa5TR+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/dg9nrmv/)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9nsff", "score_hidden": false, "stickied": false, "created": 1492228722.0, "created_utc": 1492199922.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9nrmv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9nrmv", "score_hidden": false, "stickied": false, "created": 1492228696.0, "created_utc": 1492199896.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_659wew", "likes": null, "replies": "", "user_reports": [], "id": "dg92l3q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BenIncognito", "parent_id": "t1_dg8y4i9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "PsychoPhilosopher, your comment has been removed: \n\n&gt; Comment Rule 2\\. \"Don't be rude or hostile to other users. Your comment will be removed even if most of it is solid, another user was rude to you first, or you feel your remark was justified. Report other violations; do not retaliate.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2)\n\n**Please be aware that we take hostility extremely seriously. Repeated violations will result in a ban.**\n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Rule+2+Appeal+PsychoPhilosopher&amp;message=PsychoPhilosopher+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/dg8y4i9/\\))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;PsychoPhilosopher, your comment has been removed: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 2. &amp;quot;Don&amp;#39;t be rude or hostile to other users. Your comment will be removed even if most of it is solid, another user was rude to you first, or you feel your remark was justified. Report other violations; do not retaliate.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2\"&gt;See the wiki page for more information.&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;Please be aware that we take hostility extremely seriously. Repeated violations will result in a ban.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Rule+2+Appeal+PsychoPhilosopher&amp;amp;message=PsychoPhilosopher+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/659wew/cmv_the_disproportionate_amount_of_men_who_are/dg8y4i9/)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg92l3q", "score_hidden": false, "stickied": false, "created": 1492201973.0, "created_utc": 1492173173.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8y4i9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg8y23f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8y4i9", "score_hidden": false, "stickied": false, "created": 1492189557.0, "created_utc": 1492160757.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8y23f", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Iswallowedafly", "parent_id": "t1_dg8xszn", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "There are poor women who exist right now. \n\nA lot of them. Guess what?\n\nTheir crime rates are a lower when compared to men. By massive amounts. \n\nIt is a risky venture to knock up a liquor store.  But men, and in particular men under 25, have much harder times with risk assessment. Our brains simply aren't developed yet.\n\nTwo men might think that the take of 200 bucks from a liquor store is worth the risk because they can't properly assess risk. Two women might think the idea is insane because they can assess the risk/reward. \n\nThe OP's initial idea that men and women have the same brain is flawed when it comes to maturity and development. \n\nEdit: Are you seriously downvoting everything I respond to you with seconds after I post it?  \n", "edited": 1492160743.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are poor women who exist right now. &lt;/p&gt;\n\n&lt;p&gt;A lot of them. Guess what?&lt;/p&gt;\n\n&lt;p&gt;Their crime rates are a lower when compared to men. By massive amounts. &lt;/p&gt;\n\n&lt;p&gt;It is a risky venture to knock up a liquor store.  But men, and in particular men under 25, have much harder times with risk assessment. Our brains simply aren&amp;#39;t developed yet.&lt;/p&gt;\n\n&lt;p&gt;Two men might think that the take of 200 bucks from a liquor store is worth the risk because they can&amp;#39;t properly assess risk. Two women might think the idea is insane because they can assess the risk/reward. &lt;/p&gt;\n\n&lt;p&gt;The OP&amp;#39;s initial idea that men and women have the same brain is flawed when it comes to maturity and development. &lt;/p&gt;\n\n&lt;p&gt;Edit: Are you seriously downvoting everything I respond to you with seconds after I post it?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8y23f", "score_hidden": false, "stickied": false, "created": 1492189335.0, "created_utc": 1492160535.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8xszn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PsychoPhilosopher", "parent_id": "t1_dg8x7j4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "If you read a few of OP's responses further down in the discussion you'll see that he suggests that there are cultural reasons for men being more violent.\n\nOP appears to be proposing that there are things we could change as a society to make men less likely to become violent.\n\nAs an example: Poverty is a factor in crime rates to a similar extent to gender, and in fact the way that socio economic class and crime interact does suggest an interaction effect such that poor + male = crime while rich + male or poor + female does not produce anywhere near the same crime rates.\n\nSo removing poverty should predictably reduce the instance of crime, which would have a disproportionate effect on males and bring the numbers closer together.\n\nThat is of course a major undertaking, but it does contribute to the idea that equality exists for the sake of the middle class, and is not influencing those who are disadvantaged economically.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you read a few of OP&amp;#39;s responses further down in the discussion you&amp;#39;ll see that he suggests that there are cultural reasons for men being more violent.&lt;/p&gt;\n\n&lt;p&gt;OP appears to be proposing that there are things we could change as a society to make men less likely to become violent.&lt;/p&gt;\n\n&lt;p&gt;As an example: Poverty is a factor in crime rates to a similar extent to gender, and in fact the way that socio economic class and crime interact does suggest an interaction effect such that poor + male = crime while rich + male or poor + female does not produce anywhere near the same crime rates.&lt;/p&gt;\n\n&lt;p&gt;So removing poverty should predictably reduce the instance of crime, which would have a disproportionate effect on males and bring the numbers closer together.&lt;/p&gt;\n\n&lt;p&gt;That is of course a major undertaking, but it does contribute to the idea that equality exists for the sake of the middle class, and is not influencing those who are disadvantaged economically.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8xszn", "score_hidden": false, "stickied": false, "created": 1492188501.0, "created_utc": 1492159701.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8x7j4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Iswallowedafly", "parent_id": "t1_dg8svdp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The violent crime ratios are 4:1 men to women. \n\nFor homicide it is 90.5 percent men who commit homicide for 9.5 percent women. \n\nThat's about a 10:1 ratio. \n\nWe are looked on as more violent because we are more violent. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The violent crime ratios are 4:1 men to women. &lt;/p&gt;\n\n&lt;p&gt;For homicide it is 90.5 percent men who commit homicide for 9.5 percent women. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s about a 10:1 ratio. &lt;/p&gt;\n\n&lt;p&gt;We are looked on as more violent because we are more violent. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8x7j4", "score_hidden": false, "stickied": false, "created": 1492186583.0, "created_utc": 1492157783.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8svdp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jm0917house1", "parent_id": "t1_dg8pxxr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "My take on OP's post is that men are looked at as more violent then women. To compare that to something else for more understanding the argument that blacks are more violent than white people is pretty good. I feel like men are more targeted and more closely watched than women. Like racial profiling but for genders. Idk how to fix it but awareness is always a good start.\n\nEdit: I do agree that men do commit more crimes than women but not 13x more like come on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My take on OP&amp;#39;s post is that men are looked at as more violent then women. To compare that to something else for more understanding the argument that blacks are more violent than white people is pretty good. I feel like men are more targeted and more closely watched than women. Like racial profiling but for genders. Idk how to fix it but awareness is always a good start.&lt;/p&gt;\n\n&lt;p&gt;Edit: I do agree that men do commit more crimes than women but not 13x more like come on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8svdp", "score_hidden": false, "stickied": false, "created": 1492175823.0, "created_utc": 1492147023.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8pxxr", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "PreacherJudge", "parent_id": "t3_659wew", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Ho would you resolve this issue fairly?  Would you make men go to prison less often, or would you make women go to prison more often?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ho would you resolve this issue fairly?  Would you make men go to prison less often, or would you make women go to prison more often?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8pxxr", "score_hidden": false, "stickied": false, "created": 1492170676.0, "created_utc": 1492141876.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]