[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It seems to me that, without conscious effort, humans have a strong tendency to stubbornly defend their views based on intuition alone and cling to their ignorance for the sheer sake of &lt;em&gt;not being wrong&lt;/em&gt; or &lt;em&gt;trusting their gut&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;As a scientist, I spend a lot of time finding my own cognitive biases (among other kinds of biases) and fighting against them. Careful critical thought and unflinching skepticism are the &lt;em&gt;foundation&lt;/em&gt; of effective implementation of the scientific method, and I&amp;#39;ve found them invaluable in looking at other issues, be it social or political or otherwise. &lt;/p&gt;\n\n&lt;p&gt;However, virtually &lt;em&gt;all&lt;/em&gt; of my friends in nonscientific fields or who haven&amp;#39;t been to graduate school are woefully unprepared to expose their own biases and openly discuss multiple sides to an issue in a nuanced way. The amount of effort to convince them of something unintuitive is unreasonably taxing, and the rewards few (it&amp;#39;s not like they&amp;#39;re about to go argue pro-climate-change to their parents now).&lt;/p&gt;\n\n&lt;p&gt;Specifically, I believe public opinion &lt;em&gt;must&lt;/em&gt; be informed by a healthy mix of individual critical thinking, humility, and (yes) an inherent tendency to accept the opinions of professionals (especially in consensus) as default. However, I don&amp;#39;t think American culture is well-prepared to foster that atmosphere, and so it&amp;#39;s up to politicians to lean heavily on nonpartisan advisors. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t see a good way forward to develop that culture of humility and critical thinking in America without beginning with institutional reform as young as elementary school (an opinion for another time), and so I see little benefit to us exasperating ourselves against the ignorance and anti-intellectualism that pervades our nation. &lt;/p&gt;\n\n&lt;p&gt;Maybe I&amp;#39;m just burnt out from too many bad experiences, but I think this fatalistic attitude really is fair. I can&amp;#39;t see a good counterargument that would change my mind, unless someone knows of peer-reviewed studies which suggest the opposite of my claims. I&amp;#39;d love to be wrong. Change my view. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It seems to me that, without conscious effort, humans have a strong tendency to stubbornly defend their views based on intuition alone and cling to their ignorance for the sheer sake of *not being wrong* or *trusting their gut*.\n\nAs a scientist, I spend a lot of time finding my own cognitive biases (among other kinds of biases) and fighting against them. Careful critical thought and unflinching skepticism are the *foundation* of effective implementation of the scientific method, and I've found them invaluable in looking at other issues, be it social or political or otherwise. \n\nHowever, virtually *all* of my friends in nonscientific fields or who haven't been to graduate school are woefully unprepared to expose their own biases and openly discuss multiple sides to an issue in a nuanced way. The amount of effort to convince them of something unintuitive is unreasonably taxing, and the rewards few (it's not like they're about to go argue pro-climate-change to their parents now).\n\nSpecifically, I believe public opinion *must* be informed by a healthy mix of individual critical thinking, humility, and (yes) an inherent tendency to accept the opinions of professionals (especially in consensus) as default. However, I don't think American culture is well-prepared to foster that atmosphere, and so it's up to politicians to lean heavily on nonpartisan advisors. \n\nI can't see a good way forward to develop that culture of humility and critical thinking in America without beginning with institutional reform as young as elementary school (an opinion for another time), and so I see little benefit to us exasperating ourselves against the ignorance and anti-intellectualism that pervades our nation. \n\nMaybe I'm just burnt out from too many bad experiences, but I think this fatalistic attitude really is fair. I can't see a good counterargument that would change my mind, unless someone knows of peer-reviewed studies which suggest the opposite of my claims. I'd love to be wrong. Change my view. ", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "[∆(s) from OP]", "id": "65ajr9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 73, "report_reasons": null, "author": "dwarfboy1717", "saved": false, "mod_reports": [], "name": "t3_65ajr9", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": false, "link_flair_css_class": "OPdelta", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/65ajr9/cmv_most_americans_will_only_apply_critical/", "num_reports": null, "locked": false, "stickied": false, "created": 1492172898.0, "url": "https://www.reddit.com/r/changemyview/comments/65ajr9/cmv_most_americans_will_only_apply_critical/", "author_flair_text": null, "quarantine": false, "title": "CMV: Most Americans will only apply critical thinking skills to claims that they *disagree* with, in order to supported their intuition, therefore any effort at nuanced debate is wasted on the general public.", "created_utc": 1492144098.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 73}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": "", "user_reports": [], "id": "dg9ifq9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t3_65ajr9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "/u/dwarfboy1717 (OP) has awarded 1 delta in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [**here**](/r/DeltaLog/comments/65e65f), in /r/DeltaLog.\n\nPlease note that a change of view [doesn't necessarily mean a reversal](https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F), or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/dwarfboy1717\"&gt;/u/dwarfboy1717&lt;/a&gt; (OP) has awarded 1 delta in this post.&lt;/p&gt;\n\n&lt;p&gt;All comments that earned deltas (from OP or other users) are listed &lt;a href=\"/r/DeltaLog/comments/65e65f\"&gt;&lt;strong&gt;here&lt;/strong&gt;&lt;/a&gt;, in &lt;a href=\"/r/DeltaLog\"&gt;/r/DeltaLog&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Please note that a change of view &lt;a href=\"https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F\"&gt;doesn&amp;#39;t necessarily mean a reversal&lt;/a&gt;, or that the conversation has ended.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9ifq9", "score_hidden": true, "stickied": true, "created": 1492222289.0, "created_utc": 1492193489.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": "", "user_reports": [], "id": "dg8xpgn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SleeplessinRedditle", "parent_id": "t1_dg8w0eu", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm not asking for a dissertation. I'm asking if you have a single peer reviewed study indicating that the masses aren't worth trying to debate. That is the standard of evidence you have established as necessary to change your view. If you have a higher standard of evidence for rejecting a hypothesis than accepting it then you have failed to apply sufficient critical thinking skills to support your view. \n\nBy your own logic then we must either conclude that you are hopelessly dense and not worth debating, that your view is false, or that you have less of a responsibility than others to justify your view. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not asking for a dissertation. I&amp;#39;m asking if you have a single peer reviewed study indicating that the masses aren&amp;#39;t worth trying to debate. That is the standard of evidence you have established as necessary to change your view. If you have a higher standard of evidence for rejecting a hypothesis than accepting it then you have failed to apply sufficient critical thinking skills to support your view. &lt;/p&gt;\n\n&lt;p&gt;By your own logic then we must either conclude that you are hopelessly dense and not worth debating, that your view is false, or that you have less of a responsibility than others to justify your view. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8xpgn", "score_hidden": false, "stickied": false, "created": 1492188180.0, "created_utc": 1492159380.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8w0eu", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "dwarfboy1717", "parent_id": "t1_dg8vgro", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Your observations about this post are reasonable: I'm not offering all perspectives. I'm not putting in effort to thoroughly flush out all the meaningful and nuanced detail surrounding this issue. But the point is exactly this: because I didn't exhaust myself with endless examples and humble anecdotes making my viewpoint accessible and palatable, I'm being called condescending. Because I didn't frame my opinion as a verifiable fact, and because I didn't take the time and effort to explicitly demonstrate that I've *worked* on understanding multiple perspectives on this issue, I'm being called out for bias. \n\nBecause I didn't work hard enough to soften my post and reach out to all possible perspectives, I've found someone who thinks I'm invalidating (or at least ignoring) those perspectives. Or at the very least, because I didn't support my opinion better, I'm being criticized. \n\nOpen and meaningful discussion is *limited*: in scope, in time, etc. \n\nWhen two parties don't give the benefit of the doubt, conversation devolves from a meaningful and good-faith discussion into nitpicking and an unproductive grind through the motivations, 'blind spots,' and even legitimacy of some aspects of the context around the claims. \n\nIt's hard to get people to focus on the *spirit* of the thing in good faith while being open to a fair and nuanced discussion of the issue. \n\nI'm not framing this response to sound dismissive--it just serves to underscore one of the aspects that makes careful discussion difficult: it can be exhausting. \n\nAt the end of the day, I included what was relevant to the post: my claims which build a framework for the opinion that I've asked to be changed. And while my explanation of that view wasn't comprehensive, I gave enough detail to provide adequate (subjective) context to the topic. \n\nAnd if the spirit of my post came across as condescending, it shouldn't have, although I understand that I let myself relax and didn't stress about all of the tact and rapport-building that is necessary (or at least in good taste!) in an environment outside of /r/changemyview\n\nThanks for the reply. \n\nEDIT: let me be clear. In response to your questions, I haven't included a lot of that information because it's unnecessary context for someone to give me a meaningful reply. My claims have been made that justify my opinion--I have no need to support those claims, this isn't a reply to a persuasive writing prompt. And yes, I've spent most of my adult life being very flexible and learning to approach various people about various topics. I've tried a lot of things. And the problems I've described are what seem constant through many of those interactions. ", "edited": 1492154643.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your observations about this post are reasonable: I&amp;#39;m not offering all perspectives. I&amp;#39;m not putting in effort to thoroughly flush out all the meaningful and nuanced detail surrounding this issue. But the point is exactly this: because I didn&amp;#39;t exhaust myself with endless examples and humble anecdotes making my viewpoint accessible and palatable, I&amp;#39;m being called condescending. Because I didn&amp;#39;t frame my opinion as a verifiable fact, and because I didn&amp;#39;t take the time and effort to explicitly demonstrate that I&amp;#39;ve &lt;em&gt;worked&lt;/em&gt; on understanding multiple perspectives on this issue, I&amp;#39;m being called out for bias. &lt;/p&gt;\n\n&lt;p&gt;Because I didn&amp;#39;t work hard enough to soften my post and reach out to all possible perspectives, I&amp;#39;ve found someone who thinks I&amp;#39;m invalidating (or at least ignoring) those perspectives. Or at the very least, because I didn&amp;#39;t support my opinion better, I&amp;#39;m being criticized. &lt;/p&gt;\n\n&lt;p&gt;Open and meaningful discussion is &lt;em&gt;limited&lt;/em&gt;: in scope, in time, etc. &lt;/p&gt;\n\n&lt;p&gt;When two parties don&amp;#39;t give the benefit of the doubt, conversation devolves from a meaningful and good-faith discussion into nitpicking and an unproductive grind through the motivations, &amp;#39;blind spots,&amp;#39; and even legitimacy of some aspects of the context around the claims. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s hard to get people to focus on the &lt;em&gt;spirit&lt;/em&gt; of the thing in good faith while being open to a fair and nuanced discussion of the issue. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not framing this response to sound dismissive--it just serves to underscore one of the aspects that makes careful discussion difficult: it can be exhausting. &lt;/p&gt;\n\n&lt;p&gt;At the end of the day, I included what was relevant to the post: my claims which build a framework for the opinion that I&amp;#39;ve asked to be changed. And while my explanation of that view wasn&amp;#39;t comprehensive, I gave enough detail to provide adequate (subjective) context to the topic. &lt;/p&gt;\n\n&lt;p&gt;And if the spirit of my post came across as condescending, it shouldn&amp;#39;t have, although I understand that I let myself relax and didn&amp;#39;t stress about all of the tact and rapport-building that is necessary (or at least in good taste!) in an environment outside of &lt;a href=\"/r/changemyview\"&gt;/r/changemyview&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Thanks for the reply. &lt;/p&gt;\n\n&lt;p&gt;EDIT: let me be clear. In response to your questions, I haven&amp;#39;t included a lot of that information because it&amp;#39;s unnecessary context for someone to give me a meaningful reply. My claims have been made that justify my opinion--I have no need to support those claims, this isn&amp;#39;t a reply to a persuasive writing prompt. And yes, I&amp;#39;ve spent most of my adult life being very flexible and learning to approach various people about various topics. I&amp;#39;ve tried a lot of things. And the problems I&amp;#39;ve described are what seem constant through many of those interactions. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8w0eu", "score_hidden": false, "stickied": false, "created": 1492183091.0, "created_utc": 1492154291.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8vgro", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "SleeplessinRedditle", "parent_id": "t3_65ajr9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;It seems to me that, without conscious effort, humans have a strong tendency to stubbornly defend their views based on intuition alone and cling to their ignorance for the sheer sake of not being wrong or trusting their gut.\n\nNot going to argue with that. It's a well established phenomenon. \n\nWhat I will challenge is the notion that you are much better and that it's not worth bothering with. Let's just look at your own argument here. What steps have you taken to try to justify your own claims made here? The only claim you made that was substantiated with more than \"I think\" or \"it seems that\" is your personal experiences arguing with friends. You then say that to change your view you would need peer reviewed studies. How much effort have you actually put into looking for that research yourself? How many alternative hypotheses have you generated? \n\n&gt;However, virtually all of my friends in nonscientific fields or who haven't been to graduate school are woefully unprepared to expose their own biases and openly discuss multiple sides to an issue in a nuanced way. The amount of effort to convince them of something unintuitive is unreasonably taxing, and the rewards few (it's not like they're about to go argue pro-climate-change to their parents now).\n\nHave you made any effort to identify alternative debate/discussion/persuasion tactics? What did you try? How much effort did you put into it before deeming them hopeless? \n\nYour post here wasn't very persuasive and came off as condescending. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It seems to me that, without conscious effort, humans have a strong tendency to stubbornly defend their views based on intuition alone and cling to their ignorance for the sheer sake of not being wrong or trusting their gut.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not going to argue with that. It&amp;#39;s a well established phenomenon. &lt;/p&gt;\n\n&lt;p&gt;What I will challenge is the notion that you are much better and that it&amp;#39;s not worth bothering with. Let&amp;#39;s just look at your own argument here. What steps have you taken to try to justify your own claims made here? The only claim you made that was substantiated with more than &amp;quot;I think&amp;quot; or &amp;quot;it seems that&amp;quot; is your personal experiences arguing with friends. You then say that to change your view you would need peer reviewed studies. How much effort have you actually put into looking for that research yourself? How many alternative hypotheses have you generated? &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;However, virtually all of my friends in nonscientific fields or who haven&amp;#39;t been to graduate school are woefully unprepared to expose their own biases and openly discuss multiple sides to an issue in a nuanced way. The amount of effort to convince them of something unintuitive is unreasonably taxing, and the rewards few (it&amp;#39;s not like they&amp;#39;re about to go argue pro-climate-change to their parents now).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Have you made any effort to identify alternative debate/discussion/persuasion tactics? What did you try? How much effort did you put into it before deeming them hopeless? &lt;/p&gt;\n\n&lt;p&gt;Your post here wasn&amp;#39;t very persuasive and came off as condescending. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8vgro", "score_hidden": false, "stickied": false, "created": 1492181636.0, "created_utc": 1492152836.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": "", "user_reports": [], "id": "dg9e2tt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tunaonrye", "parent_id": "t1_dg8td07", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "First - that's a great response - and you should find CMV a better (though not perfect) forum for having debates with people at least nominally committed to having their mind changed, and you write really logically and clearly.\n\n&gt; if you still try to make change, and don't do it through careful discussion, your remaining tools are disingenuous in nature (you won't feel good) and you're probably clumsy at using them I hadn't considered this. With how much I rave against logical fallacies, I would feel dirty using them myself, and would rather people stay wrong in their beliefs than to base their new views on bad reasoning or cheap rhetorical tricks. So yeah, id probably leave these tricks alone.\n\nThere was a magnificent episode of Parks and Rec (\"Fluoride') that made this point so well.\n\nAnd to respond to your final point - thank you for such a thought out response. It's easy to be frustrated by people who spout nonsense, trolls, or the intellectually dishonest - it's hard to stick to the \"high road\" principles and it requires constant refinement and judgment to know when and how to use rational argument in a way that isn't off-putting but is constructive. Best of luck with the good fight!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First - that&amp;#39;s a great response - and you should find CMV a better (though not perfect) forum for having debates with people at least nominally committed to having their mind changed, and you write really logically and clearly.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;if you still try to make change, and don&amp;#39;t do it through careful discussion, your remaining tools are disingenuous in nature (you won&amp;#39;t feel good) and you&amp;#39;re probably clumsy at using them I hadn&amp;#39;t considered this. With how much I rave against logical fallacies, I would feel dirty using them myself, and would rather people stay wrong in their beliefs than to base their new views on bad reasoning or cheap rhetorical tricks. So yeah, id probably leave these tricks alone.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There was a magnificent episode of Parks and Rec (&amp;quot;Fluoride&amp;#39;) that made this point so well.&lt;/p&gt;\n\n&lt;p&gt;And to respond to your final point - thank you for such a thought out response. It&amp;#39;s easy to be frustrated by people who spout nonsense, trolls, or the intellectually dishonest - it&amp;#39;s hard to stick to the &amp;quot;high road&amp;quot; principles and it requires constant refinement and judgment to know when and how to use rational argument in a way that isn&amp;#39;t off-putting but is constructive. Best of luck with the good fight!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9e2tt", "score_hidden": false, "stickied": false, "created": 1492217259.0, "created_utc": 1492188459.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": "", "user_reports": [], "id": "dg8td1v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dg8td07", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/tunaonrye ([55∆](/r/changemyview/wiki/user/tunaonrye)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"tunaonrye\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/tunaonrye\"&gt;/u/tunaonrye&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/tunaonrye\"&gt;55∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22tunaonrye%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8td1v", "score_hidden": false, "stickied": false, "created": 1492176785.0, "created_utc": 1492147985.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8td07", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dwarfboy1717", "parent_id": "t1_dg8s3bd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "This may be the best subreddit to use for changing my mind about this, simply because people who aren't interested in nuanced discussion probably won't chime in. \n\nThat being said, your answers seemed to boil down like this, with my responses:\n\n- *do it to gain respect, and maybe as a bonus that respect will soften their defenses*\nSure, I've experienced this, but it's a minority of my experiences. Plus, I've stopped caring for the respect of stubborn anti-intellectuals, on the whole. \n\n- *if you still try to make change, and don't do it through careful discussion, your remaining tools are disingenuous in nature (you won't feel good) and you're probably clumsy at using them*\nI hadn't considered this. With how much I rave against logical fallacies, I would feel dirty using them myself, and would rather people stay *wrong* in their beliefs than to base their new views on bad reasoning or cheap rhetorical tricks. So yeah, id probably leave these tricks alone. \n\n- *if you don't still try to make change, you're surrendering (shame on you, and you will feel bad), and you have a skill that the world* **needs**, *obligating you to some degree*\nDefeatist is not a personality trait I enjoy wearing, but if fighting is ineffective, then I have no moral obligation to fight. Why take antibiotics 'just in case' if you're sick with a viral infection?\n\n- *it's* **necessary** *for change, so you may as well contribute because we are all doing our part, just stay sane*\nWhile I am responding with a theme of \"if I feel morally obligated to do a thing which proves ineffective, I am released from this obligation,\" this point definitely pulls on my productive-member-of-society heartstrings and reminds me that the slow progress of humanity, even with countless historical setbacks, has always been and will always be a noble cause. While you might not have changed my mind, up to this point, about its effectiveness on an individual basis, you are definitely teetering on the verge of convincing me to begrudgingly keep going, for the same reason that thousands of physicists are searching for room temperature superconductivity: maybe, statistically, a meaningful success will arise from all that failure. \n\n- *there are a whole class of nonscientists who, regardless of education level, tend to have a* **natural predisposition** *to responding to careful critical analysis in a meaningful way*\nThanks for the link. I'd like to see the study repeated and improved, but it's convincing on a fundamental level that I need. This is the single most important point you made, refuting my claim that only a very small subset of the population are inherently open to changing their minds in casual conversation. Having verifiable evidence that a *large* group of people exist who are open to careful discussion forces me to accept that my recent sample size for finding stubbornly ignorant people is small and biased in a negative way. \n\nYou've changed my mind, and for that I'm very appreciative. Half the battle is having optimism for efficacy, and it seems I just needed some evidence-based hope to motivate me to continue fighting the good fight. \n\nThanks! Now I think I'm supposed to put a delta on here somewhere.... Δ", "edited": 1492148998.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This may be the best subreddit to use for changing my mind about this, simply because people who aren&amp;#39;t interested in nuanced discussion probably won&amp;#39;t chime in. &lt;/p&gt;\n\n&lt;p&gt;That being said, your answers seemed to boil down like this, with my responses:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;do it to gain respect, and maybe as a bonus that respect will soften their defenses&lt;/em&gt;\nSure, I&amp;#39;ve experienced this, but it&amp;#39;s a minority of my experiences. Plus, I&amp;#39;ve stopped caring for the respect of stubborn anti-intellectuals, on the whole. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;if you still try to make change, and don&amp;#39;t do it through careful discussion, your remaining tools are disingenuous in nature (you won&amp;#39;t feel good) and you&amp;#39;re probably clumsy at using them&lt;/em&gt;\nI hadn&amp;#39;t considered this. With how much I rave against logical fallacies, I would feel dirty using them myself, and would rather people stay &lt;em&gt;wrong&lt;/em&gt; in their beliefs than to base their new views on bad reasoning or cheap rhetorical tricks. So yeah, id probably leave these tricks alone. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;if you don&amp;#39;t still try to make change, you&amp;#39;re surrendering (shame on you, and you will feel bad), and you have a skill that the world&lt;/em&gt; &lt;strong&gt;needs&lt;/strong&gt;, &lt;em&gt;obligating you to some degree&lt;/em&gt;\nDefeatist is not a personality trait I enjoy wearing, but if fighting is ineffective, then I have no moral obligation to fight. Why take antibiotics &amp;#39;just in case&amp;#39; if you&amp;#39;re sick with a viral infection?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;it&amp;#39;s&lt;/em&gt; &lt;strong&gt;necessary&lt;/strong&gt; &lt;em&gt;for change, so you may as well contribute because we are all doing our part, just stay sane&lt;/em&gt;\nWhile I am responding with a theme of &amp;quot;if I feel morally obligated to do a thing which proves ineffective, I am released from this obligation,&amp;quot; this point definitely pulls on my productive-member-of-society heartstrings and reminds me that the slow progress of humanity, even with countless historical setbacks, has always been and will always be a noble cause. While you might not have changed my mind, up to this point, about its effectiveness on an individual basis, you are definitely teetering on the verge of convincing me to begrudgingly keep going, for the same reason that thousands of physicists are searching for room temperature superconductivity: maybe, statistically, a meaningful success will arise from all that failure. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;em&gt;there are a whole class of nonscientists who, regardless of education level, tend to have a&lt;/em&gt; &lt;strong&gt;natural predisposition&lt;/strong&gt; &lt;em&gt;to responding to careful critical analysis in a meaningful way&lt;/em&gt;\nThanks for the link. I&amp;#39;d like to see the study repeated and improved, but it&amp;#39;s convincing on a fundamental level that I need. This is the single most important point you made, refuting my claim that only a very small subset of the population are inherently open to changing their minds in casual conversation. Having verifiable evidence that a &lt;em&gt;large&lt;/em&gt; group of people exist who are open to careful discussion forces me to accept that my recent sample size for finding stubbornly ignorant people is small and biased in a negative way. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;You&amp;#39;ve changed my mind, and for that I&amp;#39;m very appreciative. Half the battle is having optimism for efficacy, and it seems I just needed some evidence-based hope to motivate me to continue fighting the good fight. &lt;/p&gt;\n\n&lt;p&gt;Thanks! Now I think I&amp;#39;m supposed to put a delta on here somewhere.... Δ&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8td07", "score_hidden": false, "stickied": false, "created": 1492176782.0, "created_utc": 1492147982.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8s3bd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tunaonrye", "parent_id": "t3_65ajr9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You are right about the practical value of nuanced conversation. We both wish it was more effective, and all of our ideas would be made better by people honestly confronting their own biases and examining beliefs with a more critical eye. \n\n&gt;I can't see a good way forward to develop that culture of humility and critical thinking in America without beginning with institutional reform as young as elementary school (an opinion for another time), and so I see little benefit to us exasperating ourselves against the ignorance and anti-intellectualism that pervades our nation.\n\nThe education point is very true - it is an analogous point that I want to make. Here is why, despite the utter failure of such attempts in the broad sense, we still ought to engage in nuanced debate. (1) It is honest and demonstrates respect and integrity on the part of the speaker. People do notice that, and, grudgingly, people will accept it if you learn to understand your audience in some basic ways. (2) The alternatives are worse: manipulation, spin, selective attention/inattention are dangerous tools to play with: you are likely to be bad at using those tools compared to the pros. (3) Disengagement is surrender - you aren't obligated to enter every debate, but nuanced understanding deserves to be put out there, especially given how people get their ideas. (4) Sometimes it is a long road... a very long road... to make a small amount of progress. Do what you can tolerate without destroying yourself psychologically. (5) And finally, there are [positive](https://phys.org/news/2017-01-antidote-partisanship-science-curiosity.html) psychological regularities to engage with - like how people who are more curious are less partisan. If you can get someone to be curious about a topic, rather than try to beat them over the head with facts (which is always going to be a temptation when you genuinely have the damn facts!), you will get better results. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are right about the practical value of nuanced conversation. We both wish it was more effective, and all of our ideas would be made better by people honestly confronting their own biases and examining beliefs with a more critical eye. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I can&amp;#39;t see a good way forward to develop that culture of humility and critical thinking in America without beginning with institutional reform as young as elementary school (an opinion for another time), and so I see little benefit to us exasperating ourselves against the ignorance and anti-intellectualism that pervades our nation.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The education point is very true - it is an analogous point that I want to make. Here is why, despite the utter failure of such attempts in the broad sense, we still ought to engage in nuanced debate. (1) It is honest and demonstrates respect and integrity on the part of the speaker. People do notice that, and, grudgingly, people will accept it if you learn to understand your audience in some basic ways. (2) The alternatives are worse: manipulation, spin, selective attention/inattention are dangerous tools to play with: you are likely to be bad at using those tools compared to the pros. (3) Disengagement is surrender - you aren&amp;#39;t obligated to enter every debate, but nuanced understanding deserves to be put out there, especially given how people get their ideas. (4) Sometimes it is a long road... a very long road... to make a small amount of progress. Do what you can tolerate without destroying yourself psychologically. (5) And finally, there are &lt;a href=\"https://phys.org/news/2017-01-antidote-partisanship-science-curiosity.html\"&gt;positive&lt;/a&gt; psychological regularities to engage with - like how people who are more curious are less partisan. If you can get someone to be curious about a topic, rather than try to beat them over the head with facts (which is always going to be a temptation when you genuinely have the damn facts!), you will get better results. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8s3bd", "score_hidden": false, "stickied": false, "created": 1492174327.0, "created_utc": 1492145527.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg9jd3s", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PreacherJudge", "parent_id": "t1_dg9ifec", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Thanks for the delta!\n\n&gt; If you're willing, I would love you to take a stab at it. To first approximation, what schemes might strike you as appropriate? Or, maybe more simply, what underlying mechanisms are well-suited to being manipulated on a large scale?\n\nMy pet theory is that the main reason things are bad is that online, it's so easy to seek out and participate in quick \"Gotcha! Ha!\" jabs against people who disagree with you.  This makes it like a skinnerbox: you're emotionally rewarded for relatively thoughtless mockery of caricatures, which encourages you to do it more.  In short: the issue isn't that people DISLIKE being accurate and open-minded, it's that they like being narrow-minded and biased too much... \"Ha, I found a way to say those people are stupid hypocrites! I'm awesome!\"\n\nThere are potentially design solutions to this... I'm not an expert, but some way to discourage rote attacks or to slow people down when they argue.\n\nIn terms of education, there's many things keeping people from having clear access to other people's reasoning behind their views, and even plenty of things blocking people's access to their OWN reasoning.  I know there's been work on training people in formal logic... not to make them logical, but rather to give them a framework to see how they get from point A to point B in their reasoning.  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the delta!&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If you&amp;#39;re willing, I would love you to take a stab at it. To first approximation, what schemes might strike you as appropriate? Or, maybe more simply, what underlying mechanisms are well-suited to being manipulated on a large scale?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;My pet theory is that the main reason things are bad is that online, it&amp;#39;s so easy to seek out and participate in quick &amp;quot;Gotcha! Ha!&amp;quot; jabs against people who disagree with you.  This makes it like a skinnerbox: you&amp;#39;re emotionally rewarded for relatively thoughtless mockery of caricatures, which encourages you to do it more.  In short: the issue isn&amp;#39;t that people DISLIKE being accurate and open-minded, it&amp;#39;s that they like being narrow-minded and biased too much... &amp;quot;Ha, I found a way to say those people are stupid hypocrites! I&amp;#39;m awesome!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;There are potentially design solutions to this... I&amp;#39;m not an expert, but some way to discourage rote attacks or to slow people down when they argue.&lt;/p&gt;\n\n&lt;p&gt;In terms of education, there&amp;#39;s many things keeping people from having clear access to other people&amp;#39;s reasoning behind their views, and even plenty of things blocking people&amp;#39;s access to their OWN reasoning.  I know there&amp;#39;s been work on training people in formal logic... not to make them logical, but rather to give them a framework to see how they get from point A to point B in their reasoning.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9jd3s", "score_hidden": false, "stickied": false, "created": 1492223391.0, "created_utc": 1492194591.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": "", "user_reports": [], "id": "dg9ifpj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dg9ifec", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/PreacherJudge ([68∆](/r/changemyview/wiki/user/PreacherJudge)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"PreacherJudge\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/PreacherJudge\"&gt;/u/PreacherJudge&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/PreacherJudge\"&gt;68∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22PreacherJudge%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9ifpj", "score_hidden": false, "stickied": false, "created": 1492222288.0, "created_utc": 1492193488.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ifec", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dwarfboy1717", "parent_id": "t1_dg8tovi", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "This is a unique perspective that I was unequipped to find myself: I have no background in psychology, and so am unfamiliar with the psychology/sociology of reward/feedback. \n\n&gt; Along similar lines, altering a message such that people are forced to pay effortful attention to it can reduce myside bias: http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.459.6646&amp;rep=rep1&amp;type=pdf\n\n*Holy crap.* This blew my mind. Buzzfeed should post it with the sensationalist headline, \"Scientists Can't Change Public Opinion Because They Communicate Too Clearly\"\n\nThe idea that poor critical thinking skills can be attributed to cultural reward standards and not just human nature is incredibly encouraging. I may go read up on the basic psychology of reward and feedback....\n\n&gt; Now, HOW to change the reward on a cultural scale, I don't know. \n\nIf you're willing, I would love you to take a stab at it. To first approximation, what schemes might strike you as appropriate? Or, maybe more simply, what underlying mechanisms are well-suited to being manipulated on a large scale?\n\nThanks for the extra insights and fresh perspective. This definitely deserves some CMV karma: Δ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a unique perspective that I was unequipped to find myself: I have no background in psychology, and so am unfamiliar with the psychology/sociology of reward/feedback. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Along similar lines, altering a message such that people are forced to pay effortful attention to it can reduce myside bias: &lt;a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.459.6646&amp;amp;rep=rep1&amp;amp;type=pdf\"&gt;http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.459.6646&amp;amp;rep=rep1&amp;amp;type=pdf&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;em&gt;Holy crap.&lt;/em&gt; This blew my mind. Buzzfeed should post it with the sensationalist headline, &amp;quot;Scientists Can&amp;#39;t Change Public Opinion Because They Communicate Too Clearly&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The idea that poor critical thinking skills can be attributed to cultural reward standards and not just human nature is incredibly encouraging. I may go read up on the basic psychology of reward and feedback....&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Now, HOW to change the reward on a cultural scale, I don&amp;#39;t know. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you&amp;#39;re willing, I would love you to take a stab at it. To first approximation, what schemes might strike you as appropriate? Or, maybe more simply, what underlying mechanisms are well-suited to being manipulated on a large scale?&lt;/p&gt;\n\n&lt;p&gt;Thanks for the extra insights and fresh perspective. This definitely deserves some CMV karma: Δ&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9ifec", "score_hidden": false, "stickied": false, "created": 1492222277.0, "created_utc": 1492193477.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8tovi", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "PreacherJudge", "parent_id": "t3_65ajr9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "A biased refusal to think critically about information is a problem specifically for being a good citizen, but I don't agree it's an insurmountable aspect of human nature.\n\nAs you learned, people who are aware of their biases can correct them: https://scholar.google.com/scholar?hl=en&amp;q=%22accuracy+motivation%22+bias&amp;btnG=&amp;as_sdt=1%2C34&amp;as_sdtp=&amp;oq=%22accuracy+motivation%22\n\nSimply motivating people to be correct about the world (usually by rewarding them if they are) causes them to spontaneously avoid a whole host of biases: https://www.researchgate.net/profile/Gordon_Moskowitz/publication/232588575_Accuracy_Motivation_Attenuates_Covert_Priming_The_Systematic_Reprocessing_of_Social_Information/links/5409ddbe0cf2df04e7491b0a/Accuracy-Motivation-Attenuates-Covert-Priming-The-Systematic-Reprocessing-of-Social-Information.pdf / http://givingandappreciating.com/wp-content/uploads/2013/03/The-Effect-of-Accuracy-Motivation-on-Anchoring-and-Adjustment_-Do-People-Adjust-From-Provided-Anchors.pdf / http://escholarship.org/uc/item/8r21t700\n\nAlong similar lines, altering a message such that people are forced to pay effortful attention to it can reduce myside bias: http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.459.6646&amp;rep=rep1&amp;type=pdf\n\n\nWhat this adds up to is showing that people absolutely CAN avoid these biases, AND that these biases aren't necessarily the \"natural\" thing that people do.  They do it because it's *rewarding* to be right, *threatening* to have to change your views, and *difficult and annoying* to resist the emotional benefits of feeling right unless some other reward is on the table. Change the reward, and people act very differently.  \n\nNow, HOW to change the reward on a cultural scale, I don't know.  But it really doesn't seem to be a case of changing some deep embedded way that people think, and rather it's a case of refocusing people on different goals.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A biased refusal to think critically about information is a problem specifically for being a good citizen, but I don&amp;#39;t agree it&amp;#39;s an insurmountable aspect of human nature.&lt;/p&gt;\n\n&lt;p&gt;As you learned, people who are aware of their biases can correct them: &lt;a href=\"https://scholar.google.com/scholar?hl=en&amp;amp;q=%22accuracy+motivation%22+bias&amp;amp;btnG=&amp;amp;as_sdt=1%2C34&amp;amp;as_sdtp=&amp;amp;oq=%22accuracy+motivation%22\"&gt;https://scholar.google.com/scholar?hl=en&amp;amp;q=%22accuracy+motivation%22+bias&amp;amp;btnG=&amp;amp;as_sdt=1%2C34&amp;amp;as_sdtp=&amp;amp;oq=%22accuracy+motivation%22&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Simply motivating people to be correct about the world (usually by rewarding them if they are) causes them to spontaneously avoid a whole host of biases: &lt;a href=\"https://www.researchgate.net/profile/Gordon_Moskowitz/publication/232588575_Accuracy_Motivation_Attenuates_Covert_Priming_The_Systematic_Reprocessing_of_Social_Information/links/5409ddbe0cf2df04e7491b0a/Accuracy-Motivation-Attenuates-Covert-Priming-The-Systematic-Reprocessing-of-Social-Information.pdf\"&gt;https://www.researchgate.net/profile/Gordon_Moskowitz/publication/232588575_Accuracy_Motivation_Attenuates_Covert_Priming_The_Systematic_Reprocessing_of_Social_Information/links/5409ddbe0cf2df04e7491b0a/Accuracy-Motivation-Attenuates-Covert-Priming-The-Systematic-Reprocessing-of-Social-Information.pdf&lt;/a&gt; / &lt;a href=\"http://givingandappreciating.com/wp-content/uploads/2013/03/The-Effect-of-Accuracy-Motivation-on-Anchoring-and-Adjustment_-Do-People-Adjust-From-Provided-Anchors.pdf\"&gt;http://givingandappreciating.com/wp-content/uploads/2013/03/The-Effect-of-Accuracy-Motivation-on-Anchoring-and-Adjustment_-Do-People-Adjust-From-Provided-Anchors.pdf&lt;/a&gt; / &lt;a href=\"http://escholarship.org/uc/item/8r21t700\"&gt;http://escholarship.org/uc/item/8r21t700&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Along similar lines, altering a message such that people are forced to pay effortful attention to it can reduce myside bias: &lt;a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.459.6646&amp;amp;rep=rep1&amp;amp;type=pdf\"&gt;http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.459.6646&amp;amp;rep=rep1&amp;amp;type=pdf&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;What this adds up to is showing that people absolutely CAN avoid these biases, AND that these biases aren&amp;#39;t necessarily the &amp;quot;natural&amp;quot; thing that people do.  They do it because it&amp;#39;s &lt;em&gt;rewarding&lt;/em&gt; to be right, &lt;em&gt;threatening&lt;/em&gt; to have to change your views, and &lt;em&gt;difficult and annoying&lt;/em&gt; to resist the emotional benefits of feeling right unless some other reward is on the table. Change the reward, and people act very differently.  &lt;/p&gt;\n\n&lt;p&gt;Now, HOW to change the reward on a cultural scale, I don&amp;#39;t know.  But it really doesn&amp;#39;t seem to be a case of changing some deep embedded way that people think, and rather it&amp;#39;s a case of refocusing people on different goals.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8tovi", "score_hidden": false, "stickied": false, "created": 1492177459.0, "created_utc": 1492148659.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": "", "user_reports": [], "id": "dg9eizx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gilescb", "parent_id": "t3_65ajr9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Fellow scientist here. My experiences in discussions with \"most Americans\" are similar. But let's break down the logic:\n\n&gt; Most Americans will only apply critical thinking skills to claims that they *disagree* with, in order to supported their intuition, \n\nI basically agree.\n\n&gt; therefore any effort at nuanced debate is wasted on the general public.\n\nBut I don't think the conclusion follows. There are several reasons debate with someone with different views can be useful. Your post itself demonstrates one: even if only one side has intellectual humility and is willing to be wrong, that person still has the chance to learn. IMO, the real winner of a debate is someone who changes their mind. They get permanent benefit from the debate. The person who did the changing (the traditional \"winner\") is just a helpful facilitator. \n\nDemonstrating intellectual humility can also be useful even to people hardened in their positions because it helps reduce the natural tendency to \"other\" people you disagree with. For example, I'm liberal. When I talk to conservatives, I may not change their views, but I can at least leave them with the impression that liberals aren't evil America-haters, that we're all people and have things in common. This may not change their views immediately, but it may in the long term reduce the chance of them dismissing liberal views out of hand.\n\nThere are others, but in short, the prospect of actually changing someone's mind in a debate is the *least* likely and important benefit of debate, and shouldn't be the primary goal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fellow scientist here. My experiences in discussions with &amp;quot;most Americans&amp;quot; are similar. But let&amp;#39;s break down the logic:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Most Americans will only apply critical thinking skills to claims that they &lt;em&gt;disagree&lt;/em&gt; with, in order to supported their intuition, &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I basically agree.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;therefore any effort at nuanced debate is wasted on the general public.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But I don&amp;#39;t think the conclusion follows. There are several reasons debate with someone with different views can be useful. Your post itself demonstrates one: even if only one side has intellectual humility and is willing to be wrong, that person still has the chance to learn. IMO, the real winner of a debate is someone who changes their mind. They get permanent benefit from the debate. The person who did the changing (the traditional &amp;quot;winner&amp;quot;) is just a helpful facilitator. &lt;/p&gt;\n\n&lt;p&gt;Demonstrating intellectual humility can also be useful even to people hardened in their positions because it helps reduce the natural tendency to &amp;quot;other&amp;quot; people you disagree with. For example, I&amp;#39;m liberal. When I talk to conservatives, I may not change their views, but I can at least leave them with the impression that liberals aren&amp;#39;t evil America-haters, that we&amp;#39;re all people and have things in common. This may not change their views immediately, but it may in the long term reduce the chance of them dismissing liberal views out of hand.&lt;/p&gt;\n\n&lt;p&gt;There are others, but in short, the prospect of actually changing someone&amp;#39;s mind in a debate is the &lt;em&gt;least&lt;/em&gt; likely and important benefit of debate, and shouldn&amp;#39;t be the primary goal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9eizx", "score_hidden": false, "stickied": false, "created": 1492217761.0, "created_utc": 1492188961.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": "", "user_reports": [], "id": "dg9ajsf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anonoman925", "parent_id": "t3_65ajr9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Because we don't encourage nuanced anything. Take the Learning and History channel. They are academic jokes compared to what they were. \n\nCrossfire is off the air. \n\nLike all people I day dream about being awesome. Here's one I have:\n\nI have my own show where I engage with an audience, town hall style, who have differing opinions than mine. 20-40 people. \n\nI used to be blue collar, so I can win an audience of people who disagree with me easily. I have blood, sweat, and exploitive stories. \n\nMy question: what would you do with an extra $800 bucks a month per check? (Get the pathos rolling)\n\nAnswers: do this, do that: I'd extrude the hardships \n\nQuestion: if you went to your boss and asked for an $800 dollar a month raise, what would happen?\n\nAnswers: obvious \n\nQuestion/ statement: I'm a teacher. In my 11 years, after my first year teaching, my bosses have given me $3500 per check and a fat pension. I currently make $70000 a year. And I only pay $1200 a year. Let's put emotions aside a bit. Politics aside. \n\nWhat could you do if you were me?\n\nAnswers: ...\n\nStatement: I worked in the private sector. One day I pulled into the parking lot and my boss rolls up in a brand new, trimmed out BMW. I said wow!  Nice car. \n\nAnd he said, if you work hard, put in the hours, go the extra mile, give your blood and sweat...I'll have a new one next year. (I stole this from Reddit). \n\nYou sweat, you bleed, you have to look your kids in the eye when they're sick, hungry, or want xmas and know you can't help them. I'm a father and I can't imagine. \n\nYou know the difference between you and me?  I'm in a union. I pay $1200 a year so I can have $70000. When I retire, I'll have $95000. \n\nSo tomorrow, when you go back to work, what is your first move?\n\nAnswer...\n\nStatement: sit down. Tell all of your colleagues to sit down until you get an extra $800 a month. Look around the audience. In a fight, you vs me, you would win in 5 seconds. Beat me to death right now; maybe out of anger that I'm draining your tax dollars. \n\nBut what situation produces the worst emotion? Anger over what I have or the fear and sorrow over knowing if your kid gets sick, you're fucked. \n\n--------\n\n...anyhow, it's a fantasy. Back to my response to you. \n\nBut let's take a step back. We have no conversations in the public sphere like this. It isn't run on the popular networks. Aww my balls and bumper sticker news time is what we get. There is no thoughtful discussion. Or it's publicly funded and conservatives want it gone. \n\nWe get what we demand. But we don't know what we want until it's supplied. A camera in phone?  Push posh I say!\n\nIf you build it, they will come. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because we don&amp;#39;t encourage nuanced anything. Take the Learning and History channel. They are academic jokes compared to what they were. &lt;/p&gt;\n\n&lt;p&gt;Crossfire is off the air. &lt;/p&gt;\n\n&lt;p&gt;Like all people I day dream about being awesome. Here&amp;#39;s one I have:&lt;/p&gt;\n\n&lt;p&gt;I have my own show where I engage with an audience, town hall style, who have differing opinions than mine. 20-40 people. &lt;/p&gt;\n\n&lt;p&gt;I used to be blue collar, so I can win an audience of people who disagree with me easily. I have blood, sweat, and exploitive stories. &lt;/p&gt;\n\n&lt;p&gt;My question: what would you do with an extra $800 bucks a month per check? (Get the pathos rolling)&lt;/p&gt;\n\n&lt;p&gt;Answers: do this, do that: I&amp;#39;d extrude the hardships &lt;/p&gt;\n\n&lt;p&gt;Question: if you went to your boss and asked for an $800 dollar a month raise, what would happen?&lt;/p&gt;\n\n&lt;p&gt;Answers: obvious &lt;/p&gt;\n\n&lt;p&gt;Question/ statement: I&amp;#39;m a teacher. In my 11 years, after my first year teaching, my bosses have given me $3500 per check and a fat pension. I currently make $70000 a year. And I only pay $1200 a year. Let&amp;#39;s put emotions aside a bit. Politics aside. &lt;/p&gt;\n\n&lt;p&gt;What could you do if you were me?&lt;/p&gt;\n\n&lt;p&gt;Answers: ...&lt;/p&gt;\n\n&lt;p&gt;Statement: I worked in the private sector. One day I pulled into the parking lot and my boss rolls up in a brand new, trimmed out BMW. I said wow!  Nice car. &lt;/p&gt;\n\n&lt;p&gt;And he said, if you work hard, put in the hours, go the extra mile, give your blood and sweat...I&amp;#39;ll have a new one next year. (I stole this from Reddit). &lt;/p&gt;\n\n&lt;p&gt;You sweat, you bleed, you have to look your kids in the eye when they&amp;#39;re sick, hungry, or want xmas and know you can&amp;#39;t help them. I&amp;#39;m a father and I can&amp;#39;t imagine. &lt;/p&gt;\n\n&lt;p&gt;You know the difference between you and me?  I&amp;#39;m in a union. I pay $1200 a year so I can have $70000. When I retire, I&amp;#39;ll have $95000. &lt;/p&gt;\n\n&lt;p&gt;So tomorrow, when you go back to work, what is your first move?&lt;/p&gt;\n\n&lt;p&gt;Answer...&lt;/p&gt;\n\n&lt;p&gt;Statement: sit down. Tell all of your colleagues to sit down until you get an extra $800 a month. Look around the audience. In a fight, you vs me, you would win in 5 seconds. Beat me to death right now; maybe out of anger that I&amp;#39;m draining your tax dollars. &lt;/p&gt;\n\n&lt;p&gt;But what situation produces the worst emotion? Anger over what I have or the fear and sorrow over knowing if your kid gets sick, you&amp;#39;re fucked. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;...anyhow, it&amp;#39;s a fantasy. Back to my response to you. &lt;/p&gt;\n\n&lt;p&gt;But let&amp;#39;s take a step back. We have no conversations in the public sphere like this. It isn&amp;#39;t run on the popular networks. Aww my balls and bumper sticker news time is what we get. There is no thoughtful discussion. Or it&amp;#39;s publicly funded and conservatives want it gone. &lt;/p&gt;\n\n&lt;p&gt;We get what we demand. But we don&amp;#39;t know what we want until it&amp;#39;s supplied. A camera in phone?  Push posh I say!&lt;/p&gt;\n\n&lt;p&gt;If you build it, they will come. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9ajsf", "score_hidden": false, "stickied": false, "created": 1492213295.0, "created_utc": 1492184495.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": "", "user_reports": [], "id": "dg9axpy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Bratmon", "parent_id": "t3_65ajr9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So your view is based entirely on intuition and what you think, but you demand people who disagree with you provide peer-reviewed sources?\n\nIt seems you're part of the \"Most Americans\" in your title.\n\nAlthough, now that I think about it, that doesn't really invalidate the view presented.", "edited": 1492186102.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So your view is based entirely on intuition and what you think, but you demand people who disagree with you provide peer-reviewed sources?&lt;/p&gt;\n\n&lt;p&gt;It seems you&amp;#39;re part of the &amp;quot;Most Americans&amp;quot; in your title.&lt;/p&gt;\n\n&lt;p&gt;Although, now that I think about it, that doesn&amp;#39;t really invalidate the view presented.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9axpy", "score_hidden": false, "stickied": false, "created": 1492213741.0, "created_utc": 1492184941.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": "", "user_reports": [], "id": "dg971gx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aizu9", "parent_id": "t3_65ajr9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think for people with scientific backgrounds, the biggest problem in attempts to debate and convince people is their own poor understanding of communication itself. This is ironic, since well-developed critical thinking faculties should make it much easier to take a step back and critically examine what you're actually *doing* when you write a sentence or make an utterance, what your intentions are in doing so, and whether your utterances are well suited to your intentions.\n\nIn my personal experience, ever since I decided to make a focused study of this topic, it's very rare for me to lose an argument with anyone, fail to find common ground, or make lasting changes to people's thinking patterns at will. \n\nThat doesn't mean becoming some kind of sociopath, but it's very hard to miss how incredibly malleable people are if you know what to look for. How is it that supposedly intelligent grad students with well developed critical thinking faculties are unable to get into the heads of less educated people and convince them of just about anything they want, including the value of critical thinking and examining their own biases?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think for people with scientific backgrounds, the biggest problem in attempts to debate and convince people is their own poor understanding of communication itself. This is ironic, since well-developed critical thinking faculties should make it much easier to take a step back and critically examine what you&amp;#39;re actually &lt;em&gt;doing&lt;/em&gt; when you write a sentence or make an utterance, what your intentions are in doing so, and whether your utterances are well suited to your intentions.&lt;/p&gt;\n\n&lt;p&gt;In my personal experience, ever since I decided to make a focused study of this topic, it&amp;#39;s very rare for me to lose an argument with anyone, fail to find common ground, or make lasting changes to people&amp;#39;s thinking patterns at will. &lt;/p&gt;\n\n&lt;p&gt;That doesn&amp;#39;t mean becoming some kind of sociopath, but it&amp;#39;s very hard to miss how incredibly malleable people are if you know what to look for. How is it that supposedly intelligent grad students with well developed critical thinking faculties are unable to get into the heads of less educated people and convince them of just about anything they want, including the value of critical thinking and examining their own biases?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg971gx", "score_hidden": false, "stickied": false, "created": 1492208953.0, "created_utc": 1492180153.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": "", "user_reports": [], "id": "dg8td32", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t3_65ajr9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "/u/dwarfboy1717 (OP) has awarded 1 delta in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [**here**](/r/DeltaLog/comments/65atde), in /r/DeltaLog.\n\nPlease note that a change of view [doesn't necessarily mean a reversal](https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F), or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/dwarfboy1717\"&gt;/u/dwarfboy1717&lt;/a&gt; (OP) has awarded 1 delta in this post.&lt;/p&gt;\n\n&lt;p&gt;All comments that earned deltas (from OP or other users) are listed &lt;a href=\"/r/DeltaLog/comments/65atde\"&gt;&lt;strong&gt;here&lt;/strong&gt;&lt;/a&gt;, in &lt;a href=\"/r/DeltaLog\"&gt;/r/DeltaLog&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Please note that a change of view &lt;a href=\"https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F\"&gt;doesn&amp;#39;t necessarily mean a reversal&lt;/a&gt;, or that the conversation has ended.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8td32", "score_hidden": false, "stickied": false, "created": 1492176786.0, "created_utc": 1492147986.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": "", "user_reports": [], "id": "dg93860", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "One_Winged_Rook", "parent_id": "t3_65ajr9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Denial\nAnger\nBargaining\nDepression &lt;---- you're here\nAcceptance", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Denial\nAnger\nBargaining\nDepression &amp;lt;---- you&amp;#39;re here\nAcceptance&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg93860", "score_hidden": false, "stickied": false, "created": 1492203179.0, "created_utc": 1492174379.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65ajr9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg9dt5y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "garnteller", "parent_id": "t1_dg9ckaw", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sorry porkchop_d_clown, your comment has been removed: \n\n&gt; Comment Rule 5\\. \"No low effort comments. Comments that are only jokes, links, or 'written upvotes', for example. Humor, links, and affirmations of agreement can be contained within more substantial comments.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5)\n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Rule+5+Appeal+porkchop_d_clown&amp;message=porkchop_d_clown+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/65ajr9/cmv_most_americans_will_only_apply_critical/dg9ckaw/\\))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry porkchop_d_clown, your comment has been removed: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 5. &amp;quot;No low effort comments. Comments that are only jokes, links, or &amp;#39;written upvotes&amp;#39;, for example. Humor, links, and affirmations of agreement can be contained within more substantial comments.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5\"&gt;See the wiki page for more information.&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Rule+5+Appeal+porkchop_d_clown&amp;amp;message=porkchop_d_clown+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/65ajr9/cmv_most_americans_will_only_apply_critical/dg9ckaw/)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9dt5y", "score_hidden": false, "stickied": false, "created": 1492216954.0, "created_utc": 1492188154.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ckaw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65ajr9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9ckaw", "score_hidden": false, "stickied": false, "created": 1492215561.0, "created_utc": 1492186761.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]