[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For the sake of clarity, here&amp;#39;s what I&amp;#39;m &lt;em&gt;not&lt;/em&gt; arguing: I&amp;#39;m &lt;em&gt;not&lt;/em&gt; arguing that children don&amp;#39;t have a horrible time at school and in English lessons. As an English teacher I know all too well the myriad ways in which a pupil can have a miserable time in school or in lessons. There are so many different factors that can make the classroom a place of agony for some kids, and often their agony makes it agony for their classmates (and their teacher). &lt;/p&gt;\n\n&lt;p&gt;However I see people - grown adults - say that they do not read because reading was &amp;#39;spoilt&amp;#39; for them when they were at school. I don&amp;#39;t believe that this is an honest/correct excuse for not being a reader for the reasons I will give below. One small caveat: I do understand that in a handful of cases, people &lt;em&gt;may well&lt;/em&gt; have developed some horrible anxiety issue centred around reading thanks to their experience in school. I have no doubt that this is the case, as you can gain an anxiety problem over almost anything, but it isn&amp;#39;t really these people that are the subject of this post. I think people like this are in the extreme minority. The majority of people who say &amp;#39;I don&amp;#39;t read because school ruined reading for me&amp;#39; are either...&lt;/p&gt;\n\n&lt;p&gt;a) Disingenuous&lt;/p&gt;\n\n&lt;p&gt;Person X doesn&amp;#39;t read. Person X feels like they should read. They know reading will improve their vocabulary, their understanding of other cultures, their ability to empathise, and perhaps even they know that there are intense pleasures to be found in literature that few other art forms can match. They feel, therefore, a sense of guilt at their status as a non-reader. Perhaps even (depending on their social circles) a sense of shame as well. They need an excuse for why they do not read: an excuse to give others and, more importantly, an excuse to tell themselves. Their excuse is that they cannot enjoy literature because they didn&amp;#39;t enjoy their time in school and so &lt;em&gt;it must be school&amp;#39;s fault&lt;/em&gt;. The real reason why they don&amp;#39;t read is that they either have not quite made the effort to give it a proper go or they are somewhat ashamed at their own reading level and are conscious of their inability to access books beyond a &amp;#39;teen fiction&amp;#39; level.&lt;/p&gt;\n\n&lt;p&gt;b) Incorrect&lt;/p&gt;\n\n&lt;p&gt;Some people, however, genuinely believe that school has put them off literature for life. I contest that this is an ill-informed and immature point of view, based on a misunderstanding of literature. &lt;em&gt;Even if&lt;/em&gt; I concede that they have had Romeo and Juliet, The Great Gatsby, Great Expectations, Lord of the Flies and Of Mice and Men &amp;#39;spoilt&amp;#39; for them, what these people often do not realise is just how vast literature is. I think some people assume that in reading the above-mentioned texts, they&amp;#39;ve somehow had a holistic taste of what literature &amp;#39;is&amp;#39; and so therefore if they didn&amp;#39;t enjoy these texts at school they must hate all literature. The more you experience literature, the more you realise how under-read you are, and how little your tiny experience of it reflects the larger whole. You &lt;em&gt;certainly&lt;/em&gt; cannot experience any sort of microcosm of &amp;#39;literature&amp;#39; in the span of a school curriculum. &lt;/p&gt;\n\n&lt;p&gt;What the naysayers do not realise is that from these books they gained (to a greater or lesser extent, depending on their attitude as a pupil) reading skills which opened up many more books for them to potentially enjoy. They could spend all their life reading and never again touch one of the authors they studied in school, though they owe each author a debt nonetheless for being a stepping stone. Or they could wait 10 years and re-read Of Mice and Men and realise that their dislike of it was not because of school but because of being a teenager, and with maturity comes new appreciation for different things. More likely, I think, they&amp;#39;ll find Of Mice and Men rather simplistic and be stunned instead by the (far superior) East of Eden and The Grapes of Wrath. But many people will not make the effort to experience this, because they believe that they have &amp;#39;experienced literature&amp;#39; as a 15 year-old, and literature was not for them, so why try?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;I am not saying everyone can/should enjoy reading.&lt;/strong&gt; I am saying that it&amp;#39;s not school&amp;#39;s fault if people don&amp;#39;t: school does not turn keen readers into non-readers. People change from readers to non-readers for other reasons, and blame school for it.&lt;/p&gt;\n\n&lt;p&gt;So, to sum up, I hate sport. But I don&amp;#39;t hate sport because of school, and if I went around saying it&amp;#39;s school&amp;#39;s fault I hate sport people would be right to assume I am merely looking for someone to blame over a perceived failing. I don&amp;#39;t consider my dislike of sport to be a failing and so I don&amp;#39;t blame anyone or anything for it, and neither should non-readers.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;This is a footnote from the CMV moderators. We&amp;#39;d like to remind you of a couple of things. Firstly, please&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules\"&gt;read through our rules&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting\"&gt;downvotes don&amp;#39;t change views&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;! Any questions or concerns? Feel free to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/message/compose?to=/r/changemyview\"&gt;message us&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;Happy CMVing!&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "For the sake of clarity, here's what I'm *not* arguing: I'm *not* arguing that children don't have a horrible time at school and in English lessons. As an English teacher I know all too well the myriad ways in which a pupil can have a miserable time in school or in lessons. There are so many different factors that can make the classroom a place of agony for some kids, and often their agony makes it agony for their classmates (and their teacher). \n\nHowever I see people - grown adults - say that they do not read because reading was 'spoilt' for them when they were at school. I don't believe that this is an honest/correct excuse for not being a reader for the reasons I will give below. One small caveat: I do understand that in a handful of cases, people *may well* have developed some horrible anxiety issue centred around reading thanks to their experience in school. I have no doubt that this is the case, as you can gain an anxiety problem over almost anything, but it isn't really these people that are the subject of this post. I think people like this are in the extreme minority. The majority of people who say 'I don't read because school ruined reading for me' are either...\n\na) Disingenuous\n\nPerson X doesn't read. Person X feels like they should read. They know reading will improve their vocabulary, their understanding of other cultures, their ability to empathise, and perhaps even they know that there are intense pleasures to be found in literature that few other art forms can match. They feel, therefore, a sense of guilt at their status as a non-reader. Perhaps even (depending on their social circles) a sense of shame as well. They need an excuse for why they do not read: an excuse to give others and, more importantly, an excuse to tell themselves. Their excuse is that they cannot enjoy literature because they didn't enjoy their time in school and so *it must be school's fault*. The real reason why they don't read is that they either have not quite made the effort to give it a proper go or they are somewhat ashamed at their own reading level and are conscious of their inability to access books beyond a 'teen fiction' level.\n\nb) Incorrect\n\nSome people, however, genuinely believe that school has put them off literature for life. I contest that this is an ill-informed and immature point of view, based on a misunderstanding of literature. *Even if* I concede that they have had Romeo and Juliet, The Great Gatsby, Great Expectations, Lord of the Flies and Of Mice and Men 'spoilt' for them, what these people often do not realise is just how vast literature is. I think some people assume that in reading the above-mentioned texts, they've somehow had a holistic taste of what literature 'is' and so therefore if they didn't enjoy these texts at school they must hate all literature. The more you experience literature, the more you realise how under-read you are, and how little your tiny experience of it reflects the larger whole. You *certainly* cannot experience any sort of microcosm of 'literature' in the span of a school curriculum. \n\nWhat the naysayers do not realise is that from these books they gained (to a greater or lesser extent, depending on their attitude as a pupil) reading skills which opened up many more books for them to potentially enjoy. They could spend all their life reading and never again touch one of the authors they studied in school, though they owe each author a debt nonetheless for being a stepping stone. Or they could wait 10 years and re-read Of Mice and Men and realise that their dislike of it was not because of school but because of being a teenager, and with maturity comes new appreciation for different things. More likely, I think, they'll find Of Mice and Men rather simplistic and be stunned instead by the (far superior) East of Eden and The Grapes of Wrath. But many people will not make the effort to experience this, because they believe that they have 'experienced literature' as a 15 year-old, and literature was not for them, so why try?\n\n**I am not saying everyone can/should enjoy reading.** I am saying that it's not school's fault if people don't: school does not turn keen readers into non-readers. People change from readers to non-readers for other reasons, and blame school for it.\n\nSo, to sum up, I hate sport. But I don't hate sport because of school, and if I went around saying it's school's fault I hate sport people would be right to assume I am merely looking for someone to blame over a perceived failing. I don't consider my dislike of sport to be a failing and so I don't blame anyone or anything for it, and neither should non-readers.\n\n_____\n\n&gt; *This is a footnote from the CMV moderators. We'd like to remind you of a couple of things. Firstly, please* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "FTFdeltaOP", "id": "65bepz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "FaerieStories", "saved": false, "mod_reports": [], "name": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": 1492159724.0, "link_flair_css_class": "FTFdelta", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/65bepz/cmv_people_who_claim_to_have_had/", "num_reports": null, "locked": false, "stickied": false, "created": 1492187388.0, "url": "https://www.reddit.com/r/changemyview/comments/65bepz/cmv_people_who_claim_to_have_had/", "author_flair_text": "20∆", "quarantine": false, "title": "CMV: People who claim to have had literature/reading 'spoilt' for them at school are either being disingenuous or do not understand literature.", "created_utc": 1492158588.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 86, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg8z0r8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "/u/FaerieStories (OP) has awarded 1 delta in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [**here**](/r/DeltaLog/comments/65bo3f), in /r/DeltaLog.\n\nPlease note that a change of view [doesn't necessarily mean a reversal](https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F), or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/FaerieStories\"&gt;/u/FaerieStories&lt;/a&gt; (OP) has awarded 1 delta in this post.&lt;/p&gt;\n\n&lt;p&gt;All comments that earned deltas (from OP or other users) are listed &lt;a href=\"/r/DeltaLog/comments/65bo3f\"&gt;&lt;strong&gt;here&lt;/strong&gt;&lt;/a&gt;, in &lt;a href=\"/r/DeltaLog\"&gt;/r/DeltaLog&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Please note that a change of view &lt;a href=\"https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F\"&gt;doesn&amp;#39;t necessarily mean a reversal&lt;/a&gt;, or that the conversation has ended.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8z0r8", "score_hidden": true, "stickied": true, "created": 1492192476.0, "created_utc": 1492163676.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg99dfi", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "must-be-thursday", "parent_id": "t1_dg8zbfn", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Apologies if I'm not addressing your argument, I thought I was.\n\n&gt; I fully agree with what you just said. As I said in my last post, and as I said in my original post, I agree that studying a book at school can be a chore [...] If reading was an unpleasant experience at school, that's because the person did not like reading in the first place.\n\nYou seem to be contradicting yourself here. My point, which I can't tell whether or not you agree with, is that your last statement *\"that's because the person did not like reading in the first place\"* is false. Someone can like reading in general, and maybe they would have even liked a particular book if they just read it of their own volition, but studying it at school can be an unpleasant experience.\n\nAssuming you do agree with that, then we go back to your previous comment where you said\n\n&gt; I find the idea that that school can turn *future reading* into a 'chore' utterly absurd.\n\nI disagree with that too. Firstly, I think there's a strong argument that people simply learn to associate \"reading\" in general with unpleasant experiences, and this can put them off attempting it again. Secondly, I think this is can be made worse by habitually analysing a book as you read it, rather than simply enjoying it.\n\n&gt; I see that as a completely false dichotomy.\n\nI agree that's it's not a perfect dichotomy - some people can think deeply about a text and enjoy it. But I do think a lot of people get the most enjoyment out of reading for escapsim, and that analysing the text can nullify that, especially if this habit simply reminds them of unpleasant school experiences.\n\nYou use sport as an example to strengthen your case, but actually my experiences with sports suggests the opposite. As a kid, I would play football (soccer) with friends at lunchtime, and it was fun. Then in secondary school (high school) it was something we did as part of PE class, and it was miserable. It was just lots of drills, and lad culture which I hated. At university, I didn't even consider playing football again - although I was still fairly sporty in general, I'd decided I didn't like football. *Maybe* if I'd given it another go I would have enjoyed it again, but I didn't want to and I think it's fair to say that school 'spoilt' football for me.\n\nEdit: I see you're also from the UK. Sorry for the American translatations!", "edited": 1492183325.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Apologies if I&amp;#39;m not addressing your argument, I thought I was.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I fully agree with what you just said. As I said in my last post, and as I said in my original post, I agree that studying a book at school can be a chore [...] If reading was an unpleasant experience at school, that&amp;#39;s because the person did not like reading in the first place.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You seem to be contradicting yourself here. My point, which I can&amp;#39;t tell whether or not you agree with, is that your last statement &lt;em&gt;&amp;quot;that&amp;#39;s because the person did not like reading in the first place&amp;quot;&lt;/em&gt; is false. Someone can like reading in general, and maybe they would have even liked a particular book if they just read it of their own volition, but studying it at school can be an unpleasant experience.&lt;/p&gt;\n\n&lt;p&gt;Assuming you do agree with that, then we go back to your previous comment where you said&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I find the idea that that school can turn &lt;em&gt;future reading&lt;/em&gt; into a &amp;#39;chore&amp;#39; utterly absurd.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I disagree with that too. Firstly, I think there&amp;#39;s a strong argument that people simply learn to associate &amp;quot;reading&amp;quot; in general with unpleasant experiences, and this can put them off attempting it again. Secondly, I think this is can be made worse by habitually analysing a book as you read it, rather than simply enjoying it.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I see that as a completely false dichotomy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I agree that&amp;#39;s it&amp;#39;s not a perfect dichotomy - some people can think deeply about a text and enjoy it. But I do think a lot of people get the most enjoyment out of reading for escapsim, and that analysing the text can nullify that, especially if this habit simply reminds them of unpleasant school experiences.&lt;/p&gt;\n\n&lt;p&gt;You use sport as an example to strengthen your case, but actually my experiences with sports suggests the opposite. As a kid, I would play football (soccer) with friends at lunchtime, and it was fun. Then in secondary school (high school) it was something we did as part of PE class, and it was miserable. It was just lots of drills, and lad culture which I hated. At university, I didn&amp;#39;t even consider playing football again - although I was still fairly sporty in general, I&amp;#39;d decided I didn&amp;#39;t like football. &lt;em&gt;Maybe&lt;/em&gt; if I&amp;#39;d given it another go I would have enjoyed it again, but I didn&amp;#39;t want to and I think it&amp;#39;s fair to say that school &amp;#39;spoilt&amp;#39; football for me.&lt;/p&gt;\n\n&lt;p&gt;Edit: I see you&amp;#39;re also from the UK. Sorry for the American translatations!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg99dfi", "score_hidden": false, "stickied": false, "created": 1492211897.0, "created_utc": 1492183097.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg8zu42", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "truh", "parent_id": "t1_dg8zbfn", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Let's reorder that a bit to make the connection clearer.\n\n&gt; I do not see cause and effect. If reading was an unpleasant experience at school, that's because the person did not like reading in the first place and so being made to do it was a horrible chore. \n\n&gt;&gt; I think school can make reading a given book much more of an unpleasant experience than it would otherwise have been.\n\n&gt; I fully agree with what you just said.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Let&amp;#39;s reorder that a bit to make the connection clearer.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I do not see cause and effect. If reading was an unpleasant experience at school, that&amp;#39;s because the person did not like reading in the first place and so being made to do it was a horrible chore. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I think school can make reading a given book much more of an unpleasant experience than it would otherwise have been.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I fully agree with what you just said.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8zu42", "score_hidden": false, "stickied": false, "created": 1492195127.0, "created_utc": 1492166327.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zbfn", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg8z6bc", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "&gt;I think school can make reading a given book much more of an unpleasant experience than it would otherwise have been. Firstly, being compelled to do something inherently makes it less enjoyable than choosing to do it. Secondly, and more importantly, schools don't just want you to read the book - you're required to go over it again and again, dissect it, memorise segments, write essays about it. You might consider this giving people skills, but at the time its just unpleasant.\n\nYou're not responding to my argument. I fully agree with what you just said. As I said in my last post, and as I said in my original post, I agree that studying a book at school can be a chore, and I may even concede that studying, say, Of Mice and Men can ruin Of Mice and Men for you for life. That's not what I am arguing here.\n\n&gt;Furthermore, I think there's a very real possibility that this will impact future reading in a negative way - rather than getting lost in the story, there is a tendancy to automatically start analysing a book as you're reading it.\n\nI see that as a completely false dichotomy. You can still get lost in a book and think deeply about it. 'Analysis' isn't some kind of magical thing that destroys books: it's simply the process of actually *thinking* about what you're consuming.\n\n&gt; I also think you're seriously underestimating how strong simple classical conditioning can be - if reading is associated with unpleasant experiences throughout school, then that association can become very hard to get rid of.\n\nI do not see cause and effect. If reading was an unpleasant experience at school, that's because the person did not like reading in the first place and so being made to do it was a horrible chore. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I think school can make reading a given book much more of an unpleasant experience than it would otherwise have been. Firstly, being compelled to do something inherently makes it less enjoyable than choosing to do it. Secondly, and more importantly, schools don&amp;#39;t just want you to read the book - you&amp;#39;re required to go over it again and again, dissect it, memorise segments, write essays about it. You might consider this giving people skills, but at the time its just unpleasant.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re not responding to my argument. I fully agree with what you just said. As I said in my last post, and as I said in my original post, I agree that studying a book at school can be a chore, and I may even concede that studying, say, Of Mice and Men can ruin Of Mice and Men for you for life. That&amp;#39;s not what I am arguing here.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Furthermore, I think there&amp;#39;s a very real possibility that this will impact future reading in a negative way - rather than getting lost in the story, there is a tendancy to automatically start analysing a book as you&amp;#39;re reading it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I see that as a completely false dichotomy. You can still get lost in a book and think deeply about it. &amp;#39;Analysis&amp;#39; isn&amp;#39;t some kind of magical thing that destroys books: it&amp;#39;s simply the process of actually &lt;em&gt;thinking&lt;/em&gt; about what you&amp;#39;re consuming.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I also think you&amp;#39;re seriously underestimating how strong simple classical conditioning can be - if reading is associated with unpleasant experiences throughout school, then that association can become very hard to get rid of.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I do not see cause and effect. If reading was an unpleasant experience at school, that&amp;#39;s because the person did not like reading in the first place and so being made to do it was a horrible chore. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8zbfn", "score_hidden": false, "stickied": false, "created": 1492193475.0, "created_utc": 1492164675.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8z6bc", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "must-be-thursday", "parent_id": "t1_dg8yw3m", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think school can make reading a given book much more of an unpleasant experience than it would otherwise have been. Firstly, being compelled to do something inherently makes it less enjoyable than choosing to do it. Secondly, and more importantly, schools don't just want you to read the book - you're required to go over it again and again, dissect it, memorise segments, write essays about it. You might consider this giving people skills, but at the time its just unpleasant. Furthermore, I think there's a very real possibility that this *will* impact future reading in a negative way - rather than getting lost in the story, there is a tendancy to automatically start analysing a book as you're reading it.\n\nI also think you're seriously underestimating how strong simple classical conditioning can be - if reading is associated with unpleasant experiences throughout school, then that association can become very hard to get rid of.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think school can make reading a given book much more of an unpleasant experience than it would otherwise have been. Firstly, being compelled to do something inherently makes it less enjoyable than choosing to do it. Secondly, and more importantly, schools don&amp;#39;t just want you to read the book - you&amp;#39;re required to go over it again and again, dissect it, memorise segments, write essays about it. You might consider this giving people skills, but at the time its just unpleasant. Furthermore, I think there&amp;#39;s a very real possibility that this &lt;em&gt;will&lt;/em&gt; impact future reading in a negative way - rather than getting lost in the story, there is a tendancy to automatically start analysing a book as you&amp;#39;re reading it.&lt;/p&gt;\n\n&lt;p&gt;I also think you&amp;#39;re seriously underestimating how strong simple classical conditioning can be - if reading is associated with unpleasant experiences throughout school, then that association can become very hard to get rid of.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8z6bc", "score_hidden": false, "stickied": false, "created": 1492192998.0, "created_utc": 1492164198.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg9zw3o", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Akitten", "parent_id": "t1_dg8yw3m", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I disagree here. Imagine if as a kid, your main exposure to the concept of exercise was drill instructor levels of content push ups, sit ups, pull ups and running. If you did badly you'd get scolded and lose points. \n\nThat means that just as you are starting to learn things about yourself, the only feedback you are getting about exercise is that it's a stressful and painful experience.\n\nThat would have a lasting effect on your thoughts on the very concept. \n\nNow, I did Really well in English at school, but I was a reader long before we were forced to do it, and i just disassociated the bullshit analysis I was writing from the fun I have reading by myself. But for many, being forced to read novels in school is their only experience of the concept. That means that their only experience of reading novels is a negative one, coloring their view of it for the rest of their lives. \n\nIt's like how having a bad math teacher at the wrong time can really put you off math. The timing of English classes at school for some kids is when they are just learning the experience of properly reading. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I disagree here. Imagine if as a kid, your main exposure to the concept of exercise was drill instructor levels of content push ups, sit ups, pull ups and running. If you did badly you&amp;#39;d get scolded and lose points. &lt;/p&gt;\n\n&lt;p&gt;That means that just as you are starting to learn things about yourself, the only feedback you are getting about exercise is that it&amp;#39;s a stressful and painful experience.&lt;/p&gt;\n\n&lt;p&gt;That would have a lasting effect on your thoughts on the very concept. &lt;/p&gt;\n\n&lt;p&gt;Now, I did Really well in English at school, but I was a reader long before we were forced to do it, and i just disassociated the bullshit analysis I was writing from the fun I have reading by myself. But for many, being forced to read novels in school is their only experience of the concept. That means that their only experience of reading novels is a negative one, coloring their view of it for the rest of their lives. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s like how having a bad math teacher at the wrong time can really put you off math. The timing of English classes at school for some kids is when they are just learning the experience of properly reading. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9zw3o", "score_hidden": false, "stickied": false, "created": 1492244309.0, "created_utc": 1492215509.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8yw3m", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg8ys2l", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Whereas of course school-work *itself* is a chore, and perhaps having to read a book you've been assigned can be a chore if you don't like doing it, I find the idea that that school can turn *future reading* into a 'chore' utterly absurd. The sort of people who say this are the sort who haven't actually had the inclination to pick up a book from their library *at all*, and even if they do, and do find it a chore, it is not school's fault that it is such. They simply find reading an effort anyway: I do not believe that if they hadn't gone to school they would be avid readers. \n\nIf anything it's the exact opposite: school gives people the skills to find reading less of a chore. When you're better at reading, reading becomes easier and no longer feels like you have to 'work' to understand meaning.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whereas of course school-work &lt;em&gt;itself&lt;/em&gt; is a chore, and perhaps having to read a book you&amp;#39;ve been assigned can be a chore if you don&amp;#39;t like doing it, I find the idea that that school can turn &lt;em&gt;future reading&lt;/em&gt; into a &amp;#39;chore&amp;#39; utterly absurd. The sort of people who say this are the sort who haven&amp;#39;t actually had the inclination to pick up a book from their library &lt;em&gt;at all&lt;/em&gt;, and even if they do, and do find it a chore, it is not school&amp;#39;s fault that it is such. They simply find reading an effort anyway: I do not believe that if they hadn&amp;#39;t gone to school they would be avid readers. &lt;/p&gt;\n\n&lt;p&gt;If anything it&amp;#39;s the exact opposite: school gives people the skills to find reading less of a chore. When you&amp;#39;re better at reading, reading becomes easier and no longer feels like you have to &amp;#39;work&amp;#39; to understand meaning.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8yw3m", "score_hidden": false, "stickied": false, "created": 1492192050.0, "created_utc": 1492163250.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ys2l", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "must-be-thursday", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "While I don't personally feel this way, I do think you're missing the point slightly. The point is that experiences at school moved reading *in general* from being a fun pastime to a miserable chore. Sure, it's possible that if they tried they could overcome this feeling and rediscover the pleasures of reading, but I see that as a way to reverse the effects of school, rather than denying the effect exists in the first place.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While I don&amp;#39;t personally feel this way, I do think you&amp;#39;re missing the point slightly. The point is that experiences at school moved reading &lt;em&gt;in general&lt;/em&gt; from being a fun pastime to a miserable chore. Sure, it&amp;#39;s possible that if they tried they could overcome this feeling and rediscover the pleasures of reading, but I see that as a way to reverse the effects of school, rather than denying the effect exists in the first place.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8ys2l", "score_hidden": false, "stickied": false, "created": 1492191683.0, "created_utc": 1492162883.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg9ipc3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg9i537", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think the boring reality is that most teachers in most schools are not so awful they turn make students hate something or so awesome they make students love something, but just in between. Middling. So whereas there will be exceptional circumstances, in the majority of cases a far bigger factor in your enjoyment of something is your own predisposition.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the boring reality is that most teachers in most schools are not so awful they turn make students hate something or so awesome they make students love something, but just in between. Middling. So whereas there will be exceptional circumstances, in the majority of cases a far bigger factor in your enjoyment of something is your own predisposition.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9ipc3", "score_hidden": false, "stickied": false, "created": 1492222607.0, "created_utc": 1492193807.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9i537", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "McKoijion", "parent_id": "t1_dg9gz24", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; and that cause is not school but simply the proclivity of the child.\n\nI think we are getting into the basic issue with teacher/student (or doctor/patient, employer/employee, etc.) relationships. Who gets credit for success and who gets blamed for failure? If a student discovers they love chemistry, is is because they naturally love chemistry or is because they had a passionate teacher who inspired them to love it? If they hate it, is it because the teacher was boring or was it because they were not engaged? I think the answer lies somewhere in between. As such, schools are at least partially responsible for spoiling certain subjects for students. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;and that cause is not school but simply the proclivity of the child.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think we are getting into the basic issue with teacher/student (or doctor/patient, employer/employee, etc.) relationships. Who gets credit for success and who gets blamed for failure? If a student discovers they love chemistry, is is because they naturally love chemistry or is because they had a passionate teacher who inspired them to love it? If they hate it, is it because the teacher was boring or was it because they were not engaged? I think the answer lies somewhere in between. As such, schools are at least partially responsible for spoiling certain subjects for students. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9i537", "score_hidden": false, "stickied": false, "created": 1492221937.0, "created_utc": 1492193137.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9gz24", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg9g14s", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; no interaction with literature is better than a bad interaction.\n\nI think the 'bad interaction' is going to be inevitable for some people. Not everyone has to like literature, but a vast amount of people would never try it on their own volition, so at least school allows everyone to see whether it's for them or not. With perhaps a few minor exceptions, I think that those who do not enjoy literature at school are by and large those who would not be taking books out the library in their own time if they didn't encounter them at school.\n\n&gt;I think teachers should have more freedom to choose books that match their students' ability and interest. It would be different books for different classes at different schools. I don't think it should be standardized. I trust teachers more than I trust a standardized process.\n\nWell, amen to that.\n\n&gt;In my opinion, the content is not important. What matters is the underlying skillset. Students need to learn how to analyze literature and write response essays. The specific book they read doesn't matter.\n\nI agree with the sentiment, but in practice book choice is very important. Some books are simply very useful for teaching certain skills. There's a reason why Of Mice and Men is studied to death in secondary school. There are multiple things it does which make it great for illustrating certain narrative techniques that work really well in the classroom.\n\n&gt;You can watch a movie or play and still develop those skills.\n\nI'm all for multi-modal teaching, and I bring film into my lessons no matter what text I teach, but whereas there is an overlap in the analytical skillset, a student cannot develop literacy skills from watching something, nor can he learn about exclusively literary techniques.\n\n&gt;At the end of the day, I think reading should be fun, not work. All novels are written not just to spread a message, but to entertain. If your literature class constantly felt like work, I think it's fair to say it your school spoiled literature for you.\n\nI strongly disagree. Literature is important: it is not just for fun. It's about cultural understanding, historical, political and geographical awareness, the development of empathy, and the ability to analyse and think critically. More fundamentally it's also about learning to write, because you can't write well unless you can read well. Even if they go into a purely practical vocation later in life, students are going to need to know how to send emails and write CVs. Reading and writing are life skills and literature is the vessel through which we teach these.\n\n&gt; If your school's literature program constantly created negative feelings such as shame, boredom, failure, etc. and you never got back into literature, then I think it's fair to say they spoiled it for you.\n\nI would argue that in the majority of cases, the 'negative feelings' and the 'disaffected attitude towards reading' are not cause and effect, but rather they are both symptoms of the same root cause, and that cause is not school but simply the proclivity of the child.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;no interaction with literature is better than a bad interaction.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think the &amp;#39;bad interaction&amp;#39; is going to be inevitable for some people. Not everyone has to like literature, but a vast amount of people would never try it on their own volition, so at least school allows everyone to see whether it&amp;#39;s for them or not. With perhaps a few minor exceptions, I think that those who do not enjoy literature at school are by and large those who would not be taking books out the library in their own time if they didn&amp;#39;t encounter them at school.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I think teachers should have more freedom to choose books that match their students&amp;#39; ability and interest. It would be different books for different classes at different schools. I don&amp;#39;t think it should be standardized. I trust teachers more than I trust a standardized process.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, amen to that.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In my opinion, the content is not important. What matters is the underlying skillset. Students need to learn how to analyze literature and write response essays. The specific book they read doesn&amp;#39;t matter.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I agree with the sentiment, but in practice book choice is very important. Some books are simply very useful for teaching certain skills. There&amp;#39;s a reason why Of Mice and Men is studied to death in secondary school. There are multiple things it does which make it great for illustrating certain narrative techniques that work really well in the classroom.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You can watch a movie or play and still develop those skills.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m all for multi-modal teaching, and I bring film into my lessons no matter what text I teach, but whereas there is an overlap in the analytical skillset, a student cannot develop literacy skills from watching something, nor can he learn about exclusively literary techniques.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;At the end of the day, I think reading should be fun, not work. All novels are written not just to spread a message, but to entertain. If your literature class constantly felt like work, I think it&amp;#39;s fair to say it your school spoiled literature for you.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I strongly disagree. Literature is important: it is not just for fun. It&amp;#39;s about cultural understanding, historical, political and geographical awareness, the development of empathy, and the ability to analyse and think critically. More fundamentally it&amp;#39;s also about learning to write, because you can&amp;#39;t write well unless you can read well. Even if they go into a purely practical vocation later in life, students are going to need to know how to send emails and write CVs. Reading and writing are life skills and literature is the vessel through which we teach these.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If your school&amp;#39;s literature program constantly created negative feelings such as shame, boredom, failure, etc. and you never got back into literature, then I think it&amp;#39;s fair to say they spoiled it for you.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I would argue that in the majority of cases, the &amp;#39;negative feelings&amp;#39; and the &amp;#39;disaffected attitude towards reading&amp;#39; are not cause and effect, but rather they are both symptoms of the same root cause, and that cause is not school but simply the proclivity of the child.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9gz24", "score_hidden": false, "stickied": false, "created": 1492220579.0, "created_utc": 1492191779.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9g14s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "McKoijion", "parent_id": "t1_dg93cx7", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; It hasn't been 'spoilt' for them, it's just that they, as you say, have not been properly introduced to it yet. At least they have been introduced to it, so that's a start.\n\nI disagree. I think it's like an allergy. If you have regular contact with an allergen, your body becomes sensitized to it and you don't develop an allergy. If you have no contact with an allergen, your body never has a bad experience and you don't develop an allergy. If you have just a little bit of contact with an allergen and then don't see it again, your body panics the next time it contacts the allergen and you develop a potentially life threatening allergy. In this sense, no interaction with literature is better than a bad interaction.\n\n&gt; From the US curriculum, which texts, in your view, need to go, and which texts need to come in?\n\nI don't have any specific texts that I think everyone should read. I think teachers should have more freedom to choose books that match their students' ability and interest. It would be different books for different classes at different schools. I don't think it should be standardized. I trust teachers more than I trust a standardized process.\n\nIn my opinion, the content is not important. What matters is the underlying skillset. Students need to learn how to analyze literature and write response essays. The specific book they read doesn't matter. You don't even have to read a book. You can watch a movie or play and still develop those skills. I think you can get just as much out of watching Arrested Development as you could The Importance of Being Earnest.\n\nAt the end of the day, I think reading should be fun, not work. All novels are written not just to spread a message, but to entertain. If your literature class constantly felt like work, I think it's fair to say it your school spoiled literature for you.\n\nJust to give another example of what I mean, sometimes there are /r/AskReddit threads about working at a fast food chain or restaurant. People like eating at McDonald's or Taco Bell, but a lot of the employees in those threads say they refuse to eat at the place they used to work, even if they liked it beforehand. The food is supposed to taste good, but the negative feelings they developed at the job spoiled the restaurant experience for them. Literature is meant to entertain and enlighten. If your school's literature program constantly created negative feelings such as shame, boredom, failure, etc. and you never got back into literature, then I think it's fair to say they spoiled it for you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It hasn&amp;#39;t been &amp;#39;spoilt&amp;#39; for them, it&amp;#39;s just that they, as you say, have not been properly introduced to it yet. At least they have been introduced to it, so that&amp;#39;s a start.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I disagree. I think it&amp;#39;s like an allergy. If you have regular contact with an allergen, your body becomes sensitized to it and you don&amp;#39;t develop an allergy. If you have no contact with an allergen, your body never has a bad experience and you don&amp;#39;t develop an allergy. If you have just a little bit of contact with an allergen and then don&amp;#39;t see it again, your body panics the next time it contacts the allergen and you develop a potentially life threatening allergy. In this sense, no interaction with literature is better than a bad interaction.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;From the US curriculum, which texts, in your view, need to go, and which texts need to come in?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t have any specific texts that I think everyone should read. I think teachers should have more freedom to choose books that match their students&amp;#39; ability and interest. It would be different books for different classes at different schools. I don&amp;#39;t think it should be standardized. I trust teachers more than I trust a standardized process.&lt;/p&gt;\n\n&lt;p&gt;In my opinion, the content is not important. What matters is the underlying skillset. Students need to learn how to analyze literature and write response essays. The specific book they read doesn&amp;#39;t matter. You don&amp;#39;t even have to read a book. You can watch a movie or play and still develop those skills. I think you can get just as much out of watching Arrested Development as you could The Importance of Being Earnest.&lt;/p&gt;\n\n&lt;p&gt;At the end of the day, I think reading should be fun, not work. All novels are written not just to spread a message, but to entertain. If your literature class constantly felt like work, I think it&amp;#39;s fair to say it your school spoiled literature for you.&lt;/p&gt;\n\n&lt;p&gt;Just to give another example of what I mean, sometimes there are &lt;a href=\"/r/AskReddit\"&gt;/r/AskReddit&lt;/a&gt; threads about working at a fast food chain or restaurant. People like eating at McDonald&amp;#39;s or Taco Bell, but a lot of the employees in those threads say they refuse to eat at the place they used to work, even if they liked it beforehand. The food is supposed to taste good, but the negative feelings they developed at the job spoiled the restaurant experience for them. Literature is meant to entertain and enlighten. If your school&amp;#39;s literature program constantly created negative feelings such as shame, boredom, failure, etc. and you never got back into literature, then I think it&amp;#39;s fair to say they spoiled it for you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9g14s", "score_hidden": false, "stickied": false, "created": 1492219481.0, "created_utc": 1492190681.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg93cx7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg931qr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Sure, but I'm probably not going to give it a second try. The one bad experience was enough to turn me off of it, even if I would have liked it if I had a good experience the first time. The same thing applies to literature and young students. Many of them if they were introduced to it properly would have enjoyed it, but because of the way they were introduced, they will go their whole life without it. And they won't even realize they are missing out on something.\n\nWell, I agree, and I don't think that contradicts my argument. It goes in hand with my second argument: these people who claim literature has been 'spoilt' for them are simply wrong and ill-informed. It hasn't been 'spoilt' for them, it's just that they, as you say, have not been properly introduced to it yet. At least they *have* been introduced to it, so that's a start.\n\n&gt;One of the big problems is the idea of the canon. There are a handful of books that educators think students should read. But almost all of them represent the views of a tiny fraction of the human population, namely wealthy Western European or American Christian men from decades or centuries ago. If you define literature as those books that have artistic merit, and then limit artistic merit to a small number of authors, many readers are left out. There's usually a token book written by a woman or a black man in the school curriculum, but it's very limited. If all you ever introduce students to are the views of canon authors, they'll never realize that there are other things out there. If all you ever give people to drink are Bud Light and Miller, they might decide they hate the taste of beer, even if they would enjoy stouts, Belgian whites, IPA's etc.\n\nWell, I can't speak for the American curriculum, but the British curriculum is very diverse. It certainly could be *more* diverse, but it's diverse enough to give students a small taste of various styles. Of Mice and Men and Romeo and Juliet are two texts that have always been studied to death, and they could not be more different. These texts have been taught for centuries not because they're part of some sort of 'canon', but because they are seminal works of literature with artistic merit and - most importantly - they are highly accessible to students. Of Mice and Men is a book that I dislike as a piece of literature and find much inferior to Steinbeck's other work, but is absolutely brilliant for teaching students essential skills of understanding literature, especially concerning how literature and society become mirrors of one another.\n\nFrom the US curriculum, which texts, in your view, need to go, and which texts need to come in?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Sure, but I&amp;#39;m probably not going to give it a second try. The one bad experience was enough to turn me off of it, even if I would have liked it if I had a good experience the first time. The same thing applies to literature and young students. Many of them if they were introduced to it properly would have enjoyed it, but because of the way they were introduced, they will go their whole life without it. And they won&amp;#39;t even realize they are missing out on something.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, I agree, and I don&amp;#39;t think that contradicts my argument. It goes in hand with my second argument: these people who claim literature has been &amp;#39;spoilt&amp;#39; for them are simply wrong and ill-informed. It hasn&amp;#39;t been &amp;#39;spoilt&amp;#39; for them, it&amp;#39;s just that they, as you say, have not been properly introduced to it yet. At least they &lt;em&gt;have&lt;/em&gt; been introduced to it, so that&amp;#39;s a start.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;One of the big problems is the idea of the canon. There are a handful of books that educators think students should read. But almost all of them represent the views of a tiny fraction of the human population, namely wealthy Western European or American Christian men from decades or centuries ago. If you define literature as those books that have artistic merit, and then limit artistic merit to a small number of authors, many readers are left out. There&amp;#39;s usually a token book written by a woman or a black man in the school curriculum, but it&amp;#39;s very limited. If all you ever introduce students to are the views of canon authors, they&amp;#39;ll never realize that there are other things out there. If all you ever give people to drink are Bud Light and Miller, they might decide they hate the taste of beer, even if they would enjoy stouts, Belgian whites, IPA&amp;#39;s etc.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, I can&amp;#39;t speak for the American curriculum, but the British curriculum is very diverse. It certainly could be &lt;em&gt;more&lt;/em&gt; diverse, but it&amp;#39;s diverse enough to give students a small taste of various styles. Of Mice and Men and Romeo and Juliet are two texts that have always been studied to death, and they could not be more different. These texts have been taught for centuries not because they&amp;#39;re part of some sort of &amp;#39;canon&amp;#39;, but because they are seminal works of literature with artistic merit and - most importantly - they are highly accessible to students. Of Mice and Men is a book that I dislike as a piece of literature and find much inferior to Steinbeck&amp;#39;s other work, but is absolutely brilliant for teaching students essential skills of understanding literature, especially concerning how literature and society become mirrors of one another.&lt;/p&gt;\n\n&lt;p&gt;From the US curriculum, which texts, in your view, need to go, and which texts need to come in?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg93cx7", "score_hidden": false, "stickied": false, "created": 1492203419.0, "created_utc": 1492174619.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg931qr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "McKoijion", "parent_id": "t1_dg923cs", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Well, indeed, but the argument was meant to be that golf has been 'spoilt' for you. Golf hasn't been 'spoilt' for you: it's still there for you to potentially enjoy if you ever choose to give it a second try.\n\nSure, but I'm probably not going to give it a second try. The one bad experience was enough to turn me off of it, even if I would have liked it if I had a good experience the first time. The same thing applies to literature and young students. Many of them if they were introduced to it properly would have enjoyed it, but because of the way they were introduced, they will go their whole life without it. And they won't even realize they are missing out on something.\n\n&gt; My view is that literature was never for them. Literature can't be for everybody: nothing is.\n\nAccording to Google, literature refers to written works that have \"superior or lasting artistic merit.\" I think anyone who enjoys storytelling in the form of television and film would also enjoy literature. There might be a few people who don't like storytelling at all, but I think that accounts for a very tiny percentage of people who don't read. Most enjoy storytelling, but don't like the content of what they are forced to read in school.\n\nOne of the big problems is the idea of the canon. There are a handful of books that educators think students should read. But almost all of them represent the views of a tiny fraction of the human population, namely wealthy Western European or American Christian men from decades or centuries ago. If you define literature as those books that have artistic merit, and then limit artistic merit to a small number of authors, many readers are left out. There's usually a token book written by a woman or a black man in the school curriculum, but it's very limited. If all you ever introduce students to are the views of canon authors, they'll never realize that there are other things out there. If all you ever give people to drink are Bud Light and Miller, they might decide they hate the taste of beer, even if they would enjoy stouts, Belgian whites, IPA's etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Well, indeed, but the argument was meant to be that golf has been &amp;#39;spoilt&amp;#39; for you. Golf hasn&amp;#39;t been &amp;#39;spoilt&amp;#39; for you: it&amp;#39;s still there for you to potentially enjoy if you ever choose to give it a second try.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sure, but I&amp;#39;m probably not going to give it a second try. The one bad experience was enough to turn me off of it, even if I would have liked it if I had a good experience the first time. The same thing applies to literature and young students. Many of them if they were introduced to it properly would have enjoyed it, but because of the way they were introduced, they will go their whole life without it. And they won&amp;#39;t even realize they are missing out on something.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;My view is that literature was never for them. Literature can&amp;#39;t be for everybody: nothing is.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;According to Google, literature refers to written works that have &amp;quot;superior or lasting artistic merit.&amp;quot; I think anyone who enjoys storytelling in the form of television and film would also enjoy literature. There might be a few people who don&amp;#39;t like storytelling at all, but I think that accounts for a very tiny percentage of people who don&amp;#39;t read. Most enjoy storytelling, but don&amp;#39;t like the content of what they are forced to read in school.&lt;/p&gt;\n\n&lt;p&gt;One of the big problems is the idea of the canon. There are a handful of books that educators think students should read. But almost all of them represent the views of a tiny fraction of the human population, namely wealthy Western European or American Christian men from decades or centuries ago. If you define literature as those books that have artistic merit, and then limit artistic merit to a small number of authors, many readers are left out. There&amp;#39;s usually a token book written by a woman or a black man in the school curriculum, but it&amp;#39;s very limited. If all you ever introduce students to are the views of canon authors, they&amp;#39;ll never realize that there are other things out there. If all you ever give people to drink are Bud Light and Miller, they might decide they hate the taste of beer, even if they would enjoy stouts, Belgian whites, IPA&amp;#39;s etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg931qr", "score_hidden": false, "stickied": false, "created": 1492202853.0, "created_utc": 1492174053.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg923cs", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg90pqk", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Opportunity cost. There are a hundred other things that I know I enjoy, and a thousand things I haven't yet tried. Why spend my time doing something that I've already tried once and didn't enjoy?\n\nWell, indeed, but the argument was meant to be that golf has been 'spoilt' for you. Golf hasn't been 'spoilt' for you: it's still there for you to potentially enjoy if you ever choose to give it a second try.\n\n&gt;Sure, but there is a difference between a staircase and a ramp. If you are already on unsure footing, it's hard to jump into complex literature.\n\nWell, this is a different topic of debate for a different day, but I'm unsure as to what curriculum change you would suggest. \n\n&gt;And for those kids, it makes sense to say that literature was \"spoilt\" for them. Not actively (spoilt implies someone did it on purpose), but passively.\n\nMy view is that literature was never for them. Literature can't be for everybody: nothing is. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Opportunity cost. There are a hundred other things that I know I enjoy, and a thousand things I haven&amp;#39;t yet tried. Why spend my time doing something that I&amp;#39;ve already tried once and didn&amp;#39;t enjoy?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, indeed, but the argument was meant to be that golf has been &amp;#39;spoilt&amp;#39; for you. Golf hasn&amp;#39;t been &amp;#39;spoilt&amp;#39; for you: it&amp;#39;s still there for you to potentially enjoy if you ever choose to give it a second try.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Sure, but there is a difference between a staircase and a ramp. If you are already on unsure footing, it&amp;#39;s hard to jump into complex literature.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, this is a different topic of debate for a different day, but I&amp;#39;m unsure as to what curriculum change you would suggest. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And for those kids, it makes sense to say that literature was &amp;quot;spoilt&amp;quot; for them. Not actively (spoilt implies someone did it on purpose), but passively.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;My view is that literature was never for them. Literature can&amp;#39;t be for everybody: nothing is. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg923cs", "score_hidden": false, "stickied": false, "created": 1492200972.0, "created_utc": 1492172172.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg90pqk", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "McKoijion", "parent_id": "t1_dg8zhx9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; What's stopping you from just going to a golf course (without him) and swinging away at a ball for a bit?\n\nOpportunity cost. There are a hundred other things that I know I enjoy, and a thousand things I haven't yet tried. Why spend my time doing something that I've already tried once and didn't enjoy?\n\n&gt; Schools need to teach students certain skills. You can't teach skills by getting people to do what they can already do.\n\nSure, but there is a difference between a staircase and a ramp. If you are already on unsure footing, it's hard to jump into complex literature.\n\n&gt; teachers spend hours of their time and devote so much stress and energy and tears into trying to make their subject accessible for children. It's the biggest challenge of the profession.\n\nI'm not blaming anyone. Sometimes kids fall through the cracks, no matter how great their teachers are. If it's the biggest challenge of the profession, it makes sense that teachers aren't going to be successful every time. And for those kids, it makes sense to say that literature was \"spoilt\" for them. Not actively (spoilt implies someone did it on purpose), but passively.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What&amp;#39;s stopping you from just going to a golf course (without him) and swinging away at a ball for a bit?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Opportunity cost. There are a hundred other things that I know I enjoy, and a thousand things I haven&amp;#39;t yet tried. Why spend my time doing something that I&amp;#39;ve already tried once and didn&amp;#39;t enjoy?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Schools need to teach students certain skills. You can&amp;#39;t teach skills by getting people to do what they can already do.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sure, but there is a difference between a staircase and a ramp. If you are already on unsure footing, it&amp;#39;s hard to jump into complex literature.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;teachers spend hours of their time and devote so much stress and energy and tears into trying to make their subject accessible for children. It&amp;#39;s the biggest challenge of the profession.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not blaming anyone. Sometimes kids fall through the cracks, no matter how great their teachers are. If it&amp;#39;s the biggest challenge of the profession, it makes sense that teachers aren&amp;#39;t going to be successful every time. And for those kids, it makes sense to say that literature was &amp;quot;spoilt&amp;quot; for them. Not actively (spoilt implies someone did it on purpose), but passively.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg90pqk", "score_hidden": false, "stickied": false, "created": 1492197694.0, "created_utc": 1492168894.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg8zs9w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "truh", "parent_id": "t1_dg8zhx9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; What's stopping you from just going to a golf course (without him) and swinging away at a ball for a bit? If you're self-aware enough to know that you might potentially enjoy golf without having to feel you need to be good at it, what's stopping you from giving it a go? Was the initial experience really that traumatic or embarrassing or repulsive that you have some kind of physiological aversion towards the sport?\n\nWhen you first start with a new activity, chances are go into it with some kind of child like enthusiasm. If you keep doing the activity you either discover some deeper joy or you lose interest after some time. If you loose your enthusiasm before you were able to truly enjoy the activity, it can be pretty hard to get back into it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What&amp;#39;s stopping you from just going to a golf course (without him) and swinging away at a ball for a bit? If you&amp;#39;re self-aware enough to know that you might potentially enjoy golf without having to feel you need to be good at it, what&amp;#39;s stopping you from giving it a go? Was the initial experience really that traumatic or embarrassing or repulsive that you have some kind of physiological aversion towards the sport?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;When you first start with a new activity, chances are go into it with some kind of child like enthusiasm. If you keep doing the activity you either discover some deeper joy or you lose interest after some time. If you loose your enthusiasm before you were able to truly enjoy the activity, it can be pretty hard to get back into it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8zs9w", "score_hidden": false, "stickied": false, "created": 1492194966.0, "created_utc": 1492166166.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zhx9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg8z5ur", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Someday I might still rediscover golf and realize I like it, but I have no desire to even try. I just associate it with work, rather than fun. What he should have done is just let me go out and have fun, then I would improve because I wanted to, not because he wanted me to.\n\nWhat's stopping you from just going to a golf course (without him) and swinging away at a ball for a bit? If you're self-aware enough to know that you might potentially enjoy golf without having to feel you need to be good at it, what's stopping you from giving it a go? Was the initial experience really that traumatic or embarrassing or repulsive that you have some kind of physiological aversion towards the sport?\n\n&gt;Schools teach literature in the same didactic way. They give students challenging books they want children to read, rather than fun, easy books they children want to read themselves.\n\nSchools need to teach students certain skills. You can't teach skills by getting people to do what they can already do. \n\n&gt;If a kid is having trouble, they don't slow down to make sure they catch up\n\nYou mentioned the American education system and I can't speak for that country (nor can I speak entirely for my own country of England - there are thousands of schools and thousands of teachers) but from my limited experience of the handful of schools I've worked in, teachers spend *hours* of their time and devote so much stress and energy and tears into trying to make their subject accessible for children. It's the biggest challenge of the profession. A student needs his/her GCSE in English and you have to somehow find a way to get him/her to the level of passing it.\n\n&gt;The point I'm trying to make is that people learn better in experiential rather than didactic methods. If my mother simply tells me a stove is hot, I won't learn as well as if I touch the stove and burn my hand. The American school system aims for \"good enough\" rather than developing people who actually appreciate literature.\n\nI agree. That's how I was trained as a teacher.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Someday I might still rediscover golf and realize I like it, but I have no desire to even try. I just associate it with work, rather than fun. What he should have done is just let me go out and have fun, then I would improve because I wanted to, not because he wanted me to.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What&amp;#39;s stopping you from just going to a golf course (without him) and swinging away at a ball for a bit? If you&amp;#39;re self-aware enough to know that you might potentially enjoy golf without having to feel you need to be good at it, what&amp;#39;s stopping you from giving it a go? Was the initial experience really that traumatic or embarrassing or repulsive that you have some kind of physiological aversion towards the sport?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Schools teach literature in the same didactic way. They give students challenging books they want children to read, rather than fun, easy books they children want to read themselves.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Schools need to teach students certain skills. You can&amp;#39;t teach skills by getting people to do what they can already do. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If a kid is having trouble, they don&amp;#39;t slow down to make sure they catch up&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You mentioned the American education system and I can&amp;#39;t speak for that country (nor can I speak entirely for my own country of England - there are thousands of schools and thousands of teachers) but from my limited experience of the handful of schools I&amp;#39;ve worked in, teachers spend &lt;em&gt;hours&lt;/em&gt; of their time and devote so much stress and energy and tears into trying to make their subject accessible for children. It&amp;#39;s the biggest challenge of the profession. A student needs his/her GCSE in English and you have to somehow find a way to get him/her to the level of passing it.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The point I&amp;#39;m trying to make is that people learn better in experiential rather than didactic methods. If my mother simply tells me a stove is hot, I won&amp;#39;t learn as well as if I touch the stove and burn my hand. The American school system aims for &amp;quot;good enough&amp;quot; rather than developing people who actually appreciate literature.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I agree. That&amp;#39;s how I was trained as a teacher.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8zhx9", "score_hidden": false, "stickied": false, "created": 1492194063.0, "created_utc": 1492165263.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8z5ur", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "McKoijion", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Humans are experiential learners. You try something, and if you have a positive experience, you like it and try it again. If you try something and have a negative experience, you will dislike it. I think it's possible to manufacture experiences that people enjoy, and manufacture experiences that people hate.\n\nAs an example, I know someone who ruined golf for me. He tried to teach me how to play the game. What I wanted to do was go out, walk around in the sunshine, hit the ball, and try to get it in the hole. But instead of playing the game poorly for fun, he made me spend the entire time just working on how to hit the ball correctly. We stood in place the entire time and did drills where I hit the ball and he critiqued my form. It was unbelievably boring, and I felt terrible because I couldn't get it right. \n\nIt wasn't his fault. He wanted me to learn the correct technique because if you develop bad habits early, it's harder to correct them. But it was such an unpleasant experience that it ruined golf for me. You could argue that I didn't put in enough effort to really appreciate the game, but I don't care. There are millions of other great things out there. Someday I might still rediscover golf and realize I like it, but I have no desire to even try. I just associate it with work, rather than fun. What he should have done is just let me go out and have fun, then I would improve because I wanted to, not because he wanted me to.\n\nSchools teach literature in the same didactic way. They give students challenging books they want children to read, rather than fun, easy books they children want to read themselves. That just fills people with negative emotions. It's hard and they feel bad about themselves for not succeeding. It's boring because it's a topic they were forced to read, and not one they chose to read. It's an unpleasant experience all around. Plus, like my golf coach who only took me out once, schools focus on getting all kids to read. If a kid is having trouble, they don't slow down to make sure they catch up. Meeting a challenging obstacle is only fun when you overcome it. But if the time limit runs out and you never achieve it, it feels horrible. \n\nThis is a major problem in the American educational system, and one that some innovative educators are trying to solve. Sal Khan of Khan Academy really focuses on this idea of making learning fun. Kumon makes sure students fully overcome a challenge before giving them the next one. Many graduate programs in law, business, medicine, engineering have switched to using the case method. Instead of lectures, students are given a topic to solve. They learn things because they have to look them up in order to solve a problem.\n\nI enjoy reading because I started reading really easy books when I was very young. The only times I moved on to more complex ones is when I got bored with the easy ones and wanted a new challenge myself, not because someone made me want to do it. I've gotten good at Counter-Strike because I was kind of good at it and wanted to get better on my own. \n\nThe point I'm trying to make is that people learn better in experiential rather than didactic methods. If my mother simply tells me a stove is hot, I won't learn as well as if I touch the stove and burn my hand. The American school system aims for \"good enough\" rather than developing people who actually appreciate literature. \n\nSo I agree with the two points you made. I'd like to say it's the individual's fault. But so many people say they don't read literature after high school that I don't think it's fair to blame every person. If one person is fat, it's their fault. If everyone is fat, it's a systemic issue. And I think that the American education system often does spoil otherwise fun subjects for people by creating too many negative experiences upfront.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Humans are experiential learners. You try something, and if you have a positive experience, you like it and try it again. If you try something and have a negative experience, you will dislike it. I think it&amp;#39;s possible to manufacture experiences that people enjoy, and manufacture experiences that people hate.&lt;/p&gt;\n\n&lt;p&gt;As an example, I know someone who ruined golf for me. He tried to teach me how to play the game. What I wanted to do was go out, walk around in the sunshine, hit the ball, and try to get it in the hole. But instead of playing the game poorly for fun, he made me spend the entire time just working on how to hit the ball correctly. We stood in place the entire time and did drills where I hit the ball and he critiqued my form. It was unbelievably boring, and I felt terrible because I couldn&amp;#39;t get it right. &lt;/p&gt;\n\n&lt;p&gt;It wasn&amp;#39;t his fault. He wanted me to learn the correct technique because if you develop bad habits early, it&amp;#39;s harder to correct them. But it was such an unpleasant experience that it ruined golf for me. You could argue that I didn&amp;#39;t put in enough effort to really appreciate the game, but I don&amp;#39;t care. There are millions of other great things out there. Someday I might still rediscover golf and realize I like it, but I have no desire to even try. I just associate it with work, rather than fun. What he should have done is just let me go out and have fun, then I would improve because I wanted to, not because he wanted me to.&lt;/p&gt;\n\n&lt;p&gt;Schools teach literature in the same didactic way. They give students challenging books they want children to read, rather than fun, easy books they children want to read themselves. That just fills people with negative emotions. It&amp;#39;s hard and they feel bad about themselves for not succeeding. It&amp;#39;s boring because it&amp;#39;s a topic they were forced to read, and not one they chose to read. It&amp;#39;s an unpleasant experience all around. Plus, like my golf coach who only took me out once, schools focus on getting all kids to read. If a kid is having trouble, they don&amp;#39;t slow down to make sure they catch up. Meeting a challenging obstacle is only fun when you overcome it. But if the time limit runs out and you never achieve it, it feels horrible. &lt;/p&gt;\n\n&lt;p&gt;This is a major problem in the American educational system, and one that some innovative educators are trying to solve. Sal Khan of Khan Academy really focuses on this idea of making learning fun. Kumon makes sure students fully overcome a challenge before giving them the next one. Many graduate programs in law, business, medicine, engineering have switched to using the case method. Instead of lectures, students are given a topic to solve. They learn things because they have to look them up in order to solve a problem.&lt;/p&gt;\n\n&lt;p&gt;I enjoy reading because I started reading really easy books when I was very young. The only times I moved on to more complex ones is when I got bored with the easy ones and wanted a new challenge myself, not because someone made me want to do it. I&amp;#39;ve gotten good at Counter-Strike because I was kind of good at it and wanted to get better on my own. &lt;/p&gt;\n\n&lt;p&gt;The point I&amp;#39;m trying to make is that people learn better in experiential rather than didactic methods. If my mother simply tells me a stove is hot, I won&amp;#39;t learn as well as if I touch the stove and burn my hand. The American school system aims for &amp;quot;good enough&amp;quot; rather than developing people who actually appreciate literature. &lt;/p&gt;\n\n&lt;p&gt;So I agree with the two points you made. I&amp;#39;d like to say it&amp;#39;s the individual&amp;#39;s fault. But so many people say they don&amp;#39;t read literature after high school that I don&amp;#39;t think it&amp;#39;s fair to blame every person. If one person is fat, it&amp;#39;s their fault. If everyone is fat, it&amp;#39;s a systemic issue. And I think that the American education system often does spoil otherwise fun subjects for people by creating too many negative experiences upfront.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8z5ur", "score_hidden": false, "stickied": false, "created": 1492192952.0, "created_utc": 1492164152.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg9bhdb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "himyredditnameis", "parent_id": "t1_dg92ab3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;that sounds like an effort thing\n\nYeah I'll give you that. I feel like don't enjoy reading, so I don't want to put the effort into it. I find the stories aren't worth all the reading most of the time. I don't really like rock climbing, so I don't go to my local climbing wall and put effort into getting better.\n\n&gt;Somewhere out there will be a book that will serve as an 'entrance point' to reading.\n\nThat's very possible, my mum got me a book I have wanted to read for ages (since before GCSEs) for Christmas, however I'm yet to get through a page. Maybe one day. \n\n&gt;now walks you might do that are half the distance and without the heavy backpack are going to feel much easier \n\nWhen it comes to hiking, this is true. I am still in GirlGuiding now, and when I am required to go hiking, I know I can get through it because DofE was worse.\n\nWhen it comes to reading, I guess this is true, I bet there are poems, plays and novels out there that I wouldn't be able to enjoy before GCSEs that I can access now.\n\n&gt;you may even be in the position of being able to enjoy those walks when you wouldn't enjoy them before.\n\nWhen it comes to hiking (and many other things now I think about it), now I've done one big outing, I don't like to do them anymore, I feel been there, done that, and I remember how it felt. I'm yet to voluntarily go hiking since.\n\nWhen it comes to reading, I think I am so intimidated by the idea of it, that I don't even want to try to the easy ones.\n\n\nI think for people who have stopped enjoying reading since school time, there is little reason to try again. I'm not saying reading doesn't have it's benefits, but rarely will you find yourself in a situation where it's essential to read a novel.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;that sounds like an effort thing&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah I&amp;#39;ll give you that. I feel like don&amp;#39;t enjoy reading, so I don&amp;#39;t want to put the effort into it. I find the stories aren&amp;#39;t worth all the reading most of the time. I don&amp;#39;t really like rock climbing, so I don&amp;#39;t go to my local climbing wall and put effort into getting better.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Somewhere out there will be a book that will serve as an &amp;#39;entrance point&amp;#39; to reading.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s very possible, my mum got me a book I have wanted to read for ages (since before GCSEs) for Christmas, however I&amp;#39;m yet to get through a page. Maybe one day. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;now walks you might do that are half the distance and without the heavy backpack are going to feel much easier &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;When it comes to hiking, this is true. I am still in GirlGuiding now, and when I am required to go hiking, I know I can get through it because DofE was worse.&lt;/p&gt;\n\n&lt;p&gt;When it comes to reading, I guess this is true, I bet there are poems, plays and novels out there that I wouldn&amp;#39;t be able to enjoy before GCSEs that I can access now.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;you may even be in the position of being able to enjoy those walks when you wouldn&amp;#39;t enjoy them before.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;When it comes to hiking (and many other things now I think about it), now I&amp;#39;ve done one big outing, I don&amp;#39;t like to do them anymore, I feel been there, done that, and I remember how it felt. I&amp;#39;m yet to voluntarily go hiking since.&lt;/p&gt;\n\n&lt;p&gt;When it comes to reading, I think I am so intimidated by the idea of it, that I don&amp;#39;t even want to try to the easy ones.&lt;/p&gt;\n\n&lt;p&gt;I think for people who have stopped enjoying reading since school time, there is little reason to try again. I&amp;#39;m not saying reading doesn&amp;#39;t have it&amp;#39;s benefits, but rarely will you find yourself in a situation where it&amp;#39;s essential to read a novel.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9bhdb", "score_hidden": false, "stickied": false, "created": 1492214371.0, "created_utc": 1492185571.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg9cs1k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PineappleSlices", "parent_id": "t1_dg92ab3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I feel like they are approaching this from the wrong angle. \n\nI think we all agree that a student who loses interest in reading is missing out on the potential enjoyment of good stories. That's not controversial. The question here is *why*. Why are students opting to not read, when they could otherwise be enjoying stories? \n\nIf schools constantly frame reading in a context where it is not even anxiety inducing, but simply tedious and boring, then the students will learn to view reading as something that is tedious and boring. Not just those particular books, but the act of reading in general. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like they are approaching this from the wrong angle. &lt;/p&gt;\n\n&lt;p&gt;I think we all agree that a student who loses interest in reading is missing out on the potential enjoyment of good stories. That&amp;#39;s not controversial. The question here is &lt;em&gt;why&lt;/em&gt;. Why are students opting to not read, when they could otherwise be enjoying stories? &lt;/p&gt;\n\n&lt;p&gt;If schools constantly frame reading in a context where it is not even anxiety inducing, but simply tedious and boring, then the students will learn to view reading as something that is tedious and boring. Not just those particular books, but the act of reading in general. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9cs1k", "score_hidden": false, "stickied": false, "created": 1492215795.0, "created_utc": 1492186995.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg92ab3", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg910oe", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;I had already read the linked exchange you had with the other user, but I felt like I should still speak up, as what I feel is not quite as serious. For me, it's more of a slight aversion, I'd just rather not have to. And if I don't have to, I wont.\n\nSorry to say, but that sounds like an effort thing. I'm not saying you *have* to become a reader or that you're inferior for not being one, but it is my strong belief that there's a world of pleasure you are to some extent choosing to lock yourself away from - *especially* if you know you find stories enjoyable even if you don't like the process of reading them. Somewhere out there will be a book that will serve as an 'entrance point' to reading.\n\n&gt;An analogy I can think of, is that I did the Silver Duke of Edinburgh award. When it comes to the expedition we went on, I did not enjoy hiking with 20kgs on my back, I did not enjoy not showering for a couple days, I did not enjoy waking up in a tent, knowing you'll have to sleep in a tent again at the end of the day (I could go on and on), but I don't regret going on it, I'm glad I have stories to tell, and that I can say I've done it. But now that I've done it, I know for sure I will certainly not be doing Gold.\n\nSure, but now walks you might do that are half the distance and without the heavy backpack are going to feel much easier (partly due to fitness and partly due to relativity) and you may even be in the position of being able to enjoy those walks when you wouldn't enjoy them before. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I had already read the linked exchange you had with the other user, but I felt like I should still speak up, as what I feel is not quite as serious. For me, it&amp;#39;s more of a slight aversion, I&amp;#39;d just rather not have to. And if I don&amp;#39;t have to, I wont.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sorry to say, but that sounds like an effort thing. I&amp;#39;m not saying you &lt;em&gt;have&lt;/em&gt; to become a reader or that you&amp;#39;re inferior for not being one, but it is my strong belief that there&amp;#39;s a world of pleasure you are to some extent choosing to lock yourself away from - &lt;em&gt;especially&lt;/em&gt; if you know you find stories enjoyable even if you don&amp;#39;t like the process of reading them. Somewhere out there will be a book that will serve as an &amp;#39;entrance point&amp;#39; to reading.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;An analogy I can think of, is that I did the Silver Duke of Edinburgh award. When it comes to the expedition we went on, I did not enjoy hiking with 20kgs on my back, I did not enjoy not showering for a couple days, I did not enjoy waking up in a tent, knowing you&amp;#39;ll have to sleep in a tent again at the end of the day (I could go on and on), but I don&amp;#39;t regret going on it, I&amp;#39;m glad I have stories to tell, and that I can say I&amp;#39;ve done it. But now that I&amp;#39;ve done it, I know for sure I will certainly not be doing Gold.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sure, but now walks you might do that are half the distance and without the heavy backpack are going to feel much easier (partly due to fitness and partly due to relativity) and you may even be in the position of being able to enjoy those walks when you wouldn&amp;#39;t enjoy them before. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg92ab3", "score_hidden": false, "stickied": false, "created": 1492201371.0, "created_utc": 1492172571.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg910oe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "himyredditnameis", "parent_id": "t1_dg9088a", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I wouldn't say I have an anxiety reaction. Like you, I believe there is probably a significant amount of people out there that feel things such as the stomach lurch you described when faced with reading. \n\nI had already read the linked exchange you had with the other user, but I felt like I should still speak up, as what I feel is not quite as serious. For me, it's more of a slight aversion, I'd just rather not have to. And if I don't have to, I wont.\n\nWhen it comes to reading things at my level, I still dislike having to carry out reading, to extract a story/information. A very recent example of this, is I was binge watching the reality show *Are You The One* from MTV on catch up (you seem much more cultured than me, please don't judge me! haha), one of the episodes was missing, and I could not find it online, so I looked up an episode summary instead. As you can guess, some random blogger's episode summary of a trashy reality show is not exactly Shakespeare, but I saw how long it was and felt the same slight aversion. Now I felt I really needed this information, so I knuckled down, grit my teeth, and got through it. I'm glad I read it, I found the contents interesting but I didn't like having to read to get that information.\n\nAn analogy I can think of, is that I did the Silver Duke of Edinburgh award. When it comes to the expedition we went on, I did not enjoy hiking with 20kgs on my back, I did not enjoy not showering for a couple days, I did not enjoy waking up in a tent, knowing you'll have to sleep in a tent again at the end of the day (I could go on and on), but I don't regret going on it, I'm glad I have stories to tell, and that I can say I've done it. But now that I've done it, I know for sure I will certainly not be doing Gold.\n\nIn case my terrible written communication skills have shone through, The expedition represents books/text and the hiking/not showering etc. represents reading. The are books that I'm glad I've read, that I can talk about. But I didn't like having to carry out the act of reading (even simplistic books) to get there.\n\nedit: clarification", "edited": 1492169883.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t say I have an anxiety reaction. Like you, I believe there is probably a significant amount of people out there that feel things such as the stomach lurch you described when faced with reading. &lt;/p&gt;\n\n&lt;p&gt;I had already read the linked exchange you had with the other user, but I felt like I should still speak up, as what I feel is not quite as serious. For me, it&amp;#39;s more of a slight aversion, I&amp;#39;d just rather not have to. And if I don&amp;#39;t have to, I wont.&lt;/p&gt;\n\n&lt;p&gt;When it comes to reading things at my level, I still dislike having to carry out reading, to extract a story/information. A very recent example of this, is I was binge watching the reality show &lt;em&gt;Are You The One&lt;/em&gt; from MTV on catch up (you seem much more cultured than me, please don&amp;#39;t judge me! haha), one of the episodes was missing, and I could not find it online, so I looked up an episode summary instead. As you can guess, some random blogger&amp;#39;s episode summary of a trashy reality show is not exactly Shakespeare, but I saw how long it was and felt the same slight aversion. Now I felt I really needed this information, so I knuckled down, grit my teeth, and got through it. I&amp;#39;m glad I read it, I found the contents interesting but I didn&amp;#39;t like having to read to get that information.&lt;/p&gt;\n\n&lt;p&gt;An analogy I can think of, is that I did the Silver Duke of Edinburgh award. When it comes to the expedition we went on, I did not enjoy hiking with 20kgs on my back, I did not enjoy not showering for a couple days, I did not enjoy waking up in a tent, knowing you&amp;#39;ll have to sleep in a tent again at the end of the day (I could go on and on), but I don&amp;#39;t regret going on it, I&amp;#39;m glad I have stories to tell, and that I can say I&amp;#39;ve done it. But now that I&amp;#39;ve done it, I know for sure I will certainly not be doing Gold.&lt;/p&gt;\n\n&lt;p&gt;In case my terrible written communication skills have shone through, The expedition represents books/text and the hiking/not showering etc. represents reading. The are books that I&amp;#39;m glad I&amp;#39;ve read, that I can talk about. But I didn&amp;#39;t like having to carry out the act of reading (even simplistic books) to get there.&lt;/p&gt;\n\n&lt;p&gt;edit: clarification&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg910oe", "score_hidden": false, "stickied": false, "created": 1492198478.0, "created_utc": 1492169678.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9088a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg902ei", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So you have a direct anxiety reaction towards reading? Reading makes your stomach lurch like you're about to jump into a cold swimming pool? If so then fair enough and I've already conceded to [this user](https://www.reddit.com/r/changemyview/comments/65bepz/cmv_people_who_claim_to_have_had/dg8yuxj/) that I am in agreement that the pressures of school can certainly cause students to develop anxiety issues from feeling like failures.\n\nWhat would happen, though, if you tried reading things at your reading level - things you *could* understand on your own? You feel detached from stuff higher up the 'reading ladder', but do you also have anxiety towards approaching texts that are easier for you to digest?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you have a direct anxiety reaction towards reading? Reading makes your stomach lurch like you&amp;#39;re about to jump into a cold swimming pool? If so then fair enough and I&amp;#39;ve already conceded to &lt;a href=\"https://www.reddit.com/r/changemyview/comments/65bepz/cmv_people_who_claim_to_have_had/dg8yuxj/\"&gt;this user&lt;/a&gt; that I am in agreement that the pressures of school can certainly cause students to develop anxiety issues from feeling like failures.&lt;/p&gt;\n\n&lt;p&gt;What would happen, though, if you tried reading things at your reading level - things you &lt;em&gt;could&lt;/em&gt; understand on your own? You feel detached from stuff higher up the &amp;#39;reading ladder&amp;#39;, but do you also have anxiety towards approaching texts that are easier for you to digest?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9088a", "score_hidden": false, "stickied": false, "created": 1492196311.0, "created_utc": 1492167511.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg902ei", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "himyredditnameis", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Hello, I'm one of those people.\n\nBefore my English GCSE's I loved it, I wrote loads of stories and poems from reception all the way up to year 9, and I was convinced I would go to university to study creative writing or psychology.\n\nAfter my GCSEs, any time I would have to read or write anything more than a large paragraph, I'd feel a lot of worry.\n\nI was a confident and happy reader beforehand, however two years of reading poems and novels that I really couldn't understand on my own, and feeling stupid for not understanding them, made me really resent reading.\n\nAn important distinction though, is that I really dislike reading, *not* books, so whilst I might love whatever story is contained in The Grapes of Wrath, I certainly do not want to read to have to extract the story from the book.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello, I&amp;#39;m one of those people.&lt;/p&gt;\n\n&lt;p&gt;Before my English GCSE&amp;#39;s I loved it, I wrote loads of stories and poems from reception all the way up to year 9, and I was convinced I would go to university to study creative writing or psychology.&lt;/p&gt;\n\n&lt;p&gt;After my GCSEs, any time I would have to read or write anything more than a large paragraph, I&amp;#39;d feel a lot of worry.&lt;/p&gt;\n\n&lt;p&gt;I was a confident and happy reader beforehand, however two years of reading poems and novels that I really couldn&amp;#39;t understand on my own, and feeling stupid for not understanding them, made me really resent reading.&lt;/p&gt;\n\n&lt;p&gt;An important distinction though, is that I really dislike reading, &lt;em&gt;not&lt;/em&gt; books, so whilst I might love whatever story is contained in The Grapes of Wrath, I certainly do not want to read to have to extract the story from the book.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg902ei", "score_hidden": false, "stickied": false, "created": 1492195829.0, "created_utc": 1492167029.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg8zlzs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg8zjg7", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Yes, fair enough, and normally I only correct SPaG issues when the user does it more than once (which suggests it isn't just a typo) but in a thread about literacy and education I couldn't resist leaving my teacher hat on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, fair enough, and normally I only correct SPaG issues when the user does it more than once (which suggests it isn&amp;#39;t just a typo) but in a thread about literacy and education I couldn&amp;#39;t resist leaving my teacher hat on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8zlzs", "score_hidden": false, "stickied": false, "created": 1492194425.0, "created_utc": 1492165625.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zjg7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ghost_of_John_Galt", "parent_id": "t1_dg8z0lm", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "That last comment probably wasn't necessary. My phone, for example, is constantly autocorrecting 'its' to 'it's', regardless of the situation. It's quite annoying, but there you go - let's not assume, in this world of autocorrections, that people have typed something incorrectly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That last comment probably wasn&amp;#39;t necessary. My phone, for example, is constantly autocorrecting &amp;#39;its&amp;#39; to &amp;#39;it&amp;#39;s&amp;#39;, regardless of the situation. It&amp;#39;s quite annoying, but there you go - let&amp;#39;s not assume, in this world of autocorrections, that people have typed something incorrectly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8zjg7", "score_hidden": false, "stickied": false, "created": 1492194203.0, "created_utc": 1492165403.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg8z0qs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dg8z0lm", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/zulupineapple ([3∆](/r/changemyview/wiki/user/zulupineapple)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"zulupineapple\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/zulupineapple\"&gt;/u/zulupineapple&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/zulupineapple\"&gt;3∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22zulupineapple%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8z0qs", "score_hidden": false, "stickied": false, "created": 1492192475.0, "created_utc": 1492163675.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8z0lm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg8yuxj", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "That's a brief but very valid point, and you deserve a delta for raising something I hadn't considered (∆). It's certainly viable that school might have taught some kids to feel ashamed at their own incompetence at reading: nothing crushes your confidence like failing repeatedly at exams.\n\nMy original point still stands though since I think this group are still a minority amongst the people who claim school has 'ruined' reading for them.\n\np.s. - 'it's' only ever means 'it is'. Never use the apostrophe to signify possession for 'its'.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a brief but very valid point, and you deserve a delta for raising something I hadn&amp;#39;t considered (∆). It&amp;#39;s certainly viable that school might have taught some kids to feel ashamed at their own incompetence at reading: nothing crushes your confidence like failing repeatedly at exams.&lt;/p&gt;\n\n&lt;p&gt;My original point still stands though since I think this group are still a minority amongst the people who claim school has &amp;#39;ruined&amp;#39; reading for them.&lt;/p&gt;\n\n&lt;p&gt;p.s. - &amp;#39;it&amp;#39;s&amp;#39; only ever means &amp;#39;it is&amp;#39;. Never use the apostrophe to signify possession for &amp;#39;its&amp;#39;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8z0lm", "score_hidden": false, "stickied": false, "created": 1492192460.0, "created_utc": 1492163660.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8yuxj", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "zulupineapple", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; The real reason why they don't read is that &lt;...&gt; they are somewhat ashamed at their own reading level and are conscious of their inability to access books beyond a 'teen fiction' level.\n\nShame doesn't form on it's own. If school played some role in the development of this shame, then it is completely accurate to blame it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The real reason why they don&amp;#39;t read is that &amp;lt;...&amp;gt; they are somewhat ashamed at their own reading level and are conscious of their inability to access books beyond a &amp;#39;teen fiction&amp;#39; level.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Shame doesn&amp;#39;t form on it&amp;#39;s own. If school played some role in the development of this shame, then it is completely accurate to blame it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg8yuxj", "score_hidden": false, "stickied": false, "created": 1492191947.0, "created_utc": 1492163147.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg995ey", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "1000ancestors", "parent_id": "t1_dg990vf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I am calling you disingenuous just like you are calling people disingenuous who feel they had reading spoiled for them. If that's 'aggressive' then look in the mirror, hypocrite.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am calling you disingenuous just like you are calling people disingenuous who feel they had reading spoiled for them. If that&amp;#39;s &amp;#39;aggressive&amp;#39; then look in the mirror, hypocrite.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg995ey", "score_hidden": false, "stickied": false, "created": 1492211629.0, "created_utc": 1492182829.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg990vf", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg98bkw", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I was asking you a question to try and understand your argument, since you hadn't made your point very clear, but don't bother now because I don't interact with aggressive users.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was asking you a question to try and understand your argument, since you hadn&amp;#39;t made your point very clear, but don&amp;#39;t bother now because I don&amp;#39;t interact with aggressive users.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg990vf", "score_hidden": false, "stickied": false, "created": 1492211475.0, "created_utc": 1492182675.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg98bkw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "1000ancestors", "parent_id": "t1_dg9828f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "That is how you summarize my experience? Who is being disingenuous now? You are. Maybe you have not stopped to consider that YOU are part of the problem.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is how you summarize my experience? Who is being disingenuous now? You are. Maybe you have not stopped to consider that YOU are part of the problem.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg98bkw", "score_hidden": false, "stickied": false, "created": 1492210607.0, "created_utc": 1492181807.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9828f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg97yg8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So you're saying that your school has not taught you how to read and because of this you can't enjoy reading?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you&amp;#39;re saying that your school has not taught you how to read and because of this you can&amp;#39;t enjoy reading?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9828f", "score_hidden": false, "stickied": false, "created": 1492210276.0, "created_utc": 1492181476.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97yg8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "1000ancestors", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You maybe missed this so I am re-posting it:\nWhen I was taught reading in the earliest grades, the school system was trying a stupid new technique called \"Whole Language\" as opposed to traditional \"phonics\" style. This totally screwed up my ability to read longer books in later grades. The school system dumped \"Whole Language\" quickly realizing it was a failure and went back to \"phonics\". But it really screwed me over - THIS WAS THE SCHOOL'S FAULT. I only found out about this in adulthood from someone who worked in the school system.", "edited": 1492183274.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You maybe missed this so I am re-posting it:\nWhen I was taught reading in the earliest grades, the school system was trying a stupid new technique called &amp;quot;Whole Language&amp;quot; as opposed to traditional &amp;quot;phonics&amp;quot; style. This totally screwed up my ability to read longer books in later grades. The school system dumped &amp;quot;Whole Language&amp;quot; quickly realizing it was a failure and went back to &amp;quot;phonics&amp;quot;. But it really screwed me over - THIS WAS THE SCHOOL&amp;#39;S FAULT. I only found out about this in adulthood from someone who worked in the school system.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg97yg8", "score_hidden": false, "stickied": false, "created": 1492210143.0, "created_utc": 1492181343.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg9d39t", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "renoops", "parent_id": "t1_dg94ude", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "OP, I think you're conflating the enjoyment of reading as a pastime and the academic study of literature, which are two very different things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP, I think you&amp;#39;re conflating the enjoyment of reading as a pastime and the academic study of literature, which are two very different things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9d39t", "score_hidden": false, "stickied": false, "created": 1492216142.0, "created_utc": 1492187342.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg94ude", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg94qws", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think you should blame it more on growing up. Our tastes change massively in our teenage years. Before puberty I loved drawing and painting. Now I have no taste (or talent) for it whatsoever. I don't blame this on my art lessons, I simply changed as I grew older.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you should blame it more on growing up. Our tastes change massively in our teenage years. Before puberty I loved drawing and painting. Now I have no taste (or talent) for it whatsoever. I don&amp;#39;t blame this on my art lessons, I simply changed as I grew older.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg94ude", "score_hidden": false, "stickied": false, "created": 1492205859.0, "created_utc": 1492177059.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg94qws", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "moist_seagulll", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I dont disagree that some people who claim this to be the case are just making excuses, but there are some people (myself included) who find that ploughing through books at a tedious rate whilst taking notes and trying to spot symbolism and metaphors and the like does put us off reading. \n\nI used to be an avid reader until about year 9 (7th grade) when we started studying literature in depth.  After that year, during which I did not read at all, reading became a chore.  I used to read anything and everything, even if I didnt fully understand it.  Now, I have only read one book for leisure in the last 3 years, and although I realise their importance, I fully blame it on my GCSE english lessons.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I dont disagree that some people who claim this to be the case are just making excuses, but there are some people (myself included) who find that ploughing through books at a tedious rate whilst taking notes and trying to spot symbolism and metaphors and the like does put us off reading. &lt;/p&gt;\n\n&lt;p&gt;I used to be an avid reader until about year 9 (7th grade) when we started studying literature in depth.  After that year, during which I did not read at all, reading became a chore.  I used to read anything and everything, even if I didnt fully understand it.  Now, I have only read one book for leisure in the last 3 years, and although I realise their importance, I fully blame it on my GCSE english lessons.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg94qws", "score_hidden": false, "stickied": false, "created": 1492205717.0, "created_utc": 1492176917.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg9cii8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "PedroDaGr8", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sorry but school very much can turn readers in to non-readers. I am a voracious reader but very nearly grew to hate reading due to the way reading and literature are handled in school. To this day, I still hate reading certain types classic literature and I can directly link it to the bad teachers I had. School requires a form of reading which for many, who are not literature fiends, is very very unnatural. This forced methodology that is commonly encountered in schools (things like analyzing for deeper meaning, looking for archetypes, etc.) are the source of this stress and discomfort. Whether you like it or not, being forced to read in an unejoyable way can generate a Pavlovian response, where the feelings of stress, discomfort and boredom, which are part and parcel with badly/incompatibly taught reading in school, become associated with the act of reading itself.  This doesn't mean that they can't become readers again but why should they? I am sure if I worked hard I could overcome my hatred of these categories of classic literature if I wanted to work at it, that would require me slaving through a LONG time of fighting my Pavalovian generated hatred of said literature. For all intents and purposes, these forms classic literature HAS been spoiled for me by school because I am not going to go through that struggle for something which I consider a timepass from the stresses of work. When people say literature has been spoiled for them, this is what they mean. Even if they can inculcate the enjoyment, the required amount of work is so high that it is no longer worth the limited amount of enjoyment they would get in the near and medium future.", "edited": 1492187072.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry but school very much can turn readers in to non-readers. I am a voracious reader but very nearly grew to hate reading due to the way reading and literature are handled in school. To this day, I still hate reading certain types classic literature and I can directly link it to the bad teachers I had. School requires a form of reading which for many, who are not literature fiends, is very very unnatural. This forced methodology that is commonly encountered in schools (things like analyzing for deeper meaning, looking for archetypes, etc.) are the source of this stress and discomfort. Whether you like it or not, being forced to read in an unejoyable way can generate a Pavlovian response, where the feelings of stress, discomfort and boredom, which are part and parcel with badly/incompatibly taught reading in school, become associated with the act of reading itself.  This doesn&amp;#39;t mean that they can&amp;#39;t become readers again but why should they? I am sure if I worked hard I could overcome my hatred of these categories of classic literature if I wanted to work at it, that would require me slaving through a LONG time of fighting my Pavalovian generated hatred of said literature. For all intents and purposes, these forms classic literature HAS been spoiled for me by school because I am not going to go through that struggle for something which I consider a timepass from the stresses of work. When people say literature has been spoiled for them, this is what they mean. Even if they can inculcate the enjoyment, the required amount of work is so high that it is no longer worth the limited amount of enjoyment they would get in the near and medium future.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9cii8", "score_hidden": false, "stickied": false, "created": 1492215506.0, "created_utc": 1492186706.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg93ksx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Radijs", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think you may misread (hur-hur hur) people when they say that high school has spoilt reading for them.  \nNow my argument is based on my own personal experience and the occasional news snippet I've picked up about the subject. So take it as you find it.\n\nReading in high school was a chore for me, one that I utterly detested. And this should have been, in retrospect, surprising because up to the point where I had a mandatory reading list forced on me by school I enjoyed reading. And I'd read a lot of diffrent books by the time I got to high school. From simple pocket detectives (Baantjer) to quite challenging books (Lord of the Rings).\n\nBut after I graduated it took me years before I'd even look at a book again. I stopped reading entirely and this was really because school had ruined books for me.  \nNow I've never had to touch such nightmares like the great gatsby but Dutch literature has it's own bad eggs with which I was tormented. [The assault](https://en.wikipedia.org/wiki/The_Assault) for example and Back to Oegstgeest.  \nThese books, and how they were forced on me was a dreadful thing and it seemed, (and still seems) to me that education has mastered the technique of taking something fun and interesting and to turn it in to a soul-sucking experience that leaves it's victims detesting the very idea of picking up a book.\n\nI could theorize for a very long time how school does this. But in essence I think the way it's done is to give young students books that are absolutely dreadful to them. Not just difficult, but also incredibly boring if you're not ready for the context of these books.  \nAnd then you **have** to read them. You **have** to like them too. Because these are the literary masterpieces of your culture written by masters held in the same esteem as van Gogh and Rembrant van Rijn.  \nAnd on top of that, adding insult to injury, or perhaps even more injury to injury you have to analyze these books, you have to write down what made these books so great. And you're left writing these reports, re-reading passages that couldn't hold your interest in the first place.\n\nAnd just as you're done and you just manage to get that passing 6 out of 10 you're presented with another book that's just as dreadful and the whole excersise is repeated until you've got a solid association with the idea that books are awful, dreadfully boring things.\n\nAnd that's how school spoils reading for most people.  \nThankfully I eventually picked up reading again.  \nThe big difference is though, now I'm in charge again. I decide which book I'll pick up. And if I don't like it I get to put it away and pick something else to read. Something I will enjoy.\n\nAnd by god if Harry Mulisch wasn't dead already. I'd murder that son of a bitch in the first degree for the crime of ever picking up a goddamn pen!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you may misread (hur-hur hur) people when they say that high school has spoilt reading for them.&lt;br/&gt;\nNow my argument is based on my own personal experience and the occasional news snippet I&amp;#39;ve picked up about the subject. So take it as you find it.&lt;/p&gt;\n\n&lt;p&gt;Reading in high school was a chore for me, one that I utterly detested. And this should have been, in retrospect, surprising because up to the point where I had a mandatory reading list forced on me by school I enjoyed reading. And I&amp;#39;d read a lot of diffrent books by the time I got to high school. From simple pocket detectives (Baantjer) to quite challenging books (Lord of the Rings).&lt;/p&gt;\n\n&lt;p&gt;But after I graduated it took me years before I&amp;#39;d even look at a book again. I stopped reading entirely and this was really because school had ruined books for me.&lt;br/&gt;\nNow I&amp;#39;ve never had to touch such nightmares like the great gatsby but Dutch literature has it&amp;#39;s own bad eggs with which I was tormented. &lt;a href=\"https://en.wikipedia.org/wiki/The_Assault\"&gt;The assault&lt;/a&gt; for example and Back to Oegstgeest.&lt;br/&gt;\nThese books, and how they were forced on me was a dreadful thing and it seemed, (and still seems) to me that education has mastered the technique of taking something fun and interesting and to turn it in to a soul-sucking experience that leaves it&amp;#39;s victims detesting the very idea of picking up a book.&lt;/p&gt;\n\n&lt;p&gt;I could theorize for a very long time how school does this. But in essence I think the way it&amp;#39;s done is to give young students books that are absolutely dreadful to them. Not just difficult, but also incredibly boring if you&amp;#39;re not ready for the context of these books.&lt;br/&gt;\nAnd then you &lt;strong&gt;have&lt;/strong&gt; to read them. You &lt;strong&gt;have&lt;/strong&gt; to like them too. Because these are the literary masterpieces of your culture written by masters held in the same esteem as van Gogh and Rembrant van Rijn.&lt;br/&gt;\nAnd on top of that, adding insult to injury, or perhaps even more injury to injury you have to analyze these books, you have to write down what made these books so great. And you&amp;#39;re left writing these reports, re-reading passages that couldn&amp;#39;t hold your interest in the first place.&lt;/p&gt;\n\n&lt;p&gt;And just as you&amp;#39;re done and you just manage to get that passing 6 out of 10 you&amp;#39;re presented with another book that&amp;#39;s just as dreadful and the whole excersise is repeated until you&amp;#39;ve got a solid association with the idea that books are awful, dreadfully boring things.&lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s how school spoils reading for most people.&lt;br/&gt;\nThankfully I eventually picked up reading again.&lt;br/&gt;\nThe big difference is though, now I&amp;#39;m in charge again. I decide which book I&amp;#39;ll pick up. And if I don&amp;#39;t like it I get to put it away and pick something else to read. Something I will enjoy.&lt;/p&gt;\n\n&lt;p&gt;And by god if Harry Mulisch wasn&amp;#39;t dead already. I&amp;#39;d murder that son of a bitch in the first degree for the crime of ever picking up a goddamn pen!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg93ksx", "score_hidden": false, "stickied": false, "created": 1492203814.0, "created_utc": 1492175014.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg9bn0g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ashe_Faelsdon", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I am an absolute voracious reader, I read at least a couple of books a week and hundreds of articles in various formats.  However, when I was in 4th grade my teacher went from teaching remedial students to teaching the gifted students. She believed that the students still had to be pressured to read. \n\nAfter a few months of this my grades began to fail and I started to say that I hated to read to my parents. They were confused and began to question me further. When I finally explained that the teacher was mean and would force us to read certain books rather than allowing us to read material that we liked (these were for independent book reports), they went to speak to the teacher. After the meeting with the teacher they immediately went to the principle and had a long discussion with him. They had a second meeting with both him and the teacher and she was removed from teaching the advanced students and returned to remedial reading. \n\nIt took almost a full year before I was reading as much as I had been the previous year. It is more than possible to have bad instruction drive you away from reading. Once driven away from reading or only reading things you're forced to read results in an aversion to something that should be fun.\n\nDifferent color texts and paper often make reading easier for some students so where a red or blue filter set over a white page can correct for some students difficulties whereas without these the difficulty in reading for even short periods of time can be frustrating and make any younger student wish to avoid having to do any reading beyond what is required. \n\nA lot of what we consider \"literature\" is merely old pieces of work with little attachment to our lives as we live them today. These pieces are the best that were available at the time, but this doesn't mean that they're necessarily the best that we have available today. \n\nWhy are we teaching these old pieces like they're somehow better than some written today? A) They no longer have valid outlooks in the way our society functions and B) The language is stilted and archaic not to mention uses slang and words that hold little to no meaning in the modern era. For example a woman today doesn't wear petticoats and even something as simple as a chemise or slip is usually built into clothing today and these terms are far less used. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am an absolute voracious reader, I read at least a couple of books a week and hundreds of articles in various formats.  However, when I was in 4th grade my teacher went from teaching remedial students to teaching the gifted students. She believed that the students still had to be pressured to read. &lt;/p&gt;\n\n&lt;p&gt;After a few months of this my grades began to fail and I started to say that I hated to read to my parents. They were confused and began to question me further. When I finally explained that the teacher was mean and would force us to read certain books rather than allowing us to read material that we liked (these were for independent book reports), they went to speak to the teacher. After the meeting with the teacher they immediately went to the principle and had a long discussion with him. They had a second meeting with both him and the teacher and she was removed from teaching the advanced students and returned to remedial reading. &lt;/p&gt;\n\n&lt;p&gt;It took almost a full year before I was reading as much as I had been the previous year. It is more than possible to have bad instruction drive you away from reading. Once driven away from reading or only reading things you&amp;#39;re forced to read results in an aversion to something that should be fun.&lt;/p&gt;\n\n&lt;p&gt;Different color texts and paper often make reading easier for some students so where a red or blue filter set over a white page can correct for some students difficulties whereas without these the difficulty in reading for even short periods of time can be frustrating and make any younger student wish to avoid having to do any reading beyond what is required. &lt;/p&gt;\n\n&lt;p&gt;A lot of what we consider &amp;quot;literature&amp;quot; is merely old pieces of work with little attachment to our lives as we live them today. These pieces are the best that were available at the time, but this doesn&amp;#39;t mean that they&amp;#39;re necessarily the best that we have available today. &lt;/p&gt;\n\n&lt;p&gt;Why are we teaching these old pieces like they&amp;#39;re somehow better than some written today? A) They no longer have valid outlooks in the way our society functions and B) The language is stilted and archaic not to mention uses slang and words that hold little to no meaning in the modern era. For example a woman today doesn&amp;#39;t wear petticoats and even something as simple as a chemise or slip is usually built into clothing today and these terms are far less used. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9bn0g", "score_hidden": false, "stickied": false, "created": 1492214551.0, "created_utc": 1492185751.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg9h0ys", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SanguineHerald", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I am an avid reader. In HS I would read an average of 3 books a week. I love reading. New stories, new worlds, new characters excite me. I despise literature and english classes. So many people go through the schools system and the only books they they have ever been exposed to are books that the students cannot relate to. If I cannot, on some level, understand what drives the characters I find it extremely difficult to relate to the characters and I do no enjoy the book. This is not the case for everyone, but I feel it is a widespread problem. \n\nIn my experience teachers actually showed outright disdain for my reading habit because I wasn't reading the right books, or I would read ahead of the class in the assigned reading. This made me realize that English class isn't about instilling a love of reading, or making better writers. English class is about forcing a handful of old books that some board decided were classics down the students throats because thats how its always been done. That pissed me off. Because I love reading, and it is so very obvious that there is no room for that in english classes.\n\nMobile formatting. Sorry.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am an avid reader. In HS I would read an average of 3 books a week. I love reading. New stories, new worlds, new characters excite me. I despise literature and english classes. So many people go through the schools system and the only books they they have ever been exposed to are books that the students cannot relate to. If I cannot, on some level, understand what drives the characters I find it extremely difficult to relate to the characters and I do no enjoy the book. This is not the case for everyone, but I feel it is a widespread problem. &lt;/p&gt;\n\n&lt;p&gt;In my experience teachers actually showed outright disdain for my reading habit because I wasn&amp;#39;t reading the right books, or I would read ahead of the class in the assigned reading. This made me realize that English class isn&amp;#39;t about instilling a love of reading, or making better writers. English class is about forcing a handful of old books that some board decided were classics down the students throats because thats how its always been done. That pissed me off. Because I love reading, and it is so very obvious that there is no room for that in english classes.&lt;/p&gt;\n\n&lt;p&gt;Mobile formatting. Sorry.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9h0ys", "score_hidden": false, "stickied": false, "created": 1492220640.0, "created_utc": 1492191840.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg967yj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg966n0", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Read the first sentence of my original post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Read the first sentence of my original post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg967yj", "score_hidden": false, "stickied": false, "created": 1492207846.0, "created_utc": 1492179046.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg966n0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "1000ancestors", "parent_id": "t1_dg95i62", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Also I'd like to add the average HS student has like 3-4 hours of homework EVERY DAY. Usually books have tight deadlines of how much you must read every day, and if you are a slow reader this is torture.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also I&amp;#39;d like to add the average HS student has like 3-4 hours of homework EVERY DAY. Usually books have tight deadlines of how much you must read every day, and if you are a slow reader this is torture.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg966n0", "score_hidden": false, "stickied": false, "created": 1492207795.0, "created_utc": 1492178995.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg96occ", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg96j84", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;My interest in reading was ruined by the schools I went to - they are enough for me to judge. Clearly you think it's okay to dismiss my personal experience because I did not personally go to every school on planet Earth.\n\nI have no problem with you having a view about your own personal experience. My problem is with you using your personal experience to deliver a sweeping statement about the schooling of a country of over 300 million people.\n\n&gt;For what it's worth, my friends all went to different high schools in the same county so I knew their experiences as well. All schools teach in pretty much the same style here because of the way county/state/federal funds work.\n\nWell, okay, that's a more reasonable position, though even your county is just a drop in the ocean in such a large country.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;My interest in reading was ruined by the schools I went to - they are enough for me to judge. Clearly you think it&amp;#39;s okay to dismiss my personal experience because I did not personally go to every school on planet Earth.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I have no problem with you having a view about your own personal experience. My problem is with you using your personal experience to deliver a sweeping statement about the schooling of a country of over 300 million people.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;For what it&amp;#39;s worth, my friends all went to different high schools in the same county so I knew their experiences as well. All schools teach in pretty much the same style here because of the way county/state/federal funds work.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, okay, that&amp;#39;s a more reasonable position, though even your county is just a drop in the ocean in such a large country.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg96occ", "score_hidden": false, "stickied": false, "created": 1492208470.0, "created_utc": 1492179670.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg96j84", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "1000ancestors", "parent_id": "t1_dg96cv2", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "My interest in reading was ruined by the schools I went to - they are enough for me to judge. Clearly you think it's okay to dismiss my personal experience because I did not personally go to every school on planet Earth.\n\nFor what it's worth, my friends all went to different high schools in the same county so I knew their experiences as well. All schools teach in pretty much the same style here because of the way county/state/federal funds work.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My interest in reading was ruined by the schools I went to - they are enough for me to judge. Clearly you think it&amp;#39;s okay to dismiss my personal experience because I did not personally go to every school on planet Earth.&lt;/p&gt;\n\n&lt;p&gt;For what it&amp;#39;s worth, my friends all went to different high schools in the same county so I knew their experiences as well. All schools teach in pretty much the same style here because of the way county/state/federal funds work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg96j84", "score_hidden": false, "stickied": false, "created": 1492208278.0, "created_utc": 1492179478.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg96qkq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "1000ancestors", "parent_id": "t1_dg96cv2", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Also I should add - when I was taught reading in the earliest grades, the school system was trying a stupid new technique called \"Whole Language\" as opposed to traditional \"phonics\" style. This totally screwed up my ability to read longer books in later grades. The school system dumped \"Whole Language\" quickly realizing it was a failure and went back to \"phonics\". But it really screwed me over.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also I should add - when I was taught reading in the earliest grades, the school system was trying a stupid new technique called &amp;quot;Whole Language&amp;quot; as opposed to traditional &amp;quot;phonics&amp;quot; style. This totally screwed up my ability to read longer books in later grades. The school system dumped &amp;quot;Whole Language&amp;quot; quickly realizing it was a failure and went back to &amp;quot;phonics&amp;quot;. But it really screwed me over.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg96qkq", "score_hidden": false, "stickied": false, "created": 1492208551.0, "created_utc": 1492179751.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg96cv2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg969qf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Again: how many schools are you basing this on? If you are only basing it on your own schooling experience then it strikes me as rather absurd to make a claim about an entire massive country based on a single institution and a handful of classes. It doesn't seem a remotely fair perspective.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Again: how many schools are you basing this on? If you are only basing it on your own schooling experience then it strikes me as rather absurd to make a claim about an entire massive country based on a single institution and a handful of classes. It doesn&amp;#39;t seem a remotely fair perspective.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg96cv2", "score_hidden": false, "stickied": false, "created": 1492208040.0, "created_utc": 1492179240.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg969qf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "1000ancestors", "parent_id": "t1_dg9627f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Clearly you have never gone to school in the US but it's pure shit I can assure you. They only care about test results here. Nobody gives a fuck about teaching you how to enjoy anything.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Clearly you have never gone to school in the US but it&amp;#39;s pure shit I can assure you. They only care about test results here. Nobody gives a fuck about teaching you how to enjoy anything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg969qf", "score_hidden": false, "stickied": false, "created": 1492207918.0, "created_utc": 1492179118.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9627f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg95x4d", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Right, but how many schools have you experienced? You're not basing this view entirely on a single school are you?\n\nCliff Notes are popular in the UK as well. Exams are difficult and students need all the help they can get. I don't see anything wrong with 'giving' students interpretations of texts, but of course the focus in lessons should be (and is, from my experience) on drawing interpretations out of students.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right, but how many schools have you experienced? You&amp;#39;re not basing this view entirely on a single school are you?&lt;/p&gt;\n\n&lt;p&gt;Cliff Notes are popular in the UK as well. Exams are difficult and students need all the help they can get. I don&amp;#39;t see anything wrong with &amp;#39;giving&amp;#39; students interpretations of texts, but of course the focus in lessons should be (and is, from my experience) on drawing interpretations out of students.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9627f", "score_hidden": false, "stickied": false, "created": 1492207619.0, "created_utc": 1492178819.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg95x4d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "1000ancestors", "parent_id": "t1_dg95i62", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I am talking about US Grades K-12. They do not want to hear your personal thoughts or emotional reactions to the books. They only care about comprehension of details or the official narrative as if you are a detective at a crime scene. That's why Cliff Notes are extremely popular in the US.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am talking about US Grades K-12. They do not want to hear your personal thoughts or emotional reactions to the books. They only care about comprehension of details or the official narrative as if you are a detective at a crime scene. That&amp;#39;s why Cliff Notes are extremely popular in the US.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg95x4d", "score_hidden": false, "stickied": false, "created": 1492207421.0, "created_utc": 1492178621.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg95i62", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg95bjb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Are you speaking for all schools? How many have you experienced? I've only taught in a handful and absolutely no English department has that mentality, nor any teacher that I've met. The whole subject is about trying to get students to be able to experience things and comment on those experiences, and teachers in the UK are trained specifically to try and preserve the love of storytelling in the face of the often very challenging curriculum students have to get through.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you speaking for all schools? How many have you experienced? I&amp;#39;ve only taught in a handful and absolutely no English department has that mentality, nor any teacher that I&amp;#39;ve met. The whole subject is about trying to get students to be able to experience things and comment on those experiences, and teachers in the UK are trained specifically to try and preserve the love of storytelling in the face of the often very challenging curriculum students have to get through.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg95i62", "score_hidden": false, "stickied": false, "created": 1492206827.0, "created_utc": 1492178027.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg95bjb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "1000ancestors", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Schools (and elitist lit snobs in general) like to make books into some objective assignment, and take away any subjective interpretation or inner-experience that could be enjoyable. Schools teach you to see books as puzzles and \"work\" instead of seeing them as art.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Schools (and elitist lit snobs in general) like to make books into some objective assignment, and take away any subjective interpretation or inner-experience that could be enjoyable. Schools teach you to see books as puzzles and &amp;quot;work&amp;quot; instead of seeing them as art.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg95bjb", "score_hidden": false, "stickied": false, "created": 1492206564.0, "created_utc": 1492177764.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtunc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dgdtq59", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;People may or may not like literature. If their first exposure to literature is in school, then by definition school \"spoiled\" literature for them, as they did not know they disliked literature until they first encountered it in a school.\n\nSchool simply introduced them to literature and they discovered they didn't like it. \"Spoiled\" implies the school actually had some responsibility for making them not like it.\n\nIf I offer you a type of biscuit that you've never tried before and you don't like it, have I \"spoiled\" that biscuit for you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;People may or may not like literature. If their first exposure to literature is in school, then by definition school &amp;quot;spoiled&amp;quot; literature for them, as they did not know they disliked literature until they first encountered it in a school.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;School simply introduced them to literature and they discovered they didn&amp;#39;t like it. &amp;quot;Spoiled&amp;quot; implies the school actually had some responsibility for making them not like it.&lt;/p&gt;\n\n&lt;p&gt;If I offer you a type of biscuit that you&amp;#39;ve never tried before and you don&amp;#39;t like it, have I &amp;quot;spoiled&amp;quot; that biscuit for you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdtunc", "score_hidden": true, "stickied": false, "created": 1492480062.0, "created_utc": 1492451262.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtq59", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AnarchyshitpostBOT", "parent_id": "t1_dgdth9a", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It sounds like you're asking for a tautology then. To that end:\n\nPeople may or may not like literature. If their first exposure to literature is in school, then by definition school \"spoiled\" literature for them, as they did not know they disliked literature until they first encountered it in a school.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you&amp;#39;re asking for a tautology then. To that end:&lt;/p&gt;\n\n&lt;p&gt;People may or may not like literature. If their first exposure to literature is in school, then by definition school &amp;quot;spoiled&amp;quot; literature for them, as they did not know they disliked literature until they first encountered it in a school.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdtq59", "score_hidden": true, "stickied": false, "created": 1492479923.0, "created_utc": 1492451123.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdth9a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dgdtdxt", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Some people don't like literature. My view is that this isn't because school has 'spoilt' it for them, it's because they just don't like literature.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some people don&amp;#39;t like literature. My view is that this isn&amp;#39;t because school has &amp;#39;spoilt&amp;#39; it for them, it&amp;#39;s because they just don&amp;#39;t like literature.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdth9a", "score_hidden": true, "stickied": false, "created": 1492479652.0, "created_utc": 1492450852.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtdxt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AnarchyshitpostBOT", "parent_id": "t1_dgdripz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So what even is your CMV then? \"People are different and literature isn't for everyone\"?\n\nLike I am very confused right now. Your OP states that people who feel school \"spoilt\" lit are really disengenious or just didn't understand it (not that lit isn't for them), and now you're saying literature *can't* be for everyone by definition. So how does that fit into the OP then?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So what even is your CMV then? &amp;quot;People are different and literature isn&amp;#39;t for everyone&amp;quot;?&lt;/p&gt;\n\n&lt;p&gt;Like I am very confused right now. Your OP states that people who feel school &amp;quot;spoilt&amp;quot; lit are really disengenious or just didn&amp;#39;t understand it (not that lit isn&amp;#39;t for them), and now you&amp;#39;re saying literature &lt;em&gt;can&amp;#39;t&lt;/em&gt; be for everyone by definition. So how does that fit into the OP then?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdtdxt", "score_hidden": true, "stickied": false, "created": 1492479553.0, "created_utc": 1492450753.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdripz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dgdqlef", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Your case in the title is that people who feel school \"spoiled literature\" are either outright liars, or they just don't understand what they are talking about.\n\nNo: my view is that most of them (not all) are being disingenuous on this issue (not \"outright liars\") or they do not understand literature.\n\n&gt;My case is that well yeah, if somebody didn't learn the material or found it unaccessible, then is that a personal failing on their part, or a failing by the curriculumn builders? Especially given that wide swathes of the population apparently don't care about these works (when I was in highschool, the people that actually studied that material was an extreme monority). At what point does this begin to reflect on the curriculumn?\n\nIt's not a 'failing'. Literature can't be for everyone. It's absurd to suggest that it is. Literature should be *taught* to everyone, because it's important for developing key life-skills, but it's ridiculous to think that everyone is going to understand it or like it. Why should they? Not everyone likes sport. Not everyone likes music. It's not a 'failing' that people have different proclivities.\n\n&gt;If these books are so teachable, then why does this problem exist? Are all teachers just really bad? Are all students just really lazy? Or are these maybe not the best works to go off?\n\nAs I said: the 'problem' is simply that people are different. Not everyone is going to appreciate literature, and that's fine. \n\n&gt;LotF is easy to teach because Golding essentially beats you over the head with symbolism. LotF is easy to teach because Golding's Hobbesian position is all but literally stated in the text. But that doesn't make it the best thing to teach, especially if 70% of students don't even finish it.\n\nHave you tried teaching 15 year-olds? Most of them are very ill-equipped to deal with symbolism. They *need* a text that hits them over the head with symbolism in order to explain what symbolism is. What text would you suggest that is better at teaching symbolism? It would have to be something that is both meaty enough to improve their reading skills but accessible and enjoyable, as Lord of the Flies is.\n\n&gt;So far all you have said in favour of these works is that they are \"teachable\", but anything can be teachable if the teacher knows the material.\n\nThat is not remotely true. I know Lord of the Flies very well and I know Dr Jekyll and Mr Hyde very well. Lord of the Flies was excellent to teach and Jekyll was awful to teach. For the reasons previously stated, Lord of the Flies works very well with kids: they can relate to it and engage with it. Jekyll and Hyde on the other hand was too obtuse for them: it was timely rather than timeless and the bombastic rather than judicious vocabulary made it a real slog for them. I promise you that if you were a teacher, you would know how important it is to choose a text that kids can access. \n\n&gt;Your total failure to address my cultural elitism/Adorno point is the smoking gun here; if you take away the \"classic\" aspect from something like LotF, there is really no compelling reason to choose it over something like Fear and Loathing in Las Vegas, which not only has obvious symbolism and political philosophy, but is also a more compelling and relevant read.\n\nAre you literally skipping over parts of my post? Not once have I said the reason we teach Lord of the Flies is \"because it's a classic\". You're the only one who has ever said we teach things because they're a classic. I'll copy and paste to save typing it out again:\n\nIt has the perfect combination of a gripping plot, interesting and clearly delineated characters (which are also of the same age as the students) and can work on many levels. The weaker readers in the class can still comment on its more literal aspects: they can analyse character relationships and power dynamics. The more able readers can go into the symbolism and the more abstract ideas explored concerning justice and morality, and the really strong students can engage with its political philosophy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Your case in the title is that people who feel school &amp;quot;spoiled literature&amp;quot; are either outright liars, or they just don&amp;#39;t understand what they are talking about.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No: my view is that most of them (not all) are being disingenuous on this issue (not &amp;quot;outright liars&amp;quot;) or they do not understand literature.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;My case is that well yeah, if somebody didn&amp;#39;t learn the material or found it unaccessible, then is that a personal failing on their part, or a failing by the curriculumn builders? Especially given that wide swathes of the population apparently don&amp;#39;t care about these works (when I was in highschool, the people that actually studied that material was an extreme monority). At what point does this begin to reflect on the curriculumn?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s not a &amp;#39;failing&amp;#39;. Literature can&amp;#39;t be for everyone. It&amp;#39;s absurd to suggest that it is. Literature should be &lt;em&gt;taught&lt;/em&gt; to everyone, because it&amp;#39;s important for developing key life-skills, but it&amp;#39;s ridiculous to think that everyone is going to understand it or like it. Why should they? Not everyone likes sport. Not everyone likes music. It&amp;#39;s not a &amp;#39;failing&amp;#39; that people have different proclivities.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If these books are so teachable, then why does this problem exist? Are all teachers just really bad? Are all students just really lazy? Or are these maybe not the best works to go off?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As I said: the &amp;#39;problem&amp;#39; is simply that people are different. Not everyone is going to appreciate literature, and that&amp;#39;s fine. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;LotF is easy to teach because Golding essentially beats you over the head with symbolism. LotF is easy to teach because Golding&amp;#39;s Hobbesian position is all but literally stated in the text. But that doesn&amp;#39;t make it the best thing to teach, especially if 70% of students don&amp;#39;t even finish it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Have you tried teaching 15 year-olds? Most of them are very ill-equipped to deal with symbolism. They &lt;em&gt;need&lt;/em&gt; a text that hits them over the head with symbolism in order to explain what symbolism is. What text would you suggest that is better at teaching symbolism? It would have to be something that is both meaty enough to improve their reading skills but accessible and enjoyable, as Lord of the Flies is.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So far all you have said in favour of these works is that they are &amp;quot;teachable&amp;quot;, but anything can be teachable if the teacher knows the material.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That is not remotely true. I know Lord of the Flies very well and I know Dr Jekyll and Mr Hyde very well. Lord of the Flies was excellent to teach and Jekyll was awful to teach. For the reasons previously stated, Lord of the Flies works very well with kids: they can relate to it and engage with it. Jekyll and Hyde on the other hand was too obtuse for them: it was timely rather than timeless and the bombastic rather than judicious vocabulary made it a real slog for them. I promise you that if you were a teacher, you would know how important it is to choose a text that kids can access. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Your total failure to address my cultural elitism/Adorno point is the smoking gun here; if you take away the &amp;quot;classic&amp;quot; aspect from something like LotF, there is really no compelling reason to choose it over something like Fear and Loathing in Las Vegas, which not only has obvious symbolism and political philosophy, but is also a more compelling and relevant read.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Are you literally skipping over parts of my post? Not once have I said the reason we teach Lord of the Flies is &amp;quot;because it&amp;#39;s a classic&amp;quot;. You&amp;#39;re the only one who has ever said we teach things because they&amp;#39;re a classic. I&amp;#39;ll copy and paste to save typing it out again:&lt;/p&gt;\n\n&lt;p&gt;It has the perfect combination of a gripping plot, interesting and clearly delineated characters (which are also of the same age as the students) and can work on many levels. The weaker readers in the class can still comment on its more literal aspects: they can analyse character relationships and power dynamics. The more able readers can go into the symbolism and the more abstract ideas explored concerning justice and morality, and the really strong students can engage with its political philosophy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdripz", "score_hidden": true, "stickied": false, "created": 1492477477.0, "created_utc": 1492448677.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqlef", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AnarchyshitpostBOT", "parent_id": "t1_dgdorks", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I guess I don't understand what you CMV is then?\n\nYour case in the title is that people who feel school \"spoiled literature\" are either outright liars, or they just don't understand what they are talking about. \n\nMy case is that well yeah, if somebody didn't learn the material or found it unaccessible, then is that a personal failing on their part, or a failing by the curriculumn builders? Especially given that wide swathes of the population apparently don't care about these works (when I was in highschool, the people that actually studied that material was an extreme monority). At what point does this begin to reflect on the curriculumn? \n\nAnd so far in your responses you have just focused on the individual works I have sited as examples, not on my actual position (I.e the curriculumn is not structured in the best way possible). If these books are so teachable, then why does this problem exist? Are all teachers just really bad? Are all students just really lazy? Or are these maybe not the best works to go off?\n\nLotF is *easy* to teach because Golding essentially beats you over the head with symbolism. LotF is *easy* to teach because Golding's Hobbesian position is all but literally stated in the text. But that doesn't make it the *best* thing to teach, especially if 70% of students don't even finish it. \n\nIt sounds like you're trying to make the work fit the tool, rather than picking the right tool for the work. So far all you have said in favour of these works is that they are \"teachable\", but anything can be teachable if the teacher knows the material. What other reason should we be privileging these works? Your total failure to address my cultural elitism/Adorno point is the smoking gun here; if you take away the \"classic\" aspect from something like LotF, there is really no compelling reason to choose it over something like *Fear and Loathing in Las Vegas*, which not only has obvious symbolism and political philosophy, but is also a more compelling and relevant read.\n\nAnd yeah if you think *Breaking Bad* is incredible then I don't even know why we are having this conversation. That show is a solid \"meh\" at best, and downright ridiculous at work. Definitely the kind of dreck that good media literacy is supposed to protect us from ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess I don&amp;#39;t understand what you CMV is then?&lt;/p&gt;\n\n&lt;p&gt;Your case in the title is that people who feel school &amp;quot;spoiled literature&amp;quot; are either outright liars, or they just don&amp;#39;t understand what they are talking about. &lt;/p&gt;\n\n&lt;p&gt;My case is that well yeah, if somebody didn&amp;#39;t learn the material or found it unaccessible, then is that a personal failing on their part, or a failing by the curriculumn builders? Especially given that wide swathes of the population apparently don&amp;#39;t care about these works (when I was in highschool, the people that actually studied that material was an extreme monority). At what point does this begin to reflect on the curriculumn? &lt;/p&gt;\n\n&lt;p&gt;And so far in your responses you have just focused on the individual works I have sited as examples, not on my actual position (I.e the curriculumn is not structured in the best way possible). If these books are so teachable, then why does this problem exist? Are all teachers just really bad? Are all students just really lazy? Or are these maybe not the best works to go off?&lt;/p&gt;\n\n&lt;p&gt;LotF is &lt;em&gt;easy&lt;/em&gt; to teach because Golding essentially beats you over the head with symbolism. LotF is &lt;em&gt;easy&lt;/em&gt; to teach because Golding&amp;#39;s Hobbesian position is all but literally stated in the text. But that doesn&amp;#39;t make it the &lt;em&gt;best&lt;/em&gt; thing to teach, especially if 70% of students don&amp;#39;t even finish it. &lt;/p&gt;\n\n&lt;p&gt;It sounds like you&amp;#39;re trying to make the work fit the tool, rather than picking the right tool for the work. So far all you have said in favour of these works is that they are &amp;quot;teachable&amp;quot;, but anything can be teachable if the teacher knows the material. What other reason should we be privileging these works? Your total failure to address my cultural elitism/Adorno point is the smoking gun here; if you take away the &amp;quot;classic&amp;quot; aspect from something like LotF, there is really no compelling reason to choose it over something like &lt;em&gt;Fear and Loathing in Las Vegas&lt;/em&gt;, which not only has obvious symbolism and political philosophy, but is also a more compelling and relevant read.&lt;/p&gt;\n\n&lt;p&gt;And yeah if you think &lt;em&gt;Breaking Bad&lt;/em&gt; is incredible then I don&amp;#39;t even know why we are having this conversation. That show is a solid &amp;quot;meh&amp;quot; at best, and downright ridiculous at work. Definitely the kind of dreck that good media literacy is supposed to protect us from &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdqlef", "score_hidden": true, "stickied": false, "created": 1492476448.0, "created_utc": 1492447648.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdorks", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dgdo1rv", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;I'm curious as to the point of this cmv? Looks like your poking holes in the particular of my argument and looking past my actual point.\n\nI'm not really sure what your argument was. The final paragraph you wrote seemed to agree with what I was saying so I didn't address it.\n\n&gt;Just because something is a classic does not make it the best to learn from; would you walk into a highschool civics course and hand them a copy of Leviathan?\n\nOf course I wouldn't. And I entirely agree that not all classics are good choices to study. Romeo and Juliet however is an excellent choice.\n\n&gt;Same with LotF; sure it's a good introduction to symbolism; but is it the best tool for the job?\n\nIt's one of the best, yes. It has the perfect combination of a gripping plot, interesting and clearly delineated characters (which are also of the same age as the students) and can work on many levels. The weaker readers in the class can still comment on its more literal aspects: they can analyse character relationships and power dynamics. The more able readers can go into the symbolism and the more abstract ideas explored concerning justice and morality, and the really strong students can engage with its political philosophy. I taught it to Year 9s last year (15 year-olds) and it was brilliant. Kids really 'get' Lord of the Flies. They 'get' Of Mice and Men and Romeo and Juliet as well. \n\nTrust me, exam boards and schools would absolutely *not* choose texts that would alienate children entirely. That would make students and teachers' lives even more agonising. Of Mice and Men, Romeo and Juliet and Lord of the Flies are tried-and-tested texts that are great for teaching. \n\n&gt;It seems like that because you believe these individual books are good and worthy of study, people who have an issue with the curriculumn are philistines who can't see the brilliance in these works.\n\nAs I've been saying: these texts aren't selected because of their 'brilliance'. Romeo and Juliet is one of Shakespeare's inferior tragedies. Of Mice and Men is absolutely Steinbeck's worst novel. The point is that they're brilliant *to teach* - they are perfectly suited to teaching some essential literary and analytical skills.\n\n&gt;But if it's to actually learn how to think critically and understand media, then perhaps a curriculumn that is more relevant and more engaging would be superior.\n\nEveryone wants that. The point is that it has to be texts that are engaging but also that help teach certain important skills.\n\n&gt;I could care less\n\n*Twitch*\n\n&gt;Me personally, I could care less if the person learned about gang violence from The Wire or from Romeo and Juilleitte, as long as they actually understood why it's a problem. \n\nThe Wire should be taught in film lessons, not literature lessons. You can't learn about cinematography in Romeo and Juliet and you can't learn about poetry in The Wire. Besides, the makers of The Wire obviously know their Shakespeare so if you're going to study The Wire you'd certainly have to have some sort of understanding of its influences.\n\n&gt;garbage like Breaking Bad\n\nBreaking Bad is far from garbage. Incredible show: wonderful loose adaptation of Macbeth.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m curious as to the point of this cmv? Looks like your poking holes in the particular of my argument and looking past my actual point.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not really sure what your argument was. The final paragraph you wrote seemed to agree with what I was saying so I didn&amp;#39;t address it.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Just because something is a classic does not make it the best to learn from; would you walk into a highschool civics course and hand them a copy of Leviathan?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Of course I wouldn&amp;#39;t. And I entirely agree that not all classics are good choices to study. Romeo and Juliet however is an excellent choice.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Same with LotF; sure it&amp;#39;s a good introduction to symbolism; but is it the best tool for the job?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s one of the best, yes. It has the perfect combination of a gripping plot, interesting and clearly delineated characters (which are also of the same age as the students) and can work on many levels. The weaker readers in the class can still comment on its more literal aspects: they can analyse character relationships and power dynamics. The more able readers can go into the symbolism and the more abstract ideas explored concerning justice and morality, and the really strong students can engage with its political philosophy. I taught it to Year 9s last year (15 year-olds) and it was brilliant. Kids really &amp;#39;get&amp;#39; Lord of the Flies. They &amp;#39;get&amp;#39; Of Mice and Men and Romeo and Juliet as well. &lt;/p&gt;\n\n&lt;p&gt;Trust me, exam boards and schools would absolutely &lt;em&gt;not&lt;/em&gt; choose texts that would alienate children entirely. That would make students and teachers&amp;#39; lives even more agonising. Of Mice and Men, Romeo and Juliet and Lord of the Flies are tried-and-tested texts that are great for teaching. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It seems like that because you believe these individual books are good and worthy of study, people who have an issue with the curriculumn are philistines who can&amp;#39;t see the brilliance in these works.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As I&amp;#39;ve been saying: these texts aren&amp;#39;t selected because of their &amp;#39;brilliance&amp;#39;. Romeo and Juliet is one of Shakespeare&amp;#39;s inferior tragedies. Of Mice and Men is absolutely Steinbeck&amp;#39;s worst novel. The point is that they&amp;#39;re brilliant &lt;em&gt;to teach&lt;/em&gt; - they are perfectly suited to teaching some essential literary and analytical skills.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But if it&amp;#39;s to actually learn how to think critically and understand media, then perhaps a curriculumn that is more relevant and more engaging would be superior.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Everyone wants that. The point is that it has to be texts that are engaging but also that help teach certain important skills.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I could care less&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;em&gt;Twitch&lt;/em&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Me personally, I could care less if the person learned about gang violence from The Wire or from Romeo and Juilleitte, as long as they actually understood why it&amp;#39;s a problem. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The Wire should be taught in film lessons, not literature lessons. You can&amp;#39;t learn about cinematography in Romeo and Juliet and you can&amp;#39;t learn about poetry in The Wire. Besides, the makers of The Wire obviously know their Shakespeare so if you&amp;#39;re going to study The Wire you&amp;#39;d certainly have to have some sort of understanding of its influences.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;garbage like Breaking Bad&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Breaking Bad is far from garbage. Incredible show: wonderful loose adaptation of Macbeth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdorks", "score_hidden": true, "stickied": false, "created": 1492474417.0, "created_utc": 1492445617.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdo1rv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AnarchyshitpostBOT", "parent_id": "t1_dgdm14z", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm curious as to the point of this cmv? Looks like your poking holes in the particular of my argument and looking past my actual point.\n\nShould R&amp;J be on the syllabus? Maybe. But compared to more contemporary work, it's not the best thing to learn off, ergo students disengage, become unread adults, and justify it by saying \"well Romeo and Juliette sucked\". Just because something is a classic does not make it the best to learn from; would you walk into a highschool civics course and hand them a copy of *Leviathan*? \n\nSame with LotF; sure it's a good introduction to symbolism; but is it the *best* tool for the job? \n\nIt seems like that because you believe these individual books are good and worthy of study, people who have an issue with the curriculumn are philistines who can't see the brilliance in these works. But school is about learning, and a person can learn all of these things with works that are more modern. Most of these Classic have been told and retold dozens of times, and usually the retelling could serve as a better basis of education if the goal is solely to learn how to interpret media (which is more accessible for a teenager? *The Scarlet Letter* or *Easy A*?).\n\nBut you are positing that these works, *as classics* should be taught as an end to themselves, and students are wrong to disengage. This is classic cultural elitism, the kind espoused by Adorno and others like him, and in practise just becomes about education gatekeeping. So really you should ask yourself, what is the point of reading literature? If it's to simply add notches to the belt and list a bunch of classic you've studied, then yeah the current system is actually ideal because most people will disengage, upping the value of cultural elitism (as you will have exclusive info). But if it's to actually learn how to think critically and understand media, then perhaps a curriculumn that is more relevant and more engaging would be superior. Me personally, I could care less if the person learned about gang violence from *The Wire* or from Romeo and Juilleitte, as long as they actually understood *why* it's a problem. As it stands most people don't get far enough into R&amp;J to see that the violence basically ruined them; instead their left to learn about gangs from garbage like *Breaking Bad*, unguided and without a critical eye. That's a problem ", "edited": 1492445585.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m curious as to the point of this cmv? Looks like your poking holes in the particular of my argument and looking past my actual point.&lt;/p&gt;\n\n&lt;p&gt;Should R&amp;amp;J be on the syllabus? Maybe. But compared to more contemporary work, it&amp;#39;s not the best thing to learn off, ergo students disengage, become unread adults, and justify it by saying &amp;quot;well Romeo and Juliette sucked&amp;quot;. Just because something is a classic does not make it the best to learn from; would you walk into a highschool civics course and hand them a copy of &lt;em&gt;Leviathan&lt;/em&gt;? &lt;/p&gt;\n\n&lt;p&gt;Same with LotF; sure it&amp;#39;s a good introduction to symbolism; but is it the &lt;em&gt;best&lt;/em&gt; tool for the job? &lt;/p&gt;\n\n&lt;p&gt;It seems like that because you believe these individual books are good and worthy of study, people who have an issue with the curriculumn are philistines who can&amp;#39;t see the brilliance in these works. But school is about learning, and a person can learn all of these things with works that are more modern. Most of these Classic have been told and retold dozens of times, and usually the retelling could serve as a better basis of education if the goal is solely to learn how to interpret media (which is more accessible for a teenager? &lt;em&gt;The Scarlet Letter&lt;/em&gt; or &lt;em&gt;Easy A&lt;/em&gt;?).&lt;/p&gt;\n\n&lt;p&gt;But you are positing that these works, &lt;em&gt;as classics&lt;/em&gt; should be taught as an end to themselves, and students are wrong to disengage. This is classic cultural elitism, the kind espoused by Adorno and others like him, and in practise just becomes about education gatekeeping. So really you should ask yourself, what is the point of reading literature? If it&amp;#39;s to simply add notches to the belt and list a bunch of classic you&amp;#39;ve studied, then yeah the current system is actually ideal because most people will disengage, upping the value of cultural elitism (as you will have exclusive info). But if it&amp;#39;s to actually learn how to think critically and understand media, then perhaps a curriculumn that is more relevant and more engaging would be superior. Me personally, I could care less if the person learned about gang violence from &lt;em&gt;The Wire&lt;/em&gt; or from Romeo and Juilleitte, as long as they actually understood &lt;em&gt;why&lt;/em&gt; it&amp;#39;s a problem. As it stands most people don&amp;#39;t get far enough into R&amp;amp;J to see that the violence basically ruined them; instead their left to learn about gangs from garbage like &lt;em&gt;Breaking Bad&lt;/em&gt;, unguided and without a critical eye. That&amp;#39;s a problem &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdo1rv", "score_hidden": true, "stickied": false, "created": 1492473598.0, "created_utc": 1492444798.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdm14z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dgdliql", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Yes most people who say they don't like reading is because they were force fed \"classics\" like Of Mice and Men. But does that make them incorrect? \n\nI disagree that *most* say it's because of school. Most say: \"cos books are borin'\" \n\nBy the way: why did you use quote marks there? Is Of Mice and Men not a classic?\n\n&gt;Not only is it ridiculously indecipherable, it's also just boring, trope heavy and predictable. \n\nDo you not see the irony in calling Romeo and Juliet 'trope heavy and predictable'? Romeo and Juliet is *the reason we have those tropes*. We study texts like Romeo and Juliet to see where these tropes came from, or at least where they were popularised.\n\nAnyway, you're wrong about Romeo and Juliet. It is relevant: lots of students can really engage with it. Any kid that's ever quarrelled with their parents; any kid that's seen gang violence in the media; any kid that likes stories about revenge or about love. And to say it's \"completely indecipherable\" is odd: I don't know what you mean by that.\n\n&gt; authors who may be controversial are completely slept on for \"safe\" works like Lord of the Flies which, although classic, does nothing to challenge what we already think (seriously the thesis in Lord of the Flies stretches at least back to Hobbes).\n\nWhat's an 'unsafe' work? The Bell Jar? The Bell Jar is on curriculums too. \n\n&gt;authors who may be controversial are completely slept on for \"safe\" works like Lord of the Flies which, although classic, does nothing to challenge what we already think (seriously the thesis in Lord of the Flies stretches at least back to Hobbes).\n\nLord of the Flies is an excellent introduction to symbolism, allegory and political philosophy. Students get a lot from it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Yes most people who say they don&amp;#39;t like reading is because they were force fed &amp;quot;classics&amp;quot; like Of Mice and Men. But does that make them incorrect? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I disagree that &lt;em&gt;most&lt;/em&gt; say it&amp;#39;s because of school. Most say: &amp;quot;cos books are borin&amp;#39;&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;By the way: why did you use quote marks there? Is Of Mice and Men not a classic?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Not only is it ridiculously indecipherable, it&amp;#39;s also just boring, trope heavy and predictable. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Do you not see the irony in calling Romeo and Juliet &amp;#39;trope heavy and predictable&amp;#39;? Romeo and Juliet is &lt;em&gt;the reason we have those tropes&lt;/em&gt;. We study texts like Romeo and Juliet to see where these tropes came from, or at least where they were popularised.&lt;/p&gt;\n\n&lt;p&gt;Anyway, you&amp;#39;re wrong about Romeo and Juliet. It is relevant: lots of students can really engage with it. Any kid that&amp;#39;s ever quarrelled with their parents; any kid that&amp;#39;s seen gang violence in the media; any kid that likes stories about revenge or about love. And to say it&amp;#39;s &amp;quot;completely indecipherable&amp;quot; is odd: I don&amp;#39;t know what you mean by that.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;authors who may be controversial are completely slept on for &amp;quot;safe&amp;quot; works like Lord of the Flies which, although classic, does nothing to challenge what we already think (seriously the thesis in Lord of the Flies stretches at least back to Hobbes).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What&amp;#39;s an &amp;#39;unsafe&amp;#39; work? The Bell Jar? The Bell Jar is on curriculums too. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;authors who may be controversial are completely slept on for &amp;quot;safe&amp;quot; works like Lord of the Flies which, although classic, does nothing to challenge what we already think (seriously the thesis in Lord of the Flies stretches at least back to Hobbes).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Lord of the Flies is an excellent introduction to symbolism, allegory and political philosophy. Students get a lot from it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdm14z", "score_hidden": true, "stickied": false, "created": 1492471271.0, "created_utc": 1492442471.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdliql", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AnarchyshitpostBOT", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think in your post you have all the pieces for your changes view, you just haven't arranged them properly. I'm going to focus on your reason b)\n\nYes most people who say they don't like reading is because they were force fed \"classics\" like Of Mice and Men. But does that make them incorrect? Or just victims of their situation?\n\nMy hobby is politics. Love em. Love reading about it, love watching the news, love political theory. All day everyday. Know what I didn't like? The civics class I had to take in highschool. That was the most watered down, bottom-of-the-barrel, propagandistic politics I've ever been exposed to. Luckily I had already developed a taste for politics before then so I basically just aced the class and moved on. But if that had been my *only* exposure to politics? Yeah I'd probably be one of those guys who watches CNN exclusively, who's political opinions begin and end with \"eh they're all crooks\" while not even being able to name my MP or explain the difference between federal and provincial (Canadian).\n\nLiterature works the same way. I'm sorry but Romeo and Juilliete is just not an interesting or relevant piece for your average 14 year old. If that's my first exposure to \"real\" literature, of course I'm going to be disinterested. Not only is it ridiculously indecipherable, it's also just *boring*, trope heavy and predictable. Compare that to the material I read in Eng100; while I'm not a Sylvia Plath fan, at least I can appreciate that depressed teenagers may be more interested in Plath than Shakespeare. For me, it's telling that the most interesting book I read in highschool, Lord of the Flies, was considered an absolute joke when I was assigned it again in university, both for its simplicity, and for its total lack of real-world applicability.\n\nSo that's one half of the puzzle; highschool curriculumns are typically extremely basic *and* santized to the point of irrelevance; authors who may be controversial are completely slept on for \"safe\" works like Lord of the Flies which, although classic, does nothing to challenge what we already think (seriously the thesis in Lord of the Flies stretches at least back to Hobbes).\n\nThe other half of the problem though is that to appeared cultured or at least aware of culture, we are expected to have some knowledge of this stuff, or a good reason not too. Just as the average person sounds dumb when they say \"yeah I don't care about politics\", you sound uncultured when you say \"yeah I don't know any literature\". Blaming highschool is an easy out, a way to shift the blame from yourself to \"the system\" and works exactly like saying \"they're all crooks\" when it comes to politics; by saying school ruined literature, what you're really saying is that you're smart enough to get it, you just don't like being force fed.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think in your post you have all the pieces for your changes view, you just haven&amp;#39;t arranged them properly. I&amp;#39;m going to focus on your reason b)&lt;/p&gt;\n\n&lt;p&gt;Yes most people who say they don&amp;#39;t like reading is because they were force fed &amp;quot;classics&amp;quot; like Of Mice and Men. But does that make them incorrect? Or just victims of their situation?&lt;/p&gt;\n\n&lt;p&gt;My hobby is politics. Love em. Love reading about it, love watching the news, love political theory. All day everyday. Know what I didn&amp;#39;t like? The civics class I had to take in highschool. That was the most watered down, bottom-of-the-barrel, propagandistic politics I&amp;#39;ve ever been exposed to. Luckily I had already developed a taste for politics before then so I basically just aced the class and moved on. But if that had been my &lt;em&gt;only&lt;/em&gt; exposure to politics? Yeah I&amp;#39;d probably be one of those guys who watches CNN exclusively, who&amp;#39;s political opinions begin and end with &amp;quot;eh they&amp;#39;re all crooks&amp;quot; while not even being able to name my MP or explain the difference between federal and provincial (Canadian).&lt;/p&gt;\n\n&lt;p&gt;Literature works the same way. I&amp;#39;m sorry but Romeo and Juilliete is just not an interesting or relevant piece for your average 14 year old. If that&amp;#39;s my first exposure to &amp;quot;real&amp;quot; literature, of course I&amp;#39;m going to be disinterested. Not only is it ridiculously indecipherable, it&amp;#39;s also just &lt;em&gt;boring&lt;/em&gt;, trope heavy and predictable. Compare that to the material I read in Eng100; while I&amp;#39;m not a Sylvia Plath fan, at least I can appreciate that depressed teenagers may be more interested in Plath than Shakespeare. For me, it&amp;#39;s telling that the most interesting book I read in highschool, Lord of the Flies, was considered an absolute joke when I was assigned it again in university, both for its simplicity, and for its total lack of real-world applicability.&lt;/p&gt;\n\n&lt;p&gt;So that&amp;#39;s one half of the puzzle; highschool curriculumns are typically extremely basic &lt;em&gt;and&lt;/em&gt; santized to the point of irrelevance; authors who may be controversial are completely slept on for &amp;quot;safe&amp;quot; works like Lord of the Flies which, although classic, does nothing to challenge what we already think (seriously the thesis in Lord of the Flies stretches at least back to Hobbes).&lt;/p&gt;\n\n&lt;p&gt;The other half of the problem though is that to appeared cultured or at least aware of culture, we are expected to have some knowledge of this stuff, or a good reason not too. Just as the average person sounds dumb when they say &amp;quot;yeah I don&amp;#39;t care about politics&amp;quot;, you sound uncultured when you say &amp;quot;yeah I don&amp;#39;t know any literature&amp;quot;. Blaming highschool is an easy out, a way to shift the blame from yourself to &amp;quot;the system&amp;quot; and works exactly like saying &amp;quot;they&amp;#39;re all crooks&amp;quot; when it comes to politics; by saying school ruined literature, what you&amp;#39;re really saying is that you&amp;#39;re smart enough to get it, you just don&amp;#39;t like being force fed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdliql", "score_hidden": true, "stickied": false, "created": 1492470656.0, "created_utc": 1492441856.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg9naq5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anonoman925", "parent_id": "t1_dg9kpmg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Gather data. \n\nYou could survey outside the grocery store for adults. \n\nStudent assessments will tell you. \"What spoke to you in the book Dandelion Wine\".  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gather data. &lt;/p&gt;\n\n&lt;p&gt;You could survey outside the grocery store for adults. &lt;/p&gt;\n\n&lt;p&gt;Student assessments will tell you. &amp;quot;What spoke to you in the book Dandelion Wine&amp;quot;.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9naq5", "score_hidden": false, "stickied": false, "created": 1492228133.0, "created_utc": 1492199333.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9kpmg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg9knmu", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm not sure what it is you are asking me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure what it is you are asking me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9kpmg", "score_hidden": false, "stickied": false, "created": 1492225014.0, "created_utc": 1492196214.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9knmu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anonoman925", "parent_id": "t1_dg9i8bn", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "What % of students?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What % of students?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9knmu", "score_hidden": false, "stickied": false, "created": 1492224947.0, "created_utc": 1492196147.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9i8bn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg9i04e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'd rather ask them in 10 years' time. I'm not necessarily arguing that all students should love literature in secondary school, though it's certainly great if they do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d rather ask them in 10 years&amp;#39; time. I&amp;#39;m not necessarily arguing that all students should love literature in secondary school, though it&amp;#39;s certainly great if they do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9i8bn", "score_hidden": false, "stickied": false, "created": 1492222044.0, "created_utc": 1492193244.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9i04e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anonoman925", "parent_id": "t1_dg9dsfr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Simple survey. \n\nAsk kids if they enjoyed the book. Have them do a simple personal reflection to factor out teacher pleasing. Tell them to leave their name off. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Simple survey. &lt;/p&gt;\n\n&lt;p&gt;Ask kids if they enjoyed the book. Have them do a simple personal reflection to factor out teacher pleasing. Tell them to leave their name off. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9i04e", "score_hidden": false, "stickied": false, "created": 1492221774.0, "created_utc": 1492192974.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9dsfr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg9bgnx", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;But kids analyzing why the protagonist exited a red door is a waste of time. Art is personal and a majority of teens don't have a developed palate because, well, they've only been conscious for 13 years (the first 4 don't count), they're hungry and HAMlet isn't feeding them, and they're hormonal. Others problems aren't theirs.\n\nI don't agree. Obviously it depends on the text and the age group, but most great literature has themes that are not exclusively 'adult' in any way - least of all Shakespeare. I think there's some merit in arguing that Shakespeare is taught too young - perhaps that is so. Despite being young and not yet having 'life experience', there's plenty in, say, Hamlet that is dealing with issues that 17 year-olds can relate to, even if there's plenty of other stuff that won't really hit them till their 20s (as it did with you and with me also). Your post seems to suggest you feel students need to 'get' a work of literature in totality or else it's not worth introducing them to it. I don't think that's true. Like you I had no passion for Shakespeare and Frost in school, but I do not think my current passion for them would exist had I not been introduced to them early on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But kids analyzing why the protagonist exited a red door is a waste of time. Art is personal and a majority of teens don&amp;#39;t have a developed palate because, well, they&amp;#39;ve only been conscious for 13 years (the first 4 don&amp;#39;t count), they&amp;#39;re hungry and HAMlet isn&amp;#39;t feeding them, and they&amp;#39;re hormonal. Others problems aren&amp;#39;t theirs.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t agree. Obviously it depends on the text and the age group, but most great literature has themes that are not exclusively &amp;#39;adult&amp;#39; in any way - least of all Shakespeare. I think there&amp;#39;s some merit in arguing that Shakespeare is taught too young - perhaps that is so. Despite being young and not yet having &amp;#39;life experience&amp;#39;, there&amp;#39;s plenty in, say, Hamlet that is dealing with issues that 17 year-olds can relate to, even if there&amp;#39;s plenty of other stuff that won&amp;#39;t really hit them till their 20s (as it did with you and with me also). Your post seems to suggest you feel students need to &amp;#39;get&amp;#39; a work of literature in totality or else it&amp;#39;s not worth introducing them to it. I don&amp;#39;t think that&amp;#39;s true. Like you I had no passion for Shakespeare and Frost in school, but I do not think my current passion for them would exist had I not been introduced to them early on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9dsfr", "score_hidden": false, "stickied": false, "created": 1492216933.0, "created_utc": 1492188133.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9bgnx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anonoman925", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm a teacher and reading was 'spoilt' for me. \n\n1. I was mandated to read pieces that were outside of my experiences. I can't relate to Invisible Man. Some say, as a white male, I still can't. I can't relate to Shakespeare. I can't relate to poems about the fragility of life, I'm an invincible teenager. \n\n2. The mandate. I worked just hard enough to get good grades. But junior year, I just could read the 25 mandated pages a night. The only book I connected with was Grapes of Wrath, but that's because it's both my grandfather's story. I still don't know what the fuck Dandelion Wine is about. The mandate made me phone it in. \n\n3. I've read all of the assigned reading when I was 24. Those books on school reading lists. I was strolling through the bookstore and both them all, at $3.99 I might add (hint, hint they don't connect with a lot of people). \n\nSuddenly this literature made sense. MacBeth. Holy shit. Mowing by Robert Frost. My god. \n\nAt 24 I started feeling the fragility of life. The tyranny of government. The folly of frivolity. \n\nLiterature is wasted on the young. Even the common Core realizes this and states that technical reading and excerpts are encouraged. \n\nWe need to make kids literate. A quick dive into the immigrant experience or the African American experience through news, data, and short testimony is the way to go. \n\nBut kids analyzing why the protagonist exited a red door is a waste of time. Art is personal and a majority of teens don't have a developed palate because, well, they've only been conscious for 13 years (the first 4 don't count), they're hungry and HAMlet isn't feeding them, and they're hormonal. Others problems aren't theirs. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a teacher and reading was &amp;#39;spoilt&amp;#39; for me. &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;I was mandated to read pieces that were outside of my experiences. I can&amp;#39;t relate to Invisible Man. Some say, as a white male, I still can&amp;#39;t. I can&amp;#39;t relate to Shakespeare. I can&amp;#39;t relate to poems about the fragility of life, I&amp;#39;m an invincible teenager. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The mandate. I worked just hard enough to get good grades. But junior year, I just could read the 25 mandated pages a night. The only book I connected with was Grapes of Wrath, but that&amp;#39;s because it&amp;#39;s both my grandfather&amp;#39;s story. I still don&amp;#39;t know what the fuck Dandelion Wine is about. The mandate made me phone it in. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I&amp;#39;ve read all of the assigned reading when I was 24. Those books on school reading lists. I was strolling through the bookstore and both them all, at $3.99 I might add (hint, hint they don&amp;#39;t connect with a lot of people). &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Suddenly this literature made sense. MacBeth. Holy shit. Mowing by Robert Frost. My god. &lt;/p&gt;\n\n&lt;p&gt;At 24 I started feeling the fragility of life. The tyranny of government. The folly of frivolity. &lt;/p&gt;\n\n&lt;p&gt;Literature is wasted on the young. Even the common Core realizes this and states that technical reading and excerpts are encouraged. &lt;/p&gt;\n\n&lt;p&gt;We need to make kids literate. A quick dive into the immigrant experience or the African American experience through news, data, and short testimony is the way to go. &lt;/p&gt;\n\n&lt;p&gt;But kids analyzing why the protagonist exited a red door is a waste of time. Art is personal and a majority of teens don&amp;#39;t have a developed palate because, well, they&amp;#39;ve only been conscious for 13 years (the first 4 don&amp;#39;t count), they&amp;#39;re hungry and HAMlet isn&amp;#39;t feeding them, and they&amp;#39;re hormonal. Others problems aren&amp;#39;t theirs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9bgnx", "score_hidden": false, "stickied": false, "created": 1492214349.0, "created_utc": 1492185549.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg9kw0k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fromdawntilldusk", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I absolutely hated reading in public school. We spent my entire 3 years of middle school reading Les Miserables. It was definitely \"miserable.\" School forced me to read books that did not interest me in any way, shape, or form. Now that I am out of school I read things that interest me and appeal to me which makes it so much more enjoyable. I have read a few books lately that I've just been able to relate to personally and that's been really nice. I never got to read books in public school that I could relate to or that were coming of age. I never got to read books about Tudors, UFOs, old school Hollywood, or astronomy. I had to read books based on a curriculum and that had no fun.\n\nThis year alone I signed up to do the /r/52books challenge and I've already read 76/52 books. It's not even been half a year yet! Last year I read 37 books out of a goal of 12. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I absolutely hated reading in public school. We spent my entire 3 years of middle school reading Les Miserables. It was definitely &amp;quot;miserable.&amp;quot; School forced me to read books that did not interest me in any way, shape, or form. Now that I am out of school I read things that interest me and appeal to me which makes it so much more enjoyable. I have read a few books lately that I&amp;#39;ve just been able to relate to personally and that&amp;#39;s been really nice. I never got to read books in public school that I could relate to or that were coming of age. I never got to read books about Tudors, UFOs, old school Hollywood, or astronomy. I had to read books based on a curriculum and that had no fun.&lt;/p&gt;\n\n&lt;p&gt;This year alone I signed up to do the &lt;a href=\"/r/52books\"&gt;/r/52books&lt;/a&gt; challenge and I&amp;#39;ve already read 76/52 books. It&amp;#39;s not even been half a year yet! Last year I read 37 books out of a goal of 12. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9kw0k", "score_hidden": false, "stickied": false, "created": 1492225228.0, "created_utc": 1492196428.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg9qqg9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "elegigglekappa4head", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I've actually loved reading when I was young. My dad had a large collection of history books, and I've read through all of them multiple times... until high school came along. \n\nAfter I went through high school, that changed. I *detested* reading. I found it completely miserable. Why? Because in order to get into \"good\" college, I was forced to read a lot. I had to read the damn text books and memorize them for my AP classes (and I took like 10 of them), not to mention for AP EngLit, I was forced to re-read some books multiple times to come up with some fancy interpretations, which I conceived to be bullshit. Why couldn't I just read the books the way I enjoy it, but was forced to come up with something fancy so that I can get the A? May be I should've just 'sparked' it, but other people were already doing it so that wasn't an option (otherwise I'd be accused of cheating). \n\nAfter this phase of my life, I've forever correlated reading with chores/homework. It's not like I can't appreciate literature for what they are, but I just fail to see why I should try when I find it no longer pleasurable. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve actually loved reading when I was young. My dad had a large collection of history books, and I&amp;#39;ve read through all of them multiple times... until high school came along. &lt;/p&gt;\n\n&lt;p&gt;After I went through high school, that changed. I &lt;em&gt;detested&lt;/em&gt; reading. I found it completely miserable. Why? Because in order to get into &amp;quot;good&amp;quot; college, I was forced to read a lot. I had to read the damn text books and memorize them for my AP classes (and I took like 10 of them), not to mention for AP EngLit, I was forced to re-read some books multiple times to come up with some fancy interpretations, which I conceived to be bullshit. Why couldn&amp;#39;t I just read the books the way I enjoy it, but was forced to come up with something fancy so that I can get the A? May be I should&amp;#39;ve just &amp;#39;sparked&amp;#39; it, but other people were already doing it so that wasn&amp;#39;t an option (otherwise I&amp;#39;d be accused of cheating). &lt;/p&gt;\n\n&lt;p&gt;After this phase of my life, I&amp;#39;ve forever correlated reading with chores/homework. It&amp;#39;s not like I can&amp;#39;t appreciate literature for what they are, but I just fail to see why I should try when I find it no longer pleasurable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9qqg9", "score_hidden": false, "stickied": false, "created": 1492232278.0, "created_utc": 1492203478.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg9hlkm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg9hhwl", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Are the students the ones who think the texts are accessible and plot-based, or are the adults who design and/or teach the curriculum the ones who think so?\n\nBoth. And anyway, both groups are the same of course: all adults were in school once.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Are the students the ones who think the texts are accessible and plot-based, or are the adults who design and/or teach the curriculum the ones who think so?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Both. And anyway, both groups are the same of course: all adults were in school once.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9hlkm", "score_hidden": false, "stickied": false, "created": 1492221305.0, "created_utc": 1492192505.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9hhwl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thecarolinakid", "parent_id": "t1_dg9dv0a", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Are the students the ones who think the texts are accessible and plot-based, or are the adults who design and/or teach the curriculum the ones who think so?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are the students the ones who think the texts are accessible and plot-based, or are the adults who design and/or teach the curriculum the ones who think so?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9hhwl", "score_hidden": false, "stickied": false, "created": 1492221187.0, "created_utc": 1492192387.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9dv0a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dg9a2ak", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;If students are only exposed to works of literature that prioritize stylistic writing and abstract ideas over interesting plots and accessible characters, of course they'll think all literature is like that. \n\nI don't know of any curriculum that contains texts like that. Students in the UK tend to do texts that *are* accessible and generally *are* pretty plot and character focused.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If students are only exposed to works of literature that prioritize stylistic writing and abstract ideas over interesting plots and accessible characters, of course they&amp;#39;ll think all literature is like that. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t know of any curriculum that contains texts like that. Students in the UK tend to do texts that &lt;em&gt;are&lt;/em&gt; accessible and generally &lt;em&gt;are&lt;/em&gt; pretty plot and character focused.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9dv0a", "score_hidden": false, "stickied": false, "created": 1492217012.0, "created_utc": 1492188212.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9a2ak", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thecarolinakid", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;what these people often do not realise is just how vast literature is. I think some people assume that in reading the above-mentioned texts, they've somehow had a holistic taste of what literature 'is' and so therefore if they didn't enjoy these texts at school they must hate all literature.\n\nIs that not the fault of the school? If students are only exposed to works of literature that prioritize stylistic writing and abstract ideas over interesting plots and accessible characters, of course they'll think all literature is like that. Combine that with the message that only literature is worth reading, spread it over twelve years of schooling, and you've got a surefire way to produce young adults who think that literature can only be boring.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;what these people often do not realise is just how vast literature is. I think some people assume that in reading the above-mentioned texts, they&amp;#39;ve somehow had a holistic taste of what literature &amp;#39;is&amp;#39; and so therefore if they didn&amp;#39;t enjoy these texts at school they must hate all literature.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Is that not the fault of the school? If students are only exposed to works of literature that prioritize stylistic writing and abstract ideas over interesting plots and accessible characters, of course they&amp;#39;ll think all literature is like that. Combine that with the message that only literature is worth reading, spread it over twelve years of schooling, and you&amp;#39;ve got a surefire way to produce young adults who think that literature can only be boring.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9a2ak", "score_hidden": false, "stickied": false, "created": 1492212723.0, "created_utc": 1492183923.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg97axr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ralph-j", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I do read the occasional fiction book, so I'm not totally averse. Yet I feel that because I had to read 28 books of literature in school (due to 3 language subjects) over the course of 1.5 - 2 years, it has put me off from becoming a book lover. I now see reading more as a burden, and not something you do for enjoyment, and that's a pity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do read the occasional fiction book, so I&amp;#39;m not totally averse. Yet I feel that because I had to read 28 books of literature in school (due to 3 language subjects) over the course of 1.5 - 2 years, it has put me off from becoming a book lover. I now see reading more as a burden, and not something you do for enjoyment, and that&amp;#39;s a pity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg97axr", "score_hidden": false, "stickied": false, "created": 1492209298.0, "created_utc": 1492180498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dg9krwd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "phcullen", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Up until about junior year of high school I really enjoyed reading like stay up all night to finish a book and even reading more than one book at a time I set out to read all of what I saw to be the clasics that I had access too. \n\nBut junior year lit class just completely killed that passion for me ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Up until about junior year of high school I really enjoyed reading like stay up all night to finish a book and even reading more than one book at a time I set out to read all of what I saw to be the clasics that I had access too. &lt;/p&gt;\n\n&lt;p&gt;But junior year lit class just completely killed that passion for me &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9krwd", "score_hidden": false, "stickied": false, "created": 1492225090.0, "created_utc": 1492196290.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65bepz", "likes": null, "replies": "", "user_reports": [], "id": "dgapo06", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dgapjie", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sort of. It's about introducing them to texts they wouldn't otherwise be able to access and then finding entrance points into those texts based on what interests them. Obviously the other important factor alongside their enjoyment is building their reading skills and expanding their horizons so that reading can be a long-term source of enjoyment for them. This may mean choosing texts that they do not like, but that's fine: these texts are just rungs on a ladder they're climbing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sort of. It&amp;#39;s about introducing them to texts they wouldn&amp;#39;t otherwise be able to access and then finding entrance points into those texts based on what interests them. Obviously the other important factor alongside their enjoyment is building their reading skills and expanding their horizons so that reading can be a long-term source of enjoyment for them. This may mean choosing texts that they do not like, but that&amp;#39;s fine: these texts are just rungs on a ladder they&amp;#39;re climbing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgapo06", "score_hidden": false, "stickied": false, "created": 1492296164.0, "created_utc": 1492267364.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgapjie", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "luaudesign", "parent_id": "t1_dgaojxs", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "What kids in school consider boring and interesting is what matters.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What kids in school consider boring and interesting is what matters.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgapjie", "score_hidden": false, "stickied": false, "created": 1492295977.0, "created_utc": 1492267177.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaojxs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FaerieStories", "parent_id": "t1_dgamue7", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "What sort of book would you call 'boring' and what sort of book would you call 'interesting'?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What sort of book would you call &amp;#39;boring&amp;#39; and what sort of book would you call &amp;#39;interesting&amp;#39;?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaojxs", "score_hidden": false, "stickied": false, "created": 1492294371.0, "created_utc": 1492265571.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgamue7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "luaudesign", "parent_id": "t3_65bepz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "School forces you to read the most boring books. Some people just carry it for life that reading literature is a chore.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;School forces you to read the most boring books. Some people just carry it for life that reading literature is a chore.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgamue7", "score_hidden": false, "stickied": false, "created": 1492291297.0, "created_utc": 1492262497.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]