[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So the James Bond 007 film series has been going since 1962, featuring 26 movies, which have been very popular.&lt;/p&gt;\n\n&lt;p&gt;Traditionally, the Bond films were the prime example of the cheesy spy movie - the caricaturesque villain in his secret lair and evil plan; the sexy Bond-girl; Bond himself, a though but sly protagonist, featuring very few character development or depth; and of course, the ongoing repetitive phrases like &amp;quot;shaken, not stirred&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Most of this has changed in the last films - notably with Daniel Craig as bond, and to a larger extent Pierce Brosnan (though I will focus mostly on Craig). The new films are much more mature - both in plot and cinematography. They feature a different, darker side of Bond that is more authentic to the Ian Fleming books.&lt;/p&gt;\n\n&lt;p&gt;The consensus in critiquing the Bond films in recent years is praising of the New Bond, and seeing the Old Bond as dull, cliche, misogynistic.&lt;/p&gt;\n\n&lt;p&gt;I think the old Bonds are better, because they have a unique feel of irony. They are cliche, but its a self-acknowledged one. While the new Bonds are excellent films in themselves, their discontinuing of the cliche and irony and the more serious note the have made them lose the special &amp;quot;feel&amp;quot; of the old ones.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;This is a footnote from the CMV moderators. We&amp;#39;d like to remind you of a couple of things. Firstly, please&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules\"&gt;read through our rules&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting\"&gt;downvotes don&amp;#39;t change views&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;! Any questions or concerns? Feel free to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/message/compose?to=/r/changemyview\"&gt;message us&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;Happy CMVing!&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So the James Bond 007 film series has been going since 1962, featuring 26 movies, which have been very popular.\n\nTraditionally, the Bond films were the prime example of the cheesy spy movie - the caricaturesque villain in his secret lair and evil plan; the sexy Bond-girl; Bond himself, a though but sly protagonist, featuring very few character development or depth; and of course, the ongoing repetitive phrases like \"shaken, not stirred\".\n\nMost of this has changed in the last films - notably with Daniel Craig as bond, and to a larger extent Pierce Brosnan (though I will focus mostly on Craig). The new films are much more mature - both in plot and cinematography. They feature a different, darker side of Bond that is more authentic to the Ian Fleming books.\n\nThe consensus in critiquing the Bond films in recent years is praising of the New Bond, and seeing the Old Bond as dull, cliche, misogynistic.\n\nI think the old Bonds are better, because they have a unique feel of irony. They are cliche, but its a self-acknowledged one. While the new Bonds are excellent films in themselves, their discontinuing of the cliche and irony and the more serious note the have made them lose the special \"feel\" of the old ones.\n\n\n_____\n\n&gt; *This is a footnote from the CMV moderators. We'd like to remind you of a couple of things. Firstly, please* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "[FreshTopicFriday]", "id": "65d710", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 24, "report_reasons": null, "author": "EmperorBasilius", "saved": false, "mod_reports": [], "name": "t3_65d710", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": false, "link_flair_css_class": "FTF", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/65d710/cmv_the_old_007_films_were_better/", "num_reports": null, "locked": false, "stickied": false, "created": 1492212784.0, "url": "https://www.reddit.com/r/changemyview/comments/65d710/cmv_the_old_007_films_were_better/", "author_flair_text": null, "quarantine": false, "title": "CMV: The old 007 films were better", "created_utc": 1492183984.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65d710", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65d710", "likes": null, "replies": "", "user_reports": [], "id": "dg9ranx", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "EmperorBasilius", "parent_id": "t1_dg9cse6", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I don't agree with that view of self-acknowledgment. Self acknowledgment and embracement of irony can be the difference between a \"cringe\" situation and a geniuine irony.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t agree with that view of self-acknowledgment. Self acknowledgment and embracement of irony can be the difference between a &amp;quot;cringe&amp;quot; situation and a geniuine irony.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9ranx", "score_hidden": false, "stickied": false, "created": 1492232984.0, "created_utc": 1492204184.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9cse6", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Token_Why_Boy", "parent_id": "t3_65d710", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It's hard to argue about subjective opinion, but I will dispute your reasoning.\n\n[Here's a video about David Foster Wallace talking about the problem with irony](https://www.youtube.com/watch?v=2doZROwdte4) in regards to postmodernism in the media. In short, in the time when those older Bond films you say were better were being produced, a lot of modernist (edging into postmodernism) media was utilizing irony as an immunity to criticism. How can you call the old James Bond movies bad when they looked at the audience and winked at them right alongside the audience themselves? The feel of irony wasn't unique; it was a defining quality of media coming out of that generation. If anything, the early Bond films were just a step ahead of the zeitgeist in television by a matter of a few years.\n\nA comedian saying their jokes are terrible doesn't make their jokes funny. In that regard, self-acknowledged irony doesn't make that irony unique; it just pre-emptively safeguards it from critique.\n\nNow, this isn't to say the new Bond films are better or worse. But if they are better or worse (from the standpoint of when the films were released), it's not because of the loss of irony. The loss of irony (or its coupling with sincerity) has been happening all across the board, in film and television.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s hard to argue about subjective opinion, but I will dispute your reasoning.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=2doZROwdte4\"&gt;Here&amp;#39;s a video about David Foster Wallace talking about the problem with irony&lt;/a&gt; in regards to postmodernism in the media. In short, in the time when those older Bond films you say were better were being produced, a lot of modernist (edging into postmodernism) media was utilizing irony as an immunity to criticism. How can you call the old James Bond movies bad when they looked at the audience and winked at them right alongside the audience themselves? The feel of irony wasn&amp;#39;t unique; it was a defining quality of media coming out of that generation. If anything, the early Bond films were just a step ahead of the zeitgeist in television by a matter of a few years.&lt;/p&gt;\n\n&lt;p&gt;A comedian saying their jokes are terrible doesn&amp;#39;t make their jokes funny. In that regard, self-acknowledged irony doesn&amp;#39;t make that irony unique; it just pre-emptively safeguards it from critique.&lt;/p&gt;\n\n&lt;p&gt;Now, this isn&amp;#39;t to say the new Bond films are better or worse. But if they are better or worse (from the standpoint of when the films were released), it&amp;#39;s not because of the loss of irony. The loss of irony (or its coupling with sincerity) has been happening all across the board, in film and television.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9cse6", "score_hidden": false, "stickied": false, "created": 1492215806.0, "created_utc": 1492187006.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65d710", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65d710", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65d710", "likes": null, "replies": "", "user_reports": [], "id": "dga3e80", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BlckJck103", "parent_id": "t1_dg9rgeq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Yes but what's the point of self parody and how many films can you make before it gets pointless? It doesn't really make sense to suggest \"Look a super villian in his volcano lair\" when the only major films doing that now are Bond or spoofs of Bond. Spy films have become darker and more character driven and less about secret agents in hotels with gadgets.\n\nI don't think i can necessarily change your view on the old films being better (that's simply taste) but i don't think the new ones have access to the same formula. I think you'll find that films like Die Another Day and The World Is Not Enough, were reaching the point of self parody and people didn't like them. In the end they had to make a change towards the serious end of the spectrum and chose to do it that way. It's certainly saved the Bond franchise for now.\n\nBond went through more serious phases before as people wanted something different, while the newest ones are certainly a more drastic change I wouldn't be surprised if, in time, the films become less serious again. This will happen when this \"new\" style of spy movie is \"old\" and can it's archetypes can be spoofed and films life Austin powers have faded from memory a bit.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes but what&amp;#39;s the point of self parody and how many films can you make before it gets pointless? It doesn&amp;#39;t really make sense to suggest &amp;quot;Look a super villian in his volcano lair&amp;quot; when the only major films doing that now are Bond or spoofs of Bond. Spy films have become darker and more character driven and less about secret agents in hotels with gadgets.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think i can necessarily change your view on the old films being better (that&amp;#39;s simply taste) but i don&amp;#39;t think the new ones have access to the same formula. I think you&amp;#39;ll find that films like Die Another Day and The World Is Not Enough, were reaching the point of self parody and people didn&amp;#39;t like them. In the end they had to make a change towards the serious end of the spectrum and chose to do it that way. It&amp;#39;s certainly saved the Bond franchise for now.&lt;/p&gt;\n\n&lt;p&gt;Bond went through more serious phases before as people wanted something different, while the newest ones are certainly a more drastic change I wouldn&amp;#39;t be surprised if, in time, the films become less serious again. This will happen when this &amp;quot;new&amp;quot; style of spy movie is &amp;quot;old&amp;quot; and can it&amp;#39;s archetypes can be spoofed and films life Austin powers have faded from memory a bit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dga3e80", "score_hidden": false, "stickied": false, "created": 1492249062.0, "created_utc": 1492220262.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9rgeq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EmperorBasilius", "parent_id": "t1_dg9fuek", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You are correct that every Bond actor brings his own style, but there is a cleare difference in tone in what I defined as the Old Bond, which is mainly based on the Connery-Moore films and the new Craig Bond.\n\nI think the Bond series has become such a large phenomena that it can point to itself and doesn't need a different material to parody.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are correct that every Bond actor brings his own style, but there is a cleare difference in tone in what I defined as the Old Bond, which is mainly based on the Connery-Moore films and the new Craig Bond.&lt;/p&gt;\n\n&lt;p&gt;I think the Bond series has become such a large phenomena that it can point to itself and doesn&amp;#39;t need a different material to parody.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9rgeq", "score_hidden": false, "stickied": false, "created": 1492233186.0, "created_utc": 1492204386.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9fuek", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BlckJck103", "parent_id": "t3_65d710", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The problem with an \"old bond films\" argument is that which ones do you mean?\n\nThey've made films for a very long time and every now and then they decide to go more serious, more humerous, more/less gadget or more/less cars. Each actor also usually changed the style, Roger Moore's Bond regardless of the specific film was different from Connery's. \n\nI might agree; \"Yeah Roger Moore's Bond was the best\" only for you to think \"Well I meant Connery\". While I also think that some of old Bond films were better, I certainly don't think all are. If you gave me the choice of watching Casino Royale or OHMSS then I'd be watching Daniel Craig. If you asked me about Spectre or From Russia With Love then \"Old\" beats \"New\". \n\nAfter some time as well you're just delove into self-parody as well. When you think \"spy film\" today you think of Bond, the irony and the jokes aren't really aimed at anything except yourself. by the late 90s Bond was the target of parody in the form of Austin Powers. Spy films and films in general weren't falling into the \"Super-Villian\" trap as much as they were and actual spy films were things like the Bourne Trilogy. The tongue-in-cheek parts of Bond simply didn't have anything to point to except other Bond films. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem with an &amp;quot;old bond films&amp;quot; argument is that which ones do you mean?&lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;ve made films for a very long time and every now and then they decide to go more serious, more humerous, more/less gadget or more/less cars. Each actor also usually changed the style, Roger Moore&amp;#39;s Bond regardless of the specific film was different from Connery&amp;#39;s. &lt;/p&gt;\n\n&lt;p&gt;I might agree; &amp;quot;Yeah Roger Moore&amp;#39;s Bond was the best&amp;quot; only for you to think &amp;quot;Well I meant Connery&amp;quot;. While I also think that some of old Bond films were better, I certainly don&amp;#39;t think all are. If you gave me the choice of watching Casino Royale or OHMSS then I&amp;#39;d be watching Daniel Craig. If you asked me about Spectre or From Russia With Love then &amp;quot;Old&amp;quot; beats &amp;quot;New&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;After some time as well you&amp;#39;re just delove into self-parody as well. When you think &amp;quot;spy film&amp;quot; today you think of Bond, the irony and the jokes aren&amp;#39;t really aimed at anything except yourself. by the late 90s Bond was the target of parody in the form of Austin Powers. Spy films and films in general weren&amp;#39;t falling into the &amp;quot;Super-Villian&amp;quot; trap as much as they were and actual spy films were things like the Bourne Trilogy. The tongue-in-cheek parts of Bond simply didn&amp;#39;t have anything to point to except other Bond films. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9fuek", "score_hidden": false, "stickied": false, "created": 1492219266.0, "created_utc": 1492190466.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65d710", "likes": null, "replies": "", "user_reports": [], "id": "dg9bsgs", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Aguywhoknowsstuff", "parent_id": "t3_65d710", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The new bond films have an updated take on the character. He's ruthlessly effective as a blunt instrument of death but clearly emotionally damaged. His charm is superficial and his flings since the death of Vespa have all been to further the completion of his mission. He keeps his relationships at arms length to avoid attachments and loss and seems to have a lot of self loathing an an almost suicidal tendency at times.\n\nThe character has always arguably been a sociopath  but the newer portrayals are less light hearted and far darker. I personally enjoy every iteration of bond for what it was and think comparing the bonds to each other as \"better or worse\" is unfair since each could easily exist in their own mini universe. That being said, Connery will always be my favorite, but Craig is very good and is a close second. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The new bond films have an updated take on the character. He&amp;#39;s ruthlessly effective as a blunt instrument of death but clearly emotionally damaged. His charm is superficial and his flings since the death of Vespa have all been to further the completion of his mission. He keeps his relationships at arms length to avoid attachments and loss and seems to have a lot of self loathing an an almost suicidal tendency at times.&lt;/p&gt;\n\n&lt;p&gt;The character has always arguably been a sociopath  but the newer portrayals are less light hearted and far darker. I personally enjoy every iteration of bond for what it was and think comparing the bonds to each other as &amp;quot;better or worse&amp;quot; is unfair since each could easily exist in their own mini universe. That being said, Connery will always be my favorite, but Craig is very good and is a close second. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9bsgs", "score_hidden": false, "stickied": false, "created": 1492214720.0, "created_utc": 1492185920.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65d710", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg9c7kl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ardonpitt", "parent_id": "t3_65d710", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It depends on what you are wanting out of Bond, the old movies are great because of their cheese, but they never really aknowledged the dark sides of Bond which you note.\n\nA real eye opener is a 2012 interview that Daniel Craig did with [MI6 Confidential magazine](https://www.mi6-hq.com/sections/articles/interview-daniel-craig-interview-foreshadows-bond-24) (a bond fan mag) that Craig goes into the reasoning for that difference. And it basically goes to Austin Powers. Basically Austin powers did everything so wonderfully and cheesily that even attempting to do anything similarly would seem just tame and like copycatting. So the only way for the series to cope would be to go back to its roots and get a bit darker. Hence Casino and Quantum two of the darker Bond stories (in book as well) changing the humor to gallows humor as well.\n\nPersonally I think both the old and the new Bonds are good, but you cant really look at the Spy movie genre and say Bond could have been taken seriously after Powers and Borne if it didn't find a way to balance between those two extremes in a new way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It depends on what you are wanting out of Bond, the old movies are great because of their cheese, but they never really aknowledged the dark sides of Bond which you note.&lt;/p&gt;\n\n&lt;p&gt;A real eye opener is a 2012 interview that Daniel Craig did with &lt;a href=\"https://www.mi6-hq.com/sections/articles/interview-daniel-craig-interview-foreshadows-bond-24\"&gt;MI6 Confidential magazine&lt;/a&gt; (a bond fan mag) that Craig goes into the reasoning for that difference. And it basically goes to Austin Powers. Basically Austin powers did everything so wonderfully and cheesily that even attempting to do anything similarly would seem just tame and like copycatting. So the only way for the series to cope would be to go back to its roots and get a bit darker. Hence Casino and Quantum two of the darker Bond stories (in book as well) changing the humor to gallows humor as well.&lt;/p&gt;\n\n&lt;p&gt;Personally I think both the old and the new Bonds are good, but you cant really look at the Spy movie genre and say Bond could have been taken seriously after Powers and Borne if it didn&amp;#39;t find a way to balance between those two extremes in a new way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9c7kl", "score_hidden": false, "stickied": false, "created": 1492215181.0, "created_utc": 1492186381.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65d710", "likes": null, "replies": "", "user_reports": [], "id": "dg9d4qm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jark831", "parent_id": "t3_65d710", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You pointed out that the new movies feature a Bond that is similar to the original book-Bond. Given that whether you think a movie is good or better/worse than another is completely subjective, it's pretty difficult to have this discussion....but if you already think the new movies are excellent films in themselves, then doesn't new Bond being more indicative of book-Bond count for anything?\n\nI agree that the old movies were more tongue-in-cheek...there were more ridiculous gadgets, Bond cracked jokes as he killed people, etc. ....the new movies are more serious....Bond doesn't like what he does, he's very good at it and he drinks to cope...just like the book-Bond\n\nMy point is, it's already very difficult to judge subjective preferences for movies, but given that you consider the old/new movies to all be generally good, then shouldn't staying true to the real Bond elevate the new movies over the old movies?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You pointed out that the new movies feature a Bond that is similar to the original book-Bond. Given that whether you think a movie is good or better/worse than another is completely subjective, it&amp;#39;s pretty difficult to have this discussion....but if you already think the new movies are excellent films in themselves, then doesn&amp;#39;t new Bond being more indicative of book-Bond count for anything?&lt;/p&gt;\n\n&lt;p&gt;I agree that the old movies were more tongue-in-cheek...there were more ridiculous gadgets, Bond cracked jokes as he killed people, etc. ....the new movies are more serious....Bond doesn&amp;#39;t like what he does, he&amp;#39;s very good at it and he drinks to cope...just like the book-Bond&lt;/p&gt;\n\n&lt;p&gt;My point is, it&amp;#39;s already very difficult to judge subjective preferences for movies, but given that you consider the old/new movies to all be generally good, then shouldn&amp;#39;t staying true to the real Bond elevate the new movies over the old movies?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9d4qm", "score_hidden": false, "stickied": false, "created": 1492216188.0, "created_utc": 1492187388.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65d710", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65d710", "likes": null, "replies": "", "user_reports": [], "id": "dg9rnsn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EmperorBasilius", "parent_id": "t1_dg9fk8f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think that the new Bonds, while are good movies by themselves, lost their Bond \"charm\" and became more generic Hollywood action films.\n\nI actually liked Spectre.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that the new Bonds, while are good movies by themselves, lost their Bond &amp;quot;charm&amp;quot; and became more generic Hollywood action films.&lt;/p&gt;\n\n&lt;p&gt;I actually liked Spectre.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9rnsn", "score_hidden": false, "stickied": false, "created": 1492233443.0, "created_utc": 1492204643.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9fk8f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FlexPlexico12", "parent_id": "t3_65d710", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So you are saying that the old bond films were better because they were cliched and cheesy? Everyone has different tastes, but I think a lot of people prefer the darker, grittier bond. One of my complaints about the old bond movies is that I never got a real sense of danger. That being said, the most recent bond movie, Spectre, was absolute shit in my opinion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you are saying that the old bond films were better because they were cliched and cheesy? Everyone has different tastes, but I think a lot of people prefer the darker, grittier bond. One of my complaints about the old bond movies is that I never got a real sense of danger. That being said, the most recent bond movie, Spectre, was absolute shit in my opinion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9fk8f", "score_hidden": false, "stickied": false, "created": 1492218942.0, "created_utc": 1492190142.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65d710", "likes": null, "replies": "", "user_reports": [], "id": "dgacvrz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "redditfromnowhere", "parent_id": "t3_65d710", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; [Craig &amp; Brosnan] feature a different, darker side of Bond that is more authentic to the Ian Fleming books.\n\n*\"GoldenEye\"* (1995) is [not based on](https://en.wikipedia.org/wiki/GoldenEye) an Ian Flemming novel, yet it hits all of your check-marks:\n\n&gt; Traditionally, the Bond films were the prime example of the cheesy spy movie - the caricaturesque villain (1) in his secret lair (2) and evil plan (3); the sexy Bond-girl (4); Bond himself, a though but sly protagonist (5), featuring very few character development or depth (6); and of course, the ongoing repetitive phrases like \"shaken, not stirred\" (7).\n\n1. [spoilers](#s \"Alec Trevelyan\") (even has the traditional stand-out physical [trait/deformity](#s \"a burnt and scarred face\"))\n2. Satellite base in the Cuban jungle\n3. Revenge against the Royal Army by launching the GoldenEye and stealing vast sums of money\n4. Natalya Simonova &amp; Xenia Onatopp (she even has the traditional sexy-pun name)\n5. [Quippy](https://youtu.be/sRF9UX2aqPY?t=73) throughout the film\n6. Very much a man-of-mystery\n7. He orders one [here...](http://www.imdb.com/title/tt0113189/quotes?item=qt0448566)\n\n\nAnd you've admitted it to be among an \"excellent film\" category. I think you need to give a little credit where it's due.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;[Craig &amp;amp; Brosnan] feature a different, darker side of Bond that is more authentic to the Ian Fleming books.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;GoldenEye&amp;quot;&lt;/em&gt; (1995) is &lt;a href=\"https://en.wikipedia.org/wiki/GoldenEye\"&gt;not based on&lt;/a&gt; an Ian Flemming novel, yet it hits all of your check-marks:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Traditionally, the Bond films were the prime example of the cheesy spy movie - the caricaturesque villain (1) in his secret lair (2) and evil plan (3); the sexy Bond-girl (4); Bond himself, a though but sly protagonist (5), featuring very few character development or depth (6); and of course, the ongoing repetitive phrases like &amp;quot;shaken, not stirred&amp;quot; (7).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;a href=\"#s\" title=\"Alec Trevelyan\"&gt;spoilers&lt;/a&gt; (even has the traditional stand-out physical &lt;a href=\"#s\" title=\"a burnt and scarred face\"&gt;trait/deformity&lt;/a&gt;)&lt;/li&gt;\n&lt;li&gt;Satellite base in the Cuban jungle&lt;/li&gt;\n&lt;li&gt;Revenge against the Royal Army by launching the GoldenEye and stealing vast sums of money&lt;/li&gt;\n&lt;li&gt;Natalya Simonova &amp;amp; Xenia Onatopp (she even has the traditional sexy-pun name)&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://youtu.be/sRF9UX2aqPY?t=73\"&gt;Quippy&lt;/a&gt; throughout the film&lt;/li&gt;\n&lt;li&gt;Very much a man-of-mystery&lt;/li&gt;\n&lt;li&gt;He orders one &lt;a href=\"http://www.imdb.com/title/tt0113189/quotes?item=qt0448566\"&gt;here...&lt;/a&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;And you&amp;#39;ve admitted it to be among an &amp;quot;excellent film&amp;quot; category. I think you need to give a little credit where it&amp;#39;s due.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgacvrz", "score_hidden": false, "stickied": false, "created": 1492264554.0, "created_utc": 1492235754.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65d710", "likes": null, "replies": "", "user_reports": [], "id": "dg9mwbl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thearmadillo", "parent_id": "t3_65d710", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The old bond films culminated with Austin Powers, which was such a spot on satire of all the Bond tropes and cheese that the Bond films had to move on or become a parody of themselves. You run out of times you can name the female lead Pussy Galore before people start laughing at Alotta Fagina. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The old bond films culminated with Austin Powers, which was such a spot on satire of all the Bond tropes and cheese that the Bond films had to move on or become a parody of themselves. You run out of times you can name the female lead Pussy Galore before people start laughing at Alotta Fagina. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dg9mwbl", "score_hidden": false, "stickied": false, "created": 1492227651.0, "created_utc": 1492198851.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]