[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h3&gt;TL;DR&lt;/h3&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Classical utilitarianism is the belief that maximizing happiness is good.&lt;/li&gt;\n&lt;li&gt;It&amp;#39;s very popular here on Reddit and CMV.&lt;/li&gt;\n&lt;li&gt;I wanted to believe it, but these objections convinced me otherwise:&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;ol&gt;\n&lt;li&gt;The utility monster: If some being can turn resources into happiness more efficiently than a person or group of people, then we should give all resources to that being and none to the person or group.&lt;/li&gt;\n&lt;li&gt;The mere addition paradox and the &amp;quot;repugnant conclusion&amp;quot;: If maximizing total happiness is good, then we should increase the population infinitely, but if maximizing average happiness is good, we should kill everyone with less-than-average happiness until only the happiest person is left. Both are bad.&lt;/li&gt;\n&lt;li&gt;The tyranny of the majority: A majority group is justified in doing any awful thing that they want to a minority group. The &amp;quot;organ transplant scenario&amp;quot; is one example.&lt;/li&gt;\n&lt;li&gt;The superfluity of people: Letting people live and reproduce naturally is inefficient for maximizing happiness. Instead, beings should be mass-produced which experience happiness but lack any non-happiness-related traits like intelligence, senses, creativity, bodies, etc.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Responses to these objections are described and rebutted.&lt;/li&gt;\n&lt;li&gt;Change my view: These objections discredit classical utilitarianism.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h3&gt;Introduction&lt;/h3&gt;\n\n&lt;p&gt;Classical utilitarianism is the belief that &lt;a href=\"https://www.reddit.com/r/changemyview/comments/2yta8c/cmv_utilitarianism_is_the_best_source_for_morality\"&gt;&amp;quot;an action is right insofar as it promotes happiness, and that the greatest happiness of the greatest number should be the guiding principle of conduct&amp;quot;&lt;/a&gt;. I used to be sympathetic to it, but after understanding the objections in this post, I gave it up. They all &lt;a href=\"https://en.wikipedia.org/wiki/Reductio_ad_absurdum\"&gt;reduce it to absurdity&lt;/a&gt; like this: &amp;quot;In some situation, utilitarianism would justify doing action X, but we feel that action X is unethical; therefore utilitarianism is an untenable ethical system.&amp;quot; A utilitarian can simply ignore this kind of argument and &amp;quot;bite the bullet&amp;quot; by accepting its conclusion, but they would have to accept some very uncomfortable ideas.&lt;/p&gt;\n\n&lt;p&gt;In this post I ignore objections to utilitarianism which call it &lt;em&gt;unrealistic,&lt;/em&gt; including the &lt;a href=\"https://en.wikipedia.org/wiki/Paradox_of_hedonism\"&gt;paradox of hedonism&lt;/a&gt;, the difficulty of defining/measuring &amp;quot;happiness,&amp;quot; and the difficulty of predicting what will maximize happiness. I also ignore objections which call it &lt;em&gt;unjustified&lt;/em&gt;, like the &lt;a href=\"https://en.wikipedia.org/wiki/Open-question_argument\"&gt;open-question argument&lt;/a&gt;, and objections based on religious belief.&lt;/p&gt;\n\n&lt;p&gt;Classical utilitarianism seems quite popular here on CMV, which I noticed in a recent CMV &lt;a href=\"https://www.reddit.com/r/changemyview/comments/63l2vd/cmv_letting_a_fetus_with_an_incurable_disease\"&gt;post about a fetus with an incurable disease&lt;/a&gt;. The OP, and most of the commenters, all seemed to assume that classical utilitarianism is true. A search for &amp;quot;utilitarianism&amp;quot; on &lt;a href=\"/r/changemyview\"&gt;/r/changemyview&lt;/a&gt; turned up plenty of other posts supporting it. Users have called classical utilitarianism &lt;a href=\"https://www.reddit.com/r/changemyview/comments/1hm7uw/i_believe_utilitarianism_is_the_only_valid_system\"&gt;&amp;quot;the only valid system of morals&amp;quot;&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/changemyview/comments/1eltro/i_believe_that_utilitarianism_should_be_the_only\"&gt;&amp;quot;the only moral law&amp;quot;&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/changemyview/comments/2yta8c/cmv_utilitarianism_is_the_best_source_for_morality\"&gt;&amp;quot;the best source for morality&amp;quot;&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/changemyview/comments/5hzak4/cmv_the_only_valid_moral_philosophy_is_one_that\"&gt;&amp;quot;the only valid moral philosophy&amp;quot;&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/changemyview/comments/1th1id/utilitarianism_is_the_most_effective_method_of\"&gt;&amp;quot;the most effective way of achieving political and social change&amp;quot;&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/changemyview/comments/1ddpxl/i_believe_that_a_utilitarian_society_is_the_only\"&gt;&amp;quot;the only morally just [foundation for] society&amp;quot;&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/changemyview/comments/1jzvzb/i_believe_that_human_life_must_have_finite_value\"&gt;et cetera&lt;/a&gt;, &lt;a href=\"https://www.reddit.com/r/changemyview/comments/1yimak/i_dont_think_any_conventional_morals_make_sense\"&gt;et cetera&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Only three posts from that search focused on opposing utilitarianism. Two &lt;a href=\"https://www.reddit.com/r/changemyview/comments/25vvbd/cmv_i_think_that_kantian_ethics_is_the_best\"&gt;criticized it&lt;/a&gt; from a &lt;a href=\"https://www.reddit.com/r/changemyview/comments/1hn2b9/because_i_learned_a_lot_of_cool_stuff_in_the\"&gt;Kantian perspective&lt;/a&gt;, and the latter was inspired by a post supporting utilitarianism because the poster &amp;quot;thought it would be interesting to come at it from a different angle.&amp;quot; I found &lt;a href=\"https://www.reddit.com/r/changemyview/comments/1eb0qz/cmv_utilitarianism_is_too_demanding_and_too\"&gt;exactly one post&lt;/a&gt; focused purely on criticizing utilitarianism...and it was one sentence long with one reply.&lt;/p&gt;\n\n&lt;p&gt;Basically, no one else appears to have made a post about this. I sincerely reject utilitarianism because of the objections below. While they are framed as opposing &lt;em&gt;classical&lt;/em&gt; utilitarianism, objections (1) to (3) notably apply to any form of utilitarianism if &amp;quot;happiness&amp;quot; is replaced with &amp;quot;utility.&amp;quot; I kind of &lt;em&gt;want&lt;/em&gt; someone to change my view here, since I have no moral framework without utilitarianism (although using informed consent as a deontological principle sounds nice). &lt;strong&gt;Change my view!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;h3&gt;The objections:&lt;/h3&gt;\n\n&lt;p&gt;A helpful thought experiment for each of these objections is the &lt;strong&gt;&amp;quot;Utilitarian AI Overlord.&amp;quot;&lt;/strong&gt; Each objection can be seen as a nasty consequence of giving a superintelligent artificial intelligence (AI) complete control over human governments and telling it to &amp;quot;maximize happiness.&amp;quot; If this would cause the AI to act in a manner we consider unethical, then classical utilitarianism cannot be a valid ethical principle.&lt;/p&gt;\n\n&lt;h2&gt;1. &lt;a href=\"https://en.wikipedia.org/wiki/Utility_monster\"&gt;The utility monster&lt;/a&gt;.&lt;/h2&gt;\n\n&lt;p&gt;A &amp;quot;utility monster&amp;quot; is a being which can transform resources into units of happiness much more efficiently than others, and therefore deserves more resources. If a utility monster has a higher happiness efficiency than a group of people, no matter how large, a classical utilitarian is morally obligated to give all resources to the utility monster. See &lt;a href=\"http://www.smbc-comics.com/?id=2569\"&gt;this SMBC comic&lt;/a&gt; for a vivid demonstration of why the utility monster would be horrifying (it also demonstrates the &amp;quot;Utilitarian AI Overlord&amp;quot; idea).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Responses:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;The more like a utility monster that an entity is, the more problematic it is, but also the less realistic it is and therefore the less of a problem it is. The logical extreme of a utility monster would have an infinite happiness efficiency, which is logically incoherent.&lt;/li&gt;\n&lt;li&gt; Money makes people decreasingly happier as that person makes more money: &amp;quot;&lt;a href=\"https://www.brookings.edu/research/subjective-well%E2%80%90being-and-income-is-there-any-evidence-of-satiation\"&gt;increasing income yields diminishing marginal gains in subjective well-being … while each additional dollar of income yields a greater increment to measured happiness for the poor than for the rich, there is no satiation point”&lt;/a&gt;. In this real-life context, giving additional resources to one person has diminishing returns. This has two significant implications (responses 3 and 4):&lt;/li&gt;\n&lt;li&gt;We cannot assume that individuals have fixed efficiency values of turning resources into happiness which are unaffected by their happiness levels, a foundational assumption of the “utility monster” argument.&lt;/li&gt;\n&lt;li&gt;A resource-rich person is less efficient than a resource-poor person. The more that the utility monster is &amp;quot;fed,&amp;quot; the less &amp;quot;hungry&amp;quot; it will be, and the less of an obligation there will be to provide it with resources. At the monster&amp;#39;s satiation point of maximum possible happiness, there will be no obligation to provide it with any more resources, which can then be distributed to everyone else. As &lt;a href=\"/u/LappenX\"&gt;/u/LappenX&lt;/a&gt; &lt;a href=\"https://www.reddit.com/r/changemyview/comments/5qjljk/cmv_nozicks_conclusion_from_the_utility_monster\"&gt;said&lt;/a&gt;:\n&amp;quot;The most plausible conclusion would be to assume that the &lt;em&gt;inverse relation between received utility and utility efficiency&lt;/em&gt; is a necessary property of moral objects. Therefore, a utility monster&amp;#39;s utility efficiency would rapidly decrease as it is given resources to the point where its utility efficiency reaches a level that is similar to those of other beings that may receive resources.&amp;quot;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/comments/5qjljk/cmv_nozicks_conclusion_from_the_utility_monster\"&gt;We are already utility monsters&lt;/a&gt;:&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A starving child in Africa for example would gain vastly more utility by a transaction of $100 than almost all people in first world countries would; and lots of people in first world countries give money to charitable causes knowing that that will do way more good than what they could do with the money ... We have way greater utility efficiencies than animals, such that they&amp;#39;d have to be suffering quite a lot (i.e. high utility efficiency) to be on par with humans; the same way humans would have to suffer quite a lot to be on par with the utility monster in terms of utility efficiency. Suggesting that utility monsters (if they can even exist) should have the same rights and get the same treatment as normal humans (i.e. not the utilitarian position) would then imply that humans should have the same rights and get the same treatment as animals.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;Rebuttals:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Against response (1): Realistic and problematic examples of a utility monster are easily conceivable. A sadistic psychopath who &amp;quot;steals happiness&amp;quot; by getting more happiness from victimizing people than the victim(s) lose is &lt;em&gt;benevolent&lt;/em&gt; given utilitarianism. Or consider an abusive relationship between an abuser with Bipolar Disorder and a victim with &lt;a href=\"https://en.wikipedia.org/wiki/Dysthymia\"&gt;dysthymia&lt;/a&gt; (persistent mild depression causing a limited mood range). The victim is morally obligated to stay with their abuser because every unit of time that the victim spends with their abuser will make their abuser happier than it could possibly make them unhappy.&lt;/li&gt;\n&lt;li&gt;All of these responses &lt;em&gt;completely ignore the possibility&lt;/em&gt; of a utility monster with a fixed happiness efficiency.  Even ignoring whether it is realistic, imagining one is enough to demonstrate the point. If we can imagine a situation where maximizing happiness is not good, then we cannot define good as maximizing happiness. &lt;a href=\"https://www.reddit.com/r/changemyview/comments/5qjljk/cmv_nozicks_conclusion_from_the_utility_monster/dczw6uv\"&gt;Some have argued&lt;/a&gt; that an individual with a changing happiness efficiency &lt;a href=\"https://www.reddit.com/r/changemyview/comments/5qjljk/cmv_nozicks_conclusion_from_the_utility_monster/dczxsf4\"&gt;does not even count as a utility monster&lt;/a&gt;: &amp;quot;A utility monster would be someone who, even after you gave him half your money to make him as rich as you, still demands more. He benefits from additional dollars so much more than you that it makes sense to keep giving him dollars until you have nearly nothing, because each time he gets a dollar he benefits more than you hurt. This does not exist for starving people in Africa; presumably, if you gave them half your money, comfort, and security, they would be as happy--perhaps happier!--than you.&amp;quot;&lt;/li&gt;\n&lt;li&gt;Against responses (2) to (4): Even if we consider individuals with changing happiness efficiency values to be utility monsters, changing happiness efficiency backfires: just because happiness efficiency can diminish after resource consumption does not mean it will &lt;em&gt;stay&lt;/em&gt; diminished. For living creatures, happiness efficiency is likely to increase for every unit of time that they are not consuming resources. If a utility monster is &amp;quot;fed,&amp;quot; then it is unlikely to stay &amp;quot;full&amp;quot; for long, and as soon as it becomes &amp;quot;hungry&amp;quot; again then it is a problem once again. Consider the examples from rebuttal (1): A sadistic psychopath will probably not be satisfied victimizing one person but will want to victimize multiple people, and in the abusive relationship, the bipolar abuser&amp;#39;s moods are unlikely to last long, so the victim will constantly feel obligated to alleviate the &amp;quot;downswings&amp;quot; in the abuser&amp;#39;s mood cycle.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;h2&gt;2. &lt;a href=\"https://en.wikipedia.org/wiki/Average_and_total_utilitarianism\"&gt;Average and total utilitarianism&lt;/a&gt;, &lt;a href=\"https://en.wikipedia.org/wiki/Mere_addition_paradox\"&gt;the mere addition paradox, and the repugnant conclusion&lt;/a&gt;.&lt;/h2&gt;\n\n&lt;p&gt;If it is good to increase the average happiness of a population, then it is good to kill off anyone whose happiness is lower than average. Eventually, there will only be one person in the population who has maximum happiness. If it is good to increase the total happiness of a population, then it is good to increase the number of people infinitely, since each new person has some nonzero amount of happiness. The former entails genocide and the latter entails widespread suffering.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Responses:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;When someone dies, it decreases the happiness of anyone who cares about that person. If a person’s death reduces the utility of multiple others and lowers the average happiness more than their death raises it, killing that person cannot be justified because it will decrease the population’s average happiness. Likewise, if it is plausible to increase the utility of a given person without killing them, that would be less costly than killing them because it would be less likely to decrease others’ happiness as well.&lt;/li&gt;\n&lt;li&gt;Each person&amp;#39;s happiness/suffering score (HSS) could be scored on a scale from -X to X where X is some arbitrary positive number on a &lt;a href=\"https://en.wikipedia.org/wiki/Likert_scale\"&gt;Likert-type scale&lt;/a&gt;. A population would be &amp;quot;too large&amp;quot; when adding one person to the population causes the HSS of some people to drop below zero and decrease the aggregate HSS.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&lt;strong&gt;Rebuttals:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Response (1) is historically contingent: it may be the case now, but we can easily imagine a situation where it is not the case. For example, to avoid making others unhappy when killing someone, we can imagine an AI Overlord changing the others&amp;#39; memories or simply hooking everyone up to &lt;a href=\"http://wireheading.com\"&gt;pleasure-stimulation devices&lt;/a&gt; so that their happiness does not depend on relationships with other people.&lt;/li&gt;\n&lt;li&gt;Response (2) changes the definition of classical utilitarianism, which here is a fallacy of &lt;a href=\"http://rationalwiki.org/wiki/Moving_the_goalposts\"&gt;&amp;quot;moving the goalposts&amp;quot;&lt;/a&gt;. Technically, accepting it concedes the point by admitting that the &amp;quot;maximum happiness&amp;quot; principle on its own is unethical.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;h2&gt;3. &lt;a href=\"https://en.wikipedia.org/wiki/Tyranny_of_the_majority\"&gt;The tyranny of the majority&lt;/a&gt;.&lt;/h2&gt;\n\n&lt;p&gt;If a group of people get more happiness from victimizing a smaller group than that smaller group loses from being victimized, then the larger group is justified. Without some concept of inalienable human rights, any cruel acts against a minority group are justifiable if they please the majority. Minority groups are always wrong.&lt;/p&gt;\n\n&lt;p&gt;The &lt;a href=\"https://www.reddit.com/r/changemyview/comments/1ddpxl/i_believe_that_a_utilitarian_society_is_the_only/c9pbiz2\"&gt;&amp;quot;organ transplant scenario&amp;quot;&lt;/a&gt; is one example:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;[Consider] a patient going into a doctor&amp;#39;s office for a minor infection [who] needs some blood work done. By chance, this patient happens to be a compatible organ donor for five other patients in the ICU right now. Should this doctor kill the patient suffering from a minor infection, harvest their organs, and save the lives of five other people?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;Response:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If the &amp;quot;organ transplant&amp;quot; procedure was commonplace, &lt;a href=\"https://www.reddit.com/r/changemyview/comments/3ovlew/cmv_the_organ_transplant_scenario_is_a_bad\"&gt;it would decrease happiness&lt;/a&gt;:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;It&amp;#39;s clear that people would avoid hospitals if this were to happen in the real world, resulting in more suffering over time.&lt;/strong&gt; Wait, though! &lt;strong&gt;Some people try to add another stipulation: it&amp;#39;s 100% guaranteed that nobody will ever find out about this. The stranger has no relatives, etc.&lt;/strong&gt; Without even addressing the issue of whether this would be, in fact, morally acceptable in the utilitarian sense, it&amp;#39;s unrealistic to the point of absurdity.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;Rebuttals:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Again, even if a situation is unrealistic, it is still a valid argument if we can imagine it. See rebuttal (2) to the utility monster responses.&lt;/li&gt;\n&lt;li&gt;This argument is historically contingent, because it &lt;a href=\"https://www.reddit.com/r/changemyview/comments/3ovlew/cmv_the_organ_transplant_scenario_is_a_bad/cw0u222/?utm_content=permalink&amp;amp;utm_medium=front&amp;amp;utm_source=reddit&amp;amp;utm_name=changemyview\"&gt;assumes that people will stay as they are&lt;/a&gt;:&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If you&amp;#39;re a utilitarian, it would be moral to implement this on the national scale. Therefore, it stops being unrealistic. Remember, it&amp;#39;s only an unrealistic scenario because we&amp;#39;re not purist utilitarians. However, if you&amp;#39;re an advocate of utilitarianism, you hope that one day most or all of us will be purist utilitarians.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;h2&gt;4. The superfluity of people.&lt;/h2&gt;\n\n&lt;p&gt;It is less efficient to create happiness in naturally produced humans than in some kind of mass-produced non-person entities. Resources should not be given to people because human reproduction is an inefficient method of creating happiness; instead, resources should be given to factories which will mass-produce &amp;quot;happy neuroblobs&amp;quot;: brain pleasure centers attached to stimulation devices. No happy neuroblob will be a person, but who cares if happiness is maximized?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Response:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;We can specify that the utilitarian principle is &amp;quot;maximize the happiness &lt;em&gt;of people.&lt;/em&gt;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Rebuttals:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Even under that definition, it is still good for an AI Overlord to mass-produce people without characteristics that we would probably prefer future humans to keep: intelligence, senses, creativity, bodies, et cetera.&lt;/li&gt;\n&lt;li&gt;The main point is that utilitarianism has an underwhelming, if not repugnant, endgoal: a bunch of people hooked up to happiness-inducing devices, because any resource which is not spent increasing happiness is wasted.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Sorry for making this post so long. I wanted to provide a comprehensive overview of the objections that changed my view in the first place, and respond to previous CMV posts supporting utilitarianism. So…CMV!&lt;/p&gt;\n\n&lt;p&gt;Edited initially to fix formatting.&lt;/p&gt;\n\n&lt;p&gt;Edit 2: &lt;strong&gt;So far I have changed my view in these specific ways:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/dga77qv\"&gt;These objections only apply to reductionistic utilitarianism, where the total happiness is nothing more than the sum of every individual&amp;#39;s happiness.&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/dga83b4\"&gt;The mere addition paradox and the repugnant conclusion can be avoided by incorporating the idea of negative utility into total utilitarianism.&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/dgabnda\"&gt;The principle of informed consent is not necessarily moral in all possible worlds.&lt;/a&gt;&lt;/p&gt;\n\n&lt;hr/&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;This is a footnote from the CMV moderators. We&amp;#39;d like to remind you of a couple of things. Firstly, please&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules\"&gt;read through our rules&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting\"&gt;downvotes don&amp;#39;t change views&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;! Any questions or concerns? Feel free to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/message/compose?to=/r/changemyview\"&gt;message us&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;Happy CMVing!&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "###TL;DR\n- Classical utilitarianism is the belief that maximizing happiness is good.\n- It's very popular here on Reddit and CMV.\n- I wanted to believe it, but these objections convinced me otherwise:\n\n1. The utility monster: If some being can turn resources into happiness more efficiently than a person or group of people, then we should give all resources to that being and none to the person or group.\n2. The mere addition paradox and the \"repugnant conclusion\": If maximizing total happiness is good, then we should increase the population infinitely, but if maximizing average happiness is good, we should kill everyone with less-than-average happiness until only the happiest person is left. Both are bad.\n3. The tyranny of the majority: A majority group is justified in doing any awful thing that they want to a minority group. The \"organ transplant scenario\" is one example.\n4. The superfluity of people: Letting people live and reproduce naturally is inefficient for maximizing happiness. Instead, beings should be mass-produced which experience happiness but lack any non-happiness-related traits like intelligence, senses, creativity, bodies, etc.\n\n- Responses to these objections are described and rebutted.\n- Change my view: These objections discredit classical utilitarianism.\n\n###Introduction\n\nClassical utilitarianism is the belief that [\"an action is right insofar as it promotes happiness, and that the greatest happiness of the greatest number should be the guiding principle of conduct\"](https://www.reddit.com/r/changemyview/comments/2yta8c/cmv_utilitarianism_is_the_best_source_for_morality). I used to be sympathetic to it, but after understanding the objections in this post, I gave it up. They all [reduce it to absurdity](https://en.wikipedia.org/wiki/Reductio_ad_absurdum) like this: \"In some situation, utilitarianism would justify doing action X, but we feel that action X is unethical; therefore utilitarianism is an untenable ethical system.\" A utilitarian can simply ignore this kind of argument and \"bite the bullet\" by accepting its conclusion, but they would have to accept some very uncomfortable ideas.\n\nIn this post I ignore objections to utilitarianism which call it *unrealistic,* including the [paradox of hedonism](https://en.wikipedia.org/wiki/Paradox_of_hedonism), the difficulty of defining/measuring \"happiness,\" and the difficulty of predicting what will maximize happiness. I also ignore objections which call it *unjustified*, like the [open-question argument](https://en.wikipedia.org/wiki/Open-question_argument), and objections based on religious belief.\n\nClassical utilitarianism seems quite popular here on CMV, which I noticed in a recent CMV [post about a fetus with an incurable disease](https://www.reddit.com/r/changemyview/comments/63l2vd/cmv_letting_a_fetus_with_an_incurable_disease). The OP, and most of the commenters, all seemed to assume that classical utilitarianism is true. A search for \"utilitarianism\" on /r/changemyview turned up plenty of other posts supporting it. Users have called classical utilitarianism [\"the only valid system of morals\"](https://www.reddit.com/r/changemyview/comments/1hm7uw/i_believe_utilitarianism_is_the_only_valid_system), [\"the only moral law\"](https://www.reddit.com/r/changemyview/comments/1eltro/i_believe_that_utilitarianism_should_be_the_only), [\"the best source for morality\"](https://www.reddit.com/r/changemyview/comments/2yta8c/cmv_utilitarianism_is_the_best_source_for_morality), [\"the only valid moral philosophy\"](https://www.reddit.com/r/changemyview/comments/5hzak4/cmv_the_only_valid_moral_philosophy_is_one_that), [\"the most effective way of achieving political and social change\"](https://www.reddit.com/r/changemyview/comments/1th1id/utilitarianism_is_the_most_effective_method_of), [\"the only morally just [foundation for] society\"](https://www.reddit.com/r/changemyview/comments/1ddpxl/i_believe_that_a_utilitarian_society_is_the_only), [et cetera](https://www.reddit.com/r/changemyview/comments/1jzvzb/i_believe_that_human_life_must_have_finite_value), [et cetera](https://www.reddit.com/r/changemyview/comments/1yimak/i_dont_think_any_conventional_morals_make_sense).\n\nOnly three posts from that search focused on opposing utilitarianism. Two [criticized it](https://www.reddit.com/r/changemyview/comments/25vvbd/cmv_i_think_that_kantian_ethics_is_the_best) from a [Kantian perspective](https://www.reddit.com/r/changemyview/comments/1hn2b9/because_i_learned_a_lot_of_cool_stuff_in_the), and the latter was inspired by a post supporting utilitarianism because the poster \"thought it would be interesting to come at it from a different angle.\" I found [exactly one post](https://www.reddit.com/r/changemyview/comments/1eb0qz/cmv_utilitarianism_is_too_demanding_and_too) focused purely on criticizing utilitarianism...and it was one sentence long with one reply.\n\nBasically, no one else appears to have made a post about this. I sincerely reject utilitarianism because of the objections below. While they are framed as opposing *classical* utilitarianism, objections (1) to (3) notably apply to any form of utilitarianism if \"happiness\" is replaced with \"utility.\" I kind of *want* someone to change my view here, since I have no moral framework without utilitarianism (although using informed consent as a deontological principle sounds nice). **Change my view!**\n\n###The objections:\n\nA helpful thought experiment for each of these objections is the **\"Utilitarian AI Overlord.\"** Each objection can be seen as a nasty consequence of giving a superintelligent artificial intelligence (AI) complete control over human governments and telling it to \"maximize happiness.\" If this would cause the AI to act in a manner we consider unethical, then classical utilitarianism cannot be a valid ethical principle.\n\n##1. [The utility monster](https://en.wikipedia.org/wiki/Utility_monster).\nA \"utility monster\" is a being which can transform resources into units of happiness much more efficiently than others, and therefore deserves more resources. If a utility monster has a higher happiness efficiency than a group of people, no matter how large, a classical utilitarian is morally obligated to give all resources to the utility monster. See [this SMBC comic](http://www.smbc-comics.com/?id=2569) for a vivid demonstration of why the utility monster would be horrifying (it also demonstrates the \"Utilitarian AI Overlord\" idea).\n\n**Responses:**\n\n1. The more like a utility monster that an entity is, the more problematic it is, but also the less realistic it is and therefore the less of a problem it is. The logical extreme of a utility monster would have an infinite happiness efficiency, which is logically incoherent.\n2.  Money makes people decreasingly happier as that person makes more money: \"[increasing income yields diminishing marginal gains in subjective well-being … while each additional dollar of income yields a greater increment to measured happiness for the poor than for the rich, there is no satiation point”](https://www.brookings.edu/research/subjective-well%E2%80%90being-and-income-is-there-any-evidence-of-satiation). In this real-life context, giving additional resources to one person has diminishing returns. This has two significant implications (responses 3 and 4):\n3. We cannot assume that individuals have fixed efficiency values of turning resources into happiness which are unaffected by their happiness levels, a foundational assumption of the “utility monster” argument.\n4. A resource-rich person is less efficient than a resource-poor person. The more that the utility monster is \"fed,\" the less \"hungry\" it will be, and the less of an obligation there will be to provide it with resources. At the monster's satiation point of maximum possible happiness, there will be no obligation to provide it with any more resources, which can then be distributed to everyone else. As /u/LappenX [said](https://www.reddit.com/r/changemyview/comments/5qjljk/cmv_nozicks_conclusion_from_the_utility_monster):\n\"The most plausible conclusion would be to assume that the *inverse relation between received utility and utility efficiency* is a necessary property of moral objects. Therefore, a utility monster's utility efficiency would rapidly decrease as it is given resources to the point where its utility efficiency reaches a level that is similar to those of other beings that may receive resources.\"\n5. [We are already utility monsters](https://www.reddit.com/r/changemyview/comments/5qjljk/cmv_nozicks_conclusion_from_the_utility_monster):\n\n&gt;A starving child in Africa for example would gain vastly more utility by a transaction of $100 than almost all people in first world countries would; and lots of people in first world countries give money to charitable causes knowing that that will do way more good than what they could do with the money ... We have way greater utility efficiencies than animals, such that they'd have to be suffering quite a lot (i.e. high utility efficiency) to be on par with humans; the same way humans would have to suffer quite a lot to be on par with the utility monster in terms of utility efficiency. Suggesting that utility monsters (if they can even exist) should have the same rights and get the same treatment as normal humans (i.e. not the utilitarian position) would then imply that humans should have the same rights and get the same treatment as animals.\n\n**Rebuttals:**\n\n1. Against response (1): Realistic and problematic examples of a utility monster are easily conceivable. A sadistic psychopath who \"steals happiness\" by getting more happiness from victimizing people than the victim(s) lose is *benevolent* given utilitarianism. Or consider an abusive relationship between an abuser with Bipolar Disorder and a victim with [dysthymia](https://en.wikipedia.org/wiki/Dysthymia) (persistent mild depression causing a limited mood range). The victim is morally obligated to stay with their abuser because every unit of time that the victim spends with their abuser will make their abuser happier than it could possibly make them unhappy.\n2. All of these responses *completely ignore the possibility* of a utility monster with a fixed happiness efficiency.  Even ignoring whether it is realistic, imagining one is enough to demonstrate the point. If we can imagine a situation where maximizing happiness is not good, then we cannot define good as maximizing happiness. [Some have argued](https://www.reddit.com/r/changemyview/comments/5qjljk/cmv_nozicks_conclusion_from_the_utility_monster/dczw6uv) that an individual with a changing happiness efficiency [does not even count as a utility monster](https://www.reddit.com/r/changemyview/comments/5qjljk/cmv_nozicks_conclusion_from_the_utility_monster/dczxsf4): \"A utility monster would be someone who, even after you gave him half your money to make him as rich as you, still demands more. He benefits from additional dollars so much more than you that it makes sense to keep giving him dollars until you have nearly nothing, because each time he gets a dollar he benefits more than you hurt. This does not exist for starving people in Africa; presumably, if you gave them half your money, comfort, and security, they would be as happy--perhaps happier!--than you.\"\n3. Against responses (2) to (4): Even if we consider individuals with changing happiness efficiency values to be utility monsters, changing happiness efficiency backfires: just because happiness efficiency can diminish after resource consumption does not mean it will *stay* diminished. For living creatures, happiness efficiency is likely to increase for every unit of time that they are not consuming resources. If a utility monster is \"fed,\" then it is unlikely to stay \"full\" for long, and as soon as it becomes \"hungry\" again then it is a problem once again. Consider the examples from rebuttal (1): A sadistic psychopath will probably not be satisfied victimizing one person but will want to victimize multiple people, and in the abusive relationship, the bipolar abuser's moods are unlikely to last long, so the victim will constantly feel obligated to alleviate the \"downswings\" in the abuser's mood cycle.\n\n##2. [Average and total utilitarianism](https://en.wikipedia.org/wiki/Average_and_total_utilitarianism), [the mere addition paradox, and the repugnant conclusion](https://en.wikipedia.org/wiki/Mere_addition_paradox).\nIf it is good to increase the average happiness of a population, then it is good to kill off anyone whose happiness is lower than average. Eventually, there will only be one person in the population who has maximum happiness. If it is good to increase the total happiness of a population, then it is good to increase the number of people infinitely, since each new person has some nonzero amount of happiness. The former entails genocide and the latter entails widespread suffering.\n\n**Responses:**\n\n1. When someone dies, it decreases the happiness of anyone who cares about that person. If a person’s death reduces the utility of multiple others and lowers the average happiness more than their death raises it, killing that person cannot be justified because it will decrease the population’s average happiness. Likewise, if it is plausible to increase the utility of a given person without killing them, that would be less costly than killing them because it would be less likely to decrease others’ happiness as well.\n2. Each person's happiness/suffering score (HSS) could be scored on a scale from -X to X where X is some arbitrary positive number on a [Likert-type scale](https://en.wikipedia.org/wiki/Likert_scale). A population would be \"too large\" when adding one person to the population causes the HSS of some people to drop below zero and decrease the aggregate HSS.\n\n**Rebuttals:**\n\n1. Response (1) is historically contingent: it may be the case now, but we can easily imagine a situation where it is not the case. For example, to avoid making others unhappy when killing someone, we can imagine an AI Overlord changing the others' memories or simply hooking everyone up to [pleasure-stimulation devices](http://wireheading.com) so that their happiness does not depend on relationships with other people.\n2. Response (2) changes the definition of classical utilitarianism, which here is a fallacy of [\"moving the goalposts\"](http://rationalwiki.org/wiki/Moving_the_goalposts). Technically, accepting it concedes the point by admitting that the \"maximum happiness\" principle on its own is unethical.\n\n##3. [The tyranny of the majority](https://en.wikipedia.org/wiki/Tyranny_of_the_majority).\nIf a group of people get more happiness from victimizing a smaller group than that smaller group loses from being victimized, then the larger group is justified. Without some concept of inalienable human rights, any cruel acts against a minority group are justifiable if they please the majority. Minority groups are always wrong.\n\nThe [\"organ transplant scenario\"](https://www.reddit.com/r/changemyview/comments/1ddpxl/i_believe_that_a_utilitarian_society_is_the_only/c9pbiz2) is one example:\n\n&gt;[Consider] a patient going into a doctor's office for a minor infection [who] needs some blood work done. By chance, this patient happens to be a compatible organ donor for five other patients in the ICU right now. Should this doctor kill the patient suffering from a minor infection, harvest their organs, and save the lives of five other people?\n\n**Response:**\n\nIf the \"organ transplant\" procedure was commonplace, [it would decrease happiness](https://www.reddit.com/r/changemyview/comments/3ovlew/cmv_the_organ_transplant_scenario_is_a_bad):\n\n&gt;**It's clear that people would avoid hospitals if this were to happen in the real world, resulting in more suffering over time.** Wait, though! **Some people try to add another stipulation: it's 100% guaranteed that nobody will ever find out about this. The stranger has no relatives, etc.** Without even addressing the issue of whether this would be, in fact, morally acceptable in the utilitarian sense, it's unrealistic to the point of absurdity.\n\n**Rebuttals:**\n\n1. Again, even if a situation is unrealistic, it is still a valid argument if we can imagine it. See rebuttal (2) to the utility monster responses.\n2. This argument is historically contingent, because it [assumes that people will stay as they are](https://www.reddit.com/r/changemyview/comments/3ovlew/cmv_the_organ_transplant_scenario_is_a_bad/cw0u222/?utm_content=permalink&amp;utm_medium=front&amp;utm_source=reddit&amp;utm_name=changemyview):\n\n&gt;If you're a utilitarian, it would be moral to implement this on the national scale. Therefore, it stops being unrealistic. Remember, it's only an unrealistic scenario because we're not purist utilitarians. However, if you're an advocate of utilitarianism, you hope that one day most or all of us will be purist utilitarians.\n\n\n##4. The superfluity of people.\nIt is less efficient to create happiness in naturally produced humans than in some kind of mass-produced non-person entities. Resources should not be given to people because human reproduction is an inefficient method of creating happiness; instead, resources should be given to factories which will mass-produce \"happy neuroblobs\": brain pleasure centers attached to stimulation devices. No happy neuroblob will be a person, but who cares if happiness is maximized?\n\n**Response:**\n\nWe can specify that the utilitarian principle is \"maximize the happiness *of people.*\"\n\n**Rebuttals:**\n\n1. Even under that definition, it is still good for an AI Overlord to mass-produce people without characteristics that we would probably prefer future humans to keep: intelligence, senses, creativity, bodies, et cetera.\n2. The main point is that utilitarianism has an underwhelming, if not repugnant, endgoal: a bunch of people hooked up to happiness-inducing devices, because any resource which is not spent increasing happiness is wasted.\n\nSorry for making this post so long. I wanted to provide a comprehensive overview of the objections that changed my view in the first place, and respond to previous CMV posts supporting utilitarianism. So…CMV!\n\nEdited initially to fix formatting.\n\nEdit 2: **So far I have changed my view in these specific ways:**\n\n- [These objections only apply to reductionistic utilitarianism, where the total happiness is nothing more than the sum of every individual's happiness.](https://www.reddit.com/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/dga77qv)\n\n- [The mere addition paradox and the repugnant conclusion can be avoided by incorporating the idea of negative utility into total utilitarianism.](https://www.reddit.com/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/dga83b4)\n\n- [The principle of informed consent is not necessarily moral in all possible worlds.](https://www.reddit.com/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/dgabnda)\n_____\n\n&gt; *This is a footnote from the CMV moderators. We'd like to remind you of a couple of things. Firstly, please* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "FTFdeltaOP", "id": "65fjm3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 24, "report_reasons": null, "author": "GregConan", "saved": false, "mod_reports": [], "name": "t3_65fjm3", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": 1492339143.0, "link_flair_css_class": "FTFdelta", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492236200.0, "url": "https://www.reddit.com/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/", "author_flair_text": null, "quarantine": false, "title": "CMV: Classical utilitarianism is an untenable and absurd ethical system, as shown by its objections.", "created_utc": 1492207400.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 49, "visited": false, "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgaeyen", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t3_65fjm3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "/u/GregConan (OP) has awarded 1 delta in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [**here**](/r/DeltaLog/comments/65hx0e), in /r/DeltaLog.\n\nPlease note that a change of view [doesn't necessarily mean a reversal](https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F), or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/GregConan\"&gt;/u/GregConan&lt;/a&gt; (OP) has awarded 1 delta in this post.&lt;/p&gt;\n\n&lt;p&gt;All comments that earned deltas (from OP or other users) are listed &lt;a href=\"/r/DeltaLog/comments/65hx0e\"&gt;&lt;strong&gt;here&lt;/strong&gt;&lt;/a&gt;, in &lt;a href=\"/r/DeltaLog\"&gt;/r/DeltaLog&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Please note that a change of view &lt;a href=\"https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F\"&gt;doesn&amp;#39;t necessarily mean a reversal&lt;/a&gt;, or that the conversation has ended.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaeyen", "score_hidden": true, "stickied": true, "created": 1492269454.0, "created_utc": 1492240654.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgaa0oe", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "electronics12345", "parent_id": "t1_dga83b4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "No moral system encapsulates all moral intuitions. \n\nUtilitarianism emphasizes community / greater good / overall well-being and is often criticized for not looking out for individuals. Kantian Ethics is often the reverse, over emphasizing the individual at the expense of the group. Clearly, there needs to be some sort of middle group. \n\nPersonally, I find Utilitarianism to be \"True\" but Kantian Ethics to be \"Practical\". In 99% of real world situations applying Kantian Ethics is mentally faster and easier in real time. Additionally, if we go back and check to see if we are also abiding by Utilitarian logic, it turns out that we did a decent job. (ie maintaining strong property rights, telling the truth, not murdering, not stealing tends to maximize utility). It is really only odd-corner cases where we find we have made a mistake (utility monsters, sudden population shifts upwards or downwards.) Usually, maintaining individual rights maintains the greater good, though corner-cases do occasionally pop-up, which is when I defer to Utilitarianism than Kantianism. \n\nIn short, I think maintaining things such as: murder-bad, slavery-bad, consent-good, intelligence-good are great rules of thumb, but are not absolute rules. Conversely, the Greater Good can be hard to determine on short-time-scales, and cannot always be considered on time pressure. \n\nThanks for the d, just more for you to chew on. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No moral system encapsulates all moral intuitions. &lt;/p&gt;\n\n&lt;p&gt;Utilitarianism emphasizes community / greater good / overall well-being and is often criticized for not looking out for individuals. Kantian Ethics is often the reverse, over emphasizing the individual at the expense of the group. Clearly, there needs to be some sort of middle group. &lt;/p&gt;\n\n&lt;p&gt;Personally, I find Utilitarianism to be &amp;quot;True&amp;quot; but Kantian Ethics to be &amp;quot;Practical&amp;quot;. In 99% of real world situations applying Kantian Ethics is mentally faster and easier in real time. Additionally, if we go back and check to see if we are also abiding by Utilitarian logic, it turns out that we did a decent job. (ie maintaining strong property rights, telling the truth, not murdering, not stealing tends to maximize utility). It is really only odd-corner cases where we find we have made a mistake (utility monsters, sudden population shifts upwards or downwards.) Usually, maintaining individual rights maintains the greater good, though corner-cases do occasionally pop-up, which is when I defer to Utilitarianism than Kantianism. &lt;/p&gt;\n\n&lt;p&gt;In short, I think maintaining things such as: murder-bad, slavery-bad, consent-good, intelligence-good are great rules of thumb, but are not absolute rules. Conversely, the Greater Good can be hard to determine on short-time-scales, and cannot always be considered on time pressure. &lt;/p&gt;\n\n&lt;p&gt;Thanks for the d, just more for you to chew on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaa0oe", "score_hidden": false, "stickied": false, "created": 1492259097.0, "created_utc": 1492230297.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": "", "user_reports": [], "id": "dga83hq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dga83b4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/electronics12345 ([23∆](/r/changemyview/wiki/user/electronics12345)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"electronics12345\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/electronics12345\"&gt;/u/electronics12345&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/electronics12345\"&gt;23∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22electronics12345%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dga83hq", "score_hidden": false, "stickied": false, "created": 1492255902.0, "created_utc": 1492227102.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga83b4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dga5mnl", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;The repugnant conclusion is easily avoided when we acknowledge there are physical and psychological states which yield negative utilities.\n\nTrue. I kind of realized that when I could not come up with a better rebuttal to response (2) under the total/average objection. The utilitarian principle would probably have to be modified to accomodate negative utility. Classical utilitarianism only takes happiness / positive utility into account while Popper's [negative utilitarianism](https://en.wikipedia.org/wiki/Negative_utilitarianism) only takes suffering / negative utility into account - and negative utilitarianism is reduced to absurdity through a very strong objection which I didn't mention, [the benevolent world-exploder](https://en.wikipedia.org/wiki/Negative_utilitarianism#The_benevolent_world-exploder). If positive utility and negative utility are taken into account, like the \"scale from -X to X\" I mentioned, it avoids the repugnant conclusion. I will give you a ∆ for that.\n\n&gt;You express displeasure, but not an argument.\n\nFair enough. I acknowledged that \"reducing to absurdity\" only means \"refuting\" when all parties agree that the conclusion is absurd. Considering that I lack an explicit ethical basis, all I can really do is try to persuade others of absurdity.\n\n&gt;What's wrong with happiness-super blobs as you call them. What's wrong with the experience machine? What's wrong with everyone getting plugged into the Matrix. You state you don't like them, but what is inherently wrong? \n\nTo clarify, I actually do not have as much of a problem with the Matrix or the \"experience machine.\" My only concern with those is if the people inside are lied to or have no choice to leave, assuming that informed consent is a sound ethical principle.\n\nThe issue I was trying to draw attention to is *personal traits*, since people can keep those even if they are in the experience machine or the Matrix. They would still have senses, a body, language, perception in general, and intelligence. The happy neuroblobs would not have any of those things. With that in mind,\n\n&gt;What's wrong with happiness-super blobs as you call them.\n\nWould you want to be a happy neuroblob if it meant giving up your intelligence, language, senses, perception, and body? We may as well throw *individuality* in there as well, since it may be more efficient to create a solid mass of neuroblobbery (that is a technical term) than to mass-produce individual neuroblobs.\n\nAnother part of the neuroblob objection which I really should have mentioned is that a utilitarian AI Overlord would have **no reason to keep any currently existing humans alive, except as slaves** to ensure that the neuroblob factories are running smoothly. Besides that, humans would only get in the way of neuroblob mass-production.\n\nEdit: Perhaps more importantly, you have what I consider a legitimate reason to oppose creating a Utilitarian AI Overlord: if it was created, it wouldn't maximize *your* pleasure. It would either kill you or use you as a slave to keep the neuroblob factories running smoothly. Their mass-produced pleasure would outweigh yours a thousandfold.", "edited": 1492228045.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The repugnant conclusion is easily avoided when we acknowledge there are physical and psychological states which yield negative utilities.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;True. I kind of realized that when I could not come up with a better rebuttal to response (2) under the total/average objection. The utilitarian principle would probably have to be modified to accomodate negative utility. Classical utilitarianism only takes happiness / positive utility into account while Popper&amp;#39;s &lt;a href=\"https://en.wikipedia.org/wiki/Negative_utilitarianism\"&gt;negative utilitarianism&lt;/a&gt; only takes suffering / negative utility into account - and negative utilitarianism is reduced to absurdity through a very strong objection which I didn&amp;#39;t mention, &lt;a href=\"https://en.wikipedia.org/wiki/Negative_utilitarianism#The_benevolent_world-exploder\"&gt;the benevolent world-exploder&lt;/a&gt;. If positive utility and negative utility are taken into account, like the &amp;quot;scale from -X to X&amp;quot; I mentioned, it avoids the repugnant conclusion. I will give you a ∆ for that.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You express displeasure, but not an argument.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Fair enough. I acknowledged that &amp;quot;reducing to absurdity&amp;quot; only means &amp;quot;refuting&amp;quot; when all parties agree that the conclusion is absurd. Considering that I lack an explicit ethical basis, all I can really do is try to persuade others of absurdity.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What&amp;#39;s wrong with happiness-super blobs as you call them. What&amp;#39;s wrong with the experience machine? What&amp;#39;s wrong with everyone getting plugged into the Matrix. You state you don&amp;#39;t like them, but what is inherently wrong? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To clarify, I actually do not have as much of a problem with the Matrix or the &amp;quot;experience machine.&amp;quot; My only concern with those is if the people inside are lied to or have no choice to leave, assuming that informed consent is a sound ethical principle.&lt;/p&gt;\n\n&lt;p&gt;The issue I was trying to draw attention to is &lt;em&gt;personal traits&lt;/em&gt;, since people can keep those even if they are in the experience machine or the Matrix. They would still have senses, a body, language, perception in general, and intelligence. The happy neuroblobs would not have any of those things. With that in mind,&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What&amp;#39;s wrong with happiness-super blobs as you call them.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Would you want to be a happy neuroblob if it meant giving up your intelligence, language, senses, perception, and body? We may as well throw &lt;em&gt;individuality&lt;/em&gt; in there as well, since it may be more efficient to create a solid mass of neuroblobbery (that is a technical term) than to mass-produce individual neuroblobs.&lt;/p&gt;\n\n&lt;p&gt;Another part of the neuroblob objection which I really should have mentioned is that a utilitarian AI Overlord would have &lt;strong&gt;no reason to keep any currently existing humans alive, except as slaves&lt;/strong&gt; to ensure that the neuroblob factories are running smoothly. Besides that, humans would only get in the way of neuroblob mass-production.&lt;/p&gt;\n\n&lt;p&gt;Edit: Perhaps more importantly, you have what I consider a legitimate reason to oppose creating a Utilitarian AI Overlord: if it was created, it wouldn&amp;#39;t maximize &lt;em&gt;your&lt;/em&gt; pleasure. It would either kill you or use you as a slave to keep the neuroblob factories running smoothly. Their mass-produced pleasure would outweigh yours a thousandfold.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dga83b4", "score_hidden": false, "stickied": false, "created": 1492255894.0, "created_utc": 1492227094.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dga5mnl", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "electronics12345", "parent_id": "t3_65fjm3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I pretty strongly believe in Utilitarianism - so I appreciate you at least attempting to seriously address the topic. I won't tackle everything but here are a few things. \n\n1) The definition of maximum utility - you correctly identify a key issue are we using average or total. However, you seem to be under the impression that humans must by definition have positive utility? Why must humans have positive utility - what is logically inconsistent about negative utility? The repugnant conclusion is easily avoided when we acknowledge there are physical and psychological states which yield negative utilities. \n\n2) What's wrong with happiness-super blobs as you call them. What's wrong with the experience machine? What's wrong with everyone getting plugged into the Matrix. You state you don't like them, but what is inherently wrong? Personally, I would happily enter the experience machine and never leave. The Holodeck (star trek) is paradise, assuming it stops malfunctioning all the damn time. \n\n3) The tyranny of the majority - firstly I suspect by acknowledging negative utility, this will quickly work itself out. second, if this is not sufficient, what is so wrong with this. If millions of people can get pleasure at the expense of a handful, what is so inherently wrong. You express displeasure, but not an argument. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I pretty strongly believe in Utilitarianism - so I appreciate you at least attempting to seriously address the topic. I won&amp;#39;t tackle everything but here are a few things. &lt;/p&gt;\n\n&lt;p&gt;1) The definition of maximum utility - you correctly identify a key issue are we using average or total. However, you seem to be under the impression that humans must by definition have positive utility? Why must humans have positive utility - what is logically inconsistent about negative utility? The repugnant conclusion is easily avoided when we acknowledge there are physical and psychological states which yield negative utilities. &lt;/p&gt;\n\n&lt;p&gt;2) What&amp;#39;s wrong with happiness-super blobs as you call them. What&amp;#39;s wrong with the experience machine? What&amp;#39;s wrong with everyone getting plugged into the Matrix. You state you don&amp;#39;t like them, but what is inherently wrong? Personally, I would happily enter the experience machine and never leave. The Holodeck (star trek) is paradise, assuming it stops malfunctioning all the damn time. &lt;/p&gt;\n\n&lt;p&gt;3) The tyranny of the majority - firstly I suspect by acknowledging negative utility, this will quickly work itself out. second, if this is not sufficient, what is so wrong with this. If millions of people can get pleasure at the expense of a handful, what is so inherently wrong. You express displeasure, but not an argument. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dga5mnl", "score_hidden": false, "stickied": false, "created": 1492252237.0, "created_utc": 1492223437.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0znp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "e105", "parent_id": "t1_dgbu74m", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "(Had to split my thoughts over two posts due to length constraints. This one is about the definition. The next holds the arguments)\n\n&gt;if most people would reject it, then it is absurd given social constructionism\n\nAt this point, your definition of absurdity is essentially identical to asking whether utilitarianism is a good/acceptable ethical theory, meaning we've collapsed untenable and absurd into essentially the same concept. This is fine, after all an awful theory which is deeply unintuitive is indeed an absurd one to hold. Before I go on, just a few changes I'll make to your definition of absurdity.\n\n1. most people --&gt; people with the moral intuitions of citizens of a western liberal democracy\n2 most people --&gt; most rational people\n\nThe rational for 1 is that moral intuitions vary drastically between people, nations and cultures. Hence, if we're looking at all possible people then  \n1. I don't know how most people think so don't know what is persuasive to them  \n2. People have very different moral intuitions/first premises(i.e: In the 1950's, most whites in the southern USA found racism acceptable) meaning that if we're looking at all people it may well be the case that there are fundamental differences between us such that no one ethical theory can be acceptable to the majority of humanity.\n\nHence, my working definition: \"Utilitarianism is absurd/untenable if a rational person with a defensible presumption in favour of a moderate liberal position on most ethical issues would not accept it\"  \nOr, in a bit more detail, I'll be using this definition from [trolley problem](http://trolleyproblem.blogspot.co.uk/2012/11/what-does-good-judge-believe.html):\n&gt;Judges should have a defensible presumption in favour of a moderate liberal position on most ethical issues.  I use \"liberal\", not in the sense meaning \"left-wing\", but rather &gt;in the sense that would describe most intelligent university-educated people in the countries that we call \"liberal democracies\".  By \"defensible\", I mean that the presumption &gt;could in principle be overcome by a persuasive argument, and that the judge should listen to such arguments with an open mind.\n&gt;\n&gt;What does such a moderate liberal judge believe?  Here's a sketch: That judge has a strong belief in the importance of certain kinds of human goods - freedom, happiness, &gt;life, etc - though not a full theory about how trade-offs between these goods should be made, or a precise conception of what the good life is.  That judge has a moderate &gt;presumption in favour of democracy, free speech,  and equal treatment.  That judge holds a defensible belief in Mill's harm principle; that is, insofar as an action affects just &gt;the actor, the judge has a presumption against government action.  That judge believes that important moral questions should be resolved by reasoned deliberation, not &gt;appeals to unquestionable divine authority. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(Had to split my thoughts over two posts due to length constraints. This one is about the definition. The next holds the arguments)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;if most people would reject it, then it is absurd given social constructionism&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;At this point, your definition of absurdity is essentially identical to asking whether utilitarianism is a good/acceptable ethical theory, meaning we&amp;#39;ve collapsed untenable and absurd into essentially the same concept. This is fine, after all an awful theory which is deeply unintuitive is indeed an absurd one to hold. Before I go on, just a few changes I&amp;#39;ll make to your definition of absurdity.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;most people --&amp;gt; people with the moral intuitions of citizens of a western liberal democracy\n2 most people --&amp;gt; most rational people&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;The rational for 1 is that moral intuitions vary drastically between people, nations and cultures. Hence, if we&amp;#39;re looking at all possible people then&lt;br/&gt;\n1. I don&amp;#39;t know how most people think so don&amp;#39;t know what is persuasive to them&lt;br/&gt;\n2. People have very different moral intuitions/first premises(i.e: In the 1950&amp;#39;s, most whites in the southern USA found racism acceptable) meaning that if we&amp;#39;re looking at all people it may well be the case that there are fundamental differences between us such that no one ethical theory can be acceptable to the majority of humanity.&lt;/p&gt;\n\n&lt;p&gt;Hence, my working definition: &amp;quot;Utilitarianism is absurd/untenable if a rational person with a defensible presumption in favour of a moderate liberal position on most ethical issues would not accept it&amp;quot;&lt;br/&gt;\nOr, in a bit more detail, I&amp;#39;ll be using this definition from &lt;a href=\"http://trolleyproblem.blogspot.co.uk/2012/11/what-does-good-judge-believe.html\"&gt;trolley problem&lt;/a&gt;:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Judges should have a defensible presumption in favour of a moderate liberal position on most ethical issues.  I use &amp;quot;liberal&amp;quot;, not in the sense meaning &amp;quot;left-wing&amp;quot;, but rather &amp;gt;in the sense that would describe most intelligent university-educated people in the countries that we call &amp;quot;liberal democracies&amp;quot;.  By &amp;quot;defensible&amp;quot;, I mean that the presumption &amp;gt;could in principle be overcome by a persuasive argument, and that the judge should listen to such arguments with an open mind.&lt;/p&gt;\n\n&lt;p&gt;What does such a moderate liberal judge believe?  Here&amp;#39;s a sketch: That judge has a strong belief in the importance of certain kinds of human goods - freedom, happiness, &amp;gt;life, etc - though not a full theory about how trade-offs between these goods should be made, or a precise conception of what the good life is.  That judge has a moderate &amp;gt;presumption in favour of democracy, free speech,  and equal treatment.  That judge holds a defensible belief in Mill&amp;#39;s harm principle; that is, insofar as an action affects just &amp;gt;the actor, the judge has a presumption against government action.  That judge believes that important moral questions should be resolved by reasoned deliberation, not &amp;gt;appeals to unquestionable divine authority. &lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgd0znp", "score_hidden": true, "stickied": false, "created": 1492427563.0, "created_utc": 1492398763.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbu74m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dgbl8uc", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I appreciate your focus on definitions. \n\n&gt;If a system is untenable at the point at which it is unintuitive in some of the situations it covers, then every system of ethics is untenable as every system of ethics gives rise to a number of such cases.\n\nThat is true. I will revise my definition, if that is acceptable: In addition to yours...\n\n&gt;A belief system is untenable at the point at which it contradicts our beliefs to such an extent in such a vast majority of cases that we would question the sanity of someone who claims to accept it. \n\n...I would also argue that an ethical system is untenable if its *goal* has the same effect. So to justify that it is untenable, I will focus on the superfluity of personal traits. The utility monster may be a fringe case, but under classical utilitarianism everyone is obligated to build factories to mass-produce happy brain-matter. No one's concerns matter compared to this venture.\n\n&gt;Many people, including a fair number who have commented on this thread, do accept utilitarianism. Hence it is not absurd. Or maybe it is absurd to some people, but not to others.\n\nThat...is an interesting point. It feels obvious, but I somehow did not consider it. Under a social constructionist view of morality, utilitarianism would not be absurd for utilitarians, by definition...so I guess I can only say that it is absurd for those who reject its consequences. I cannot argue that it is absurd *for everyone*, unless I convinced everyone to abandon utilitarianism using these objections. Still, I would imagine that most people would probably not accept its consequences...hm.\n\nYour reasoning regarding \"absurdity\" feels pretty solid. However, I want to see how you would respond to the argument that if most people would reject it, then it is absurd given social constructionism. If you can do that and show that my revised definition of \"untenable\" does not work, then I will give you a delta. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I appreciate your focus on definitions. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If a system is untenable at the point at which it is unintuitive in some of the situations it covers, then every system of ethics is untenable as every system of ethics gives rise to a number of such cases.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That is true. I will revise my definition, if that is acceptable: In addition to yours...&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A belief system is untenable at the point at which it contradicts our beliefs to such an extent in such a vast majority of cases that we would question the sanity of someone who claims to accept it. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;...I would also argue that an ethical system is untenable if its &lt;em&gt;goal&lt;/em&gt; has the same effect. So to justify that it is untenable, I will focus on the superfluity of personal traits. The utility monster may be a fringe case, but under classical utilitarianism everyone is obligated to build factories to mass-produce happy brain-matter. No one&amp;#39;s concerns matter compared to this venture.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Many people, including a fair number who have commented on this thread, do accept utilitarianism. Hence it is not absurd. Or maybe it is absurd to some people, but not to others.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That...is an interesting point. It feels obvious, but I somehow did not consider it. Under a social constructionist view of morality, utilitarianism would not be absurd for utilitarians, by definition...so I guess I can only say that it is absurd for those who reject its consequences. I cannot argue that it is absurd &lt;em&gt;for everyone&lt;/em&gt;, unless I convinced everyone to abandon utilitarianism using these objections. Still, I would imagine that most people would probably not accept its consequences...hm.&lt;/p&gt;\n\n&lt;p&gt;Your reasoning regarding &amp;quot;absurdity&amp;quot; feels pretty solid. However, I want to see how you would respond to the argument that if most people would reject it, then it is absurd given social constructionism. If you can do that and show that my revised definition of &amp;quot;untenable&amp;quot; does not work, then I will give you a delta. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbu74m", "score_hidden": false, "stickied": false, "created": 1492358652.0, "created_utc": 1492329852.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbl8uc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "e105", "parent_id": "t1_dgac1y5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Untenable: I'll challenge your definition. \n1-A belief/system is not untenable just because it has edge cases where where it fails/goes against our intuitions. A belief system is untenable at the point at which it contradicts our beliefs to such an extent in such a vast majority of cases that we would question the sanity of someone who claims to accept it. I agree, objections notwithstanding, that in a number of situations utilitarianism is unsatisfactory. Still, it the vast majority of situations it seems to be acceptable and deeply intuitive. A few examples being:\n- Government policy should benefit the greatest number the greatest amount\n- Given the choice of using $10 on drugs which save 1 person, or $10 on a manicure, I should choose the former.\n- Safety regulations, i.e:compulsory seatbelts, are good if the annoyance/discomfort they cause is less than the pain/disconfort they prevent/lives they save.\n2- If a system is untenable at the point at which it is unintuitive in some of the situations it covers, then every system of ethics is untenable as every system of ethics gives rise to a number of such cases. ie:\n- Deontology: You can't kill one person to save the entire human race from extinction. You can't lie if the Nazi's ask you whether Jews are hiding in your basement.\n- Contract theory: Smart, manipulative people can make de-facto slaves of those who are desperate/less intelligent.\n- Christian/Sharia/Halakha/other divine law systems: Most religious texts advocate acts we find morally abhorrent in at least some cases. I.e: slavery, genocide, sexism, severe discrimination against non-believers, etc...\nAt that point, the definition is no longer meaningful or even useful and should be rejected.\n\nAbsurd: \"Highly unlikely to be accepted by most people as moral\"\n1: I think this definition is fairly similar to your definition of untenable as presumably a moral system which \"feels intuitively unethical to people\" is one they would not accept as moral. Hence my arguments above also apply here.\n2: Many people, including a fair number who have commented on this thread, do accept utilitarianism. Hence it is not absurd. Or maybe it is absurd to some people, but not to others.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Untenable: I&amp;#39;ll challenge your definition. \n1-A belief/system is not untenable just because it has edge cases where where it fails/goes against our intuitions. A belief system is untenable at the point at which it contradicts our beliefs to such an extent in such a vast majority of cases that we would question the sanity of someone who claims to accept it. I agree, objections notwithstanding, that in a number of situations utilitarianism is unsatisfactory. Still, it the vast majority of situations it seems to be acceptable and deeply intuitive. A few examples being:\n- Government policy should benefit the greatest number the greatest amount\n- Given the choice of using $10 on drugs which save 1 person, or $10 on a manicure, I should choose the former.\n- Safety regulations, i.e:compulsory seatbelts, are good if the annoyance/discomfort they cause is less than the pain/disconfort they prevent/lives they save.\n2- If a system is untenable at the point at which it is unintuitive in some of the situations it covers, then every system of ethics is untenable as every system of ethics gives rise to a number of such cases. ie:\n- Deontology: You can&amp;#39;t kill one person to save the entire human race from extinction. You can&amp;#39;t lie if the Nazi&amp;#39;s ask you whether Jews are hiding in your basement.\n- Contract theory: Smart, manipulative people can make de-facto slaves of those who are desperate/less intelligent.\n- Christian/Sharia/Halakha/other divine law systems: Most religious texts advocate acts we find morally abhorrent in at least some cases. I.e: slavery, genocide, sexism, severe discrimination against non-believers, etc...\nAt that point, the definition is no longer meaningful or even useful and should be rejected.&lt;/p&gt;\n\n&lt;p&gt;Absurd: &amp;quot;Highly unlikely to be accepted by most people as moral&amp;quot;\n1: I think this definition is fairly similar to your definition of untenable as presumably a moral system which &amp;quot;feels intuitively unethical to people&amp;quot; is one they would not accept as moral. Hence my arguments above also apply here.\n2: Many people, including a fair number who have commented on this thread, do accept utilitarianism. Hence it is not absurd. Or maybe it is absurd to some people, but not to others.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbl8uc", "score_hidden": false, "stickied": false, "created": 1492340535.0, "created_utc": 1492311735.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgac1y5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dgaaes2", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;The former is an isolated intuition applicable to some situations. The latter is a collection of intuitions and rules for resolving conflicts between them that covers, or claims to cost, the totality of moral decision-making.\n\nHuh. Good point.\n\n&gt;Unless you have a moral system superior to utilitarianism to fall back on, I.e: deontology/virtue ethics, I'd still be inclined to argue that utilitarianism is not a bad system. Flawed certainly, but not bad or untenable. As for absurdity, maybe. It mostly comes down to what definition of absurdity we choose.\n\nYou are right that \"bad\" does presuppose some kind of ethical system to define what \"bad\" is. If you can show that this same reasoning applies to \"untenable\" and/or \"absurd,\" I will go ahead and give you a delta. But for the purposes of this argument, I will define \"untenable\" as \"having no system which can accommodate these examples without feeling intuitively unethical to people,\" and \"absurd\" as \"highly unlikely to be accepted by people as moral.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The former is an isolated intuition applicable to some situations. The latter is a collection of intuitions and rules for resolving conflicts between them that covers, or claims to cost, the totality of moral decision-making.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Huh. Good point.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Unless you have a moral system superior to utilitarianism to fall back on, I.e: deontology/virtue ethics, I&amp;#39;d still be inclined to argue that utilitarianism is not a bad system. Flawed certainly, but not bad or untenable. As for absurdity, maybe. It mostly comes down to what definition of absurdity we choose.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You are right that &amp;quot;bad&amp;quot; does presuppose some kind of ethical system to define what &amp;quot;bad&amp;quot; is. If you can show that this same reasoning applies to &amp;quot;untenable&amp;quot; and/or &amp;quot;absurd,&amp;quot; I will go ahead and give you a delta. But for the purposes of this argument, I will define &amp;quot;untenable&amp;quot; as &amp;quot;having no system which can accommodate these examples without feeling intuitively unethical to people,&amp;quot; and &amp;quot;absurd&amp;quot; as &amp;quot;highly unlikely to be accepted by people as moral.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgac1y5", "score_hidden": false, "stickied": false, "created": 1492262797.0, "created_utc": 1492233997.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaaes2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "e105", "parent_id": "t1_dga8z6g", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think there's a difference between a moral principle, such as respecting a persons (informed) preferences being desirable, and a moral system such as utilitarianism. The former is an isolated intuition applicable to some situations. The latter is a collection of intuitions and rules for resolving conflicts between them that covers, or claims to cost, the totality of moral decision-making.\n\nUnless you have a moral system superior to utilitarianism to fall back on, I.e: deontology/virtue ethics, I'd still be inclined to argue that utilitarianism is not a bad system. Flawed certainly, but not bad or untenable.\n\n\n\n\n\nAs for absurdity, maybe. It mostly comes down to what definition of absurdity we choose.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think there&amp;#39;s a difference between a moral principle, such as respecting a persons (informed) preferences being desirable, and a moral system such as utilitarianism. The former is an isolated intuition applicable to some situations. The latter is a collection of intuitions and rules for resolving conflicts between them that covers, or claims to cost, the totality of moral decision-making.&lt;/p&gt;\n\n&lt;p&gt;Unless you have a moral system superior to utilitarianism to fall back on, I.e: deontology/virtue ethics, I&amp;#39;d still be inclined to argue that utilitarianism is not a bad system. Flawed certainly, but not bad or untenable.&lt;/p&gt;\n\n&lt;p&gt;As for absurdity, maybe. It mostly comes down to what definition of absurdity we choose.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaaes2", "score_hidden": false, "stickied": false, "created": 1492259775.0, "created_utc": 1492230975.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dga8z6g", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dga8onc", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Does this make it it untenable or a bad system? Not unless you have a better alternative ... Bad is comparative.\n\n1. I mentioned the idea of informed consent as a moral principle, so that could count as an alternative. It follows that utilitarianism is bad because its absurd consequences that I described above deprive individuals of their ability to know the truth and choose what they want.\n2. The \"reduce to absurdity\" approach that I am using only requires agreement on all sides, a kind of socially constructed morality. The utilitarian Sam Harris [uses the same approach to justify his version of utilitarianism](http://www.reasonablefaith.org/is-the-foundation-of-morality-natural-or-supernatural-the-craig-harris#section_2) [emphasis added]:\n\n&gt;Here’s the only **assumption** you have to make. Imagine a universe in which every conscious creatures suffers as much as it possibly can, for as long as it can. I call this “the worst possible misery for everyone” ... **if the word “bad” applies anywhere**, it applies here ... if we ought to do anything, if we have a moral duty to do anything, it’s to avoid the worst possible misery for everyone. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Does this make it it untenable or a bad system? Not unless you have a better alternative ... Bad is comparative.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;ol&gt;\n&lt;li&gt;I mentioned the idea of informed consent as a moral principle, so that could count as an alternative. It follows that utilitarianism is bad because its absurd consequences that I described above deprive individuals of their ability to know the truth and choose what they want.&lt;/li&gt;\n&lt;li&gt;The &amp;quot;reduce to absurdity&amp;quot; approach that I am using only requires agreement on all sides, a kind of socially constructed morality. The utilitarian Sam Harris &lt;a href=\"http://www.reasonablefaith.org/is-the-foundation-of-morality-natural-or-supernatural-the-craig-harris#section_2\"&gt;uses the same approach to justify his version of utilitarianism&lt;/a&gt; [emphasis added]:&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Here’s the only &lt;strong&gt;assumption&lt;/strong&gt; you have to make. Imagine a universe in which every conscious creatures suffers as much as it possibly can, for as long as it can. I call this “the worst possible misery for everyone” ... &lt;strong&gt;if the word “bad” applies anywhere&lt;/strong&gt;, it applies here ... if we ought to do anything, if we have a moral duty to do anything, it’s to avoid the worst possible misery for everyone. &lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dga8z6g", "score_hidden": false, "stickied": false, "created": 1492257329.0, "created_utc": 1492228529.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dga8onc", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "e105", "parent_id": "t3_65fjm3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Is classical Utilitarianism absurd? Maybe.\n\nIs it flawed? Does it lead to outcomes at odds with our moral intuition? Undeniably so. The same is true of every other ethical system I know if.\n\nDoes this make it it untenable or a bad system? Not unless you have a better alternative.\n\nAll current ethical Systems are seriously flawed in a variety of ways and a definition of \"tenable\" that utilitarianism does not meet is probably a definition which no existing system meets.\n\nTLDR: yes it's flawed but that didn't make it bad. Bad is comparative.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is classical Utilitarianism absurd? Maybe.&lt;/p&gt;\n\n&lt;p&gt;Is it flawed? Does it lead to outcomes at odds with our moral intuition? Undeniably so. The same is true of every other ethical system I know if.&lt;/p&gt;\n\n&lt;p&gt;Does this make it it untenable or a bad system? Not unless you have a better alternative.&lt;/p&gt;\n\n&lt;p&gt;All current ethical Systems are seriously flawed in a variety of ways and a definition of &amp;quot;tenable&amp;quot; that utilitarianism does not meet is probably a definition which no existing system meets.&lt;/p&gt;\n\n&lt;p&gt;TLDR: yes it&amp;#39;s flawed but that didn&amp;#39;t make it bad. Bad is comparative.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dga8onc", "score_hidden": false, "stickied": false, "created": 1492256856.0, "created_utc": 1492228056.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": "", "user_reports": [], "id": "dga8sf6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PsychoPhilosopher", "parent_id": "t1_dga77qv", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; That would count as \"biting the bullet.\" The reason that it would be considered an \"objection\" is not only that it is intuitively uncomfy for some, but that it can be avoided by the idea of specific human rights.\n\nAbsolutely.  But human rights are a form of deontology, and have their own issues.  For utilitarians the discomfort associated with the Tyranny of the majority is acceptable, provided it does in fact increase the flourishing of that majority. \n\nI'm actually arguing that virtuism and utilitarianism are not distinct entities, so yes, I'd argue that Plato (in particular The Republic) is 'utilitarian-ish'.  \n\nFor the organ donor example we can say:\n\nStealing organs might increase *happiness* but would be \"cruel\".  Which is not 'good' according to a virtuist.  So it might increase 'happiness' but would not increase 'flourishing'.  \n\nThis gets messy of course, because virtue is hard to define.  We can go through a few pathways to get our virtues, from deontologies to relativism to different consequentalist systems.  Basically the way I would describe it is as a complex interaction between multiple moral philosophies, each of which describes only a portion of the whole reality (3 blind men and an elephant).\n\nFor the Bentham vs. Mill argument I'll tap out and just say that it's actually more important to look at the modern view than the historical one.\n\nRedditors are often utilitarian, but they don't generally trend towards the view you've described IMO.  I'm supposed to be working, and I'm getting the impression you're pretty clever so I'll just say \"Liberty is a good distinct from happiness\" and let you think through the connections etc. rather than typing it all out if that's OK?\n\nI actually thought you'd have more fun with the 'neuroblobs' and ask about what would happen if a superior *eudaimonic* being were to be discovered!", "edited": 1492235306.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;That would count as &amp;quot;biting the bullet.&amp;quot; The reason that it would be considered an &amp;quot;objection&amp;quot; is not only that it is intuitively uncomfy for some, but that it can be avoided by the idea of specific human rights.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Absolutely.  But human rights are a form of deontology, and have their own issues.  For utilitarians the discomfort associated with the Tyranny of the majority is acceptable, provided it does in fact increase the flourishing of that majority. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m actually arguing that virtuism and utilitarianism are not distinct entities, so yes, I&amp;#39;d argue that Plato (in particular The Republic) is &amp;#39;utilitarian-ish&amp;#39;.  &lt;/p&gt;\n\n&lt;p&gt;For the organ donor example we can say:&lt;/p&gt;\n\n&lt;p&gt;Stealing organs might increase &lt;em&gt;happiness&lt;/em&gt; but would be &amp;quot;cruel&amp;quot;.  Which is not &amp;#39;good&amp;#39; according to a virtuist.  So it might increase &amp;#39;happiness&amp;#39; but would not increase &amp;#39;flourishing&amp;#39;.  &lt;/p&gt;\n\n&lt;p&gt;This gets messy of course, because virtue is hard to define.  We can go through a few pathways to get our virtues, from deontologies to relativism to different consequentalist systems.  Basically the way I would describe it is as a complex interaction between multiple moral philosophies, each of which describes only a portion of the whole reality (3 blind men and an elephant).&lt;/p&gt;\n\n&lt;p&gt;For the Bentham vs. Mill argument I&amp;#39;ll tap out and just say that it&amp;#39;s actually more important to look at the modern view than the historical one.&lt;/p&gt;\n\n&lt;p&gt;Redditors are often utilitarian, but they don&amp;#39;t generally trend towards the view you&amp;#39;ve described IMO.  I&amp;#39;m supposed to be working, and I&amp;#39;m getting the impression you&amp;#39;re pretty clever so I&amp;#39;ll just say &amp;quot;Liberty is a good distinct from happiness&amp;quot; and let you think through the connections etc. rather than typing it all out if that&amp;#39;s OK?&lt;/p&gt;\n\n&lt;p&gt;I actually thought you&amp;#39;d have more fun with the &amp;#39;neuroblobs&amp;#39; and ask about what would happen if a superior &lt;em&gt;eudaimonic&lt;/em&gt; being were to be discovered!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dga8sf6", "score_hidden": false, "stickied": false, "created": 1492257025.0, "created_utc": 1492228225.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": "", "user_reports": [], "id": "dga7923", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dga77qv", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/PsychoPhilosopher ([1∆](/r/changemyview/wiki/user/PsychoPhilosopher)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"PsychoPhilosopher\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/PsychoPhilosopher\"&gt;/u/PsychoPhilosopher&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/PsychoPhilosopher\"&gt;1∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22PsychoPhilosopher%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dga7923", "score_hidden": false, "stickied": false, "created": 1492254583.0, "created_utc": 1492225783.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga77qv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dga31du", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You are correct that objections (1), (2), and (4) require reductionism: if the happiness of a group can be greater than the total or average happiness of its members, then they must be measured at the group level, and therefore those three objections do not apply to the resulting ethical theory. Any approach to utilitarianism that 1, considers pleasure and happiness to be basically equivalent, and 2, is reductionistic, still falls prety to the objections on this account. However, you are correct that it can be avoided by defining classical utilitarianism without those tenets. Have a ∆.\n\n&gt;Tyranny of the majority is somewhat continued, since the flourishing of the many is superior to the flourishing of the few. Plato's 'Republic' is to some extent utilitarian, and it encourages slavery... so there's that... But the idea of the tyranny of the majority is more or less inherent to utilitarianism. If you are unable to accept the idea that a few should suffer for the sake of the many you simply aren't intuitively aligned to utilitarianism. Therefore it's less of an objection than you might think. The rejection of the problematic component here is central to utilitarian views.\n\nThat would count as \"biting the bullet.\" The reason that it would be considered an \"objection\" is not only that it is intuitively uncomfy for some, but that it can be avoided by the idea of specific human rights. For example, the reason that \"tyranny of the majority\" is not a good objection to abolishing the U.S. electoral college is that the United States has human rights which prevent the majority from oppressing minority groups - e.g. murdering minorities is illegal because every person has the right to not be murdered.\n\nWould you think that the \"organ donor\" situation is morally acceptable, without using the \"it would actually decrease happiness\" dodge that I addressed?\n\n&gt;a more accurate reading of classical utilitarian views is more aligned with the Aristotelian concept than the modern 'happiness'.\n\nJeremy Bentham, considered to be the founder of classical utilitarianism, [\"held that there were no qualitative differences between pleasures, only quantitative ones.\"](https://plato.stanford.edu/entries/utilitarianism-history/#JohStuMil). John Stuart Mill, the other \"founder\" of the classical approach, did disagree - but he came later and his approach was an alternative to Bentham's view. His reinterpretation of Bentham's view changed happiness to eudaimonia, not the other way around. Still, Mill's view does count as classical, so I was wrong to imply that \"classical utilitarianism\" is synonymous with \"maximize pleasure when all pleasures are held to be synonymous.\"\n\nI do have a question about the view you described, of maximizing societal flourishing rather than the total or average of individual happiness within a society:\n\n&gt;replacing a one-dimensional 'good' with a multi-dimensional virtuist approach makes the whole thing a lot easier to understand.\n\nDoes this even count as utilitarian? I thought that a view had to at least say \"Maximize some quantitative variable X because X is synonymous with good\" to be utilitarian. And the \"greatest happiness *of the greatest number*\" seems to presuppose reductionism by measuing happiness at an individual rather than societal level. If one measures happiness otherwise, would it instead count as a form of Aristotelian virtue theory? Or are you rather describing a \"virtuist approach\" to utilitarianism? You used Plato and Aristotle as examples, but I thought that their ethics were closer to virtue theory than utilitarianism - assuming that the two are distinct.", "edited": 1492227515.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are correct that objections (1), (2), and (4) require reductionism: if the happiness of a group can be greater than the total or average happiness of its members, then they must be measured at the group level, and therefore those three objections do not apply to the resulting ethical theory. Any approach to utilitarianism that 1, considers pleasure and happiness to be basically equivalent, and 2, is reductionistic, still falls prety to the objections on this account. However, you are correct that it can be avoided by defining classical utilitarianism without those tenets. Have a ∆.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Tyranny of the majority is somewhat continued, since the flourishing of the many is superior to the flourishing of the few. Plato&amp;#39;s &amp;#39;Republic&amp;#39; is to some extent utilitarian, and it encourages slavery... so there&amp;#39;s that... But the idea of the tyranny of the majority is more or less inherent to utilitarianism. If you are unable to accept the idea that a few should suffer for the sake of the many you simply aren&amp;#39;t intuitively aligned to utilitarianism. Therefore it&amp;#39;s less of an objection than you might think. The rejection of the problematic component here is central to utilitarian views.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That would count as &amp;quot;biting the bullet.&amp;quot; The reason that it would be considered an &amp;quot;objection&amp;quot; is not only that it is intuitively uncomfy for some, but that it can be avoided by the idea of specific human rights. For example, the reason that &amp;quot;tyranny of the majority&amp;quot; is not a good objection to abolishing the U.S. electoral college is that the United States has human rights which prevent the majority from oppressing minority groups - e.g. murdering minorities is illegal because every person has the right to not be murdered.&lt;/p&gt;\n\n&lt;p&gt;Would you think that the &amp;quot;organ donor&amp;quot; situation is morally acceptable, without using the &amp;quot;it would actually decrease happiness&amp;quot; dodge that I addressed?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;a more accurate reading of classical utilitarian views is more aligned with the Aristotelian concept than the modern &amp;#39;happiness&amp;#39;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Jeremy Bentham, considered to be the founder of classical utilitarianism, &lt;a href=\"https://plato.stanford.edu/entries/utilitarianism-history/#JohStuMil\"&gt;&amp;quot;held that there were no qualitative differences between pleasures, only quantitative ones.&amp;quot;&lt;/a&gt;. John Stuart Mill, the other &amp;quot;founder&amp;quot; of the classical approach, did disagree - but he came later and his approach was an alternative to Bentham&amp;#39;s view. His reinterpretation of Bentham&amp;#39;s view changed happiness to eudaimonia, not the other way around. Still, Mill&amp;#39;s view does count as classical, so I was wrong to imply that &amp;quot;classical utilitarianism&amp;quot; is synonymous with &amp;quot;maximize pleasure when all pleasures are held to be synonymous.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I do have a question about the view you described, of maximizing societal flourishing rather than the total or average of individual happiness within a society:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;replacing a one-dimensional &amp;#39;good&amp;#39; with a multi-dimensional virtuist approach makes the whole thing a lot easier to understand.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Does this even count as utilitarian? I thought that a view had to at least say &amp;quot;Maximize some quantitative variable X because X is synonymous with good&amp;quot; to be utilitarian. And the &amp;quot;greatest happiness &lt;em&gt;of the greatest number&lt;/em&gt;&amp;quot; seems to presuppose reductionism by measuing happiness at an individual rather than societal level. If one measures happiness otherwise, would it instead count as a form of Aristotelian virtue theory? Or are you rather describing a &amp;quot;virtuist approach&amp;quot; to utilitarianism? You used Plato and Aristotle as examples, but I thought that their ethics were closer to virtue theory than utilitarianism - assuming that the two are distinct.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dga77qv", "score_hidden": false, "stickied": false, "created": 1492254527.0, "created_utc": 1492225727.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga31du", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "PsychoPhilosopher", "parent_id": "t3_65fjm3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Replace 'happiness' with 'eudaimonia'.  The *modern reinterpretation* of utilitarianism translates 'happiness' but a more accurate reading of classical utilitarian views is more aligned with the Aristotelian concept than the modern 'happiness'.\n\nInstead of increasing an internal state of individuals, increase the 'flourishing' of a) the individuals within the society and b) the society as a whole.\n\nIt's borderline facile, but replacing a one-dimensional 'good' with a multi-dimensional virtuist approach makes the whole thing a lot easier to understand.\n\nIt also maps better to the intuitions.\n\nThe utility monster is doomed right from the outset.  It can't possibly 'flourish' more than everyone else, even if it does have a greater capacity for happiness.\n\nThe average/total problem completely falls apart under the idea of *societal* flourishing.\n\nTyranny of the majority is somewhat continued, since the flourishing of the many is superior to the flourishing of the few.  Plato's 'Republic' is to some extent utilitarian, and it encourages slavery... so there's that... But the idea of the tyranny of the majority is more or less inherent to utilitarianism.  If you are unable to accept the idea that a few should suffer for the sake of the many you simply aren't intuitively aligned to utilitarianism.  Therefore it's less of an objection than you might think.  The rejection of the problematic component here is central to utilitarian views.\n\nThe happy neuroblobs of course flops in the face of the change.  Under a eudaimonic view the neuroblob may be 'happy' but it lacks any other virtues, making it inferior to a human.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Replace &amp;#39;happiness&amp;#39; with &amp;#39;eudaimonia&amp;#39;.  The &lt;em&gt;modern reinterpretation&lt;/em&gt; of utilitarianism translates &amp;#39;happiness&amp;#39; but a more accurate reading of classical utilitarian views is more aligned with the Aristotelian concept than the modern &amp;#39;happiness&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;Instead of increasing an internal state of individuals, increase the &amp;#39;flourishing&amp;#39; of a) the individuals within the society and b) the society as a whole.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s borderline facile, but replacing a one-dimensional &amp;#39;good&amp;#39; with a multi-dimensional virtuist approach makes the whole thing a lot easier to understand.&lt;/p&gt;\n\n&lt;p&gt;It also maps better to the intuitions.&lt;/p&gt;\n\n&lt;p&gt;The utility monster is doomed right from the outset.  It can&amp;#39;t possibly &amp;#39;flourish&amp;#39; more than everyone else, even if it does have a greater capacity for happiness.&lt;/p&gt;\n\n&lt;p&gt;The average/total problem completely falls apart under the idea of &lt;em&gt;societal&lt;/em&gt; flourishing.&lt;/p&gt;\n\n&lt;p&gt;Tyranny of the majority is somewhat continued, since the flourishing of the many is superior to the flourishing of the few.  Plato&amp;#39;s &amp;#39;Republic&amp;#39; is to some extent utilitarian, and it encourages slavery... so there&amp;#39;s that... But the idea of the tyranny of the majority is more or less inherent to utilitarianism.  If you are unable to accept the idea that a few should suffer for the sake of the many you simply aren&amp;#39;t intuitively aligned to utilitarianism.  Therefore it&amp;#39;s less of an objection than you might think.  The rejection of the problematic component here is central to utilitarian views.&lt;/p&gt;\n\n&lt;p&gt;The happy neuroblobs of course flops in the face of the change.  Under a eudaimonic view the neuroblob may be &amp;#39;happy&amp;#39; but it lacks any other virtues, making it inferior to a human.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dga31du", "score_hidden": false, "stickied": false, "created": 1492248568.0, "created_utc": 1492219768.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": "", "user_reports": [], "id": "dgc5f9b", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Bobby_Cement", "parent_id": "t1_dgbsyin", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;...should I change the formatting?\n\nnonono, I just meant that I have a hard time reading longer articles on my computer screen, so I always move anything over (say) 2000 words to my kindle. \n\n&gt;because it is from Dennett, it is also pretty funny.\n\nHah, it sounds like there's some juice here. I don't know particularly much about philosophy or philosophers. Does Dennett have a reputation I would enjoy learning about?\n\n&gt;Regardless, what's inherently wrong with chopping people up for a Utilitarian AI Overlord?\n\nNothing is *inherently* wrong with it; I even admitted as much! But I think you, I, and the AI overlord all agree that organ theft is *relatively* wrong provided the availability of  alternatives such as cheap and effective artificial organs. And if we have a benevolent AI overlord, I'm sure such alternatives would be available. This was my point in saying that the example approached self-contradiction. \n\n&gt;More specifically, arguing from analogy is a logical fallacy when dissimilar elements between the analogy and its referent affect the conclusion. One relevant difference in this case is that conscription does not guarantee immediate death, whereas having one's organs stolen does.\n\nIn principle, I agree with your point about analogies. It's tricky, because I think we all realize how useful they are as a thinking tool, but they are always open to the charge of relying on dissimilar elements, as you say. Is the solution just to list all the apparently dissimilar elements and address them one by one? If we're doing that for the conscription analogy, I might respond that the actions of a) going to the utilitarian doctor and b) being conscripted into the military both carry some risk of death. The proper analog of having one's organs stolen is not b), but c): being blown up by a bomb during combat. But we probably don't want to go down this path, because you could easily come up with a different point of dissimilarity and our discussion will never end. Maybe the lesson is that analogies are a useful tool for thinking, but not a useful tool for argument? \n\n&gt;I do think that classical utilitarianism is too often accepted uncritically.\n\nAs soon as I saw your post, I was curious about why you were focusing on classical utilitarianism. I take it that you would not count preference utilitarianism or negative utilitarianism as classical. Do utilitarians on reddit really tend  to be of the plain-vanilla variety? I figured that everyone moves on from that view as soon as they hear the wireheading counterexample (thanks for the wireheading link by the way!). The utilitarianism that I want to defend---though I know I ultimately cannot succeed--- would be something like a mix of the negative and preference varieties. For example, the benevolent world exploder wouldn't have a leg to stand on under such a theory. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;...should I change the formatting?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;nonono, I just meant that I have a hard time reading longer articles on my computer screen, so I always move anything over (say) 2000 words to my kindle. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;because it is from Dennett, it is also pretty funny.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Hah, it sounds like there&amp;#39;s some juice here. I don&amp;#39;t know particularly much about philosophy or philosophers. Does Dennett have a reputation I would enjoy learning about?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Regardless, what&amp;#39;s inherently wrong with chopping people up for a Utilitarian AI Overlord?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Nothing is &lt;em&gt;inherently&lt;/em&gt; wrong with it; I even admitted as much! But I think you, I, and the AI overlord all agree that organ theft is &lt;em&gt;relatively&lt;/em&gt; wrong provided the availability of  alternatives such as cheap and effective artificial organs. And if we have a benevolent AI overlord, I&amp;#39;m sure such alternatives would be available. This was my point in saying that the example approached self-contradiction. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;More specifically, arguing from analogy is a logical fallacy when dissimilar elements between the analogy and its referent affect the conclusion. One relevant difference in this case is that conscription does not guarantee immediate death, whereas having one&amp;#39;s organs stolen does.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In principle, I agree with your point about analogies. It&amp;#39;s tricky, because I think we all realize how useful they are as a thinking tool, but they are always open to the charge of relying on dissimilar elements, as you say. Is the solution just to list all the apparently dissimilar elements and address them one by one? If we&amp;#39;re doing that for the conscription analogy, I might respond that the actions of a) going to the utilitarian doctor and b) being conscripted into the military both carry some risk of death. The proper analog of having one&amp;#39;s organs stolen is not b), but c): being blown up by a bomb during combat. But we probably don&amp;#39;t want to go down this path, because you could easily come up with a different point of dissimilarity and our discussion will never end. Maybe the lesson is that analogies are a useful tool for thinking, but not a useful tool for argument? &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I do think that classical utilitarianism is too often accepted uncritically.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As soon as I saw your post, I was curious about why you were focusing on classical utilitarianism. I take it that you would not count preference utilitarianism or negative utilitarianism as classical. Do utilitarians on reddit really tend  to be of the plain-vanilla variety? I figured that everyone moves on from that view as soon as they hear the wireheading counterexample (thanks for the wireheading link by the way!). The utilitarianism that I want to defend---though I know I ultimately cannot succeed--- would be something like a mix of the negative and preference varieties. For example, the benevolent world exploder wouldn&amp;#39;t have a leg to stand on under such a theory. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgc5f9b", "score_hidden": false, "stickied": false, "created": 1492385352.0, "created_utc": 1492356552.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbsyin", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dgbis22", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Hey, thank you for the thorough response! I did not actually expect someone to agree with me across the board here or to \"teach\" people things, so that is a pleasant surprise. \n\n&gt;never before have I been forced to transfer a Reddit post to my kindle so I could get through it!\n\nOh. [Another commenter](https://www.reddit.com/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/dgajuo5) mentioned that too, sorry about that....should I change the formatting? As in, simplify it by removing the bullets and numbers and quotes and such?\n\n&gt;A quick reply here is that our current world features a perfectly realistic analog to this practice: military conscription. When drafted, a soldier is forced to take on a chance of dying for the greater good of his countrymen, much like the patient of the utilitarian doctor. This comparison also hints that, if the utilitarians really contrived to make forced organ transplants a reality, the end result would look more like honorable sacrifice than like psycho-killer victimization.\n\nFirst of all, I do not support conscription. More importantly, I will reiterate how I feel about analogies from [another comment](https://www.reddit.com/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/dgacsn8):\n\n&gt;Arguing from analogy is like building a bridge out of straw: the further you extend it, the easier it is to break. \n\nMore specifically, [arguing from analogy is a logical fallacy](https://www.logicallyfallacious.com/tools/lp/Bo/LogicalFallacies/181/Weak_Analogy) when dissimilar elements between the analogy and its referent affect the conclusion. One relevant difference in this case is that conscription does not guarantee immediate death, whereas having one's organs stolen does.\n\n&gt;In this connection, I want to mention Dennett's \"Philosophers' Syndrome\": mistaking a failure of the imagination for an insight into necessity (though, reflecting my own uncertainty, I would want to use a word far less loaded than \"failure\").\n\nThat is a pretty interesting point. And, because it is from Dennett, it is also pretty funny. Still, I think it cuts both ways -- especially considering that some other commenters have argued that the thought experiments I brought up do not count because they have not happened in reality. In that case, I would agree that a failure of the imagination is not an insight into necessity.\n\n&gt;In short, S looks less like a human doctor and more like the medical workings of a benevolent superintelligence.\n\nExactly. I brought up that concept in my original post, and the \"organ transplant scenario\" objection is compatible with it: I would not want a Utilitarian AI Overlord to forcibly take the organs of a random person to save five others.\n\n&gt;To me, the failure of imagination is thus \"fixed\": my intuitive revulsion at S's machinations has dissolved. It seems that S really knows what he's doing, and I would be a fool to stand in his way (however impotently that might be).\n\nI would disagree. Even if *S* knows what it is doing, I would not blame anyone for standing in *S*'s way if it tried to steal their organs.\n\n&gt;Do your intuitions change similarly?\n\nNot really. Sorry.\n\n&gt;As I understand your argument, it does not matter that no real doctor would be able to sneak---completely undetected--- a patients' organs into the bodies of several others ... I think the mistake comes from asserting that the doctor has infallible superhuman abilities, \n\nThat's not necessary. We could instead imagine a situation where people simply do not *care* about others, like if the AI Overlord hooks everyone up to [pleasure devices](http://wireheading.com) or [Nozick's experience machine](https://en.wikipedia.org/wiki/Experience_machine) - or if everyone is a purist utilitarian who would find sudden sacrifice acceptable as you described.\n\n&gt;Perhaps the point is now moot: S would surely have better ways of helping people than unexpectedly chopping them up! \n\nMaybe this is a nitpick, but you are using the term \"people\" equivocally here: *S* helps some people by chopping up others, or helps People in general by chopping up some people specifically. Regardless, what's inherently wrong with chopping people up for a Utilitarian AI Overlord? It is a tool. Maybe the Overlord would only chop up sad people. But then again, this line of reasoning just folds into the neuroblob factory objection.\n\n&gt;I'm having a hard time letting it go. Your post has encouraged me to keep trying to defend the moral system---thanks for that!\n\n*CURSES, MY PLAN HAS BACKFIRED!*\n\n...but more seriously, I do think that classical utilitarianism is too often accepted uncritically. I have sometimes noticed an attitude of \"if not theism, then classical utilitarianism,\" which I consider problematic. And it sounds like I was in a similar situation to you before I really understood the objections.\n\nEdit: I almost forgot to mention the real reason that I wanted to ignore practical considerations: there are several objections to utilitarianism based on its impracticality. But if practicality cannot be ignored, then I will add the following to my list of objections:\n\n- [The paradox of hedonism](https://en.wikipedia.org/wiki/Paradox_of_hedonism): Trying to chase happiness is not a good way to make people happy, so we should not focus on happiness.\n- The impossibility of prediction: We cannot predict the future accurately, so it is fruitless to judge actions based on their consequences. Utilitarianism deals in terms of possible futures, but other ethical systems (i.e. deontological systems, existentialism) deal in terms of certain aspects of the present.\n- The difficulty of measurement and definition: How are we going to measure peoples' happiness? Will we force everyone to wear brain-scanning devices? What happens\n- Dealing with dissidents: How would we force everyone to go along with utilitarianism when many, if not most, people would reject it? Kantianism and existentialism, for example, can accomodate people who disagree with them - but what would a utilitarian do with people who refused to be laid down for the greater good?\n\nIt is entirely plausible that these arguments are all invalid, and I do not expect you to show how -- I am not attempting to [\"Gish gallop\"](http://rationalwiki.org/wiki/Gish_gallop) you by overwhelming you in bad arguments. I consider these arguments outside the scope of this discussion, because they deal with practical considerations *instead of* moral considerations.", "edited": 1492329213.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, thank you for the thorough response! I did not actually expect someone to agree with me across the board here or to &amp;quot;teach&amp;quot; people things, so that is a pleasant surprise. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;never before have I been forced to transfer a Reddit post to my kindle so I could get through it!&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Oh. &lt;a href=\"https://www.reddit.com/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/dgajuo5\"&gt;Another commenter&lt;/a&gt; mentioned that too, sorry about that....should I change the formatting? As in, simplify it by removing the bullets and numbers and quotes and such?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A quick reply here is that our current world features a perfectly realistic analog to this practice: military conscription. When drafted, a soldier is forced to take on a chance of dying for the greater good of his countrymen, much like the patient of the utilitarian doctor. This comparison also hints that, if the utilitarians really contrived to make forced organ transplants a reality, the end result would look more like honorable sacrifice than like psycho-killer victimization.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;First of all, I do not support conscription. More importantly, I will reiterate how I feel about analogies from &lt;a href=\"https://www.reddit.com/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/dgacsn8\"&gt;another comment&lt;/a&gt;:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Arguing from analogy is like building a bridge out of straw: the further you extend it, the easier it is to break. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;More specifically, &lt;a href=\"https://www.logicallyfallacious.com/tools/lp/Bo/LogicalFallacies/181/Weak_Analogy\"&gt;arguing from analogy is a logical fallacy&lt;/a&gt; when dissimilar elements between the analogy and its referent affect the conclusion. One relevant difference in this case is that conscription does not guarantee immediate death, whereas having one&amp;#39;s organs stolen does.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In this connection, I want to mention Dennett&amp;#39;s &amp;quot;Philosophers&amp;#39; Syndrome&amp;quot;: mistaking a failure of the imagination for an insight into necessity (though, reflecting my own uncertainty, I would want to use a word far less loaded than &amp;quot;failure&amp;quot;).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That is a pretty interesting point. And, because it is from Dennett, it is also pretty funny. Still, I think it cuts both ways -- especially considering that some other commenters have argued that the thought experiments I brought up do not count because they have not happened in reality. In that case, I would agree that a failure of the imagination is not an insight into necessity.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In short, S looks less like a human doctor and more like the medical workings of a benevolent superintelligence.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Exactly. I brought up that concept in my original post, and the &amp;quot;organ transplant scenario&amp;quot; objection is compatible with it: I would not want a Utilitarian AI Overlord to forcibly take the organs of a random person to save five others.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;To me, the failure of imagination is thus &amp;quot;fixed&amp;quot;: my intuitive revulsion at S&amp;#39;s machinations has dissolved. It seems that S really knows what he&amp;#39;s doing, and I would be a fool to stand in his way (however impotently that might be).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I would disagree. Even if &lt;em&gt;S&lt;/em&gt; knows what it is doing, I would not blame anyone for standing in &lt;em&gt;S&lt;/em&gt;&amp;#39;s way if it tried to steal their organs.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Do your intuitions change similarly?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not really. Sorry.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As I understand your argument, it does not matter that no real doctor would be able to sneak---completely undetected--- a patients&amp;#39; organs into the bodies of several others ... I think the mistake comes from asserting that the doctor has infallible superhuman abilities, &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s not necessary. We could instead imagine a situation where people simply do not &lt;em&gt;care&lt;/em&gt; about others, like if the AI Overlord hooks everyone up to &lt;a href=\"http://wireheading.com\"&gt;pleasure devices&lt;/a&gt; or &lt;a href=\"https://en.wikipedia.org/wiki/Experience_machine\"&gt;Nozick&amp;#39;s experience machine&lt;/a&gt; - or if everyone is a purist utilitarian who would find sudden sacrifice acceptable as you described.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Perhaps the point is now moot: S would surely have better ways of helping people than unexpectedly chopping them up! &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Maybe this is a nitpick, but you are using the term &amp;quot;people&amp;quot; equivocally here: &lt;em&gt;S&lt;/em&gt; helps some people by chopping up others, or helps People in general by chopping up some people specifically. Regardless, what&amp;#39;s inherently wrong with chopping people up for a Utilitarian AI Overlord? It is a tool. Maybe the Overlord would only chop up sad people. But then again, this line of reasoning just folds into the neuroblob factory objection.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m having a hard time letting it go. Your post has encouraged me to keep trying to defend the moral system---thanks for that!&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;em&gt;CURSES, MY PLAN HAS BACKFIRED!&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;...but more seriously, I do think that classical utilitarianism is too often accepted uncritically. I have sometimes noticed an attitude of &amp;quot;if not theism, then classical utilitarianism,&amp;quot; which I consider problematic. And it sounds like I was in a similar situation to you before I really understood the objections.&lt;/p&gt;\n\n&lt;p&gt;Edit: I almost forgot to mention the real reason that I wanted to ignore practical considerations: there are several objections to utilitarianism based on its impracticality. But if practicality cannot be ignored, then I will add the following to my list of objections:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Paradox_of_hedonism\"&gt;The paradox of hedonism&lt;/a&gt;: Trying to chase happiness is not a good way to make people happy, so we should not focus on happiness.&lt;/li&gt;\n&lt;li&gt;The impossibility of prediction: We cannot predict the future accurately, so it is fruitless to judge actions based on their consequences. Utilitarianism deals in terms of possible futures, but other ethical systems (i.e. deontological systems, existentialism) deal in terms of certain aspects of the present.&lt;/li&gt;\n&lt;li&gt;The difficulty of measurement and definition: How are we going to measure peoples&amp;#39; happiness? Will we force everyone to wear brain-scanning devices? What happens&lt;/li&gt;\n&lt;li&gt;Dealing with dissidents: How would we force everyone to go along with utilitarianism when many, if not most, people would reject it? Kantianism and existentialism, for example, can accomodate people who disagree with them - but what would a utilitarian do with people who refused to be laid down for the greater good?&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;It is entirely plausible that these arguments are all invalid, and I do not expect you to show how -- I am not attempting to &lt;a href=\"http://rationalwiki.org/wiki/Gish_gallop\"&gt;&amp;quot;Gish gallop&amp;quot;&lt;/a&gt; you by overwhelming you in bad arguments. I consider these arguments outside the scope of this discussion, because they deal with practical considerations &lt;em&gt;instead of&lt;/em&gt; moral considerations.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbsyin", "score_hidden": false, "stickied": false, "created": 1492355145.0, "created_utc": 1492326345.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbis22", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Bobby_Cement", "parent_id": "t3_65fjm3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "###Skippable niceties \n\nHey, wow! Thanks for posting such a long and thoughtful prompt. I have been thinking/worrying about consequentialism lately, and you have given me the opportunity hone my thoughts. Also: never before have I been forced to transfer a Reddit post to my kindle so I could get through it! \n\nI've noticed that, so far, I have agreed with you over every commenter trying to cyv. I'll venture to say that they have learned much more from you than you from them. That doesn't say much for my chances, but let's throw my hat in the ring and see what happens. \n\n###Practical considerations and organ transplants \n\nAs far as I understand your final rebuttal in the organ transplant example, you are saying that utilitarians ought to have  the desire to shape society according to utilitarian principles. Thus, even if the example is unrealistic, utilitarians ought to want it to be more realistic. A quick reply here is that our current world features a perfectly realistic analog to this practice: military conscription. When drafted, a soldier is forced to take on a chance of dying for the greater good of his countrymen, much like the patient of the utilitarian doctor. This comparison also hints that, if the utilitarians really contrived to make forced organ transplants a reality, the end result would look more like honorable sacrifice than like psycho-killer victimization. \n\nBut maybe you think that conscription is wrong; or maybe you want to say that I am unfairly changing the example, that a utilitarian should be able to argue for forced organ transplants *as you have described them*. In your description you have stated that we must not fixate on practical considerations. Here, I think, we run into trouble; I want to make the case that practical considerations are not as separable from moral problems as we thought-experimentalists might hope.\n\nIn this connection, I want to mention Dennett's \"Philosophers' Syndrome\": mistaking a **failure of the imagination** for an **insight into necessity** (though, reflecting my own uncertainty, I would want to use a word far less loaded than \"failure\"). As I understand your argument, it does not matter that no real doctor would be able to sneak---completely undetected--- a patients' organs into the bodies of several others. This is because a utilitarian ought to approve of this outcome in principle, and encourage it to occur to the extent that it is feasible. The resulting conclusion, that utilitarianism supports horrible outcomes, is the mistaken insight into necessity. \n\nWhy mistaken? I think the mistake comes from asserting that the doctor has infallible superhuman abilities, but without really considering what the situation would look like if this were the case. This part is the failure of imagination. Let me expand a bit on the distinction between our super-doctor S and an ordinary doctor O:\n\n* S has the powers (perhaps from advanced technology) to spirit away bodies, to disappear paperwork, and to either blank the minds of his assistants or to perform surgery *without* assistants. O does not.\n* O, like the rest of us, can only be trusted so far. He can be swayed by greed, and he can fall prey to a narcissistic power-trip. We see that good utilitarian reasoning suggests that O, knowing his own fallibility, must never trust himself to make life-or-death gambles like in our example. Perhaps we would want him to gamble with, say, the fate of the world in the balance, but that is not the case here. But S does not need to gamble, because S cannot be wrong.\n\nIn short, S looks less like a human doctor and more like the medical workings of a benevolent superintelligence.  To me, the failure of imagination is thus \"fixed\": my intuitive revulsion at S's machinations has dissolved. It seems that S really knows what he's doing, and I would be a fool to  stand in his way (however impotently that might be). Do your intuitions change similarly? Maybe it doesn't matter! Perhaps the point is now moot: S would surely have better ways of helping people than unexpectedly chopping them up! From this perspective, the organ transplant example isn't just unrealistic, it borders on self-contradictory.\n\nThis kind of thinking, I hope, shows that the question \"what is practical?\" is very deeply intertwined with the question \"what is moral?\". For example, a very similar argument could be made for the practical choice of inaction in the trolley problem. I think everyone would be helped in their philosophical investigations if our thought-experiments came to us more fleshed-out, a first step towards treating Philosopher's Syndrome. \n\n###Mop-up\n\nSo I have addressed only one corner of one section of your post, and have already gone on too long. I think I have more to say, but I'm not sure if you're planning on engaging much longer with this cmv. It's best to leave it here for now, but please let me know what your level of involvement will be. I have recently come into my own doubts about consequentialism (different from what you have listed), but I'm having a hard time letting it go. Your post has encouraged me to keep trying to defend the moral system---thanks for that!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;h3&gt;Skippable niceties&lt;/h3&gt;\n\n&lt;p&gt;Hey, wow! Thanks for posting such a long and thoughtful prompt. I have been thinking/worrying about consequentialism lately, and you have given me the opportunity hone my thoughts. Also: never before have I been forced to transfer a Reddit post to my kindle so I could get through it! &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve noticed that, so far, I have agreed with you over every commenter trying to cyv. I&amp;#39;ll venture to say that they have learned much more from you than you from them. That doesn&amp;#39;t say much for my chances, but let&amp;#39;s throw my hat in the ring and see what happens. &lt;/p&gt;\n\n&lt;h3&gt;Practical considerations and organ transplants&lt;/h3&gt;\n\n&lt;p&gt;As far as I understand your final rebuttal in the organ transplant example, you are saying that utilitarians ought to have  the desire to shape society according to utilitarian principles. Thus, even if the example is unrealistic, utilitarians ought to want it to be more realistic. A quick reply here is that our current world features a perfectly realistic analog to this practice: military conscription. When drafted, a soldier is forced to take on a chance of dying for the greater good of his countrymen, much like the patient of the utilitarian doctor. This comparison also hints that, if the utilitarians really contrived to make forced organ transplants a reality, the end result would look more like honorable sacrifice than like psycho-killer victimization. &lt;/p&gt;\n\n&lt;p&gt;But maybe you think that conscription is wrong; or maybe you want to say that I am unfairly changing the example, that a utilitarian should be able to argue for forced organ transplants &lt;em&gt;as you have described them&lt;/em&gt;. In your description you have stated that we must not fixate on practical considerations. Here, I think, we run into trouble; I want to make the case that practical considerations are not as separable from moral problems as we thought-experimentalists might hope.&lt;/p&gt;\n\n&lt;p&gt;In this connection, I want to mention Dennett&amp;#39;s &amp;quot;Philosophers&amp;#39; Syndrome&amp;quot;: mistaking a &lt;strong&gt;failure of the imagination&lt;/strong&gt; for an &lt;strong&gt;insight into necessity&lt;/strong&gt; (though, reflecting my own uncertainty, I would want to use a word far less loaded than &amp;quot;failure&amp;quot;). As I understand your argument, it does not matter that no real doctor would be able to sneak---completely undetected--- a patients&amp;#39; organs into the bodies of several others. This is because a utilitarian ought to approve of this outcome in principle, and encourage it to occur to the extent that it is feasible. The resulting conclusion, that utilitarianism supports horrible outcomes, is the mistaken insight into necessity. &lt;/p&gt;\n\n&lt;p&gt;Why mistaken? I think the mistake comes from asserting that the doctor has infallible superhuman abilities, but without really considering what the situation would look like if this were the case. This part is the failure of imagination. Let me expand a bit on the distinction between our super-doctor S and an ordinary doctor O:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;S has the powers (perhaps from advanced technology) to spirit away bodies, to disappear paperwork, and to either blank the minds of his assistants or to perform surgery &lt;em&gt;without&lt;/em&gt; assistants. O does not.&lt;/li&gt;\n&lt;li&gt;O, like the rest of us, can only be trusted so far. He can be swayed by greed, and he can fall prey to a narcissistic power-trip. We see that good utilitarian reasoning suggests that O, knowing his own fallibility, must never trust himself to make life-or-death gambles like in our example. Perhaps we would want him to gamble with, say, the fate of the world in the balance, but that is not the case here. But S does not need to gamble, because S cannot be wrong.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;In short, S looks less like a human doctor and more like the medical workings of a benevolent superintelligence.  To me, the failure of imagination is thus &amp;quot;fixed&amp;quot;: my intuitive revulsion at S&amp;#39;s machinations has dissolved. It seems that S really knows what he&amp;#39;s doing, and I would be a fool to  stand in his way (however impotently that might be). Do your intuitions change similarly? Maybe it doesn&amp;#39;t matter! Perhaps the point is now moot: S would surely have better ways of helping people than unexpectedly chopping them up! From this perspective, the organ transplant example isn&amp;#39;t just unrealistic, it borders on self-contradictory.&lt;/p&gt;\n\n&lt;p&gt;This kind of thinking, I hope, shows that the question &amp;quot;what is practical?&amp;quot; is very deeply intertwined with the question &amp;quot;what is moral?&amp;quot;. For example, a very similar argument could be made for the practical choice of inaction in the trolley problem. I think everyone would be helped in their philosophical investigations if our thought-experiments came to us more fleshed-out, a first step towards treating Philosopher&amp;#39;s Syndrome. &lt;/p&gt;\n\n&lt;h3&gt;Mop-up&lt;/h3&gt;\n\n&lt;p&gt;So I have addressed only one corner of one section of your post, and have already gone on too long. I think I have more to say, but I&amp;#39;m not sure if you&amp;#39;re planning on engaging much longer with this cmv. It&amp;#39;s best to leave it here for now, but please let me know what your level of involvement will be. I have recently come into my own doubts about consequentialism (different from what you have listed), but I&amp;#39;m having a hard time letting it go. Your post has encouraged me to keep trying to defend the moral system---thanks for that!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbis22", "score_hidden": false, "stickied": false, "created": 1492336910.0, "created_utc": 1492308110.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": "", "user_reports": [], "id": "dgaf2jd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dgaeu0z", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "This delta has been rejected. You can't award OP a delta.\n\nAllowing this would wrongly suggest that you can post here with the aim of convincing others.\n\nIf you were explaining when/how to award a delta, please use a reddit quote for the symbol next time.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {\n    \"op\": 1\n  },\n  \"parentUserName\": \"GregConan\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This delta has been rejected. You can&amp;#39;t award OP a delta.&lt;/p&gt;\n\n&lt;p&gt;Allowing this would wrongly suggest that you can post here with the aim of convincing others.&lt;/p&gt;\n\n&lt;p&gt;If you were explaining when/how to award a delta, please use a reddit quote for the symbol next time.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%0A%20%20%20%20%22op%22:%201%0A%20%20%7D,%0A%20%20%22parentUserName%22:%20%22GregConan%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaf2jd", "score_hidden": false, "stickied": false, "created": 1492269749.0, "created_utc": 1492240949.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaeu0z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dgabnda", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Whoops, I forgot to give you a ∆ for showing that the principle of informed consent is not necessarily morally good in all possible worlds. I probably should have done that in my earlier comment.\n\nEdit: Then I replied to the wrong comment. I swear I'll get this right...", "edited": 1492240585.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whoops, I forgot to give you a ∆ for showing that the principle of informed consent is not necessarily morally good in all possible worlds. I probably should have done that in my earlier comment.&lt;/p&gt;\n\n&lt;p&gt;Edit: Then I replied to the wrong comment. I swear I&amp;#39;ll get this right...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaeu0z", "score_hidden": false, "stickied": false, "created": 1492269139.0, "created_utc": 1492240339.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": "", "user_reports": [], "id": "dgacsn8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dgabxqy", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; I don't dispute the fact that there are people who get utility out of committing horrible crimes, like sadistic psychopaths and bipolar abusers. It's just that the utility gain to then is dwarfed by the utility loss to other. Their activities are a net negative. My understanding of the utility monster hypothetical is that their activities are net, not just gross, positive. Right?\n\nCorrect. You appear frustrated by my use of hypotheticals, so I suppose I should give the real context. The reason I brought up the \"bipolar abuser, dysthymic victim\" example is because a very similar situation happened to someone I know. This person used the following reasoning: \"I hate the relationship I'm in because the other person emotionally manipulates me, but any amount of time I spend with this person makes them happier than it could possibly make me unhappy and vice versa, so I must not leave.\" Only after understanding that situation did the full force of the utility monster argument hit me.\n\n&gt;It's like asking how physics would deal with a Delorean going faster than the speed of light. \n\n[Arguing from analogy](https://www.logicallyfallacious.com/tools/lp/Bo/LogicalFallacies/181/Weak_Analogy) is like building a bridge out of straw: the further you extend it, the easier it is to break. The examples I provided are all physically possible; a Delorean going faster than light is not. But that is not my main point. The reason I used the neuroblob example is not only because it is possible, but because *you can and should try to make it happen* if you are a utilitarian.\n\n&gt;The only thing we could base that statement on is our inborn moral intuitions, but those intuitions can't properly respond to an unimaginable scenario; it's not possible.\n\nBecause you mentioned the time traveling Delorean, I assume you realize that \"physically impossible\" does not mean \"unimaginable.\" Rather, \"*logically impossible*\" means unimaginable. If it helps, think of it this way: imagine a fictional story where any of the scenarios I described happened. Actually, such a story already exists: [the SMBC comic](http://www.smbc-comics.com/?id=2569) I mentioned in my original post. Do you think we are unable to judge morality in the context of fiction?\n\nI apologize for dragging this on for so long, by the way. I just don't think we should underestimate the value of thought experiments in ethics.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t dispute the fact that there are people who get utility out of committing horrible crimes, like sadistic psychopaths and bipolar abusers. It&amp;#39;s just that the utility gain to then is dwarfed by the utility loss to other. Their activities are a net negative. My understanding of the utility monster hypothetical is that their activities are net, not just gross, positive. Right?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Correct. You appear frustrated by my use of hypotheticals, so I suppose I should give the real context. The reason I brought up the &amp;quot;bipolar abuser, dysthymic victim&amp;quot; example is because a very similar situation happened to someone I know. This person used the following reasoning: &amp;quot;I hate the relationship I&amp;#39;m in because the other person emotionally manipulates me, but any amount of time I spend with this person makes them happier than it could possibly make me unhappy and vice versa, so I must not leave.&amp;quot; Only after understanding that situation did the full force of the utility monster argument hit me.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s like asking how physics would deal with a Delorean going faster than the speed of light. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.logicallyfallacious.com/tools/lp/Bo/LogicalFallacies/181/Weak_Analogy\"&gt;Arguing from analogy&lt;/a&gt; is like building a bridge out of straw: the further you extend it, the easier it is to break. The examples I provided are all physically possible; a Delorean going faster than light is not. But that is not my main point. The reason I used the neuroblob example is not only because it is possible, but because &lt;em&gt;you can and should try to make it happen&lt;/em&gt; if you are a utilitarian.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The only thing we could base that statement on is our inborn moral intuitions, but those intuitions can&amp;#39;t properly respond to an unimaginable scenario; it&amp;#39;s not possible.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Because you mentioned the time traveling Delorean, I assume you realize that &amp;quot;physically impossible&amp;quot; does not mean &amp;quot;unimaginable.&amp;quot; Rather, &amp;quot;&lt;em&gt;logically impossible&lt;/em&gt;&amp;quot; means unimaginable. If it helps, think of it this way: imagine a fictional story where any of the scenarios I described happened. Actually, such a story already exists: &lt;a href=\"http://www.smbc-comics.com/?id=2569\"&gt;the SMBC comic&lt;/a&gt; I mentioned in my original post. Do you think we are unable to judge morality in the context of fiction?&lt;/p&gt;\n\n&lt;p&gt;I apologize for dragging this on for so long, by the way. I just don&amp;#39;t think we should underestimate the value of thought experiments in ethics.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgacsn8", "score_hidden": false, "stickied": false, "created": 1492264364.0, "created_utc": 1492235564.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgabxqy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VStarffin", "parent_id": "t1_dgabnda", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; If you mean \"we don't live in a world with a fixed-happiness-efficiency utility monster,\" then that is fair enough.\n\nNot sure what you mean by this. I guess my way of saying it is that I don't dispute the fact that there are people who get utility out of committing horrible crimes, like sadistic psychopaths and bipolar abusers. It's just that the utility gain to then is dwarfed by the utility loss to other. Their activities are a *net negative*. My understanding of the utility monster hypothetical is that their activities are *net*, not just *gross*, positive. Right?\n\n&gt;Well, you would be a slave and suffer alongside the rest of the human race. If you're fine with that, okay -- but don't expect me to agree.\n\nWould I be? Probably not, because I'm selfish and I care about my own personal suffering. But there's a difference between asking \"would you do this\" and asking \"would this be moral\". I'm not a perfect moral being, and I violate my own ideal morality all the time.\n\nBut more broadly, the problem with all of these kinds of hypotheticals is that they confuse what \"morality\" even means. All moral judgments are based on pre-existing moral intuitions which do not arise from reason, but rather are just inborn as a result of our biology. These inborn intuitions are the result of real world experience, both our own personal experiences, and the experiences of our ancestors who were subject to evolutionary pressures and therefore provided us with our hereditary moral intuitions.\n\nWhat you are essentially doing with the \"imagine this hypothetical, never-before-experience situation\" is you are now trying to decouple morality from the lived experience of what the world is actually like. But that doesn't work. You can't ask our moral intuitions, fertilized in lived reality, to reasonably react to an *un*real scenario and expect the results to make any sense. Under any system - utilitarian, religious, deontological. No possible moral system can sustain such a criticism. It's like asking how physics would deal with a Delorean going faster than the speed of light. It doesn't make sense, and while it makes for entertaining movies, it's not a great idea to make real world decisions based on those kinds of thought experiments.\n\nSo when you say hypothesize a scenario where the enslavement of all humanity would actually be moral, I don't really know what we can be basing that statement on. And I frankly don't think *anyone*, using *any moral system*, would do any better. The only thing we *could* base that statement on is our inborn moral intuitions, but those intuitions can't properly respond to an unimaginable scenario; it's not possible. So they are being misapplied, giving a moral weight to a possibility that the question is asserting you *must* give moral weight to, against all intuition. It is exactly this kind of scenario where I would be tempted to accept the utilitarian equation *over* my moral intuitions, as I'd have to recognize my moral senses are incapable of dealing with the hypothetical you've proposed. I just don't see an alternative, in any moral system. \n\nThe analogy here is something like relativity in physics - our native, inborn sense of \"physics\" is the result of our evolution - our physical size and our place in the cosmos have given us a sense that physics works a certain, naive way. Relativity violates all our intuitions. Why did we accept it? Because math says it must be true, and we trust math. (Well, that's why we accepted it prior to its experimental success.) So if you're telling me that I must accept such a world would be moral? Then sure, I accept it, because I believe in the rules, even if it goes against my naive intuitions. I hope I never have to put this one to the test though.", "edited": 1492234137.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If you mean &amp;quot;we don&amp;#39;t live in a world with a fixed-happiness-efficiency utility monster,&amp;quot; then that is fair enough.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not sure what you mean by this. I guess my way of saying it is that I don&amp;#39;t dispute the fact that there are people who get utility out of committing horrible crimes, like sadistic psychopaths and bipolar abusers. It&amp;#39;s just that the utility gain to then is dwarfed by the utility loss to other. Their activities are a &lt;em&gt;net negative&lt;/em&gt;. My understanding of the utility monster hypothetical is that their activities are &lt;em&gt;net&lt;/em&gt;, not just &lt;em&gt;gross&lt;/em&gt;, positive. Right?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Well, you would be a slave and suffer alongside the rest of the human race. If you&amp;#39;re fine with that, okay -- but don&amp;#39;t expect me to agree.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Would I be? Probably not, because I&amp;#39;m selfish and I care about my own personal suffering. But there&amp;#39;s a difference between asking &amp;quot;would you do this&amp;quot; and asking &amp;quot;would this be moral&amp;quot;. I&amp;#39;m not a perfect moral being, and I violate my own ideal morality all the time.&lt;/p&gt;\n\n&lt;p&gt;But more broadly, the problem with all of these kinds of hypotheticals is that they confuse what &amp;quot;morality&amp;quot; even means. All moral judgments are based on pre-existing moral intuitions which do not arise from reason, but rather are just inborn as a result of our biology. These inborn intuitions are the result of real world experience, both our own personal experiences, and the experiences of our ancestors who were subject to evolutionary pressures and therefore provided us with our hereditary moral intuitions.&lt;/p&gt;\n\n&lt;p&gt;What you are essentially doing with the &amp;quot;imagine this hypothetical, never-before-experience situation&amp;quot; is you are now trying to decouple morality from the lived experience of what the world is actually like. But that doesn&amp;#39;t work. You can&amp;#39;t ask our moral intuitions, fertilized in lived reality, to reasonably react to an &lt;em&gt;un&lt;/em&gt;real scenario and expect the results to make any sense. Under any system - utilitarian, religious, deontological. No possible moral system can sustain such a criticism. It&amp;#39;s like asking how physics would deal with a Delorean going faster than the speed of light. It doesn&amp;#39;t make sense, and while it makes for entertaining movies, it&amp;#39;s not a great idea to make real world decisions based on those kinds of thought experiments.&lt;/p&gt;\n\n&lt;p&gt;So when you say hypothesize a scenario where the enslavement of all humanity would actually be moral, I don&amp;#39;t really know what we can be basing that statement on. And I frankly don&amp;#39;t think &lt;em&gt;anyone&lt;/em&gt;, using &lt;em&gt;any moral system&lt;/em&gt;, would do any better. The only thing we &lt;em&gt;could&lt;/em&gt; base that statement on is our inborn moral intuitions, but those intuitions can&amp;#39;t properly respond to an unimaginable scenario; it&amp;#39;s not possible. So they are being misapplied, giving a moral weight to a possibility that the question is asserting you &lt;em&gt;must&lt;/em&gt; give moral weight to, against all intuition. It is exactly this kind of scenario where I would be tempted to accept the utilitarian equation &lt;em&gt;over&lt;/em&gt; my moral intuitions, as I&amp;#39;d have to recognize my moral senses are incapable of dealing with the hypothetical you&amp;#39;ve proposed. I just don&amp;#39;t see an alternative, in any moral system. &lt;/p&gt;\n\n&lt;p&gt;The analogy here is something like relativity in physics - our native, inborn sense of &amp;quot;physics&amp;quot; is the result of our evolution - our physical size and our place in the cosmos have given us a sense that physics works a certain, naive way. Relativity violates all our intuitions. Why did we accept it? Because math says it must be true, and we trust math. (Well, that&amp;#39;s why we accepted it prior to its experimental success.) So if you&amp;#39;re telling me that I must accept such a world would be moral? Then sure, I accept it, because I believe in the rules, even if it goes against my naive intuitions. I hope I never have to put this one to the test though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgabxqy", "score_hidden": false, "stickied": false, "created": 1492262566.0, "created_utc": 1492233766.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgabnda", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dgab9es", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Can't I just say \"imagine a world where informed consent causes unimaginable suffering to all people and the only joy anyone achieves is through violent, non-consensual acts\" and this principle falls apart?\n\nFair point, actually. I had not thought of that.\n\n&gt;We don't live in a world with a utility monster.\n\nI may as well point out that I provided real-life examples in my original post, such as sadistic psychopaths and bipolar abusers. If you mean \"we don't live in a world with a fixed-happiness-efficiency utility monster,\" then that is fair enough.\n\n&gt;I don't see the basis to object.\n\nIf you see it as good to enslave the human race to a giant brain factory, I consider that \"biting the bullet,\" as described below:\n\n&gt;If such a world did exist, what reason would I have to object to such a thing?\n\nWell, you would be a slave and suffer alongside the rest of the human race. If you're fine with that, okay -- but don't expect me to agree.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Can&amp;#39;t I just say &amp;quot;imagine a world where informed consent causes unimaginable suffering to all people and the only joy anyone achieves is through violent, non-consensual acts&amp;quot; and this principle falls apart?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Fair point, actually. I had not thought of that.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We don&amp;#39;t live in a world with a utility monster.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I may as well point out that I provided real-life examples in my original post, such as sadistic psychopaths and bipolar abusers. If you mean &amp;quot;we don&amp;#39;t live in a world with a fixed-happiness-efficiency utility monster,&amp;quot; then that is fair enough.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t see the basis to object.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you see it as good to enslave the human race to a giant brain factory, I consider that &amp;quot;biting the bullet,&amp;quot; as described below:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If such a world did exist, what reason would I have to object to such a thing?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, you would be a slave and suffer alongside the rest of the human race. If you&amp;#39;re fine with that, okay -- but don&amp;#39;t expect me to agree.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgabnda", "score_hidden": false, "stickied": false, "created": 1492262008.0, "created_utc": 1492233208.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": "", "user_reports": [], "id": "dgaeye2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dgaexy9", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/VStarffin ([8∆](/r/changemyview/wiki/user/VStarffin)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"VStarffin\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/VStarffin\"&gt;/u/VStarffin&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/VStarffin\"&gt;8∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22VStarffin%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaeye2", "score_hidden": false, "stickied": false, "created": 1492269453.0, "created_utc": 1492240653.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaexy9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dgab9es", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Whoops, I forgot to give you a delta for showing that the principle of informed consent is not necessarily morally good in all possible worlds. I probably should have done that in my earlier comment.\n\nAlright, now I'm replying to the right comment. Here you go: ∆", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Whoops, I forgot to give you a delta for showing that the principle of informed consent is not necessarily morally good in all possible worlds. I probably should have done that in my earlier comment.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Alright, now I&amp;#39;m replying to the right comment. Here you go: ∆&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaexy9", "score_hidden": false, "stickied": false, "created": 1492269421.0, "created_utc": 1492240621.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgab9es", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "VStarffin", "parent_id": "t1_dgaas60", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Rape is defined as unlawful sex without consent, so \"rape which causes less suffering in the victim than happiness in the rapist\" is a coherent and imaginable thing. \n\nIt doesn't matter whether it's *imaginable*. What matters is whether it's *real*. As I said later in my post, it's easy to *imagine* a watermelon which tasted like feces. That doesn't mean that my sense of taste is \"untenable and absurd\".\n\nThe analogy between morality and health really is the best way to understand this. Our morality, like our medicine, is suited to *this world*. What's the point of an objection which says \"if the world was different your morality would be different\". I already admitted this was true. I just don't understand why I should care.\n\n&gt;The principle of informed consent is one example of an ethical maxim which would unequivocally say that rape is bad in any possible world.\n\nIf you assume informed consent is good, then yes, using that as the basis of morality would mean violating it is bad. But that's not insightful, it's just definitional. This is nothing more than a tautology - \"if you assume X is good in every possible world, then violating X is bad in every possible world\".\n\nWell, of course. You've just defined it that way. But why should I believe that informed consent *is* good in every possible world, though? Can't I just say \"imagine a world where informed consent causes unimaginable suffering to all people and the only joy anyone achieves is through violent, non-consensual acts\" and this principle falls apart? If you can propose a world where rape causes net joy, why can't I propose a world where informed consent causes net suffering?\n\nYou can't say \"your belief system is bad since I can imagine a world where, applying that principle, leads to outcomes I find distasteful\" without falling prey to the same objection.\n\n&gt;Are you suggesting that it is physically impossible for an entity to exist with a high and fixed happiness efficiency?\n\nYou keep confusing whether things are possible with whether things are actual. You can *imagine* a world in which Hillary Clinton won the electoral college. It was not \"physically impossible\" for it to happen.\n\nBut it didn't happen. We don't live in a world with a utility monster.\n\n&gt;Imagine a massive neuroblob factory as a utility monster: a pure classical utilitarian would want to create it and enslave you and the rest of the human race to keep it running because that would maximize happiness, but I doubt that you would agree.\n\nI don't see the basis to object. If such a world did exist, what reason would I have to object to such a thing? But perhaps more important, what reason would you have? As noted above, you can't rely on informed consent without justifying why that's important, any more than I can rely on utilitarianism without justifying why its important. I believe I've done so - what's your explanation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Rape is defined as unlawful sex without consent, so &amp;quot;rape which causes less suffering in the victim than happiness in the rapist&amp;quot; is a coherent and imaginable thing. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It doesn&amp;#39;t matter whether it&amp;#39;s &lt;em&gt;imaginable&lt;/em&gt;. What matters is whether it&amp;#39;s &lt;em&gt;real&lt;/em&gt;. As I said later in my post, it&amp;#39;s easy to &lt;em&gt;imagine&lt;/em&gt; a watermelon which tasted like feces. That doesn&amp;#39;t mean that my sense of taste is &amp;quot;untenable and absurd&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;The analogy between morality and health really is the best way to understand this. Our morality, like our medicine, is suited to &lt;em&gt;this world&lt;/em&gt;. What&amp;#39;s the point of an objection which says &amp;quot;if the world was different your morality would be different&amp;quot;. I already admitted this was true. I just don&amp;#39;t understand why I should care.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The principle of informed consent is one example of an ethical maxim which would unequivocally say that rape is bad in any possible world.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you assume informed consent is good, then yes, using that as the basis of morality would mean violating it is bad. But that&amp;#39;s not insightful, it&amp;#39;s just definitional. This is nothing more than a tautology - &amp;quot;if you assume X is good in every possible world, then violating X is bad in every possible world&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Well, of course. You&amp;#39;ve just defined it that way. But why should I believe that informed consent &lt;em&gt;is&lt;/em&gt; good in every possible world, though? Can&amp;#39;t I just say &amp;quot;imagine a world where informed consent causes unimaginable suffering to all people and the only joy anyone achieves is through violent, non-consensual acts&amp;quot; and this principle falls apart? If you can propose a world where rape causes net joy, why can&amp;#39;t I propose a world where informed consent causes net suffering?&lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t say &amp;quot;your belief system is bad since I can imagine a world where, applying that principle, leads to outcomes I find distasteful&amp;quot; without falling prey to the same objection.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Are you suggesting that it is physically impossible for an entity to exist with a high and fixed happiness efficiency?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You keep confusing whether things are possible with whether things are actual. You can &lt;em&gt;imagine&lt;/em&gt; a world in which Hillary Clinton won the electoral college. It was not &amp;quot;physically impossible&amp;quot; for it to happen.&lt;/p&gt;\n\n&lt;p&gt;But it didn&amp;#39;t happen. We don&amp;#39;t live in a world with a utility monster.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Imagine a massive neuroblob factory as a utility monster: a pure classical utilitarian would want to create it and enslave you and the rest of the human race to keep it running because that would maximize happiness, but I doubt that you would agree.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t see the basis to object. If such a world did exist, what reason would I have to object to such a thing? But perhaps more important, what reason would you have? As noted above, you can&amp;#39;t rely on informed consent without justifying why that&amp;#39;s important, any more than I can rely on utilitarianism without justifying why its important. I believe I&amp;#39;ve done so - what&amp;#39;s your explanation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgab9es", "score_hidden": false, "stickied": false, "created": 1492261287.0, "created_utc": 1492232487.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": "", "user_reports": [], "id": "dgb642v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dgafnh0", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Wait, you're totally right about the rapist. I should have realized that. So I guess that a rapist does not count as an example of a utility monster — although I suppose that would only change my choice of example, not my view. For instance, I included another realistic example (bipolar abuser) and a conceivable example (the original fixed-happiness-efficiency monster as displayed in the SMBC comic) in my original post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait, you&amp;#39;re totally right about the rapist. I should have realized that. So I guess that a rapist does not count as an example of a utility monster — although I suppose that would only change my choice of example, not my view. For instance, I included another realistic example (bipolar abuser) and a conceivable example (the original fixed-happiness-efficiency monster as displayed in the SMBC comic) in my original post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb642v", "score_hidden": false, "stickied": false, "created": 1492318860.0, "created_utc": 1492290060.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgafnh0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BlitzBasic", "parent_id": "t1_dgaas60", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "That's bullshit. I'm 100% sure that rape decreases the total amount of happiness. The *immediate* payoff may be positive, but the victim will be traumatized and have a decreased happiness for a long time, while the positive happiness the attacker recieved will quickly fade away.\n\nA few minutes/hours of happiness against a lifetime of suffering? That's not even a contest.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s bullshit. I&amp;#39;m 100% sure that rape decreases the total amount of happiness. The &lt;em&gt;immediate&lt;/em&gt; payoff may be positive, but the victim will be traumatized and have a decreased happiness for a long time, while the positive happiness the attacker recieved will quickly fade away.&lt;/p&gt;\n\n&lt;p&gt;A few minutes/hours of happiness against a lifetime of suffering? That&amp;#39;s not even a contest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgafnh0", "score_hidden": false, "stickied": false, "created": 1492271318.0, "created_utc": 1492242518.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaas60", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dga9ibh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Rape is wrong because of its actual properties and consequences. To then ask \"would it be wrong if it didn't have those properties and consequences\" is to essentially be describing something other than rape ... The question doesn't even make sense.\n\n[Rape is defined as unlawful sex without consent](http://www.dictionary.com/browse/rape), so \"rape which causes less suffering in the victim than happiness in the rapist\" is a coherent and imaginable thing. It probably happens every day, unfortunately, because sex could provide more pleasure in the rapist than it deprives from the victim. It is wrong because it violates the principle of informed consent (\"permission granted in the knowledge of the possible consequences\"), under a definition of morality which prioritizes that principle.\n\n&gt;Because my morality is suited for this reality, not a hypothetical different one. \n\nAs I described in the original post, the reason that thought experiments are valid is because they address definitions. If you accept the thought experiment, then you accept that \"happiness\" and \"good\" are not [analytically synonymous](https://en.wikipedia.org/wiki/Analytic%E2%80%93synthetic_distinction).\n\n&gt;what possible alternative to utilitarianism could survive this kind of hypothetical?\n\nThe principle of informed consent is one example of an ethical maxim which would unequivocally say that rape is bad in any possible world.\n\n&gt;What you are essentially asking me to do is imagine a different reality, where things don't have the consequences they do in this reality,\n\nAre you suggesting that it is physically impossible for an entity to exist with a high and fixed happiness efficiency?\n\nIf you need an example of something more likely to exist in this world, however, that can be accomodated. That is the purpose of objection (4), the \"happy neuroblobs.\" If we created a Utilitarian AI Overlord, it wouldn't maximize your pleasure. It would either kill you or use you as a slave to keep the neuroblob factories running smoothly. Their mass-produced pleasure would outweigh yours a thousandfold. Imagine a massive neuroblob factory as a utility monster: a pure classical utilitarian would want to create it and enslave you and the rest of the human race to keep it running because that would maximize happiness, but I doubt that you would agree. Since \"neuroblobs\" are made from things that really exist in this world, [brain pleasure centers](http://psy2.ucsd.edu/~nchristenfeld/Happiness_Readings_files/Class%205%20-%20Olds%201956.pdf) attached to [deep brain stimulation](http://brainblogger.com/2009/01/08/deep-brain-stimulation-for-pleasure) devices, they may be an easier example to deal with.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Rape is wrong because of its actual properties and consequences. To then ask &amp;quot;would it be wrong if it didn&amp;#39;t have those properties and consequences&amp;quot; is to essentially be describing something other than rape ... The question doesn&amp;#39;t even make sense.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.dictionary.com/browse/rape\"&gt;Rape is defined as unlawful sex without consent&lt;/a&gt;, so &amp;quot;rape which causes less suffering in the victim than happiness in the rapist&amp;quot; is a coherent and imaginable thing. It probably happens every day, unfortunately, because sex could provide more pleasure in the rapist than it deprives from the victim. It is wrong because it violates the principle of informed consent (&amp;quot;permission granted in the knowledge of the possible consequences&amp;quot;), under a definition of morality which prioritizes that principle.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Because my morality is suited for this reality, not a hypothetical different one. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As I described in the original post, the reason that thought experiments are valid is because they address definitions. If you accept the thought experiment, then you accept that &amp;quot;happiness&amp;quot; and &amp;quot;good&amp;quot; are not &lt;a href=\"https://en.wikipedia.org/wiki/Analytic%E2%80%93synthetic_distinction\"&gt;analytically synonymous&lt;/a&gt;.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;what possible alternative to utilitarianism could survive this kind of hypothetical?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The principle of informed consent is one example of an ethical maxim which would unequivocally say that rape is bad in any possible world.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What you are essentially asking me to do is imagine a different reality, where things don&amp;#39;t have the consequences they do in this reality,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Are you suggesting that it is physically impossible for an entity to exist with a high and fixed happiness efficiency?&lt;/p&gt;\n\n&lt;p&gt;If you need an example of something more likely to exist in this world, however, that can be accomodated. That is the purpose of objection (4), the &amp;quot;happy neuroblobs.&amp;quot; If we created a Utilitarian AI Overlord, it wouldn&amp;#39;t maximize your pleasure. It would either kill you or use you as a slave to keep the neuroblob factories running smoothly. Their mass-produced pleasure would outweigh yours a thousandfold. Imagine a massive neuroblob factory as a utility monster: a pure classical utilitarian would want to create it and enslave you and the rest of the human race to keep it running because that would maximize happiness, but I doubt that you would agree. Since &amp;quot;neuroblobs&amp;quot; are made from things that really exist in this world, &lt;a href=\"http://psy2.ucsd.edu/%7Enchristenfeld/Happiness_Readings_files/Class%205%20-%20Olds%201956.pdf\"&gt;brain pleasure centers&lt;/a&gt; attached to &lt;a href=\"http://brainblogger.com/2009/01/08/deep-brain-stimulation-for-pleasure\"&gt;deep brain stimulation&lt;/a&gt; devices, they may be an easier example to deal with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaas60", "score_hidden": false, "stickied": false, "created": 1492260431.0, "created_utc": 1492231631.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga9ibh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "VStarffin", "parent_id": "t3_65fjm3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So your CMV is quite long, and I hope you'll forgive me by focusing on just one of the objections, which is the utility monster objection. I'll explain my objection in more detail below, but the short version of the answer is that utility monsters don't exist. If I lived in a world where utility monsters existed, my morality would be different, and I don't believe the objection of \"if the world was different then your moral system wouldn't be the same\" is all that interesting. Of course it wouldn't be the same - morality is derived reality.\n\nLonger explanation.\n\nThis is a very strange objection I have to admit I've never understood. \n\nFor the sake of keeping this simple, let's pick a specific form of utility monster, which is the rape monster. This is the monster which enjoys raping people so much that a utilitarian would be required to consent to it, because the utility of that monster is so great as to outweigh the suffering of the victims. This can be generalized to any utility monster, which asks us to privilege one individual at the expense of the suffering of everyone else.\n\nTake a step back and ask yourself why rape is wrong. From a secular, utilitarian perspective, why would rape be wrong? The answer is that in the real world, rape hurts people. It causes not just the victim immense pain and suffering, but it causes emotional distress to people who know the victim and causes ripples of insecurity out into society where people are afraid of rape. And that the benefit to the rapist is not worth the cost to all the victims.\n\nIn other words, rape is wrong because of the *real world fact* that it causes people to suffer, and humans have a natural, inborn aversion to suffering and causing suffering (mostly, some of us don't and that's a problem). And that there is no corresponding benefit.\n\nWhat you are essentially doing is to say \"why is rape wrong if you just assume there is a corresponding benefit\"? That doesn't really make any sense as a question. Rape is wrong because of its actual properties and consequences. To then ask \"would it be wrong if it didn't have those properties and consequences\" is to essentially be describing something other than rape. It's like asking \"would you like chocolate ice cream if it was 500 degrees hot\" - if chocolate ice cream was that hot, it wouldn't *be* chocolate ice cream. The question doesn't make sense.\n\nMy morality is built from from the real world. It's the result of evolutionary pressures that occurred in this world, in our actual universe with its currently existing rules. What you are essentially asking me to do is imagine a *different reality*, where things don't have the consequences they do in this reality, and then see if my morality would stay the same. Well, the answer is no, it wouldn't. Because my morality is suited for *this* reality, not a hypothetical different one. It's sort of like you asking me \"if we lived in a different universe where sugar tasted like feces, would you still like watermelon\"? I mean, no, I wouldn't. Luckily I don't live in that world.\n\nI guess my question to you is why *should* my morality need to be the same in a *different reality*? Why would we expect it to be? But perhaps more importantly, what possible alternative to utilitarianism *could* survive this kind of hypothetical?", "edited": 1492229954.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So your CMV is quite long, and I hope you&amp;#39;ll forgive me by focusing on just one of the objections, which is the utility monster objection. I&amp;#39;ll explain my objection in more detail below, but the short version of the answer is that utility monsters don&amp;#39;t exist. If I lived in a world where utility monsters existed, my morality would be different, and I don&amp;#39;t believe the objection of &amp;quot;if the world was different then your moral system wouldn&amp;#39;t be the same&amp;quot; is all that interesting. Of course it wouldn&amp;#39;t be the same - morality is derived reality.&lt;/p&gt;\n\n&lt;p&gt;Longer explanation.&lt;/p&gt;\n\n&lt;p&gt;This is a very strange objection I have to admit I&amp;#39;ve never understood. &lt;/p&gt;\n\n&lt;p&gt;For the sake of keeping this simple, let&amp;#39;s pick a specific form of utility monster, which is the rape monster. This is the monster which enjoys raping people so much that a utilitarian would be required to consent to it, because the utility of that monster is so great as to outweigh the suffering of the victims. This can be generalized to any utility monster, which asks us to privilege one individual at the expense of the suffering of everyone else.&lt;/p&gt;\n\n&lt;p&gt;Take a step back and ask yourself why rape is wrong. From a secular, utilitarian perspective, why would rape be wrong? The answer is that in the real world, rape hurts people. It causes not just the victim immense pain and suffering, but it causes emotional distress to people who know the victim and causes ripples of insecurity out into society where people are afraid of rape. And that the benefit to the rapist is not worth the cost to all the victims.&lt;/p&gt;\n\n&lt;p&gt;In other words, rape is wrong because of the &lt;em&gt;real world fact&lt;/em&gt; that it causes people to suffer, and humans have a natural, inborn aversion to suffering and causing suffering (mostly, some of us don&amp;#39;t and that&amp;#39;s a problem). And that there is no corresponding benefit.&lt;/p&gt;\n\n&lt;p&gt;What you are essentially doing is to say &amp;quot;why is rape wrong if you just assume there is a corresponding benefit&amp;quot;? That doesn&amp;#39;t really make any sense as a question. Rape is wrong because of its actual properties and consequences. To then ask &amp;quot;would it be wrong if it didn&amp;#39;t have those properties and consequences&amp;quot; is to essentially be describing something other than rape. It&amp;#39;s like asking &amp;quot;would you like chocolate ice cream if it was 500 degrees hot&amp;quot; - if chocolate ice cream was that hot, it wouldn&amp;#39;t &lt;em&gt;be&lt;/em&gt; chocolate ice cream. The question doesn&amp;#39;t make sense.&lt;/p&gt;\n\n&lt;p&gt;My morality is built from from the real world. It&amp;#39;s the result of evolutionary pressures that occurred in this world, in our actual universe with its currently existing rules. What you are essentially asking me to do is imagine a &lt;em&gt;different reality&lt;/em&gt;, where things don&amp;#39;t have the consequences they do in this reality, and then see if my morality would stay the same. Well, the answer is no, it wouldn&amp;#39;t. Because my morality is suited for &lt;em&gt;this&lt;/em&gt; reality, not a hypothetical different one. It&amp;#39;s sort of like you asking me &amp;quot;if we lived in a different universe where sugar tasted like feces, would you still like watermelon&amp;quot;? I mean, no, I wouldn&amp;#39;t. Luckily I don&amp;#39;t live in that world.&lt;/p&gt;\n\n&lt;p&gt;I guess my question to you is why &lt;em&gt;should&lt;/em&gt; my morality need to be the same in a &lt;em&gt;different reality&lt;/em&gt;? Why would we expect it to be? But perhaps more importantly, what possible alternative to utilitarianism &lt;em&gt;could&lt;/em&gt; survive this kind of hypothetical?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dga9ibh", "score_hidden": false, "stickied": false, "created": 1492258216.0, "created_utc": 1492229416.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": "", "user_reports": [], "id": "dgb5u3d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dgagfds", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "First of all, thank you for such a thorough comment.\n\n&gt;Just because your personal, irrational bias in favor of humans makes you think this conclusion is horrible doesn't mean it's false. Sorry, but that's the reality … Minorities don't have human rights anyways. Bentham famously said, natural rights are nonsense upon stilts. \n\nTo clarify, I decided from the outset of this discussion that I want to ignore questions of how to justify an ethical theory if possible. That may seem impossible, since I carry the burden of proof of defining \"bad\" (so far, I have used a kind of shared intuitive repulsion), but definition and justification are not equivalent. Maybe ignoring justification questions is the main problem here — if you can show that it is, or provide an objective and proven justification for utilitarian morality, I will give you a delta.\n\nI want to ignore justification questions because objections to utilitarianism based on an apparent lack of justification deserve their own post. Such objections could include the [open-question argument](https://en.wikipedia.org/wiki/Open-question_argument), the [fact-value distinction](https://en.wikipedia.org/wiki/Fact–value_distinction), and the [Münchausen trilemma](https://en.wikipedia.org/wiki/Münchhausen_trilemma) for starters. I will not try to argue here that they discredit utilitarianism — maybe in a later post.\n\n&gt;But how does that make any sense? What basis are you using to determine the immorality?\n\nMy feelings and intuition, unfortunately, plus the principle of informed consent whenever possible. Again, I would like to ignore the question of justification if I can. \n\n&gt;The whole point of an ethical system like utilitarianism is to buck our (faulty) intuitions in favor of a more neutral &amp; objective system of moral principles.\n\nThat would really be great, in my opinion. But the admittedly subjective awfulness of its consequences convinced me otherwise. If you want to bite the bullet on all of them, that is fine with me, but as of yet I cannot. \n\n&gt;But as I said in my original post, this isn't a real objection. This is just you arguing that you don't like the conclusion, not that it's invalid or contradictory. Having to bite a bullet doesn't mean a ethical system is false.\n\nWhat is a \"real objection\"? I suppose that a contradiction would count, which is pretty cool. However, I am curious what you mean by showing a conclusion to be \"invalid,\" as distinct from \"contradictory.\" I have assumed that reduction to intuitive absurdity can invalidate an ethical system, but if it cannot, what else can?\n\n&gt;So your objection is no different than a homophobe getting upset that utilitarianism requires considering the happiness of gay people too. \n\nOn the basis of feelings alone, yes; on that of informed consent, no. \n\n&gt;See, first you argue that when following utilitarianism, a majority must acquiesce to the will of a minority (the utility monster). Then, you also argue that utilitarianism leads to majority rule. These two arguments are mutually exclusive. They cannot both be valid arguments. Either one is false, or both are false.\n\nIf everyone's happiness efficiency is the same, the majority is preferred; if the minority entity has a higher happiness efficiency than all members of the majority group combined, the minority is preferred. There is no contradiction here. \n\n&gt;Imagine two ant philosophers talking to each other about the same question … I think humans are such a being! … I could support my feelings on this issue by pointing out how much stronger feelings, preferences, and experiences humans have than ants (presumably) do.\n\nYes, that was response (5) in the utility monster section. I evidently did not rebut it well enough, so I will discuss it a bit further here. If I was an ant, then I feel like I would consider it unacceptable to sacrifice my colony to prevent a human's sprained ankle. As a human, I would disagree right now due only to practical limitations. Evolution designed us to be species-centric, but technology is slowly allowing us to grow out of it and giving us the opportunity to care for other species as we become dominant. For example, I had an ant problem in my apartment and had to use a spray to kill them, but I wish I had a technology which could just drive them away with pheromones or something. Maybe there is a contradiction here, and if you can show that it is fundamental to the utility monster objection, I'll either have to bite that bullet or give you a delta. \n\n&gt;If there really are some creatures far above us in terms of experience, but if such beings really exist, then we absolutely should sacrifice the whole of humanity to make sure their ankle doesn't get sprained … A true moral system shouldn't always be self-serving, right?\n\nWow. I guess a true moral system shouldn't always be self-serving…but I would like to imagine that we are worth more than an alien god's sprained ankle. Maybe I have nothing more than intuition to go on here, but you are making utilitarianism a tough sell.\n\nAs an ironic tangent, under this reasoning divine command theory would logically follow from utilitarianism if theism was true. God is the ultimate utility monster. \n\n&gt;I think that one important consideration here is the heuristic-related one mentioned in 6.3 above: having a rule against killing people is useful, and what any more complicated rule gained in flexibility, it might lose in sacrosanct-ness, making it more likely that immoral people or an immoral government would consider murder to be an option (see David Friedman on Schelling points).\n\nI thought that the whole point of utilitarianism was not to have \"sacrosanct rules\" at all, but to do whatever produces the most happiness? Also, I said from the outset that I want to ignore practical considerations, which would include how immoral people or governments might misinterpret rules. If we can talk about practical considerations, several other objections to utilitarianism which I mentioned in my original post but have not defended here suddenly become relevant.\n\n&gt;Not having forced organ transplants, while it may cause some individual in happiness (to the people who want the organs), it will cause societal happiness because people in general don't have to worry about their organs being seized at any moment.\n\nI responded to that objection in my original post, specifically the claim that \"people would avoid hospitals if this were to happen in the real world, resulting in more suffering\" and that adding stipulations to prevent people from knowing about it would be \"unrealistic to the point of absurdity\":\n\n&gt;1. Again, even if a situation is unrealistic, it is still a valid argument if we can imagine it. See rebuttal (2) to the utility monster responses.\n\n&gt;2. This argument is historically contingent, because it assumes that people will stay as they are:\n\n&gt;&gt;If you're a utilitarian, it would be moral to implement this on the national scale. Therefore, it stops being unrealistic. Remember, it's only an unrealistic scenario because we're not purist utilitarians. However, if you're an advocate of utilitarianism, you hope that one day most or all of us will be purist utilitarians.\n\nThat should be sufficient.\n\n&gt;See, it's really convenient to just make up a fictional scenario where you can just incessantly stimulate the pleasure center of the brain, but in the real world, we know that's not possible. Humans have a hedonistic treadmill and develop tolerances … it's really easy to just make up some imaginary machine that violates our current understandings of psychology.\n\nReally? My understanding was that [the brain does not acclimate to direct pleasure stimulation](http://wireheading.com). Maybe I was misled by utilitarian philosopher David Pearce:\n\n&gt;Unlike food, drink or sex, the experience of pleasure itself exhibits no tolerance, even though our innumerable objects of desire certainly do so. Thus we can eventually get bored of anything - with a single exception. Stimulation of the pleasure-centres of the brain never palls. Fire them in the right way, and boredom is neurochemically impossible. Its substrates are missing. Electrical stimulation of the mesolimbic dopamine system is more intensely rewarding than eating, drinking, and love-making; and it never gets in the slightest a bit tedious. It stays exhilarating. \n\nAdmittedly, Pearce cites no sources, and I could not find any relevant ones in a quick Google search. Do you know of any?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First of all, thank you for such a thorough comment.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Just because your personal, irrational bias in favor of humans makes you think this conclusion is horrible doesn&amp;#39;t mean it&amp;#39;s false. Sorry, but that&amp;#39;s the reality … Minorities don&amp;#39;t have human rights anyways. Bentham famously said, natural rights are nonsense upon stilts. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To clarify, I decided from the outset of this discussion that I want to ignore questions of how to justify an ethical theory if possible. That may seem impossible, since I carry the burden of proof of defining &amp;quot;bad&amp;quot; (so far, I have used a kind of shared intuitive repulsion), but definition and justification are not equivalent. Maybe ignoring justification questions is the main problem here — if you can show that it is, or provide an objective and proven justification for utilitarian morality, I will give you a delta.&lt;/p&gt;\n\n&lt;p&gt;I want to ignore justification questions because objections to utilitarianism based on an apparent lack of justification deserve their own post. Such objections could include the &lt;a href=\"https://en.wikipedia.org/wiki/Open-question_argument\"&gt;open-question argument&lt;/a&gt;, the &lt;a href=\"https://en.wikipedia.org/wiki/Fact%E2%80%93value_distinction\"&gt;fact-value distinction&lt;/a&gt;, and the &lt;a href=\"https://en.wikipedia.org/wiki/M%C3%BCnchhausen_trilemma\"&gt;Münchausen trilemma&lt;/a&gt; for starters. I will not try to argue here that they discredit utilitarianism — maybe in a later post.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But how does that make any sense? What basis are you using to determine the immorality?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;My feelings and intuition, unfortunately, plus the principle of informed consent whenever possible. Again, I would like to ignore the question of justification if I can. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The whole point of an ethical system like utilitarianism is to buck our (faulty) intuitions in favor of a more neutral &amp;amp; objective system of moral principles.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That would really be great, in my opinion. But the admittedly subjective awfulness of its consequences convinced me otherwise. If you want to bite the bullet on all of them, that is fine with me, but as of yet I cannot. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But as I said in my original post, this isn&amp;#39;t a real objection. This is just you arguing that you don&amp;#39;t like the conclusion, not that it&amp;#39;s invalid or contradictory. Having to bite a bullet doesn&amp;#39;t mean a ethical system is false.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What is a &amp;quot;real objection&amp;quot;? I suppose that a contradiction would count, which is pretty cool. However, I am curious what you mean by showing a conclusion to be &amp;quot;invalid,&amp;quot; as distinct from &amp;quot;contradictory.&amp;quot; I have assumed that reduction to intuitive absurdity can invalidate an ethical system, but if it cannot, what else can?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So your objection is no different than a homophobe getting upset that utilitarianism requires considering the happiness of gay people too. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;On the basis of feelings alone, yes; on that of informed consent, no. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;See, first you argue that when following utilitarianism, a majority must acquiesce to the will of a minority (the utility monster). Then, you also argue that utilitarianism leads to majority rule. These two arguments are mutually exclusive. They cannot both be valid arguments. Either one is false, or both are false.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If everyone&amp;#39;s happiness efficiency is the same, the majority is preferred; if the minority entity has a higher happiness efficiency than all members of the majority group combined, the minority is preferred. There is no contradiction here. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Imagine two ant philosophers talking to each other about the same question … I think humans are such a being! … I could support my feelings on this issue by pointing out how much stronger feelings, preferences, and experiences humans have than ants (presumably) do.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, that was response (5) in the utility monster section. I evidently did not rebut it well enough, so I will discuss it a bit further here. If I was an ant, then I feel like I would consider it unacceptable to sacrifice my colony to prevent a human&amp;#39;s sprained ankle. As a human, I would disagree right now due only to practical limitations. Evolution designed us to be species-centric, but technology is slowly allowing us to grow out of it and giving us the opportunity to care for other species as we become dominant. For example, I had an ant problem in my apartment and had to use a spray to kill them, but I wish I had a technology which could just drive them away with pheromones or something. Maybe there is a contradiction here, and if you can show that it is fundamental to the utility monster objection, I&amp;#39;ll either have to bite that bullet or give you a delta. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If there really are some creatures far above us in terms of experience, but if such beings really exist, then we absolutely should sacrifice the whole of humanity to make sure their ankle doesn&amp;#39;t get sprained … A true moral system shouldn&amp;#39;t always be self-serving, right?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Wow. I guess a true moral system shouldn&amp;#39;t always be self-serving…but I would like to imagine that we are worth more than an alien god&amp;#39;s sprained ankle. Maybe I have nothing more than intuition to go on here, but you are making utilitarianism a tough sell.&lt;/p&gt;\n\n&lt;p&gt;As an ironic tangent, under this reasoning divine command theory would logically follow from utilitarianism if theism was true. God is the ultimate utility monster. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I think that one important consideration here is the heuristic-related one mentioned in 6.3 above: having a rule against killing people is useful, and what any more complicated rule gained in flexibility, it might lose in sacrosanct-ness, making it more likely that immoral people or an immoral government would consider murder to be an option (see David Friedman on Schelling points).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I thought that the whole point of utilitarianism was not to have &amp;quot;sacrosanct rules&amp;quot; at all, but to do whatever produces the most happiness? Also, I said from the outset that I want to ignore practical considerations, which would include how immoral people or governments might misinterpret rules. If we can talk about practical considerations, several other objections to utilitarianism which I mentioned in my original post but have not defended here suddenly become relevant.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Not having forced organ transplants, while it may cause some individual in happiness (to the people who want the organs), it will cause societal happiness because people in general don&amp;#39;t have to worry about their organs being seized at any moment.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I responded to that objection in my original post, specifically the claim that &amp;quot;people would avoid hospitals if this were to happen in the real world, resulting in more suffering&amp;quot; and that adding stipulations to prevent people from knowing about it would be &amp;quot;unrealistic to the point of absurdity&amp;quot;:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Again, even if a situation is unrealistic, it is still a valid argument if we can imagine it. See rebuttal (2) to the utility monster responses.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;This argument is historically contingent, because it assumes that people will stay as they are:&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If you&amp;#39;re a utilitarian, it would be moral to implement this on the national scale. Therefore, it stops being unrealistic. Remember, it&amp;#39;s only an unrealistic scenario because we&amp;#39;re not purist utilitarians. However, if you&amp;#39;re an advocate of utilitarianism, you hope that one day most or all of us will be purist utilitarians.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That should be sufficient.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;See, it&amp;#39;s really convenient to just make up a fictional scenario where you can just incessantly stimulate the pleasure center of the brain, but in the real world, we know that&amp;#39;s not possible. Humans have a hedonistic treadmill and develop tolerances … it&amp;#39;s really easy to just make up some imaginary machine that violates our current understandings of psychology.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Really? My understanding was that &lt;a href=\"http://wireheading.com\"&gt;the brain does not acclimate to direct pleasure stimulation&lt;/a&gt;. Maybe I was misled by utilitarian philosopher David Pearce:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Unlike food, drink or sex, the experience of pleasure itself exhibits no tolerance, even though our innumerable objects of desire certainly do so. Thus we can eventually get bored of anything - with a single exception. Stimulation of the pleasure-centres of the brain never palls. Fire them in the right way, and boredom is neurochemically impossible. Its substrates are missing. Electrical stimulation of the mesolimbic dopamine system is more intensely rewarding than eating, drinking, and love-making; and it never gets in the slightest a bit tedious. It stays exhilarating. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Admittedly, Pearce cites no sources, and I could not find any relevant ones in a quick Google search. Do you know of any?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb5u3d", "score_hidden": false, "stickied": false, "created": 1492318473.0, "created_utc": 1492289673.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgagfds", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "omid_", "parent_id": "t1_dgadykm", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;As I described in the beginning of my post and several comments, my use of \"reducing to the absurd\" presupposes that you would find certain situations (e.g. enslaving humanity to a brain factory, saying that rape is justified, etc) immoral. That is why I used the language \"that we would consider unethical.\"\n\nBut how does that make any sense? What basis are you using to determine the immorality?\n\nThe whole point of an ethical system like utilitarianism is to buck our (faulty) intuitions in favor of a more neutral &amp; objective system of moral principles. So your objection is no different than a homophobe getting upset that utilitarianism requires considering the happiness of gay people too. Some people find homosexuality naturally perverse &amp; obscene, but it's through utilitarian reasoning (being gay doesn't actually hurt anyone) that we realize our moral perception of homophobia is flawed and we must actually embrace gay people and treat them justly.\n\n&gt;utility monster\n&gt;The tyranny of the majority deals with priorities under utilitarianism; that the happiness of a majority is prioritized over the human rights of a minority.\n\nI'm going to group these two together becaysw they're really just opposite sides of the same argument.\n\nSee, first you argue that when following utilitarianism, a majority must acquiesce to the will of a minority (the utility monster). Then, you also argue that utilitarianism leads to majority rule. These two arguments are mutually exclusive. They cannot both be valid arguments. Either one is false, or both are false.\n\nSo again, my arguments is as follows:\n\nFirst, the concept of a utility monster is that their preferences make our own mere human preferences trivial, meaning we must sacrifice ourselves to their wishes since, for example, a utility monster eating ice cream would get a trillion times more pleasure than a human would. But as I said in my original post, this isn't a real objection. This is just you arguing that you don't like the conclusion, not that it's invalid or contradictory. Having to bite a bullet doesn't mean a ethical system is false. To quote the consequentialist FAQ:\n\n&gt;&gt;7.6: Wouldn't utilitarianism mean if there was some monster or alien or something whose feelings and preferences were a gazillion times stronger than our own, that monster would have so much moral value that its mild inconveniences would be more morally important than the entire fate of humanity?\n\n&gt;&gt;Maybe.\n\n&gt;&gt;Imagine two ant philosophers talking to each other about the same question. “Imagine,\" they said, “some being with such intense consciousness, intellect, and emotion that it would be morally better to destroy an entire ant colony than to let that being suffer so much as a sprained ankle.\"\n\n&gt;&gt;But I think humans are such a being! I would rather see an entire ant colony destroyed than have a human suffer so much as a sprained ankle. And this isn't just human chauvinism either - I think I could support my feelings on this issue by pointing out how much stronger feelings, preferences, and experiences humans have than ants (presumably) do.\n\n&gt;&gt;I can't imagine a creature as far beyond us as we are beyond ants, but if such a creature existed I think it's possible that if I could imagine it, I would agree that its preferences were vastly more important than those of humans.\n\nIn my view, this is really no different than the homophobia example. Utilitarianism does not give humans a special status. If there really are some creatures far above us in terms of experience, and such beings really exist, then we absolutely should sacrifice the whole of humanity to make sure their ankle doesn't get sprained. Just because your personal, irrational bias in favor of humans makes you think this conclusion is horrible doesn't mean it's false. Sorry, but that's the reality. A true moral system shouldn't always be self-serving, right?\n\nAnd again, for the issue of majority rule, I'll quote the FAQ once more:\n\n&gt;&gt;7.2: Wouldn't utilitarianism lead to 51% of the population enslaving 49% of the population?\n\n&gt;&gt;The argument goes: it gives 51% of the population higher utility. And it only gives 49% of the population lower utility. Therefore, the majority benefits. Therefore, by utiltiarianism we should do it.\n\n&gt;&gt;This is a fundamental misunderstanding of utilitarianism. It doesn't say “do whatever makes the majority of people happier\", it says “do whatever increases the sum of happiness across people the most\".\n\n&gt;&gt;Suppose that ten people get together - nine well-fed Americans and one starving African. Each one has a candy. The well-fed Americans get +1 unit utility from eating a candy, but the starving African gets +10 units utility from eating a candy. The highest utility action is to give all ten candies to the starving African, for a total utility of +100.\n\n&gt;&gt;A person who doesn't understand utilitarianism might say “Why not have all the Americans agree to take the African's candy and divide it among them? Since there are 9 of them and only one of him, that means more people benefit.\" But in fact we see that that would only create +10 utility - much less than the first option.\n\n&gt;&gt;A person who thinks slavery would raise overall utility is making the same mistake. Sure, having a slave would be mildly useful to the master. But getting enslaved would be extremely unpleasant to the slave. Even though the majority of people “benefit\", the action is overall a very large net loss.\n\n&gt;&gt;(if you don't see why this is true, imagine I offered you a chance to live in either the real world, or a hypothetical world in which 51% of people are masters and 49% are slaves - with the caveat that you'll be a randomly selected person and might end up in either group. Would you prefer to go into the pro-slavery world? If not, you've admitted that that's not a “better\" world to live in.)\n\nBut more specific to your objection, again, you're assuming the falsehood of utilitarianism go argue against it. Minorities don't have human rights anyways. Bentham famously said, natural rights are nonsense upon stilts. So your argument is basically that \"utilitarianism is wrong because it violates such &amp; such non-utilitarian principle\". Well, duh, of course utilitarianism is going to violate your non-utilitarian principle. That's the whole point! How is that an argument against it???\n\n&gt;I addressed this in my original post. See the rebuttal in the \"tyranny of the majority\" section.\n\nSee the FAQ once again:\n\n&gt;&gt;7.5: Wouldn't utilitarianism lead to healthy people being killed to distribute their organs among people who needed organ transplants, since each person has a bunch of organs and so could save a bunch of lives?\n\n&gt;&gt;We'll start with the unsatsifying weaselish answers to this objection, which are nevertheless important. The first weaselish answer is that most people's organs aren't compatible and that most organ transplants don't take very well, so the calculation would be less obvious than \"I have two kidneys, so killing me could save two people who need kidney transplants.\" The second weaselish answer is that a properly utiltiarian society would solve the organ shortage long before this became necessary (see 8.3) and so this would never come up.\n\n&gt;&gt;But those answers, although true, don't really address the philosophical question here, which is whether you can just go around killing people willy-nilly to save other people's lives. I think that one important consideration here is the heuristic-related one mentioned in 6.3 above: having a rule against killing people is useful, and what any more complicated rule gained in flexibility, it might lose in sacrosanct-ness, making it more likely that immoral people or an immoral government would consider murder to be an option (see David Friedman on Schelling points).\n\n&gt;&gt;This is also the strongest argument one could make against killing the fat man in 4.5 above - but note that it still is a *consequentialist* argument and subject to discussion or refutation on consequentialist grounds.\n\nOnce more, your argument seems to just be \n\n1. Assume non-utilitarian moral value.\n2. Utilitarianism violates that moral value.\n3. Therefore utilitarianism is false.\n\nAnd again, utilitarianism is evidence-based since it requires assessment of consequences. Can you actually show, with evidence, that a world where people's organs are randomly or systematically taken away from them to give to others would actually result in maximizing happiness? Because I'm not seeing it. I think that would be a very fearful society. Not having forced organ transplants, while it may cause some individual in happiness (to the people who want the organs), it will cause societal happiness because people in general don't have to worry about their organs being seized at any moment.\n\n&gt;Correct. Stimulating the pleasure center of the brain can cause intense euphoria whether or not the person has the personal traits that I mentioned, which shows that those traits are not necessary for maximizing happiness. In some situations they help increase happiness, but in others they do not.\n\nSee, it's really convenient to just make up a fictional scenario where you can just incessantly stimulate the pleasure center of the brain, but in the real world, we know that's not possible. Humans have a hedonistic treadmill and develop tolerances. The best way to combat this is to obtain happiness from a variety of sources, not just shooting up heroin. Eventually, the amount of heroin required to get the same high as your first hit will kill you.\n\nSo it's really easy to just make up some imaginary machine that violates our current understandings of psychology. But I don't see how that has any relevance to the actual world we live in.\n\n", "edited": 1492274200.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;As I described in the beginning of my post and several comments, my use of &amp;quot;reducing to the absurd&amp;quot; presupposes that you would find certain situations (e.g. enslaving humanity to a brain factory, saying that rape is justified, etc) immoral. That is why I used the language &amp;quot;that we would consider unethical.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But how does that make any sense? What basis are you using to determine the immorality?&lt;/p&gt;\n\n&lt;p&gt;The whole point of an ethical system like utilitarianism is to buck our (faulty) intuitions in favor of a more neutral &amp;amp; objective system of moral principles. So your objection is no different than a homophobe getting upset that utilitarianism requires considering the happiness of gay people too. Some people find homosexuality naturally perverse &amp;amp; obscene, but it&amp;#39;s through utilitarian reasoning (being gay doesn&amp;#39;t actually hurt anyone) that we realize our moral perception of homophobia is flawed and we must actually embrace gay people and treat them justly.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;utility monster\nThe tyranny of the majority deals with priorities under utilitarianism; that the happiness of a majority is prioritized over the human rights of a minority.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m going to group these two together becaysw they&amp;#39;re really just opposite sides of the same argument.&lt;/p&gt;\n\n&lt;p&gt;See, first you argue that when following utilitarianism, a majority must acquiesce to the will of a minority (the utility monster). Then, you also argue that utilitarianism leads to majority rule. These two arguments are mutually exclusive. They cannot both be valid arguments. Either one is false, or both are false.&lt;/p&gt;\n\n&lt;p&gt;So again, my arguments is as follows:&lt;/p&gt;\n\n&lt;p&gt;First, the concept of a utility monster is that their preferences make our own mere human preferences trivial, meaning we must sacrifice ourselves to their wishes since, for example, a utility monster eating ice cream would get a trillion times more pleasure than a human would. But as I said in my original post, this isn&amp;#39;t a real objection. This is just you arguing that you don&amp;#39;t like the conclusion, not that it&amp;#39;s invalid or contradictory. Having to bite a bullet doesn&amp;#39;t mean a ethical system is false. To quote the consequentialist FAQ:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;7.6: Wouldn&amp;#39;t utilitarianism mean if there was some monster or alien or something whose feelings and preferences were a gazillion times stronger than our own, that monster would have so much moral value that its mild inconveniences would be more morally important than the entire fate of humanity?&lt;/p&gt;\n\n&lt;p&gt;Maybe.&lt;/p&gt;\n\n&lt;p&gt;Imagine two ant philosophers talking to each other about the same question. “Imagine,&amp;quot; they said, “some being with such intense consciousness, intellect, and emotion that it would be morally better to destroy an entire ant colony than to let that being suffer so much as a sprained ankle.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;But I think humans are such a being! I would rather see an entire ant colony destroyed than have a human suffer so much as a sprained ankle. And this isn&amp;#39;t just human chauvinism either - I think I could support my feelings on this issue by pointing out how much stronger feelings, preferences, and experiences humans have than ants (presumably) do.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t imagine a creature as far beyond us as we are beyond ants, but if such a creature existed I think it&amp;#39;s possible that if I could imagine it, I would agree that its preferences were vastly more important than those of humans.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In my view, this is really no different than the homophobia example. Utilitarianism does not give humans a special status. If there really are some creatures far above us in terms of experience, and such beings really exist, then we absolutely should sacrifice the whole of humanity to make sure their ankle doesn&amp;#39;t get sprained. Just because your personal, irrational bias in favor of humans makes you think this conclusion is horrible doesn&amp;#39;t mean it&amp;#39;s false. Sorry, but that&amp;#39;s the reality. A true moral system shouldn&amp;#39;t always be self-serving, right?&lt;/p&gt;\n\n&lt;p&gt;And again, for the issue of majority rule, I&amp;#39;ll quote the FAQ once more:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;7.2: Wouldn&amp;#39;t utilitarianism lead to 51% of the population enslaving 49% of the population?&lt;/p&gt;\n\n&lt;p&gt;The argument goes: it gives 51% of the population higher utility. And it only gives 49% of the population lower utility. Therefore, the majority benefits. Therefore, by utiltiarianism we should do it.&lt;/p&gt;\n\n&lt;p&gt;This is a fundamental misunderstanding of utilitarianism. It doesn&amp;#39;t say “do whatever makes the majority of people happier&amp;quot;, it says “do whatever increases the sum of happiness across people the most&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Suppose that ten people get together - nine well-fed Americans and one starving African. Each one has a candy. The well-fed Americans get +1 unit utility from eating a candy, but the starving African gets +10 units utility from eating a candy. The highest utility action is to give all ten candies to the starving African, for a total utility of +100.&lt;/p&gt;\n\n&lt;p&gt;A person who doesn&amp;#39;t understand utilitarianism might say “Why not have all the Americans agree to take the African&amp;#39;s candy and divide it among them? Since there are 9 of them and only one of him, that means more people benefit.&amp;quot; But in fact we see that that would only create +10 utility - much less than the first option.&lt;/p&gt;\n\n&lt;p&gt;A person who thinks slavery would raise overall utility is making the same mistake. Sure, having a slave would be mildly useful to the master. But getting enslaved would be extremely unpleasant to the slave. Even though the majority of people “benefit&amp;quot;, the action is overall a very large net loss.&lt;/p&gt;\n\n&lt;p&gt;(if you don&amp;#39;t see why this is true, imagine I offered you a chance to live in either the real world, or a hypothetical world in which 51% of people are masters and 49% are slaves - with the caveat that you&amp;#39;ll be a randomly selected person and might end up in either group. Would you prefer to go into the pro-slavery world? If not, you&amp;#39;ve admitted that that&amp;#39;s not a “better&amp;quot; world to live in.)&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But more specific to your objection, again, you&amp;#39;re assuming the falsehood of utilitarianism go argue against it. Minorities don&amp;#39;t have human rights anyways. Bentham famously said, natural rights are nonsense upon stilts. So your argument is basically that &amp;quot;utilitarianism is wrong because it violates such &amp;amp; such non-utilitarian principle&amp;quot;. Well, duh, of course utilitarianism is going to violate your non-utilitarian principle. That&amp;#39;s the whole point! How is that an argument against it???&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I addressed this in my original post. See the rebuttal in the &amp;quot;tyranny of the majority&amp;quot; section.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;See the FAQ once again:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;7.5: Wouldn&amp;#39;t utilitarianism lead to healthy people being killed to distribute their organs among people who needed organ transplants, since each person has a bunch of organs and so could save a bunch of lives?&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ll start with the unsatsifying weaselish answers to this objection, which are nevertheless important. The first weaselish answer is that most people&amp;#39;s organs aren&amp;#39;t compatible and that most organ transplants don&amp;#39;t take very well, so the calculation would be less obvious than &amp;quot;I have two kidneys, so killing me could save two people who need kidney transplants.&amp;quot; The second weaselish answer is that a properly utiltiarian society would solve the organ shortage long before this became necessary (see 8.3) and so this would never come up.&lt;/p&gt;\n\n&lt;p&gt;But those answers, although true, don&amp;#39;t really address the philosophical question here, which is whether you can just go around killing people willy-nilly to save other people&amp;#39;s lives. I think that one important consideration here is the heuristic-related one mentioned in 6.3 above: having a rule against killing people is useful, and what any more complicated rule gained in flexibility, it might lose in sacrosanct-ness, making it more likely that immoral people or an immoral government would consider murder to be an option (see David Friedman on Schelling points).&lt;/p&gt;\n\n&lt;p&gt;This is also the strongest argument one could make against killing the fat man in 4.5 above - but note that it still is a &lt;em&gt;consequentialist&lt;/em&gt; argument and subject to discussion or refutation on consequentialist grounds.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Once more, your argument seems to just be &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Assume non-utilitarian moral value.&lt;/li&gt;\n&lt;li&gt;Utilitarianism violates that moral value.&lt;/li&gt;\n&lt;li&gt;Therefore utilitarianism is false.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;And again, utilitarianism is evidence-based since it requires assessment of consequences. Can you actually show, with evidence, that a world where people&amp;#39;s organs are randomly or systematically taken away from them to give to others would actually result in maximizing happiness? Because I&amp;#39;m not seeing it. I think that would be a very fearful society. Not having forced organ transplants, while it may cause some individual in happiness (to the people who want the organs), it will cause societal happiness because people in general don&amp;#39;t have to worry about their organs being seized at any moment.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Correct. Stimulating the pleasure center of the brain can cause intense euphoria whether or not the person has the personal traits that I mentioned, which shows that those traits are not necessary for maximizing happiness. In some situations they help increase happiness, but in others they do not.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;See, it&amp;#39;s really convenient to just make up a fictional scenario where you can just incessantly stimulate the pleasure center of the brain, but in the real world, we know that&amp;#39;s not possible. Humans have a hedonistic treadmill and develop tolerances. The best way to combat this is to obtain happiness from a variety of sources, not just shooting up heroin. Eventually, the amount of heroin required to get the same high as your first hit will kill you.&lt;/p&gt;\n\n&lt;p&gt;So it&amp;#39;s really easy to just make up some imaginary machine that violates our current understandings of psychology. But I don&amp;#39;t see how that has any relevance to the actual world we live in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgagfds", "score_hidden": false, "stickied": false, "created": 1492273540.0, "created_utc": 1492244740.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": "", "user_reports": [], "id": "dgb6jad", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dgagfoh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Namely, intelligent people may suffer from schizoid or being unable to connect/relate to others due to others having lower intelligence. But that doesn't mean intelligence makes you unhappy. \n\nGood point. I apologize for using an elementary correlation-causation fallacy.\n\n&gt;But neither this [nor] high IQ seems to have unhappiness as a part of it intrinsically.\n\nYes. I was trying to argue that happiness does not require high IQ, that it is possible for a low IQ person to be happier than a high IQ person — I overstated my case by arguing that as a trend and not simply a possibility. Again, I apologize. \n\n&gt;My objection is not that it's unrealistic, but rather that it leaves out too many details to correctly assess that it actually results in maximizing happiness in the hypothetical world It comes from.\n\nHm…I would disagree given its near-omnipotent status. \n\n&gt;Bite the bullet and accept a harsh truth over a reassuring lie.\n\nOne could argue that moral nihilism is the \"harsh truth\" while utilitarianism is a \"reassuring lie,\" but that argument isn't my point here. As I said in [a previous comment](https://www.reddit.com/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/dgb5u3d/?utm_content=permalink&amp;utm_medium=front&amp;utm_source=reddit&amp;utm_name=changemyview), I do not want to discuss questions of how to justify an ethical theory here because those questions could raise several more objections to utilitarianism.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Namely, intelligent people may suffer from schizoid or being unable to connect/relate to others due to others having lower intelligence. But that doesn&amp;#39;t mean intelligence makes you unhappy. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Good point. I apologize for using an elementary correlation-causation fallacy.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But neither this [nor] high IQ seems to have unhappiness as a part of it intrinsically.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes. I was trying to argue that happiness does not require high IQ, that it is possible for a low IQ person to be happier than a high IQ person — I overstated my case by arguing that as a trend and not simply a possibility. Again, I apologize. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;My objection is not that it&amp;#39;s unrealistic, but rather that it leaves out too many details to correctly assess that it actually results in maximizing happiness in the hypothetical world It comes from.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Hm…I would disagree given its near-omnipotent status. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Bite the bullet and accept a harsh truth over a reassuring lie.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;One could argue that moral nihilism is the &amp;quot;harsh truth&amp;quot; while utilitarianism is a &amp;quot;reassuring lie,&amp;quot; but that argument isn&amp;#39;t my point here. As I said in &lt;a href=\"https://www.reddit.com/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/dgb5u3d/?utm_content=permalink&amp;amp;utm_medium=front&amp;amp;utm_source=reddit&amp;amp;utm_name=changemyview\"&gt;a previous comment&lt;/a&gt;, I do not want to discuss questions of how to justify an ethical theory here because those questions could raise several more objections to utilitarianism.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb6jad", "score_hidden": false, "stickied": false, "created": 1492319455.0, "created_utc": 1492290655.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgagfoh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "omid_", "parent_id": "t1_dgadykm", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Actually, in many cases it is counterproductive to happiness. Some studies have linked intelligence to depression and mental illness.\n\nOkay but you're missing a few confounding variables there. The article you linked says it's not actually intelligence that leads to depression, but rather the consequences of intelligence. Namely, intelligent people may suffer from [schizoid](https://en.m.wikipedia.org/wiki/Schizoid_personality_disorder) or being unable to connect/relate to others due to others having lower intelligence. But that doesn't mean intelligence makes you unhappy. That just means not having someone who is on the same level as you makes you unhappy. But if everyone was super intelligent, that wouldn't be a problem.\n\nIn contrast, the link you gave instead explains how lower intelligence leads to depression because they cannot perform jobs as well or are more likely to be unemployed, which means they are poorer and cannot buy as much happiness as rich people. So again, the problem is not inherent to having low IQ, but rather our society punishes people with low income, and low IQ people are more likely to be low income so they become unhappy. But neither this not high IQ seems to have unhappiness as a part of it intrinsically. \n\n&gt;While the AI Overlord is a helpful tool for explaining the scenarios, it is by no means necessary for the objections to hold. We could say instead that they should be government policy, or that people should behave to enact those situations on their own.\n\nMy objection is not that it's unrealistic, but rather that it leaves out too many details to correctly assess that it actually results in maximizing happiness in the hypothetical world It comes from.\n\nAnd yet again, even if it were true that it did maximize happiness, so what? Bite the bullet and accept a harsh truth over a reassuring lie. That doesn't falsify utilitarianism.", "edited": 1492245490.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Actually, in many cases it is counterproductive to happiness. Some studies have linked intelligence to depression and mental illness.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Okay but you&amp;#39;re missing a few confounding variables there. The article you linked says it&amp;#39;s not actually intelligence that leads to depression, but rather the consequences of intelligence. Namely, intelligent people may suffer from &lt;a href=\"https://en.m.wikipedia.org/wiki/Schizoid_personality_disorder\"&gt;schizoid&lt;/a&gt; or being unable to connect/relate to others due to others having lower intelligence. But that doesn&amp;#39;t mean intelligence makes you unhappy. That just means not having someone who is on the same level as you makes you unhappy. But if everyone was super intelligent, that wouldn&amp;#39;t be a problem.&lt;/p&gt;\n\n&lt;p&gt;In contrast, the link you gave instead explains how lower intelligence leads to depression because they cannot perform jobs as well or are more likely to be unemployed, which means they are poorer and cannot buy as much happiness as rich people. So again, the problem is not inherent to having low IQ, but rather our society punishes people with low income, and low IQ people are more likely to be low income so they become unhappy. But neither this not high IQ seems to have unhappiness as a part of it intrinsically. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;While the AI Overlord is a helpful tool for explaining the scenarios, it is by no means necessary for the objections to hold. We could say instead that they should be government policy, or that people should behave to enact those situations on their own.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;My objection is not that it&amp;#39;s unrealistic, but rather that it leaves out too many details to correctly assess that it actually results in maximizing happiness in the hypothetical world It comes from.&lt;/p&gt;\n\n&lt;p&gt;And yet again, even if it were true that it did maximize happiness, so what? Bite the bullet and accept a harsh truth over a reassuring lie. That doesn&amp;#39;t falsify utilitarianism.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgagfoh", "score_hidden": false, "stickied": false, "created": 1492273567.0, "created_utc": 1492244767.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgadykm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dgacy4e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Here's what I don't understand about this. Utilitarianism is itself an ethical view. So from where are you getting the idea that an AI would act in a way considered unethical? Unethical based on what?\n\nAs I described in the beginning of my post and several comments, my use of \"reducing to the absurd\" presupposes that you would find certain situations (e.g. enslaving humanity to a brain factory, saying that rape is justified, etc) immoral. That is why I used the language \"that we would consider unethical.\"\n\n&gt;The utility monster Is not a real thing that we know of.\n\nSee the rebuttals in my original post: 1) yes, it is; 2) it doesn't need to be because we can imagine what it would be like if a utility monster with fixed happiness did exist; 3) realistic utility monsters with changing happiness efficiencies are still a problem.\n\n&gt;Now, if we had a 6th person who is unhappy, then that person gets a -1 to contribute to the total.\n\nYou're right that negative utility is a good counterargument to the repugnant conclusion, as [I admitted in another comment](https://www.reddit.com/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/dga83b4).\n\n&gt;But is that actually maximizing happiness? Wouldn't it result in more happiness if everyone's preferences were maximized, not just a mere majority?\n\nThe tyranny of the majority deals with priorities under utilitarianism; that the happiness of a majority is prioritized over the human rights of a minority.\n\n&gt;Would you really think people would be more happy in a world where their organs could be seized at any moment? I don't think so. \n\nI addressed this in my original post. See the rebuttal in the \"tyranny of the majority\" section.\n\n&gt;this assumes that those other traits you mentioned aren't necessary for maximizing happiness.\n\nCorrect. Stimulating the pleasure center of the brain can cause intense euphoria whether or not the person has the personal traits that I mentioned, which shows that those traits are not necessary for maximizing happiness. In some situations they help increase happiness, but in others they do not.\n\n&gt;Intelligence is not necessary for happiness? If instead argue that greater intelligence can serve as a catalyst for more happiness than lesser intelligence. \n\nActually, in many cases it is counterproductive to happiness. Some studies have [linked intelligence to depression](http://brainblogger.com/2014/12/18/does-high-iq-increase-the-risk-of-depression-and-mental-disorders) and [mental illness](https://www.psychologytoday.com/blog/ending-addiction-good/201503/is-there-link-between-intelligence-and-mental-illness). Also, [\"depressive realism\"](https://www.psychologytoday.com/blog/hide-and-seek/201206/depressive-realism) is a phenomenon where depressed people think more realistically than normal people. Even if these studies do not represent the body of research, one can at least acknowledge that intelligence is not *necessary* for happiness. If you want a more commonsense view and have the time, Desiderius Erasmus wrote a satirical book called [*The Praise of Folly*](https://en.wikipedia.org/wiki/The_Praise_of_Folly) which explains how intelligence can make people unhappy.\n\n&gt;Again, more generally, a lot of your scenarios seem to involve some super powerful AI that can manipulate our society in ways that we know today would require incredible amounts of power and energy. Do you honestly believe there is not better way to harness/utilize that energy &amp; power to maximize happiness other than the specific methods you describe?\n\nWhile the AI Overlord is a helpful tool for explaining the scenarios, it is by no means necessary for the objections to hold. We could say instead that they should be government policy, or that people should behave to enact those situations on their own.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Here&amp;#39;s what I don&amp;#39;t understand about this. Utilitarianism is itself an ethical view. So from where are you getting the idea that an AI would act in a way considered unethical? Unethical based on what?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As I described in the beginning of my post and several comments, my use of &amp;quot;reducing to the absurd&amp;quot; presupposes that you would find certain situations (e.g. enslaving humanity to a brain factory, saying that rape is justified, etc) immoral. That is why I used the language &amp;quot;that we would consider unethical.&amp;quot;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The utility monster Is not a real thing that we know of.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;See the rebuttals in my original post: 1) yes, it is; 2) it doesn&amp;#39;t need to be because we can imagine what it would be like if a utility monster with fixed happiness did exist; 3) realistic utility monsters with changing happiness efficiencies are still a problem.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Now, if we had a 6th person who is unhappy, then that person gets a -1 to contribute to the total.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re right that negative utility is a good counterargument to the repugnant conclusion, as &lt;a href=\"https://www.reddit.com/r/changemyview/comments/65fjm3/cmv_classical_utilitarianism_is_an_untenable_and/dga83b4\"&gt;I admitted in another comment&lt;/a&gt;.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But is that actually maximizing happiness? Wouldn&amp;#39;t it result in more happiness if everyone&amp;#39;s preferences were maximized, not just a mere majority?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The tyranny of the majority deals with priorities under utilitarianism; that the happiness of a majority is prioritized over the human rights of a minority.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Would you really think people would be more happy in a world where their organs could be seized at any moment? I don&amp;#39;t think so. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I addressed this in my original post. See the rebuttal in the &amp;quot;tyranny of the majority&amp;quot; section.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;this assumes that those other traits you mentioned aren&amp;#39;t necessary for maximizing happiness.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Correct. Stimulating the pleasure center of the brain can cause intense euphoria whether or not the person has the personal traits that I mentioned, which shows that those traits are not necessary for maximizing happiness. In some situations they help increase happiness, but in others they do not.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Intelligence is not necessary for happiness? If instead argue that greater intelligence can serve as a catalyst for more happiness than lesser intelligence. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Actually, in many cases it is counterproductive to happiness. Some studies have &lt;a href=\"http://brainblogger.com/2014/12/18/does-high-iq-increase-the-risk-of-depression-and-mental-disorders\"&gt;linked intelligence to depression&lt;/a&gt; and &lt;a href=\"https://www.psychologytoday.com/blog/ending-addiction-good/201503/is-there-link-between-intelligence-and-mental-illness\"&gt;mental illness&lt;/a&gt;. Also, &lt;a href=\"https://www.psychologytoday.com/blog/hide-and-seek/201206/depressive-realism\"&gt;&amp;quot;depressive realism&amp;quot;&lt;/a&gt; is a phenomenon where depressed people think more realistically than normal people. Even if these studies do not represent the body of research, one can at least acknowledge that intelligence is not &lt;em&gt;necessary&lt;/em&gt; for happiness. If you want a more commonsense view and have the time, Desiderius Erasmus wrote a satirical book called &lt;a href=\"https://en.wikipedia.org/wiki/The_Praise_of_Folly\"&gt;&lt;em&gt;The Praise of Folly&lt;/em&gt;&lt;/a&gt; which explains how intelligence can make people unhappy.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Again, more generally, a lot of your scenarios seem to involve some super powerful AI that can manipulate our society in ways that we know today would require incredible amounts of power and energy. Do you honestly believe there is not better way to harness/utilize that energy &amp;amp; power to maximize happiness other than the specific methods you describe?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;While the AI Overlord is a helpful tool for explaining the scenarios, it is by no means necessary for the objections to hold. We could say instead that they should be government policy, or that people should behave to enact those situations on their own.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgadykm", "score_hidden": false, "stickied": false, "created": 1492266960.0, "created_utc": 1492238160.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgacy4e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "omid_", "parent_id": "t3_65fjm3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;If this would cause the AI to act in a manner we consider unethical, then classical utilitarianism cannot be a valid ethical principle.\n\nHere's what I don't understand about this. Utilitarianism is itself an ethical view. So from where are you getting the idea that an AI would act in a way considered unethical? Unethical based on what?\n\nThis is a common thread I've noticed in many criticisms of utilitarianism. It's almost as though the person making the argument basically assumes that utilitarianism is already false, and then shows examples of how utilitarianism goes against their own (undeclared) ethical view, then concludes that utitarianism is false. Do you see the problem with that?\n\nSo let's go through your objections:\n\n&gt;The utility monster\n\nIs not a real thing that we know of. But even so, it fails because of what I mentioned above. If maximizing happiness requires pleasing some monster, then such is the conclusion of utilitarianism. Why does that make it false? Because you don't like the conclusion?\n\nBut again, I stress that there's no evidence of actual utility monsters existing.\n\n&gt;The mere addition paradox\n\nYou say both of your conclusions are bad, but according to who/what?\n\nIn any case, I would argue that utilitarianism is not about hypothetical worlds that you have specifically designed to \"disprove\" utilitarianism. Instead, it is an ethical view based on what to do in our actual, real world. Maximizing happiness in our current world is obviously going to require a very different strategy when compared with some hypothetical world. So lets discuss the problems with both of your conceptions (total vs average).\n\nSo for total happiness, remember that utilitarianism is about maximizing happiness, not simply producing a marginally better world.\n\nSo let's say we have a world of 5 people and they are all unhappy. Maximizing happiness would mean all 5 are happy. Let's assign 1 unit of happiness to each one. So the total world happiness is +5. Now, if we had a 6th person who is unhappy, then that person gets a -1 to contribute to the total. So we'd actually only end up with +4 total net happiness even though we increased the population. I would argue that like money, there is marginal utility when it comes to happiness. Let's say a room only has 5 beds. 1 person would be happy, 2 people would be happy... all the way up to 5. But once you get 6 people, someone has to share a bed. Let's say sharing a bed makes someone less happy than if they sleep solo. So the basic idea behind this is that **resources are finite and we have a carrying capacity**. So eventually we get to the point where resources allotted to each person become so little that it passes over the hump of minimum sustainability. It's kinda complicated so let me use food as an example. If you have good to distribute, then each person needs a minimum amount of food to avoid starvation. Beyond that, the marginal happiness of increased food sharply declines. So the graph would look kinda like a chi squared distribution, with a big rise in utility at first, peaking, and then a decline in utility. I'd argue that food behaves in this way, where if you decrease the amount of food a person receives past the hump, their happiness starts decreasing tremendously.\n\nBasically, I'm trying to say that happiness has marginal utility and eventually there will be an optimal point where, say there are enough resources for n people, but n+1 people would result in a total decrease in happiness because the happiness gained from that extra person would not offset the happiness lost from the other people because they go past their peak and dip very far.\n\nAs for your average happiness scenario, let me put it this way. Think really carefully about the implications of a world where half the population is slaughtered. Is that really **maximizing** average happiness? Or is that simply producing a marginally better one? And how exactly are you killing half the population? With what means? If someone had the power to somehow measure exactly the half of the population that is below average, wouldn't they also have the power to make a much better average world without killing a bunch of people?\n\n\nRemember, utilitarianism is about opportunity cost too. Let's say I have many kids, and one of them is hungry. It's true that I could spend a thousand dollars to hire a hitman to murder the hungry one, and my (remaining) children's average happiness would go up. But it would go up even further if I had invested that thousand dollars to in food to give my hungry child instead to increase the average happiness. \n\n&gt;The tyranny of the majority\n\nBut is that actually maximizing happiness? Wouldn't it result in more happiness if everyone's preferences were maximized, not just a mere majority? \n\nWould you really think people would be more happy in a world where their organs could be seized at any moment? I don't think so. Often, these nightmare scenarios that people think of don't actually maximize happiness. The important test to always consider is \"would i really prefer to live in such a world? Would most people prefer to live in such a world?\" If the answer to both is no, I'd argue that the world isn't actually maximizing happiness. \n\n&gt;The superfluity of people\n\nAgain, this assumes that those other traits you mentioned aren't necessary for maximizing happiness. Is that true? Intelligence is not necessary for happiness? If instead argue that greater intelligence can serve as a catalyst for more happiness than lesser intelligence. And again, try out the test I described above. If most people would be unhappy if the switch from our world to the unintelligent one, can we really be maximizing happiness?\n\nAgain, more generally, a lot of your scenarios seem to involve some super powerful AI that can manipulate our society in ways that we know today would require incredible amounts of power and energy. Do you honestly believe there is not better way to harness/utilize that energy &amp; power to maximize happiness other than the specific methods you describe?\n\nFor more information (and to see where I have sources these ideas from), please check out the [consequentialist FAQ](https://web.archive.org/web/20161115073538/http://raikoth.net/consequentialism.html). It addresses a lot of your points with greater finesse than I have. Take care.", "edited": 1492272326.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If this would cause the AI to act in a manner we consider unethical, then classical utilitarianism cannot be a valid ethical principle.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Here&amp;#39;s what I don&amp;#39;t understand about this. Utilitarianism is itself an ethical view. So from where are you getting the idea that an AI would act in a way considered unethical? Unethical based on what?&lt;/p&gt;\n\n&lt;p&gt;This is a common thread I&amp;#39;ve noticed in many criticisms of utilitarianism. It&amp;#39;s almost as though the person making the argument basically assumes that utilitarianism is already false, and then shows examples of how utilitarianism goes against their own (undeclared) ethical view, then concludes that utitarianism is false. Do you see the problem with that?&lt;/p&gt;\n\n&lt;p&gt;So let&amp;#39;s go through your objections:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The utility monster&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Is not a real thing that we know of. But even so, it fails because of what I mentioned above. If maximizing happiness requires pleasing some monster, then such is the conclusion of utilitarianism. Why does that make it false? Because you don&amp;#39;t like the conclusion?&lt;/p&gt;\n\n&lt;p&gt;But again, I stress that there&amp;#39;s no evidence of actual utility monsters existing.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The mere addition paradox&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You say both of your conclusions are bad, but according to who/what?&lt;/p&gt;\n\n&lt;p&gt;In any case, I would argue that utilitarianism is not about hypothetical worlds that you have specifically designed to &amp;quot;disprove&amp;quot; utilitarianism. Instead, it is an ethical view based on what to do in our actual, real world. Maximizing happiness in our current world is obviously going to require a very different strategy when compared with some hypothetical world. So lets discuss the problems with both of your conceptions (total vs average).&lt;/p&gt;\n\n&lt;p&gt;So for total happiness, remember that utilitarianism is about maximizing happiness, not simply producing a marginally better world.&lt;/p&gt;\n\n&lt;p&gt;So let&amp;#39;s say we have a world of 5 people and they are all unhappy. Maximizing happiness would mean all 5 are happy. Let&amp;#39;s assign 1 unit of happiness to each one. So the total world happiness is +5. Now, if we had a 6th person who is unhappy, then that person gets a -1 to contribute to the total. So we&amp;#39;d actually only end up with +4 total net happiness even though we increased the population. I would argue that like money, there is marginal utility when it comes to happiness. Let&amp;#39;s say a room only has 5 beds. 1 person would be happy, 2 people would be happy... all the way up to 5. But once you get 6 people, someone has to share a bed. Let&amp;#39;s say sharing a bed makes someone less happy than if they sleep solo. So the basic idea behind this is that &lt;strong&gt;resources are finite and we have a carrying capacity&lt;/strong&gt;. So eventually we get to the point where resources allotted to each person become so little that it passes over the hump of minimum sustainability. It&amp;#39;s kinda complicated so let me use food as an example. If you have good to distribute, then each person needs a minimum amount of food to avoid starvation. Beyond that, the marginal happiness of increased food sharply declines. So the graph would look kinda like a chi squared distribution, with a big rise in utility at first, peaking, and then a decline in utility. I&amp;#39;d argue that food behaves in this way, where if you decrease the amount of food a person receives past the hump, their happiness starts decreasing tremendously.&lt;/p&gt;\n\n&lt;p&gt;Basically, I&amp;#39;m trying to say that happiness has marginal utility and eventually there will be an optimal point where, say there are enough resources for n people, but n+1 people would result in a total decrease in happiness because the happiness gained from that extra person would not offset the happiness lost from the other people because they go past their peak and dip very far.&lt;/p&gt;\n\n&lt;p&gt;As for your average happiness scenario, let me put it this way. Think really carefully about the implications of a world where half the population is slaughtered. Is that really &lt;strong&gt;maximizing&lt;/strong&gt; average happiness? Or is that simply producing a marginally better one? And how exactly are you killing half the population? With what means? If someone had the power to somehow measure exactly the half of the population that is below average, wouldn&amp;#39;t they also have the power to make a much better average world without killing a bunch of people?&lt;/p&gt;\n\n&lt;p&gt;Remember, utilitarianism is about opportunity cost too. Let&amp;#39;s say I have many kids, and one of them is hungry. It&amp;#39;s true that I could spend a thousand dollars to hire a hitman to murder the hungry one, and my (remaining) children&amp;#39;s average happiness would go up. But it would go up even further if I had invested that thousand dollars to in food to give my hungry child instead to increase the average happiness. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The tyranny of the majority&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But is that actually maximizing happiness? Wouldn&amp;#39;t it result in more happiness if everyone&amp;#39;s preferences were maximized, not just a mere majority? &lt;/p&gt;\n\n&lt;p&gt;Would you really think people would be more happy in a world where their organs could be seized at any moment? I don&amp;#39;t think so. Often, these nightmare scenarios that people think of don&amp;#39;t actually maximize happiness. The important test to always consider is &amp;quot;would i really prefer to live in such a world? Would most people prefer to live in such a world?&amp;quot; If the answer to both is no, I&amp;#39;d argue that the world isn&amp;#39;t actually maximizing happiness. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The superfluity of people&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Again, this assumes that those other traits you mentioned aren&amp;#39;t necessary for maximizing happiness. Is that true? Intelligence is not necessary for happiness? If instead argue that greater intelligence can serve as a catalyst for more happiness than lesser intelligence. And again, try out the test I described above. If most people would be unhappy if the switch from our world to the unintelligent one, can we really be maximizing happiness?&lt;/p&gt;\n\n&lt;p&gt;Again, more generally, a lot of your scenarios seem to involve some super powerful AI that can manipulate our society in ways that we know today would require incredible amounts of power and energy. Do you honestly believe there is not better way to harness/utilize that energy &amp;amp; power to maximize happiness other than the specific methods you describe?&lt;/p&gt;\n\n&lt;p&gt;For more information (and to see where I have sources these ideas from), please check out the &lt;a href=\"https://web.archive.org/web/20161115073538/http://raikoth.net/consequentialism.html\"&gt;consequentialist FAQ&lt;/a&gt;. It addresses a lot of your points with greater finesse than I have. Take care.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgacy4e", "score_hidden": false, "stickied": false, "created": 1492264700.0, "created_utc": 1492235900.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": "", "user_reports": [], "id": "dgag2bj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DCarrier", "parent_id": "t3_65fjm3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; The utility monster: If some being can turn resources into happiness more efficiently than a person or group of people, then we should give all resources to that being and none to the person or group.\n\nImagine there are two charities that help blind people. One trains guide dogs for $50,000 each, and helps mitigate the problem. The other performs cheap surgery and prevents blindness in Africa for around $25 each. Should we donate to both? Should we just donate to the second one?\n\nI'd say it's pretty obvious we should only donate to the second until they have more money than they know what to do with. And when we're done with that, we still can probably find a lot more places to donate before we can even consider donating to the first. But a lot of people think we should donate to both. I think that's the same sort of problem. It feels wrong to just donate to one charity for the same reason that it feels wrong to just help the utility monster. But that doesn't mean that it is wrong.\n\n&gt; If maximizing total happiness is good, then we should increase the population infinitely, but if maximizing average happiness is good, we should kill everyone with less-than-average happiness until only the happiest person is left. Both are bad.\n\nSuppose that 100 billion people lived so far. There's an epidemic of a disease that causes infertility. We could just let it happen and let that be that, or we can stop the disease and let humanity continue, increasing the total number of people that will ever live. Should we stop the disease? If so, it's clear that more people one after another is better than fewer. And if that's true, why not more people at the same time?\n\n&gt; The tyranny of the majority: A majority group is justified in doing any awful thing that they want to a minority group. The \"organ transplant scenario\" is one example.\n\nSuppose you can create a government that will provide roads, fight crime, give a social safety net to people, etc. But in order for it to do this they will have to take money from people, some of whom will not agree with the system. Some people will get arrested for avoiding it. And fighting crime isn't perfect. Some people will get hurt in the process. But the system helps more people than it hurts. Should we do it? Or must we ensure that every change in society is a Pareto improvement, and then stick to anarchy because a Pareto improvement is effectively impossible in a sufficiently large group?\n\nConsider the organ transplant scenario. Imagine there's two countries you can live in. They're mostly pretty similar, but one of them does not allow people to be murdered for organs. As a result, you have a one in 200,000 chance of dying of organ failure. In the other, there's a lottery where some people will randomly be killed and their organs will be harvested. As a result, you have a one in a million chance of being killed by this. If all you care about is not dying, you're better off in the second country. If everyone picks that country because they're personally better off, then in what way is it worse?\n\n&gt; The superfluity of people: Letting people live and reproduce naturally is inefficient for maximizing happiness. Instead, beings should be mass-produced which experience happiness but lack any non-happiness-related traits like intelligence, senses, creativity, bodies, etc.\n\nImagine how happy you'd be if you could have the maximum amount of happiness. I really don't see why it's worth giving that up for non-happiness things. Especially bodies. You could support a population orders of magnitude higher if you don't worry about those. And that's just as good as saving the universe over and over to make the world last orders of magnitude longer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The utility monster: If some being can turn resources into happiness more efficiently than a person or group of people, then we should give all resources to that being and none to the person or group.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Imagine there are two charities that help blind people. One trains guide dogs for $50,000 each, and helps mitigate the problem. The other performs cheap surgery and prevents blindness in Africa for around $25 each. Should we donate to both? Should we just donate to the second one?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d say it&amp;#39;s pretty obvious we should only donate to the second until they have more money than they know what to do with. And when we&amp;#39;re done with that, we still can probably find a lot more places to donate before we can even consider donating to the first. But a lot of people think we should donate to both. I think that&amp;#39;s the same sort of problem. It feels wrong to just donate to one charity for the same reason that it feels wrong to just help the utility monster. But that doesn&amp;#39;t mean that it is wrong.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If maximizing total happiness is good, then we should increase the population infinitely, but if maximizing average happiness is good, we should kill everyone with less-than-average happiness until only the happiest person is left. Both are bad.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Suppose that 100 billion people lived so far. There&amp;#39;s an epidemic of a disease that causes infertility. We could just let it happen and let that be that, or we can stop the disease and let humanity continue, increasing the total number of people that will ever live. Should we stop the disease? If so, it&amp;#39;s clear that more people one after another is better than fewer. And if that&amp;#39;s true, why not more people at the same time?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The tyranny of the majority: A majority group is justified in doing any awful thing that they want to a minority group. The &amp;quot;organ transplant scenario&amp;quot; is one example.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Suppose you can create a government that will provide roads, fight crime, give a social safety net to people, etc. But in order for it to do this they will have to take money from people, some of whom will not agree with the system. Some people will get arrested for avoiding it. And fighting crime isn&amp;#39;t perfect. Some people will get hurt in the process. But the system helps more people than it hurts. Should we do it? Or must we ensure that every change in society is a Pareto improvement, and then stick to anarchy because a Pareto improvement is effectively impossible in a sufficiently large group?&lt;/p&gt;\n\n&lt;p&gt;Consider the organ transplant scenario. Imagine there&amp;#39;s two countries you can live in. They&amp;#39;re mostly pretty similar, but one of them does not allow people to be murdered for organs. As a result, you have a one in 200,000 chance of dying of organ failure. In the other, there&amp;#39;s a lottery where some people will randomly be killed and their organs will be harvested. As a result, you have a one in a million chance of being killed by this. If all you care about is not dying, you&amp;#39;re better off in the second country. If everyone picks that country because they&amp;#39;re personally better off, then in what way is it worse?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The superfluity of people: Letting people live and reproduce naturally is inefficient for maximizing happiness. Instead, beings should be mass-produced which experience happiness but lack any non-happiness-related traits like intelligence, senses, creativity, bodies, etc.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Imagine how happy you&amp;#39;d be if you could have the maximum amount of happiness. I really don&amp;#39;t see why it&amp;#39;s worth giving that up for non-happiness things. Especially bodies. You could support a population orders of magnitude higher if you don&amp;#39;t worry about those. And that&amp;#39;s just as good as saving the universe over and over to make the world last orders of magnitude longer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgag2bj", "score_hidden": false, "stickied": false, "created": 1492272471.0, "created_utc": 1492243671.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": "", "user_reports": [], "id": "dgajzqj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "GnosticGnome", "parent_id": "t1_dgabas7", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;What you just described is a common objection to utilitarianism: if we cannot practically measure utility, then it is useless to try to increase it. How would we tell if we were succeeding or failing? We couldn't. If we legitimately cannot tell success from failure, then why try? By avoiding the objections this way, you might be throwing the baby (any real-world application of utilitarianism) out with the bathwater (the objections).\n\nI think it's a clear limitation of Utilitarianism, but it's far from impossible to observe or estimate utility.  There are some useful surrogate quantifiable measures (eg longevity), and qualitative comparisons are useful anyway.  It's not useless, it's just necessary to use caution.  How do I discard most real-world application of utilitarianism this way?  I can still derive highly useful results from it such as \"I can reject anti-natalist theories\", \"The goal of a government should be to promote residents' happiness rather than promote the ruler's wealth, promote the citizens' wellbeing while ignoring the noncitizen residents,  promote morality even when it impinges on apparent happiness, etc.\"  \"Animal welfare is highly important even for animals that aren't useful to people\"  \"We can measure the morality of taxation simply by looking at its impacts, with no need to ask about the nonaggression principle, the actual social contract people agreed to, any divinely-ordained principles, etc\"\n\n&gt;A reasonable utilitarian would recognize that the fact that it always happened before does not mean that it will always happen again.\n\nNo, but using Bayesian reasoning we can derive the fact that if you are a thinker who believes with apparently excellent evidence and apparently compelling reasoning that you have found an exception, you are much more likely wrong than correct.\n\n&gt;We can imagine situations where it would increase happiness to cause a minority group suffering - for example, if torturing a small group of people for their entire life would increase everyone else's happiness proportionally.\n\nWe can, and many people have historically believed they've found such situations, with apparently excellent evidence and apparently sound theories, and the vast majority have been wrong.  That's the Bayesian prior.\n\n&gt;Why? If rights conflict with maximizing utility, a Utilitarian is obligated to say that violating rights is good - otherwise they are not a utilitarian.\n\nA Utilitarian gets a different definition and approach to rights than any other type of thinker.  A Utilitarian's rights are determined by historical data and Bayesian reasoning by looking at what things when infringed cause much more harm than one would otherwise expect - they are not a priori as in other systems.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What you just described is a common objection to utilitarianism: if we cannot practically measure utility, then it is useless to try to increase it. How would we tell if we were succeeding or failing? We couldn&amp;#39;t. If we legitimately cannot tell success from failure, then why try? By avoiding the objections this way, you might be throwing the baby (any real-world application of utilitarianism) out with the bathwater (the objections).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think it&amp;#39;s a clear limitation of Utilitarianism, but it&amp;#39;s far from impossible to observe or estimate utility.  There are some useful surrogate quantifiable measures (eg longevity), and qualitative comparisons are useful anyway.  It&amp;#39;s not useless, it&amp;#39;s just necessary to use caution.  How do I discard most real-world application of utilitarianism this way?  I can still derive highly useful results from it such as &amp;quot;I can reject anti-natalist theories&amp;quot;, &amp;quot;The goal of a government should be to promote residents&amp;#39; happiness rather than promote the ruler&amp;#39;s wealth, promote the citizens&amp;#39; wellbeing while ignoring the noncitizen residents,  promote morality even when it impinges on apparent happiness, etc.&amp;quot;  &amp;quot;Animal welfare is highly important even for animals that aren&amp;#39;t useful to people&amp;quot;  &amp;quot;We can measure the morality of taxation simply by looking at its impacts, with no need to ask about the nonaggression principle, the actual social contract people agreed to, any divinely-ordained principles, etc&amp;quot;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A reasonable utilitarian would recognize that the fact that it always happened before does not mean that it will always happen again.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, but using Bayesian reasoning we can derive the fact that if you are a thinker who believes with apparently excellent evidence and apparently compelling reasoning that you have found an exception, you are much more likely wrong than correct.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We can imagine situations where it would increase happiness to cause a minority group suffering - for example, if torturing a small group of people for their entire life would increase everyone else&amp;#39;s happiness proportionally.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;We can, and many people have historically believed they&amp;#39;ve found such situations, with apparently excellent evidence and apparently sound theories, and the vast majority have been wrong.  That&amp;#39;s the Bayesian prior.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Why? If rights conflict with maximizing utility, a Utilitarian is obligated to say that violating rights is good - otherwise they are not a utilitarian.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A Utilitarian gets a different definition and approach to rights than any other type of thinker.  A Utilitarian&amp;#39;s rights are determined by historical data and Bayesian reasoning by looking at what things when infringed cause much more harm than one would otherwise expect - they are not a priori as in other systems.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgajzqj", "score_hidden": false, "stickied": false, "created": 1492284711.0, "created_utc": 1492255911.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgabas7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dgaapba", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;What if we add the (almost certainly correct) belief to Utilitarianism that attempts to measure utility are difficult and error prone?\n\nWhat you just described is a common objection to utilitarianism: if we cannot practically measure utility, then it is useless to try to increase it. How would we tell if we were succeeding or failing? We couldn't. If we legitimately cannot tell success from failure, then why try? By avoiding the objections this way, you might be throwing the baby (any real-world application of utilitarianism) out with the bathwater (the objections).\n\n&gt;It eliminates the tyranny of the majority issues because every real world attempt to maximize utility of the majority by infringing on minority rights has led to increased suffering.\n\nA reasonable utilitarian would recognize that the fact that it always happened before does not mean that it will always happen again. We can imagine situations where it would increase happiness to cause a minority group suffering - for example, if torturing a small group of people for their entire life would increase everyone else's happiness proportionally.\n\n&gt;Any reasonable Utilitarians should conclude that if they've done their calculations correctly and they point to rights violations, their calculations are likely wrong anyway.\n\nWhy? If rights conflict with maximizing utility, a Utilitarian is obligated to say that violating rights is good - otherwise they are not a utilitarian.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What if we add the (almost certainly correct) belief to Utilitarianism that attempts to measure utility are difficult and error prone?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What you just described is a common objection to utilitarianism: if we cannot practically measure utility, then it is useless to try to increase it. How would we tell if we were succeeding or failing? We couldn&amp;#39;t. If we legitimately cannot tell success from failure, then why try? By avoiding the objections this way, you might be throwing the baby (any real-world application of utilitarianism) out with the bathwater (the objections).&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It eliminates the tyranny of the majority issues because every real world attempt to maximize utility of the majority by infringing on minority rights has led to increased suffering.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A reasonable utilitarian would recognize that the fact that it always happened before does not mean that it will always happen again. We can imagine situations where it would increase happiness to cause a minority group suffering - for example, if torturing a small group of people for their entire life would increase everyone else&amp;#39;s happiness proportionally.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Any reasonable Utilitarians should conclude that if they&amp;#39;ve done their calculations correctly and they point to rights violations, their calculations are likely wrong anyway.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Why? If rights conflict with maximizing utility, a Utilitarian is obligated to say that violating rights is good - otherwise they are not a utilitarian.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgabas7", "score_hidden": false, "stickied": false, "created": 1492261358.0, "created_utc": 1492232558.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaapba", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GnosticGnome", "parent_id": "t3_65fjm3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "What if we add the (almost certainly correct) belief to Utilitarianism that attempts to measure utility are difficult and error prone?\n\nThis eliminates the standardl Utility Monster conundrum because we would be unable to recognize one.  It eliminates the addition paradox because we would recognize that utility can go negative but can't guess whose in particular is negative beyond permitting suicide or euthanasia under some rare circumstances.\n\nIt eliminates the tyranny of the majority issues because every real world attempt to maximize utility of the majority by infringing on minority rights has led to increased suffering.  Any reasonable Utilitarians should conclude that if they've done their calculations correctly and they point to rights violations, their calculations are likely wrong anyway.\n\nAs for neuroblobs, we couldn't tell their utility from humans.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What if we add the (almost certainly correct) belief to Utilitarianism that attempts to measure utility are difficult and error prone?&lt;/p&gt;\n\n&lt;p&gt;This eliminates the standardl Utility Monster conundrum because we would be unable to recognize one.  It eliminates the addition paradox because we would recognize that utility can go negative but can&amp;#39;t guess whose in particular is negative beyond permitting suicide or euthanasia under some rare circumstances.&lt;/p&gt;\n\n&lt;p&gt;It eliminates the tyranny of the majority issues because every real world attempt to maximize utility of the majority by infringing on minority rights has led to increased suffering.  Any reasonable Utilitarians should conclude that if they&amp;#39;ve done their calculations correctly and they point to rights violations, their calculations are likely wrong anyway.&lt;/p&gt;\n\n&lt;p&gt;As for neuroblobs, we couldn&amp;#39;t tell their utility from humans.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaapba", "score_hidden": false, "stickied": false, "created": 1492260292.0, "created_utc": 1492231492.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": "", "user_reports": [], "id": "dga792u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t3_65fjm3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "/u/GregConan (OP) has awarded 2 deltas in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [**here**](/r/DeltaLog/comments/65h05i), in /r/DeltaLog.\n\nPlease note that a change of view [doesn't necessarily mean a reversal](https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F), or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)", "edited": 1492227103.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/GregConan\"&gt;/u/GregConan&lt;/a&gt; (OP) has awarded 2 deltas in this post.&lt;/p&gt;\n\n&lt;p&gt;All comments that earned deltas (from OP or other users) are listed &lt;a href=\"/r/DeltaLog/comments/65h05i\"&gt;&lt;strong&gt;here&lt;/strong&gt;&lt;/a&gt;, in &lt;a href=\"/r/DeltaLog\"&gt;/r/DeltaLog&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Please note that a change of view &lt;a href=\"https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F\"&gt;doesn&amp;#39;t necessarily mean a reversal&lt;/a&gt;, or that the conversation has ended.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dga792u", "score_hidden": false, "stickied": false, "created": 1492254583.0, "created_utc": 1492225783.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65fjm3", "likes": null, "replies": "", "user_reports": [], "id": "dgbqzq8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GregConan", "parent_id": "t1_dgajuo5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sorry about that...how should I change it? Should I just remove the extra formatting?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry about that...how should I change it? Should I just remove the extra formatting?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbqzq8", "score_hidden": false, "stickied": false, "created": 1492350404.0, "created_utc": 1492321604.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgajuo5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "londonagain", "parent_id": "t3_65fjm3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Idk if this is the place to post this, but your tables are completely screwing up how the post is displayed. It's nearly unreadable for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Idk if this is the place to post this, but your tables are completely screwing up how the post is displayed. It&amp;#39;s nearly unreadable for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgajuo5", "score_hidden": false, "stickied": false, "created": 1492284315.0, "created_utc": 1492255515.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]