[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I consider myself a strong noninterventionist and I believe the United States should only go to war if America or a NATO ally are attacked or face an imminent and real threat of attack. I hold this view strongly but the main topic I want to debate is the War on Terror, because I have studied the subject and do not see any reason why we should still be doing drone strikes, air strikes, or have any soldiers stationed in the Middle East, Africa, Afghanistan, and Pakistan. But I do consider there must be some genuine reasons why this war is still being waged. While it&amp;#39;s possible that the military-industrial complex has a lot of power and influence, I am willing to accept that idea that some high ranking military and politicians in the US have good faith reasons for prosecuting the war on terror, but I do not understand what could possibly be gained at this point, and I welcome any solid evidence that the War on Terror has made us safer, although presently I do not see it. &lt;/p&gt;\n\n&lt;p&gt;To change my view, I would want compelling arguments and evidence that 1) The War on Terror has yielded results in preventing terrorist attacks on American soil and 2) Intervention in Afghanistan, Syria, Iraq, Yemen, Somalia, Pakistan, and Libya still can yield positive results for the United States, not just for people on top to make money but for the American people, such as being safer or a better global economy.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d like to start my opening argument by looking at the US invasion of Afghanistan. After 9/11, a clear goal was outlined: We wanted to capture or kill bin Laden and his al-Queda fighters, and deny al-Queda a safe haven to operate in Afghanistan. The Taliban shielded al-Queda which was the cause for invasion.&lt;/p&gt;\n\n&lt;p&gt;But think of the War on Terror as a battle against cancer. Say it starts in an organ that can be either be operated on or removed, like testicular cancer, but now we&amp;#39;re still trying to remove tumors from the testicles even though the cancer has metastasized to the brain, lungs, liver, and stomach (Iraq, Syria, Libya, Yemen, countries don&amp;#39;t actually correspond with organs it&amp;#39;s just an analogy).&lt;/p&gt;\n\n&lt;p&gt;Since al-queda now has multiple safe havens in many different countries, what can still be gained by occupying Afghanistan? Even if Afghanistan could be completely pacified, we still face al-Queda thriving in all of these other countries.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d also question the efficacy of drone strikes and air strikes in all 7 countries the US is operating, because I think radical ideology doesn&amp;#39;t exist in a vacuum. It&amp;#39;s not as if there are people willing to be terrorists and people who aren&amp;#39;t and it&amp;#39;s black and white. I believe bombing promotes animosity against the US, so every strike which kills a terrorist has a potential to create another if that strike ends up killing some civilians, which is often. &lt;/p&gt;\n\n&lt;p&gt;Finally, it seems to me that the main threat after 9/11 are the terrorists who are already here or who are being radicalized online. If you look at the San Bernardino shooters, Nidal Hassan, the Times Square bomber, the Boston bombers, etc., you find that all of these people are have become radicalized and are acting alone. Daesh (ISIS, I prefer using Daesh as the name denies them legitimacy and that is what my Arabic friends call it) is just out there saying &amp;quot;hey, fundamentalist Muslims in America, go kill someone&amp;quot;, but blowing them up in Syria doesn&amp;#39;t really deradicalize anyone in America or prevent these lone wolf attacks. It seems to me if some of the money used on air strikes and occupation was instead spent giving more resources to law enforcement at home, we&amp;#39;d be better off. &lt;/p&gt;\n\n&lt;p&gt;Do you think we would have faced more attacks if we had not been intervening in all of these countries? Do you think there is a good reason to still be in Afghanistan when al-Queda has so many safe havens now (and al-Queda is getting American guns in Syria since we armed &amp;quot;rebels&amp;quot; who we had no idea who they were). &lt;/p&gt;\n\n&lt;p&gt;I really would love to see some proof or a good argument of how the War on Terror can still be beneficial, and that it has accomplished anything or saved American lives. I am a cynic but I don&amp;#39;t think everyone involved is just about money and imperialism, there must be good faith motivations and not everyone can be this incompetent, so what am I missing that the War on Terror has achieved? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I consider myself a strong noninterventionist and I believe the United States should only go to war if America or a NATO ally are attacked or face an imminent and real threat of attack. I hold this view strongly but the main topic I want to debate is the War on Terror, because I have studied the subject and do not see any reason why we should still be doing drone strikes, air strikes, or have any soldiers stationed in the Middle East, Africa, Afghanistan, and Pakistan. But I do consider there must be some genuine reasons why this war is still being waged. While it's possible that the military-industrial complex has a lot of power and influence, I am willing to accept that idea that some high ranking military and politicians in the US have good faith reasons for prosecuting the war on terror, but I do not understand what could possibly be gained at this point, and I welcome any solid evidence that the War on Terror has made us safer, although presently I do not see it. \n\nTo change my view, I would want compelling arguments and evidence that 1) The War on Terror has yielded results in preventing terrorist attacks on American soil and 2) Intervention in Afghanistan, Syria, Iraq, Yemen, Somalia, Pakistan, and Libya still can yield positive results for the United States, not just for people on top to make money but for the American people, such as being safer or a better global economy.\n\nI'd like to start my opening argument by looking at the US invasion of Afghanistan. After 9/11, a clear goal was outlined: We wanted to capture or kill bin Laden and his al-Queda fighters, and deny al-Queda a safe haven to operate in Afghanistan. The Taliban shielded al-Queda which was the cause for invasion.\n\nBut think of the War on Terror as a battle against cancer. Say it starts in an organ that can be either be operated on or removed, like testicular cancer, but now we're still trying to remove tumors from the testicles even though the cancer has metastasized to the brain, lungs, liver, and stomach (Iraq, Syria, Libya, Yemen, countries don't actually correspond with organs it's just an analogy).\n\nSince al-queda now has multiple safe havens in many different countries, what can still be gained by occupying Afghanistan? Even if Afghanistan could be completely pacified, we still face al-Queda thriving in all of these other countries.\n\nI'd also question the efficacy of drone strikes and air strikes in all 7 countries the US is operating, because I think radical ideology doesn't exist in a vacuum. It's not as if there are people willing to be terrorists and people who aren't and it's black and white. I believe bombing promotes animosity against the US, so every strike which kills a terrorist has a potential to create another if that strike ends up killing some civilians, which is often. \n\nFinally, it seems to me that the main threat after 9/11 are the terrorists who are already here or who are being radicalized online. If you look at the San Bernardino shooters, Nidal Hassan, the Times Square bomber, the Boston bombers, etc., you find that all of these people are have become radicalized and are acting alone. Daesh (ISIS, I prefer using Daesh as the name denies them legitimacy and that is what my Arabic friends call it) is just out there saying \"hey, fundamentalist Muslims in America, go kill someone\", but blowing them up in Syria doesn't really deradicalize anyone in America or prevent these lone wolf attacks. It seems to me if some of the money used on air strikes and occupation was instead spent giving more resources to law enforcement at home, we'd be better off. \n\nDo you think we would have faced more attacks if we had not been intervening in all of these countries? Do you think there is a good reason to still be in Afghanistan when al-Queda has so many safe havens now (and al-Queda is getting American guns in Syria since we armed \"rebels\" who we had no idea who they were). \n\nI really would love to see some proof or a good argument of how the War on Terror can still be beneficial, and that it has accomplished anything or saved American lives. I am a cynic but I don't think everyone involved is just about money and imperialism, there must be good faith motivations and not everyone can be this incompetent, so what am I missing that the War on Terror has achieved? ", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65idzp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 104, "report_reasons": null, "author": "xyanon36", "saved": false, "mod_reports": [], "name": "t3_65idzp", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/65idzp/cmv_america_lost_the_war_on_terror_badly/", "num_reports": null, "locked": false, "stickied": false, "created": 1492279508.0, "url": "https://www.reddit.com/r/changemyview/comments/65idzp/cmv_america_lost_the_war_on_terror_badly/", "author_flair_text": null, "quarantine": false, "title": "CMV: America Lost the War on Terror, Badly", "created_utc": 1492250708.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 40, "visited": false, "subreddit_type": "public", "ups": 104}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": "", "user_reports": [], "id": "dgal2x1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "AurelianoTampa", "parent_id": "t1_dgakd73", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;do you think destroying a pro-terrorist government but the result being a failed state in which terrorists operate freely still counts as fulfillment of that goal?\n\n[I don't think that it's failing to achieve their goals](https://imgflip.com/i/1nalgj). Sure that isn't the ideal outcome - but assuming we know the terrorists are there, and have the ability to counter them, then it still manages to attain the goals presented by the government (keeping terrorism contained and protecting American interests). \n\nAgain:\n\n&gt;Your title claimed that \"America lost the war on terror badly,\" and your OP asked if it had \"accomplished anything.\" After reviewing the stated goals and objectives of the WoT, and seeing that the majority have been accomplished, can you still maintain that view?", "edited": 1492267675.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;do you think destroying a pro-terrorist government but the result being a failed state in which terrorists operate freely still counts as fulfillment of that goal?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgflip.com/i/1nalgj\"&gt;I don&amp;#39;t think that it&amp;#39;s failing to achieve their goals&lt;/a&gt;. Sure that isn&amp;#39;t the ideal outcome - but assuming we know the terrorists are there, and have the ability to counter them, then it still manages to attain the goals presented by the government (keeping terrorism contained and protecting American interests). &lt;/p&gt;\n\n&lt;p&gt;Again:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Your title claimed that &amp;quot;America lost the war on terror badly,&amp;quot; and your OP asked if it had &amp;quot;accomplished anything.&amp;quot; After reviewing the stated goals and objectives of the WoT, and seeing that the majority have been accomplished, can you still maintain that view?&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgal2x1", "score_hidden": false, "stickied": false, "created": 1492287497.0, "created_utc": 1492258697.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbjpu3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SeanACarlos", "parent_id": "t1_dgakd73", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Ideally the failed state learns the error of its ways and improves.\n\nOr it never does. In the case it is never forced to learn who is to say the state is failed? By who's measure is a state a failure? Not the people of the state themselves. Surely no.\n\nThe people of the \"failed\" state will never admit they are a failure. They would rather leave the country to prove it a failure if  that were the case. Migration happens a lot. It is a normal part of being a human.\n\nBut it is hard to be a state with everyone dead of electromagnetic waves beamed from offshore sources. We can stop any regime dead in its tracks if we must.\n\nMust we?\n\nNo.\n\nThe terrorists are not able to operate freely in a failed state. The failure of the state generates undue constraints to freely operating.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ideally the failed state learns the error of its ways and improves.&lt;/p&gt;\n\n&lt;p&gt;Or it never does. In the case it is never forced to learn who is to say the state is failed? By who&amp;#39;s measure is a state a failure? Not the people of the state themselves. Surely no.&lt;/p&gt;\n\n&lt;p&gt;The people of the &amp;quot;failed&amp;quot; state will never admit they are a failure. They would rather leave the country to prove it a failure if  that were the case. Migration happens a lot. It is a normal part of being a human.&lt;/p&gt;\n\n&lt;p&gt;But it is hard to be a state with everyone dead of electromagnetic waves beamed from offshore sources. We can stop any regime dead in its tracks if we must.&lt;/p&gt;\n\n&lt;p&gt;Must we?&lt;/p&gt;\n\n&lt;p&gt;No.&lt;/p&gt;\n\n&lt;p&gt;The terrorists are not able to operate freely in a failed state. The failure of the state generates undue constraints to freely operating.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbjpu3", "score_hidden": false, "stickied": false, "created": 1492338292.0, "created_utc": 1492309492.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgakd73", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "xyanon36", "parent_id": "t1_dgakb1c", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "So with the goal of \"denying sanctuary\", do you think destroying a pro-terrorist government but the result being a failed state in which terrorists operate freely still counts as fulfillment of that goal? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So with the goal of &amp;quot;denying sanctuary&amp;quot;, do you think destroying a pro-terrorist government but the result being a failed state in which terrorists operate freely still counts as fulfillment of that goal? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgakd73", "score_hidden": false, "stickied": false, "created": 1492285720.0, "created_utc": 1492256920.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgakb1c", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "AurelianoTampa", "parent_id": "t1_dgak0ds", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You make fine points that the War on Terror was ineffective when it came to the long-term destruction of the idea of terrorism. \n\n*But that is not what your OP asked.*\n\n&gt;Your title claimed that \"America lost the war on terror badly,\" and your OP asked if it had \"accomplished anything.\" After reviewing the stated goals and objectives of the WoT, and seeing that the majority have been accomplished, can you still maintain that view?\n\nI still maintain that, according to those goals and objectives I linked above, the \"War on Terror\" accomplished most of them. It just happens to be the case that those were not conducive to a long-term strategy of dissuading terrorism. But the US government did manage to meet most of their objectives. They just did not lead to the results that we, the American people, hoped to see. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You make fine points that the War on Terror was ineffective when it came to the long-term destruction of the idea of terrorism. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;But that is not what your OP asked.&lt;/em&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Your title claimed that &amp;quot;America lost the war on terror badly,&amp;quot; and your OP asked if it had &amp;quot;accomplished anything.&amp;quot; After reviewing the stated goals and objectives of the WoT, and seeing that the majority have been accomplished, can you still maintain that view?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I still maintain that, according to those goals and objectives I linked above, the &amp;quot;War on Terror&amp;quot; accomplished most of them. It just happens to be the case that those were not conducive to a long-term strategy of dissuading terrorism. But the US government did manage to meet most of their objectives. They just did not lead to the results that we, the American people, hoped to see. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgakb1c", "score_hidden": false, "stickied": false, "created": 1492285563.0, "created_utc": 1492256763.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgak0ds", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "xyanon36", "parent_id": "t1_dgajhnt", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "The goal of ending sponsorship and havens for terrorists only can be considered successful if you're looking at organized, official governments who support terrorism, in which case you a few like Iran supporting Hezbollah still but yes, Afghanistan no longer has an officially terrorist friendly government, nor Libya.\n\nBut instead of state sponsorship, terrorists are thriving in failed states. Gaddhafi may have supported terrorist groups to a certain extent, but with him dead and his regime gone, Libya is in total chaos and terrorists are more comfortable there than ever before. \n\nWhen a state supports terrorist groups, they usually do it in a clandestine, limited way and keep them on a leash to a certain extent. But if you're al-Queda, what would you rather have: A government that secretly assists you once in awhile and sometimes throws you a bone, or a failed state with no effective government at all? \n\nI would argue terrorists are more successful now with so many failed states in the aftermath of American intervention and the Arab Spring than they were under secretly friendly, strong governments. Because even a despot knows he can only do so much in supporting terrorism before the US and NATO comes knocking on his door. But if the despot is dead and the state has collapsed, then terrorists can thrive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The goal of ending sponsorship and havens for terrorists only can be considered successful if you&amp;#39;re looking at organized, official governments who support terrorism, in which case you a few like Iran supporting Hezbollah still but yes, Afghanistan no longer has an officially terrorist friendly government, nor Libya.&lt;/p&gt;\n\n&lt;p&gt;But instead of state sponsorship, terrorists are thriving in failed states. Gaddhafi may have supported terrorist groups to a certain extent, but with him dead and his regime gone, Libya is in total chaos and terrorists are more comfortable there than ever before. &lt;/p&gt;\n\n&lt;p&gt;When a state supports terrorist groups, they usually do it in a clandestine, limited way and keep them on a leash to a certain extent. But if you&amp;#39;re al-Queda, what would you rather have: A government that secretly assists you once in awhile and sometimes throws you a bone, or a failed state with no effective government at all? &lt;/p&gt;\n\n&lt;p&gt;I would argue terrorists are more successful now with so many failed states in the aftermath of American intervention and the Arab Spring than they were under secretly friendly, strong governments. Because even a despot knows he can only do so much in supporting terrorism before the US and NATO comes knocking on his door. But if the despot is dead and the state has collapsed, then terrorists can thrive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgak0ds", "score_hidden": false, "stickied": false, "created": 1492284759.0, "created_utc": 1492255959.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgajhnt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AurelianoTampa", "parent_id": "t1_dgaj5qg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; But am I wrong in saying the War on Terror should have a realistic endgame?\n\nBased on what criteria?\n\nBased on the criteria that the US government itself presented, yes - because a \"realistic endgame\" was not part of their goals or objectives. \n\n&gt;But doesn't losing \"the war of ideas\" undo all other victories?\n\nNot necessarily - because if terrorism can be contained and managed, it still reduces attacks on us and our interests even if it's not destroyed entirely as an idea.\n\nBut that's outside the scope of your OP. Your title claimed that \"America lost the war on terror badly,\" and your OP asked if it had \"accomplished anything.\" After reviewing the stated goals and objectives of the WoT, and seeing that the majority have been accomplished, can you still maintain that view?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But am I wrong in saying the War on Terror should have a realistic endgame?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Based on what criteria?&lt;/p&gt;\n\n&lt;p&gt;Based on the criteria that the US government itself presented, yes - because a &amp;quot;realistic endgame&amp;quot; was not part of their goals or objectives. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But doesn&amp;#39;t losing &amp;quot;the war of ideas&amp;quot; undo all other victories?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not necessarily - because if terrorism can be contained and managed, it still reduces attacks on us and our interests even if it&amp;#39;s not destroyed entirely as an idea.&lt;/p&gt;\n\n&lt;p&gt;But that&amp;#39;s outside the scope of your OP. Your title claimed that &amp;quot;America lost the war on terror badly,&amp;quot; and your OP asked if it had &amp;quot;accomplished anything.&amp;quot; After reviewing the stated goals and objectives of the WoT, and seeing that the majority have been accomplished, can you still maintain that view?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgajhnt", "score_hidden": false, "stickied": false, "created": 1492283253.0, "created_utc": 1492254453.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgal8i2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Amp1497", "parent_id": "t1_dgaj5qg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It's more of a mentality that the government wants to keep. I get that the goal of \"eradicating terrorism\" doesn't really have much of an end-game, but I don't think that's really the point of it. Having a goal with a realistic endgame means that, at some point, there will be a scenario where the criteria of your goals are satisfied while the problem is still there. When you have a goal as broad as \"eradicate terrorism\", which I agree does seem impossible, it sets up the mentality that this will never be over, but we will never stop fighting it. Not having that endgame means that our efforts will never cease, and that the fight against terrorism will be ongoing, no matter how big or small the threat.\n\nAll-in-all, it's kind of a mentality thing. You don't want a goal with an endgame, because the problem itself won't truly ever cease to be. I think for his situation, \"War on Terror\" is a bit of a misnomer. It's more of a \"Continuous Opposition to Terror\" (for lack of better words).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s more of a mentality that the government wants to keep. I get that the goal of &amp;quot;eradicating terrorism&amp;quot; doesn&amp;#39;t really have much of an end-game, but I don&amp;#39;t think that&amp;#39;s really the point of it. Having a goal with a realistic endgame means that, at some point, there will be a scenario where the criteria of your goals are satisfied while the problem is still there. When you have a goal as broad as &amp;quot;eradicate terrorism&amp;quot;, which I agree does seem impossible, it sets up the mentality that this will never be over, but we will never stop fighting it. Not having that endgame means that our efforts will never cease, and that the fight against terrorism will be ongoing, no matter how big or small the threat.&lt;/p&gt;\n\n&lt;p&gt;All-in-all, it&amp;#39;s kind of a mentality thing. You don&amp;#39;t want a goal with an endgame, because the problem itself won&amp;#39;t truly ever cease to be. I think for his situation, &amp;quot;War on Terror&amp;quot; is a bit of a misnomer. It&amp;#39;s more of a &amp;quot;Continuous Opposition to Terror&amp;quot; (for lack of better words).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgal8i2", "score_hidden": false, "stickied": false, "created": 1492287876.0, "created_utc": 1492259076.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": "", "user_reports": [], "id": "dgbjcli", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SeanACarlos", "parent_id": "t1_dgaj5qg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; But am I wrong in saying the War on Terror should have a realistic endgame?\n\nThe war on terror has an objective.\n\nThe objective is the end of terrible means of proving points, aka the end of points based on violence by the powerful.\n\nNo more points for violent systems.\n\nThat is the end of terror.\n\nProve that terror is impossible.\n\nHaven't you seen war games starring that murderer Matthew Broderick? The point of the game is to learn not to play.\n\nEither Allah proves that violence is the answer.\n\nOr the USA proves that violence is not the answer.\n\nEither outcome I am totally fine with.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But am I wrong in saying the War on Terror should have a realistic endgame?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The war on terror has an objective.&lt;/p&gt;\n\n&lt;p&gt;The objective is the end of terrible means of proving points, aka the end of points based on violence by the powerful.&lt;/p&gt;\n\n&lt;p&gt;No more points for violent systems.&lt;/p&gt;\n\n&lt;p&gt;That is the end of terror.&lt;/p&gt;\n\n&lt;p&gt;Prove that terror is impossible.&lt;/p&gt;\n\n&lt;p&gt;Haven&amp;#39;t you seen war games starring that murderer Matthew Broderick? The point of the game is to learn not to play.&lt;/p&gt;\n\n&lt;p&gt;Either Allah proves that violence is the answer.&lt;/p&gt;\n\n&lt;p&gt;Or the USA proves that violence is not the answer.&lt;/p&gt;\n\n&lt;p&gt;Either outcome I am totally fine with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbjcli", "score_hidden": false, "stickied": false, "created": 1492337748.0, "created_utc": 1492308948.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaj5qg", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "xyanon36", "parent_id": "t1_dgaivm2", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "But am I wrong in saying the War on Terror should have a realistic endgame? Yes, a lot of very dangerous people have been killed. And if you look at that in a vacuum, you can say \"Group X was very dangerous but now they've been eliminated, so the world is a safer place.\" But if you look at it in full context and say \"Group X was eliminated, but the process of eliminating Group X led to the existence of Group Y who present just as much of a threat.\" \n\nNow clearly we can't kill every terrorist in the world. I would think the realistic goal is to reduce terrorism as much as it can possibly be reduced. But doesn't losing \"the war of ideas\" undo all other victories? If the climate for radicalization persists, it seems to me no amount of bombing or war will solve our problems, because fundamentalist Islamists seem very much like a hydra to me, where two heads grow for every one you cut off. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But am I wrong in saying the War on Terror should have a realistic endgame? Yes, a lot of very dangerous people have been killed. And if you look at that in a vacuum, you can say &amp;quot;Group X was very dangerous but now they&amp;#39;ve been eliminated, so the world is a safer place.&amp;quot; But if you look at it in full context and say &amp;quot;Group X was eliminated, but the process of eliminating Group X led to the existence of Group Y who present just as much of a threat.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Now clearly we can&amp;#39;t kill every terrorist in the world. I would think the realistic goal is to reduce terrorism as much as it can possibly be reduced. But doesn&amp;#39;t losing &amp;quot;the war of ideas&amp;quot; undo all other victories? If the climate for radicalization persists, it seems to me no amount of bombing or war will solve our problems, because fundamentalist Islamists seem very much like a hydra to me, where two heads grow for every one you cut off. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaj5qg", "score_hidden": false, "stickied": false, "created": 1492282232.0, "created_utc": 1492253432.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": "", "user_reports": [], "id": "dgc6sks", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pikk", "parent_id": "t1_dgak2cs", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;  Afghanistan, for example, has no significant natural resources to be exploited.\n\nAfghanistan produces 90% of the world's opium (heroin) \n\nhttps://en.wikipedia.org/wiki/Opium_production_in_Afghanistan\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Afghanistan, for example, has no significant natural resources to be exploited.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Afghanistan produces 90% of the world&amp;#39;s opium (heroin) &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Opium_production_in_Afghanistan\"&gt;https://en.wikipedia.org/wiki/Opium_production_in_Afghanistan&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgc6sks", "score_hidden": false, "stickied": false, "created": 1492387214.0, "created_utc": 1492358414.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": "", "user_reports": [], "id": "dgbjtv1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SeanACarlos", "parent_id": "t1_dgak2cs", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Afghanistan is highly strategic.\n\nWhy not plant a foothold in the geography of a useful place?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Afghanistan is highly strategic.&lt;/p&gt;\n\n&lt;p&gt;Why not plant a foothold in the geography of a useful place?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbjtv1", "score_hidden": false, "stickied": false, "created": 1492338462.0, "created_utc": 1492309662.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgak2cs", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "xyanon36", "parent_id": "t1_dgajhcc", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I absolutely believe there is a degree of imperialism and exploitation, but that can't explain every war and every country we're involved in. Afghanistan, for example, has no significant natural resources to be exploited. So even waging a war purely for profit doesn't make sense in Afghanistan. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I absolutely believe there is a degree of imperialism and exploitation, but that can&amp;#39;t explain every war and every country we&amp;#39;re involved in. Afghanistan, for example, has no significant natural resources to be exploited. So even waging a war purely for profit doesn&amp;#39;t make sense in Afghanistan. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgak2cs", "score_hidden": false, "stickied": false, "created": 1492284902.0, "created_utc": 1492256102.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgajhcc", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ACrusaderA", "parent_id": "t1_dgaivm2", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I would argue that goals 1 and 2 failed miserably and 3 is far from successful.\n\n1 - You can't wipe out terrorists or their organizations. There are still IRA members and they got what they wanted. The idea that the USA could do this, especially as part of a military campaign, is foolish and a waste of money. Like a war on drugs.\n\nIf they truly wanted to stop terrorism, they would enter into a cold war with spies and counterinsurgency tactics instead of what seems to be an attempt at a very conventional war against very unconventional enemies.\n\n2 - While very few governments will openly admit that they support terrorist groups, many nations have populations which support terrorist groups.\n\nWhen people say the USA is racist because of the KKK, they aren't saying that the current administration supports the KKK, but that there is a significant portion of the population that supports or atleast sympathizes with the KKK.\n\nWhich leads into\n\n3 - The USA invading the Middle East and waging a conventional war has lead to terrorism being more profitable.\n\nTerrorism doesn't just succeed because the members believe that they are religiously just and waging a virtuous war, it succeeds because the leaders believe that and can recruit starving people who just want food and shelter.\n\nI realize that the USA is trying to increase the quality of life in the region, but if they really wanted to decrease the conditions that terrorists exploited they would be pumping more money into education and commerce than into the military.\n\nSouth Korea and Japan didn't become huge hubs of industry and technology just by having a strong military defense, the USA also pumped untold trillions into their economies and helped with educating people so that when the choice came the option of working with the West was more profitable for them.\n\nThe only thing the USA has done is protect their interests. Mainly because the USA's primary interest of you look at their budget, their interests are mostly military industry and resource extraction. And if this war has done two things it has consumed military resources that need to be replenished, and ensured that the USA maintains a strong representation in terms of oil production and management.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would argue that goals 1 and 2 failed miserably and 3 is far from successful.&lt;/p&gt;\n\n&lt;p&gt;1 - You can&amp;#39;t wipe out terrorists or their organizations. There are still IRA members and they got what they wanted. The idea that the USA could do this, especially as part of a military campaign, is foolish and a waste of money. Like a war on drugs.&lt;/p&gt;\n\n&lt;p&gt;If they truly wanted to stop terrorism, they would enter into a cold war with spies and counterinsurgency tactics instead of what seems to be an attempt at a very conventional war against very unconventional enemies.&lt;/p&gt;\n\n&lt;p&gt;2 - While very few governments will openly admit that they support terrorist groups, many nations have populations which support terrorist groups.&lt;/p&gt;\n\n&lt;p&gt;When people say the USA is racist because of the KKK, they aren&amp;#39;t saying that the current administration supports the KKK, but that there is a significant portion of the population that supports or atleast sympathizes with the KKK.&lt;/p&gt;\n\n&lt;p&gt;Which leads into&lt;/p&gt;\n\n&lt;p&gt;3 - The USA invading the Middle East and waging a conventional war has lead to terrorism being more profitable.&lt;/p&gt;\n\n&lt;p&gt;Terrorism doesn&amp;#39;t just succeed because the members believe that they are religiously just and waging a virtuous war, it succeeds because the leaders believe that and can recruit starving people who just want food and shelter.&lt;/p&gt;\n\n&lt;p&gt;I realize that the USA is trying to increase the quality of life in the region, but if they really wanted to decrease the conditions that terrorists exploited they would be pumping more money into education and commerce than into the military.&lt;/p&gt;\n\n&lt;p&gt;South Korea and Japan didn&amp;#39;t become huge hubs of industry and technology just by having a strong military defense, the USA also pumped untold trillions into their economies and helped with educating people so that when the choice came the option of working with the West was more profitable for them.&lt;/p&gt;\n\n&lt;p&gt;The only thing the USA has done is protect their interests. Mainly because the USA&amp;#39;s primary interest of you look at their budget, their interests are mostly military industry and resource extraction. And if this war has done two things it has consumed military resources that need to be replenished, and ensured that the USA maintains a strong representation in terms of oil production and management.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgajhcc", "score_hidden": false, "stickied": false, "created": 1492283225.0, "created_utc": 1492254425.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgaivm2", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "AurelianoTampa", "parent_id": "t3_65idzp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; After 9/11, a clear goal was outlined: We wanted to capture or kill bin Laden and his al-Queda fighters, and deny al-Queda a safe haven to operate in Afghanistan.\n\nThat is but one facet of the goals and objectives of the War on Terror. [Here are the actual goals and objectives](https://www.cia.gov/news-information/cia-the-war-on-terrorism/Counter_Terrorism_Strategy.pdf), as per the CIA:\n\n&gt;**Goal:** Defeat Terrorists and Their Organizations\n\nWork in Progress. Like stamping out ants, there always seems to be more.\n\n&gt;Objective: Identify terrorists and terrorist organizations. \n\nI would say this has been successful. We know of many organizations, and many of their leaders and members. \n\n&gt;Objective: Locate terrorists and their organizations.\n\nAgain, this has been successful.\n\n&gt;Objective: Destroy terrorists and their organizations.\n\nAnd this is a WIP.\n\n&gt;**Goal:** Deny Sponsorship, Support, and Sanctuary to Terrorists\n\nVery successful, I'd say. Few nations openly support terrorist groups. \n\n&gt;Objective: End the state sponsorship of terrorism.\n&gt;\n&gt;Objective: Establish and maintain an international standard of accountability with regard to combating terrorism.\n&gt;\n&gt;Objective: Strengthen and sustain the international effort to fight terrorism.\n&gt;\n&gt;Objective: Interdict and disrupt material support for terrorists.\n&gt;\n&gt;Objective: Eliminate terrorist sanctuaries and havens.\n\nAs said above, all of these have been successful with the possible exception of the last one (as there always seem to be more).\n\n&gt;**Goal:** Diminish the Underlying Conditions that Terrorists Seek to Exploit\n\nThis is probably the least successful one here, especially as the US has turned more insular and protectionist over time.\n\n&gt;Objective: Partner with the international community to strengthen weak states and prevent the (re)emergence of terrorism.\n&gt;\n&gt;Objective: Win the War of Ideas\n\nThe first is something that we just don't do well. It is much easier to simply launch missiles and leave  than it is to nation-build. The second is too vague and offers no clear way to move forward. They mention in particular the Israeli-Palestinian conflict, but obviously that mess just continues. If we were to have any part of the war on terror that we've lost, I'd say it's on this goal.\n\n&gt;**Goal:** Defend U.S. Citizens and Interests at Home and Abroad \n\nI may not agree with all their objectives here, but I think they were successful.\n\n&gt;Objective: Implement the National Strategy for Homeland Security\n\nAchieved.\n\n&gt;Objective: Attain domain awareness.\n\nAchieved (so long, privacy!)\n\n&gt;Objective: Enhance measures to ensure the integrity, reliability, and availability of critical physical and information-based infrastructures at home and abroad.\n\nEh, achieved at home, mixed bag abroad.\n\n&gt;Objective: Integrate measures to protect U.S. citizens abroad\n\nAchieved, to mixed success (Benghazi sticks out as an example where embassy protections existed but failed to stop an attack)\n\n&gt;Objective: Ensure an integrated incident management capability.\n\nAchieved - we are often quick to help allies with terrorist attacked.\n\nSo, let's tally those up...\n\n* Out of four goals, I would argue two have been achieved, one has met some limited success but is a work in progress, and the last one  was too vague and unlikely to succeed from the start. We haven't lost, though - and not badly. Losing badly would at least be defined as failing on the majority of goals.\n\n* Out of 16 goals, 10 are achieved in full, 2 are WIP, 2 have had a mixture of success and failure, and 2 have largely failed either out of ill-defined parameters or because we just stopped trying. \n\nTL;DR: If you look at the actual goals and objectives of the War on Terror, which differ from what you think they were, then it's tough to claim we've lost (and illogical to claim we've lost *badly*). We've achieved at least half the goals and the majority of our objectives. Whether we agree these are good objectives and goals to have is another question, but judging the US based on their own criteria they've had more success than not in the War on Terror.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;After 9/11, a clear goal was outlined: We wanted to capture or kill bin Laden and his al-Queda fighters, and deny al-Queda a safe haven to operate in Afghanistan.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That is but one facet of the goals and objectives of the War on Terror. &lt;a href=\"https://www.cia.gov/news-information/cia-the-war-on-terrorism/Counter_Terrorism_Strategy.pdf\"&gt;Here are the actual goals and objectives&lt;/a&gt;, as per the CIA:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;Goal:&lt;/strong&gt; Defeat Terrorists and Their Organizations&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Work in Progress. Like stamping out ants, there always seems to be more.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Objective: Identify terrorists and terrorist organizations. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I would say this has been successful. We know of many organizations, and many of their leaders and members. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Objective: Locate terrorists and their organizations.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Again, this has been successful.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Objective: Destroy terrorists and their organizations.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And this is a WIP.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;Goal:&lt;/strong&gt; Deny Sponsorship, Support, and Sanctuary to Terrorists&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Very successful, I&amp;#39;d say. Few nations openly support terrorist groups. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Objective: End the state sponsorship of terrorism.&lt;/p&gt;\n\n&lt;p&gt;Objective: Establish and maintain an international standard of accountability with regard to combating terrorism.&lt;/p&gt;\n\n&lt;p&gt;Objective: Strengthen and sustain the international effort to fight terrorism.&lt;/p&gt;\n\n&lt;p&gt;Objective: Interdict and disrupt material support for terrorists.&lt;/p&gt;\n\n&lt;p&gt;Objective: Eliminate terrorist sanctuaries and havens.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As said above, all of these have been successful with the possible exception of the last one (as there always seem to be more).&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;Goal:&lt;/strong&gt; Diminish the Underlying Conditions that Terrorists Seek to Exploit&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is probably the least successful one here, especially as the US has turned more insular and protectionist over time.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Objective: Partner with the international community to strengthen weak states and prevent the (re)emergence of terrorism.&lt;/p&gt;\n\n&lt;p&gt;Objective: Win the War of Ideas&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The first is something that we just don&amp;#39;t do well. It is much easier to simply launch missiles and leave  than it is to nation-build. The second is too vague and offers no clear way to move forward. They mention in particular the Israeli-Palestinian conflict, but obviously that mess just continues. If we were to have any part of the war on terror that we&amp;#39;ve lost, I&amp;#39;d say it&amp;#39;s on this goal.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;Goal:&lt;/strong&gt; Defend U.S. Citizens and Interests at Home and Abroad &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I may not agree with all their objectives here, but I think they were successful.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Objective: Implement the National Strategy for Homeland Security&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Achieved.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Objective: Attain domain awareness.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Achieved (so long, privacy!)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Objective: Enhance measures to ensure the integrity, reliability, and availability of critical physical and information-based infrastructures at home and abroad.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Eh, achieved at home, mixed bag abroad.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Objective: Integrate measures to protect U.S. citizens abroad&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Achieved, to mixed success (Benghazi sticks out as an example where embassy protections existed but failed to stop an attack)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Objective: Ensure an integrated incident management capability.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Achieved - we are often quick to help allies with terrorist attacked.&lt;/p&gt;\n\n&lt;p&gt;So, let&amp;#39;s tally those up...&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Out of four goals, I would argue two have been achieved, one has met some limited success but is a work in progress, and the last one  was too vague and unlikely to succeed from the start. We haven&amp;#39;t lost, though - and not badly. Losing badly would at least be defined as failing on the majority of goals.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Out of 16 goals, 10 are achieved in full, 2 are WIP, 2 have had a mixture of success and failure, and 2 have largely failed either out of ill-defined parameters or because we just stopped trying. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;TL;DR: If you look at the actual goals and objectives of the War on Terror, which differ from what you think they were, then it&amp;#39;s tough to claim we&amp;#39;ve lost (and illogical to claim we&amp;#39;ve lost &lt;em&gt;badly&lt;/em&gt;). We&amp;#39;ve achieved at least half the goals and the majority of our objectives. Whether we agree these are good objectives and goals to have is another question, but judging the US based on their own criteria they&amp;#39;ve had more success than not in the War on Terror.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaivm2", "score_hidden": false, "stickied": false, "created": 1492281344.0, "created_utc": 1492252544.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": "", "user_reports": [], "id": "dgbjz9l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SeanACarlos", "parent_id": "t1_dgaj2qs", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; \"here in the present, knowing what we know, does prosecuting the war on terror mainly through military force rather than law enforcement still make sense, and has the war prevented attacks?\"\n\nDoes it still make sense to use military force?\n\nYes, until we find some other source more persuasive.\n\nHas the war prevented attacks?\n\nYes. It prevented every attack that would have happened otherwise.\n\nThat's a 100% success rate if I'm not mistaken.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;here in the present, knowing what we know, does prosecuting the war on terror mainly through military force rather than law enforcement still make sense, and has the war prevented attacks?&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Does it still make sense to use military force?&lt;/p&gt;\n\n&lt;p&gt;Yes, until we find some other source more persuasive.&lt;/p&gt;\n\n&lt;p&gt;Has the war prevented attacks?&lt;/p&gt;\n\n&lt;p&gt;Yes. It prevented every attack that would have happened otherwise.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s a 100% success rate if I&amp;#39;m not mistaken.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbjz9l", "score_hidden": false, "stickied": false, "created": 1492338690.0, "created_utc": 1492309890.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": "", "user_reports": [], "id": "dgaveuw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hacksoncode", "parent_id": "t1_dgaj2qs", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; does prosecuting the war on terror mainly through military force rather than law enforcement still make sense\n\nWhy do you think that this is the case? There's a huge amount of intelligence gathering and law enforcement effort to prevent terrorism.\n\nIt's just not as obvious and sensational. \"Cop does his job, keeps an eye out for suspicious packages\" doesn't make good headlines. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;does prosecuting the war on terror mainly through military force rather than law enforcement still make sense&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Why do you think that this is the case? There&amp;#39;s a huge amount of intelligence gathering and law enforcement effort to prevent terrorism.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just not as obvious and sensational. &amp;quot;Cop does his job, keeps an eye out for suspicious packages&amp;quot; doesn&amp;#39;t make good headlines. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaveuw", "score_hidden": false, "stickied": false, "created": 1492304339.0, "created_utc": 1492275539.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaj2qs", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "xyanon36", "parent_id": "t1_dgair17", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I was 9 when 9/11 happened but fair point, I imagine myself as an adult would likely worry about more attacks. But I'm not trying to make an argument from hindsight or say that it was unreasonable to take significant action in response to 9/11, saying \"should have done it differently\" is not useful in actually improving one's situation.\n\nI'm more so asking \"here in the present, knowing what we know, does prosecuting the war on terror mainly through military force rather than law enforcement still make sense, and has the war prevented attacks?\" \n\nI know the second question also cannot be answered with facts because a hypothetical cannot be known. So I'm not trying to make an argument from hindsight, I think if you're arguing from hindsight then there's probably no question that certain things like invading Iraq should not have happened, more so it's a question of what to do going forward. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was 9 when 9/11 happened but fair point, I imagine myself as an adult would likely worry about more attacks. But I&amp;#39;m not trying to make an argument from hindsight or say that it was unreasonable to take significant action in response to 9/11, saying &amp;quot;should have done it differently&amp;quot; is not useful in actually improving one&amp;#39;s situation.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m more so asking &amp;quot;here in the present, knowing what we know, does prosecuting the war on terror mainly through military force rather than law enforcement still make sense, and has the war prevented attacks?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I know the second question also cannot be answered with facts because a hypothetical cannot be known. So I&amp;#39;m not trying to make an argument from hindsight, I think if you&amp;#39;re arguing from hindsight then there&amp;#39;s probably no question that certain things like invading Iraq should not have happened, more so it&amp;#39;s a question of what to do going forward. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaj2qs", "score_hidden": false, "stickied": false, "created": 1492281968.0, "created_utc": 1492253168.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgair17", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Kirkaine", "parent_id": "t3_65idzp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Counterfactuals are hard, so let's think about this a different way.\n\nRewind 15 and a bit years. Imagine the two of us are having a drink at a bar (or at your school canteen, I don't know how old you were then) a few weeks after 9/11. The entire country is despondent. They're still counting the bodies in New York. There's news on TV about anthrax being mailed to politicians. You wonder out loud when the next attack will be. I say \"Nah, I'm telling you, there won't be anything like this in America for at least a decade or so. A few workpace shootings by brown guys, maybe a shitty home made bomb that kills two or three people, but that's it. Damn terrorists won't be able to do anything big for at least 15 years, I bet you $10,000\".\n\nWould you have taken that bet?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Counterfactuals are hard, so let&amp;#39;s think about this a different way.&lt;/p&gt;\n\n&lt;p&gt;Rewind 15 and a bit years. Imagine the two of us are having a drink at a bar (or at your school canteen, I don&amp;#39;t know how old you were then) a few weeks after 9/11. The entire country is despondent. They&amp;#39;re still counting the bodies in New York. There&amp;#39;s news on TV about anthrax being mailed to politicians. You wonder out loud when the next attack will be. I say &amp;quot;Nah, I&amp;#39;m telling you, there won&amp;#39;t be anything like this in America for at least a decade or so. A few workpace shootings by brown guys, maybe a shitty home made bomb that kills two or three people, but that&amp;#39;s it. Damn terrorists won&amp;#39;t be able to do anything big for at least 15 years, I bet you $10,000&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Would you have taken that bet?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgair17", "score_hidden": false, "stickied": false, "created": 1492280945.0, "created_utc": 1492252145.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": "", "user_reports": [], "id": "dgakfqh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "BlckJck103", "parent_id": "t3_65idzp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I don't think you make a convincing argument for non-intervention. Islamic Terrorism has many different groups and many different aims but lets try and boil it down to the general; these groups want one or many Islamic Nations/States ran under strict adherence to their own interpretation of their religion. In many cases they also aim for a global perspective, opposing foreign intervention in other countries and calling on people of other countries to oppose the governments of those nations.\n\nYour view only works if you can convince the other side that they don't have to fight. To do this you would most likely have to change the laws removing freedom of speech, look at attacks on Charlie Hebdo, the Danish cartoons or Theo van Gogh. If you want to defend the right of free speech you either accept mulitple attacks with no reponse or give in and make laws preventing any criticism of Islam or any speech that may offend Muslims.\n\nYou would also have to accept groups like AQ and ISIS controlling countries and being able to export terrorism at a greater rate. You'd have to base foreign policy on the wishes of these countries as well. Israel and Saudi Arabia? It doesn't matter what their governments say, because ISIS have told you to stay out \"or else\".\n\nThere's probably other examples but the general theme would be capitulation to force, to bace policy on the wishes of people willing to blow other people up. How long is it before they want more? Give us weapons or else, give us Egpyt or else, give us money else? Where do you draw the line, giving in to blackmail will usually lead to conflict as the blackmailer makes more and more demands. \n\n&gt;1) The War on Terror has yielded results in preventing terrorist attacks on American soil\n\nThis is impossible to prove, how can anyone prove that something didn't happen for a specific reason? Say the US has severly disrupted the ability of terrorists to move, recruit and gain funds. How is that going to show up or even make the news?\n\nIn the end the war on terror is a war, the only for one side to unilaterally end it is to surrender. As no side has yet surrendered it's clear that main point is wrong, the US has not lost the war on terror. To the more general point of whether it should be fought well you ahve to decide whether you think the US would be a better nation if it abandoned large areas of the world to terrorist groups and appeased them?\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think you make a convincing argument for non-intervention. Islamic Terrorism has many different groups and many different aims but lets try and boil it down to the general; these groups want one or many Islamic Nations/States ran under strict adherence to their own interpretation of their religion. In many cases they also aim for a global perspective, opposing foreign intervention in other countries and calling on people of other countries to oppose the governments of those nations.&lt;/p&gt;\n\n&lt;p&gt;Your view only works if you can convince the other side that they don&amp;#39;t have to fight. To do this you would most likely have to change the laws removing freedom of speech, look at attacks on Charlie Hebdo, the Danish cartoons or Theo van Gogh. If you want to defend the right of free speech you either accept mulitple attacks with no reponse or give in and make laws preventing any criticism of Islam or any speech that may offend Muslims.&lt;/p&gt;\n\n&lt;p&gt;You would also have to accept groups like AQ and ISIS controlling countries and being able to export terrorism at a greater rate. You&amp;#39;d have to base foreign policy on the wishes of these countries as well. Israel and Saudi Arabia? It doesn&amp;#39;t matter what their governments say, because ISIS have told you to stay out &amp;quot;or else&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s probably other examples but the general theme would be capitulation to force, to bace policy on the wishes of people willing to blow other people up. How long is it before they want more? Give us weapons or else, give us Egpyt or else, give us money else? Where do you draw the line, giving in to blackmail will usually lead to conflict as the blackmailer makes more and more demands. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;1) The War on Terror has yielded results in preventing terrorist attacks on American soil&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is impossible to prove, how can anyone prove that something didn&amp;#39;t happen for a specific reason? Say the US has severly disrupted the ability of terrorists to move, recruit and gain funds. How is that going to show up or even make the news?&lt;/p&gt;\n\n&lt;p&gt;In the end the war on terror is a war, the only for one side to unilaterally end it is to surrender. As no side has yet surrendered it&amp;#39;s clear that main point is wrong, the US has not lost the war on terror. To the more general point of whether it should be fought well you ahve to decide whether you think the US would be a better nation if it abandoned large areas of the world to terrorist groups and appeased them?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgakfqh", "score_hidden": false, "stickied": false, "created": 1492285897.0, "created_utc": 1492257097.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgakf2u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "chefranden", "parent_id": "t3_65idzp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; [the chance](https://www.cato.org/publications/policy-analysis/terrorism-immigration-risk-analysis) of an American perishing in a terrorist attack on U.S. soil that was committed by a foreigner over the 41-year period studied here is 1 in 3.6 million per year. [The chance](http://www.iii.org/fact-statistic/mortality-risk) of being killed in a car accident is 1 in 113\n\nEither the war on terror is going really well or we are fighting the wrong war.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&lt;a href=\"https://www.cato.org/publications/policy-analysis/terrorism-immigration-risk-analysis\"&gt;the chance&lt;/a&gt; of an American perishing in a terrorist attack on U.S. soil that was committed by a foreigner over the 41-year period studied here is 1 in 3.6 million per year. &lt;a href=\"http://www.iii.org/fact-statistic/mortality-risk\"&gt;The chance&lt;/a&gt; of being killed in a car accident is 1 in 113&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Either the war on terror is going really well or we are fighting the wrong war.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgakf2u", "score_hidden": false, "stickied": false, "created": 1492285850.0, "created_utc": 1492257050.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": "", "user_reports": [], "id": "dgamptz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Goodlake", "parent_id": "t3_65idzp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It depends on what the victory conditions are. You argue that America \"lost\" the war on terror, but by a number of useful parameters (e.g. American deaths, propaganda victories, general threat to The American homeland from Islamic terrorism), America appears to be winning fairly handily. We may have already won, in fact.\n\nNow that has all come at tremendous cost. Our government will spy on us forever and flying will never be the same. We've created a massive refugee crisis and will likely be attacking \"terrorists\" in the Middle East on an ad hoc basis from now until the heat death of the universe, which will continue to cost taxpayers, but that's not the same as losing the war. Should the costs of the war escalate dramatically enough that it bleeds our treasury dry, maybe we can say that we've lost on that basis, but American retirees are a bigger threat than terrorists on that front.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It depends on what the victory conditions are. You argue that America &amp;quot;lost&amp;quot; the war on terror, but by a number of useful parameters (e.g. American deaths, propaganda victories, general threat to The American homeland from Islamic terrorism), America appears to be winning fairly handily. We may have already won, in fact.&lt;/p&gt;\n\n&lt;p&gt;Now that has all come at tremendous cost. Our government will spy on us forever and flying will never be the same. We&amp;#39;ve created a massive refugee crisis and will likely be attacking &amp;quot;terrorists&amp;quot; in the Middle East on an ad hoc basis from now until the heat death of the universe, which will continue to cost taxpayers, but that&amp;#39;s not the same as losing the war. Should the costs of the war escalate dramatically enough that it bleeds our treasury dry, maybe we can say that we&amp;#39;ve lost on that basis, but American retirees are a bigger threat than terrorists on that front.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgamptz", "score_hidden": false, "stickied": false, "created": 1492291049.0, "created_utc": 1492262249.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": "", "user_reports": [], "id": "dgawv27", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "steelerfaninperu", "parent_id": "t3_65idzp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So I've studied the War on Terror and US policy *heavily* and you're mostly right. The [NCTC agrees](https://www.nctc.gov/docs/Current_Terrorist_Threat_to_the_United_States.pdf) that Homegrown Violent Extremists are now the biggest threat. \n\n&gt; It seems to me if some of the money used on air strikes and occupation was instead spent giving more resources to law enforcement at home, we'd be better off.\n\nAnd that's exactly what US politicians have been saying! The DHS in particular, has been harping on this for a while. In 2015 they noted that Daesh was repopulating faster than they could kill them ([really good read actually](https://homeland.house.gov/wp-content/uploads/2015/09/TaskForceFinalReport.pdf)). They then [called for strategies](https://www.dhs.gov/sites/default/files/publications/DHS-HSAC-Foreign-Fighter-Task-Force-Interim-Report-May-2015.pdf) to prevent radicalization. They actually now have at least some [semblance of a strategy](https://www.dhs.gov/sites/default/files/publications/16_1028_S1_CVE_strategy.pdf) which involves funding local programs to prevent radicalization.\n\n**What I argue** is that the War on Terror is, in fact, a necessity, but that without the complimentary de-radicalization strategies it's less effective. Still, it's not a complete waste of time. Let's discuss some of your views.\n\n&gt; what am I missing that the War on Terror has achieved\n\nThe Global Coalition Against Daesh has been *extremely* successful and snuffing out their soldiers and limiting recruitment capacity by getting other nations' legal codes and infrastructure to a higher standard. Daesh territory in Syria is down around 30% of what it used to be with airstrikes. [That's lowered recruitment](http://www.talkmedianews.com/world-news/2016/04/26/isis-recruitment-declining-iraq-syria-desertion-rates-increasing/) and increased desertions. \n\nThat's almost exclusively due to the US and its buddies.\n\nYou still have to fight groups like Daesh. What they do is absolutely horrible. But we need to couple this with a strategy to prevent these groups from forming in the first place. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;ve studied the War on Terror and US policy &lt;em&gt;heavily&lt;/em&gt; and you&amp;#39;re mostly right. The &lt;a href=\"https://www.nctc.gov/docs/Current_Terrorist_Threat_to_the_United_States.pdf\"&gt;NCTC agrees&lt;/a&gt; that Homegrown Violent Extremists are now the biggest threat. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It seems to me if some of the money used on air strikes and occupation was instead spent giving more resources to law enforcement at home, we&amp;#39;d be better off.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And that&amp;#39;s exactly what US politicians have been saying! The DHS in particular, has been harping on this for a while. In 2015 they noted that Daesh was repopulating faster than they could kill them (&lt;a href=\"https://homeland.house.gov/wp-content/uploads/2015/09/TaskForceFinalReport.pdf\"&gt;really good read actually&lt;/a&gt;). They then &lt;a href=\"https://www.dhs.gov/sites/default/files/publications/DHS-HSAC-Foreign-Fighter-Task-Force-Interim-Report-May-2015.pdf\"&gt;called for strategies&lt;/a&gt; to prevent radicalization. They actually now have at least some &lt;a href=\"https://www.dhs.gov/sites/default/files/publications/16_1028_S1_CVE_strategy.pdf\"&gt;semblance of a strategy&lt;/a&gt; which involves funding local programs to prevent radicalization.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What I argue&lt;/strong&gt; is that the War on Terror is, in fact, a necessity, but that without the complimentary de-radicalization strategies it&amp;#39;s less effective. Still, it&amp;#39;s not a complete waste of time. Let&amp;#39;s discuss some of your views.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;what am I missing that the War on Terror has achieved&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The Global Coalition Against Daesh has been &lt;em&gt;extremely&lt;/em&gt; successful and snuffing out their soldiers and limiting recruitment capacity by getting other nations&amp;#39; legal codes and infrastructure to a higher standard. Daesh territory in Syria is down around 30% of what it used to be with airstrikes. &lt;a href=\"http://www.talkmedianews.com/world-news/2016/04/26/isis-recruitment-declining-iraq-syria-desertion-rates-increasing/\"&gt;That&amp;#39;s lowered recruitment&lt;/a&gt; and increased desertions. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s almost exclusively due to the US and its buddies.&lt;/p&gt;\n\n&lt;p&gt;You still have to fight groups like Daesh. What they do is absolutely horrible. But we need to couple this with a strategy to prevent these groups from forming in the first place. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgawv27", "score_hidden": false, "stickied": false, "created": 1492306313.0, "created_utc": 1492277513.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgatahb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "redditfromnowhere", "parent_id": "t3_65idzp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Terror is metaphysical. It is the fear of an emotional response from external stimuli. Such a thing is not literally fought hand-to-hand on the battlefield; people and things which create terror are. Thus, one cannot \"lose\" a \"war on terror\" when such a concept cannot take place. Therefore, one ought to change the focus of the \"war\" to address the real issue: *terrorist groups*. \n\nOne cannot lose a physical war on something which does not physically exist. If anything, the \"war on terror\" is a failure to address the real issue of *what causes terror* and combating *that* source instead.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Terror is metaphysical. It is the fear of an emotional response from external stimuli. Such a thing is not literally fought hand-to-hand on the battlefield; people and things which create terror are. Thus, one cannot &amp;quot;lose&amp;quot; a &amp;quot;war on terror&amp;quot; when such a concept cannot take place. Therefore, one ought to change the focus of the &amp;quot;war&amp;quot; to address the real issue: &lt;em&gt;terrorist groups&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;One cannot lose a physical war on something which does not physically exist. If anything, the &amp;quot;war on terror&amp;quot; is a failure to address the real issue of &lt;em&gt;what causes terror&lt;/em&gt; and combating &lt;em&gt;that&lt;/em&gt; source instead.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgatahb", "score_hidden": false, "stickied": false, "created": 1492301363.0, "created_utc": 1492272563.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": "", "user_reports": [], "id": "dgay4o8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BaronBifford", "parent_id": "t3_65idzp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think using the military to fight terrorism makes as much as using an elephant to hunt mice.  Most of the useful work against terrorism has been done by spies and cops, and its hard to assess their success except that less than 100 Americans since 9/11 have been killed by terrorists.\n\nStill, I think the military does some good work.  The drone strikes and the US-backed Iraqi Army have killed a lot of ISIS fighters and taken back a lot of territory.  This has greatly diminished ISIS's capacity to send agents to bomb Western cities.  But it also reduces the likelihood of homegrown lone-wolf terrorists like the Tsarnaev brothers (the ones who attacked the Boston Marathon).  As ISIS keeps losing, its prestige fades and its call to jihad is heeded less.  I hear that ISIS is now desperate for recruits.  The influx of foreign fighters has greatly diminished, because nobody wants to side with a loser.\n\nThe War in Iraq was a total mistake.  The War in Afghanistan made sense because Osama bin Laden was there, and America did eventually kill him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think using the military to fight terrorism makes as much as using an elephant to hunt mice.  Most of the useful work against terrorism has been done by spies and cops, and its hard to assess their success except that less than 100 Americans since 9/11 have been killed by terrorists.&lt;/p&gt;\n\n&lt;p&gt;Still, I think the military does some good work.  The drone strikes and the US-backed Iraqi Army have killed a lot of ISIS fighters and taken back a lot of territory.  This has greatly diminished ISIS&amp;#39;s capacity to send agents to bomb Western cities.  But it also reduces the likelihood of homegrown lone-wolf terrorists like the Tsarnaev brothers (the ones who attacked the Boston Marathon).  As ISIS keeps losing, its prestige fades and its call to jihad is heeded less.  I hear that ISIS is now desperate for recruits.  The influx of foreign fighters has greatly diminished, because nobody wants to side with a loser.&lt;/p&gt;\n\n&lt;p&gt;The War in Iraq was a total mistake.  The War in Afghanistan made sense because Osama bin Laden was there, and America did eventually kill him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgay4o8", "score_hidden": false, "stickied": false, "created": 1492308033.0, "created_utc": 1492279233.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": "", "user_reports": [], "id": "dgb7p87", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Iceklimber", "parent_id": "t3_65idzp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The initial goal of **The War of Terror* was established in 2001 by the Bush administration with the goal of eradicating Taliban. It has been somewhat fulfilled since their numbers are decimated and while some Taliban members are still out there, their organization as a whole is nigh defunct.\n\nOf course, this is little condolescence in the context that they have in large been replaced by ISIS who is greater than Taliban have ever been. And no, that one big bomb did not turn them into WASWAS.\n\n.\n\nSo you are right in the sense that America did not win, but it has not lost either since there is no Kalifate in sight.\n\nIn my opinion this question is flawed because the *War on Terror* is still ongoing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The initial goal of *&lt;em&gt;The War of Terror&lt;/em&gt; was established in 2001 by the Bush administration with the goal of eradicating Taliban. It has been somewhat fulfilled since their numbers are decimated and while some Taliban members are still out there, their organization as a whole is nigh defunct.&lt;/p&gt;\n\n&lt;p&gt;Of course, this is little condolescence in the context that they have in large been replaced by ISIS who is greater than Taliban have ever been. And no, that one big bomb did not turn them into WASWAS.&lt;/p&gt;\n\n&lt;p&gt;.&lt;/p&gt;\n\n&lt;p&gt;So you are right in the sense that America did not win, but it has not lost either since there is no Kalifate in sight.&lt;/p&gt;\n\n&lt;p&gt;In my opinion this question is flawed because the &lt;em&gt;War on Terror&lt;/em&gt; is still ongoing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb7p87", "score_hidden": false, "stickied": false, "created": 1492321059.0, "created_utc": 1492292259.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": "", "user_reports": [], "id": "dgbj3hv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SeanACarlos", "parent_id": "t3_65idzp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "LOL.\n\nOkay I'm sorry. Moving on.\n\nThe USA declared war on terror.\n\nTo show how terrible it is.\n\nTurns out.\n\nNot as bad as the people that were bombed.\n\nUSA won. The terrorist producing countries lost big league.\n\nThe terrorists are destined to lose.\n\nLogic beats fear in (Logic)&lt;(Personal Perspective)&lt;(Terror)&lt; \n\n(Think rock, paper, scissors on a larger scale)\n\nLogic beats terror.\n\nTerror (aka force) beats personal opinion.\n\nPersonal opinion beats logic.\n\nThe circle of coercion is completely sound.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;LOL.&lt;/p&gt;\n\n&lt;p&gt;Okay I&amp;#39;m sorry. Moving on.&lt;/p&gt;\n\n&lt;p&gt;The USA declared war on terror.&lt;/p&gt;\n\n&lt;p&gt;To show how terrible it is.&lt;/p&gt;\n\n&lt;p&gt;Turns out.&lt;/p&gt;\n\n&lt;p&gt;Not as bad as the people that were bombed.&lt;/p&gt;\n\n&lt;p&gt;USA won. The terrorist producing countries lost big league.&lt;/p&gt;\n\n&lt;p&gt;The terrorists are destined to lose.&lt;/p&gt;\n\n&lt;p&gt;Logic beats fear in (Logic)&amp;lt;(Personal Perspective)&amp;lt;(Terror)&amp;lt; &lt;/p&gt;\n\n&lt;p&gt;(Think rock, paper, scissors on a larger scale)&lt;/p&gt;\n\n&lt;p&gt;Logic beats terror.&lt;/p&gt;\n\n&lt;p&gt;Terror (aka force) beats personal opinion.&lt;/p&gt;\n\n&lt;p&gt;Personal opinion beats logic.&lt;/p&gt;\n\n&lt;p&gt;The circle of coercion is completely sound.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbj3hv", "score_hidden": false, "stickied": false, "created": 1492337376.0, "created_utc": 1492308576.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65idzp", "likes": null, "replies": "", "user_reports": [], "id": "dgaxeu7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "83franks", "parent_id": "t3_65idzp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It is all done for money and political interests. The war on terror is just the excuse they give to the american people. Dont tell me you honestly believe 9/11 was a legit terror attack still? Do some research on that and then ask why they went to war at all in the first place.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is all done for money and political interests. The war on terror is just the excuse they give to the american people. Dont tell me you honestly believe 9/11 was a legit terror attack still? Do some research on that and then ask why they went to war at all in the first place.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaxeu7", "score_hidden": false, "stickied": false, "created": 1492307059.0, "created_utc": 1492278259.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]