[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;People in the middle of the country--i.e. the mid-West, Rust Belt, Appalachia, and similar places--voted for Trump in larger numbers than expected.  Common explanations are &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Economic: these places have never fully recovered from the recession, and automation is killing jobs&lt;/li&gt;\n&lt;li&gt;Social: drug addiction, hatred of the success of gay and black rights movements&lt;/li&gt;\n&lt;li&gt;Political: resentment at the success of Obamacare because they ideologically disagree with government intervention, a perception that we are restraining and embarrassing ourselves in global conflicts, and the growth ideological libertarianism&lt;/li&gt;\n&lt;li&gt;Media manipulation: Russian bots, Russian hacking, moneyed powers like Bannon and the Mercer family building organizations to distort public opinion of Clinton, and more basic media obsession with a disgusting spectacle which translates into free media for Trump&lt;br/&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;These likely contributed some amount to middle America voting for Trump.  However, I think a stronger reason--one that more consistently unifies observed behavior--is a feeling of resentment, driven by the perception that these people are no longer valued in America.  I&amp;#39;m not going to argue whether they deserve respect--probably they deserve more in some ways and less in others.  I won&amp;#39;t argue whether they are respected--I think it&amp;#39;s clear that people who don&amp;#39;t live in these places, on average, think the people who do live there are mostly stupid and a little crazy.  Also note that I&amp;#39;m not excusing or blaming these people, just explaining; this view has nothing to do with me assigning blame to anyone.&lt;/p&gt;\n\n&lt;p&gt;Here are my positive reasons, i.e. evidence that they feel this way and it motivated them to vote for Trump.  &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;1) More than ever people personally identify with their political affiliation.  Rather than voting Republican or mostly agreeing with the Republican platform, people identify as a Republican, and vote for them come hell or high water--ironically, that literally has happened, we&amp;#39;re living through hell and are about to get a lot of high water.  They see Republicanism, patriotism, and Christianity as virtue-signaling--showing that they are good, ethical people worthy of respect.  They also see each of these things--and therefore themselves--as being condescended by liberals, and they resent it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;2) The collapse of economic opportunities in these places is a signal to them that they have lost social value.  They culturally identify with having a strong work ethic and when there were industry, farm, and manufacturing jobs, they were rewarded for their work ethic.  Now jobless, they are desperate to bring these jobs back and reassert the values they once had confirmed in their economy and society.  That&amp;#39;s why, rather than face the fact that these jobs are never coming back, they desperately voted for a candidate&amp;#39;s silly promises to bring them back.  They&amp;#39;re also suspicious that immigrants have taken these jobs and hope the jobs will come back if they deport immigrants.  They want these jobs specifically--not tech jobs, not legal jobs, not retail jobs--because they see these jobs specifically as masculine and socially valuable.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;3) &lt;a href=\"https://www.theatlantic.com/magazine/archive/2017/04/breaking-faith/517785/\"&gt;&amp;quot;Establishing causation is difficult, but we know that culturally conservative white Americans who are disengaged from church experience less economic success and more family breakdown than those who remain connected, and they grow more pessimistic and resentful.&amp;quot;&lt;/a&gt;  Church attendance was down before the election, and seems to correlate with a resentful and isolated attitude.  With queer and women&amp;#39;s rights advancing, the explicit message was that Christianity is an ancient religion inappropriate for the modern era.  A lot of my family in Florida, and old high school friends, post defiant Christian and nostalgic posts.  Who are they defying in their Facebook network?  Well, me a little, I suppose--although they probably aren&amp;#39;t thinking of me specifically, but me-like people who went off to college.  They&amp;#39;re virtue signaling to their network, and feeling like their culture is decaying and under siege.  They&amp;#39;re echo-chambering their resentment.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;4) Black people&amp;#39;s social value is rising and middle America sees it as a decline in white social value.  Maybe it is a decline in the automatic authority, trust, and value that the nation assigns to white people&amp;#39;s expressions; and maybe our society used to value white expressions too much, or used to devalue minority expression too much--so in a sense this is more like a course-correction rather than an injustice.  But deserve it or not, we know that people are always angry at losing anything, and rationalize why they deserved to have it.  The narrative of white privilege may be true, but for these poor Americans, they feel accused of a crime they didn&amp;#39;t commit.  Standing in their shoes, it looks to them like they did everything right and didn&amp;#39;t get rewarded--they have no understanding that, and no particular desire to understand that, black people have experienced worse for longer.  Segregation of populations, together with manipulated media, gives middle America ground to hold onto a comfortable fantasy that everyone else has it so easy and they have it so hard.  They feel under-valued and angry. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;5) Trump represented a shameless assertion--more like a suicidal, berzerk scream--of middle America&amp;#39;s most exaggerated values.  It made them feel valued, considered, defended, represented, and it made everyone else feel hurt the way that they had been hurting.  He&amp;#39;s a use car salesman in his personal history and personality, but a) subtlety is not the public&amp;#39;s strong suit, so this didn&amp;#39;t matter as much as the fact that he doesn&amp;#39;t flinch, and b) they&amp;#39;re willing to overlook his coastal elitism by deliberately focusing on an alternative if fictional narrative:  he fairly earned what he has, and he&amp;#39;ll give everyone else the same opportunity.  In fact, Trump&amp;#39;s main strong suit is his ability to collect and deflect responsibility regardless of whether he truly is responsible.  &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Now the negative reasons, i.e. why I don&amp;#39;t think the other reasons explain enough:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;1) We&amp;#39;ve had economic troubles before but they never split along regional and cultural lines like this--we never ridiculed people in the Dust Bowl or Great Depression, because we fundamentally saw everyone as American.  Now in the recovery from the recession, coastal elitists jeer at the stupidity of middle America and their self-inflicted suffering.  We&amp;#39;ve had cultural fights but back then even relatively secular people still were Christian and asserted the value and piety of Christians, and only suggested moderation.  The Civil Rights fight was divisive but the liberal side fundamentally didn&amp;#39;t advocate the destruction of conservatism; rather than antagonize, it begged for black people to be allowed to take part in a shared middle class.  We&amp;#39;ve faced media manipulation before but it never struck at our joints; it always tried to sway us all in one direction or another rather than splitting and moving a subset.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;2) White people, even in these regions, still have basically good standards of living, even if they have dipped a bit and they feel more stress to maintain it.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;3) People didn&amp;#39;t really vote for policy--in fact, we hardly heard any policy from Trump.  Everything was primarily pitched at the gut, not the head.  He gave no international policy or plan; he didn&amp;#39;t tell us how he&amp;#39;s get the wall built or how he&amp;#39;d make Mexico pay and I doubt even his supporters really think that&amp;#39;s going to happen; in opposing globalism he actually contradicted libertarianism.  &lt;a href=\"https://www.theatlantic.com/politics/archive/2017/04/the-flip-flop-president/522840/\"&gt;He can flip-flop all he wants and not lose support.&lt;/a&gt; Also,\n&lt;a href=\"https://www.washingtonpost.com/news/the-fix/wp/2014/05/01/on-issue-after-issue-voters-favor-democrats-and-for-now-they-dont-want-to-vote-for-them-either/?utm_term=.c59d42a1080c\"&gt;we also know that most people support Democratic policy more than Republican policy, even if they don&amp;#39;t vote that way--so policy isn&amp;#39;t the real issue.&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;4) Media manipulation could only get a toe-hold in the first place by exploiting these existing resentments.  I don&amp;#39;t think FOX News has run a single story in its decades-long run that didn&amp;#39;t fundamentally come from resentment--wherever it comes from, it&amp;#39;s not reality.  FOX didn&amp;#39;t create our division, even if it has super-charged it; people complained about the left-wing media decades before that.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;This is a footnote from the CMV moderators. We&amp;#39;d like to remind you of a couple of things. Firstly, please&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules\"&gt;read through our rules&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting\"&gt;downvotes don&amp;#39;t change views&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;! Any questions or concerns? Feel free to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/message/compose?to=/r/changemyview\"&gt;message us&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;Happy CMVing!&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "People in the middle of the country--i.e. the mid-West, Rust Belt, Appalachia, and similar places--voted for Trump in larger numbers than expected.  Common explanations are \n\n* Economic: these places have never fully recovered from the recession, and automation is killing jobs\n* Social: drug addiction, hatred of the success of gay and black rights movements\n* Political: resentment at the success of Obamacare because they ideologically disagree with government intervention, a perception that we are restraining and embarrassing ourselves in global conflicts, and the growth ideological libertarianism\n* Media manipulation: Russian bots, Russian hacking, moneyed powers like Bannon and the Mercer family building organizations to distort public opinion of Clinton, and more basic media obsession with a disgusting spectacle which translates into free media for Trump  \n\nThese likely contributed some amount to middle America voting for Trump.  However, I think a stronger reason--one that more consistently unifies observed behavior--is a feeling of resentment, driven by the perception that these people are no longer valued in America.  I'm not going to argue whether they deserve respect--probably they deserve more in some ways and less in others.  I won't argue whether they are respected--I think it's clear that people who don't live in these places, on average, think the people who do live there are mostly stupid and a little crazy.  Also note that I'm not excusing or blaming these people, just explaining; this view has nothing to do with me assigning blame to anyone.\n\nHere are my positive reasons, i.e. evidence that they feel this way and it motivated them to vote for Trump.  \n\n* 1) More than ever people personally identify with their political affiliation.  Rather than voting Republican or mostly agreeing with the Republican platform, people identify as a Republican, and vote for them come hell or high water--ironically, that literally has happened, we're living through hell and are about to get a lot of high water.  They see Republicanism, patriotism, and Christianity as virtue-signaling--showing that they are good, ethical people worthy of respect.  They also see each of these things--and therefore themselves--as being condescended by liberals, and they resent it.\n\n* 2) The collapse of economic opportunities in these places is a signal to them that they have lost social value.  They culturally identify with having a strong work ethic and when there were industry, farm, and manufacturing jobs, they were rewarded for their work ethic.  Now jobless, they are desperate to bring these jobs back and reassert the values they once had confirmed in their economy and society.  That's why, rather than face the fact that these jobs are never coming back, they desperately voted for a candidate's silly promises to bring them back.  They're also suspicious that immigrants have taken these jobs and hope the jobs will come back if they deport immigrants.  They want these jobs specifically--not tech jobs, not legal jobs, not retail jobs--because they see these jobs specifically as masculine and socially valuable.\n\n* 3) [\"Establishing causation is difficult, but we know that culturally conservative white Americans who are disengaged from church experience less economic success and more family breakdown than those who remain connected, and they grow more pessimistic and resentful.\"](https://www.theatlantic.com/magazine/archive/2017/04/breaking-faith/517785/)  Church attendance was down before the election, and seems to correlate with a resentful and isolated attitude.  With queer and women's rights advancing, the explicit message was that Christianity is an ancient religion inappropriate for the modern era.  A lot of my family in Florida, and old high school friends, post defiant Christian and nostalgic posts.  Who are they defying in their Facebook network?  Well, me a little, I suppose--although they probably aren't thinking of me specifically, but me-like people who went off to college.  They're virtue signaling to their network, and feeling like their culture is decaying and under siege.  They're echo-chambering their resentment.\n\n* 4) Black people's social value is rising and middle America sees it as a decline in white social value.  Maybe it is a decline in the automatic authority, trust, and value that the nation assigns to white people's expressions; and maybe our society used to value white expressions too much, or used to devalue minority expression too much--so in a sense this is more like a course-correction rather than an injustice.  But deserve it or not, we know that people are always angry at losing anything, and rationalize why they deserved to have it.  The narrative of white privilege may be true, but for these poor Americans, they feel accused of a crime they didn't commit.  Standing in their shoes, it looks to them like they did everything right and didn't get rewarded--they have no understanding that, and no particular desire to understand that, black people have experienced worse for longer.  Segregation of populations, together with manipulated media, gives middle America ground to hold onto a comfortable fantasy that everyone else has it so easy and they have it so hard.  They feel under-valued and angry. \n\n* 5) Trump represented a shameless assertion--more like a suicidal, berzerk scream--of middle America's most exaggerated values.  It made them feel valued, considered, defended, represented, and it made everyone else feel hurt the way that they had been hurting.  He's a use car salesman in his personal history and personality, but a) subtlety is not the public's strong suit, so this didn't matter as much as the fact that he doesn't flinch, and b) they're willing to overlook his coastal elitism by deliberately focusing on an alternative if fictional narrative:  he fairly earned what he has, and he'll give everyone else the same opportunity.  In fact, Trump's main strong suit is his ability to collect and deflect responsibility regardless of whether he truly is responsible.  \n\nNow the negative reasons, i.e. why I don't think the other reasons explain enough:\n\n* 1) We've had economic troubles before but they never split along regional and cultural lines like this--we never ridiculed people in the Dust Bowl or Great Depression, because we fundamentally saw everyone as American.  Now in the recovery from the recession, coastal elitists jeer at the stupidity of middle America and their self-inflicted suffering.  We've had cultural fights but back then even relatively secular people still were Christian and asserted the value and piety of Christians, and only suggested moderation.  The Civil Rights fight was divisive but the liberal side fundamentally didn't advocate the destruction of conservatism; rather than antagonize, it begged for black people to be allowed to take part in a shared middle class.  We've faced media manipulation before but it never struck at our joints; it always tried to sway us all in one direction or another rather than splitting and moving a subset.\n\n* 2) White people, even in these regions, still have basically good standards of living, even if they have dipped a bit and they feel more stress to maintain it.  \n\n* 3) People didn't really vote for policy--in fact, we hardly heard any policy from Trump.  Everything was primarily pitched at the gut, not the head.  He gave no international policy or plan; he didn't tell us how he's get the wall built or how he'd make Mexico pay and I doubt even his supporters really think that's going to happen; in opposing globalism he actually contradicted libertarianism.  [He can flip-flop all he wants and not lose support.](https://www.theatlantic.com/politics/archive/2017/04/the-flip-flop-president/522840/) Also,\n [we also know that most people support Democratic policy more than Republican policy, even if they don't vote that way--so policy isn't the real issue.](https://www.washingtonpost.com/news/the-fix/wp/2014/05/01/on-issue-after-issue-voters-favor-democrats-and-for-now-they-dont-want-to-vote-for-them-either/?utm_term=.c59d42a1080c)\n\n* 4) Media manipulation could only get a toe-hold in the first place by exploiting these existing resentments.  I don't think FOX News has run a single story in its decades-long run that didn't fundamentally come from resentment--wherever it comes from, it's not reality.  FOX didn't create our division, even if it has super-charged it; people complained about the left-wing media decades before that.\n\n_____\n\n&gt; *This is a footnote from the CMV moderators. We'd like to remind you of a couple of things. Firstly, please* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65j62f", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 302, "report_reasons": null, "author": "AddemF", "saved": false, "mod_reports": [], "name": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": 1492264825.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/65j62f/cmv_resentment_is_the_strongest_explanation_for/", "num_reports": null, "locked": false, "stickied": false, "created": 1492293178.0, "url": "https://www.reddit.com/r/changemyview/comments/65j62f/cmv_resentment_is_the_strongest_explanation_for/", "author_flair_text": null, "quarantine": false, "title": "CMV: Resentment is the strongest explanation for middle America having voted for Trump", "created_utc": 1492264378.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 154, "visited": false, "subreddit_type": "public", "ups": 302}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgazkn1", "gilded": 0, "archived": false, "score": 41, "report_reasons": null, "author": "MuaddibMcFly", "parent_id": "t1_dgaqqez", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Oh, and polls suggested that people mostly disliked Trump\n\nPolls also showed that people (even democrats) largely disliked Clinton.  Do you also argue that the biggest reason that people voted for *her* was resentment of Trump/Republicans?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Oh, and polls suggested that people mostly disliked Trump&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Polls also showed that people (even democrats) largely disliked Clinton.  Do you also argue that the biggest reason that people voted for &lt;em&gt;her&lt;/em&gt; was resentment of Trump/Republicans?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgazkn1", "score_hidden": false, "stickied": false, "created": 1492310011.0, "created_utc": 1492281211.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 41}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgb0cs4", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Frosty_Nuggets", "parent_id": "t1_dgaqqez", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Polls were actually pretty accurate. Within a couple of points of the margin of error when it came to national popularity. It's just that under the electoral system we have, she lost the votes where it counts and he won by winning the electoral vote. The polls were surprisingly accurate, despite her losing the electoral college vote, she still won the popular vote.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Polls were actually pretty accurate. Within a couple of points of the margin of error when it came to national popularity. It&amp;#39;s just that under the electoral system we have, she lost the votes where it counts and he won by winning the electoral vote. The polls were surprisingly accurate, despite her losing the electoral college vote, she still won the popular vote.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb0cs4", "score_hidden": false, "stickied": false, "created": 1492311087.0, "created_utc": 1492282287.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgat7eg", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "swearrengen", "parent_id": "t1_dgaqqez", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Oh I'm sure many voted for Trump who disliked him.\n\nBut we are talking about turnout in the \"Appalachia, and similar places\". I'm not American, but my intuition is that these places enjoy their Wrestlemania and Miss Universe, and that Trump was already a much loved cultural icon there.\n\nThe positive qualities he represented to these people are: balls, success (in the fields of 'sports' (WWE), women, money, tv, property ownership, politics etc) and many more. And whether they believed false propositions or not is irrelevant; they saw what they saw, Trump in the WWE ring as a participating owner and actor in their operas, Trump with beautiful women, Trump in a Jet on in front of a gold tower with his name on it, Trump with a Handsome family, with his own TV show and fanbase, popular and rich. That's it, that was the ball game, as far as positive aspirational qualities go.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh I&amp;#39;m sure many voted for Trump who disliked him.&lt;/p&gt;\n\n&lt;p&gt;But we are talking about turnout in the &amp;quot;Appalachia, and similar places&amp;quot;. I&amp;#39;m not American, but my intuition is that these places enjoy their Wrestlemania and Miss Universe, and that Trump was already a much loved cultural icon there.&lt;/p&gt;\n\n&lt;p&gt;The positive qualities he represented to these people are: balls, success (in the fields of &amp;#39;sports&amp;#39; (WWE), women, money, tv, property ownership, politics etc) and many more. And whether they believed false propositions or not is irrelevant; they saw what they saw, Trump in the WWE ring as a participating owner and actor in their operas, Trump with beautiful women, Trump in a Jet on in front of a gold tower with his name on it, Trump with a Handsome family, with his own TV show and fanbase, popular and rich. That&amp;#39;s it, that was the ball game, as far as positive aspirational qualities go.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgat7eg", "score_hidden": false, "stickied": false, "created": 1492301245.0, "created_utc": 1492272445.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgc4ap0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "whitef530", "parent_id": "t1_dgc3w9v", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sorry Left_of_Center2011, your comment has been removed: \n\n&gt; Comment Rule 3\\. \"Refrain from accusing OP or anyone else of being unwilling to change their view or of arguing in bad faith. If you are unsure whether someone is genuine, ask clarifying questions (see: socratic method). If you think they are still exhibiting ill behaviour, please message us.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_3)  \n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Rule+3+Appeal+Left_of_Center2011&amp;message=Left_of_Center2011+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/65j62f/cmv_resentment_is_the_strongest_explanation_for/dgc3w9v/\\))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry Left_of_Center2011, your comment has been removed: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 3. &amp;quot;Refrain from accusing OP or anyone else of being unwilling to change their view or of arguing in bad faith. If you are unsure whether someone is genuine, ask clarifying questions (see: socratic method). If you think they are still exhibiting ill behaviour, please message us.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_3\"&gt;See the wiki page for more information.&lt;/a&gt;  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Rule+3+Appeal+Left_of_Center2011&amp;amp;message=Left_of_Center2011+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/65j62f/cmv_resentment_is_the_strongest_explanation_for/dgc3w9v/)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgc4ap0", "score_hidden": false, "stickied": false, "created": 1492383749.0, "created_utc": 1492354949.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc3w9v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgbc7yi", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgc3w9v", "score_hidden": false, "stickied": false, "created": 1492383146.0, "created_utc": 1492354346.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbc7yi", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "probably_dead", "parent_id": "t1_dgb8r8g", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I don't know if you're joking or not, but I'll assume not.\n\nPlease expand on your points for me-\n\n&gt;I like him because he learns\n\nWhat is he learning? It seems that he was more concerned about winning the election than he was about preparing for the role of he won. He's learning in the same way a student who hasn't studied is learning the material from the test.\n\nBy contrast, Obama came into the office ready to be president. Or at least, as ready as anyone not already President can be. His policy and positions were already formed through years of public office, and were his platform. Guided, direct policy instead of Trumps vague and insubstantial appeal to Pathos.\n\n&gt;His rigidity stalled the country.\n\nI recall the 117th Congress to be the stalling force, as it worked to entirely halt any and all attempts Obama made to pass legislation, even when he tried to make compromises. As a separate issue, didn't Obama attempt to prevent the government from shutting down by compromising on the budget, and the Republican lead Congress refused to budge and caused the shut down? And didn't they also blame Obama for it after the fact, despite the fact the ball was in their court?\n\n&gt;Trump is our political savior.\n\nLet's agree to disagree. We clearly have different views on the role of government.\n\n&gt;Both left and right must agree.\n\nThat's not how democracy works. Nor a free electorate. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if you&amp;#39;re joking or not, but I&amp;#39;ll assume not.&lt;/p&gt;\n\n&lt;p&gt;Please expand on your points for me-&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I like him because he learns&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What is he learning? It seems that he was more concerned about winning the election than he was about preparing for the role of he won. He&amp;#39;s learning in the same way a student who hasn&amp;#39;t studied is learning the material from the test.&lt;/p&gt;\n\n&lt;p&gt;By contrast, Obama came into the office ready to be president. Or at least, as ready as anyone not already President can be. His policy and positions were already formed through years of public office, and were his platform. Guided, direct policy instead of Trumps vague and insubstantial appeal to Pathos.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;His rigidity stalled the country.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I recall the 117th Congress to be the stalling force, as it worked to entirely halt any and all attempts Obama made to pass legislation, even when he tried to make compromises. As a separate issue, didn&amp;#39;t Obama attempt to prevent the government from shutting down by compromising on the budget, and the Republican lead Congress refused to budge and caused the shut down? And didn&amp;#39;t they also blame Obama for it after the fact, despite the fact the ball was in their court?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Trump is our political savior.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Let&amp;#39;s agree to disagree. We clearly have different views on the role of government.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Both left and right must agree.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s not how democracy works. Nor a free electorate. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbc7yi", "score_hidden": false, "stickied": false, "created": 1492327550.0, "created_utc": 1492298750.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb8r8g", "gilded": 0, "archived": false, "score": -22, "report_reasons": null, "author": "SeanACarlos", "parent_id": "t1_dgaqqez", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I like him because he learns.\n\nObama could never do that in the millions of years he was in office.\n\nHe never changed positions in the face of reality and his rigidity stalled the country.\n\nTrump is our political savior.\n\nBoth left and right must agree.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like him because he learns.&lt;/p&gt;\n\n&lt;p&gt;Obama could never do that in the millions of years he was in office.&lt;/p&gt;\n\n&lt;p&gt;He never changed positions in the face of reality and his rigidity stalled the country.&lt;/p&gt;\n\n&lt;p&gt;Trump is our political savior.&lt;/p&gt;\n\n&lt;p&gt;Both left and right must agree.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb8r8g", "score_hidden": false, "stickied": false, "created": 1492322524.0, "created_utc": 1492293724.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -22}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaqqez", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "AddemF", "parent_id": "t1_dgapovg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Oh, and polls suggested that people mostly disliked Trump, even Republicans--polls were not very reliable this last election, but the shear size of the numbers makes it hard to ignore.  Even people at his rallies sometimes admitted that they didn't like him but just hated Hillary.  He gained a large portion of the religious vote in spite of being a thread-bare lying atheist. \n \nMoreover, for those excited, why were they excited?  It seems to me they were excited precisely because he expressed the resentment they felt.  He didn't have positive qualities that people could rally behind, just antagonistic ones.  People were manipulated into thinking he was a good business man and would bring jobs back, but those are clearly false propositions--media, exploiting their hatred of liberal media and garnering their unwavering support in the face of facts, convinced them otherwise.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, and polls suggested that people mostly disliked Trump, even Republicans--polls were not very reliable this last election, but the shear size of the numbers makes it hard to ignore.  Even people at his rallies sometimes admitted that they didn&amp;#39;t like him but just hated Hillary.  He gained a large portion of the religious vote in spite of being a thread-bare lying atheist. &lt;/p&gt;\n\n&lt;p&gt;Moreover, for those excited, why were they excited?  It seems to me they were excited precisely because he expressed the resentment they felt.  He didn&amp;#39;t have positive qualities that people could rally behind, just antagonistic ones.  People were manipulated into thinking he was a good business man and would bring jobs back, but those are clearly false propositions--media, exploiting their hatred of liberal media and garnering their unwavering support in the face of facts, convinced them otherwise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaqqez", "score_hidden": false, "stickied": false, "created": 1492297770.0, "created_utc": 1492268970.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgaqc0p", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "AddemF", "parent_id": "t1_dgapovg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Not sure what the opposite would be, although something positive perhaps.  But the opposite isn't necessary--just the lack of resentment could be adequate--or the existence of some other dominating explanation.\n\nCultural identity explains some of the behavior, probably the base-line of unmovable Republican voters.  It doesn't explain the larger-than-expected numbers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not sure what the opposite would be, although something positive perhaps.  But the opposite isn&amp;#39;t necessary--just the lack of resentment could be adequate--or the existence of some other dominating explanation.&lt;/p&gt;\n\n&lt;p&gt;Cultural identity explains some of the behavior, probably the base-line of unmovable Republican voters.  It doesn&amp;#39;t explain the larger-than-expected numbers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaqc0p", "score_hidden": false, "stickied": false, "created": 1492297177.0, "created_utc": 1492268377.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgb0ndm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RustyRook", "parent_id": "t1_dgazxjq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sorry a2theharris, your comment has been removed: \n\n&gt; Comment Rule 5\\. \"No low effort comments. Comments that are only jokes, links, or 'written upvotes', for example. Humor, links, and affirmations of agreement can be contained within more substantial comments.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5)\n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Rule+5+Appeal+a2theharris&amp;message=a2theharris+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/65j62f/cmv_resentment_is_the_strongest_explanation_for/dgazxjq/\\))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry a2theharris, your comment has been removed: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 5. &amp;quot;No low effort comments. Comments that are only jokes, links, or &amp;#39;written upvotes&amp;#39;, for example. Humor, links, and affirmations of agreement can be contained within more substantial comments.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5\"&gt;See the wiki page for more information.&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Rule+5+Appeal+a2theharris&amp;amp;message=a2theharris+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/65j62f/cmv_resentment_is_the_strongest_explanation_for/dgazxjq/)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb0ndm", "score_hidden": false, "stickied": false, "created": 1492311478.0, "created_utc": 1492282678.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgazxjq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgapovg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgazxjq", "score_hidden": false, "stickied": false, "created": 1492310506.0, "created_utc": 1492281706.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgapovg", "gilded": 0, "archived": false, "score": 148, "report_reasons": null, "author": "swearrengen", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "What's the opposite of resentment? Admiration? Excited? I think they were excited by Trump.\n\nKeep the motive simple, at the identity/values level - as something felt in 6 seconds by realizing it's election day and should you bother go vote, even if you don't really follow politics?\n\nThe choice was Trump or Clinton.\n\nTrump was Wrestlemania, Miss Universe, Apprentice Big Boss, Trump Plane, Trump Buildings - Muscle, Breasts, Power, Guns, Big Trucks, American Flags....with balls enough to insult opponent after opponent without fear or apology. That was invigorating.\n\nClinton was the direct opposite, the antithesis. Politically Correct, Washington, Boring, Tired and Tried. That's not very charming or exciting.\n\nPeople come out to vote in larger numbers when they are positively energised as a motive. Trump's identity had positive appeal in those areas.\n\n\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What&amp;#39;s the opposite of resentment? Admiration? Excited? I think they were excited by Trump.&lt;/p&gt;\n\n&lt;p&gt;Keep the motive simple, at the identity/values level - as something felt in 6 seconds by realizing it&amp;#39;s election day and should you bother go vote, even if you don&amp;#39;t really follow politics?&lt;/p&gt;\n\n&lt;p&gt;The choice was Trump or Clinton.&lt;/p&gt;\n\n&lt;p&gt;Trump was Wrestlemania, Miss Universe, Apprentice Big Boss, Trump Plane, Trump Buildings - Muscle, Breasts, Power, Guns, Big Trucks, American Flags....with balls enough to insult opponent after opponent without fear or apology. That was invigorating.&lt;/p&gt;\n\n&lt;p&gt;Clinton was the direct opposite, the antithesis. Politically Correct, Washington, Boring, Tired and Tried. That&amp;#39;s not very charming or exciting.&lt;/p&gt;\n\n&lt;p&gt;People come out to vote in larger numbers when they are positively energised as a motive. Trump&amp;#39;s identity had positive appeal in those areas.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgapovg", "score_hidden": false, "stickied": false, "created": 1492296201.0, "created_utc": 1492267401.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 148}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgc0ihp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AddemF", "parent_id": "t1_dgbmcmn", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "This is the same thing that I've argued here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the same thing that I&amp;#39;ve argued here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgc0ihp", "score_hidden": false, "stickied": false, "created": 1492377409.0, "created_utc": 1492348609.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbmcmn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fzammetti", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I continue to believe that the single biggest factor to his win was an F U to the Democratic party and the liberal elite attitude... and before anyone takes offense and downvotes, please read. \n\nAt some point, it's not about whether an opponent is right or wrong about any particular issue. It becomes more about becoming fed up with the attitude that tacitly puts down anyone who doesn't agree, the view that anyone who doesn't line up EXACTLY with you is somehow less than you. I firmly believe this attitude became very prevalent with those on the left generally during the Obama years. And, not only was that the attitude but they were constantly, ceaselessly and loudly vocal about it. Nobody was hiding it. People like Bill Maher are a prime example, but far from a unique one. And again, they might have been right about everything they were saying, but that simply ceases to matter at some point. \n\nI think Trump's election was nothing but a referendum on the liberal elitism that has become the mark of the left (well, the far left certainly). People became so fed up with being told they were wrong and were essentially inferior mentally that they just wanted to raise a middle finger and Trump was it. I personally hope the left learns the lesson, gain some humility and change their ways, rather than doubling down on the holier-than-thou, \"we're right and to hell with you if you think otherwise\" mentality. Time will tell, but that's what I maintain was primarily behind Trump's election regardless. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I continue to believe that the single biggest factor to his win was an F U to the Democratic party and the liberal elite attitude... and before anyone takes offense and downvotes, please read. &lt;/p&gt;\n\n&lt;p&gt;At some point, it&amp;#39;s not about whether an opponent is right or wrong about any particular issue. It becomes more about becoming fed up with the attitude that tacitly puts down anyone who doesn&amp;#39;t agree, the view that anyone who doesn&amp;#39;t line up EXACTLY with you is somehow less than you. I firmly believe this attitude became very prevalent with those on the left generally during the Obama years. And, not only was that the attitude but they were constantly, ceaselessly and loudly vocal about it. Nobody was hiding it. People like Bill Maher are a prime example, but far from a unique one. And again, they might have been right about everything they were saying, but that simply ceases to matter at some point. &lt;/p&gt;\n\n&lt;p&gt;I think Trump&amp;#39;s election was nothing but a referendum on the liberal elitism that has become the mark of the left (well, the far left certainly). People became so fed up with being told they were wrong and were essentially inferior mentally that they just wanted to raise a middle finger and Trump was it. I personally hope the left learns the lesson, gain some humility and change their ways, rather than doubling down on the holier-than-thou, &amp;quot;we&amp;#39;re right and to hell with you if you think otherwise&amp;quot; mentality. Time will tell, but that&amp;#39;s what I maintain was primarily behind Trump&amp;#39;s election regardless. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbmcmn", "score_hidden": false, "stickied": false, "created": 1492342225.0, "created_utc": 1492313425.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgaqee8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AddemF", "parent_id": "t1_dgapqag", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm not looking for any particular response except a relevant one.  Talk of other emotions is fair game, but explanations not in terms of emotion is too.  I think you're projecting a lot of assumptions onto me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not looking for any particular response except a relevant one.  Talk of other emotions is fair game, but explanations not in terms of emotion is too.  I think you&amp;#39;re projecting a lot of assumptions onto me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaqee8", "score_hidden": false, "stickied": false, "created": 1492297276.0, "created_utc": 1492268476.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgapqag", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "22254534", "parent_id": "t1_dgapgin", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think you are look for someone in this thread to say it was \"hope\" or \"fear\" or \"hate\" or something like that that drove this election and I dont think that's an argument worth making.\n\nI still think it's really silly to even bother to try and boil down an election into one word and even if it was possible, what would be the point?\n\nI think that's really the most succint way I can put it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you are look for someone in this thread to say it was &amp;quot;hope&amp;quot; or &amp;quot;fear&amp;quot; or &amp;quot;hate&amp;quot; or something like that that drove this election and I dont think that&amp;#39;s an argument worth making.&lt;/p&gt;\n\n&lt;p&gt;I still think it&amp;#39;s really silly to even bother to try and boil down an election into one word and even if it was possible, what would be the point?&lt;/p&gt;\n\n&lt;p&gt;I think that&amp;#39;s really the most succint way I can put it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgapqag", "score_hidden": false, "stickied": false, "created": 1492296259.0, "created_utc": 1492267459.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgba6mq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SeanACarlos", "parent_id": "t1_dgapgin", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Trump voters are not using negative emotions to evaluate their choices.\n\nThey used positive emotions toward Trump otherwise they would have given up hope and not voted at all.\n\nWho lifts a lazy finger to do something destructive without (good) reason?\n\nNo one ever.\n\nMaybe... the Joker, or Freddy Kruger, or Mike Meyers or Aliens 3... Take your pick and then realize people are not characters in a movie.\n\nPeople are not evil like they portray themselves to be. They act evil because they are afraid. They think reflecting the fear of the world back on it will protect them.\n\nIgnorance is always a problem for people. Don't attribute to malice... etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trump voters are not using negative emotions to evaluate their choices.&lt;/p&gt;\n\n&lt;p&gt;They used positive emotions toward Trump otherwise they would have given up hope and not voted at all.&lt;/p&gt;\n\n&lt;p&gt;Who lifts a lazy finger to do something destructive without (good) reason?&lt;/p&gt;\n\n&lt;p&gt;No one ever.&lt;/p&gt;\n\n&lt;p&gt;Maybe... the Joker, or Freddy Kruger, or Mike Meyers or Aliens 3... Take your pick and then realize people are not characters in a movie.&lt;/p&gt;\n\n&lt;p&gt;People are not evil like they portray themselves to be. They act evil because they are afraid. They think reflecting the fear of the world back on it will protect them.&lt;/p&gt;\n\n&lt;p&gt;Ignorance is always a problem for people. Don&amp;#39;t attribute to malice... etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgba6mq", "score_hidden": false, "stickied": false, "created": 1492324566.0, "created_utc": 1492295766.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgapgin", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "AddemF", "parent_id": "t1_dgapa1i", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm a conservative, and I pretty routinely self-evaluate my beliefs--I'm not sure exactly what you think I'm not doing correctly.  Perhaps you can be more specific.\n\nYou could say people resented Bush, but that would not explain the strong positive feelings expressed in polling for Obama.  It's there, maybe, but it's not a great explanation for that event.  I'm also not sure that's the right word--\"hate\", \"regret\", and others seem appropriate.  But \"resent\" more expresses a personally felt negative, evaluative, usually moral judgment.\n\nAnd I recognized the economic argument in my post--and dismissed it because, although I recognize it explains something, I don't think it does as good of a job as resentment.", "edited": 1492269244.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a conservative, and I pretty routinely self-evaluate my beliefs--I&amp;#39;m not sure exactly what you think I&amp;#39;m not doing correctly.  Perhaps you can be more specific.&lt;/p&gt;\n\n&lt;p&gt;You could say people resented Bush, but that would not explain the strong positive feelings expressed in polling for Obama.  It&amp;#39;s there, maybe, but it&amp;#39;s not a great explanation for that event.  I&amp;#39;m also not sure that&amp;#39;s the right word--&amp;quot;hate&amp;quot;, &amp;quot;regret&amp;quot;, and others seem appropriate.  But &amp;quot;resent&amp;quot; more expresses a personally felt negative, evaluative, usually moral judgment.&lt;/p&gt;\n\n&lt;p&gt;And I recognized the economic argument in my post--and dismissed it because, although I recognize it explains something, I don&amp;#39;t think it does as good of a job as resentment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgapgin", "score_hidden": false, "stickied": false, "created": 1492295845.0, "created_utc": 1492267045.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgapa1i", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "22254534", "parent_id": "t1_dgaozz5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think you need to take a hard look at your political views and their origins it sounds like you are regurgitating pundit talking pointss\n\nI could easily say\n\nA lot of people resented Bush and that's why they voted for Obama\n\nA lot of people voted for Trump because they hoped he could make their lives better\n\nAnd they would both be true because there are a lot of people in this country with different views and you will hear them both because there are a lot of different pundits trying to appeal to different audiences.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you need to take a hard look at your political views and their origins it sounds like you are regurgitating pundit talking pointss&lt;/p&gt;\n\n&lt;p&gt;I could easily say&lt;/p&gt;\n\n&lt;p&gt;A lot of people resented Bush and that&amp;#39;s why they voted for Obama&lt;/p&gt;\n\n&lt;p&gt;A lot of people voted for Trump because they hoped he could make their lives better&lt;/p&gt;\n\n&lt;p&gt;And they would both be true because there are a lot of people in this country with different views and you will hear them both because there are a lot of different pundits trying to appeal to different audiences.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgapa1i", "score_hidden": false, "stickied": false, "created": 1492295560.0, "created_utc": 1492266760.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgaxpb1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Twitchingeagle", "parent_id": "t1_dgaozz5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "People actually liked Obama.  He was charismatic, and the media painted him as liberal Jesus.  Most of Americans voted for the man, and that includes middle America.  People just happened to see that was a huge mistake with all the shady, anti-American things he did.  So, they voted for anyone they could that wasn't a globalist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People actually liked Obama.  He was charismatic, and the media painted him as liberal Jesus.  Most of Americans voted for the man, and that includes middle America.  People just happened to see that was a huge mistake with all the shady, anti-American things he did.  So, they voted for anyone they could that wasn&amp;#39;t a globalist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaxpb1", "score_hidden": false, "stickied": false, "created": 1492307452.0, "created_utc": 1492278652.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgbjri6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "davidildo", "parent_id": "t1_dgaozz5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Why would you think there needs to be a unifying explanation? People do not like hillary and voted against her. She has a ton of baggage from her husband's term, and few scandals, and I think a lot of people just font want to go through that stuff again. \n\nOther than that, if you want a unifying explanation, hillary lost voters in Wisconsin because she didn't show up there to campaign , didn't spend enough in Michigan, and lost union votes because of her support for nafta.  She also came across as entitled to the throne because she is hillary and a woman, and judging by her joker smile during the debate, she knew she was perceived as cold.\n\nMostly though, she just couldn't get the key demographics to show up. She just couldn't present a unifying vision that got people wanting to vote for her. Thanks campaign became boys vs girls and trump is unfit. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why would you think there needs to be a unifying explanation? People do not like hillary and voted against her. She has a ton of baggage from her husband&amp;#39;s term, and few scandals, and I think a lot of people just font want to go through that stuff again. &lt;/p&gt;\n\n&lt;p&gt;Other than that, if you want a unifying explanation, hillary lost voters in Wisconsin because she didn&amp;#39;t show up there to campaign , didn&amp;#39;t spend enough in Michigan, and lost union votes because of her support for nafta.  She also came across as entitled to the throne because she is hillary and a woman, and judging by her joker smile during the debate, she knew she was perceived as cold.&lt;/p&gt;\n\n&lt;p&gt;Mostly though, she just couldn&amp;#39;t get the key demographics to show up. She just couldn&amp;#39;t present a unifying vision that got people wanting to vote for her. Thanks campaign became boys vs girls and trump is unfit. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbjri6", "score_hidden": false, "stickied": false, "created": 1492338363.0, "created_utc": 1492309563.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgb9var", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "SeanACarlos", "parent_id": "t1_dgaozz5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "News to the wise:\n\nPeople choose the option they think is best.\n\nWhen?\n\nAlways.\n\nResentment only drives ignorant behaviors.\n\nAll human behavior is driven by data based preference for the resulting situations expressed through the choice at hand...\n\n...or the logic of the situation.\n\nNot emotion.\n\nLogic chose Trump.\n\nTrump voters are not ignorant savages praying to Kali to eat their children. They are logic based entities who live and experience reality like you do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;News to the wise:&lt;/p&gt;\n\n&lt;p&gt;People choose the option they think is best.&lt;/p&gt;\n\n&lt;p&gt;When?&lt;/p&gt;\n\n&lt;p&gt;Always.&lt;/p&gt;\n\n&lt;p&gt;Resentment only drives ignorant behaviors.&lt;/p&gt;\n\n&lt;p&gt;All human behavior is driven by data based preference for the resulting situations expressed through the choice at hand...&lt;/p&gt;\n\n&lt;p&gt;...or the logic of the situation.&lt;/p&gt;\n\n&lt;p&gt;Not emotion.&lt;/p&gt;\n\n&lt;p&gt;Logic chose Trump.&lt;/p&gt;\n\n&lt;p&gt;Trump voters are not ignorant savages praying to Kali to eat their children. They are logic based entities who live and experience reality like you do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb9var", "score_hidden": false, "stickied": false, "created": 1492324102.0, "created_utc": 1492295302.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaozz5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AddemF", "parent_id": "t1_dgaouv8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Perhaps, although that would just be conceding the point then.\n\nBut no, actually I don't think past elections were about resentment--with Obama I would explain it as enthusiasm and genuine hope.  With Bush, I think it was kind of a toss-up with Gore, so there is no particularly unifying explanation, but maybe Bush won because he was more charismatic than Gore.  With Clinton, it was the hope that he could usher in a new era of moderate Dems.  And so on.  I think you'd have to go back a long way to find an election driven specifically by resentment, if you could ever find one at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Perhaps, although that would just be conceding the point then.&lt;/p&gt;\n\n&lt;p&gt;But no, actually I don&amp;#39;t think past elections were about resentment--with Obama I would explain it as enthusiasm and genuine hope.  With Bush, I think it was kind of a toss-up with Gore, so there is no particularly unifying explanation, but maybe Bush won because he was more charismatic than Gore.  With Clinton, it was the hope that he could usher in a new era of moderate Dems.  And so on.  I think you&amp;#39;d have to go back a long way to find an election driven specifically by resentment, if you could ever find one at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaozz5", "score_hidden": false, "stickied": false, "created": 1492295110.0, "created_utc": 1492266310.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaouv8", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "22254534", "parent_id": "t1_dgaoqoh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "But couldn't you characterize every election that way? The winner won because the voters resented the loser? Is this really a view or is it just a tautology?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But couldn&amp;#39;t you characterize every election that way? The winner won because the voters resented the loser? Is this really a view or is it just a tautology?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaouv8", "score_hidden": false, "stickied": false, "created": 1492294873.0, "created_utc": 1492266073.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgb9inu", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "SeanACarlos", "parent_id": "t1_dgaoqoh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Resentment implies that people resent their lives.\n\nPeople don't resent their lives otherwise suicide would be much more common.\n\nSuicide is the answer to resentment.\n\nVoting your conscience is not the answer to resentment.\n\nMiddle America voted for the best option they have and a majority of Trump voters were enthusiastic with the prospect of a doer in the white house, (according to the people I talked to on Twitter).\n\nNo resentment towards slick talk. Trump has a greasy slipperiness to his speech patterns, anyone with ears would agree.\n\nBut he can bend, learn and get things done, (hopefully).\n\nObama was so rigid he experienced a structural failure when exposed to the harsh wind of reality.\n\nThat sometimes happens to a rigid ideologue.\n\nUnless the rigidity is rigid conformity to the facts of reality.\n\nTrump grasps this.\n\nRachel Maddow does not.\n\nSad. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Resentment implies that people resent their lives.&lt;/p&gt;\n\n&lt;p&gt;People don&amp;#39;t resent their lives otherwise suicide would be much more common.&lt;/p&gt;\n\n&lt;p&gt;Suicide is the answer to resentment.&lt;/p&gt;\n\n&lt;p&gt;Voting your conscience is not the answer to resentment.&lt;/p&gt;\n\n&lt;p&gt;Middle America voted for the best option they have and a majority of Trump voters were enthusiastic with the prospect of a doer in the white house, (according to the people I talked to on Twitter).&lt;/p&gt;\n\n&lt;p&gt;No resentment towards slick talk. Trump has a greasy slipperiness to his speech patterns, anyone with ears would agree.&lt;/p&gt;\n\n&lt;p&gt;But he can bend, learn and get things done, (hopefully).&lt;/p&gt;\n\n&lt;p&gt;Obama was so rigid he experienced a structural failure when exposed to the harsh wind of reality.&lt;/p&gt;\n\n&lt;p&gt;That sometimes happens to a rigid ideologue.&lt;/p&gt;\n\n&lt;p&gt;Unless the rigidity is rigid conformity to the facts of reality.&lt;/p&gt;\n\n&lt;p&gt;Trump grasps this.&lt;/p&gt;\n\n&lt;p&gt;Rachel Maddow does not.&lt;/p&gt;\n\n&lt;p&gt;Sad. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb9inu", "score_hidden": false, "stickied": false, "created": 1492323598.0, "created_utc": 1492294798.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaoqoh", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "AddemF", "parent_id": "t1_dgaoo7v", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "Thesis:  The best, most unifying explanation of why people voted for Trump in larger-than-expected numbers is the feeling of resentment in middle America.\n\nThe rest of the post is clarification and giving reasons.  \n\nI would take as a successful counter-argument:  The exhibition that some other explanation has more support and explains a larger variety of behavior--or that resentment does not have as much support as I think it does, or does not explain as wide a variety of behavior as I claim it does.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thesis:  The best, most unifying explanation of why people voted for Trump in larger-than-expected numbers is the feeling of resentment in middle America.&lt;/p&gt;\n\n&lt;p&gt;The rest of the post is clarification and giving reasons.  &lt;/p&gt;\n\n&lt;p&gt;I would take as a successful counter-argument:  The exhibition that some other explanation has more support and explains a larger variety of behavior--or that resentment does not have as much support as I think it does, or does not explain as wide a variety of behavior as I claim it does.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaoqoh", "score_hidden": false, "stickied": false, "created": 1492294679.0, "created_utc": 1492265879.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaoo7v", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "22254534", "parent_id": "t1_dgaokrr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm confused what this cmv is about now, could you try and restate your thesis in one or two sentences and then the thesis you want us to convince you of.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m confused what this cmv is about now, could you try and restate your thesis in one or two sentences and then the thesis you want us to convince you of.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaoo7v", "score_hidden": false, "stickied": false, "created": 1492294567.0, "created_utc": 1492265767.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgcd26s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crackeddagger", "parent_id": "t1_dgaokrr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; It adds understanding which, when we have it, makes us better at communicating.\n\nYou're telling these people that are telling you why they actually voted for the guy that what they are telling you is not true! That's the opposite of understanding and being better at communicating! \n\nWhat's worse, they are not giving you these opinions unsolicited. You asked!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It adds understanding which, when we have it, makes us better at communicating.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re telling these people that are telling you why they actually voted for the guy that what they are telling you is not true! That&amp;#39;s the opposite of understanding and being better at communicating! &lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s worse, they are not giving you these opinions unsolicited. You asked!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgcd26s", "score_hidden": false, "stickied": false, "created": 1492395484.0, "created_utc": 1492366684.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgb96gj", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "SeanACarlos", "parent_id": "t1_dgaokrr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;  I also find it hard to believe that an avowed sexual assaulter, notorious racist, and documented crook winning the presidency without a shred of credibility isn't a ... \"novelty\" to put it mildly.\n\nExcept it has happened an infinite amount of times across infinite cultures in infinite time and space.\n\nAccept it as a normal occurrence, apply the new lessons to the past. Progress in our thinking. It can happen.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I also find it hard to believe that an avowed sexual assaulter, notorious racist, and documented crook winning the presidency without a shred of credibility isn&amp;#39;t a ... &amp;quot;novelty&amp;quot; to put it mildly.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Except it has happened an infinite amount of times across infinite cultures in infinite time and space.&lt;/p&gt;\n\n&lt;p&gt;Accept it as a normal occurrence, apply the new lessons to the past. Progress in our thinking. It can happen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb96gj", "score_hidden": false, "stickied": false, "created": 1492323118.0, "created_utc": 1492294318.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaokrr", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "AddemF", "parent_id": "t1_dgao984", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I would say that it diagnoses the unifying experience which drove people to say, do, and vote as they did, in larger numbers than expected.  It adds understanding which, when we have it, makes us better at communicating.  I also find it hard to believe that an avowed sexual assaulter, notorious racist, and documented crook winning the presidency without a shred of credibility isn't a ... \"novelty\" to put it mildly.", "edited": 1492266818.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would say that it diagnoses the unifying experience which drove people to say, do, and vote as they did, in larger numbers than expected.  It adds understanding which, when we have it, makes us better at communicating.  I also find it hard to believe that an avowed sexual assaulter, notorious racist, and documented crook winning the presidency without a shred of credibility isn&amp;#39;t a ... &amp;quot;novelty&amp;quot; to put it mildly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaokrr", "score_hidden": false, "stickied": false, "created": 1492294410.0, "created_utc": 1492265610.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -6}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgao984", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "22254534", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Is \"resentment\" really the best word to describe all of these things or insightful at all? People disagree about all of the issue you listed, that's politics. It really doesn't add anything to the conversation to say these different groups of people voted different ways because they disagreed on an issue.\n\nI think you are making the mistake in thinking this election was some kind of novelty based on the results and I disagree. Trump isn't anything new. Other Republicans like Mitt Romney and John McCain had very similar electoral results they were only off a few percentage points in the popular vote from having the same result.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is &amp;quot;resentment&amp;quot; really the best word to describe all of these things or insightful at all? People disagree about all of the issue you listed, that&amp;#39;s politics. It really doesn&amp;#39;t add anything to the conversation to say these different groups of people voted different ways because they disagreed on an issue.&lt;/p&gt;\n\n&lt;p&gt;I think you are making the mistake in thinking this election was some kind of novelty based on the results and I disagree. Trump isn&amp;#39;t anything new. Other Republicans like Mitt Romney and John McCain had very similar electoral results they were only off a few percentage points in the popular vote from having the same result.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgao984", "score_hidden": false, "stickied": false, "created": 1492293867.0, "created_utc": 1492265067.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgaxl79", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "hacksoncode", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;1) More than ever people personally identify with their political affiliation. Rather than voting Republican or mostly agreeing with the Republican platform, people identify as a Republican, and vote for them come hell or high water--ironically, that literally has happened, we're living through hell and are about to get a lot of high water. They see Republicanism, patriotism, and Christianity as virtue-signaling--showing that they are good, ethical people worthy of respect. They also see each of these things--and therefore themselves--as being condescended by liberals, and they resent it.\n\nThe definition of \"resentment\" is (from google/oxforddictionaries): bitter indignation at having been treated unfairly.\n\nI'm just going to use this point as an example, but nearly all of your explanations don't really have anything to do with \"resentment\" other than you labeling it that.\n\nFirst you say \"people vote Republican because they identify Republican and are virtue signalling\", and then you throw in a non sequitur about \"resentment\". \n\nEither they are voting Republican because they identify as Republican or not. If they are, it's not \"resentment\"... it's because they identify as Republican. If they aren't, then what does this point have to do with anything? \n\nIn all, the only one of your points that has anything to do with \"resentment\" itself is #4.\n\nEverything is else \"I voted because I have problem X\" and then added the non sequitur \"therefore they voted because of resentment\". \n\nHow about considering that they voted because of the problem?\n\nI mean, if you're going to argue that every problem entails resenting that you have the problem, fine, but then your view really is just \"people voted for Trump because they are having problems\". \n\nEDIT: more detail. #1 says they voted because they identify as Republican. #2 says they voted because the candidate promised to give them \"back\" something. #3 says they voted because they are nostalgic and Christian and virtue signalling this. #4 is actually about resentment at being attacked for something they didn't do. #5 doesn't even bother saying anything about \"resentment\". You've basically given 4 reasons that aren't \"resentment\" and one that is.", "edited": 1492278860.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;1) More than ever people personally identify with their political affiliation. Rather than voting Republican or mostly agreeing with the Republican platform, people identify as a Republican, and vote for them come hell or high water--ironically, that literally has happened, we&amp;#39;re living through hell and are about to get a lot of high water. They see Republicanism, patriotism, and Christianity as virtue-signaling--showing that they are good, ethical people worthy of respect. They also see each of these things--and therefore themselves--as being condescended by liberals, and they resent it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The definition of &amp;quot;resentment&amp;quot; is (from google/oxforddictionaries): bitter indignation at having been treated unfairly.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just going to use this point as an example, but nearly all of your explanations don&amp;#39;t really have anything to do with &amp;quot;resentment&amp;quot; other than you labeling it that.&lt;/p&gt;\n\n&lt;p&gt;First you say &amp;quot;people vote Republican because they identify Republican and are virtue signalling&amp;quot;, and then you throw in a non sequitur about &amp;quot;resentment&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Either they are voting Republican because they identify as Republican or not. If they are, it&amp;#39;s not &amp;quot;resentment&amp;quot;... it&amp;#39;s because they identify as Republican. If they aren&amp;#39;t, then what does this point have to do with anything? &lt;/p&gt;\n\n&lt;p&gt;In all, the only one of your points that has anything to do with &amp;quot;resentment&amp;quot; itself is #4.&lt;/p&gt;\n\n&lt;p&gt;Everything is else &amp;quot;I voted because I have problem X&amp;quot; and then added the non sequitur &amp;quot;therefore they voted because of resentment&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;How about considering that they voted because of the problem?&lt;/p&gt;\n\n&lt;p&gt;I mean, if you&amp;#39;re going to argue that every problem entails resenting that you have the problem, fine, but then your view really is just &amp;quot;people voted for Trump because they are having problems&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;EDIT: more detail. #1 says they voted because they identify as Republican. #2 says they voted because the candidate promised to give them &amp;quot;back&amp;quot; something. #3 says they voted because they are nostalgic and Christian and virtue signalling this. #4 is actually about resentment at being attacked for something they didn&amp;#39;t do. #5 doesn&amp;#39;t even bother saying anything about &amp;quot;resentment&amp;quot;. You&amp;#39;ve basically given 4 reasons that aren&amp;#39;t &amp;quot;resentment&amp;quot; and one that is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaxl79", "score_hidden": false, "stickied": false, "created": 1492307298.0, "created_utc": 1492278498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgash47", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "FlexPlexico12", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think that frustration and desperation are better words than resentment. I most often see the term resentment to write off the republican complaint/vote. They resented x minority, therefore their vote is a hateful and invalid.\n\nI think that there are real problems going on in rural America that are being ignored. Drug addiction, suicide, and job loss all come to mind. I was raised in Georgia, and have spent a good amount of time in the country. Everywhere you look, old barns and farm houses are in a state of decay. Old farm towns sit mostly empty. These people are quite literally watching their way of life crumble before their eyes and they are being played as the villain.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that frustration and desperation are better words than resentment. I most often see the term resentment to write off the republican complaint/vote. They resented x minority, therefore their vote is a hateful and invalid.&lt;/p&gt;\n\n&lt;p&gt;I think that there are real problems going on in rural America that are being ignored. Drug addiction, suicide, and job loss all come to mind. I was raised in Georgia, and have spent a good amount of time in the country. Everywhere you look, old barns and farm houses are in a state of decay. Old farm towns sit mostly empty. These people are quite literally watching their way of life crumble before their eyes and they are being played as the villain.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgash47", "score_hidden": false, "stickied": false, "created": 1492300236.0, "created_utc": 1492271436.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgb1m34", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "loudtoys", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "There have been quite a few discussions at work about why people voted for Trump. It seems the majority of people I work with did. Not that it matters but I did not. \n\nThey don't speak about voting for Trump they speak about voting against Hillary. Here are some of the things that are said in no particular order. \n\nHillary wanted to enact an Australian style gun control policy. We live in a state that has a rich tradition of hunting and gun ownership. Most of them own thousands of dollars worth for firearms, they spend time hunting with family and friends and know in Australia all firearms were taken away from the people. While they do support things like universal background checks they didn't want that drastic of a gun control policy. \n\nHillary didn't care about white working men. Her policies would only help minorities, gay/transgender, and women. Why would they vote for someone that didn't care about them? Also apparently both Hillary and Bernie said in a speeches that no white person could understand what it was like to be poor(I never saw this). Many of the people I work with have spent some point in their lives on government assistance and this upset them quite a bit. \n\nHillary is just a bad version of Bill. The thought is that Hillary never really accomplished anything on her own. She simply rode the Clinton name to get where she is/was. Bill was a good president but Hillary had a new set of ideas they didn't care for or felt didn't speak to them. \n\nMany of them liked Bernie. Hillary fucked Bernie. Bernie was better so she and the DNC worked together to steal his chance. He would have made a much better candidate and most of them would have voted for him, most of them vote Democrat. Bernie was someone that could be reasoned with, someone you could work with. Hillary was ruthless and cunning. No room for compromise. \n\nHillary was obviously crooked. She made more on one speech than any of them make in a year. The only way to do this is to be in the pockets of those that payed her. She was a bought and paid for cookie cutter politician. \n\nHillary wanted to let anyone that was in the US have citizenship. She didn't care if they were rapists and murderers or hard working decent people. She lumped them all into one group. They want a system that filters out bad people and brings in good people. They want controlled immigration. They think that we should make it easier for people to become legal immigrants and we should increase deportation of illegal immigrants. \n\n That's what I have heard from my coworkers. They represent a portion of the working class white guys that voted for Trump or against Hillary, however you look at it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There have been quite a few discussions at work about why people voted for Trump. It seems the majority of people I work with did. Not that it matters but I did not. &lt;/p&gt;\n\n&lt;p&gt;They don&amp;#39;t speak about voting for Trump they speak about voting against Hillary. Here are some of the things that are said in no particular order. &lt;/p&gt;\n\n&lt;p&gt;Hillary wanted to enact an Australian style gun control policy. We live in a state that has a rich tradition of hunting and gun ownership. Most of them own thousands of dollars worth for firearms, they spend time hunting with family and friends and know in Australia all firearms were taken away from the people. While they do support things like universal background checks they didn&amp;#39;t want that drastic of a gun control policy. &lt;/p&gt;\n\n&lt;p&gt;Hillary didn&amp;#39;t care about white working men. Her policies would only help minorities, gay/transgender, and women. Why would they vote for someone that didn&amp;#39;t care about them? Also apparently both Hillary and Bernie said in a speeches that no white person could understand what it was like to be poor(I never saw this). Many of the people I work with have spent some point in their lives on government assistance and this upset them quite a bit. &lt;/p&gt;\n\n&lt;p&gt;Hillary is just a bad version of Bill. The thought is that Hillary never really accomplished anything on her own. She simply rode the Clinton name to get where she is/was. Bill was a good president but Hillary had a new set of ideas they didn&amp;#39;t care for or felt didn&amp;#39;t speak to them. &lt;/p&gt;\n\n&lt;p&gt;Many of them liked Bernie. Hillary fucked Bernie. Bernie was better so she and the DNC worked together to steal his chance. He would have made a much better candidate and most of them would have voted for him, most of them vote Democrat. Bernie was someone that could be reasoned with, someone you could work with. Hillary was ruthless and cunning. No room for compromise. &lt;/p&gt;\n\n&lt;p&gt;Hillary was obviously crooked. She made more on one speech than any of them make in a year. The only way to do this is to be in the pockets of those that payed her. She was a bought and paid for cookie cutter politician. &lt;/p&gt;\n\n&lt;p&gt;Hillary wanted to let anyone that was in the US have citizenship. She didn&amp;#39;t care if they were rapists and murderers or hard working decent people. She lumped them all into one group. They want a system that filters out bad people and brings in good people. They want controlled immigration. They think that we should make it easier for people to become legal immigrants and we should increase deportation of illegal immigrants. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s what I have heard from my coworkers. They represent a portion of the working class white guys that voted for Trump or against Hillary, however you look at it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb1m34", "score_hidden": false, "stickied": false, "created": 1492312748.0, "created_utc": 1492283948.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgb026z", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "TThor", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "There is nothing I like about Trump, but I can see seemingly legitimate reason why non-angry non-resentful people would vote for him.\n\nPicture small counties. These are low-population areas, they don't have the amenities of bigger populations. Many of the towns in these areas rely specifically and solely on single industries to survive, including things like mining, manufacturing, etc. For these people, when those jobs go, not only will their own livelihood vanish, but their towns will likely vanish with it. This is a very real concern, one that many mainstream politicians haven't put much focus on.\n\nTrump, on the other hand, did put focus on this. He promised these people he would save these industries, and by extension that he would save their small towns. He promised these scared people exactly what they wanted. Yes mainstream reps and dems also had (more reasonable) policy ideas for how to deal with these losses of industries, things like job training etc, but those plans weren't perfect; nobody likes change, and many people simply aren't fit to learn programming or such at age 40.\n\nI think this focus on small county issues played a massive role in Trumps win. For those who supported Trump for these reasons, I wouldn't exactly call them wise, as his 'solutions' are wrought with problems, but I wouldn't call them resentful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is nothing I like about Trump, but I can see seemingly legitimate reason why non-angry non-resentful people would vote for him.&lt;/p&gt;\n\n&lt;p&gt;Picture small counties. These are low-population areas, they don&amp;#39;t have the amenities of bigger populations. Many of the towns in these areas rely specifically and solely on single industries to survive, including things like mining, manufacturing, etc. For these people, when those jobs go, not only will their own livelihood vanish, but their towns will likely vanish with it. This is a very real concern, one that many mainstream politicians haven&amp;#39;t put much focus on.&lt;/p&gt;\n\n&lt;p&gt;Trump, on the other hand, did put focus on this. He promised these people he would save these industries, and by extension that he would save their small towns. He promised these scared people exactly what they wanted. Yes mainstream reps and dems also had (more reasonable) policy ideas for how to deal with these losses of industries, things like job training etc, but those plans weren&amp;#39;t perfect; nobody likes change, and many people simply aren&amp;#39;t fit to learn programming or such at age 40.&lt;/p&gt;\n\n&lt;p&gt;I think this focus on small county issues played a massive role in Trumps win. For those who supported Trump for these reasons, I wouldn&amp;#39;t exactly call them wise, as his &amp;#39;solutions&amp;#39; are wrought with problems, but I wouldn&amp;#39;t call them resentful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb026z", "score_hidden": false, "stickied": false, "created": 1492310686.0, "created_utc": 1492281886.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgc0owc", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "AddemF", "parent_id": "t1_dgbk11n", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think you assume I'm a leftist, which I'm not.  I deeply dislike Trump and that's entirely consistent with conservatism.  Trump was objectively morally disgusting, incompetent, and a liar.  There is some explanation other than disagreement here.\n\nWhat exactly do you think I'm doing?  I'm holding a view, backing it up by argument, and listening to counter-argument.  I'm not telling anyone what to think.  Or does simply expressing a view constitute telling people what to think?  \n\nI've noticed this strange theme in Trump supporters, that they think they can yell bald-faced lies and act proud about their defiance of reality--but when someone asserts the truth, they sometimes blame people of telling them what to think.  But I guess it's just more of the usual head-spinning disregard for consistency.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you assume I&amp;#39;m a leftist, which I&amp;#39;m not.  I deeply dislike Trump and that&amp;#39;s entirely consistent with conservatism.  Trump was objectively morally disgusting, incompetent, and a liar.  There is some explanation other than disagreement here.&lt;/p&gt;\n\n&lt;p&gt;What exactly do you think I&amp;#39;m doing?  I&amp;#39;m holding a view, backing it up by argument, and listening to counter-argument.  I&amp;#39;m not telling anyone what to think.  Or does simply expressing a view constitute telling people what to think?  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve noticed this strange theme in Trump supporters, that they think they can yell bald-faced lies and act proud about their defiance of reality--but when someone asserts the truth, they sometimes blame people of telling them what to think.  But I guess it&amp;#39;s just more of the usual head-spinning disregard for consistency.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgc0owc", "score_hidden": false, "stickied": false, "created": 1492377750.0, "created_utc": 1492348950.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbk11n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "scottevil110", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It continues to baffle me that the left in this country truly cannot even fathom the idea of someone just...disagreeing with them.  That there MUST be some crazy explanation for why someone would come to a different conclusion about things than you do.  They must have some defect, or be lacking some education, or just be mad about something.  Because no sane human being could ever see things differently than I do, right?\n\nI'll give you that much:  There's definitely some resentment involved for a lot of people, but it's not toward any of the stuff you said.  It's toward people doing exactly what you're doing, and trying to tell people how they're supposed to think.  \n\nI didn't vote for Trump, but I get how easy it WOULD be to be pissed enough at you to spite-vote for him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It continues to baffle me that the left in this country truly cannot even fathom the idea of someone just...disagreeing with them.  That there MUST be some crazy explanation for why someone would come to a different conclusion about things than you do.  They must have some defect, or be lacking some education, or just be mad about something.  Because no sane human being could ever see things differently than I do, right?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll give you that much:  There&amp;#39;s definitely some resentment involved for a lot of people, but it&amp;#39;s not toward any of the stuff you said.  It&amp;#39;s toward people doing exactly what you&amp;#39;re doing, and trying to tell people how they&amp;#39;re supposed to think.  &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t vote for Trump, but I get how easy it WOULD be to be pissed enough at you to spite-vote for him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbk11n", "score_hidden": false, "stickied": false, "created": 1492338763.0, "created_utc": 1492309963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgb1fwm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DrenDran", "parent_id": "t1_dgaqikf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;  She wasn't actually a bad candidate. \n\nIf her morals disagree with your own that's pretty much the definition of 'bad.'\n\nWhat's bad is subjective. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She wasn&amp;#39;t actually a bad candidate. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If her morals disagree with your own that&amp;#39;s pretty much the definition of &amp;#39;bad.&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s bad is subjective. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb1fwm", "score_hidden": false, "stickied": false, "created": 1492312520.0, "created_utc": 1492283720.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgax5uj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rahrness", "parent_id": "t1_dgaqikf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "I'm one of the people who was driven away by fear *and* hatred of Hillary.  If you took her at her word, and looked at her public positions on issues with no context or pretense, you're absolutely right that she wouldn't actually be a bad candidate. That in and of itself, is part of the fear. She and the powers backing her have invested a great deal of time, energy, and blood into crafting the image of someone who you can look at in a reasonable and level-headed manner and conclude \"hmm not bad\". There are incredibly talented and motivated people who played part in building this image, and they're incredibly effective at what they do. This is nothing new, and Hillary was not the first politician to have this carefully-constructed facade around her, and will not be the last.\n\nMany if not all politicians have a gray past. Not every aspiring politician also aspires to be corrupt, but somehow it still ends up happening somewhere along the way, and this is no secret. Sometimes evidence of their corruption surfaces, be it concrete or circumstantial or a mix of both and connecting the dots, but when the evidence surfaces it's supposed to effectively end their career through widespread outrage. My special hated of Hillary comes from just how much evidence was published on Wikileaks and how much more dot-connecting could be made from there, making her not just any corrupt politician, but *the most* corrupt in recent memory by an astronomical margin... but the same level of outrage wasn't there. Instead media (both news outlets and social media) made (and still make!!!) concerted efforts to sweep it all back under the rug as a modern-day Ministry of Truth *and it's working*. Wikileaks was praised for publishing damning evidence against the Bush admin, the NSA and later CIA, but not with her!\n\nIt wasn't enough for me to vote third party or just not vote at all. That's how you end up with someone like myself who is still very much left-wing voting Trump. He is just about the last thing I would come up with if I were designing my ideal prototypical politician. Do I condone all of his behavior and actions? Abso-fucking-lutely not. But the combination of fear and hatred made him the only option, for better or for worse. My opinion of him has improved since realizing the same powers building and protecting Hillary's perception (and whoever comes after her in 4 years!) also use their talents to paint Trump as the monster under your bed (and guess what, theyre good at it). From there, now the only option is to lay in the bed I and others like myself helped make, and make the best of it.\n\n**Edit: Added a blurb at the end about the next 4 years**", "edited": 1492284696.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m one of the people who was driven away by fear &lt;em&gt;and&lt;/em&gt; hatred of Hillary.  If you took her at her word, and looked at her public positions on issues with no context or pretense, you&amp;#39;re absolutely right that she wouldn&amp;#39;t actually be a bad candidate. That in and of itself, is part of the fear. She and the powers backing her have invested a great deal of time, energy, and blood into crafting the image of someone who you can look at in a reasonable and level-headed manner and conclude &amp;quot;hmm not bad&amp;quot;. There are incredibly talented and motivated people who played part in building this image, and they&amp;#39;re incredibly effective at what they do. This is nothing new, and Hillary was not the first politician to have this carefully-constructed facade around her, and will not be the last.&lt;/p&gt;\n\n&lt;p&gt;Many if not all politicians have a gray past. Not every aspiring politician also aspires to be corrupt, but somehow it still ends up happening somewhere along the way, and this is no secret. Sometimes evidence of their corruption surfaces, be it concrete or circumstantial or a mix of both and connecting the dots, but when the evidence surfaces it&amp;#39;s supposed to effectively end their career through widespread outrage. My special hated of Hillary comes from just how much evidence was published on Wikileaks and how much more dot-connecting could be made from there, making her not just any corrupt politician, but &lt;em&gt;the most&lt;/em&gt; corrupt in recent memory by an astronomical margin... but the same level of outrage wasn&amp;#39;t there. Instead media (both news outlets and social media) made (and still make!!!) concerted efforts to sweep it all back under the rug as a modern-day Ministry of Truth &lt;em&gt;and it&amp;#39;s working&lt;/em&gt;. Wikileaks was praised for publishing damning evidence against the Bush admin, the NSA and later CIA, but not with her!&lt;/p&gt;\n\n&lt;p&gt;It wasn&amp;#39;t enough for me to vote third party or just not vote at all. That&amp;#39;s how you end up with someone like myself who is still very much left-wing voting Trump. He is just about the last thing I would come up with if I were designing my ideal prototypical politician. Do I condone all of his behavior and actions? Abso-fucking-lutely not. But the combination of fear and hatred made him the only option, for better or for worse. My opinion of him has improved since realizing the same powers building and protecting Hillary&amp;#39;s perception (and whoever comes after her in 4 years!) also use their talents to paint Trump as the monster under your bed (and guess what, theyre good at it). From there, now the only option is to lay in the bed I and others like myself helped make, and make the best of it.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit: Added a blurb at the end about the next 4 years&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgax5uj", "score_hidden": false, "stickied": false, "created": 1492306721.0, "created_utc": 1492277921.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgb3cr9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Willingtolistentwo", "parent_id": "t1_dgaqikf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Actually she was a bad candidate. A very, very, very bad one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually she was a bad candidate. A very, very, very bad one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb3cr9", "score_hidden": false, "stickied": false, "created": 1492315080.0, "created_utc": 1492286280.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgbatny", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "SeanACarlos", "parent_id": "t1_dgaqikf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; How could people have been manipulated into this reaction to her?\n\nHow did anything Trump ever did end the life of any conscious person?\n\nHillary on the other hand ended several thousand lives in many bombing campaigns that she fought hard and long for.\n\nTrump's morals trump Hillary's any way you slice it.\n\nBut for how long?\n\nMaybe Trump is a bigger murderer. Time will tell.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;How could people have been manipulated into this reaction to her?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How did anything Trump ever did end the life of any conscious person?&lt;/p&gt;\n\n&lt;p&gt;Hillary on the other hand ended several thousand lives in many bombing campaigns that she fought hard and long for.&lt;/p&gt;\n\n&lt;p&gt;Trump&amp;#39;s morals trump Hillary&amp;#39;s any way you slice it.&lt;/p&gt;\n\n&lt;p&gt;But for how long?&lt;/p&gt;\n\n&lt;p&gt;Maybe Trump is a bigger murderer. Time will tell.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbatny", "score_hidden": false, "stickied": false, "created": 1492325511.0, "created_utc": 1492296711.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaqikf", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "AddemF", "parent_id": "t1_dgapssw", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Fair enough, maybe people were driven by fear or hatred of Hillary--but why?  She wasn't actually a bad candidate.  She had morally gray past choices, but so does every other politician, and no clearly bad decisions, yet people chose someone with a long and consistent past of immoral and harmful behavior.  How could people have been manipulated into this reaction to her?\n\nMoreover, this would not go far in explaining why Trump won the primary--whereas resentment would, because Trump more than any other primary candidate gave voice to that feeling.  In fact that's pretty much all Trump did.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fair enough, maybe people were driven by fear or hatred of Hillary--but why?  She wasn&amp;#39;t actually a bad candidate.  She had morally gray past choices, but so does every other politician, and no clearly bad decisions, yet people chose someone with a long and consistent past of immoral and harmful behavior.  How could people have been manipulated into this reaction to her?&lt;/p&gt;\n\n&lt;p&gt;Moreover, this would not go far in explaining why Trump won the primary--whereas resentment would, because Trump more than any other primary candidate gave voice to that feeling.  In fact that&amp;#39;s pretty much all Trump did.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaqikf", "score_hidden": false, "stickied": false, "created": 1492297449.0, "created_utc": 1492268649.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgapssw", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "ShiningConcepts", "parent_id": "t1_dgaogx6", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You need to understand: **Hillary is absolutely NOT beside the point here**. People who voted for Trump had very few options:\n\n* Vote for a shitty, Goldman Sachs owned globalist who was 4 more years of Obama...\n\n* Vote for a shitty, Goldman Sachs owned reality TV star...\n\n* Vote for some hyper-unlikely to win third party...\n\n* Forefit your right to democracy and abstain.\n\nWhen people make a choice that has VERY few alternatives to choose from, the quality of those alternatives IS the point. Hillary's quality and appeal as a candidate is **100%** related to this discussion; it is 100% related to any discussion involving the rationale of people who voted for Trump.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to understand: &lt;strong&gt;Hillary is absolutely NOT beside the point here&lt;/strong&gt;. People who voted for Trump had very few options:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Vote for a shitty, Goldman Sachs owned globalist who was 4 more years of Obama...&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Vote for a shitty, Goldman Sachs owned reality TV star...&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Vote for some hyper-unlikely to win third party...&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Forefit your right to democracy and abstain.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;When people make a choice that has VERY few alternatives to choose from, the quality of those alternatives IS the point. Hillary&amp;#39;s quality and appeal as a candidate is &lt;strong&gt;100%&lt;/strong&gt; related to this discussion; it is 100% related to any discussion involving the rationale of people who voted for Trump.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgapssw", "score_hidden": false, "stickied": false, "created": 1492296362.0, "created_utc": 1492267562.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgapk0c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "exotics", "parent_id": "t1_dgaogx6", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Not really beside the point, just another opinion of why people voted for Trump - they heard awful things about Hillary and didn't want her to win - this is not resentment it is fear.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not really beside the point, just another opinion of why people voted for Trump - they heard awful things about Hillary and didn&amp;#39;t want her to win - this is not resentment it is fear.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgapk0c", "score_hidden": false, "stickied": false, "created": 1492295998.0, "created_utc": 1492267198.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaogx6", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "AddemF", "parent_id": "t1_dgaoezs", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "This isn't the topic of the CMV.  The phrase \"Killary\" is also extremely dumb, but mostly it's all beside the point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t the topic of the CMV.  The phrase &amp;quot;Killary&amp;quot; is also extremely dumb, but mostly it&amp;#39;s all beside the point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaogx6", "score_hidden": false, "stickied": false, "created": 1492294227.0, "created_utc": 1492265427.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgaqlkp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "whitef530", "parent_id": "t1_dgaoezs", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sorry exotics, your comment has been removed:\n\n&gt; Comment Rule 1\\. \"Direct responses to a CMV post must challenge at least one aspect of OP’s current view (however minor), unless they are asking a clarifying question. Arguments in favor of the view OP is willing to change must be restricted to replies to comments.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)  \n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Rule+1+Appeal+exotics&amp;message=exotics+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/65j62f/cmv_resentment_is_the_strongest_explanation_for/dgaoezs/\\))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry exotics, your comment has been removed:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 1. &amp;quot;Direct responses to a CMV post must challenge at least one aspect of OP’s current view (however minor), unless they are asking a clarifying question. Arguments in favor of the view OP is willing to change must be restricted to replies to comments.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1\"&gt;See the wiki page for more information.&lt;/a&gt;  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Rule+1+Appeal+exotics&amp;amp;message=exotics+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/65j62f/cmv_resentment_is_the_strongest_explanation_for/dgaoezs/)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaqlkp", "score_hidden": false, "stickied": false, "created": 1492297572.0, "created_utc": 1492268772.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaoezs", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaoezs", "score_hidden": false, "stickied": false, "created": 1492294137.0, "created_utc": 1492265337.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgatl8c", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "nevereversole", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm curious how you are able to make the distinction that they resent the liberals or democrats rather than disagree with them. You claim that \"hate\" is too strong in another comment. How can you attribute the emotion of resentment majority of voters across America?  \n\nIt seems to me that passionate disagreement and resentment can often manifest themselves similarly in negative feelings/statements about the person you are arguing with but resentment would mean they are harboring ill will towards the liberals or democrats at all times. Those who simply disagree strongly might make negative statements but a deeper discussion about their feelings would show that they have no ill will towards the other person. \n\nMany of the issues you discussed above are exactly why people voted for Trump, but their emotional reaction to those issues is MUCH harder to interpret. To claim that white midwesterners resent liberals for being undervalued socially seems a bit assuming. I think many people did vote for Trump because they saw him as a person who values white America. That doesn't mean they resent those who put a higher value on black America or any other minority.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m curious how you are able to make the distinction that they resent the liberals or democrats rather than disagree with them. You claim that &amp;quot;hate&amp;quot; is too strong in another comment. How can you attribute the emotion of resentment majority of voters across America?  &lt;/p&gt;\n\n&lt;p&gt;It seems to me that passionate disagreement and resentment can often manifest themselves similarly in negative feelings/statements about the person you are arguing with but resentment would mean they are harboring ill will towards the liberals or democrats at all times. Those who simply disagree strongly might make negative statements but a deeper discussion about their feelings would show that they have no ill will towards the other person. &lt;/p&gt;\n\n&lt;p&gt;Many of the issues you discussed above are exactly why people voted for Trump, but their emotional reaction to those issues is MUCH harder to interpret. To claim that white midwesterners resent liberals for being undervalued socially seems a bit assuming. I think many people did vote for Trump because they saw him as a person who values white America. That doesn&amp;#39;t mean they resent those who put a higher value on black America or any other minority.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgatl8c", "score_hidden": false, "stickied": false, "created": 1492301778.0, "created_utc": 1492272978.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgazhn2", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "wandering_pleb13", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I am a little late but I hope you see this. There are three main reasons people voted for Trump.\n\n1)They don't like liberals. Their choice was to suck it up and vote for Trump or give up the Supreme Court, congress, and the Senate to the Democrats. They sucked it up and voted for Trump\n\n2)Economic reasons. If I am a coal miner and Hillary said she is taking away my job, I am not going to vote for her. Simple as that. \n\n3)Cultural reasons. It's open season on white men around the world. You say in your post that they resent black people's success. That is not it at all. They resent being told that they are the cause of all the troubles in the world just for existing. They want to live their lives and be left alone. There is a separate set of rules for whites and for everyone else. That upsets people (rightfully so I may add). Add that to the fact that they know what could be coming next by looking at South Africa who is about to redistribute white peoples wealth and remove their right to vote because they are all \"racists\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am a little late but I hope you see this. There are three main reasons people voted for Trump.&lt;/p&gt;\n\n&lt;p&gt;1)They don&amp;#39;t like liberals. Their choice was to suck it up and vote for Trump or give up the Supreme Court, congress, and the Senate to the Democrats. They sucked it up and voted for Trump&lt;/p&gt;\n\n&lt;p&gt;2)Economic reasons. If I am a coal miner and Hillary said she is taking away my job, I am not going to vote for her. Simple as that. &lt;/p&gt;\n\n&lt;p&gt;3)Cultural reasons. It&amp;#39;s open season on white men around the world. You say in your post that they resent black people&amp;#39;s success. That is not it at all. They resent being told that they are the cause of all the troubles in the world just for existing. They want to live their lives and be left alone. There is a separate set of rules for whites and for everyone else. That upsets people (rightfully so I may add). Add that to the fact that they know what could be coming next by looking at South Africa who is about to redistribute white peoples wealth and remove their right to vote because they are all &amp;quot;racists&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgazhn2", "score_hidden": false, "stickied": false, "created": 1492309895.0, "created_utc": 1492281095.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgb3pgc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "chinmakes5", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "If you are disenfranchised, and are told that everything you want is just a vote away, and he is the candidate of your party, why not get excited?  He told me that he will give me better healthcare than Obamacare for half the price, WIN,  He will make corporations bring jobs back, I get a job or a better job WIN, America is going to be a superpower WIN,  \"those\" people will be gone so I will have the pick of jobs, WIN,  Government will work for me WIN.   If you believe he can do this it doesn't have to get to resentment.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you are disenfranchised, and are told that everything you want is just a vote away, and he is the candidate of your party, why not get excited?  He told me that he will give me better healthcare than Obamacare for half the price, WIN,  He will make corporations bring jobs back, I get a job or a better job WIN, America is going to be a superpower WIN,  &amp;quot;those&amp;quot; people will be gone so I will have the pick of jobs, WIN,  Government will work for me WIN.   If you believe he can do this it doesn&amp;#39;t have to get to resentment.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb3pgc", "score_hidden": false, "stickied": false, "created": 1492315577.0, "created_utc": 1492286777.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgbc7zi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CHull1944", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Your analysis is reasonable and detailed; However, I'd disagree with some of your assertions.\n\nYour positive reason #3 argues that whether causally connected or not, culturally conservative white Americans are less religiously engaged, and this is associated with less financial success. Religious affiliation has been on the decline for decades. It has been even more pronounced in Western European countries. As an example, the Uk has seen the share of the population adhering to Anglicanism go from 40% in 1983 to under 17% in 2014. This is a gigantic decrease within a few decades. Nevertheless, the Uk didn't see the same decrease in financial success that areas like the Rust Belt saw in the US. That's because many other factors must be recognized - income inequality rising, globalization leading to less manufacturing jobs, less educational retraining assistance from government, and the apparent trend toward secularization among many First World countries, to name but a few.\n\n4) White privilege is a bitter pill to swallow for folks who don't see the effects of it. For example, I live in a diverse city, and I see how being white affects the way people are treated. My family live in a small town however, and they do not see this because the population is almost entirely white. For people to condemn a social ill that doesn't even exist in their daily lives... you can understand why they may be skeptical or even feel threatened.\n\n5) Just an opinion, but folks who I know voted for Trump largely voted for him as the outsider candidate. It's not necessarily that they like him or would have him over for dinner; it's that he was the embodiment of anti-establishment. Middle America has been getting fucked by Republicans and Democrats for decades as wealth has become increasingly concentrated in the coastal areas and large metros. Someone claiming he's going to burn it all down and rebuild it with the lost folks in mind is a very tempting idea.\n\nNegative reason 1)\nAmerica has always been divided. My grandparents were Italians, and thus on par with black people at that time in the country. Black people who fought in WW2 were still inferior to many whites, even though they were arguably doing the most American thing possible (fighting for the country). From the days of land-owning WASPs to the Civil War, Civil Rights, the hippie movement and the Indian AIM troubles in the 70s, we have always found ways to portray other Americans as anything but.\n\n3) This is very interesting, and I enjoy reading the analyses now that the election has passed. I don't think people often vote for overall policy, but many folks do vote on at least one personally important policy. As an example, many pro-life people voted for Trump entirely because he'd appoint a SCOTUS judge to possibly overturn Roe v. Wade. For them, all else is secondary. On the other side, some folks voted for Clinton entirely because she said she'd work to make college more affordable. Whether the candidates intend to do these things or even CAN do them... that's another issue. Anyway, it means that someone so clearly disingenuous as Trump can gain supporters as long as they believe he will help pursue their particular pet project. I'd argue this discredits the notion that people are idiots and will vote against their best interests.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your analysis is reasonable and detailed; However, I&amp;#39;d disagree with some of your assertions.&lt;/p&gt;\n\n&lt;p&gt;Your positive reason #3 argues that whether causally connected or not, culturally conservative white Americans are less religiously engaged, and this is associated with less financial success. Religious affiliation has been on the decline for decades. It has been even more pronounced in Western European countries. As an example, the Uk has seen the share of the population adhering to Anglicanism go from 40% in 1983 to under 17% in 2014. This is a gigantic decrease within a few decades. Nevertheless, the Uk didn&amp;#39;t see the same decrease in financial success that areas like the Rust Belt saw in the US. That&amp;#39;s because many other factors must be recognized - income inequality rising, globalization leading to less manufacturing jobs, less educational retraining assistance from government, and the apparent trend toward secularization among many First World countries, to name but a few.&lt;/p&gt;\n\n&lt;p&gt;4) White privilege is a bitter pill to swallow for folks who don&amp;#39;t see the effects of it. For example, I live in a diverse city, and I see how being white affects the way people are treated. My family live in a small town however, and they do not see this because the population is almost entirely white. For people to condemn a social ill that doesn&amp;#39;t even exist in their daily lives... you can understand why they may be skeptical or even feel threatened.&lt;/p&gt;\n\n&lt;p&gt;5) Just an opinion, but folks who I know voted for Trump largely voted for him as the outsider candidate. It&amp;#39;s not necessarily that they like him or would have him over for dinner; it&amp;#39;s that he was the embodiment of anti-establishment. Middle America has been getting fucked by Republicans and Democrats for decades as wealth has become increasingly concentrated in the coastal areas and large metros. Someone claiming he&amp;#39;s going to burn it all down and rebuild it with the lost folks in mind is a very tempting idea.&lt;/p&gt;\n\n&lt;p&gt;Negative reason 1)\nAmerica has always been divided. My grandparents were Italians, and thus on par with black people at that time in the country. Black people who fought in WW2 were still inferior to many whites, even though they were arguably doing the most American thing possible (fighting for the country). From the days of land-owning WASPs to the Civil War, Civil Rights, the hippie movement and the Indian AIM troubles in the 70s, we have always found ways to portray other Americans as anything but.&lt;/p&gt;\n\n&lt;p&gt;3) This is very interesting, and I enjoy reading the analyses now that the election has passed. I don&amp;#39;t think people often vote for overall policy, but many folks do vote on at least one personally important policy. As an example, many pro-life people voted for Trump entirely because he&amp;#39;d appoint a SCOTUS judge to possibly overturn Roe v. Wade. For them, all else is secondary. On the other side, some folks voted for Clinton entirely because she said she&amp;#39;d work to make college more affordable. Whether the candidates intend to do these things or even CAN do them... that&amp;#39;s another issue. Anyway, it means that someone so clearly disingenuous as Trump can gain supporters as long as they believe he will help pursue their particular pet project. I&amp;#39;d argue this discredits the notion that people are idiots and will vote against their best interests.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbc7zi", "score_hidden": false, "stickied": false, "created": 1492327551.0, "created_utc": 1492298751.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgb1nnc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Brostradamnus", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "This \"View\" you posted... I disagree with basically everything you wrote, every assumption you made, every \"negative reason\" and \"positive reason\". Before I get into trying to change your view I admit I voted for Clinton and am only after the election did I CMV to become a Trump supporter. If you really want to change your view you are going to have to let go of a huge collection of assumptions. In my attempt to change your view I am going to directly challenge the most factually innacurate of your assumptions and leave alone your assertions like: \"come hell or high water--ironically, that literally has happened, we're living through hell and are about to get a lot of high water.\" \n           \n\"Positive Reasons\"       \n1) NO. Voters in the US are rejecting the two party system and that's a big reason why Trump won. Don't confuse Pro-America nationalism with support for political factions. [The majority is neither DEM or GOP](http://www.npr.org/2016/02/28/467961962/sick-of-political-parties-unaffiliated-voters-are-changing-politics) and [Third Parties](http://www.msnbc.com/rachel-maddow-show/third-party-voters-played-key-role-election-results) are stealing votes from both Blue and Red parties.      \n         \n2) The collapse of critically important sectors of the American economy happened for real reasons. Some of these were the direct result of policy and others are the result of automation. This is not because of social values this is economics and education and industry. Nations like Sweden embrace capitalism decades ago and the people of that nation worked together to build great things to offer the world. Sweden exports Vehicles, Airplanes, heavy machines, furniture. The tiny nation can afford to have strong social nets because they have a vibrant economy that is not due to exploitation of natural resources. The US economy instead spent much of the last 50 years looting the wealth of the middle class and exploiting foreign peoples to manufacture goods like textiles and giving away every technological innovation we could via horrible policies that allow the wealthy 1% to capitalize while leaving the middle class to starve.        \n           \n3) The majority of Trump voters were Women and minorities. Look it up.\n\n4) I went to elementary school with all white people. My state was very white, and spent a ton on education. My third grade class was 14 kids. 7 Boys and 7 Girls. 4 of those boys are now dead of opiate overdoses. My home state was Vermont. I supported Bernie obviously. People like to share what they have. \"Segregation of populations, together with manipulated media, gives middle America ground to hold onto a comfortable fantasy\" Sure it does. Let's let go of the fantasy. We need a better government then we have had for the last few decades at least.      \n        \n5) Trump is fake. He absolutely had to be fake to win. Why? Because the opposing political faction painted him as a vile disgusting human and tried to argue that any \"Trump Voter\" would embody those values. When accused of being a misogynist vile man who says horrible things about all women, Trump responded in the only way that would completely win the moment in the eyes of the majority of people for good or bad reasons. \"I only ever said horrible things about Rosie O'Donnel\". Brilliant lie. It's not true. Every human has said bad things before and the Billionaire playboy that is Donald Trump said and did more than most absolutely. But Trump being a **bad Christian man** has nothing to do with me or you. Us, the American people, we need to be concerned with killing the TPP and renegotiating NAFTA and net neutrality and economic opportunity for Americans. Americans should be driving cars built in America by people who make $50/hour. Americans should not be exploiting Mexicans on $1/hour wages building cars in a way that makes a CEO rich somewhere. If Trump tried to grab a pussy or not makes no difference. The President needs to work for you and I.        \n           \n\"Negative Reasons\"        \n1) The internet exists now and we have Facebook that allows us to comfortably reside within thought bubbles. I don't see Trump supporters suffering, I see them celebrating, living life, and going long on the stock market. However many of my liberal friends who haven't switched to Trump are reporting through Facebook their nightmarish struggle with what I think is Cognitive Dissonance. The Media told you that you were right and moral and good because you supported a certain political faction and that narrative is collapsing.       \n          \n2) No. You can't just refer to \"These Regions\" and end up with a true statement. Certain Regions I am familiar with that is included in your \"They\" term have not \"dipped a bit\". These are regions where nearly every child leaves to find work after school or dies from Opiate addictions. The towns are dead.         \n          \n3) Racist people vote for Trump. Lots of those people don't pay attention to policy. I do however. The Build a Wall plan came with a very very simple payment plan. Tax some of the remittences sent home by Illegal immigrants. [It's Billions of dollars](http://money.cnn.com/2016/09/01/news/economy/mexico-peso-money-transfer-trump-remittance/) and completely possible. I knew the claim by the MSM that \"there was no plan\" was bullshit when I voted for Clinton.      \n        \n4) The MSM created your problem of cognitive dissonance. It was in their interest to craft a narrative for you to help you consume their advertisers products. FOX is a small piece of the MSM. Every one of these corrupted organizations is capable of producing a good piece of journalism. It's just the very basic business model of CNN or MSNBC to offer a product to private interests like Pharmaceutical companies or political parties.      \n         \nDid I help change your View? I spent like an hour on this so I certainly hope it was worth it for someone.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This &amp;quot;View&amp;quot; you posted... I disagree with basically everything you wrote, every assumption you made, every &amp;quot;negative reason&amp;quot; and &amp;quot;positive reason&amp;quot;. Before I get into trying to change your view I admit I voted for Clinton and am only after the election did I CMV to become a Trump supporter. If you really want to change your view you are going to have to let go of a huge collection of assumptions. In my attempt to change your view I am going to directly challenge the most factually innacurate of your assumptions and leave alone your assertions like: &amp;quot;come hell or high water--ironically, that literally has happened, we&amp;#39;re living through hell and are about to get a lot of high water.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Positive Reasons&amp;quot;&lt;br/&gt;\n1) NO. Voters in the US are rejecting the two party system and that&amp;#39;s a big reason why Trump won. Don&amp;#39;t confuse Pro-America nationalism with support for political factions. &lt;a href=\"http://www.npr.org/2016/02/28/467961962/sick-of-political-parties-unaffiliated-voters-are-changing-politics\"&gt;The majority is neither DEM or GOP&lt;/a&gt; and &lt;a href=\"http://www.msnbc.com/rachel-maddow-show/third-party-voters-played-key-role-election-results\"&gt;Third Parties&lt;/a&gt; are stealing votes from both Blue and Red parties.      &lt;/p&gt;\n\n&lt;p&gt;2) The collapse of critically important sectors of the American economy happened for real reasons. Some of these were the direct result of policy and others are the result of automation. This is not because of social values this is economics and education and industry. Nations like Sweden embrace capitalism decades ago and the people of that nation worked together to build great things to offer the world. Sweden exports Vehicles, Airplanes, heavy machines, furniture. The tiny nation can afford to have strong social nets because they have a vibrant economy that is not due to exploitation of natural resources. The US economy instead spent much of the last 50 years looting the wealth of the middle class and exploiting foreign peoples to manufacture goods like textiles and giving away every technological innovation we could via horrible policies that allow the wealthy 1% to capitalize while leaving the middle class to starve.        &lt;/p&gt;\n\n&lt;p&gt;3) The majority of Trump voters were Women and minorities. Look it up.&lt;/p&gt;\n\n&lt;p&gt;4) I went to elementary school with all white people. My state was very white, and spent a ton on education. My third grade class was 14 kids. 7 Boys and 7 Girls. 4 of those boys are now dead of opiate overdoses. My home state was Vermont. I supported Bernie obviously. People like to share what they have. &amp;quot;Segregation of populations, together with manipulated media, gives middle America ground to hold onto a comfortable fantasy&amp;quot; Sure it does. Let&amp;#39;s let go of the fantasy. We need a better government then we have had for the last few decades at least.      &lt;/p&gt;\n\n&lt;p&gt;5) Trump is fake. He absolutely had to be fake to win. Why? Because the opposing political faction painted him as a vile disgusting human and tried to argue that any &amp;quot;Trump Voter&amp;quot; would embody those values. When accused of being a misogynist vile man who says horrible things about all women, Trump responded in the only way that would completely win the moment in the eyes of the majority of people for good or bad reasons. &amp;quot;I only ever said horrible things about Rosie O&amp;#39;Donnel&amp;quot;. Brilliant lie. It&amp;#39;s not true. Every human has said bad things before and the Billionaire playboy that is Donald Trump said and did more than most absolutely. But Trump being a &lt;strong&gt;bad Christian man&lt;/strong&gt; has nothing to do with me or you. Us, the American people, we need to be concerned with killing the TPP and renegotiating NAFTA and net neutrality and economic opportunity for Americans. Americans should be driving cars built in America by people who make $50/hour. Americans should not be exploiting Mexicans on $1/hour wages building cars in a way that makes a CEO rich somewhere. If Trump tried to grab a pussy or not makes no difference. The President needs to work for you and I.        &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Negative Reasons&amp;quot;&lt;br/&gt;\n1) The internet exists now and we have Facebook that allows us to comfortably reside within thought bubbles. I don&amp;#39;t see Trump supporters suffering, I see them celebrating, living life, and going long on the stock market. However many of my liberal friends who haven&amp;#39;t switched to Trump are reporting through Facebook their nightmarish struggle with what I think is Cognitive Dissonance. The Media told you that you were right and moral and good because you supported a certain political faction and that narrative is collapsing.       &lt;/p&gt;\n\n&lt;p&gt;2) No. You can&amp;#39;t just refer to &amp;quot;These Regions&amp;quot; and end up with a true statement. Certain Regions I am familiar with that is included in your &amp;quot;They&amp;quot; term have not &amp;quot;dipped a bit&amp;quot;. These are regions where nearly every child leaves to find work after school or dies from Opiate addictions. The towns are dead.         &lt;/p&gt;\n\n&lt;p&gt;3) Racist people vote for Trump. Lots of those people don&amp;#39;t pay attention to policy. I do however. The Build a Wall plan came with a very very simple payment plan. Tax some of the remittences sent home by Illegal immigrants. &lt;a href=\"http://money.cnn.com/2016/09/01/news/economy/mexico-peso-money-transfer-trump-remittance/\"&gt;It&amp;#39;s Billions of dollars&lt;/a&gt; and completely possible. I knew the claim by the MSM that &amp;quot;there was no plan&amp;quot; was bullshit when I voted for Clinton.      &lt;/p&gt;\n\n&lt;p&gt;4) The MSM created your problem of cognitive dissonance. It was in their interest to craft a narrative for you to help you consume their advertisers products. FOX is a small piece of the MSM. Every one of these corrupted organizations is capable of producing a good piece of journalism. It&amp;#39;s just the very basic business model of CNN or MSNBC to offer a product to private interests like Pharmaceutical companies or political parties.      &lt;/p&gt;\n\n&lt;p&gt;Did I help change your View? I spent like an hour on this so I certainly hope it was worth it for someone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb1nnc", "score_hidden": false, "stickied": false, "created": 1492312802.0, "created_utc": 1492284002.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgb8kfu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SeanACarlos", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I live in Colorado Springs.\n\nI vote for Trump.\n\nI liked that he was going to try to give the far right everything they deserve.\n\nI'm still licking my lips at the possibilities.\n\nThe far right in this country is destroyed by their own success.\n\nAnd I am here to watch.\n\nI feel lucky to have contributed in this small way.\n\nNo resentment for me, in other words.\n\nAlmost the opposite, in fact.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I live in Colorado Springs.&lt;/p&gt;\n\n&lt;p&gt;I vote for Trump.&lt;/p&gt;\n\n&lt;p&gt;I liked that he was going to try to give the far right everything they deserve.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m still licking my lips at the possibilities.&lt;/p&gt;\n\n&lt;p&gt;The far right in this country is destroyed by their own success.&lt;/p&gt;\n\n&lt;p&gt;And I am here to watch.&lt;/p&gt;\n\n&lt;p&gt;I feel lucky to have contributed in this small way.&lt;/p&gt;\n\n&lt;p&gt;No resentment for me, in other words.&lt;/p&gt;\n\n&lt;p&gt;Almost the opposite, in fact.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb8kfu", "score_hidden": false, "stickied": false, "created": 1492322256.0, "created_utc": 1492293456.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgbfdcy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RexDraco", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Resentment is a terrible word specifically to use for the situation. I feel the majority of votes were easy to discuss. You had two options, Trump or Hilary. Here is some important points purely from observation from Reddit activity and other sources:\n\n\nMajority of educated/younger citizens agree both candidates were awful. Because of this, they were torn which is actually worse. \n\n\nTrump had the advantage that all Republicans hated Hilary by default more but also had the advantage of having a strong base within the voting population. Hilary had a problem where even democrats were voting for Trump not because they support Trump but think he will cause less damage. \n\n\nThe news served a strong role. Hilary has lost a lot of trust in recent history. \"Resentment\" implies revenge taking place when voting against her, which wasn't the case. Distrust and resentment are two very different things. \n\n\n\nI am majority of the time Democrat. I agree with environmental issues requiring priority, I believe in pushing programs that help humans navigate our complicated society, I agree with the original healthcare plan that got ruined into the shit show it is now, I agree maybe the military budget is a bit higher than it needs to and it could totally go anywhere else and help the people more whether it's education, health, science research, space  exploration, or even infrastructure development. These are all varying points in democratic concerns among many others. \n\n\nI also subscribe to many republican ideologies, I am not fond of hand outs for example and feel food and other resources should be given away rather than money to buy it since anyone at the bottom of the wealth pyramid that needs handouts are the same people that probably don't know how to manage money. I also think the system is fairly equal in opportunity, granted that very well varies upon where you live as well so I understand both sides to that.\n\n\nOverall, I hated Trump. He came off as an incompetent donkey that I felt would accomplish nothing during his presidency. However, that's why I voted for him, I trusted it would be four years of no progress rather than the opposite, four years of anti-progress. My distrust in Hilary and her clear knowledge in how the government works was terrifying to me. Trump has stupid ideas I strongly disagree with. I love foreigners, I love immigrants, I love diversity, and I want more of them to keep America special like it is with the such diverse population. Trump wants the opposite, he made it clear it's his passion to close borders. However, I also knew he wouldn't accomplish that task, so that was irrelevant to me if he should be president or not. Many people took that into account as a reason to vote for him, but I took it as a reason TO vote for him, he wants to accomplish impossible tasks while Clinton wishes to accomplish tasks I very much had confidence she could deliver on. \n\n\nI am far from alone. It was not resentment or revenge towards Clinton, it was simply distrust and fear. The majority of older individuals also have a very programmed opinion on Trump. They believe Trump is a huge business man. Our age group knows that isn't true, but anyone that uses television to feel informed will think otherwise. Donald Trump is a business man, good with money, he MUST be what's good for a country struggling with money issues... right? \n\n\nClinton though, she keeps talking about Russia being a problem, possibly a war. Trump was preaching the opposite. You know what people that lived in a country that's been at war for over fifteen years that hasn't seen ANY results want? PEACE. Clinton poorly attempted to portray herself as a competent leader that wishes to handle business and not play games, totally the leader the country needs. As a result, the moron portrayed herself without any help from Trump as a war monger. Everyone felt she was a war monger based on her attitude. Trump and his followers piggy-backed this and not only did Trump talked about LESS military activity, but he exploited her words and regularly used them against her. So now we know it wasn't also just issues against trusting Clinton, it's also about whether or not who is most likely going to bring peace to this country as well. \n\n\nA good number of Trump followers are splitting up, some unsatisfied with what he delivered and some still confident. The fact there is such tension going on implies there was also some form of trust invested in him as a candidate. Yes, it's very possible I am the minority. I used low level game theory on who to root for, some literally liked Trump until later when he seized to show any improvement towards his promises. The fact there is actual sincere anger from the country implies that I am the minority, that everyone angry is actually SURPRISED with what we got. This means that people actually voted for Trump for a reason that did not involve resentment but rather they expected something out of him.\n\n\nAll and all, media manipulation has been going both ways, sides have been split since the moment Bernie Sanders and all the incompetent morons in the republican party proved people do indeed watch those speeches they give stopped being in the race. People loudly said since the get-go our options are shit, nobody was really happy... except for that large group of Trump supporters that is. Many not Trump supporters though, many of them voted for Clinton and many voted against her like I said. Trump, though having the minority of voters, had a firm place of votes that didn't have the need to exploit the resentment among everyone else. Clinton made her voters all split from the lack of transparency and the lack of understanding with what the people needs or wants, or the least making it clear that's the case. The conspiracies and conspiracy theories circulating around her made things more difficult. \n\n\nDonald Trump, also oddly enough, actually campaigned. You know who didn't? Clinton. Trump stole so many areas from Clinton, many conspiracy theories exist as to why, some bound to be real. Clinton came off super ill, her double making a twitter post hinting she made an appearance where Hilary should be, Hilary not exactly putting any energy into her election, it is very possible she was ill. However, because it was kept a secret, we don't know why she decided to let Bernie Sanders and some others carry her weight, but she lost her elections because of it. It's possible she wasn't ill and is just a moron, who knows for sure. The fact Trump actually ran though, that gave him the opportunity to convince Americans that he was the answer to problems and Hilary didn't even so much as try to convince Americans herself otherwise. \n\n\nThis is also not resentment, this is just how things work in our politics. Trump shows up and preached to the choir, all choirs. America ISN'T great, but he claims he will make it great again. We have so many problems and we as Americans are so divided because of all of them. We have opportunities becoming more and more scarce, money isn't circulating, there is once again racial tensions, America ISN'T great and he claims will fix that. Hilary though? Not even once did she show up and even say \"yes, I agree.\" She literally allowed him to snag up just enough votes to not need the majority, he had enough. \n\n\nTrump said he wants America to have less involvement around the world, he wants to address the immigration problem, he wants to fix the economy and create jobs. He has done nothing but preached to the choir that voted for him, preached just enough to snag some from the democratic spectrum as well. Resentment? No, he just exploited the fact that just enough people felt he was the best out of two very incompetent candidates. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Resentment is a terrible word specifically to use for the situation. I feel the majority of votes were easy to discuss. You had two options, Trump or Hilary. Here is some important points purely from observation from Reddit activity and other sources:&lt;/p&gt;\n\n&lt;p&gt;Majority of educated/younger citizens agree both candidates were awful. Because of this, they were torn which is actually worse. &lt;/p&gt;\n\n&lt;p&gt;Trump had the advantage that all Republicans hated Hilary by default more but also had the advantage of having a strong base within the voting population. Hilary had a problem where even democrats were voting for Trump not because they support Trump but think he will cause less damage. &lt;/p&gt;\n\n&lt;p&gt;The news served a strong role. Hilary has lost a lot of trust in recent history. &amp;quot;Resentment&amp;quot; implies revenge taking place when voting against her, which wasn&amp;#39;t the case. Distrust and resentment are two very different things. &lt;/p&gt;\n\n&lt;p&gt;I am majority of the time Democrat. I agree with environmental issues requiring priority, I believe in pushing programs that help humans navigate our complicated society, I agree with the original healthcare plan that got ruined into the shit show it is now, I agree maybe the military budget is a bit higher than it needs to and it could totally go anywhere else and help the people more whether it&amp;#39;s education, health, science research, space  exploration, or even infrastructure development. These are all varying points in democratic concerns among many others. &lt;/p&gt;\n\n&lt;p&gt;I also subscribe to many republican ideologies, I am not fond of hand outs for example and feel food and other resources should be given away rather than money to buy it since anyone at the bottom of the wealth pyramid that needs handouts are the same people that probably don&amp;#39;t know how to manage money. I also think the system is fairly equal in opportunity, granted that very well varies upon where you live as well so I understand both sides to that.&lt;/p&gt;\n\n&lt;p&gt;Overall, I hated Trump. He came off as an incompetent donkey that I felt would accomplish nothing during his presidency. However, that&amp;#39;s why I voted for him, I trusted it would be four years of no progress rather than the opposite, four years of anti-progress. My distrust in Hilary and her clear knowledge in how the government works was terrifying to me. Trump has stupid ideas I strongly disagree with. I love foreigners, I love immigrants, I love diversity, and I want more of them to keep America special like it is with the such diverse population. Trump wants the opposite, he made it clear it&amp;#39;s his passion to close borders. However, I also knew he wouldn&amp;#39;t accomplish that task, so that was irrelevant to me if he should be president or not. Many people took that into account as a reason to vote for him, but I took it as a reason TO vote for him, he wants to accomplish impossible tasks while Clinton wishes to accomplish tasks I very much had confidence she could deliver on. &lt;/p&gt;\n\n&lt;p&gt;I am far from alone. It was not resentment or revenge towards Clinton, it was simply distrust and fear. The majority of older individuals also have a very programmed opinion on Trump. They believe Trump is a huge business man. Our age group knows that isn&amp;#39;t true, but anyone that uses television to feel informed will think otherwise. Donald Trump is a business man, good with money, he MUST be what&amp;#39;s good for a country struggling with money issues... right? &lt;/p&gt;\n\n&lt;p&gt;Clinton though, she keeps talking about Russia being a problem, possibly a war. Trump was preaching the opposite. You know what people that lived in a country that&amp;#39;s been at war for over fifteen years that hasn&amp;#39;t seen ANY results want? PEACE. Clinton poorly attempted to portray herself as a competent leader that wishes to handle business and not play games, totally the leader the country needs. As a result, the moron portrayed herself without any help from Trump as a war monger. Everyone felt she was a war monger based on her attitude. Trump and his followers piggy-backed this and not only did Trump talked about LESS military activity, but he exploited her words and regularly used them against her. So now we know it wasn&amp;#39;t also just issues against trusting Clinton, it&amp;#39;s also about whether or not who is most likely going to bring peace to this country as well. &lt;/p&gt;\n\n&lt;p&gt;A good number of Trump followers are splitting up, some unsatisfied with what he delivered and some still confident. The fact there is such tension going on implies there was also some form of trust invested in him as a candidate. Yes, it&amp;#39;s very possible I am the minority. I used low level game theory on who to root for, some literally liked Trump until later when he seized to show any improvement towards his promises. The fact there is actual sincere anger from the country implies that I am the minority, that everyone angry is actually SURPRISED with what we got. This means that people actually voted for Trump for a reason that did not involve resentment but rather they expected something out of him.&lt;/p&gt;\n\n&lt;p&gt;All and all, media manipulation has been going both ways, sides have been split since the moment Bernie Sanders and all the incompetent morons in the republican party proved people do indeed watch those speeches they give stopped being in the race. People loudly said since the get-go our options are shit, nobody was really happy... except for that large group of Trump supporters that is. Many not Trump supporters though, many of them voted for Clinton and many voted against her like I said. Trump, though having the minority of voters, had a firm place of votes that didn&amp;#39;t have the need to exploit the resentment among everyone else. Clinton made her voters all split from the lack of transparency and the lack of understanding with what the people needs or wants, or the least making it clear that&amp;#39;s the case. The conspiracies and conspiracy theories circulating around her made things more difficult. &lt;/p&gt;\n\n&lt;p&gt;Donald Trump, also oddly enough, actually campaigned. You know who didn&amp;#39;t? Clinton. Trump stole so many areas from Clinton, many conspiracy theories exist as to why, some bound to be real. Clinton came off super ill, her double making a twitter post hinting she made an appearance where Hilary should be, Hilary not exactly putting any energy into her election, it is very possible she was ill. However, because it was kept a secret, we don&amp;#39;t know why she decided to let Bernie Sanders and some others carry her weight, but she lost her elections because of it. It&amp;#39;s possible she wasn&amp;#39;t ill and is just a moron, who knows for sure. The fact Trump actually ran though, that gave him the opportunity to convince Americans that he was the answer to problems and Hilary didn&amp;#39;t even so much as try to convince Americans herself otherwise. &lt;/p&gt;\n\n&lt;p&gt;This is also not resentment, this is just how things work in our politics. Trump shows up and preached to the choir, all choirs. America ISN&amp;#39;T great, but he claims he will make it great again. We have so many problems and we as Americans are so divided because of all of them. We have opportunities becoming more and more scarce, money isn&amp;#39;t circulating, there is once again racial tensions, America ISN&amp;#39;T great and he claims will fix that. Hilary though? Not even once did she show up and even say &amp;quot;yes, I agree.&amp;quot; She literally allowed him to snag up just enough votes to not need the majority, he had enough. &lt;/p&gt;\n\n&lt;p&gt;Trump said he wants America to have less involvement around the world, he wants to address the immigration problem, he wants to fix the economy and create jobs. He has done nothing but preached to the choir that voted for him, preached just enough to snag some from the democratic spectrum as well. Resentment? No, he just exploited the fact that just enough people felt he was the best out of two very incompetent candidates. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbfdcy", "score_hidden": false, "stickied": false, "created": 1492332009.0, "created_utc": 1492303209.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgavqbo", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "brmlb", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;1) More than ever people personally identify with their political affiliation. Rather than voting Republican or mostly agreeing with the Republican platform, people identify as a Republican, and vote for them come hell or high water--ironically, that literally has happened, we're living through hell and are about to get a lot of high water. They see Republicanism, patriotism, and Christianity as virtue-signaling--showing that they are good, ethical people worthy of respect. They also see each of these things--and therefore themselves--as being condescended by liberals, and they resent it.\n\nI stopped reading after this.  You've completely misread everything about this last election cycle.  \n\nBernie Sanders was an outsider.  Donald Trump was an outsider.  Neither was establishment, and the base of both candidates was fed up with partisan politics - Democrat vs Republican.  \n\nTrump nationalists and Bernie socialists are not classic Republicans and Democrats.  4 years ago, the Tea Party and Occupy Wall Street (whatever that was) weren't either.  \n\nThe Rust Belt states that won Trump the Presidency - Michigan, Wisconsin, Ohio, Pennsylvania - weren't about \"Christian values\" either.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;1) More than ever people personally identify with their political affiliation. Rather than voting Republican or mostly agreeing with the Republican platform, people identify as a Republican, and vote for them come hell or high water--ironically, that literally has happened, we&amp;#39;re living through hell and are about to get a lot of high water. They see Republicanism, patriotism, and Christianity as virtue-signaling--showing that they are good, ethical people worthy of respect. They also see each of these things--and therefore themselves--as being condescended by liberals, and they resent it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I stopped reading after this.  You&amp;#39;ve completely misread everything about this last election cycle.  &lt;/p&gt;\n\n&lt;p&gt;Bernie Sanders was an outsider.  Donald Trump was an outsider.  Neither was establishment, and the base of both candidates was fed up with partisan politics - Democrat vs Republican.  &lt;/p&gt;\n\n&lt;p&gt;Trump nationalists and Bernie socialists are not classic Republicans and Democrats.  4 years ago, the Tea Party and Occupy Wall Street (whatever that was) weren&amp;#39;t either.  &lt;/p&gt;\n\n&lt;p&gt;The Rust Belt states that won Trump the Presidency - Michigan, Wisconsin, Ohio, Pennsylvania - weren&amp;#39;t about &amp;quot;Christian values&amp;quot; either.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgavqbo", "score_hidden": false, "stickied": false, "created": 1492304781.0, "created_utc": 1492275981.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgb0e9p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "YoohooCthulhu", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; we never ridiculed people in the dust bowl or the great depression\n\nPeople who didn't grow up in CA may not always be aware that there was huge internal migration from the dust bowl states to CA during that period.  And the migrants were treated about like how the white nationalists treat Mexicans now--\"okie\" is still considered a slur in parts of CA.\n\nI think the weirdest part of this debacle is that there *isn't* massive internal migration to more economically prosperous areas in the contemporary us.  I can think of a few reasons why--high rate of home ownership and lifetime savings locked up in homes, safety net programs that keep people fed but don't help them enough they can actually get ahead, \"fake news\"propaganda that convinces people in rust belt states that everywhere is as bad off as their state (or else that other states are overrun with hordes of criminal immigrants), etc--but I think the lack of migration is really what underlies the dysfunction here", "edited": 1492284665.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;we never ridiculed people in the dust bowl or the great depression&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;People who didn&amp;#39;t grow up in CA may not always be aware that there was huge internal migration from the dust bowl states to CA during that period.  And the migrants were treated about like how the white nationalists treat Mexicans now--&amp;quot;okie&amp;quot; is still considered a slur in parts of CA.&lt;/p&gt;\n\n&lt;p&gt;I think the weirdest part of this debacle is that there &lt;em&gt;isn&amp;#39;t&lt;/em&gt; massive internal migration to more economically prosperous areas in the contemporary us.  I can think of a few reasons why--high rate of home ownership and lifetime savings locked up in homes, safety net programs that keep people fed but don&amp;#39;t help them enough they can actually get ahead, &amp;quot;fake news&amp;quot;propaganda that convinces people in rust belt states that everywhere is as bad off as their state (or else that other states are overrun with hordes of criminal immigrants), etc--but I think the lack of migration is really what underlies the dysfunction here&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb0e9p", "score_hidden": false, "stickied": false, "created": 1492311140.0, "created_utc": 1492282340.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgb8wh9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PsychoPhilosopher", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I take issue with 'the strongest'...\n\nThe strongest explanation I've seen is pro-wrestling!\n\nIn terms of narratives and meta-narratives, Trump doesn't fit any of the real world archetypes that college educated liberal academia have much experience with. He's not a 'trial by fire' type, who can point to their suffering as the source of their strength.  He's not a 'hero of the struggle' who wins by working twice as hard as the competition.  He's certainly not a 'genius' whose prodigious talent is recognized by all in the end.  \n\nThe narrative is that of Randy Savage and many more since: [The Heel-Face turn](http://tvtropes.org/pmwiki/pmwiki.php/Main/HeelFaceTurn).\n\nThe Heel-Face turn is a fascinating explanation because of one main factor: The more of a douchebag the heel is, the more effective the story.  So a milquetoast douchebag-light well connected wanker like Jeb can't pull it off.  He's not a *Heel*!\n\nBut the more people criticized Trump, the more this narrative structure was enforced.  The more of a racist, homophobic, geriatric, born-wealthy, vain, tasteless, cowardly, slimy, stupid, cretinous, sexual assaulting, money-grubbing, Russian mafia supporting *Heel* he is the more he can be identified with that narrative arc.\n\nThat's why your point about policy is so correct and so incorrect at the same time.  People voted for the *narrative*, and the policy supported that narrative.\n\nNow I know I've almost changed your view with this so I'll post one last piece of evidence:\n\nhttps://www.google.com.au/url?sa=i&amp;rct=j&amp;q=&amp;esrc=s&amp;source=images&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=0ahUKEwj9nYjmuqfTAhUMTrwKHd8gDYIQjRwIBw&amp;url=https%3A%2F%2Fwww.si.com%2Fextra-mustard%2F2015%2F03%2F24%2Frandy-macho-man-savage-wwe-hall-of-fame&amp;psig=AFQjCNGySVjqC4Va93Ox4BNmlKx8kgbejQ&amp;ust=1492379960046789\n\nAren't those muscles stronger than any namby pamby *feelings*?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I take issue with &amp;#39;the strongest&amp;#39;...&lt;/p&gt;\n\n&lt;p&gt;The strongest explanation I&amp;#39;ve seen is pro-wrestling!&lt;/p&gt;\n\n&lt;p&gt;In terms of narratives and meta-narratives, Trump doesn&amp;#39;t fit any of the real world archetypes that college educated liberal academia have much experience with. He&amp;#39;s not a &amp;#39;trial by fire&amp;#39; type, who can point to their suffering as the source of their strength.  He&amp;#39;s not a &amp;#39;hero of the struggle&amp;#39; who wins by working twice as hard as the competition.  He&amp;#39;s certainly not a &amp;#39;genius&amp;#39; whose prodigious talent is recognized by all in the end.  &lt;/p&gt;\n\n&lt;p&gt;The narrative is that of Randy Savage and many more since: &lt;a href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/HeelFaceTurn\"&gt;The Heel-Face turn&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;The Heel-Face turn is a fascinating explanation because of one main factor: The more of a douchebag the heel is, the more effective the story.  So a milquetoast douchebag-light well connected wanker like Jeb can&amp;#39;t pull it off.  He&amp;#39;s not a &lt;em&gt;Heel&lt;/em&gt;!&lt;/p&gt;\n\n&lt;p&gt;But the more people criticized Trump, the more this narrative structure was enforced.  The more of a racist, homophobic, geriatric, born-wealthy, vain, tasteless, cowardly, slimy, stupid, cretinous, sexual assaulting, money-grubbing, Russian mafia supporting &lt;em&gt;Heel&lt;/em&gt; he is the more he can be identified with that narrative arc.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s why your point about policy is so correct and so incorrect at the same time.  People voted for the &lt;em&gt;narrative&lt;/em&gt;, and the policy supported that narrative.&lt;/p&gt;\n\n&lt;p&gt;Now I know I&amp;#39;ve almost changed your view with this so I&amp;#39;ll post one last piece of evidence:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.google.com.au/url?sa=i&amp;amp;rct=j&amp;amp;q=&amp;amp;esrc=s&amp;amp;source=images&amp;amp;cd=&amp;amp;cad=rja&amp;amp;uact=8&amp;amp;ved=0ahUKEwj9nYjmuqfTAhUMTrwKHd8gDYIQjRwIBw&amp;amp;url=https%3A%2F%2Fwww.si.com%2Fextra-mustard%2F2015%2F03%2F24%2Frandy-macho-man-savage-wwe-hall-of-fame&amp;amp;psig=AFQjCNGySVjqC4Va93Ox4BNmlKx8kgbejQ&amp;amp;ust=1492379960046789\"&gt;https://www.google.com.au/url?sa=i&amp;amp;rct=j&amp;amp;q=&amp;amp;esrc=s&amp;amp;source=images&amp;amp;cd=&amp;amp;cad=rja&amp;amp;uact=8&amp;amp;ved=0ahUKEwj9nYjmuqfTAhUMTrwKHd8gDYIQjRwIBw&amp;amp;url=https%3A%2F%2Fwww.si.com%2Fextra-mustard%2F2015%2F03%2F24%2Frandy-macho-man-savage-wwe-hall-of-fame&amp;amp;psig=AFQjCNGySVjqC4Va93Ox4BNmlKx8kgbejQ&amp;amp;ust=1492379960046789&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Aren&amp;#39;t those muscles stronger than any namby pamby &lt;em&gt;feelings&lt;/em&gt;?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb8wh9", "score_hidden": false, "stickied": false, "created": 1492322731.0, "created_utc": 1492293931.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgaz5ym", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sickonsarz", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "They voted for trump cause Hillary was the other option. It's literally that simple.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They voted for trump cause Hillary was the other option. It&amp;#39;s literally that simple.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaz5ym", "score_hidden": false, "stickied": false, "created": 1492309441.0, "created_utc": 1492280641.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgb6pta", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Iceklimber", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Media manipulation: Russian bots, Russian hacking, moneyed powers\n\n\n\nMedia manipulation:\n\nMainstream media spent much more time bashing Trump than Hillary example: 70 minutes average time about his pussy-grabbing vs. 20 minutes on Hillary's e-mail.\n\nhttps://sports.yahoo.com/news/trump-pussy-tapes-triple-newscast-airtime-over-hillary-130421444.html\n\nAdditionally, the debates were rigged with audiences who instead of listen independently in silence elected to boo Trump. Plus, Hillary provably helped prepared the debate questions and received them in advance. \n\nThat was my personal turning point by the way. It's not that Trump was a great candidate, but every candidate deserves objective treatment and this was not the case when some CNN Moderators contributed money to Hillary's campaign or edited Trump's tweets.\n\n\n\n\n.\n\nMoney: Hillary spent way more on her campaign.\n\nhttps://www.bloomberg.com/politics/graphics/2016-presidential-campaign-fundraising/\n\n.\n\nBots:\n\nHillary does seem to have fewer bots, but she has fewer real followers as well.\n\nhttps://www.twitteraudit.com/HillaryClinton\n\nhttps://www.twitteraudit.com/realDonaldTrump\n\n.\n\n\nRussian hacking:\n\nThe big one. The DNC hack was a blow to Hillary's popularity but it seems like *blame the messenger* to me. The hackers did not write Podesta's emails nor did they conspire against Bernie Sanders.\n\n.\n\n.\n\nThis comment so far has been facts and now comes my opinion:\n\n/u/AddemF, you mentioned *whites* five time in the OP and later proceeded to call Trump racist. \n\nNo one took issue when 95% of blacks voted for Obama, but 58% of whites voting for Trump is somehow a whitelash [both candidates were white by the way, and Hillary called black youth *superpredators*]. \n\nJust food for thought.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Media manipulation: Russian bots, Russian hacking, moneyed powers&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Media manipulation:&lt;/p&gt;\n\n&lt;p&gt;Mainstream media spent much more time bashing Trump than Hillary example: 70 minutes average time about his pussy-grabbing vs. 20 minutes on Hillary&amp;#39;s e-mail.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://sports.yahoo.com/news/trump-pussy-tapes-triple-newscast-airtime-over-hillary-130421444.html\"&gt;https://sports.yahoo.com/news/trump-pussy-tapes-triple-newscast-airtime-over-hillary-130421444.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Additionally, the debates were rigged with audiences who instead of listen independently in silence elected to boo Trump. Plus, Hillary provably helped prepared the debate questions and received them in advance. &lt;/p&gt;\n\n&lt;p&gt;That was my personal turning point by the way. It&amp;#39;s not that Trump was a great candidate, but every candidate deserves objective treatment and this was not the case when some CNN Moderators contributed money to Hillary&amp;#39;s campaign or edited Trump&amp;#39;s tweets.&lt;/p&gt;\n\n&lt;p&gt;.&lt;/p&gt;\n\n&lt;p&gt;Money: Hillary spent way more on her campaign.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.bloomberg.com/politics/graphics/2016-presidential-campaign-fundraising/\"&gt;https://www.bloomberg.com/politics/graphics/2016-presidential-campaign-fundraising/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;.&lt;/p&gt;\n\n&lt;p&gt;Bots:&lt;/p&gt;\n\n&lt;p&gt;Hillary does seem to have fewer bots, but she has fewer real followers as well.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.twitteraudit.com/HillaryClinton\"&gt;https://www.twitteraudit.com/HillaryClinton&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.twitteraudit.com/realDonaldTrump\"&gt;https://www.twitteraudit.com/realDonaldTrump&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;.&lt;/p&gt;\n\n&lt;p&gt;Russian hacking:&lt;/p&gt;\n\n&lt;p&gt;The big one. The DNC hack was a blow to Hillary&amp;#39;s popularity but it seems like &lt;em&gt;blame the messenger&lt;/em&gt; to me. The hackers did not write Podesta&amp;#39;s emails nor did they conspire against Bernie Sanders.&lt;/p&gt;\n\n&lt;p&gt;.&lt;/p&gt;\n\n&lt;p&gt;.&lt;/p&gt;\n\n&lt;p&gt;This comment so far has been facts and now comes my opinion:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"/u/AddemF\"&gt;/u/AddemF&lt;/a&gt;, you mentioned &lt;em&gt;whites&lt;/em&gt; five time in the OP and later proceeded to call Trump racist. &lt;/p&gt;\n\n&lt;p&gt;No one took issue when 95% of blacks voted for Obama, but 58% of whites voting for Trump is somehow a whitelash [both candidates were white by the way, and Hillary called black youth &lt;em&gt;superpredators&lt;/em&gt;]. &lt;/p&gt;\n\n&lt;p&gt;Just food for thought.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb6pta", "score_hidden": false, "stickied": false, "created": 1492319711.0, "created_utc": 1492290911.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgc0kn2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AddemF", "parent_id": "t1_dgblr25", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Well, I haven't listened to FOX news, I'm forming this idea from the evidence I mentioned in my post.  There aren't rigorous surveys on this topic as far as I know, but if there were I'd be interested.  Until then, though, it's a view based on less direct evidence--but still one you can reasonably hold.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I haven&amp;#39;t listened to FOX news, I&amp;#39;m forming this idea from the evidence I mentioned in my post.  There aren&amp;#39;t rigorous surveys on this topic as far as I know, but if there were I&amp;#39;d be interested.  Until then, though, it&amp;#39;s a view based on less direct evidence--but still one you can reasonably hold.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgc0kn2", "score_hidden": false, "stickied": false, "created": 1492377524.0, "created_utc": 1492348724.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgblr25", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bobby_Cement", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Your view seems identical with that presented in the book \"Strangers in Their Own Land: Anger and Mourning on the American Right\". I haven't read it yet, but I heard the author give an interview on meaningoflife.tv; very enlightening.  \n\nBut I'm here to change your view I suppose. So I'll mention that the resentment theory is given credence by listening mostly to the loudest voices: Hannity and company. Are there careful surveys of the thoughts of average people? The book I mentioned tries to go after this, but I think the author only spent time in Louisiana, mostly collecting anecdotes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your view seems identical with that presented in the book &amp;quot;Strangers in Their Own Land: Anger and Mourning on the American Right&amp;quot;. I haven&amp;#39;t read it yet, but I heard the author give an interview on meaningoflife.tv; very enlightening.  &lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;m here to change your view I suppose. So I&amp;#39;ll mention that the resentment theory is given credence by listening mostly to the loudest voices: Hannity and company. Are there careful surveys of the thoughts of average people? The book I mentioned tries to go after this, but I think the author only spent time in Louisiana, mostly collecting anecdotes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgblr25", "score_hidden": false, "stickied": false, "created": 1492341297.0, "created_utc": 1492312497.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgbb149", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hchampion4447", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The Russians told Hilary there was no need to go to Wisconsin.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Russians told Hilary there was no need to go to Wisconsin.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbb149", "score_hidden": false, "stickied": false, "created": 1492325818.0, "created_utc": 1492297018.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgb00gq", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Aeternalis_", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "It's because those people have been largely ignored in favor of special interest groups. Seeing the blue side of the spectrum as not caring about people who work blue collar jobs and pay taxes for other people's gain. \n\nI live in Kentucky and libertarianism is extremely prevalent here. The republican party is more attractive than Democrat to most of us here for the simple reason that we have a very set mindset of \"work or starve\" and things like Obamacare and ignoring the illegal immigration issue is just our money getting thrown in the toilet.\n\nYour views on Trump voters automatically being racist homophobes is, quite frankly, idiotic. That stereotype applies to very few of those people and is almost completely exclusive to Utah and neighboring areas. Yes, the promotion of special interest groups is not their promotion but a degredation of the average man and woman. \n\nManipulated media? What in the world are you on about? The media that manipulated the most was the left wing outlets of CNN and Huffington Post with fake Russian collusion stories, cherry picking, and virtue signaling. You're accusing the red of doing these things when the blue was far worse.\n\nWhy are you generalizing all Trump supporters when I promise you 40% of people voted for him just to keep Hillary Clinton out of office? That is seriously half the reason I supported him in the first place. I'm and centrist and according to Isidewith I'm equally split between Trump and Clinton (with a 5% or so bias for trump due to my immigration views and disdain for Islam).\n\nYou are projecting your entire viewpoint on the basis that Trump supporters are one type of people that are rare and are not even as vocal as the tumblrinas and SIC virtue signalers of the left side. That's a massive hole in your reasoning.\n\n\n\n\n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s because those people have been largely ignored in favor of special interest groups. Seeing the blue side of the spectrum as not caring about people who work blue collar jobs and pay taxes for other people&amp;#39;s gain. &lt;/p&gt;\n\n&lt;p&gt;I live in Kentucky and libertarianism is extremely prevalent here. The republican party is more attractive than Democrat to most of us here for the simple reason that we have a very set mindset of &amp;quot;work or starve&amp;quot; and things like Obamacare and ignoring the illegal immigration issue is just our money getting thrown in the toilet.&lt;/p&gt;\n\n&lt;p&gt;Your views on Trump voters automatically being racist homophobes is, quite frankly, idiotic. That stereotype applies to very few of those people and is almost completely exclusive to Utah and neighboring areas. Yes, the promotion of special interest groups is not their promotion but a degredation of the average man and woman. &lt;/p&gt;\n\n&lt;p&gt;Manipulated media? What in the world are you on about? The media that manipulated the most was the left wing outlets of CNN and Huffington Post with fake Russian collusion stories, cherry picking, and virtue signaling. You&amp;#39;re accusing the red of doing these things when the blue was far worse.&lt;/p&gt;\n\n&lt;p&gt;Why are you generalizing all Trump supporters when I promise you 40% of people voted for him just to keep Hillary Clinton out of office? That is seriously half the reason I supported him in the first place. I&amp;#39;m and centrist and according to Isidewith I&amp;#39;m equally split between Trump and Clinton (with a 5% or so bias for trump due to my immigration views and disdain for Islam).&lt;/p&gt;\n\n&lt;p&gt;You are projecting your entire viewpoint on the basis that Trump supporters are one type of people that are rare and are not even as vocal as the tumblrinas and SIC virtue signalers of the left side. That&amp;#39;s a massive hole in your reasoning.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb00gq", "score_hidden": false, "stickied": false, "created": 1492310618.0, "created_utc": 1492281818.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbbp76", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bryanpcox", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "and bigotry is the main reason for the hatred for trump/trump voters...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;and bigotry is the main reason for the hatred for trump/trump voters...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbbp76", "score_hidden": false, "stickied": false, "created": 1492326789.0, "created_utc": 1492297989.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgazeki", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "juiceboxhero999", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Lol you're obviously never lived in the Midwest. You should like a loon", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol you&amp;#39;re obviously never lived in the Midwest. You should like a loon&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgazeki", "score_hidden": false, "stickied": false, "created": 1492309777.0, "created_utc": 1492280977.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgb0pcx", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "jamesbwbevis", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Not resentment, Trump inspired hope and excitement just like Obama did in 08.  a lot of middle America always votes Republican. But in this case there were people that voted Democrat in the last two elections who went for Trump this time. A lot of new voters came out for Trump. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not resentment, Trump inspired hope and excitement just like Obama did in 08.  a lot of middle America always votes Republican. But in this case there were people that voted Democrat in the last two elections who went for Trump this time. A lot of new voters came out for Trump. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb0pcx", "score_hidden": false, "stickied": false, "created": 1492311552.0, "created_utc": 1492282752.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgbnen6", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Vicious43", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Trump offered a jobs and a stronger economy, Hilary didn't promise them anything, actually saying she would ok the tpp (which would have cost 3 million american jobs) and do away with the coal industry that a lot of people rely on. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trump offered a jobs and a stronger economy, Hilary didn&amp;#39;t promise them anything, actually saying she would ok the tpp (which would have cost 3 million american jobs) and do away with the coal industry that a lot of people rely on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbnen6", "score_hidden": false, "stickied": false, "created": 1492343875.0, "created_utc": 1492315075.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgbvckx", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "diggerbanks", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think a **disconnection from the people in power, from reality and from sanity** is a better phrase.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think a &lt;strong&gt;disconnection from the people in power, from reality and from sanity&lt;/strong&gt; is a better phrase.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbvckx", "score_hidden": false, "stickied": false, "created": 1492362403.0, "created_utc": 1492333603.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65j62f", "likes": null, "replies": "", "user_reports": [], "id": "dgbotci", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "gman992", "parent_id": "t3_65j62f", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "A corrupt Hillary Clinton and unfriendly HC might have something to with it too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A corrupt Hillary Clinton and unfriendly HC might have something to with it too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbotci", "score_hidden": false, "stickied": false, "created": 1492346271.0, "created_utc": 1492317471.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]