[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pro choice. I don&amp;#39;t support abortion, but I support a woman&amp;#39;s right to do as she pleases with her body. It&amp;#39;s not my place to decide.&lt;br/&gt;\nWith this said, a common argument I see against pro lifers is that it is sexist to outlaw abortions, because it&amp;#39;s wanting control of a woman&amp;#39;s body. While I agree with the premise of it- that the government shouldn&amp;#39;t decide what people do to themselves, I don&amp;#39;t think that most pro lifers oppose abortion because it would give a woman bodily autonomy, but because they believe that babies are separate entities from their mother who deserve life.&lt;br/&gt;\nAbortion is a super grey area. You&amp;#39;ve got people who think that as soon as a sperm and egg meet, it&amp;#39;s murder to stop them. But you&amp;#39;ve also got people who think that a baby isn&amp;#39;t a life form until it leaves the womb.&lt;br/&gt;\nI think both sides ultimately have good intentions, even if they&amp;#39;re crazy and extreme about it. CMV!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm pro choice. I don't support abortion, but I support a woman's right to do as she pleases with her body. It's not my place to decide.  \nWith this said, a common argument I see against pro lifers is that it is sexist to outlaw abortions, because it's wanting control of a woman's body. While I agree with the premise of it- that the government shouldn't decide what people do to themselves, I don't think that most pro lifers oppose abortion because it would give a woman bodily autonomy, but because they believe that babies are separate entities from their mother who deserve life.  \nAbortion is a super grey area. You've got people who think that as soon as a sperm and egg meet, it's murder to stop them. But you've also got people who think that a baby isn't a life form until it leaves the womb.  \nI think both sides ultimately have good intentions, even if they're crazy and extreme about it. CMV!", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "[∆(s) from OP]", "id": "65jy88", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 172, "report_reasons": null, "author": "Milkshaketurtle79", "saved": false, "mod_reports": [], "name": "t3_65jy88", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": false, "link_flair_css_class": "OPdelta", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/65jy88/cmv_being_against_abortion_does_not_inherently/", "num_reports": null, "locked": false, "stickied": false, "created": 1492302554.0, "url": "https://www.reddit.com/r/changemyview/comments/65jy88/cmv_being_against_abortion_does_not_inherently/", "author_flair_text": null, "quarantine": false, "title": "CMV: Being against abortion does not inherently mean one is sexist.", "created_utc": 1492273754.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 253, "visited": false, "subreddit_type": "public", "ups": 172}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": "", "user_reports": [], "id": "dgaw539", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t3_65jy88", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "/u/Milkshaketurtle79 (OP) has awarded 1 delta in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [**here**](/r/DeltaLog/comments/65k7gi), in /r/DeltaLog.\n\nPlease note that a change of view [doesn't necessarily mean a reversal](https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F), or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/Milkshaketurtle79\"&gt;/u/Milkshaketurtle79&lt;/a&gt; (OP) has awarded 1 delta in this post.&lt;/p&gt;\n\n&lt;p&gt;All comments that earned deltas (from OP or other users) are listed &lt;a href=\"/r/DeltaLog/comments/65k7gi\"&gt;&lt;strong&gt;here&lt;/strong&gt;&lt;/a&gt;, in &lt;a href=\"/r/DeltaLog\"&gt;/r/DeltaLog&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Please note that a change of view &lt;a href=\"https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F\"&gt;doesn&amp;#39;t necessarily mean a reversal&lt;/a&gt;, or that the conversation has ended.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaw539", "score_hidden": true, "stickied": true, "created": 1492305335.0, "created_utc": 1492276535.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgavqzq", "gilded": 0, "archived": false, "score": 70, "report_reasons": null, "author": "n_5", "parent_id": "t3_65jy88", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I don't think pro-choice folks typically paint the entire pro-life movement as sexist - for example, I have a few female friends who are staunchly pro-life who would consider themselves feminists as well. What people typically object to here is groups of exclusively men making decisions on abortion. Consider [this image](https://pbs.twimg.com/media/C7n2dJAX0AEoeXX.jpg) of Republican lawmakers making decisions on their party's healthcare bill (which of course includes decisions on birth control), and notice that there are literally zero women on this committee. The point many people (myself included) make when they say that being pro-life is sexist is not that feminists aren't allowed to be pro-life - they're mainly pointing out the tone-deafness of a group of people who will never be able to be pregnant making decisions regarding something they'll never personally experience.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think pro-choice folks typically paint the entire pro-life movement as sexist - for example, I have a few female friends who are staunchly pro-life who would consider themselves feminists as well. What people typically object to here is groups of exclusively men making decisions on abortion. Consider &lt;a href=\"https://pbs.twimg.com/media/C7n2dJAX0AEoeXX.jpg\"&gt;this image&lt;/a&gt; of Republican lawmakers making decisions on their party&amp;#39;s healthcare bill (which of course includes decisions on birth control), and notice that there are literally zero women on this committee. The point many people (myself included) make when they say that being pro-life is sexist is not that feminists aren&amp;#39;t allowed to be pro-life - they&amp;#39;re mainly pointing out the tone-deafness of a group of people who will never be able to be pregnant making decisions regarding something they&amp;#39;ll never personally experience.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgavqzq", "score_hidden": false, "stickied": false, "created": 1492304806.0, "created_utc": 1492276006.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 70}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgawhv0", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "berrieh", "parent_id": "t3_65jy88", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The argument with legislation against abortion (\"being against\" is too broad a phrase; one can be against something, yet not want to legislate it) being sexist is complicated. It has several components: \n\n1) Despite growing equity, legislators are still predominantly male. This leads to a bunch of men passing legislation that only affects women's bodies. Men controlling what women do with their bodies has some inherent sexism to it, even if sexism isn't the *goal*.\n\n2) Additionally, much of the legislation involved seeks to limit other forms of birth control (and funds to provide them freely) that would reduce the need for abortions. Considering that birth control is the primary reason that the feminist revolution was able to happen, this is key. If women cannot control their reproduction, equality is essentially impossible. As far as I know, none of these people have proposed ways to maintain equality (can we research keeping zygotes viable outside the mother? can we secure funding for every woman who is pregantant, give them workplace protections that are absolute, and give everyone free daycare so that bearing children has 0 economic impact? Can we provide free and symptom-free birth control?) while taking abortion away and many have done the opposite. They don't seem to just want to end abortion because they're sad about the zygote or whatever (though that is the line they use) but also to want to actively imprison women as the vehicle for childbirth seeing that as the \"natural order\" of things. That's sexism and it's the foundation of sexism, I would argue. I think sexism and gender stereotypes are essentially formed around the biology of human reproduction. If men were the ones who bore children, women would have fought wars and lead industries for centuries. IF both bore children, maybe equality would be natural and not hard won. Who knows? \n\n3) Women are ultimately the only ones affected by such laws at the end of the day, thus it is clearly a woman's issue. At the end of the day, these laws represent discrimination against women on the basis of sex. The fact that this is due to something we haven't yet tackled to change about biology (no one has attempted to alter the biological means of human reproduction sufficiently, really, so we don't know if it could be done) doesn't mean that these laws are not solely leveled against women on the basis of their sex. \n\n4) For the most part, the same people who are advocates of LAWS that are anti-choice (and many people are \"pro-life\" without wanting to limit reproductive freedom, actually) are advocating a traditional mindset. They're not interested in outside-the-box solutions to the issue of the zygote, as I said above. They don't care about the impact it would have on women, at best, and sometimes would be happy with women in a more traditional role. To not consider women's rights while restricting them for other reasons is also sexist. I have yet to see an anti-choice law proposed with any provisions that protect women in any way, shape, or form, from the natural sexism of forcing women to bear children when they do not want to do so. \n\n5) And the largest one: At the end of the day, participating in institutional decisions (like laws) that we fundamentally know lead to sexist results = sexism. \n\nMy personal aversion to anti-choice laws actually has nothing to do with sexism and everything to do with bodily autonomy (male or female, no one should tell you that you must donate a kidney, carry an organism to term that cannot be self-supporting, etc), but I also think such things are more rooted in sexism than you suggest. ", "edited": 1492277549.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The argument with legislation against abortion (&amp;quot;being against&amp;quot; is too broad a phrase; one can be against something, yet not want to legislate it) being sexist is complicated. It has several components: &lt;/p&gt;\n\n&lt;p&gt;1) Despite growing equity, legislators are still predominantly male. This leads to a bunch of men passing legislation that only affects women&amp;#39;s bodies. Men controlling what women do with their bodies has some inherent sexism to it, even if sexism isn&amp;#39;t the &lt;em&gt;goal&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;2) Additionally, much of the legislation involved seeks to limit other forms of birth control (and funds to provide them freely) that would reduce the need for abortions. Considering that birth control is the primary reason that the feminist revolution was able to happen, this is key. If women cannot control their reproduction, equality is essentially impossible. As far as I know, none of these people have proposed ways to maintain equality (can we research keeping zygotes viable outside the mother? can we secure funding for every woman who is pregantant, give them workplace protections that are absolute, and give everyone free daycare so that bearing children has 0 economic impact? Can we provide free and symptom-free birth control?) while taking abortion away and many have done the opposite. They don&amp;#39;t seem to just want to end abortion because they&amp;#39;re sad about the zygote or whatever (though that is the line they use) but also to want to actively imprison women as the vehicle for childbirth seeing that as the &amp;quot;natural order&amp;quot; of things. That&amp;#39;s sexism and it&amp;#39;s the foundation of sexism, I would argue. I think sexism and gender stereotypes are essentially formed around the biology of human reproduction. If men were the ones who bore children, women would have fought wars and lead industries for centuries. IF both bore children, maybe equality would be natural and not hard won. Who knows? &lt;/p&gt;\n\n&lt;p&gt;3) Women are ultimately the only ones affected by such laws at the end of the day, thus it is clearly a woman&amp;#39;s issue. At the end of the day, these laws represent discrimination against women on the basis of sex. The fact that this is due to something we haven&amp;#39;t yet tackled to change about biology (no one has attempted to alter the biological means of human reproduction sufficiently, really, so we don&amp;#39;t know if it could be done) doesn&amp;#39;t mean that these laws are not solely leveled against women on the basis of their sex. &lt;/p&gt;\n\n&lt;p&gt;4) For the most part, the same people who are advocates of LAWS that are anti-choice (and many people are &amp;quot;pro-life&amp;quot; without wanting to limit reproductive freedom, actually) are advocating a traditional mindset. They&amp;#39;re not interested in outside-the-box solutions to the issue of the zygote, as I said above. They don&amp;#39;t care about the impact it would have on women, at best, and sometimes would be happy with women in a more traditional role. To not consider women&amp;#39;s rights while restricting them for other reasons is also sexist. I have yet to see an anti-choice law proposed with any provisions that protect women in any way, shape, or form, from the natural sexism of forcing women to bear children when they do not want to do so. &lt;/p&gt;\n\n&lt;p&gt;5) And the largest one: At the end of the day, participating in institutional decisions (like laws) that we fundamentally know lead to sexist results = sexism. &lt;/p&gt;\n\n&lt;p&gt;My personal aversion to anti-choice laws actually has nothing to do with sexism and everything to do with bodily autonomy (male or female, no one should tell you that you must donate a kidney, carry an organism to term that cannot be self-supporting, etc), but I also think such things are more rooted in sexism than you suggest. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgawhv0", "score_hidden": false, "stickied": false, "created": 1492305818.0, "created_utc": 1492277018.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgawxsv", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "ralph-j", "parent_id": "t3_65jy88", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; I don't think that most pro lifers oppose abortion because it would give a woman bodily autonomy\n\nIt might not be sexist *in its intent*, but it is sexist by its effects. \n\nIf the right to an abortion is denied, this uniquely disadvantages only women, since men obviously don't suffer from this disadvantage. Therefore it would by definition be sexist, even if unintentionally so.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t think that most pro lifers oppose abortion because it would give a woman bodily autonomy&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It might not be sexist &lt;em&gt;in its intent&lt;/em&gt;, but it is sexist by its effects. &lt;/p&gt;\n\n&lt;p&gt;If the right to an abortion is denied, this uniquely disadvantages only women, since men obviously don&amp;#39;t suffer from this disadvantage. Therefore it would by definition be sexist, even if unintentionally so.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgawxsv", "score_hidden": false, "stickied": false, "created": 1492306417.0, "created_utc": 1492277617.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgaxiny", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Positron311", "parent_id": "t1_dgaw4sd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Here is where I think the above is wrong.\n\nThere are both women that are pro-life and pro-choice. Assuming that most(or even a significant percentage of) women have inferiority complexes is rather difficult to prove and undermines much of the feminist movement, which is ironic considering that most feminists are pro-choice. Psychology is a gray field.\n\nEdit: The reason why I typed this up is because Mitoza implied that women also have inferiority complexes when he/she said this:\n\n&gt;I don't think there are other options. Idiocy in light of evidence or clarification is either an unconscious choice, and from there we can analyze what dissonance is causing the refusal, or it is a conscious choice, in which case it is politically motivated. In either case, overt or unconscious sexism surely plays a role.\n\nIt has long been a pro-choice assumption/ suppressing point that women who are pro-life have an inferiority complex. Ironically, this also undermines the feminist movement. Why should the movement elevate women socially to do what men have always done? Do they feel that men have more freedom, and thus feel inferior to men because they have that freedom, and then because of that inferiority convince society to elevate them to the level of men? Why not instead convince society that the work of women around the house is more noble than the men who go to work, rather than advocating for themselves to work?\n\nThese are questions not many Westerners (especially liberals) want to answer. ", "edited": 1492306706.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here is where I think the above is wrong.&lt;/p&gt;\n\n&lt;p&gt;There are both women that are pro-life and pro-choice. Assuming that most(or even a significant percentage of) women have inferiority complexes is rather difficult to prove and undermines much of the feminist movement, which is ironic considering that most feminists are pro-choice. Psychology is a gray field.&lt;/p&gt;\n\n&lt;p&gt;Edit: The reason why I typed this up is because Mitoza implied that women also have inferiority complexes when he/she said this:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t think there are other options. Idiocy in light of evidence or clarification is either an unconscious choice, and from there we can analyze what dissonance is causing the refusal, or it is a conscious choice, in which case it is politically motivated. In either case, overt or unconscious sexism surely plays a role.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It has long been a pro-choice assumption/ suppressing point that women who are pro-life have an inferiority complex. Ironically, this also undermines the feminist movement. Why should the movement elevate women socially to do what men have always done? Do they feel that men have more freedom, and thus feel inferior to men because they have that freedom, and then because of that inferiority convince society to elevate them to the level of men? Why not instead convince society that the work of women around the house is more noble than the men who go to work, rather than advocating for themselves to work?&lt;/p&gt;\n\n&lt;p&gt;These are questions not many Westerners (especially liberals) want to answer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaxiny", "score_hidden": false, "stickied": false, "created": 1492307201.0, "created_utc": 1492278401.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgb65a1", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "madlarks33", "parent_id": "t1_dgaw4sd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Really?  A delta for an argument that just Saud says \"that's an idiotic argument\"?  That's not an argument. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Really?  A delta for an argument that just Saud says &amp;quot;that&amp;#39;s an idiotic argument&amp;quot;?  That&amp;#39;s not an argument. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb65a1", "score_hidden": false, "stickied": false, "created": 1492318906.0, "created_utc": 1492290106.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": "", "user_reports": [], "id": "dgaw525", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dgaw4sd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/Mitoza ([29∆](/r/changemyview/wiki/user/Mitoza)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"Mitoza\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/Mitoza\"&gt;/u/Mitoza&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/Mitoza\"&gt;29∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22Mitoza%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaw525", "score_hidden": false, "stickied": false, "created": 1492305334.0, "created_utc": 1492276534.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": "", "user_reports": [], "id": "dgbybii", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "whitef530", "parent_id": "t1_dgbdlax", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sorry openforum2011, your comment has been removed: \n\n&gt; Comment Rule 3\\. \"Refrain from accusing OP or anyone else of being unwilling to change their view or of arguing in bad faith. If you are unsure whether someone is genuine, ask clarifying questions (see: socratic method). If you think they are still exhibiting ill behaviour, please message us.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_3)  \n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Rule+3+Appeal+openforum2011&amp;message=openforum2011+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/65jy88/cmv_being_against_abortion_does_not_inherently/dgbdlax/\\))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry openforum2011, your comment has been removed: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 3. &amp;quot;Refrain from accusing OP or anyone else of being unwilling to change their view or of arguing in bad faith. If you are unsure whether someone is genuine, ask clarifying questions (see: socratic method). If you think they are still exhibiting ill behaviour, please message us.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_3\"&gt;See the wiki page for more information.&lt;/a&gt;  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Rule+3+Appeal+openforum2011&amp;amp;message=openforum2011+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/65jy88/cmv_being_against_abortion_does_not_inherently/dgbdlax/)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbybii", "score_hidden": false, "stickied": false, "created": 1492372225.0, "created_utc": 1492343425.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbdlax", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgaw4sd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbdlax", "score_hidden": false, "stickied": false, "created": 1492329456.0, "created_utc": 1492300656.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaw4sd", "gilded": 0, "archived": false, "score": -11, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgauqpp", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaw4sd", "score_hidden": false, "stickied": false, "created": 1492305324.0, "created_utc": 1492276524.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -11}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgauqpp", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Mitoza", "parent_id": "t3_65jy88", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "Why does the case seem grey from an ethical standpoint? Even a fully grown adult dependant on your body for survival does not have a right to it. The only reason this seems grey is due to unexamined biases about how we expect the world to work on a human and gender level. We expect pregnant women to give their bodies for 9 months in favor of a baby's life because we expect afterwards a human will arrive and grow up and be a kid and we like humans. \n\nFrom my standpoint, the only position I've heard for anti-choice people is either idiocy in regards to ethics or sexism. I don't think there are other options. Idiocy in light of evidence or clarification is either an unconscious choice, and from there we can analyze what dissonance is causing the refusal, or it is a conscious choice, in which case it is politically motivated. In either case, overt or unconscious sexism surely plays a role.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why does the case seem grey from an ethical standpoint? Even a fully grown adult dependant on your body for survival does not have a right to it. The only reason this seems grey is due to unexamined biases about how we expect the world to work on a human and gender level. We expect pregnant women to give their bodies for 9 months in favor of a baby&amp;#39;s life because we expect afterwards a human will arrive and grow up and be a kid and we like humans. &lt;/p&gt;\n\n&lt;p&gt;From my standpoint, the only position I&amp;#39;ve heard for anti-choice people is either idiocy in regards to ethics or sexism. I don&amp;#39;t think there are other options. Idiocy in light of evidence or clarification is either an unconscious choice, and from there we can analyze what dissonance is causing the refusal, or it is a conscious choice, in which case it is politically motivated. In either case, overt or unconscious sexism surely plays a role.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgauqpp", "score_hidden": false, "stickied": false, "created": 1492303408.0, "created_utc": 1492274608.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": "", "user_reports": [], "id": "dgc3ov8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Milkshaketurtle79", "parent_id": "t1_dgbowpd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm mostly referring to males here. I think a lot of it is unconscious sexism, but I don't think everyone does. If we were to replace the baby with an adult, many pro lifers would say it's unfair to force someone to let somebody else feed off of your body.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m mostly referring to males here. I think a lot of it is unconscious sexism, but I don&amp;#39;t think everyone does. If we were to replace the baby with an adult, many pro lifers would say it&amp;#39;s unfair to force someone to let somebody else feed off of your body.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgc3ov8", "score_hidden": false, "stickied": false, "created": 1492382832.0, "created_utc": 1492354032.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbowpd", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "gman992", "parent_id": "t3_65jy88", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "What about the women who are pro life?  How can they be sexist? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What about the women who are pro life?  How can they be sexist? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbowpd", "score_hidden": false, "stickied": false, "created": 1492346438.0, "created_utc": 1492317638.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgaurxi", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RajonRondoIsTurtle", "parent_id": "t3_65jy88", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "&gt; While I agree with the premise of it- that the government shouldn't decide what people do to themselves, I don't think that most pro lifers oppose abortion because it would give a woman bodily autonomy, but because they believe that babies are separate entities from their mother who deserve life.\n\nThey may not oppose it because they want to deny a woman her bodily autonomy, but it is still a consequence of the policy they advocate for. Thus they are responsible for its consequences.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;While I agree with the premise of it- that the government shouldn&amp;#39;t decide what people do to themselves, I don&amp;#39;t think that most pro lifers oppose abortion because it would give a woman bodily autonomy, but because they believe that babies are separate entities from their mother who deserve life.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They may not oppose it because they want to deny a woman her bodily autonomy, but it is still a consequence of the policy they advocate for. Thus they are responsible for its consequences.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgaurxi", "score_hidden": false, "stickied": false, "created": 1492303457.0, "created_utc": 1492274657.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": "", "user_reports": [], "id": "dgau55z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_65jy88", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "**Note:** Your thread has **not** been removed.\n\nYour post's topic seems to be fairly common on this subreddit. Similar posts can be found through our [wiki page](http://www.reddit.com/r/changemyview/wiki/abortion#link) or via the [search function](http://www.reddit.com/r/changemyview/search?q=abortion&amp;amp;amp;restrict_sr=on).\n\nRegards, the mods of /r/changemyview.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/changemyview) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Note:&lt;/strong&gt; Your thread has &lt;strong&gt;not&lt;/strong&gt; been removed.&lt;/p&gt;\n\n&lt;p&gt;Your post&amp;#39;s topic seems to be fairly common on this subreddit. Similar posts can be found through our &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/abortion#link\"&gt;wiki page&lt;/a&gt; or via the &lt;a href=\"http://www.reddit.com/r/changemyview/search?q=abortion&amp;amp;amp;amp;restrict_sr=on\"&gt;search function&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Regards, the mods of &lt;a href=\"/r/changemyview\"&gt;/r/changemyview&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/changemyview\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgau55z", "score_hidden": false, "stickied": false, "created": 1492302554.0, "created_utc": 1492273754.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": "", "user_reports": [], "id": "dgcaeol", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ru_tang_clan", "parent_id": "t3_65jy88", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Ok, so I know this post is a little old now but I'll take a stab at it.\n\nI don't think every individual who is pro-life is sexist, but I think the history of the movement is sexist and people who are pro-life (depending on their other beliefs) are sort of unknowingly participating in a sexist history, and perpetuating sexism unintentionally.\n\nIt all starts with Victorian ideas about sex and morality. Originally, anti-abortion laws were less about protecting unborn life and more about prohibiting what was viewed as impermissible sex.  In Victorian times, the only sex that was morally permissible was sex for procreation.  Having sex just for fun was considered to be a sin (even if you were married!).  So laws against abortion were in the same vein as laws against birth control: if you weren't having sex for the purpose of making a baby, you were sinning and this should be prohibited.  If you did have sex for fun and got pregnant, there should be consequences.\n\nThis tradition was sexist because the burden and blame of prohibited sex fell more onto women than men, both in the sense that women received more difficulty and struggle from unplanned pregnancies and faced more social stigma, and also in the sense that it was viewed as more of a sin for a woman to have impermissible sex than a man.  The moral burden of stopping bad sex fell more onto women than men.\n\nWhile these Victorian ideals have died to a certain extent, many remnants are still present in our society.  For example, having sex for fun / before marriage is generally accepted in our society, but there's a question of degree that punishes women more than men (ie, man having a lot of casual sex is a player, woman having a lot of casual sex is a slut, etc).\n\nThe idea that a fetus or even a zygote was a human being did not really exist in these times.  In many traditions in many cultures, babies were not considered human until some time *after* they were born, for example I believe in the Jewish tradition babies were not considered to have a soul until they had been born for a year.  This is because used to babies died early on often, and therefore you weren't considered a full person until you had passed a certain threshold.\n\nSo originally, the anti-abortion laws weren't about the fetus being a human life, they were about proscribing impermissible immoral sex, which punished women much more than men.\n\nFast forward to today - many people earnestly believe that the fetus is  a human being.  I'm sympathetic to this position, though I have a hard time understanding to a certain point - I think a fertilized embryo is pretty clearly not a \"human being\" or  \"baby,\" but I understand that many people earnestly believe this to be true. \n\nThe modern religious anti-abortion movement is tied to these original Victorian ideals about sex.  The mainstream anti-abortion movement is against birth control and sex ed just as much as it is against abortion.\n\nI think abortion is something that should be limited.  An abortion is a sad event.  But, the best proven way of decreasing abortion rates is providing easy access to birth control, combined with accurate sex education information.  Making abortion illegal does not really decrease abortion rates; it just increases the rate of unsafe, at home or black market abortions.\n\nIf someone today is \"pro-life\" but also supports providing affordable birth control and accurate sex education to people of reproducing age, then I don't think that's problematic.  I still believe abortion should be an option for people who make mistakes, but if someone earnestly believes the fetus is a life and wants to protect fetuses, I think that's ok and not \"sexist\" if they are ok with the most effective means of achieving that end: birth control and sex ed.\n\nHowever, when people are \"pro-life\" but also against birth control and sex education, I think these views are inherently sexist.  The individual person might not think of it as a gender issue, and I can grant that they sincerely believe that, but to be anti-abortion and also anti-BC is participating in a long sexist tradition of punishing people, but especially women, for having sex. \n\nIt also makes me question the sincerity of the \"abortion is murder\" belief - if you really thought people were being murdered, and you knew that the best way to prevent the murder was to give men and women access to birth control, why wouldn't you?  Even if you think non-procreative sex is immoral, surely it's better than murder? Unless you think non-procreative sex is the big issue to begin with, which again I think is sort of an inherently sexist idea since women are almost always punished more than men. \n\nSo that's how I feel about it - being \"anti-abortion\" in itself I don't think is sexist, but I think the history of the movement and also many people who support the mainstream movement are sexist.  But it is possible I think to be \"pro-life\" and not sexist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok, so I know this post is a little old now but I&amp;#39;ll take a stab at it.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think every individual who is pro-life is sexist, but I think the history of the movement is sexist and people who are pro-life (depending on their other beliefs) are sort of unknowingly participating in a sexist history, and perpetuating sexism unintentionally.&lt;/p&gt;\n\n&lt;p&gt;It all starts with Victorian ideas about sex and morality. Originally, anti-abortion laws were less about protecting unborn life and more about prohibiting what was viewed as impermissible sex.  In Victorian times, the only sex that was morally permissible was sex for procreation.  Having sex just for fun was considered to be a sin (even if you were married!).  So laws against abortion were in the same vein as laws against birth control: if you weren&amp;#39;t having sex for the purpose of making a baby, you were sinning and this should be prohibited.  If you did have sex for fun and got pregnant, there should be consequences.&lt;/p&gt;\n\n&lt;p&gt;This tradition was sexist because the burden and blame of prohibited sex fell more onto women than men, both in the sense that women received more difficulty and struggle from unplanned pregnancies and faced more social stigma, and also in the sense that it was viewed as more of a sin for a woman to have impermissible sex than a man.  The moral burden of stopping bad sex fell more onto women than men.&lt;/p&gt;\n\n&lt;p&gt;While these Victorian ideals have died to a certain extent, many remnants are still present in our society.  For example, having sex for fun / before marriage is generally accepted in our society, but there&amp;#39;s a question of degree that punishes women more than men (ie, man having a lot of casual sex is a player, woman having a lot of casual sex is a slut, etc).&lt;/p&gt;\n\n&lt;p&gt;The idea that a fetus or even a zygote was a human being did not really exist in these times.  In many traditions in many cultures, babies were not considered human until some time &lt;em&gt;after&lt;/em&gt; they were born, for example I believe in the Jewish tradition babies were not considered to have a soul until they had been born for a year.  This is because used to babies died early on often, and therefore you weren&amp;#39;t considered a full person until you had passed a certain threshold.&lt;/p&gt;\n\n&lt;p&gt;So originally, the anti-abortion laws weren&amp;#39;t about the fetus being a human life, they were about proscribing impermissible immoral sex, which punished women much more than men.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to today - many people earnestly believe that the fetus is  a human being.  I&amp;#39;m sympathetic to this position, though I have a hard time understanding to a certain point - I think a fertilized embryo is pretty clearly not a &amp;quot;human being&amp;quot; or  &amp;quot;baby,&amp;quot; but I understand that many people earnestly believe this to be true. &lt;/p&gt;\n\n&lt;p&gt;The modern religious anti-abortion movement is tied to these original Victorian ideals about sex.  The mainstream anti-abortion movement is against birth control and sex ed just as much as it is against abortion.&lt;/p&gt;\n\n&lt;p&gt;I think abortion is something that should be limited.  An abortion is a sad event.  But, the best proven way of decreasing abortion rates is providing easy access to birth control, combined with accurate sex education information.  Making abortion illegal does not really decrease abortion rates; it just increases the rate of unsafe, at home or black market abortions.&lt;/p&gt;\n\n&lt;p&gt;If someone today is &amp;quot;pro-life&amp;quot; but also supports providing affordable birth control and accurate sex education to people of reproducing age, then I don&amp;#39;t think that&amp;#39;s problematic.  I still believe abortion should be an option for people who make mistakes, but if someone earnestly believes the fetus is a life and wants to protect fetuses, I think that&amp;#39;s ok and not &amp;quot;sexist&amp;quot; if they are ok with the most effective means of achieving that end: birth control and sex ed.&lt;/p&gt;\n\n&lt;p&gt;However, when people are &amp;quot;pro-life&amp;quot; but also against birth control and sex education, I think these views are inherently sexist.  The individual person might not think of it as a gender issue, and I can grant that they sincerely believe that, but to be anti-abortion and also anti-BC is participating in a long sexist tradition of punishing people, but especially women, for having sex. &lt;/p&gt;\n\n&lt;p&gt;It also makes me question the sincerity of the &amp;quot;abortion is murder&amp;quot; belief - if you really thought people were being murdered, and you knew that the best way to prevent the murder was to give men and women access to birth control, why wouldn&amp;#39;t you?  Even if you think non-procreative sex is immoral, surely it&amp;#39;s better than murder? Unless you think non-procreative sex is the big issue to begin with, which again I think is sort of an inherently sexist idea since women are almost always punished more than men. &lt;/p&gt;\n\n&lt;p&gt;So that&amp;#39;s how I feel about it - being &amp;quot;anti-abortion&amp;quot; in itself I don&amp;#39;t think is sexist, but I think the history of the movement and also many people who support the mainstream movement are sexist.  But it is possible I think to be &amp;quot;pro-life&amp;quot; and not sexist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgcaeol", "score_hidden": false, "stickied": false, "created": 1492391979.0, "created_utc": 1492363179.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": "", "user_reports": [], "id": "dgbji6u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Grunt08", "parent_id": "t1_dgb8e16", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Sorry weakbackhanderer, your comment has been removed:\n\n&gt; Comment Rule 1\\. \"Direct responses to a CMV post must challenge at least one aspect of OP’s current view (however minor), unless they are asking a clarifying question. Arguments in favor of the view OP is willing to change must be restricted to replies to comments.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)  \n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Rule+1+Appeal+weakbackhanderer&amp;message=weakbackhanderer+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/65jy88/cmv_being_against_abortion_does_not_inherently/dgb8e16/\\))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry weakbackhanderer, your comment has been removed:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 1. &amp;quot;Direct responses to a CMV post must challenge at least one aspect of OP’s current view (however minor), unless they are asking a clarifying question. Arguments in favor of the view OP is willing to change must be restricted to replies to comments.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1\"&gt;See the wiki page for more information.&lt;/a&gt;  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Rule+1+Appeal+weakbackhanderer&amp;amp;message=weakbackhanderer+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/65jy88/cmv_being_against_abortion_does_not_inherently/dgb8e16/)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbji6u", "score_hidden": false, "stickied": false, "created": 1492337978.0, "created_utc": 1492309178.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb8e16", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65jy88", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb8e16", "score_hidden": false, "stickied": false, "created": 1492322009.0, "created_utc": 1492293209.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65jy88", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgavjwo", "gilded": 0, "archived": false, "score": -7, "report_reasons": null, "author": "jakefromstatefarm10", "parent_id": "t3_65jy88", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You're coming out against a basic human right for a woman to control HER body. That is sexist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re coming out against a basic human right for a woman to control HER body. That is sexist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgavjwo", "score_hidden": false, "stickied": false, "created": 1492304531.0, "created_utc": 1492275731.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -7}}], "after": null, "before": null}}]