[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Okay, let me begin by stating the properties of the Electoral College before explaining why I think each of them has a negative effect.&lt;/p&gt;\n\n&lt;p&gt;1- A state where 51% of the votes goes to one candidate has 100% of its electoral votes dedicated to that one candidate.&lt;/p&gt;\n\n&lt;p&gt;2- Delegates exist.&lt;/p&gt;\n\n&lt;p&gt;3- Many American territories (like American Samoa, Guam and DC too I believe) don&amp;#39;t get a say in the US elections because the voting system is based on delegate distribution by state.&lt;/p&gt;\n\n&lt;p&gt;4- In the end it&amp;#39;s a First Past the Post system counted by electoral votes.&lt;/p&gt;\n\n&lt;p&gt;5- Every state gets 3 electoral votes to start with before the remaining votes are distributed by population.&lt;/p&gt;\n\n&lt;p&gt;These are the properties I want to discuss.&lt;/p&gt;\n\n&lt;p&gt;1- Imagine you live in California, a mostly Democratic state to my knowledge, and you decide to vote for a Republican nominee. Your vote is basically completely discarded. Any non-swing state basically leaves all votes completely useless, as the entire set of electoral votes go to the one candidate anyways, making potentially millions of votes inconsequential to the election.&lt;/p&gt;\n\n&lt;p&gt;2- Delegates can decide to vote differently from how they&amp;#39;re supposed to, which is pretty much the opposite of how a democracy should work.&lt;/p&gt;\n\n&lt;p&gt;3- American citizens should be allowed to vote no matter where in America they live, right? There is no reason why a Samoan citizen should have any less of a vote in the election than a Texan citizen.&lt;/p&gt;\n\n&lt;p&gt;4- The first past the post system is absolutely terrible, and is a large reason for why the American elections are mostly between only 2 parties. Even if the electoral votes were representative of the population, which they&amp;#39;re not because of points 1 and 5, this voting system would remain problematic. There are many reasons as to why this is, but the biggest one is that if a 3 party would get a lot of support, it would actively suck votes away from the party that is most like it, making votes for this party ensure that the party least like it will win.&lt;/p&gt;\n\n&lt;p&gt;5- This simply shifts the balance between how much a single vote is worth. Simplifying the amount of votes to electoral votes is already problematic because it can cause rounding errors, so even if all of the above points are fixed this could still cause problems now and then. Then going into the fact that the electoral votes aren&amp;#39;t completely fairly distributed causes the situations where candidates won elections while other parties had more votes. This works mostly in favor of the Republican party because the least populous states get more votes than they should have. Calculating the proportions here show that a vote from a Wyoming-citizen can be roughly worth 5 times as much as a vote from someone in California. There is no reason why one vote should be worth more than another.&lt;/p&gt;\n\n&lt;p&gt;Most of my information sources are videos by CGP Grey who has a very one-sided vision on the Electoral College, hence why I want to see the other side of the argument here too. Note that I do not want to replace the Electoral College with just the popular vote, the mathematics behind voting systems can be fairly difficult and this particular one would already cause the same problems pointed out in argument number 4.&lt;/p&gt;\n\n&lt;p&gt;Edit: fixed spacing and replaced the word &amp;quot;districts&amp;quot; by &amp;quot;territories&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Edit2: I do need to clarify (as someone in the comments pointed out) that I also need to give a better option if I want to argue that the Electoral College needs to be replaced. My opinion is essentially that pretty much any voting system I know of is better than the electoral college, but the best options I think should have preferential voting (aka you can rank the candidates) allowing for the candidate who most people can somewhat agree on, rather than the one candidate with the most first place votes, to win. This mostly resembles STV which, if you&amp;#39;re willing to find out more about in order to raise an argument is much more clearly explained in this video by CGP Grey &lt;a href=\"https://www.youtube.com/watch?v=l8XOZJkozfI\"&gt;https://www.youtube.com/watch?v=l8XOZJkozfI&lt;/a&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;This is a footnote from the CMV moderators. We&amp;#39;d like to remind you of a couple of things. Firstly, please&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules\"&gt;read through our rules&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting\"&gt;downvotes don&amp;#39;t change views&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;! Any questions or concerns? Feel free to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/message/compose?to=/r/changemyview\"&gt;message us&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;Happy CMVing!&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Okay, let me begin by stating the properties of the Electoral College before explaining why I think each of them has a negative effect.\n\n1- A state where 51% of the votes goes to one candidate has 100% of its electoral votes dedicated to that one candidate.\n\n2- Delegates exist.\n\n3- Many American territories (like American Samoa, Guam and DC too I believe) don't get a say in the US elections because the voting system is based on delegate distribution by state.\n\n4- In the end it's a First Past the Post system counted by electoral votes.\n\n5- Every state gets 3 electoral votes to start with before the remaining votes are distributed by population.\n\n\nThese are the properties I want to discuss.\n\n\n1- Imagine you live in California, a mostly Democratic state to my knowledge, and you decide to vote for a Republican nominee. Your vote is basically completely discarded. Any non-swing state basically leaves all votes completely useless, as the entire set of electoral votes go to the one candidate anyways, making potentially millions of votes inconsequential to the election.\n\n2- Delegates can decide to vote differently from how they're supposed to, which is pretty much the opposite of how a democracy should work.\n\n3- American citizens should be allowed to vote no matter where in America they live, right? There is no reason why a Samoan citizen should have any less of a vote in the election than a Texan citizen.\n\n4- The first past the post system is absolutely terrible, and is a large reason for why the American elections are mostly between only 2 parties. Even if the electoral votes were representative of the population, which they're not because of points 1 and 5, this voting system would remain problematic. There are many reasons as to why this is, but the biggest one is that if a 3 party would get a lot of support, it would actively suck votes away from the party that is most like it, making votes for this party ensure that the party least like it will win.\n\n5- This simply shifts the balance between how much a single vote is worth. Simplifying the amount of votes to electoral votes is already problematic because it can cause rounding errors, so even if all of the above points are fixed this could still cause problems now and then. Then going into the fact that the electoral votes aren't completely fairly distributed causes the situations where candidates won elections while other parties had more votes. This works mostly in favor of the Republican party because the least populous states get more votes than they should have. Calculating the proportions here show that a vote from a Wyoming-citizen can be roughly worth 5 times as much as a vote from someone in California. There is no reason why one vote should be worth more than another.\n\n\nMost of my information sources are videos by CGP Grey who has a very one-sided vision on the Electoral College, hence why I want to see the other side of the argument here too. Note that I do not want to replace the Electoral College with just the popular vote, the mathematics behind voting systems can be fairly difficult and this particular one would already cause the same problems pointed out in argument number 4.\n\nEdit: fixed spacing and replaced the word \"districts\" by \"territories\".\n\nEdit2: I do need to clarify (as someone in the comments pointed out) that I also need to give a better option if I want to argue that the Electoral College needs to be replaced. My opinion is essentially that pretty much any voting system I know of is better than the electoral college, but the best options I think should have preferential voting (aka you can rank the candidates) allowing for the candidate who most people can somewhat agree on, rather than the one candidate with the most first place votes, to win. This mostly resembles STV which, if you're willing to find out more about in order to raise an argument is much more clearly explained in this video by CGP Grey https://www.youtube.com/watch?v=l8XOZJkozfI\n\n_____\n\n&gt; *This is a footnote from the CMV moderators. We'd like to remind you of a couple of things. Firstly, please* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65l75e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 19, "report_reasons": null, "author": "Irratix", "saved": false, "mod_reports": [], "name": "t3_65l75e", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": 1492293562.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/65l75e/cmvthe_electoral_college_needs_to_be_repealed_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492316417.0, "url": "https://www.reddit.com/r/changemyview/comments/65l75e/cmvthe_electoral_college_needs_to_be_repealed_and/", "author_flair_text": null, "quarantine": false, "title": "CMV:The Electoral College needs to be repealed and replaced", "created_utc": 1492287617.0, "distinguished": null, "media": null, "upvote_ratio": 0.68, "num_comments": 53, "visited": false, "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": "", "user_reports": [], "id": "dgbanfw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Irratix", "parent_id": "t1_dgb9bzf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "\"under a system such as STV as mentioned, it is more likely for the 'wrong' candidate to win, with less of the popular vote.\"\nThe popular vote in my opinion seems like only a small amount of what should be considered. It only considers everyone's favorite party, but directly assumes people hate the other parties equally, which in a multi-party system is almost never the case. While the popular vote may give you some measure of how popular each candidate is, I think it's unfair to say anyone is definitely the 'wrong' option if they have a minority popular vote when there are three or more options to choose from.\n\n\"Rogue electors or faithless electors as they're sometime known have never had an impact on the election result and are often used more as a protest than anything else.\"\nI know they've never swung an election, but I'm arguing that them changing the outcome, however unlikely, shouldn't even be possible.\n\n\"The electoral college also promotes a two party race which fosters stability.\"\nOr as is now the case in America, a lot of division between two halves of the population.\n\n\"There is also a degree of moderation as the two parties must appeal to the middle to win elections, so the parties tend to be moderate.and finally ease as voters have only to decide between two parties.\"\nI do get my information of American politics from a small amount of admittedly relatively biased sources, but it really doesn't seem fair to me to say that both sides are very moderate, as they both mostly oppose eachother in as much as is politically possible. Also, easing the voters into a black and white decision doesn't same favorable to me, as a lot of political views are completely unrepresented this way.\n\n\"One of the key reasons as to why the electoral college is used is to uphold the voices of the small states. The founding fathers wanted to avoid the voices of the small states being eroded at the expense of the large states. If all states are guaranteed at least 3 ECVs then they feel as if they have an impact on the result.\"\nBut the way they generally impact the result is not carefully considered. The small states combined form a large minority of the population, but giving them this extra voting power ensures that a minority of the population can rule over a majority who voted against, which seems extremely unfavorable. Besides, politicians still only listen to swing states, not necessarily small states. Using a preferential voting system ensures that the larger parties need to listen to the small states because it's too large a minority not to have as potential first or second votes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;under a system such as STV as mentioned, it is more likely for the &amp;#39;wrong&amp;#39; candidate to win, with less of the popular vote.&amp;quot;\nThe popular vote in my opinion seems like only a small amount of what should be considered. It only considers everyone&amp;#39;s favorite party, but directly assumes people hate the other parties equally, which in a multi-party system is almost never the case. While the popular vote may give you some measure of how popular each candidate is, I think it&amp;#39;s unfair to say anyone is definitely the &amp;#39;wrong&amp;#39; option if they have a minority popular vote when there are three or more options to choose from.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Rogue electors or faithless electors as they&amp;#39;re sometime known have never had an impact on the election result and are often used more as a protest than anything else.&amp;quot;\nI know they&amp;#39;ve never swung an election, but I&amp;#39;m arguing that them changing the outcome, however unlikely, shouldn&amp;#39;t even be possible.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The electoral college also promotes a two party race which fosters stability.&amp;quot;\nOr as is now the case in America, a lot of division between two halves of the population.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;There is also a degree of moderation as the two parties must appeal to the middle to win elections, so the parties tend to be moderate.and finally ease as voters have only to decide between two parties.&amp;quot;\nI do get my information of American politics from a small amount of admittedly relatively biased sources, but it really doesn&amp;#39;t seem fair to me to say that both sides are very moderate, as they both mostly oppose eachother in as much as is politically possible. Also, easing the voters into a black and white decision doesn&amp;#39;t same favorable to me, as a lot of political views are completely unrepresented this way.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;One of the key reasons as to why the electoral college is used is to uphold the voices of the small states. The founding fathers wanted to avoid the voices of the small states being eroded at the expense of the large states. If all states are guaranteed at least 3 ECVs then they feel as if they have an impact on the result.&amp;quot;\nBut the way they generally impact the result is not carefully considered. The small states combined form a large minority of the population, but giving them this extra voting power ensures that a minority of the population can rule over a majority who voted against, which seems extremely unfavorable. Besides, politicians still only listen to swing states, not necessarily small states. Using a preferential voting system ensures that the larger parties need to listen to the small states because it&amp;#39;s too large a minority not to have as potential first or second votes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbanfw", "score_hidden": false, "stickied": false, "created": 1492325251.0, "created_utc": 1492296451.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgb9bzf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "hyammez", "parent_id": "t3_65l75e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "One of the key reasons as to why the electoral college is used is to uphold the voices of the small states. The founding fathers wanted to avoid the voices of the small states being eroded at the expense of the large states. If all states are guaranteed at least 3 ECVs then they feel as if they have an impact on the result.\n\nRogue electors or faithless electors as they're sometime known have never had an impact on the election result and are often used more as a protest than anything else.\n\nThe electoral college also promotes a two party race which fosters stability. There is also a degree of moderation as the two parties must appeal to the middle to win elections, so the parties tend to be moderate.and finally ease as voters have only to decide between two parties.\n\nThe winning candidate is also likely to win the majority of the vote with the electoral college. (2008/2010) whereas under a system such as STV as mentioned, it is more likely for the 'wrong' candidate to win, with less of the popular vote.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One of the key reasons as to why the electoral college is used is to uphold the voices of the small states. The founding fathers wanted to avoid the voices of the small states being eroded at the expense of the large states. If all states are guaranteed at least 3 ECVs then they feel as if they have an impact on the result.&lt;/p&gt;\n\n&lt;p&gt;Rogue electors or faithless electors as they&amp;#39;re sometime known have never had an impact on the election result and are often used more as a protest than anything else.&lt;/p&gt;\n\n&lt;p&gt;The electoral college also promotes a two party race which fosters stability. There is also a degree of moderation as the two parties must appeal to the middle to win elections, so the parties tend to be moderate.and finally ease as voters have only to decide between two parties.&lt;/p&gt;\n\n&lt;p&gt;The winning candidate is also likely to win the majority of the vote with the electoral college. (2008/2010) whereas under a system such as STV as mentioned, it is more likely for the &amp;#39;wrong&amp;#39; candidate to win, with less of the popular vote.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb9bzf", "score_hidden": false, "stickied": false, "created": 1492323332.0, "created_utc": 1492294532.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": "", "user_reports": [], "id": "dgbbfeq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Irratix", "parent_id": "t1_dgb994k", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "There is way too much going on in your comment for me to process it right now, so please forgive me while I take a day or so to think about everything you have said here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is way too much going on in your comment for me to process it right now, so please forgive me while I take a day or so to think about everything you have said here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbbfeq", "score_hidden": false, "stickied": false, "created": 1492326401.0, "created_utc": 1492297601.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgb994k", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "paosnes", "parent_id": "t3_65l75e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "My position tl:dr: The electoral college is definitely terrible, but so is every other form of finding good representatives. The problem then becomes prioritizing which terrible attributes of systems are most acceptable. Popular elections with plurality winners is most obvious to me, but I would definitely consider others.\n\nI frequently teach a Political Science class on American politics, and we always have an interesting discussion on the Electoral College, so I'll try to put some of my frequent discussion points here. \n\nSuffice to say, the problem is extremely complicated. I'll take on a few points, and probably just avoid talking about others, because they're less interesting or would involve too many digressions. \n\nA primary axiom worth assuming from here on out: disparaging a current electoral system without offering a specific alternative does not amount to an effective critique, as any system of aggregating preferences necessarily fails a few basic requirements. Reliably translating majority-held preferences to group preferences is a primary concern, but there are others. [This is formalized in what is called Arrow's impossibility theorem.](https://en.wikipedia.org/wiki/Arrow%27s_impossibility_theorem) (Quick example: no preference aggregating system can guarantee that if most people prefer option A to option B, and option B to option C, that in every election A will beat C if they up for consideration)\n\nBecause of this, comparing STV against the current American Presidential election system is \"moving the goalposts\", because there can't be multiple Presidents according to the Constitution (Art II Section 1 Clause 1 is pretty unequivocal about this). Ironically, STV would probably be close or completely equivalent to FPTP in single-winner elections. CGP grey's video is persuasive, but he relies on oversimplification and contrived examples which make STV look great, without considering the problematic ones. Also, the system isn't sufficiently explained. Which voters get the privilege of having their \"extra vote\" shifted to another candidate, assuming not all voters are in agreement on their second favorite? Those voters get to have their votes contribute to multiple winners, whereas the others only contribute to one. \n\nI'm not of the opinion that the US needs a single president, it's just that the purpose of the electoral college is to find a suitable winner among candidates competing for a single office, and STV isn't that. Thus, assuming we like singular executive branches (which I'm willing to argue on behalf of), we need to think about alternatives that provide them before considering changing the nature of the US's representative democracy.\n\nThe first and most obvious possibility is popular elections, with a plurality necessary for winning. This doesn't solve the problem of candidates winning when most people vote against them, but it does solve the misrepresentation problem for California and Wyoming. A similar solution is just proportional assignment of electors, which two states already (sort of) do. This doesn't even solve the Cal-Wy unfairness, but it does help with the swing-state preference result.\n \nIs there something which solves the majority voting against someone as well as the state unfairness problems? Yes, a mandatory two-party popular vote system, with strict primary processes arriving upon 2 candidates. Unfortunately, those primary elections now have all the problems we found in the Electoral college.\n\nThis problem is kind of like those squeezing balloon net toys [Image link](https://i.ytimg.com/vi/GVfRO_gDeqc/maxresdefault.jpg) If you're squeezing the problem, and push one of the pustules back in, another will form. The best solution is probably just to keep it simple, and attack the abusers individually. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My position tl:dr: The electoral college is definitely terrible, but so is every other form of finding good representatives. The problem then becomes prioritizing which terrible attributes of systems are most acceptable. Popular elections with plurality winners is most obvious to me, but I would definitely consider others.&lt;/p&gt;\n\n&lt;p&gt;I frequently teach a Political Science class on American politics, and we always have an interesting discussion on the Electoral College, so I&amp;#39;ll try to put some of my frequent discussion points here. &lt;/p&gt;\n\n&lt;p&gt;Suffice to say, the problem is extremely complicated. I&amp;#39;ll take on a few points, and probably just avoid talking about others, because they&amp;#39;re less interesting or would involve too many digressions. &lt;/p&gt;\n\n&lt;p&gt;A primary axiom worth assuming from here on out: disparaging a current electoral system without offering a specific alternative does not amount to an effective critique, as any system of aggregating preferences necessarily fails a few basic requirements. Reliably translating majority-held preferences to group preferences is a primary concern, but there are others. &lt;a href=\"https://en.wikipedia.org/wiki/Arrow%27s_impossibility_theorem\"&gt;This is formalized in what is called Arrow&amp;#39;s impossibility theorem.&lt;/a&gt; (Quick example: no preference aggregating system can guarantee that if most people prefer option A to option B, and option B to option C, that in every election A will beat C if they up for consideration)&lt;/p&gt;\n\n&lt;p&gt;Because of this, comparing STV against the current American Presidential election system is &amp;quot;moving the goalposts&amp;quot;, because there can&amp;#39;t be multiple Presidents according to the Constitution (Art II Section 1 Clause 1 is pretty unequivocal about this). Ironically, STV would probably be close or completely equivalent to FPTP in single-winner elections. CGP grey&amp;#39;s video is persuasive, but he relies on oversimplification and contrived examples which make STV look great, without considering the problematic ones. Also, the system isn&amp;#39;t sufficiently explained. Which voters get the privilege of having their &amp;quot;extra vote&amp;quot; shifted to another candidate, assuming not all voters are in agreement on their second favorite? Those voters get to have their votes contribute to multiple winners, whereas the others only contribute to one. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not of the opinion that the US needs a single president, it&amp;#39;s just that the purpose of the electoral college is to find a suitable winner among candidates competing for a single office, and STV isn&amp;#39;t that. Thus, assuming we like singular executive branches (which I&amp;#39;m willing to argue on behalf of), we need to think about alternatives that provide them before considering changing the nature of the US&amp;#39;s representative democracy.&lt;/p&gt;\n\n&lt;p&gt;The first and most obvious possibility is popular elections, with a plurality necessary for winning. This doesn&amp;#39;t solve the problem of candidates winning when most people vote against them, but it does solve the misrepresentation problem for California and Wyoming. A similar solution is just proportional assignment of electors, which two states already (sort of) do. This doesn&amp;#39;t even solve the Cal-Wy unfairness, but it does help with the swing-state preference result.&lt;/p&gt;\n\n&lt;p&gt;Is there something which solves the majority voting against someone as well as the state unfairness problems? Yes, a mandatory two-party popular vote system, with strict primary processes arriving upon 2 candidates. Unfortunately, those primary elections now have all the problems we found in the Electoral college.&lt;/p&gt;\n\n&lt;p&gt;This problem is kind of like those squeezing balloon net toys &lt;a href=\"https://i.ytimg.com/vi/GVfRO_gDeqc/maxresdefault.jpg\"&gt;Image link&lt;/a&gt; If you&amp;#39;re squeezing the problem, and push one of the pustules back in, another will form. The best solution is probably just to keep it simple, and attack the abusers individually. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb994k", "score_hidden": false, "stickied": false, "created": 1492323218.0, "created_utc": 1492294418.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": "", "user_reports": [], "id": "dgba2n7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Irratix", "parent_id": "t1_dgb8sye", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Okay, let me unpack the small things first. \n\n\"We can fix this without repealing the electoral college\"\nThis is true, but it is part of the current system. I wanted to talk about every single part of the voting system I think needs changing, even if this property can be changed while mostly keeping the rest of the system intact.\n\n\"Alternative voting systems dont inherently fix this issue\"\nThough many would. I gave preferential voting systems as example, as this to my view is the most essential part of a voting system. A vote should not ever actively result in the people you don't want elected to be elected. Preferntial voting systems mostly solve this issue I'd think. \n\n\"That Samoan citizen will not be listened to regardless. Politicians will only care about citizens in California, Texas, and the north east, because you are better off getting an additional 1% of NYC than the vote of everyone in the American Samoa\"\nEven if they aren't listened to, they should still get a vote. The argument here is essentially like saying that Charleston only has 50 thousand citizens and is therefore inconsequential to the election, therefore won't be listened to and therefore doesn't need to be able to vote. It seems very wrong to me to arbitrarily count or not count certain territories based on the amount of people that live there.\n\n\"How would you replace this, while having voters outside of Texas, the north east, and California listened to?\"\n\"How else do you make it so that Wyoming citizen is listened to at all?\"\nThis is a much more complicated question with a much more complicated answer, but the electoral college is not a potential solution. As much as votes in Wyoming count more than those in California, it's still only 3 electoral votes. Besides, at the moment candidates pretty much only care about swing states, because that's were a little sway actually can have an effect. And however much you want to just give small states some extra voting power so they are represented, this creates the problem that now a minority of the voters get the control over the country, which is definitely not desirable. My suggestion of a preferential voting system would force the candidates to focus on as many people as possible, though that seemingly creates a situation where politicians only listen to densely populated areas. This is where local representation can have a large positive impact, also giving a small solution to the problem you proposed with Samoa. With my limited knowledge of voting systems STV seems like a mostly reasonable solution here, though I am aware there are potentially better options. But essentially, I think the electoral college does not fix any of the problems you are proposing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, let me unpack the small things first. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;We can fix this without repealing the electoral college&amp;quot;\nThis is true, but it is part of the current system. I wanted to talk about every single part of the voting system I think needs changing, even if this property can be changed while mostly keeping the rest of the system intact.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Alternative voting systems dont inherently fix this issue&amp;quot;\nThough many would. I gave preferential voting systems as example, as this to my view is the most essential part of a voting system. A vote should not ever actively result in the people you don&amp;#39;t want elected to be elected. Preferntial voting systems mostly solve this issue I&amp;#39;d think. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;That Samoan citizen will not be listened to regardless. Politicians will only care about citizens in California, Texas, and the north east, because you are better off getting an additional 1% of NYC than the vote of everyone in the American Samoa&amp;quot;\nEven if they aren&amp;#39;t listened to, they should still get a vote. The argument here is essentially like saying that Charleston only has 50 thousand citizens and is therefore inconsequential to the election, therefore won&amp;#39;t be listened to and therefore doesn&amp;#39;t need to be able to vote. It seems very wrong to me to arbitrarily count or not count certain territories based on the amount of people that live there.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;How would you replace this, while having voters outside of Texas, the north east, and California listened to?&amp;quot;\n&amp;quot;How else do you make it so that Wyoming citizen is listened to at all?&amp;quot;\nThis is a much more complicated question with a much more complicated answer, but the electoral college is not a potential solution. As much as votes in Wyoming count more than those in California, it&amp;#39;s still only 3 electoral votes. Besides, at the moment candidates pretty much only care about swing states, because that&amp;#39;s were a little sway actually can have an effect. And however much you want to just give small states some extra voting power so they are represented, this creates the problem that now a minority of the voters get the control over the country, which is definitely not desirable. My suggestion of a preferential voting system would force the candidates to focus on as many people as possible, though that seemingly creates a situation where politicians only listen to densely populated areas. This is where local representation can have a large positive impact, also giving a small solution to the problem you proposed with Samoa. With my limited knowledge of voting systems STV seems like a mostly reasonable solution here, though I am aware there are potentially better options. But essentially, I think the electoral college does not fix any of the problems you are proposing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgba2n7", "score_hidden": false, "stickied": false, "created": 1492324398.0, "created_utc": 1492295598.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgb8sye", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "1500500", "parent_id": "t3_65l75e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "&gt; 1- Imagine you live in California, a mostly Democratic state to my knowledge, and you decide to vote for a Republican nominee. Your vote is basically completely discarded. Any non-swing state basically leaves all votes completely useless, as the entire set of electoral votes go to the one candidate anyways, making potentially millions of votes inconsequential to the election.\n\nHow would you replace this, while having voters outside of Texas, the north east, and California listened to?\n\n&gt; 2- Delegates can decide to vote differently from how they're supposed to, which is pretty much the opposite of how a democracy should work.\n\nWe can fix this without repealing the electoral college\n\n&gt; 3- American citizens should be allowed to vote no matter where in America they live, right? There is no reason why a Samoan citizen should have any less of a vote in the election than a Texan citizen.\n\nThat Samoan citizen will not be listened to regardless. Politicians will only care about citizens in California, Texas, and the north east, because you are better off getting an additional 1% of NYC than the vote of everyone in the American Samoa \n\n&gt; 4- The first past the post system is absolutely terrible, and is a large reason for why the American elections are mostly between only 2 parties. Even if the electoral votes were representative of the population, which they're not because of points 1 and 5, this voting system would remain problematic. There are many reasons as to why this is, but the biggest one is that if a 3 party would get a lot of support, it would actively suck votes away from the party that is most like it, making votes for this party ensure that the party least like it will win.\n\nAlternative voting systems dont inherently fix this issue\n\n&gt; 5- This simply shifts the balance between how much a single vote is worth. Simplifying the amount of votes to electoral votes is already problematic because it can cause rounding errors, so even if all of the above points are fixed this could still cause problems now and then. Then going into the fact that the electoral votes aren't completely fairly distributed causes the situations where candidates won elections while other parties had more votes. This works mostly in favor of the Republican party because the least populous states get more votes than they should have. Calculating the proportions here show that a vote from a Wyoming-citizen can be roughly worth 5 times as much as a vote from someone in California. There is no reason why one vote should be worth more than another.\n\nHow else do you make it so that Wyoming citizen is listened to at all?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;1- Imagine you live in California, a mostly Democratic state to my knowledge, and you decide to vote for a Republican nominee. Your vote is basically completely discarded. Any non-swing state basically leaves all votes completely useless, as the entire set of electoral votes go to the one candidate anyways, making potentially millions of votes inconsequential to the election.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How would you replace this, while having voters outside of Texas, the north east, and California listened to?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;2- Delegates can decide to vote differently from how they&amp;#39;re supposed to, which is pretty much the opposite of how a democracy should work.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;We can fix this without repealing the electoral college&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;3- American citizens should be allowed to vote no matter where in America they live, right? There is no reason why a Samoan citizen should have any less of a vote in the election than a Texan citizen.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That Samoan citizen will not be listened to regardless. Politicians will only care about citizens in California, Texas, and the north east, because you are better off getting an additional 1% of NYC than the vote of everyone in the American Samoa &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;4- The first past the post system is absolutely terrible, and is a large reason for why the American elections are mostly between only 2 parties. Even if the electoral votes were representative of the population, which they&amp;#39;re not because of points 1 and 5, this voting system would remain problematic. There are many reasons as to why this is, but the biggest one is that if a 3 party would get a lot of support, it would actively suck votes away from the party that is most like it, making votes for this party ensure that the party least like it will win.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Alternative voting systems dont inherently fix this issue&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;5- This simply shifts the balance between how much a single vote is worth. Simplifying the amount of votes to electoral votes is already problematic because it can cause rounding errors, so even if all of the above points are fixed this could still cause problems now and then. Then going into the fact that the electoral votes aren&amp;#39;t completely fairly distributed causes the situations where candidates won elections while other parties had more votes. This works mostly in favor of the Republican party because the least populous states get more votes than they should have. Calculating the proportions here show that a vote from a Wyoming-citizen can be roughly worth 5 times as much as a vote from someone in California. There is no reason why one vote should be worth more than another.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How else do you make it so that Wyoming citizen is listened to at all?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb8sye", "score_hidden": false, "stickied": false, "created": 1492322591.0, "created_utc": 1492293791.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": "", "user_reports": [], "id": "dgb4tvw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Irratix", "parent_id": "t1_dgb4p5x", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You're right. I'll put my option given above in the main post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right. I&amp;#39;ll put my option given above in the main post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb4tvw", "score_hidden": false, "stickied": false, "created": 1492317114.0, "created_utc": 1492288314.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb4p5x", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "down42roads", "parent_id": "t1_dgb4mlb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; I didn't specify, but I did note that that in itself would be a complicated issue.\n\nIts a pretty major thing, though.\n\nIf you want to remove and replace something, you don't just need to argue that it is bad, but also that there is a better solution.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I didn&amp;#39;t specify, but I did note that that in itself would be a complicated issue.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Its a pretty major thing, though.&lt;/p&gt;\n\n&lt;p&gt;If you want to remove and replace something, you don&amp;#39;t just need to argue that it is bad, but also that there is a better solution.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb4p5x", "score_hidden": false, "stickied": false, "created": 1492316936.0, "created_utc": 1492288136.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": "", "user_reports": [], "id": "dgb5a43", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Irratix", "parent_id": "t1_dgb4yzx", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I do think it is important that more people can agree with a candidate rather than just more having them as a favorite candidate. Taking the popular vote as an argument works mostly in the US as there are just 2 large political parties, but for any system with more parties I think this largely ignores the complexity behind the election. I think you'd want a party to win where the majority of people is at least somewhat satisfied, rather than having nearly half of the country completely opposing one candidate as could happen by just taking the popular vote. I don't know much about the Australian system but let's just say that as a general notion I think the popular vote is a weak argument because it's not what we're looking for in a system with more than 2 parties.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do think it is important that more people can agree with a candidate rather than just more having them as a favorite candidate. Taking the popular vote as an argument works mostly in the US as there are just 2 large political parties, but for any system with more parties I think this largely ignores the complexity behind the election. I think you&amp;#39;d want a party to win where the majority of people is at least somewhat satisfied, rather than having nearly half of the country completely opposing one candidate as could happen by just taking the popular vote. I don&amp;#39;t know much about the Australian system but let&amp;#39;s just say that as a general notion I think the popular vote is a weak argument because it&amp;#39;s not what we&amp;#39;re looking for in a system with more than 2 parties.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb5a43", "score_hidden": false, "stickied": false, "created": 1492317715.0, "created_utc": 1492288915.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgb4yzx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ghost_of_John_Galt", "parent_id": "t1_dgb4mlb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So that sounds like preferential voting, which we have in Australia. That also results in people winning the election without winning the popular vote. This has happened a number of times (twice in my lifetime, and a few before then). \n\nIn a recent South Australian election, the winning side only got 47% of the vote, which sounds familiar to the recent US election. Could you potentially be throwing away the current system for a system with the exact same issues? I think any system you have will have similar issues... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So that sounds like preferential voting, which we have in Australia. That also results in people winning the election without winning the popular vote. This has happened a number of times (twice in my lifetime, and a few before then). &lt;/p&gt;\n\n&lt;p&gt;In a recent South Australian election, the winning side only got 47% of the vote, which sounds familiar to the recent US election. Could you potentially be throwing away the current system for a system with the exact same issues? I think any system you have will have similar issues... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb4yzx", "score_hidden": false, "stickied": false, "created": 1492317305.0, "created_utc": 1492288505.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb4mlb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Irratix", "parent_id": "t1_dgb4esg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I didn't specify, but I did note that that in itself would be a complicated issue. If you want an assumption for the direction I would want to go far I'd say STV gives you a good idea of what I think a good voting system should look like. If you don't know what that is, here's a short video explaining it https://www.youtube.com/watch?v=l8XOZJkozfI\n\nIf you want a shorter summary: people can rank the candidates from worst to best and the winner is elected based on how many people can agree with the candidate, rather than how many first-hand votes it gets.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t specify, but I did note that that in itself would be a complicated issue. If you want an assumption for the direction I would want to go far I&amp;#39;d say STV gives you a good idea of what I think a good voting system should look like. If you don&amp;#39;t know what that is, here&amp;#39;s a short video explaining it &lt;a href=\"https://www.youtube.com/watch?v=l8XOZJkozfI\"&gt;https://www.youtube.com/watch?v=l8XOZJkozfI&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;If you want a shorter summary: people can rank the candidates from worst to best and the winner is elected based on how many people can agree with the candidate, rather than how many first-hand votes it gets.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb4mlb", "score_hidden": false, "stickied": false, "created": 1492316840.0, "created_utc": 1492288040.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": "", "user_reports": [], "id": "dgb8hcj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Irratix", "parent_id": "t1_dgb89ee", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "But that still doesn't solve any problems I'm arguing against. Delegates being able to vote for candidates they're not supposed to vote to is only a very, very small part of the many problems of the electoral college. I know how unlikely it is for the American government to change the constitution but I still think it is a necessity if it wants to be a representative and functional democracy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But that still doesn&amp;#39;t solve any problems I&amp;#39;m arguing against. Delegates being able to vote for candidates they&amp;#39;re not supposed to vote to is only a very, very small part of the many problems of the electoral college. I know how unlikely it is for the American government to change the constitution but I still think it is a necessity if it wants to be a representative and functional democracy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb8hcj", "score_hidden": false, "stickied": false, "created": 1492322139.0, "created_utc": 1492293339.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb89ee", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgb83y7", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb89ee", "score_hidden": false, "stickied": false, "created": 1492321835.0, "created_utc": 1492293035.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb83y7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Irratix", "parent_id": "t1_dgb7r1e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Yeah I guess it makes sense to keep delegates purely for a practical sense. However, I'm still arguing for replacing the entire Electoral College and I think that if the US decides to do so it might as well revise the delegate-system.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I guess it makes sense to keep delegates purely for a practical sense. However, I&amp;#39;m still arguing for replacing the entire Electoral College and I think that if the US decides to do so it might as well revise the delegate-system.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb83y7", "score_hidden": false, "stickied": false, "created": 1492321629.0, "created_utc": 1492292829.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb7r1e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgb5edw", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb7r1e", "score_hidden": false, "stickied": false, "created": 1492321126.0, "created_utc": 1492292326.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb5edw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Irratix", "parent_id": "t1_dgb4ypt", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So there's two things there I'd like to mention:\n\n1- I think that even if the winner take all system were abolished, the rest of the problems still remain, giving some citizens more voting power than others and all that stuff.\n\n2- This may just be my lack of American politics showing, but if the delegates are required to reflect the voters of the state, why would they even be part of the system? What function do they still have for these elections?", "edited": 1492289858.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So there&amp;#39;s two things there I&amp;#39;d like to mention:&lt;/p&gt;\n\n&lt;p&gt;1- I think that even if the winner take all system were abolished, the rest of the problems still remain, giving some citizens more voting power than others and all that stuff.&lt;/p&gt;\n\n&lt;p&gt;2- This may just be my lack of American politics showing, but if the delegates are required to reflect the voters of the state, why would they even be part of the system? What function do they still have for these elections?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb5edw", "score_hidden": false, "stickied": false, "created": 1492317878.0, "created_utc": 1492289078.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb4ypt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgb4esg", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb4ypt", "score_hidden": false, "stickied": false, "created": 1492317294.0, "created_utc": 1492288494.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb4esg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ghost_of_John_Galt", "parent_id": "t3_65l75e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm sorry if I missed this in your post, but what system would you replace it with? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry if I missed this in your post, but what system would you replace it with? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgb4esg", "score_hidden": false, "stickied": false, "created": 1492316538.0, "created_utc": 1492287738.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": "", "user_reports": [], "id": "dgbjidb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cdb03b", "parent_id": "t3_65l75e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "1) This is dictated by State law. There is no need to repeal the electoral college to fix this issue. If a State sees it as an issue they change it themselves. \n\n2) Only with some States. Several have made that action illegal. \n\n3) No. We are a Federation of States and those are the entities voting for President as they are informed by their citizens. \n\n4) Agreed. I think we should go to a ranked transferable vote system. \n\n5) The votes are by design not intended to be equal. This prevents the most populated States from having fully power over the least. \n\nThe only point that has any real merit is point 4. All the others are fundamental differences in what the voting actually is. By design it is the States as a part of the Federation choosing their leader when they vote for President. It is not the citizens doing so. The Citizens choose their leadership when they vote for their representatives in Congress. These are fundamentally different things. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1) This is dictated by State law. There is no need to repeal the electoral college to fix this issue. If a State sees it as an issue they change it themselves. &lt;/p&gt;\n\n&lt;p&gt;2) Only with some States. Several have made that action illegal. &lt;/p&gt;\n\n&lt;p&gt;3) No. We are a Federation of States and those are the entities voting for President as they are informed by their citizens. &lt;/p&gt;\n\n&lt;p&gt;4) Agreed. I think we should go to a ranked transferable vote system. &lt;/p&gt;\n\n&lt;p&gt;5) The votes are by design not intended to be equal. This prevents the most populated States from having fully power over the least. &lt;/p&gt;\n\n&lt;p&gt;The only point that has any real merit is point 4. All the others are fundamental differences in what the voting actually is. By design it is the States as a part of the Federation choosing their leader when they vote for President. It is not the citizens doing so. The Citizens choose their leadership when they vote for their representatives in Congress. These are fundamentally different things. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbjidb", "score_hidden": false, "stickied": false, "created": 1492337986.0, "created_utc": 1492309186.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": "", "user_reports": [], "id": "dgbdvf8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "UntimelyXenomorph", "parent_id": "t3_65l75e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I won't defend the electoral college itself, but I will argue that trying to repeal and replace it is just about the least effective way one could go about actually trying to get rid of it.  The electoral college is plainly laid out in the constitution, so repealing it would require a constitutional amendment.  Amendments require ratification by 75% of the states.  Many of the 38 states that would be needed for ratification will never vote to repeal the electoral college because it gives them more voting power.\n\nFor an alternative means of replacement, the 11 largest states could all agree to award their electors to the winner of the popular vote.  This would be far easier than getting 38 states to agree to an amendment, and additionally, these 11 states are the ones whose voting power is weakened the most by the electoral college.  It will never, ever be repealed and replaced, but it could be worked around.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I won&amp;#39;t defend the electoral college itself, but I will argue that trying to repeal and replace it is just about the least effective way one could go about actually trying to get rid of it.  The electoral college is plainly laid out in the constitution, so repealing it would require a constitutional amendment.  Amendments require ratification by 75% of the states.  Many of the 38 states that would be needed for ratification will never vote to repeal the electoral college because it gives them more voting power.&lt;/p&gt;\n\n&lt;p&gt;For an alternative means of replacement, the 11 largest states could all agree to award their electors to the winner of the popular vote.  This would be far easier than getting 38 states to agree to an amendment, and additionally, these 11 states are the ones whose voting power is weakened the most by the electoral college.  It will never, ever be repealed and replaced, but it could be worked around.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbdvf8", "score_hidden": false, "stickied": false, "created": 1492329828.0, "created_utc": 1492301028.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": "", "user_reports": [], "id": "dgbb1wg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Irratix", "parent_id": "t1_dgbakr2", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Gerrymandering is a big problem of course, but solving it doesn't completely make the EC a non-issue, as it still doesn't make politicians care about every state, it still doesn't make sure every citizen is fairly represented which can still lead to minority victories.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gerrymandering is a big problem of course, but solving it doesn&amp;#39;t completely make the EC a non-issue, as it still doesn&amp;#39;t make politicians care about every state, it still doesn&amp;#39;t make sure every citizen is fairly represented which can still lead to minority victories.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbb1wg", "score_hidden": false, "stickied": false, "created": 1492325852.0, "created_utc": 1492297052.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbakr2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pillbinge", "parent_id": "t3_65l75e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "While the EC does need to be examined, it's a far better use of our time to talk about Gerrymandering and redistricting, and the disenfranchisement of voters.  These are issues that we've created whereas the EC is more at the heart of our democracy, and it could be that by solving those issues the EC will never really be an issue.  Almost the entire country leans left in some way but conservatives constantly cut up the country for \"fair\" representation.  Even the 2016 election saw the candidate with the most votes lose.\n\nBut that probably wouldn't be an issue if we solved the more modern attacks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While the EC does need to be examined, it&amp;#39;s a far better use of our time to talk about Gerrymandering and redistricting, and the disenfranchisement of voters.  These are issues that we&amp;#39;ve created whereas the EC is more at the heart of our democracy, and it could be that by solving those issues the EC will never really be an issue.  Almost the entire country leans left in some way but conservatives constantly cut up the country for &amp;quot;fair&amp;quot; representation.  Even the 2016 election saw the candidate with the most votes lose.&lt;/p&gt;\n\n&lt;p&gt;But that probably wouldn&amp;#39;t be an issue if we solved the more modern attacks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbakr2", "score_hidden": false, "stickied": false, "created": 1492325139.0, "created_utc": 1492296339.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbdd7t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "league_of_memes", "parent_id": "t3_65l75e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;1- Imagine you live in California, a mostly Democratic state to my knowledge, and you decide to vote for a Republican nominee. Your vote is basically completely discarded. Any non-swing state basically leaves all votes completely useless, as the entire set of electoral votes go to the one candidate anyways, making potentially millions of votes inconsequential to the election.\n\n\nIt was made to protect the voting interests of each state, it ensures that all states have a say in the election(otherwise states with very low population would be largely ignored and have no influence over federal offices)\n\n\n\n\n\n&gt;3- American citizens should be allowed to vote no matter where in America they live, right? There is no reason why a Samoan citizen should have any less of a vote in the election than a Texan citizen.\n\nNo, most people in territories do not pay taxes and therefore should not be allowed to vote(poor people who do not pay taxes, IMO, should also be denied the right to vote).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;1- Imagine you live in California, a mostly Democratic state to my knowledge, and you decide to vote for a Republican nominee. Your vote is basically completely discarded. Any non-swing state basically leaves all votes completely useless, as the entire set of electoral votes go to the one candidate anyways, making potentially millions of votes inconsequential to the election.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It was made to protect the voting interests of each state, it ensures that all states have a say in the election(otherwise states with very low population would be largely ignored and have no influence over federal offices)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;3- American citizens should be allowed to vote no matter where in America they live, right? There is no reason why a Samoan citizen should have any less of a vote in the election than a Texan citizen.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, most people in territories do not pay taxes and therefore should not be allowed to vote(poor people who do not pay taxes, IMO, should also be denied the right to vote).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbdd7t", "score_hidden": false, "stickied": false, "created": 1492329152.0, "created_utc": 1492300352.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": "", "user_reports": [], "id": "dgcj7n1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hyammez", "parent_id": "t3_65l75e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Coalitions can often lead to gridlock. For example in Northern Ireland, who use STV as their voting system have seen political gridlock as Sinn Fein and DUP have battled on policy such as welfare reform. ( https://www.ft.com/content/0a8e290c-548d-11e5-b029-b9d50a74fd14 )\n\nAt least with a two party system, where systems such as FPTP are used, the government is quite easily able to implement policy without conflict ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Coalitions can often lead to gridlock. For example in Northern Ireland, who use STV as their voting system have seen political gridlock as Sinn Fein and DUP have battled on policy such as welfare reform. ( &lt;a href=\"https://www.ft.com/content/0a8e290c-548d-11e5-b029-b9d50a74fd14\"&gt;https://www.ft.com/content/0a8e290c-548d-11e5-b029-b9d50a74fd14&lt;/a&gt; )&lt;/p&gt;\n\n&lt;p&gt;At least with a two party system, where systems such as FPTP are used, the government is quite easily able to implement policy without conflict &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgcj7n1", "score_hidden": false, "stickied": false, "created": 1492403584.0, "created_utc": 1492374784.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgba8it", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Glory2Hypnotoad", "parent_id": "t3_65l75e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The electoral college works for the system the founding fathers envisioned, which had a small federal government, less executive power, and a stronger emphasis on states' rights. Everyone had equal  representation on the state level, which was what mattered most because the federal government wasn't the primary battleground for policy, the president was chosen by the states and had less power than he has now. The current combination of electoral college and large federal government is disastrous, but there's more than one way to fix that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The electoral college works for the system the founding fathers envisioned, which had a small federal government, less executive power, and a stronger emphasis on states&amp;#39; rights. Everyone had equal  representation on the state level, which was what mattered most because the federal government wasn&amp;#39;t the primary battleground for policy, the president was chosen by the states and had less power than he has now. The current combination of electoral college and large federal government is disastrous, but there&amp;#39;s more than one way to fix that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgba8it", "score_hidden": false, "stickied": false, "created": 1492324644.0, "created_utc": 1492295844.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": "", "user_reports": [], "id": "dgcs0n5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DCarrier", "parent_id": "t3_65l75e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The [National Popular Vote Interstate Compact](https://en.wikipedia.org/wiki/National_Popular_Vote_Interstate_Compact) would effectively get rid of the electoral college, but wouldn't require 3/4 of the states to agree which would make it massively easier to pass.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The &lt;a href=\"https://en.wikipedia.org/wiki/National_Popular_Vote_Interstate_Compact\"&gt;National Popular Vote Interstate Compact&lt;/a&gt; would effectively get rid of the electoral college, but wouldn&amp;#39;t require 3/4 of the states to agree which would make it massively easier to pass.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgcs0n5", "score_hidden": false, "stickied": false, "created": 1492415350.0, "created_utc": 1492386550.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65l75e", "likes": null, "replies": "", "user_reports": [], "id": "dgbuddn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Vicious43", "parent_id": "t3_65l75e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It's meant to prevent a single state with a high population, or the cities from deciding the election by themselves. For example without California, the vote would wildly favor Trump.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s meant to prevent a single state with a high population, or the cities from deciding the election by themselves. For example without California, the vote would wildly favor Trump.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbuddn", "score_hidden": false, "stickied": false, "created": 1492359203.0, "created_utc": 1492330403.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]