[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My reasons for believing that windows are better than mac operating systems I think is pretty sensible. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1.&lt;/strong&gt; Windows opens way more doors when it comes to getting software. In my experience of downloading software on a mac, you almost always have to check for mac compatibility, where for windows you don&amp;#39;t, unless you&amp;#39;re downloading a program straight from the apple app store. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2.&lt;/strong&gt; Windows computers have more customization. You want to add a better motherboard? No problem. Plop that baby open and put more ram sticks in it, you&amp;#39;re good to go. You want a new motherboard for your mac? Well, it&amp;#39;s unibody so the back doesn&amp;#39;t have any screws. Better save up for that mac pro! With a windows PC, you can buy exactly how you want your PC to function. You can get whatever graphics card you want, whatever internal hard drive you want, etc. For a mac, you have to buy the one that apple sells.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3.&lt;/strong&gt; Similar to number 2, windows computers are super fixable compared to macs. If you break something inside a windows PC, just open it up and replace the part that is broken. If an internal piece of your mac is broken, it&amp;#39;s unibody so good luck with that. Even if you did manage to get it open, most of the parts are mac compatible only, so you have to take it to an apple specialist, who will normally just tell you to either repair it for $900, or buy an entire new computer. As stated, it&amp;#39;s relatively easier and cheaper to repair a windows PC than an iMac.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;4.&lt;/strong&gt; Windows is normally cheaper, with better results which listed above. The cheapest iMac/MacBook computer is around 800-900 dollars brand new, whereas a brand new PC computer can be as low as $500 if the parts are bought individually by a costumer and built together (this can&amp;#39;t be done with a mac because it is against apple&amp;#39;s EULA), and the results are even more poweful than a mac.&lt;/p&gt;\n\n&lt;p&gt;I am absolutely willing to change this view with enough persuasion, though this is the current opinion that I stand by.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My reasons for believing that windows are better than mac operating systems I think is pretty sensible. \n\n**1.** Windows opens way more doors when it comes to getting software. In my experience of downloading software on a mac, you almost always have to check for mac compatibility, where for windows you don't, unless you're downloading a program straight from the apple app store. \n\n**2.** Windows computers have more customization. You want to add a better motherboard? No problem. Plop that baby open and put more ram sticks in it, you're good to go. You want a new motherboard for your mac? Well, it's unibody so the back doesn't have any screws. Better save up for that mac pro! With a windows PC, you can buy exactly how you want your PC to function. You can get whatever graphics card you want, whatever internal hard drive you want, etc. For a mac, you have to buy the one that apple sells.\n\n**3.** Similar to number 2, windows computers are super fixable compared to macs. If you break something inside a windows PC, just open it up and replace the part that is broken. If an internal piece of your mac is broken, it's unibody so good luck with that. Even if you did manage to get it open, most of the parts are mac compatible only, so you have to take it to an apple specialist, who will normally just tell you to either repair it for $900, or buy an entire new computer. As stated, it's relatively easier and cheaper to repair a windows PC than an iMac.\n\n**4.** Windows is normally cheaper, with better results which listed above. The cheapest iMac/MacBook computer is around 800-900 dollars brand new, whereas a brand new PC computer can be as low as $500 if the parts are bought individually by a costumer and built together (this can't be done with a mac because it is against apple's EULA), and the results are even more poweful than a mac.\n\nI am absolutely willing to change this view with enough persuasion, though this is the current opinion that I stand by.", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65lypf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 47, "report_reasons": null, "author": "danacarveyspenis", "saved": false, "mod_reports": [], "name": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/65lypf/cmv_windows_computers_are_better_than_imacs/", "num_reports": null, "locked": false, "stickied": false, "created": 1492325562.0, "url": "https://www.reddit.com/r/changemyview/comments/65lypf/cmv_windows_computers_are_better_than_imacs/", "author_flair_text": null, "quarantine": false, "title": "CMV: Windows computers are better than iMacs.", "created_utc": 1492296762.0, "distinguished": null, "media": null, "upvote_ratio": 0.77, "num_comments": 69, "visited": false, "subreddit_type": "public", "ups": 47}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbesgz", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "BenzineBro", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'll agree that premise 1 holds some issues. Though I find myself that most of the software I need to use on a daily basis (I study chemistry) is compatible with OSX so that hasn't been a problem for me, personally. Though I do understand that this is a bit of a hassle.\n\nWhether or not the price tag is justified depends on who you are and how much money you have and while premise 2 holds true for a lot of apple hardware, this also holds true for a lot of windows laptops as well. In addition to this, my gf also upgraded her MacBook recently by adding more ram to it herself. So I don't think these arguments are really that strong.\n\nPremise 3 is interesting because macs are also better supported than PC machines. Sure, with windows you can fix things yourself but I think that a lot of people don't know or (more importantly) don't care to fix it themselves. You might be willing to learn and then go out and do everything yourself but I don't have all the time in the world and if something as my computer stopped working then I'd rather take it to a shop and fix it as easily as possible rather than mess around with it myself.\n\nHere's the other thing as well, Macs don't break down nearly as easily as PC machines either. As someone who has owned a mac for maybe 5 or 6 years the only time I had to bring it into the store was because I broke the screen for droping it, which is my own fault. Meanwhile, I've had to reinstall windows multiple times in the past because I was messing around with it in ways that you just can't with a mac. Not being able to fiddle with things that you \"shouldn't\" be touching does mean that macs are more robust (software wise) than PCs. \n\nI used to be a really anti-mac person and I railed against macs because of the same sorts of reasons you do. Because PC desktops tend to have more raw power, you can switch out the parts as necessary and I can toy around a lot more with the computer itself. On the opposite side, I felt that apple held my hands a little too much for my own liking and I didn't feel that it was very intuitive. It took me an entire 50 minutes to figure out how to use word because a new document wouldn't open when I clicked on it. I had to right click and choose to make a new document from there. (Though this was almost 10 or so years ago now.)\n\nAs I grew up I'd keep up less and less with computers. I know my way around one now but eventually, you have less and less time to toy around with things and now I just want a machine that works and if it breaks I'd rather have someone else fix it. That's what the price tag on a mac is meant to represent. If you view a mac in terms of its individual parts like you would a PC then you'll feel underwhelmed. The strength in macs is that the parts all work together to make this \"experience\" buzzword that every fan-boy will harp on about.\n\nIt's worth noting that the operating system and the hardware are much better optimised than with most PCs. So even if the hardware is underwhelming, it does work MUCH better than if it would be on a PC. I also prefer OSx over Windows as an operating system (with the assuming that I'm not gaming and that I have the software I need.) I enjoy being to swipe between different different full screen apps and desktops, which means that OSx makes better use of screen real estate. Windows can't really do this beyond having multiple windows open on screen. I think spotlight is a little better than the windows search as well, I usually find my files much easier with it. The new macbooks also have the advantage of being incredibly light weight and quiet which means that it's easy to carry around with me to and from university and is still powerful enough to keep up with the work I have to do. I'm talking around 20-30 of tabs open in chrome, chemdraw, mestrenova, multiple word documents 3 PDFs, Evernote, Spotify, email and calendar. All of this shit adds up and it can still keep up which is amazing. \n\nOverall. Macs have different advantages to PCs and how much you appreciate these advantages depends on who you are and what you want out of a PC. I think that you should choose based on what your needs are. But I think that the PC crowd tends to really underestimate macs because their specs don't have those big numbers. \n\n", "edited": 1492303057.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll agree that premise 1 holds some issues. Though I find myself that most of the software I need to use on a daily basis (I study chemistry) is compatible with OSX so that hasn&amp;#39;t been a problem for me, personally. Though I do understand that this is a bit of a hassle.&lt;/p&gt;\n\n&lt;p&gt;Whether or not the price tag is justified depends on who you are and how much money you have and while premise 2 holds true for a lot of apple hardware, this also holds true for a lot of windows laptops as well. In addition to this, my gf also upgraded her MacBook recently by adding more ram to it herself. So I don&amp;#39;t think these arguments are really that strong.&lt;/p&gt;\n\n&lt;p&gt;Premise 3 is interesting because macs are also better supported than PC machines. Sure, with windows you can fix things yourself but I think that a lot of people don&amp;#39;t know or (more importantly) don&amp;#39;t care to fix it themselves. You might be willing to learn and then go out and do everything yourself but I don&amp;#39;t have all the time in the world and if something as my computer stopped working then I&amp;#39;d rather take it to a shop and fix it as easily as possible rather than mess around with it myself.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s the other thing as well, Macs don&amp;#39;t break down nearly as easily as PC machines either. As someone who has owned a mac for maybe 5 or 6 years the only time I had to bring it into the store was because I broke the screen for droping it, which is my own fault. Meanwhile, I&amp;#39;ve had to reinstall windows multiple times in the past because I was messing around with it in ways that you just can&amp;#39;t with a mac. Not being able to fiddle with things that you &amp;quot;shouldn&amp;#39;t&amp;quot; be touching does mean that macs are more robust (software wise) than PCs. &lt;/p&gt;\n\n&lt;p&gt;I used to be a really anti-mac person and I railed against macs because of the same sorts of reasons you do. Because PC desktops tend to have more raw power, you can switch out the parts as necessary and I can toy around a lot more with the computer itself. On the opposite side, I felt that apple held my hands a little too much for my own liking and I didn&amp;#39;t feel that it was very intuitive. It took me an entire 50 minutes to figure out how to use word because a new document wouldn&amp;#39;t open when I clicked on it. I had to right click and choose to make a new document from there. (Though this was almost 10 or so years ago now.)&lt;/p&gt;\n\n&lt;p&gt;As I grew up I&amp;#39;d keep up less and less with computers. I know my way around one now but eventually, you have less and less time to toy around with things and now I just want a machine that works and if it breaks I&amp;#39;d rather have someone else fix it. That&amp;#39;s what the price tag on a mac is meant to represent. If you view a mac in terms of its individual parts like you would a PC then you&amp;#39;ll feel underwhelmed. The strength in macs is that the parts all work together to make this &amp;quot;experience&amp;quot; buzzword that every fan-boy will harp on about.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s worth noting that the operating system and the hardware are much better optimised than with most PCs. So even if the hardware is underwhelming, it does work MUCH better than if it would be on a PC. I also prefer OSx over Windows as an operating system (with the assuming that I&amp;#39;m not gaming and that I have the software I need.) I enjoy being to swipe between different different full screen apps and desktops, which means that OSx makes better use of screen real estate. Windows can&amp;#39;t really do this beyond having multiple windows open on screen. I think spotlight is a little better than the windows search as well, I usually find my files much easier with it. The new macbooks also have the advantage of being incredibly light weight and quiet which means that it&amp;#39;s easy to carry around with me to and from university and is still powerful enough to keep up with the work I have to do. I&amp;#39;m talking around 20-30 of tabs open in chrome, chemdraw, mestrenova, multiple word documents 3 PDFs, Evernote, Spotify, email and calendar. All of this shit adds up and it can still keep up which is amazing. &lt;/p&gt;\n\n&lt;p&gt;Overall. Macs have different advantages to PCs and how much you appreciate these advantages depends on who you are and what you want out of a PC. I think that you should choose based on what your needs are. But I think that the PC crowd tends to really underestimate macs because their specs don&amp;#39;t have those big numbers. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbesgz", "score_hidden": false, "stickied": false, "created": 1492331157.0, "created_utc": 1492302357.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbg292", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "jstevewhite", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Windows is normally cheaper, with better results which listed above. \n\nWhen people say this, they're usually comparing apples and oranges ( &gt;:) ). But the best argument I can offer you is this analogy. When I say, \"I want to play golf.\" and *you* say, \"But tennis rackets are *so much cheaper*!\"\n\nI get it that you don't like Macs. That's ok; that's called \"personal preference\". But I would submit that if you're not a gamer, there's no meaningful difference in available software and that most often, fairly inexpensive software for OSX is best-of-breed; you can spend weeks going through shitty McShitterson app clones on windows looking for a decent one that does what the OSX one does. Don't even get me started on the Windows App Store. \n\nAlso, I can compile and use a huge quantity of Linux software natively, without Cygwin or any weirdness like that. I notice on Windows 10 they finally gave windows a decent command interpreter (bash) by incorporating Ubuntu into Windows. Bravo, but it's still a kludge. \n\n&gt;Windows computers have more (hardware, I presume) customization. \n\nRemember Apples and Oranges? Compare the iMac to all-in-one PCs, not your typical beige box. I've got a Mac Pro sitting on the floor next to me that's had the motherboard upgraded, the CPUS upgraded, the hard drives upgraded, and the video cards upgraded, and a USB3 card, AND a eSata card added. It's got 12 3.33Ghz Xeon cores and 64GB of RAM. Nvidia is releasing the newest video card with bios that will run in my machine. And in 2018, Apple's gonna go back to modular systems for pro users. \n\n&gt;The cheapest iMac/MacBook computer is around 800-900 dollars brand new, whereas a brand new PC computer can be as low as $500 if the parts are bought individually by a costumer and built together (this can't be done with a mac because it is against apple's EULA), and the results are even more poweful than a mac.\n\nYou're comparing this to a MacBook or iMac. I get it if you don't want an all-in-one, but you're comparing apples and oranges again. Say \"I don't like ultra-compacts or all-in-one systems\", sure. \n\nIf you want the most [reliable laptop](http://www.digitaltrends.com/computing/which-laptops-are-the-most-reliable/), it's Apple. You want the computer with the most [customer satisfaction](http://www.theacsi.org/index.php?option=com_content&amp;view=article&amp;id=147&amp;catid=&amp;Itemid=212&amp;i=Personal+Computers), it's Apple. Macs hold their value better than PCs. \n\nMacs are better built than PCs. I am always amused when someone compares a shitty $400 creaky plastic lump-of-fecal-material with a machined-from-a-block-of-aluminum Macbook. There's a reason it's worth more that's not captured by the framerate on your favorite game. The same reason there are premium car brands and cheap car brands. I *live* in front of my computer (I work in core networks) and it *matters* to me whether it's pleasant to use my machine. I have expensive chairs (because cheap ones wear out fast), expensive keyboards (comfort in typing when you do it for 10 hrs a day is important) and mice. Why would I want to buy the cheapest plastic POS I can find? I have a crappy little Lenovo and it creaks like a rusty door when I pick it up. \n\nAnd, last but not least, it's *nix. I'm an Apple guy because I'm a *nix guy. Windows will never be more than a pale imitation of *nix. Microsoft is *running scared* because *nix is taking over the world. Android? Runs on linux. iPhones? Run *nix. Mac OS X? Runs *nix. They're the last holdout and so frightened they added it to Windows in hopes of attracting a few of us *nix geeks back to Windows... :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Windows is normally cheaper, with better results which listed above. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;When people say this, they&amp;#39;re usually comparing apples and oranges ( &amp;gt;:) ). But the best argument I can offer you is this analogy. When I say, &amp;quot;I want to play golf.&amp;quot; and &lt;em&gt;you&lt;/em&gt; say, &amp;quot;But tennis rackets are &lt;em&gt;so much cheaper&lt;/em&gt;!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I get it that you don&amp;#39;t like Macs. That&amp;#39;s ok; that&amp;#39;s called &amp;quot;personal preference&amp;quot;. But I would submit that if you&amp;#39;re not a gamer, there&amp;#39;s no meaningful difference in available software and that most often, fairly inexpensive software for OSX is best-of-breed; you can spend weeks going through shitty McShitterson app clones on windows looking for a decent one that does what the OSX one does. Don&amp;#39;t even get me started on the Windows App Store. &lt;/p&gt;\n\n&lt;p&gt;Also, I can compile and use a huge quantity of Linux software natively, without Cygwin or any weirdness like that. I notice on Windows 10 they finally gave windows a decent command interpreter (bash) by incorporating Ubuntu into Windows. Bravo, but it&amp;#39;s still a kludge. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Windows computers have more (hardware, I presume) customization. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Remember Apples and Oranges? Compare the iMac to all-in-one PCs, not your typical beige box. I&amp;#39;ve got a Mac Pro sitting on the floor next to me that&amp;#39;s had the motherboard upgraded, the CPUS upgraded, the hard drives upgraded, and the video cards upgraded, and a USB3 card, AND a eSata card added. It&amp;#39;s got 12 3.33Ghz Xeon cores and 64GB of RAM. Nvidia is releasing the newest video card with bios that will run in my machine. And in 2018, Apple&amp;#39;s gonna go back to modular systems for pro users. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The cheapest iMac/MacBook computer is around 800-900 dollars brand new, whereas a brand new PC computer can be as low as $500 if the parts are bought individually by a costumer and built together (this can&amp;#39;t be done with a mac because it is against apple&amp;#39;s EULA), and the results are even more poweful than a mac.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re comparing this to a MacBook or iMac. I get it if you don&amp;#39;t want an all-in-one, but you&amp;#39;re comparing apples and oranges again. Say &amp;quot;I don&amp;#39;t like ultra-compacts or all-in-one systems&amp;quot;, sure. &lt;/p&gt;\n\n&lt;p&gt;If you want the most &lt;a href=\"http://www.digitaltrends.com/computing/which-laptops-are-the-most-reliable/\"&gt;reliable laptop&lt;/a&gt;, it&amp;#39;s Apple. You want the computer with the most &lt;a href=\"http://www.theacsi.org/index.php?option=com_content&amp;amp;view=article&amp;amp;id=147&amp;amp;catid=&amp;amp;Itemid=212&amp;amp;i=Personal+Computers\"&gt;customer satisfaction&lt;/a&gt;, it&amp;#39;s Apple. Macs hold their value better than PCs. &lt;/p&gt;\n\n&lt;p&gt;Macs are better built than PCs. I am always amused when someone compares a shitty $400 creaky plastic lump-of-fecal-material with a machined-from-a-block-of-aluminum Macbook. There&amp;#39;s a reason it&amp;#39;s worth more that&amp;#39;s not captured by the framerate on your favorite game. The same reason there are premium car brands and cheap car brands. I &lt;em&gt;live&lt;/em&gt; in front of my computer (I work in core networks) and it &lt;em&gt;matters&lt;/em&gt; to me whether it&amp;#39;s pleasant to use my machine. I have expensive chairs (because cheap ones wear out fast), expensive keyboards (comfort in typing when you do it for 10 hrs a day is important) and mice. Why would I want to buy the cheapest plastic POS I can find? I have a crappy little Lenovo and it creaks like a rusty door when I pick it up. &lt;/p&gt;\n\n&lt;p&gt;And, last but not least, it&amp;#39;s &lt;em&gt;nix. I&amp;#39;m an Apple guy because I&amp;#39;m a *nix guy. Windows will never be more than a pale imitation of *nix. Microsoft is *running scared&lt;/em&gt; because *nix is taking over the world. Android? Runs on linux. iPhones? Run *nix. Mac OS X? Runs *nix. They&amp;#39;re the last holdout and so frightened they added it to Windows in hopes of attracting a few of us *nix geeks back to Windows... :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbg292", "score_hidden": false, "stickied": false, "created": 1492332977.0, "created_utc": 1492304177.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgbkmwt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Kluizenaer", "parent_id": "t1_dgbk4zu", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; I wouldn't say it's only the hardware of a windows computer, I would certainly say software as well. For example, it's pretty hard to find a software that works for both windows and Mac, but it's extremely easy to find a program for windows. With Mac, you're limited to either the App Store, open source programs, or some top quality commercial programs (Adobe, etc.)\n\nWell, MacOS is a POSIX compatible OS which means you get all stuff targeting Unix on it which Windows can't run. I probably live in a bubble a bit regarding this but the software I work with almost always considers Windows an afterthought if it even considers it at all.\n\n&gt; Hackintoshes are another story because, if i remember correctly, hackintoshes are technically illegal because they are against Apple's distribution policies. Therefore, you cannot build an iMac legally.\n\nNo this is just scare talk by Apple. It is \"unsupported\" but not illegal. They really try to arouse the impression that it is illegal though but the truth of the matter is that copyright law is not nearly strong enough to make it illegal.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I wouldn&amp;#39;t say it&amp;#39;s only the hardware of a windows computer, I would certainly say software as well. For example, it&amp;#39;s pretty hard to find a software that works for both windows and Mac, but it&amp;#39;s extremely easy to find a program for windows. With Mac, you&amp;#39;re limited to either the App Store, open source programs, or some top quality commercial programs (Adobe, etc.)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, MacOS is a POSIX compatible OS which means you get all stuff targeting Unix on it which Windows can&amp;#39;t run. I probably live in a bubble a bit regarding this but the software I work with almost always considers Windows an afterthought if it even considers it at all.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Hackintoshes are another story because, if i remember correctly, hackintoshes are technically illegal because they are against Apple&amp;#39;s distribution policies. Therefore, you cannot build an iMac legally.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No this is just scare talk by Apple. It is &amp;quot;unsupported&amp;quot; but not illegal. They really try to arouse the impression that it is illegal though but the truth of the matter is that copyright law is not nearly strong enough to make it illegal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbkmwt", "score_hidden": false, "stickied": false, "created": 1492339652.0, "created_utc": 1492310852.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbmyla", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "kingpatzer", "parent_id": "t1_dgbk4zu", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; For example, it's pretty hard to find a software that works for both windows and Mac,\n\nReally ?\n\nAll of Adobe runs on Mac. All of Windows Office runs on Mac. Evernote, Audacity, Emacs, VI, Chrome, Skype, Pidgin, VLC, GIMP, Spotify, WolframAlpha, World of Warcraft, Steam, League of Legends, MySQL, Apache, PHP, Python, GCC, Perl, LISP . . . \n\nPretty much ever Open Source program runs on Macs. \n\nHonestly, I can't think of a single program I used to use on Windows that doesn't run exactly the same, or better, on my mac (integration with the ability to send stuff over airplay to my other devices is superior on the mac than on windows). \n\nPlus I get a real, native POSIX compatible Unix environment. \n\nExactly what software that I, an adult professional user,  is it hard for me to find. 'Cause I sure as shit haven't run into it. \n\nOn the flip side, I know of nothing on Windows that can compete with DEVONthink, Cyberduck, Quicksilver, OmniFocus, OmniOutliner . . .\n\nAnd perhaps the biggest difference: I can easily run Windows in a freely available virtual machine on my Mac, it is not nearly so easy to go the other way. \n\n\n", "edited": 1492315440.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;For example, it&amp;#39;s pretty hard to find a software that works for both windows and Mac,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Really ?&lt;/p&gt;\n\n&lt;p&gt;All of Adobe runs on Mac. All of Windows Office runs on Mac. Evernote, Audacity, Emacs, VI, Chrome, Skype, Pidgin, VLC, GIMP, Spotify, WolframAlpha, World of Warcraft, Steam, League of Legends, MySQL, Apache, PHP, Python, GCC, Perl, LISP . . . &lt;/p&gt;\n\n&lt;p&gt;Pretty much ever Open Source program runs on Macs. &lt;/p&gt;\n\n&lt;p&gt;Honestly, I can&amp;#39;t think of a single program I used to use on Windows that doesn&amp;#39;t run exactly the same, or better, on my mac (integration with the ability to send stuff over airplay to my other devices is superior on the mac than on windows). &lt;/p&gt;\n\n&lt;p&gt;Plus I get a real, native POSIX compatible Unix environment. &lt;/p&gt;\n\n&lt;p&gt;Exactly what software that I, an adult professional user,  is it hard for me to find. &amp;#39;Cause I sure as shit haven&amp;#39;t run into it. &lt;/p&gt;\n\n&lt;p&gt;On the flip side, I know of nothing on Windows that can compete with DEVONthink, Cyberduck, Quicksilver, OmniFocus, OmniOutliner . . .&lt;/p&gt;\n\n&lt;p&gt;And perhaps the biggest difference: I can easily run Windows in a freely available virtual machine on my Mac, it is not nearly so easy to go the other way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbmyla", "score_hidden": false, "stickied": false, "created": 1492343151.0, "created_utc": 1492314351.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbk4zu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "danacarveyspenis", "parent_id": "t1_dgbh8ku", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I wouldn't say it's only the hardware of a windows computer, I would certainly say software as well. For example, it's pretty hard to find a software that works for both windows and Mac, but it's extremely easy to find a program for windows. With Mac, you're limited to either the App Store, open source programs, or some top quality commercial programs (Adobe, etc.) With your point on buying and building the parts together, when it comes to building PC computers, it's almost always incorporated with Windows, Linux, or other Ubuntu operating systems. Hackintoshes are another story because, if i remember correctly, hackintoshes are technically illegal because they are against Apple's distribution policies. Therefore, you cannot build an iMac legally. In my personal experience, owning a windows computer has been far more easy, as well as easier to repair and replace when there are complications and/or improvements are needed. Macs are certainly a lot more user friendly and more attractive than window's computers by far, but that's just how my experience has been with apple computers. Thanks for your posts! I really appreciate this discussion! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t say it&amp;#39;s only the hardware of a windows computer, I would certainly say software as well. For example, it&amp;#39;s pretty hard to find a software that works for both windows and Mac, but it&amp;#39;s extremely easy to find a program for windows. With Mac, you&amp;#39;re limited to either the App Store, open source programs, or some top quality commercial programs (Adobe, etc.) With your point on buying and building the parts together, when it comes to building PC computers, it&amp;#39;s almost always incorporated with Windows, Linux, or other Ubuntu operating systems. Hackintoshes are another story because, if i remember correctly, hackintoshes are technically illegal because they are against Apple&amp;#39;s distribution policies. Therefore, you cannot build an iMac legally. In my personal experience, owning a windows computer has been far more easy, as well as easier to repair and replace when there are complications and/or improvements are needed. Macs are certainly a lot more user friendly and more attractive than window&amp;#39;s computers by far, but that&amp;#39;s just how my experience has been with apple computers. Thanks for your posts! I really appreciate this discussion! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbk4zu", "score_hidden": false, "stickied": false, "created": 1492338924.0, "created_utc": 1492310124.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbh8ku", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kluizenaer", "parent_id": "t1_dgbg7oj", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Okay, so how does my machine fit into your narrative? Since I bought the parts independently then put it together but never put Windows on it even though it could run it?\n\nI don't see how having Windows installed on it would change any of the points in your original OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, so how does my machine fit into your narrative? Since I bought the parts independently then put it together but never put Windows on it even though it could run it?&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t see how having Windows installed on it would change any of the points in your original OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbh8ku", "score_hidden": false, "stickied": false, "created": 1492334657.0, "created_utc": 1492305857.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbg7oj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "danacarveyspenis", "parent_id": "t1_dgbezqj", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; What is a \"Windows computer\" do you just mean any personal computer which is not made by Apple computers with this?\n\nSort of. Any computer that not only has the body of a windows computer, (one with screws that can be opened for changes at anytime) and also has a windows operating. Though I might have to disagree on installing macOS on a regular desktop computer without complications. From my experience, macs run relatively slower on have missing compatible parts when installed on non native machines. With your point on Alienware, there are the \"strong\" windows computers and then there are the \"weak\" windows computers. There are so many varieties of windows PCs that range on a level from weak to powerful. With Mac however, it just seems like there is one type and one type only, not better not worse. You do make a great point on windows computers being overpriced as well. Alienware would certainly fall under this category for sure. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What is a &amp;quot;Windows computer&amp;quot; do you just mean any personal computer which is not made by Apple computers with this?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sort of. Any computer that not only has the body of a windows computer, (one with screws that can be opened for changes at anytime) and also has a windows operating. Though I might have to disagree on installing macOS on a regular desktop computer without complications. From my experience, macs run relatively slower on have missing compatible parts when installed on non native machines. With your point on Alienware, there are the &amp;quot;strong&amp;quot; windows computers and then there are the &amp;quot;weak&amp;quot; windows computers. There are so many varieties of windows PCs that range on a level from weak to powerful. With Mac however, it just seems like there is one type and one type only, not better not worse. You do make a great point on windows computers being overpriced as well. Alienware would certainly fall under this category for sure. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbg7oj", "score_hidden": false, "stickied": false, "created": 1492333198.0, "created_utc": 1492304398.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbezqj", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Kluizenaer", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "What is a \"Windows computer\" do you just mean any personal computer which is not made by Apple computers with this?\n\nThis basically all heavily depends on what brand and what make you are going for. Apple has spent a lot of money on the\"Mac vs PC\" commercial train to arouse the idea that they are some-how fundamentally different. In reality everyone who knows shit about hardware knows they are in fact not; this is why you can install Windows on Apple hardware and you can install MacOS on any other desktop computer hardware because ultimately they are fundamentally in no way different machines. Apple even sells special DRAM modules for their own machines at a certain price while the reality is that any DRAM module just slots in\n\nIs Apple a manufacturer of PCs that is generally overpriced? Yes, but so are many others which you would call \"Windows computers\", Alienware in particular comes to mind as being even more extreme.\n\nEssentially in your comparison you are comparing Apple hardware with the \"Non Apple PCs\" that _are_ all that ignoring the many brands and makes out there that are not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What is a &amp;quot;Windows computer&amp;quot; do you just mean any personal computer which is not made by Apple computers with this?&lt;/p&gt;\n\n&lt;p&gt;This basically all heavily depends on what brand and what make you are going for. Apple has spent a lot of money on the&amp;quot;Mac vs PC&amp;quot; commercial train to arouse the idea that they are some-how fundamentally different. In reality everyone who knows shit about hardware knows they are in fact not; this is why you can install Windows on Apple hardware and you can install MacOS on any other desktop computer hardware because ultimately they are fundamentally in no way different machines. Apple even sells special DRAM modules for their own machines at a certain price while the reality is that any DRAM module just slots in&lt;/p&gt;\n\n&lt;p&gt;Is Apple a manufacturer of PCs that is generally overpriced? Yes, but so are many others which you would call &amp;quot;Windows computers&amp;quot;, Alienware in particular comes to mind as being even more extreme.&lt;/p&gt;\n\n&lt;p&gt;Essentially in your comparison you are comparing Apple hardware with the &amp;quot;Non Apple PCs&amp;quot; that &lt;em&gt;are&lt;/em&gt; all that ignoring the many brands and makes out there that are not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbezqj", "score_hidden": false, "stickied": false, "created": 1492331460.0, "created_utc": 1492302660.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbjf76", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "McKoijion", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "What do you mean by better? Is a Honda Accord a better car than a Ferrari 488? The Accord gets better gas milage, seats five people with luggage, costs less than a tenth as much, is more reliable, etc. But say I'm a millionaire CEO and money is no object. I want the best thing available. What should I buy?\n\nWindows computers are perfectly sensible. But if money is no object and I can buy the best desktop, I'd go with the iMac. \n\n1. iMacs can do all the basic things that any middle aged millionaire CEO would want to do. You can watch youtube clips, use social media, look at pictures, edit videos, etc. You can even get fancy graphic design software if that's the kind of thing you are into. There might be a few programs that you can't use on a Mac, but I can't think of any off the top of my head. My guess is that most are pretty niche.\n\n2. I'm rich. Money is no object. I don't care to upgrade or customize my iMac because I can just buy a new one. I want the best product, and I'm willing to spend the cash to get it, year after year.\n\n3. More importantly, as a rich CEO, I don't have time to waste on fixing or upgrading my computer myself. I'd rather just take it to an Apple Genius Bar and let them deal with it.\n\n4. Again, I'm rich and I'm looking for the best product, not the best value.\n\n5. Finally, I want something sexy for my expensive loft or mansion. iMacs look like something I'd see in a design museum like MoMA. Most Windows desktops look like either something I'd see in my employee's cubicles, or my teenage son's bedroom. This is changing, but generally speaking Windows desktops look like either the computer equivalent of a pair of baggy beige khakis, or a rainbow LED filled EDM festival. There is not a lot of room for subtle luxury.\n\nMac computers cost more money, but they cost less time. They are less time consuming to buy because there is less choice. They are more reliable because Apple controls the software and hardware. When they do break, there isn't much you can personally do to fix it. You need to give it to someone else who can do it for you.\n\nIf you make $10/hour, it makes sense to want to save money. If you make $100/hour you switch to wanting to save time. Say you have a computer that needs a 2 hour repair or you can pay someone $100 to do it. If you make $10/hour, it would save you $80 to repair it yourself. If you make $100/hour, it would cost you $100 to repair it yourself. Apple targets this richer, busier group of customers. That's why the iMac is better for them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What do you mean by better? Is a Honda Accord a better car than a Ferrari 488? The Accord gets better gas milage, seats five people with luggage, costs less than a tenth as much, is more reliable, etc. But say I&amp;#39;m a millionaire CEO and money is no object. I want the best thing available. What should I buy?&lt;/p&gt;\n\n&lt;p&gt;Windows computers are perfectly sensible. But if money is no object and I can buy the best desktop, I&amp;#39;d go with the iMac. &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;iMacs can do all the basic things that any middle aged millionaire CEO would want to do. You can watch youtube clips, use social media, look at pictures, edit videos, etc. You can even get fancy graphic design software if that&amp;#39;s the kind of thing you are into. There might be a few programs that you can&amp;#39;t use on a Mac, but I can&amp;#39;t think of any off the top of my head. My guess is that most are pretty niche.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I&amp;#39;m rich. Money is no object. I don&amp;#39;t care to upgrade or customize my iMac because I can just buy a new one. I want the best product, and I&amp;#39;m willing to spend the cash to get it, year after year.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;More importantly, as a rich CEO, I don&amp;#39;t have time to waste on fixing or upgrading my computer myself. I&amp;#39;d rather just take it to an Apple Genius Bar and let them deal with it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Again, I&amp;#39;m rich and I&amp;#39;m looking for the best product, not the best value.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Finally, I want something sexy for my expensive loft or mansion. iMacs look like something I&amp;#39;d see in a design museum like MoMA. Most Windows desktops look like either something I&amp;#39;d see in my employee&amp;#39;s cubicles, or my teenage son&amp;#39;s bedroom. This is changing, but generally speaking Windows desktops look like either the computer equivalent of a pair of baggy beige khakis, or a rainbow LED filled EDM festival. There is not a lot of room for subtle luxury.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Mac computers cost more money, but they cost less time. They are less time consuming to buy because there is less choice. They are more reliable because Apple controls the software and hardware. When they do break, there isn&amp;#39;t much you can personally do to fix it. You need to give it to someone else who can do it for you.&lt;/p&gt;\n\n&lt;p&gt;If you make $10/hour, it makes sense to want to save money. If you make $100/hour you switch to wanting to save time. Say you have a computer that needs a 2 hour repair or you can pay someone $100 to do it. If you make $10/hour, it would save you $80 to repair it yourself. If you make $100/hour, it would cost you $100 to repair it yourself. Apple targets this richer, busier group of customers. That&amp;#39;s why the iMac is better for them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbjf76", "score_hidden": false, "stickied": false, "created": 1492337850.0, "created_utc": 1492309050.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgbx27q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rhoded", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "As far as your first point, there are a lot of Windows programs and probably more than there are Mac programs.  However, there are at times Mac programs where there aren't equivalencies on Windows.  Also, given that Mac is based on Unix, there is are at least a lot of tools in command-line that are developed for both Linux operating systems and Mac OS X.  If you don't need those, it isn't just the App store that offers compliance.  In the games realm Gog.com and Steam offer many products for Mac users.  Perhaps because of early adoption of Macs by creatives, there are a lot of multimedia production programs on Mac OS X.  And if in the end you are still looking for software that only exists in Windows, you can use PlayOnMac, Wine, or even dual-boot with Windows.  While dual-booting isn't Mac OS X anymore, you can pretty much only install Windows on a Mac computer, not vice versa (unless you count Hackintosh, which is buggy, difficult, and I think technically illegal).\n\nYour second point is very valid.  The hardware options are limited on Macs but the hardware typically used in Macs is very high quality.  Usually it is top of the line at release time.  You can also always upgrade RAM and harddrives on Macs.  I have a a MacBook Pro with a 1TB SSD and 16GB of RAM from 5 years ago and it still runs well, and I bought it with a 500 GB HDD and 4GB of RAM.  If you have a Windows laptop, you are pretty in the same boat with regards to upgrades (except for I think the HP Powerbooks).  Windows desktops are currently more customizable, but I used to take care of my school's AV department Mac Pros (the old aluminum ones, not the \"trash cans\") and they were the easiest to upgrade.  Hard drives were in special carriages that smoothly rolled in and out and it had PCI inputs as well.  When looking at Mac motherboards and logic boards et al. they have a build quality that surpasses most Windows machines.  It might be a negligible difference in performance but perhaps they last longer under more strenuous workloads.\n\nAs your second and third point are related, I answered parts of by addressing how prior Mac Pro models are easily upgraded and how certain laptop elements are easily upgraded.  The aluminum uni-body you bring up is not just an aesthetic feature but a protective element.  Many Windows machines are plastic or cheap metal and just don't stand up to the same abuse that some Macs can take.  Sure, I've broken a few laptops in my time, but in some ways, Mac or Windows machine, they are going to break.  In some ways though, the Mac will stand up better to that damage than a plastic Windows machine.\n\nAll of my points start to add up to the higher price tag; higher quality components and more durable enclosures.  The other thing that Mac computers have over Windows is amazing plug-and-play and a consistent user experience.  Sure, a lot of Windows hardware is easy to install through drivers, but many can be painful experiences.  On Mac, if hardware works on the OS, it usually works immediately, without any configuration.  Hardware and software often play much nicer together with less work on Mac machines than on Windows.  Also, the interfaces of software is very homogeneous.  You can predict the behavior of many installers and interfaces in Mac easier than in Windows.  For example, installing software like 123D Design on Windows requires installing many Visual Studio libraries before and the instructions are not clear at the start.  This hardly happens on Mac.  My coworkers Windows machine has a special program for nVidia graphics card management, which can be useful sometimes, but built into the System Preferences in Mac is the switch to turn on and off the graphics card to save power.  This type of integration is great at first and you eventually forget about it.  Going back to Windows afterwards can be such a pain because of drawn-put installations and products that need additional configuration.\n\nThere are other advantages as well.  Macs are less susceptible to virus attacks than Windows machines.  They have some features I have come to depend on, such as gestural control on the laptop touch pad, the touch pad's general high quality and precision (I don't use a mouse), and the keyboard's incredible feel.\n\nAll that being said, the direction Apple is going in is very disappointing.  The older machines were worth defending as I have, but the \"trash can\", newer touch bar MacBooks, and connectionless MacBooks start to leave that vision behind.  To someone who is looking for a nice Mac laptop, I would recommend buying a 2-3 year old computer.  He/she would receive a beautiful, useful, powerful machine that embodies the points I have brought up.  For whatever reason, the newer machines need more adapters, have less powerful components, and have less useful features.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As far as your first point, there are a lot of Windows programs and probably more than there are Mac programs.  However, there are at times Mac programs where there aren&amp;#39;t equivalencies on Windows.  Also, given that Mac is based on Unix, there is are at least a lot of tools in command-line that are developed for both Linux operating systems and Mac OS X.  If you don&amp;#39;t need those, it isn&amp;#39;t just the App store that offers compliance.  In the games realm Gog.com and Steam offer many products for Mac users.  Perhaps because of early adoption of Macs by creatives, there are a lot of multimedia production programs on Mac OS X.  And if in the end you are still looking for software that only exists in Windows, you can use PlayOnMac, Wine, or even dual-boot with Windows.  While dual-booting isn&amp;#39;t Mac OS X anymore, you can pretty much only install Windows on a Mac computer, not vice versa (unless you count Hackintosh, which is buggy, difficult, and I think technically illegal).&lt;/p&gt;\n\n&lt;p&gt;Your second point is very valid.  The hardware options are limited on Macs but the hardware typically used in Macs is very high quality.  Usually it is top of the line at release time.  You can also always upgrade RAM and harddrives on Macs.  I have a a MacBook Pro with a 1TB SSD and 16GB of RAM from 5 years ago and it still runs well, and I bought it with a 500 GB HDD and 4GB of RAM.  If you have a Windows laptop, you are pretty in the same boat with regards to upgrades (except for I think the HP Powerbooks).  Windows desktops are currently more customizable, but I used to take care of my school&amp;#39;s AV department Mac Pros (the old aluminum ones, not the &amp;quot;trash cans&amp;quot;) and they were the easiest to upgrade.  Hard drives were in special carriages that smoothly rolled in and out and it had PCI inputs as well.  When looking at Mac motherboards and logic boards et al. they have a build quality that surpasses most Windows machines.  It might be a negligible difference in performance but perhaps they last longer under more strenuous workloads.&lt;/p&gt;\n\n&lt;p&gt;As your second and third point are related, I answered parts of by addressing how prior Mac Pro models are easily upgraded and how certain laptop elements are easily upgraded.  The aluminum uni-body you bring up is not just an aesthetic feature but a protective element.  Many Windows machines are plastic or cheap metal and just don&amp;#39;t stand up to the same abuse that some Macs can take.  Sure, I&amp;#39;ve broken a few laptops in my time, but in some ways, Mac or Windows machine, they are going to break.  In some ways though, the Mac will stand up better to that damage than a plastic Windows machine.&lt;/p&gt;\n\n&lt;p&gt;All of my points start to add up to the higher price tag; higher quality components and more durable enclosures.  The other thing that Mac computers have over Windows is amazing plug-and-play and a consistent user experience.  Sure, a lot of Windows hardware is easy to install through drivers, but many can be painful experiences.  On Mac, if hardware works on the OS, it usually works immediately, without any configuration.  Hardware and software often play much nicer together with less work on Mac machines than on Windows.  Also, the interfaces of software is very homogeneous.  You can predict the behavior of many installers and interfaces in Mac easier than in Windows.  For example, installing software like 123D Design on Windows requires installing many Visual Studio libraries before and the instructions are not clear at the start.  This hardly happens on Mac.  My coworkers Windows machine has a special program for nVidia graphics card management, which can be useful sometimes, but built into the System Preferences in Mac is the switch to turn on and off the graphics card to save power.  This type of integration is great at first and you eventually forget about it.  Going back to Windows afterwards can be such a pain because of drawn-put installations and products that need additional configuration.&lt;/p&gt;\n\n&lt;p&gt;There are other advantages as well.  Macs are less susceptible to virus attacks than Windows machines.  They have some features I have come to depend on, such as gestural control on the laptop touch pad, the touch pad&amp;#39;s general high quality and precision (I don&amp;#39;t use a mouse), and the keyboard&amp;#39;s incredible feel.&lt;/p&gt;\n\n&lt;p&gt;All that being said, the direction Apple is going in is very disappointing.  The older machines were worth defending as I have, but the &amp;quot;trash can&amp;quot;, newer touch bar MacBooks, and connectionless MacBooks start to leave that vision behind.  To someone who is looking for a nice Mac laptop, I would recommend buying a 2-3 year old computer.  He/she would receive a beautiful, useful, powerful machine that embodies the points I have brought up.  For whatever reason, the newer machines need more adapters, have less powerful components, and have less useful features.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbx27q", "score_hidden": false, "stickied": false, "created": 1492368324.0, "created_utc": 1492339524.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbbxg9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "babygrenade", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You're comparing any pc running a brand of OS to a specific line of pc. Not a very fair comparison. \n\nIf you open it up to any pc running mac os, then you include hackintosh boxes and a lot of these points weaken or go away completely. \n\nReally, it depends on what you're using the device for. Most of the population only uses pcs to browse the internet, do light word processing, and maybe play casual games. For that kind of use, I'd argue a mac, which will require very light maintenance might be the better option. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re comparing any pc running a brand of OS to a specific line of pc. Not a very fair comparison. &lt;/p&gt;\n\n&lt;p&gt;If you open it up to any pc running mac os, then you include hackintosh boxes and a lot of these points weaken or go away completely. &lt;/p&gt;\n\n&lt;p&gt;Really, it depends on what you&amp;#39;re using the device for. Most of the population only uses pcs to browse the internet, do light word processing, and maybe play casual games. For that kind of use, I&amp;#39;d argue a mac, which will require very light maintenance might be the better option. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbbxg9", "score_hidden": false, "stickied": false, "created": 1492327126.0, "created_utc": 1492298326.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgbuu26", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kht120", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I personally use a Windows custom-built desktop, but after a couple years with a Surface Pro 3, there's no doubt in my mind that the next laptop I buy will be a MacBook.\n\nMac OS X being built on top of UNIX may be advantageous to some power users and IT workers, but I guess OS isn't a huge deal to the average user. I do find their product integration a pretty attractive measure; if you already own an iPhone/iPad, being able to access iPhotos/iMessage/iCloud through native apps is really nice. Final Cut is also really attractive to video editors, since it runs better than Premiere on lesser hardware. \n\nFrom a hardware perspective, I think a MacBook/rMBP/MBA is an extremely attractive package. There isn't a single Windows laptop that offers the same combination of performance, battery life, build quality, and input quality as the MacBooks. There are laptops that do some of these things better, but not all of them better for the same price. For example, the XPS13 and XPS15 are great laptops and do most of these things, but their build and input quality isn't as good. I think these two qualities are things that Apple does better than the rest of the field by a fairly significant margin. They still use a 16:10 aspect ratio, which is great for usability, and they blow away the competition in color reproduction. Their keyboards are unrivaled amongst laptops of a similar thickness, and their trackpads are second to none. Some laptops have adopted similar glass trackpads, but Microsoft software isn't as smooth, and no laptop offers a glass trackpad as big. Force Touch is also fantastic and offers better tactility and features than other trackpads. Their aluminum builds are also so much better than even other well-built Windows notebooks. Everything from the fit and finish to the tolerances are incredibly tight.\n\nWhether you think the build is worthwhile is certainly subjective, but for me, they are. When you use a laptop, you're constantly touching a keyboard or a trackpad while looking at a screen, and having these three things be high quality is paramount. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I personally use a Windows custom-built desktop, but after a couple years with a Surface Pro 3, there&amp;#39;s no doubt in my mind that the next laptop I buy will be a MacBook.&lt;/p&gt;\n\n&lt;p&gt;Mac OS X being built on top of UNIX may be advantageous to some power users and IT workers, but I guess OS isn&amp;#39;t a huge deal to the average user. I do find their product integration a pretty attractive measure; if you already own an iPhone/iPad, being able to access iPhotos/iMessage/iCloud through native apps is really nice. Final Cut is also really attractive to video editors, since it runs better than Premiere on lesser hardware. &lt;/p&gt;\n\n&lt;p&gt;From a hardware perspective, I think a MacBook/rMBP/MBA is an extremely attractive package. There isn&amp;#39;t a single Windows laptop that offers the same combination of performance, battery life, build quality, and input quality as the MacBooks. There are laptops that do some of these things better, but not all of them better for the same price. For example, the XPS13 and XPS15 are great laptops and do most of these things, but their build and input quality isn&amp;#39;t as good. I think these two qualities are things that Apple does better than the rest of the field by a fairly significant margin. They still use a 16:10 aspect ratio, which is great for usability, and they blow away the competition in color reproduction. Their keyboards are unrivaled amongst laptops of a similar thickness, and their trackpads are second to none. Some laptops have adopted similar glass trackpads, but Microsoft software isn&amp;#39;t as smooth, and no laptop offers a glass trackpad as big. Force Touch is also fantastic and offers better tactility and features than other trackpads. Their aluminum builds are also so much better than even other well-built Windows notebooks. Everything from the fit and finish to the tolerances are incredibly tight.&lt;/p&gt;\n\n&lt;p&gt;Whether you think the build is worthwhile is certainly subjective, but for me, they are. When you use a laptop, you&amp;#39;re constantly touching a keyboard or a trackpad while looking at a screen, and having these three things be high quality is paramount. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbuu26", "score_hidden": false, "stickied": false, "created": 1492360695.0, "created_utc": 1492331895.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgdo6zi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "awa64", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "1. More software isn't necessarily better software. macOS may be missing equivalents to some esoteric or outdated pieces of software, or support for certain games, but most people will be able to get versions of everything they need on a day-to-day basis. Moreover, Apple's developer support tends to be stronger, leading to software that feels more consistent, more tied to the OS experience, and more easily allows for implementation of new software features enabled by OS updates.\n\n2. There are benefits to having more locked-down specs. It means less troubleshooting, fewer things that can go wrong, thanks to an operating system and drivers tailored to specific pieces of hardware. You can squeeze more raw performance out of relatively-inferior components that way, especially when it comes to power consumption/battery life. And frankly, I've never used a Windows device with a trackpad where the trackpad was tolerable, but the ones on Apple devices are great.\n\n3. There are similar unibody-style, difficult-to-repair PCs. It's a trade-off. Some people prefer their hardware easy to tinker with, some people prefer a stylish body and luxury materials even if it's going to be harder to repair.\n\n4. Apple doesn't offer opening price point models. If you want the cheapest possible computer, a Mac isn't your best option... but once you get up into the price points Apple does offer products at, their products tend to be relatively competitive for fit, finish, and performance.\n\nA Mac might not be what you want out of a computer, but for a lot of people, it's a better experience than a Windows machine. If you have all the software you need, and it's all well-made software that's a joy to use, why do you care if there's more software somewhere else? If you already bought the system that had the specs you wanted up front, why do you care that you can't crack it open and customize the internals? If it doesn't break, why do you care that it's harder to repair? If you're willing to pay a premium for a nice experience, why do you care that you could cobble together something functional for cheaper?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;More software isn&amp;#39;t necessarily better software. macOS may be missing equivalents to some esoteric or outdated pieces of software, or support for certain games, but most people will be able to get versions of everything they need on a day-to-day basis. Moreover, Apple&amp;#39;s developer support tends to be stronger, leading to software that feels more consistent, more tied to the OS experience, and more easily allows for implementation of new software features enabled by OS updates.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There are benefits to having more locked-down specs. It means less troubleshooting, fewer things that can go wrong, thanks to an operating system and drivers tailored to specific pieces of hardware. You can squeeze more raw performance out of relatively-inferior components that way, especially when it comes to power consumption/battery life. And frankly, I&amp;#39;ve never used a Windows device with a trackpad where the trackpad was tolerable, but the ones on Apple devices are great.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There are similar unibody-style, difficult-to-repair PCs. It&amp;#39;s a trade-off. Some people prefer their hardware easy to tinker with, some people prefer a stylish body and luxury materials even if it&amp;#39;s going to be harder to repair.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Apple doesn&amp;#39;t offer opening price point models. If you want the cheapest possible computer, a Mac isn&amp;#39;t your best option... but once you get up into the price points Apple does offer products at, their products tend to be relatively competitive for fit, finish, and performance.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;A Mac might not be what you want out of a computer, but for a lot of people, it&amp;#39;s a better experience than a Windows machine. If you have all the software you need, and it&amp;#39;s all well-made software that&amp;#39;s a joy to use, why do you care if there&amp;#39;s more software somewhere else? If you already bought the system that had the specs you wanted up front, why do you care that you can&amp;#39;t crack it open and customize the internals? If it doesn&amp;#39;t break, why do you care that it&amp;#39;s harder to repair? If you&amp;#39;re willing to pay a premium for a nice experience, why do you care that you could cobble together something functional for cheaper?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdo6zi", "score_hidden": true, "stickied": false, "created": 1492473767.0, "created_utc": 1492444967.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgbo555", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sabedoria", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "First of all, your title implies you are looking at the problem incorrectly. Instead saying \"Windows computers are better than iMacs *for me*\" is how you start to change your view, and the edited title is completely true (probably, I don't know your specific needs). However, they each have advantages and the list changes depending on who is using them. \n\n&gt; In my experience of downloading software on a mac, you almost always have to check for mac compatibility, where for windows you don't, unless you're downloading a program straight from the apple app store.\n&gt;You want to add a better motherboard? No problem. Plop that baby open and put more ram sticks in it, you're good to go.\n\nThese are examples to disadvantages to someone who isn't very computer literate. The idea being that Macs are more user friendly, and they are. There's less room to mess things up. Back in the day, there was a game (Sims, I think) that had a bug in the code that wouldn't tell the computer it was done using memory which lead to the game literally using all 60 kilobytes of memory a computer had! (randomly low number used for comedic effect). Windows solution was to have the operating system to check if that game was running, all the time. Mac's solution was to just not run the game. This is just an example of one software bug, and every program has software bugs (not always as detrimental as that). Windows just keeps releasing patches to known problems like that. Mac just hand picks the programs it can run for a smoother performance. Making sure programs run smoothly means less room for things to go wrong with Macs. \n\n&gt;The cheapest iMac/MacBook computer is around 800-900 dollars brand new, whereas a brand new PC computer can be as low as $500 if the parts are bought individually by a costumer and built together\n\nI remember trying this and frying a few computer parts and spent about what I would have on an iMac. I can't be the only one. \n\n\nThe bottom line is Macs go for people who want or even need user friendliness. Windows is better for people with more moderate computer literacy. However, people with a really high computer literacy just use Linux. Whatever operating system and computer people use just fits whatever they need.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First of all, your title implies you are looking at the problem incorrectly. Instead saying &amp;quot;Windows computers are better than iMacs &lt;em&gt;for me&lt;/em&gt;&amp;quot; is how you start to change your view, and the edited title is completely true (probably, I don&amp;#39;t know your specific needs). However, they each have advantages and the list changes depending on who is using them. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In my experience of downloading software on a mac, you almost always have to check for mac compatibility, where for windows you don&amp;#39;t, unless you&amp;#39;re downloading a program straight from the apple app store.\nYou want to add a better motherboard? No problem. Plop that baby open and put more ram sticks in it, you&amp;#39;re good to go.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;These are examples to disadvantages to someone who isn&amp;#39;t very computer literate. The idea being that Macs are more user friendly, and they are. There&amp;#39;s less room to mess things up. Back in the day, there was a game (Sims, I think) that had a bug in the code that wouldn&amp;#39;t tell the computer it was done using memory which lead to the game literally using all 60 kilobytes of memory a computer had! (randomly low number used for comedic effect). Windows solution was to have the operating system to check if that game was running, all the time. Mac&amp;#39;s solution was to just not run the game. This is just an example of one software bug, and every program has software bugs (not always as detrimental as that). Windows just keeps releasing patches to known problems like that. Mac just hand picks the programs it can run for a smoother performance. Making sure programs run smoothly means less room for things to go wrong with Macs. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The cheapest iMac/MacBook computer is around 800-900 dollars brand new, whereas a brand new PC computer can be as low as $500 if the parts are bought individually by a costumer and built together&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I remember trying this and frying a few computer parts and spent about what I would have on an iMac. I can&amp;#39;t be the only one. &lt;/p&gt;\n\n&lt;p&gt;The bottom line is Macs go for people who want or even need user friendliness. Windows is better for people with more moderate computer literacy. However, people with a really high computer literacy just use Linux. Whatever operating system and computer people use just fits whatever they need.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbo555", "score_hidden": false, "stickied": false, "created": 1492345109.0, "created_utc": 1492316309.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbgdbs", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "asbruckman", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "MacOS is built on UNIX, which is powerful and useful. For folks who know UNIX well, there's no contest here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;MacOS is built on UNIX, which is powerful and useful. For folks who know UNIX well, there&amp;#39;s no contest here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbgdbs", "score_hidden": false, "stickied": false, "created": 1492333412.0, "created_utc": 1492304612.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgbbsaj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sharkbait76", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think a windows computer is better for some things and a mac is better for some things. If you want something specific out of a computer a windows computer is the way to go. If you don't care about the combustibility and want something that functions as asked right out of the box a mac is what you want. I've had both macs and PCs and I've found that my mac does what I want and 4 years later it's still going strong and can run anything I ask it to run. I don't play games or run really any programs that don't come standard on my computer, so the ability to mix and match things doesn't apply for me. I also have no where near the technical know how to build my own computer. I've also had PCs that didn't last 6 months before at least half a dozen things malfunctioned with it and the motherboard failed.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think a windows computer is better for some things and a mac is better for some things. If you want something specific out of a computer a windows computer is the way to go. If you don&amp;#39;t care about the combustibility and want something that functions as asked right out of the box a mac is what you want. I&amp;#39;ve had both macs and PCs and I&amp;#39;ve found that my mac does what I want and 4 years later it&amp;#39;s still going strong and can run anything I ask it to run. I don&amp;#39;t play games or run really any programs that don&amp;#39;t come standard on my computer, so the ability to mix and match things doesn&amp;#39;t apply for me. I also have no where near the technical know how to build my own computer. I&amp;#39;ve also had PCs that didn&amp;#39;t last 6 months before at least half a dozen things malfunctioned with it and the motherboard failed.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbbsaj", "score_hidden": false, "stickied": false, "created": 1492326919.0, "created_utc": 1492298119.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgbv5s5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "arostganomo", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Do you mean iMac specifically or are you including other Mac computers, especially older ones? Because in the case of my 2012 MacBook Pro, you have points 2 and 3 backwards. I don't have any experience with the iMac but I've screwed my MacBook open many times, for cleaning the fan, for putting in bigger RAM, and for replacing an Airport cable. It's super simple and, huge plus, it doesn't void my warranty unlike many other brands. The parts are cheap off amazon (that Mac-only Airport cable responsible for Wi-Fi, Bluetooth and camera cost me about $10), and you don't need special equipment for most repairs other than a 00 Philips screwdriver.\n\nSeriously, take a look at the iFixit website if you like. It has tutorials for all common repairs and if you ever played with legos, it's a piece of cake.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you mean iMac specifically or are you including other Mac computers, especially older ones? Because in the case of my 2012 MacBook Pro, you have points 2 and 3 backwards. I don&amp;#39;t have any experience with the iMac but I&amp;#39;ve screwed my MacBook open many times, for cleaning the fan, for putting in bigger RAM, and for replacing an Airport cable. It&amp;#39;s super simple and, huge plus, it doesn&amp;#39;t void my warranty unlike many other brands. The parts are cheap off amazon (that Mac-only Airport cable responsible for Wi-Fi, Bluetooth and camera cost me about $10), and you don&amp;#39;t need special equipment for most repairs other than a 00 Philips screwdriver.&lt;/p&gt;\n\n&lt;p&gt;Seriously, take a look at the iFixit website if you like. It has tutorials for all common repairs and if you ever played with legos, it&amp;#39;s a piece of cake.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbv5s5", "score_hidden": false, "stickied": false, "created": 1492361773.0, "created_utc": 1492332973.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgbuqy9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IlllIIIIIIlllll", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "\n4 Windows is cheaper, but you get what you pay for.\n\nWhen it comes to the laptops the Macbooks are actually pretty decently priced. There are some things that don't show up in the specs such as the display quality. Most people will look at the resolution and be done with it but the color reproduction on Macbooks is excellent. I bought a cheap laptop not long ago. It's specs were decent, and it only had a 720p display which I could have lived with but the color quality was atrocious. When you put the brightness up it looks all washed out. You're also paying for better service. I'd much rather have to deal with Apple than any other manufacturer when it comes to returns.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;4 Windows is cheaper, but you get what you pay for.&lt;/p&gt;\n\n&lt;p&gt;When it comes to the laptops the Macbooks are actually pretty decently priced. There are some things that don&amp;#39;t show up in the specs such as the display quality. Most people will look at the resolution and be done with it but the color reproduction on Macbooks is excellent. I bought a cheap laptop not long ago. It&amp;#39;s specs were decent, and it only had a 720p display which I could have lived with but the color quality was atrocious. When you put the brightness up it looks all washed out. You&amp;#39;re also paying for better service. I&amp;#39;d much rather have to deal with Apple than any other manufacturer when it comes to returns.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbuqy9", "score_hidden": false, "stickied": false, "created": 1492360414.0, "created_utc": 1492331614.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgcgivb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "username_6916", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "1) Is there a Windows version of `htop`? There's a whole world of software from the UNIX traditions that either doesn't have a Windows port at all, or isn't as easily set up as using something like Homebrew if it has a Windows port.  \n\n(I'll freely give you 2 and 3)\n\n4) And in terms of industrial design and physical configuration, Macs often are 'better'. They use more expensive manufacturing processes, often to create tougher and (arguably) more beautiful results. Consider the milled aluminum chassis of a Macbook Pro versus the injection molded plastic chassis of a cheaper commodity laptop. \n\n", "edited": 1492374881.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1) Is there a Windows version of &lt;code&gt;htop&lt;/code&gt;? There&amp;#39;s a whole world of software from the UNIX traditions that either doesn&amp;#39;t have a Windows port at all, or isn&amp;#39;t as easily set up as using something like Homebrew if it has a Windows port.  &lt;/p&gt;\n\n&lt;p&gt;(I&amp;#39;ll freely give you 2 and 3)&lt;/p&gt;\n\n&lt;p&gt;4) And in terms of industrial design and physical configuration, Macs often are &amp;#39;better&amp;#39;. They use more expensive manufacturing processes, often to create tougher and (arguably) more beautiful results. Consider the milled aluminum chassis of a Macbook Pro versus the injection molded plastic chassis of a cheaper commodity laptop. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgcgivb", "score_hidden": false, "stickied": false, "created": 1492400101.0, "created_utc": 1492371301.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgc9a4w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kochirakyosuke", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Different strokes for different folks. One isn't inherently 'better' than the other--it depends what the user is looking for.\n\n-UNIX based systems often contain fewer security flaws\n\n-A lot of graphic design folks seem to prefer Macs\n\n-A Mac can be better for a user who isn't as tech savvy, but has bought fully into the Mac ecosystem (iPhone, iTunes, etc)\n\n-Although Windows has made good strides in recent years, a lot of people found Macs more accessible and user-friendly", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Different strokes for different folks. One isn&amp;#39;t inherently &amp;#39;better&amp;#39; than the other--it depends what the user is looking for.&lt;/p&gt;\n\n&lt;p&gt;-UNIX based systems often contain fewer security flaws&lt;/p&gt;\n\n&lt;p&gt;-A lot of graphic design folks seem to prefer Macs&lt;/p&gt;\n\n&lt;p&gt;-A Mac can be better for a user who isn&amp;#39;t as tech savvy, but has bought fully into the Mac ecosystem (iPhone, iTunes, etc)&lt;/p&gt;\n\n&lt;p&gt;-Although Windows has made good strides in recent years, a lot of people found Macs more accessible and user-friendly&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgc9a4w", "score_hidden": false, "stickied": false, "created": 1492390508.0, "created_utc": 1492361708.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgbo8d1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ducktruck_OG", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I believe that MAC computers, when treated properly, are easier to use and last a very long time. This may no longer be the case, and I wouldn't recommend them for people who are looking to maximize their computer performance.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe that MAC computers, when treated properly, are easier to use and last a very long time. This may no longer be the case, and I wouldn&amp;#39;t recommend them for people who are looking to maximize their computer performance.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbo8d1", "score_hidden": false, "stickied": false, "created": 1492345264.0, "created_utc": 1492316464.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbb6y8", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "BAWguy", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 1, "body": "Windows is undoubtedly better if you have computer knowledge/proficiency. But what about the age-old stereotype of the older generation having no idea how computers work? It is not a myth, most of us know that firsthand, myself included. My Nana and my dad don't know what a motherboard is, let alone wish to add a better one. Macs don't do much, but they have web browsers, music, video chat, and basic word processing. There is a very large market of people who a) get borderline confused just using their macs who would be distracted and bogged down by all the options Windows offers, and therefore b) *prefer* a more basic computer. It's like getting a new driver an old Rav4 that won't break down and is easy to drive, instead of some obviously \"better\" stick-shift Mercedes, or something. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Windows is undoubtedly better if you have computer knowledge/proficiency. But what about the age-old stereotype of the older generation having no idea how computers work? It is not a myth, most of us know that firsthand, myself included. My Nana and my dad don&amp;#39;t know what a motherboard is, let alone wish to add a better one. Macs don&amp;#39;t do much, but they have web browsers, music, video chat, and basic word processing. There is a very large market of people who a) get borderline confused just using their macs who would be distracted and bogged down by all the options Windows offers, and therefore b) &lt;em&gt;prefer&lt;/em&gt; a more basic computer. It&amp;#39;s like getting a new driver an old Rav4 that won&amp;#39;t break down and is easy to drive, instead of some obviously &amp;quot;better&amp;quot; stick-shift Mercedes, or something. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbb6y8", "score_hidden": false, "stickied": false, "created": 1492326054.0, "created_utc": 1492297254.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgbsek4", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "EvilVargon", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I am a user of OSX, Windows, and Linux. I grew up hating macs because, well, they were macs. That was enough of an insult to many. But I have grown to love osx.\n\n**Closed source doesn't inherently mean bad**. The best thing about Apple is that they make both the hardware and software for their products. This means you dont have an extra layer of interpretation between the OS and the hardware. Windows has the daunting task of working on millions of different machines. OSX only needs to work on a few dozen. They can optimize their OS better due to this.\n\n**Mac hardware still performs better than new PCs in some tasks**. Namely: Video editing. Final cut works astonishingly well on OSX. Insanely well. A brand new PC cant work as fast in Premier as a 4 year old mac can on final cut. This ties into the next point\n\nA mac doesn't need to be upgraded as often, **it is less work to maintain**, and is intuitive for many people. Along with that, customer support in these two companies are as opposite as you can get.\n\n**Windows**\n\nI botch my OS doing a system restore from booting on a corrupt drive. I ask windows to help get it back on without my recovery disk. Solution? Buy a new copy of Windows. I nearly tore my hair out trying to get anything out of them. (Ended up using the tech preview)\n\n**Apple**\n\nI botched my OS from replacing OSX with Ubuntu. Call up Apple tech support and they have me up on a fresh install of OSX in an hour. \n\nFor you, windows is probably better. You know your way around the internet and could dual boot a hackintosh if you needed that specific OS. But the point is that it isn't inherently better. You have just as many reasons to move to Apple as you do to Microsoft.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am a user of OSX, Windows, and Linux. I grew up hating macs because, well, they were macs. That was enough of an insult to many. But I have grown to love osx.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Closed source doesn&amp;#39;t inherently mean bad&lt;/strong&gt;. The best thing about Apple is that they make both the hardware and software for their products. This means you dont have an extra layer of interpretation between the OS and the hardware. Windows has the daunting task of working on millions of different machines. OSX only needs to work on a few dozen. They can optimize their OS better due to this.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Mac hardware still performs better than new PCs in some tasks&lt;/strong&gt;. Namely: Video editing. Final cut works astonishingly well on OSX. Insanely well. A brand new PC cant work as fast in Premier as a 4 year old mac can on final cut. This ties into the next point&lt;/p&gt;\n\n&lt;p&gt;A mac doesn&amp;#39;t need to be upgraded as often, &lt;strong&gt;it is less work to maintain&lt;/strong&gt;, and is intuitive for many people. Along with that, customer support in these two companies are as opposite as you can get.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Windows&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I botch my OS doing a system restore from booting on a corrupt drive. I ask windows to help get it back on without my recovery disk. Solution? Buy a new copy of Windows. I nearly tore my hair out trying to get anything out of them. (Ended up using the tech preview)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Apple&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I botched my OS from replacing OSX with Ubuntu. Call up Apple tech support and they have me up on a fresh install of OSX in an hour. &lt;/p&gt;\n\n&lt;p&gt;For you, windows is probably better. You know your way around the internet and could dual boot a hackintosh if you needed that specific OS. But the point is that it isn&amp;#39;t inherently better. You have just as many reasons to move to Apple as you do to Microsoft.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbsek4", "score_hidden": false, "stickied": false, "created": 1492353712.0, "created_utc": 1492324912.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgbclhu", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ShootingPains", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The hardware features you are describing are of value to only a very small percentage of buyers because the vast majority of buyers will never lift the hood and look at the engine, and only the tiniest fraction of those will actually ever upgrade components. \n\nAs for software, the mac may not have the most natively compiled software, but it has an amount that is sufficient for the vast majority of uses. Obviously, there are dual-boot and emulator options for those users who need non-native software. \n\nOSX is stable and snappy. Unlike Windows, it stays stable and snappy. \n\nOSX updates are painless and stress free - unlike the reputation of Windows. \n\nNow, here's the clincher. Imagine a normal PC buyer walking in to a computer retailer. This buyer isn't PC literate, he doesn't know his Xeon from his nVidia. He stands there and to his right is a sea of anonymous chunky black boxes, fans whiring, each with a bewildering array of slightly different features etc. None of those differences mean anything to this buyer, and he certainly can't put a price on their individual value to him. The choice has become difficult with a lot of room for error and therefore buyers remorse. Then he looks to the left and sees just three pretty iMacs - the salesman points and says, \"Good, Better, Best - you won't be disappointed\". By committing to a mac the buyer has greatly simplified his purchase decision and the deal is sealed on the spot. \n\n[edit:  regarding the software ecosystem: the mac's is actually larger than Windows because the mac can dual boot Windows, but Windows can't dual boot OSX without breaching Mac OSX licenses.]", "edited": 1492299584.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The hardware features you are describing are of value to only a very small percentage of buyers because the vast majority of buyers will never lift the hood and look at the engine, and only the tiniest fraction of those will actually ever upgrade components. &lt;/p&gt;\n\n&lt;p&gt;As for software, the mac may not have the most natively compiled software, but it has an amount that is sufficient for the vast majority of uses. Obviously, there are dual-boot and emulator options for those users who need non-native software. &lt;/p&gt;\n\n&lt;p&gt;OSX is stable and snappy. Unlike Windows, it stays stable and snappy. &lt;/p&gt;\n\n&lt;p&gt;OSX updates are painless and stress free - unlike the reputation of Windows. &lt;/p&gt;\n\n&lt;p&gt;Now, here&amp;#39;s the clincher. Imagine a normal PC buyer walking in to a computer retailer. This buyer isn&amp;#39;t PC literate, he doesn&amp;#39;t know his Xeon from his nVidia. He stands there and to his right is a sea of anonymous chunky black boxes, fans whiring, each with a bewildering array of slightly different features etc. None of those differences mean anything to this buyer, and he certainly can&amp;#39;t put a price on their individual value to him. The choice has become difficult with a lot of room for error and therefore buyers remorse. Then he looks to the left and sees just three pretty iMacs - the salesman points and says, &amp;quot;Good, Better, Best - you won&amp;#39;t be disappointed&amp;quot;. By committing to a mac the buyer has greatly simplified his purchase decision and the deal is sealed on the spot. &lt;/p&gt;\n\n&lt;p&gt;[edit:  regarding the software ecosystem: the mac&amp;#39;s is actually larger than Windows because the mac can dual boot Windows, but Windows can&amp;#39;t dual boot OSX without breaching Mac OSX licenses.]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbclhu", "score_hidden": false, "stickied": false, "created": 1492328084.0, "created_utc": 1492299284.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgc1lls", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "asbruckman", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The combination of the GUI front end and week-designed command-line back end is powerful and well thought out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The combination of the GUI front end and week-designed command-line back end is powerful and well thought out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgc1lls", "score_hidden": false, "stickied": false, "created": 1492379456.0, "created_utc": 1492350656.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgbl9lr", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "SeanACarlos", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "iMacs were all I ever needed.\n\nTherefore you don't even need a windows computer.\n\nYou can do anything you need on a suitably designed iMac.\n\nWindows computers are completely superfluous in the modern era.\n\nBut if you think I'm wrong...\n\nProve it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;iMacs were all I ever needed.&lt;/p&gt;\n\n&lt;p&gt;Therefore you don&amp;#39;t even need a windows computer.&lt;/p&gt;\n\n&lt;p&gt;You can do anything you need on a suitably designed iMac.&lt;/p&gt;\n\n&lt;p&gt;Windows computers are completely superfluous in the modern era.&lt;/p&gt;\n\n&lt;p&gt;But if you think I&amp;#39;m wrong...&lt;/p&gt;\n\n&lt;p&gt;Prove it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbl9lr", "score_hidden": false, "stickied": false, "created": 1492340566.0, "created_utc": 1492311766.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65lypf", "likes": null, "replies": "", "user_reports": [], "id": "dgbbm59", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "JarJarIamyourfather", "parent_id": "t3_65lypf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You can also install OSX on a pc, so i'd have to agree with you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can also install OSX on a pc, so i&amp;#39;d have to agree with you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgbbm59", "score_hidden": false, "stickied": false, "created": 1492326669.0, "created_utc": 1492297869.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]