[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So first some anecdotal evidence.  I spent a couple of weeks in Trinidad and Tobago a few years ago, and upon speaking to locals I learned that their post-secondary education is free.  When I suggested unemployment must be really low, they told me the opposite; they told me that because education was free, everyone had a degree, and you needed multiple degrees just to get a decent job.  I live in NA and we can see this already.  Good jobs that at one time required no degree are becoming harder to get as education gets cheaper.  For example (sort of anecdotal again), a family friend used to work at Enterprise Rent-a-Car, and told me that they only hire people with university degrees.  Underemployment is a rising problem &lt;a href=\"https://www.forbes.com/sites/ashleystahl/2016/07/12/underemployment/#ecf308a66c9a\"&gt;source&lt;/a&gt; (tldr: Payscale ran a poll asking if people were unemployed; 46% said they were.  To be fair, the type of people on Payscale would be more likely to be unemployed or underemployed.&lt;/p&gt;\n\n&lt;p&gt;My second issue is that it takes away a lot of the motivation, because you have nothing on the line.  Fail?  Take it again, its free.  Doing poorly?  Who cares, not like you&amp;#39;re losing anything.  I know you&amp;#39;re about to say, &amp;quot;well the people who are going to university are the people who want to go to university&amp;quot;.  Assuming that&amp;#39;s true, which from my experience it isn&amp;#39;t, once education is free, you&amp;#39;re going to see the kids who didn&amp;#39;t care in high school and only went because they were forced to do the same in universities.  Because it&amp;#39;s free, their parents will make them go, and because they don&amp;#39;t care, they&amp;#39;re going to slack off and waste their time and taxpayer money.  And then get a job that they could have gotten out of high school.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m all for a more educated public.  As I&amp;#39;m writing this I&amp;#39;m watching the View (not by choice) and it&amp;#39;s hurting me.  But in my opinion, that&amp;#39;s the job of secondary schools, to either do a better job at educating students, or at least instilling the desire to continue their education.  Free post-secondary education only worsens un/underemployment, and is a huge waste of taxpayer money.  A better use of the money would be spent paying for the education of well performing students who show a desire to pursue worthwhile educations. \nCMV!&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;This is a footnote from the CMV moderators. We&amp;#39;d like to remind you of a couple of things. Firstly, please&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules\"&gt;read through our rules&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting\"&gt;downvotes don&amp;#39;t change views&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;! Any questions or concerns? Feel free to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/message/compose?to=/r/changemyview\"&gt;message us&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;Happy CMVing!&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So first some anecdotal evidence.  I spent a couple of weeks in Trinidad and Tobago a few years ago, and upon speaking to locals I learned that their post-secondary education is free.  When I suggested unemployment must be really low, they told me the opposite; they told me that because education was free, everyone had a degree, and you needed multiple degrees just to get a decent job.  I live in NA and we can see this already.  Good jobs that at one time required no degree are becoming harder to get as education gets cheaper.  For example (sort of anecdotal again), a family friend used to work at Enterprise Rent-a-Car, and told me that they only hire people with university degrees.  Underemployment is a rising problem [source](https://www.forbes.com/sites/ashleystahl/2016/07/12/underemployment/#ecf308a66c9a) (tldr: Payscale ran a poll asking if people were unemployed; 46% said they were.  To be fair, the type of people on Payscale would be more likely to be unemployed or underemployed.\n\nMy second issue is that it takes away a lot of the motivation, because you have nothing on the line.  Fail?  Take it again, its free.  Doing poorly?  Who cares, not like you're losing anything.  I know you're about to say, \"well the people who are going to university are the people who want to go to university\".  Assuming that's true, which from my experience it isn't, once education is free, you're going to see the kids who didn't care in high school and only went because they were forced to do the same in universities.  Because it's free, their parents will make them go, and because they don't care, they're going to slack off and waste their time and taxpayer money.  And then get a job that they could have gotten out of high school.  \n\nI'm all for a more educated public.  As I'm writing this I'm watching the View (not by choice) and it's hurting me.  But in my opinion, that's the job of secondary schools, to either do a better job at educating students, or at least instilling the desire to continue their education.  Free post-secondary education only worsens un/underemployment, and is a huge waste of taxpayer money.  A better use of the money would be spent paying for the education of well performing students who show a desire to pursue worthwhile educations. \nCMV!\n_____\n\n&gt; *This is a footnote from the CMV moderators. We'd like to remind you of a couple of things. Firstly, please* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "[∆(s) from OP]", "id": "65wdqq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 43, "report_reasons": null, "author": "ACuddlySnowBear", "saved": false, "mod_reports": [], "name": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": false, "link_flair_css_class": "OPdelta", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/65wdqq/cmv_free_postsecondary_education_is_bad_for_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1492473320.0, "url": "https://www.reddit.com/r/changemyview/comments/65wdqq/cmv_free_postsecondary_education_is_bad_for_the/", "author_flair_text": null, "quarantine": false, "title": "CMV: Free post-secondary education is bad for the economy.", "created_utc": 1492444520.0, "distinguished": null, "media": null, "upvote_ratio": 0.76, "num_comments": 64, "visited": false, "subreddit_type": "public", "ups": 43}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dgdrnqb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "/u/ACuddlySnowBear (OP) has awarded 1 delta in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [**here**](/r/DeltaLog/comments/65wujv), in /r/DeltaLog.\n\nPlease note that a change of view [doesn't necessarily mean a reversal](https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F), or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/ACuddlySnowBear\"&gt;/u/ACuddlySnowBear&lt;/a&gt; (OP) has awarded 1 delta in this post.&lt;/p&gt;\n\n&lt;p&gt;All comments that earned deltas (from OP or other users) are listed &lt;a href=\"/r/DeltaLog/comments/65wujv\"&gt;&lt;strong&gt;here&lt;/strong&gt;&lt;/a&gt;, in &lt;a href=\"/r/DeltaLog\"&gt;/r/DeltaLog&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Please note that a change of view &lt;a href=\"https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F\"&gt;doesn&amp;#39;t necessarily mean a reversal&lt;/a&gt;, or that the conversation has ended.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdrnqb", "score_hidden": true, "stickied": true, "created": 1492477633.0, "created_utc": 1492448833.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dgdupd4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jclk1", "parent_id": "t1_dgdrnl1", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I agree with you that the system of determining financial aid based on parent income is flawed. Many students from middle class families end up having to pay for their schooling on their own. In fact it is people in your position who have the most to gain from free post secondary education being free. We already have a system for getting poor students into school and really wealthy students usually don't have a problem. Middle class kids are the ones who usually get straddled with debt. \n\nAlso, I hope that you think about the anger and prejudice you described in yourself in this post. It seems like your anger is pointed towards the student who got a better deal than you did, as if they created this messed up system that left you paying for your college, as opposed to pointing your anger at your government that is leaving you out of much needed financial support for your education.\n\nYou used an example of a theatre arts major, as if people with financial aid don't go into hard sciences. Also, it shows a prejudice that you believe humanities is not as hard as hard sciences and that somehow an engineering degree holder somehow contributes more to the world and society than a theatre arts major. While some people do coast through a humanities degree i have seen similar things from \"genius\" kids who are stoned all day and do no studying but ace through their hard science degree. These people don't represent all people in that program. If it really were that easy everyone would do it. The other barrier to finishing a degree is that it is hard no matter what major you go for.\n\nThe fact that there exists a theatre arts program at your school means it is a more valuable school than if it only taught engineering. The fact that you can take a theatre arts class adds value to your education. And while you may not be in a position to pay to take a non major course, if the government was helping you pay for school you would get that chance. The fact that you get to interact and meet humanities majors adds value to your college experience that you would miss out on if you went to an all engineering school. And if you really thought about, none of us would want to live in a country where everyone had only ever studied the hard sciences.\n\nThe humanities are a crucial part of education for every student and I think it is the fault of a bad financial aid system that you and many other students will never get the opportunity to take advantage of those resources in college. That is what I am angry about and see as what you and other students are being denied by not having a free college system where instead of having to worry about how much debt you will be for each course you take you can instead just concentrate on the value of what is being taught to you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with you that the system of determining financial aid based on parent income is flawed. Many students from middle class families end up having to pay for their schooling on their own. In fact it is people in your position who have the most to gain from free post secondary education being free. We already have a system for getting poor students into school and really wealthy students usually don&amp;#39;t have a problem. Middle class kids are the ones who usually get straddled with debt. &lt;/p&gt;\n\n&lt;p&gt;Also, I hope that you think about the anger and prejudice you described in yourself in this post. It seems like your anger is pointed towards the student who got a better deal than you did, as if they created this messed up system that left you paying for your college, as opposed to pointing your anger at your government that is leaving you out of much needed financial support for your education.&lt;/p&gt;\n\n&lt;p&gt;You used an example of a theatre arts major, as if people with financial aid don&amp;#39;t go into hard sciences. Also, it shows a prejudice that you believe humanities is not as hard as hard sciences and that somehow an engineering degree holder somehow contributes more to the world and society than a theatre arts major. While some people do coast through a humanities degree i have seen similar things from &amp;quot;genius&amp;quot; kids who are stoned all day and do no studying but ace through their hard science degree. These people don&amp;#39;t represent all people in that program. If it really were that easy everyone would do it. The other barrier to finishing a degree is that it is hard no matter what major you go for.&lt;/p&gt;\n\n&lt;p&gt;The fact that there exists a theatre arts program at your school means it is a more valuable school than if it only taught engineering. The fact that you can take a theatre arts class adds value to your education. And while you may not be in a position to pay to take a non major course, if the government was helping you pay for school you would get that chance. The fact that you get to interact and meet humanities majors adds value to your college experience that you would miss out on if you went to an all engineering school. And if you really thought about, none of us would want to live in a country where everyone had only ever studied the hard sciences.&lt;/p&gt;\n\n&lt;p&gt;The humanities are a crucial part of education for every student and I think it is the fault of a bad financial aid system that you and many other students will never get the opportunity to take advantage of those resources in college. That is what I am angry about and see as what you and other students are being denied by not having a free college system where instead of having to worry about how much debt you will be for each course you take you can instead just concentrate on the value of what is being taught to you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdupd4", "score_hidden": true, "stickied": false, "created": 1492480993.0, "created_utc": 1492452193.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dge29oe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sashimii", "parent_id": "t1_dgdrnl1", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; So I, an engineering student, have to bust my ass to do well, keep scholarships, and pay for my education, while some theater arts student gets his/her education paid for, for no other reason than how much our parents make.\n\nA post-secondary education system that is free for students would *have* to be coupled with industrial policy in order for it to be an effective one. Here's why: \n\n1. If a student or their parents pay for education, then it's a transaction between the student and the university. This means that the choice of Major rightfully lies with the student, so long as they are accepted into the University. In this case, the student or parent is subsidizing the brunt of the risk associated with outcomes related to their degree program.\n\n2. If the government pays for the education of a student, then this is a transaction between the state and the University. This means that in aggregate, students' majors are now in the public interest, and it has to be in order for such a \"Free Education\" program to be cost-effective. \n\nAs a result, a government would ideally want to ensure that their investments in education has return for the public good. Towards that end, they would have to place importance on programs which fulfill labour market needs. \n\nGiven that there are severe job shortages in Canada within certain fields of engineering (and as a theater-goer, I'm not looking to diminish the value of fine arts programs here), the government would be more inclined to fund spots in engineering schools over spots in theater arts programs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;So I, an engineering student, have to bust my ass to do well, keep scholarships, and pay for my education, while some theater arts student gets his/her education paid for, for no other reason than how much our parents make.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A post-secondary education system that is free for students would &lt;em&gt;have&lt;/em&gt; to be coupled with industrial policy in order for it to be an effective one. Here&amp;#39;s why: &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;If a student or their parents pay for education, then it&amp;#39;s a transaction between the student and the university. This means that the choice of Major rightfully lies with the student, so long as they are accepted into the University. In this case, the student or parent is subsidizing the brunt of the risk associated with outcomes related to their degree program.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If the government pays for the education of a student, then this is a transaction between the state and the University. This means that in aggregate, students&amp;#39; majors are now in the public interest, and it has to be in order for such a &amp;quot;Free Education&amp;quot; program to be cost-effective. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;As a result, a government would ideally want to ensure that their investments in education has return for the public good. Towards that end, they would have to place importance on programs which fulfill labour market needs. &lt;/p&gt;\n\n&lt;p&gt;Given that there are severe job shortages in Canada within certain fields of engineering (and as a theater-goer, I&amp;#39;m not looking to diminish the value of fine arts programs here), the government would be more inclined to fund spots in engineering schools over spots in theater arts programs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge29oe", "score_hidden": true, "stickied": false, "created": 1492489522.0, "created_utc": 1492460722.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzauo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "coolguy208", "parent_id": "t1_dgdrnl1", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So not sure if it's the same In Canada as it is in the states but in the States if you claim yourself on your taxes your parent's income is no longer a factor. I went to college twice. Once with my parents claiming me and once after my military service where I was having school paid for by the military. I claimed myself the second time and school was completely free in my state because of my low income(all of my income was tax-free so I made 0 dollars a year). So I made about 5k in free cash from the school and still made about 1500 a month from my GI bill tax-free. I made more money going to school than I did in the military.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So not sure if it&amp;#39;s the same In Canada as it is in the states but in the States if you claim yourself on your taxes your parent&amp;#39;s income is no longer a factor. I went to college twice. Once with my parents claiming me and once after my military service where I was having school paid for by the military. I claimed myself the second time and school was completely free in my state because of my low income(all of my income was tax-free so I made 0 dollars a year). So I made about 5k in free cash from the school and still made about 1500 a month from my GI bill tax-free. I made more money going to school than I did in the military.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdzauo", "score_hidden": true, "stickied": false, "created": 1492486197.0, "created_utc": 1492457397.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dgdrnoa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dgdrnl1", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/SchiferlED ([11∆](/r/changemyview/wiki/user/SchiferlED)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"SchiferlED\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/SchiferlED\"&gt;/u/SchiferlED&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/SchiferlED\"&gt;11∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22SchiferlED%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdrnoa", "score_hidden": true, "stickied": false, "created": 1492477632.0, "created_utc": 1492448832.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrnl1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ACuddlySnowBear", "parent_id": "t1_dgdq6y5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "∆\n&gt; the removal of the debt which would put more spending money in the hands of poorer college grads\n\nI guess I never realized that the money is still going to be spent, just not on education.  So you've swayed me, as long as education subsidies apply to everyone,  regardless of income level.\n\nI live in Ontario, Canada and here you can have your education subsidized as long as household combined income is below a certain cap.  You can get it completely paid for if you're under the lowest cap.  As someone who doesn't fall under those caps, it infuriates me.  It assumes that the burden of student debt falls on the parents, which it absolutely does not.  So I, an engineering student, have to bust my ass to do well, keep scholarships, and pay for my education, while some theater arts student gets his/her education paid for, for no other reason than how much our parents make.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;∆&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;the removal of the debt which would put more spending money in the hands of poorer college grads&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I guess I never realized that the money is still going to be spent, just not on education.  So you&amp;#39;ve swayed me, as long as education subsidies apply to everyone,  regardless of income level.&lt;/p&gt;\n\n&lt;p&gt;I live in Ontario, Canada and here you can have your education subsidized as long as household combined income is below a certain cap.  You can get it completely paid for if you&amp;#39;re under the lowest cap.  As someone who doesn&amp;#39;t fall under those caps, it infuriates me.  It assumes that the burden of student debt falls on the parents, which it absolutely does not.  So I, an engineering student, have to bust my ass to do well, keep scholarships, and pay for my education, while some theater arts student gets his/her education paid for, for no other reason than how much our parents make.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdrnl1", "score_hidden": true, "stickied": false, "created": 1492477629.0, "created_utc": 1492448829.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgdq6y5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SchiferlED", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Free education does not mean \"everyone gets a degree\". It just means the burden of cost is not placed on the student. The student still needs to get accepted to the school and perform well in classes to graduate with a degree. It would not change much because as it is now, pretty much everyone has to get a degree to get a decent job, so everyone goes into debt to get one. The only change would be the removal of the debt which would put more spending money in the hands of poorer college grads, thus better for the economy.\n\nI don't think it's fair to compare the US to Trinidad and Tobago in terms of quality of education and effort required to graduate, but I'd be willing to be proven wrong.\n\nAlso, unemployment due to overabundance of labor should not be seen as a problem. That is a good state for a society to be in. It just means that said society needs to actually provide for the needs of its citizens when there are not jobs that need to be done by them.", "edited": 1492447390.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Free education does not mean &amp;quot;everyone gets a degree&amp;quot;. It just means the burden of cost is not placed on the student. The student still needs to get accepted to the school and perform well in classes to graduate with a degree. It would not change much because as it is now, pretty much everyone has to get a degree to get a decent job, so everyone goes into debt to get one. The only change would be the removal of the debt which would put more spending money in the hands of poorer college grads, thus better for the economy.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think it&amp;#39;s fair to compare the US to Trinidad and Tobago in terms of quality of education and effort required to graduate, but I&amp;#39;d be willing to be proven wrong.&lt;/p&gt;\n\n&lt;p&gt;Also, unemployment due to overabundance of labor should not be seen as a problem. That is a good state for a society to be in. It just means that said society needs to actually provide for the needs of its citizens when there are not jobs that need to be done by them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdq6y5", "score_hidden": true, "stickied": false, "created": 1492476009.0, "created_utc": 1492447209.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dge7oy3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MuaddibMcFly", "parent_id": "t1_dgds120", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Doesn't that mean you owe Fizzy_T a delta?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Doesn&amp;#39;t that mean you owe Fizzy_T a delta?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge7oy3", "score_hidden": true, "stickied": false, "created": 1492495958.0, "created_utc": 1492467158.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgds120", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ACuddlySnowBear", "parent_id": "t1_dgdren7", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Hmph, I guess it doesn't.  I guess it's more of a concern when education isn't free, and only those who can afford it have a fighting chance.  Touche", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmph, I guess it doesn&amp;#39;t.  I guess it&amp;#39;s more of a concern when education isn&amp;#39;t free, and only those who can afford it have a fighting chance.  Touche&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgds120", "score_hidden": true, "stickied": false, "created": 1492478049.0, "created_utc": 1492449249.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdren7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Fizzy_T", "parent_id": "t1_dgdqy0e", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Why does that affect the number of available jobs*? \n\nWhoops, missed a word", "edited": 1492449323.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why does that affect the number of available jobs*? &lt;/p&gt;\n\n&lt;p&gt;Whoops, missed a word&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdren7", "score_hidden": true, "stickied": false, "created": 1492477350.0, "created_utc": 1492448550.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqy0e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ACuddlySnowBear", "parent_id": "t1_dgdq2wx", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Because it requires people to stay in school longer to get decent jobs.  If everyone has a bachelor's degree, why would you hire someone without one?  Want to assure you get a job?  Now you have to set yourself apart by getting a second degree or a graduate degree.  That takes time, and while the education may be free, you're losing years that could have been spent earning.  \n\nI absolutely believe that people should learn and get educated, but if they're just going to end up in low paying jobs that have nothing to do with their degrees, what's the point of going to university?  There isn't one, but if it's free, there's going to be pressure to go, and people (not everyone) are going to waste 4 years of their lives.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because it requires people to stay in school longer to get decent jobs.  If everyone has a bachelor&amp;#39;s degree, why would you hire someone without one?  Want to assure you get a job?  Now you have to set yourself apart by getting a second degree or a graduate degree.  That takes time, and while the education may be free, you&amp;#39;re losing years that could have been spent earning.  &lt;/p&gt;\n\n&lt;p&gt;I absolutely believe that people should learn and get educated, but if they&amp;#39;re just going to end up in low paying jobs that have nothing to do with their degrees, what&amp;#39;s the point of going to university?  There isn&amp;#39;t one, but if it&amp;#39;s free, there&amp;#39;s going to be pressure to go, and people (not everyone) are going to waste 4 years of their lives.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdqy0e", "score_hidden": true, "stickied": false, "created": 1492476836.0, "created_utc": 1492448036.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdq2wx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Fizzy_T", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Consider a situation where secondary school isn't free where you live. You travel somewhere it is free and ask since they have free secondary school don't they have a low unemployment rate? Regardless of the answer, does that affect your opinion on the need for free secondary school?\n\n&gt;Fail? Take it again, its free. Doing poorly? Who cares, not like you're losing anything. I know you're about to say, \"well the people who are going to university are the people who want to go to university\".\n\nFree doesn't mean no requirements. You could set requirements that force attendance, OK grades, etc. Sure, you may get a lot of drop-outs for first year students. But that is also true when it is paid for. Or you could set requirements to get into the school, requiring certain grades and attendance in secondary school. Just because one country may do it a certain way doesn't mean someone else can improve on it.\n\n&gt; Free post-secondary education only worsens un/underemployment\n\nWhy? ", "edited": 1492451446.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Consider a situation where secondary school isn&amp;#39;t free where you live. You travel somewhere it is free and ask since they have free secondary school don&amp;#39;t they have a low unemployment rate? Regardless of the answer, does that affect your opinion on the need for free secondary school?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Fail? Take it again, its free. Doing poorly? Who cares, not like you&amp;#39;re losing anything. I know you&amp;#39;re about to say, &amp;quot;well the people who are going to university are the people who want to go to university&amp;quot;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Free doesn&amp;#39;t mean no requirements. You could set requirements that force attendance, OK grades, etc. Sure, you may get a lot of drop-outs for first year students. But that is also true when it is paid for. Or you could set requirements to get into the school, requiring certain grades and attendance in secondary school. Just because one country may do it a certain way doesn&amp;#39;t mean someone else can improve on it.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Free post-secondary education only worsens un/underemployment&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Why? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdq2wx", "score_hidden": true, "stickied": false, "created": 1492475883.0, "created_utc": 1492447083.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgdocwt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "McKoijion", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Many countries have free secondary education. It didn't change the unemployment rate, but everyone's jobs became much nicer. Instead of doing manual labor in the fields, people moved on to service sector jobs. Free post-secondary education works the same way. The unemployment ratio would probably stay the same, but everyone would move on to crummy service sector jobs to technical jobs.\n\nAt the end of the day, education is always good for the economy in the long run because it allows people to be more productive. One uneducated farmer can till an acre. A farmer who learns animal husbandry can till 40 acres. A farmer who becomes an engineer and makes tractors can help other farmers till 400 acres. And an engineer who develops robots can till 4000 acres. Anything that allows fewer people do to more is a net boon for the economy. Increasing productivity and reducing inefficiency is the hallmark of a growing economy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Many countries have free secondary education. It didn&amp;#39;t change the unemployment rate, but everyone&amp;#39;s jobs became much nicer. Instead of doing manual labor in the fields, people moved on to service sector jobs. Free post-secondary education works the same way. The unemployment ratio would probably stay the same, but everyone would move on to crummy service sector jobs to technical jobs.&lt;/p&gt;\n\n&lt;p&gt;At the end of the day, education is always good for the economy in the long run because it allows people to be more productive. One uneducated farmer can till an acre. A farmer who learns animal husbandry can till 40 acres. A farmer who becomes an engineer and makes tractors can help other farmers till 400 acres. And an engineer who develops robots can till 4000 acres. Anything that allows fewer people do to more is a net boon for the economy. Increasing productivity and reducing inefficiency is the hallmark of a growing economy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdocwt", "score_hidden": true, "stickied": false, "created": 1492473954.0, "created_utc": 1492445154.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgdo8gw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hq3473", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It's not a zero-sum game.\n\nThere is not a fixed number of \"good jobs\" people have to complete over.  Economies where people are more educated will create more new business that will in turn produce more jobs.  \n\nThe amount of education people get correlates with wealth of a nation in pretty straight-forward manned for both developed and developing countries.\n\nhttp://huebler.blogspot.com/2008/08/wealth.html\n\nKey finding \"Countries with a highly educated work force can achieve higher economic growth rates .\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not a zero-sum game.&lt;/p&gt;\n\n&lt;p&gt;There is not a fixed number of &amp;quot;good jobs&amp;quot; people have to complete over.  Economies where people are more educated will create more new business that will in turn produce more jobs.  &lt;/p&gt;\n\n&lt;p&gt;The amount of education people get correlates with wealth of a nation in pretty straight-forward manned for both developed and developing countries.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://huebler.blogspot.com/2008/08/wealth.html\"&gt;http://huebler.blogspot.com/2008/08/wealth.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Key finding &amp;quot;Countries with a highly educated work force can achieve higher economic growth rates .&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdo8gw", "score_hidden": true, "stickied": false, "created": 1492473813.0, "created_utc": 1492445013.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dgdz18d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WatchHimAsHeGoes", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "As someone from a country (Scotland) where post secondary education is free, I hope I can give some perspective. \n\nThere are rules for being eligible, but generally if your under 25, living in Scotland for over 3 years and not been out with education for 3 years then you can get free tuition to college or university. \n\nNow although tuition is free, living costs, transportation, supplies, etc. are not. This can still be costly even if you are living on campus. Student loans are relatively easily to get (dependent on parents/carers income) but these will be paid back through your working wage once you earn over a certain amount. \n\nIn Scotland our unemployment rate is 4.9% (approximately 135,000) as of December 2016. Although this has risen, the numbers are minor and given our current situation (Brexit, etc) people are suffering so I doubt this is purely based on free tuition. \n\nI think the real problem with employers wanting multiple degrees before they employ people is because degrees have less value now because secondary schools are pushing everyone into higher education regardless of what might help the pupil more (as a teacher I see this everyday!). Unfortunately people are told that to get a job you need a degree, when people get their degree, one is no longer enough!\n\nAs someone who benefitted from free tuition and couldn't have afforded University without it, I hope it continues! (Although our current issue is how to afford it to allow it to continue it!)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone from a country (Scotland) where post secondary education is free, I hope I can give some perspective. &lt;/p&gt;\n\n&lt;p&gt;There are rules for being eligible, but generally if your under 25, living in Scotland for over 3 years and not been out with education for 3 years then you can get free tuition to college or university. &lt;/p&gt;\n\n&lt;p&gt;Now although tuition is free, living costs, transportation, supplies, etc. are not. This can still be costly even if you are living on campus. Student loans are relatively easily to get (dependent on parents/carers income) but these will be paid back through your working wage once you earn over a certain amount. &lt;/p&gt;\n\n&lt;p&gt;In Scotland our unemployment rate is 4.9% (approximately 135,000) as of December 2016. Although this has risen, the numbers are minor and given our current situation (Brexit, etc) people are suffering so I doubt this is purely based on free tuition. &lt;/p&gt;\n\n&lt;p&gt;I think the real problem with employers wanting multiple degrees before they employ people is because degrees have less value now because secondary schools are pushing everyone into higher education regardless of what might help the pupil more (as a teacher I see this everyday!). Unfortunately people are told that to get a job you need a degree, when people get their degree, one is no longer enough!&lt;/p&gt;\n\n&lt;p&gt;As someone who benefitted from free tuition and couldn&amp;#39;t have afforded University without it, I hope it continues! (Although our current issue is how to afford it to allow it to continue it!)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdz18d", "score_hidden": true, "stickied": false, "created": 1492485892.0, "created_utc": 1492457092.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dgdtu0g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "-Avacyn", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I don't know about the situation in Trinidad and Tobago, but I'm from Europe, where many countries offer free higher education, or highly subsidized higher education. (My own country falls in the second category, where students pay 2k a year themselves, and the government another 10k a year directly to the university for each student).\n\nI think you are missing out on one very big important difference between many countries that offer free higher education and the US: in the US, practically EVERYONE gets to go to college. In Europe, this is not the case. Many countries have streamlined systems in which there are different 'levels' of high school, and only the highest gets you into university. The lower levels get you into more vocational type tertiary education (also free). So if you want to get a university degree, you need to perform really well academically for 6 years at high school to get your highest level high school diploma (while not be 'demoted' to a lower level). There is also very little difference between high school curricula, as usually the government is in control of a large part of the curricula and parts of the formal examinations that get you your diploma. Your argument of 'but in that case everybody would get a higher education diploma, lowering the standard' doesn't hold up. The percentages of people going to university vs. vocational education can be very tightly regulated by tightly regulating the examination standards.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know about the situation in Trinidad and Tobago, but I&amp;#39;m from Europe, where many countries offer free higher education, or highly subsidized higher education. (My own country falls in the second category, where students pay 2k a year themselves, and the government another 10k a year directly to the university for each student).&lt;/p&gt;\n\n&lt;p&gt;I think you are missing out on one very big important difference between many countries that offer free higher education and the US: in the US, practically EVERYONE gets to go to college. In Europe, this is not the case. Many countries have streamlined systems in which there are different &amp;#39;levels&amp;#39; of high school, and only the highest gets you into university. The lower levels get you into more vocational type tertiary education (also free). So if you want to get a university degree, you need to perform really well academically for 6 years at high school to get your highest level high school diploma (while not be &amp;#39;demoted&amp;#39; to a lower level). There is also very little difference between high school curricula, as usually the government is in control of a large part of the curricula and parts of the formal examinations that get you your diploma. Your argument of &amp;#39;but in that case everybody would get a higher education diploma, lowering the standard&amp;#39; doesn&amp;#39;t hold up. The percentages of people going to university vs. vocational education can be very tightly regulated by tightly regulating the examination standards.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdtu0g", "score_hidden": true, "stickied": false, "created": 1492480044.0, "created_utc": 1492451244.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dgdx4cz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "snark_attak", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "First of all, what does \"free post-secondary education\" mean? Tuition is free? All costs are covered? I believe most \"free college\" plans do **not** include room and board, which is a non-trivial cost for most college students. Also, what are the limitations? Can you just stay in school indefinitely, changing majors or adding degrees every few years? Not sure any proposed plans are for *unlimited* free tuition. The ones I've see described are for two or four years, which implies that if you take more time (either due to taking a lighter load or repeating some classes), you're on the hook for tuition for the additional semesters. And maintaining acceptable academic performance seems likely to be included as well, though I have not seen specifics on that.\n\nTo address your first point, the number of jobs available is not likely to be affected by the number of potential applicants with degrees, so free college should really not be a factor there.\n\nAs to your second point:\n\n&gt; you have nothing on the line. Fail? Take it again, its free\n\nThis assumes there are no costs, but room and board often make up more than half the cost of higher education. Plus, there will probably be at least as many, if not more/higher fees. It also assumes there is no penalty for poor academic performance. Even if the government-paid tuition program does not address it, in most schools flunking out will still be a thing. In fact, reducing the cost to the student might make schools more academically competitive.\n\n&gt; you're going to see the kids who didn't care in high school and only went because they were forced to do the same in universities.\n\nIf cost is less of a barrier, won't that make admissions more competitive? Smart, hardworking kids who would not even bother applying to some schools due to the high tuition cost will be less financially limited, while the slacker kids will likely have even fewer options because there will be a larger applicant pool competing for a similar number of spots.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First of all, what does &amp;quot;free post-secondary education&amp;quot; mean? Tuition is free? All costs are covered? I believe most &amp;quot;free college&amp;quot; plans do &lt;strong&gt;not&lt;/strong&gt; include room and board, which is a non-trivial cost for most college students. Also, what are the limitations? Can you just stay in school indefinitely, changing majors or adding degrees every few years? Not sure any proposed plans are for &lt;em&gt;unlimited&lt;/em&gt; free tuition. The ones I&amp;#39;ve see described are for two or four years, which implies that if you take more time (either due to taking a lighter load or repeating some classes), you&amp;#39;re on the hook for tuition for the additional semesters. And maintaining acceptable academic performance seems likely to be included as well, though I have not seen specifics on that.&lt;/p&gt;\n\n&lt;p&gt;To address your first point, the number of jobs available is not likely to be affected by the number of potential applicants with degrees, so free college should really not be a factor there.&lt;/p&gt;\n\n&lt;p&gt;As to your second point:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;you have nothing on the line. Fail? Take it again, its free&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This assumes there are no costs, but room and board often make up more than half the cost of higher education. Plus, there will probably be at least as many, if not more/higher fees. It also assumes there is no penalty for poor academic performance. Even if the government-paid tuition program does not address it, in most schools flunking out will still be a thing. In fact, reducing the cost to the student might make schools more academically competitive.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;you&amp;#39;re going to see the kids who didn&amp;#39;t care in high school and only went because they were forced to do the same in universities.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If cost is less of a barrier, won&amp;#39;t that make admissions more competitive? Smart, hardworking kids who would not even bother applying to some schools due to the high tuition cost will be less financially limited, while the slacker kids will likely have even fewer options because there will be a larger applicant pool competing for a similar number of spots.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdx4cz", "score_hidden": true, "stickied": false, "created": 1492483715.0, "created_utc": 1492454915.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dgdstn2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "three-one-seven", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Good jobs that at one time required no degree are becoming harder to get as education gets cheaper.\n\nEducation isn't getting cheaper, it's gotten disproportionately more expensive over the last few generations. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Good jobs that at one time required no degree are becoming harder to get as education gets cheaper.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Education isn&amp;#39;t getting cheaper, it&amp;#39;s gotten disproportionately more expensive over the last few generations. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdstn2", "score_hidden": true, "stickied": false, "created": 1492478932.0, "created_utc": 1492450132.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dge7z2n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "legallyhomo", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "More of a comment rather than an argument but:\n\n\nAs it has been said, free doesn't mean illimited. In Brazil we have both government-funded universities (that are usually considered more prestigious) and private universities (paid by students).\n\n\nIt is really hard to get into a public universities, especially if you're going for med/law/engineering, and mostly the people who get in are the ones that had access to private high-schools (here, it's the opposite, since private ones are usually considered better than public ones).\n\n\nAlso, while it is true that some people slack off, there are rules in place to avoid this, such as having a maximum number of semesters to complete the course and in most public universities if you fail a mandatory course more than twice you are usually expelled.\n\n\nI'd say in most cases it's much easier to get by on private universities, because as long as you're paying, they mostly don't give a shit about anything else.\n\n\nWe do have a problem of oversaturation of the market, but at least in my field (law), it's not because there are free universities, but because regulation on law schools is really fragile and anyone can open one (IIRC, on a study conducted a couple years ago, they found that brazil alone had more than half the law schools of the entire world)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;More of a comment rather than an argument but:&lt;/p&gt;\n\n&lt;p&gt;As it has been said, free doesn&amp;#39;t mean illimited. In Brazil we have both government-funded universities (that are usually considered more prestigious) and private universities (paid by students).&lt;/p&gt;\n\n&lt;p&gt;It is really hard to get into a public universities, especially if you&amp;#39;re going for med/law/engineering, and mostly the people who get in are the ones that had access to private high-schools (here, it&amp;#39;s the opposite, since private ones are usually considered better than public ones).&lt;/p&gt;\n\n&lt;p&gt;Also, while it is true that some people slack off, there are rules in place to avoid this, such as having a maximum number of semesters to complete the course and in most public universities if you fail a mandatory course more than twice you are usually expelled.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d say in most cases it&amp;#39;s much easier to get by on private universities, because as long as you&amp;#39;re paying, they mostly don&amp;#39;t give a shit about anything else.&lt;/p&gt;\n\n&lt;p&gt;We do have a problem of oversaturation of the market, but at least in my field (law), it&amp;#39;s not because there are free universities, but because regulation on law schools is really fragile and anyone can open one (IIRC, on a study conducted a couple years ago, they found that brazil alone had more than half the law schools of the entire world)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge7z2n", "score_hidden": true, "stickied": false, "created": 1492496313.0, "created_utc": 1492467513.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dge1kfm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aleph473", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Fail? Take it again, its free.\n\nNo,  it's not.  Going to college is an investment of time no matter how much or how little it costs. If you dick around and can't pass a class, then it means that you need to stay for at least an extra semester before you can.  That has real opportunity costs.\n\nAlso, a bad transcript is something that's going to stick with you and hurt you.  When you go in to apply to a job, you're going to be asked about why you weren't passing your courses, and that's going to reflect poorly on your work ethic and make it harder to get fired.\n\nSo there's always going to be something on the line.  But making the stakes just a little bit lower could also take off some of the pressure and allow students to perform better.\n\n&gt; Because it's free, their parents will make them go\n\nUniversities have a finite number of positions for students, so they will always have to be selective in who is able to go.  Arguably, making college free would actually improve the student talent pool by increasing the number of prospective students for the same number of positions.  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Fail? Take it again, its free.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No,  it&amp;#39;s not.  Going to college is an investment of time no matter how much or how little it costs. If you dick around and can&amp;#39;t pass a class, then it means that you need to stay for at least an extra semester before you can.  That has real opportunity costs.&lt;/p&gt;\n\n&lt;p&gt;Also, a bad transcript is something that&amp;#39;s going to stick with you and hurt you.  When you go in to apply to a job, you&amp;#39;re going to be asked about why you weren&amp;#39;t passing your courses, and that&amp;#39;s going to reflect poorly on your work ethic and make it harder to get fired.&lt;/p&gt;\n\n&lt;p&gt;So there&amp;#39;s always going to be something on the line.  But making the stakes just a little bit lower could also take off some of the pressure and allow students to perform better.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Because it&amp;#39;s free, their parents will make them go&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Universities have a finite number of positions for students, so they will always have to be selective in who is able to go.  Arguably, making college free would actually improve the student talent pool by increasing the number of prospective students for the same number of positions.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge1kfm", "score_hidden": true, "stickied": false, "created": 1492488746.0, "created_utc": 1492459946.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dge87s9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MuaddibMcFly", "parent_id": "t1_dgdrx7q", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;  The argument would go, \"I pay my taxes, I should have access to post-secondary schools.\" \n\nYou do have access: *anybody* can apply.  Should a 17 y/o who dropped out of HS at 14, and has been working (and paying taxes) since then be guaranteed a spot, despite not even bothering to get their diploma or equivalent?  What about the well-off applicant that can pay the tuition out of pocket, but can't do basic algebra, nor write a coherent application essay?\n\nOutside of \"Donations,\" money has *never* been the primary criterion for choosing between applicants.\n\n--\n\nI don't think you're looking at this the right way.  After all, under the current paradigm, there *already are* 5k people who would like to go to college, but can't.  \n\nThe biggest (only?) difference between now and \"free post-secondary education\" would be that you wouldn't have people deciding not to apply because they couldn't afford to go.\n\nAfter all, is it *really* good for society to limit education to the top 5,000 *who are willing to take on debt?*   Should financial concerns really be a more powerful gatekeeper as to who is accepted to an engineering program than measures of competence?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The argument would go, &amp;quot;I pay my taxes, I should have access to post-secondary schools.&amp;quot; &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You do have access: &lt;em&gt;anybody&lt;/em&gt; can apply.  Should a 17 y/o who dropped out of HS at 14, and has been working (and paying taxes) since then be guaranteed a spot, despite not even bothering to get their diploma or equivalent?  What about the well-off applicant that can pay the tuition out of pocket, but can&amp;#39;t do basic algebra, nor write a coherent application essay?&lt;/p&gt;\n\n&lt;p&gt;Outside of &amp;quot;Donations,&amp;quot; money has &lt;em&gt;never&lt;/em&gt; been the primary criterion for choosing between applicants.&lt;/p&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;p&gt;I don&amp;#39;t think you&amp;#39;re looking at this the right way.  After all, under the current paradigm, there &lt;em&gt;already are&lt;/em&gt; 5k people who would like to go to college, but can&amp;#39;t.  &lt;/p&gt;\n\n&lt;p&gt;The biggest (only?) difference between now and &amp;quot;free post-secondary education&amp;quot; would be that you wouldn&amp;#39;t have people deciding not to apply because they couldn&amp;#39;t afford to go.&lt;/p&gt;\n\n&lt;p&gt;After all, is it &lt;em&gt;really&lt;/em&gt; good for society to limit education to the top 5,000 &lt;em&gt;who are willing to take on debt?&lt;/em&gt;   Should financial concerns really be a more powerful gatekeeper as to who is accepted to an engineering program than measures of competence?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge87s9", "score_hidden": true, "stickied": false, "created": 1492496622.0, "created_utc": 1492467822.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dgdtsxl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Huntingmoa", "parent_id": "t1_dgdtg7a", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Do you think the idea as I proposed it would be bad for the economy? I mean if free college came with say 2 years of minimum living wage service (in a non-military so that people who don’t want to be violent don’t have to be), address your suggestions?\n\nPeople with money can totally pay for it, nothing says having free education means it’s the only education allowed (or people could even go abroad). People who want it free can have it for free, but the society gets something back too. It wouldn’t lead to repeat takers, unless they do repeat service obligations (and minimum living wage makes that unattractive). \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you think the idea as I proposed it would be bad for the economy? I mean if free college came with say 2 years of minimum living wage service (in a non-military so that people who don’t want to be violent don’t have to be), address your suggestions?&lt;/p&gt;\n\n&lt;p&gt;People with money can totally pay for it, nothing says having free education means it’s the only education allowed (or people could even go abroad). People who want it free can have it for free, but the society gets something back too. It wouldn’t lead to repeat takers, unless they do repeat service obligations (and minimum living wage makes that unattractive). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdtsxl", "score_hidden": true, "stickied": false, "created": 1492480010.0, "created_utc": 1492451210.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtg7a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ACuddlySnowBear", "parent_id": "t1_dgdt4cb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I like that idea.  I hate the idea of it being based on household income as it is right now in my province.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like that idea.  I hate the idea of it being based on household income as it is right now in my province.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdtg7a", "score_hidden": true, "stickied": false, "created": 1492479620.0, "created_utc": 1492450820.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdt4cb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Huntingmoa", "parent_id": "t1_dgdsuo7", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; I'm not saying it would have to be the case, but it's a question that would have to be answered. No one would want to pay for a service for which they're not eligible. It's my understanding that everyone is eligible for medicare once they hit 65. I'm from Canada so I'm not very familiar. Personally I don't think health care is a viable comparison, because not having access to post-secondary education doesn't put your life at risk. \n\n\nSorry, I didn’t read you were in Canada, I saw you were in NA in the OP and made an assumption. \n\nLook at current government scholarships. They can be for specific purposes or objectives. For example, in the US if you join the armed services, you get some proportion of tuition paid for. One way to get more free education would be to expand some program like this, to allow for a term of civil service, infrastructure construction, etc. Think like FDR’s new deal.\n\nNothing says it has to be no strings attached, nothing says it has to be everyone. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m not saying it would have to be the case, but it&amp;#39;s a question that would have to be answered. No one would want to pay for a service for which they&amp;#39;re not eligible. It&amp;#39;s my understanding that everyone is eligible for medicare once they hit 65. I&amp;#39;m from Canada so I&amp;#39;m not very familiar. Personally I don&amp;#39;t think health care is a viable comparison, because not having access to post-secondary education doesn&amp;#39;t put your life at risk. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sorry, I didn’t read you were in Canada, I saw you were in NA in the OP and made an assumption. &lt;/p&gt;\n\n&lt;p&gt;Look at current government scholarships. They can be for specific purposes or objectives. For example, in the US if you join the armed services, you get some proportion of tuition paid for. One way to get more free education would be to expand some program like this, to allow for a term of civil service, infrastructure construction, etc. Think like FDR’s new deal.&lt;/p&gt;\n\n&lt;p&gt;Nothing says it has to be no strings attached, nothing says it has to be everyone. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdt4cb", "score_hidden": true, "stickied": false, "created": 1492479263.0, "created_utc": 1492450463.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdsuo7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ACuddlySnowBear", "parent_id": "t1_dgds7j5", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm not saying it would have to be the case, but it's a question that would have to be answered.  No one would want to pay for a service for which they're not eligible.  It's my understanding that everyone is eligible for medicare once they hit 65.  I'm from Canada so I'm not very familiar.  Personally I don't think health care is a viable comparison, because not having access to post-secondary education doesn't put your life at risk.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not saying it would have to be the case, but it&amp;#39;s a question that would have to be answered.  No one would want to pay for a service for which they&amp;#39;re not eligible.  It&amp;#39;s my understanding that everyone is eligible for medicare once they hit 65.  I&amp;#39;m from Canada so I&amp;#39;m not very familiar.  Personally I don&amp;#39;t think health care is a viable comparison, because not having access to post-secondary education doesn&amp;#39;t put your life at risk.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdsuo7", "score_hidden": true, "stickied": false, "created": 1492478965.0, "created_utc": 1492450165.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgds7j5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Huntingmoa", "parent_id": "t1_dgdrx7q", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;do we have to assure everyone has access, like elementary and secondary schools?\n\nI don’t think it has to be an universal access program, as long as the requirements for entrance are transparent and non-judgemental. \n\nLook at medicare: it’s a government run program but not everyone can join (need to be over 65).  \n\nWas that part of your OP? Because I didn’t assume it. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;do we have to assure everyone has access, like elementary and secondary schools?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don’t think it has to be an universal access program, as long as the requirements for entrance are transparent and non-judgemental. &lt;/p&gt;\n\n&lt;p&gt;Look at medicare: it’s a government run program but not everyone can join (need to be over 65).  &lt;/p&gt;\n\n&lt;p&gt;Was that part of your OP? Because I didn’t assume it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgds7j5", "score_hidden": true, "stickied": false, "created": 1492478246.0, "created_utc": 1492449446.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrx7q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ACuddlySnowBear", "parent_id": "t1_dgdqpld", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "That highlights more problems.\n\n&gt;10,000 people competing for 5000 slots\n\nSo if it's going to be a government paid service, do we have to assure everyone has access, like elementary and secondary schools?  The argument would go, \"I pay my taxes, I should have access to post-secondary schools.\"  So now we have to create schools, which costs more money.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That highlights more problems.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;10,000 people competing for 5000 slots&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So if it&amp;#39;s going to be a government paid service, do we have to assure everyone has access, like elementary and secondary schools?  The argument would go, &amp;quot;I pay my taxes, I should have access to post-secondary schools.&amp;quot;  So now we have to create schools, which costs more money.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdrx7q", "score_hidden": true, "stickied": false, "created": 1492477930.0, "created_utc": 1492449130.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqpld", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Huntingmoa", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Assuming that's true, which from my experience it isn't, once education is free, you're going to see the kids who didn't care in high school and only went because they were forced to do the same in universities.\n\nJust because there is no financial burden on post-secondary education, doesn’t mean there aren’t other barriers (like test scores, essays, interviews etc). Think of it like this:\n\nThere are a limited number of slots in post-secondary education\n\nThe more people who compete for these slots, the higher quality of candidates that are accepted\n\nIf you have 5,000 people applying for 5,000 slots, that’s different from 10,000 people from 5,000 slots", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Assuming that&amp;#39;s true, which from my experience it isn&amp;#39;t, once education is free, you&amp;#39;re going to see the kids who didn&amp;#39;t care in high school and only went because they were forced to do the same in universities.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Just because there is no financial burden on post-secondary education, doesn’t mean there aren’t other barriers (like test scores, essays, interviews etc). Think of it like this:&lt;/p&gt;\n\n&lt;p&gt;There are a limited number of slots in post-secondary education&lt;/p&gt;\n\n&lt;p&gt;The more people who compete for these slots, the higher quality of candidates that are accepted&lt;/p&gt;\n\n&lt;p&gt;If you have 5,000 people applying for 5,000 slots, that’s different from 10,000 people from 5,000 slots&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdqpld", "score_hidden": true, "stickied": false, "created": 1492476575.0, "created_utc": 1492447775.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dge7n7x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anonoman925", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It used to be that you could get by with an 8th grade education. \n\nThen a high school education. \n\nNow it's looking like you need a 4 yr degree. \n\nBut we don't question why high school is 'free'. \n\nAt least the first two years of college should be free. 60% of high school kids are not ready for college. That's a burden that should be on the State, not the individual. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It used to be that you could get by with an 8th grade education. &lt;/p&gt;\n\n&lt;p&gt;Then a high school education. &lt;/p&gt;\n\n&lt;p&gt;Now it&amp;#39;s looking like you need a 4 yr degree. &lt;/p&gt;\n\n&lt;p&gt;But we don&amp;#39;t question why high school is &amp;#39;free&amp;#39;. &lt;/p&gt;\n\n&lt;p&gt;At least the first two years of college should be free. 60% of high school kids are not ready for college. That&amp;#39;s a burden that should be on the State, not the individual. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge7n7x", "score_hidden": true, "stickied": false, "created": 1492495894.0, "created_utc": 1492467094.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dge0b5i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "brouwjon", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I agree, it shouldn't be free. But it should be cheap. \n\nWe want the labor market to be well-supplied. But the cost of getting capital in that market (a degree) is insane. Engineers, lawyers, doctors, data analysts, etc. The economy is better if these positions are filled, so let's get the labor market flowing and make college tuition affordable. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree, it shouldn&amp;#39;t be free. But it should be cheap. &lt;/p&gt;\n\n&lt;p&gt;We want the labor market to be well-supplied. But the cost of getting capital in that market (a degree) is insane. Engineers, lawyers, doctors, data analysts, etc. The economy is better if these positions are filled, so let&amp;#39;s get the labor market flowing and make college tuition affordable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge0b5i", "score_hidden": true, "stickied": false, "created": 1492487330.0, "created_utc": 1492458530.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dge03m1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Brimjobtime", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Good jobs that at one time required no degree are becoming harder to get as education gets cheaper. \n\nIn what world do you live that education is getting cheaper in the US?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Good jobs that at one time required no degree are becoming harder to get as education gets cheaper. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In what world do you live that education is getting cheaper in the US?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge03m1", "score_hidden": true, "stickied": false, "created": 1492487094.0, "created_utc": 1492458294.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dge3jsg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LambachRuthven", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "That is already the problem here.  Any job that pays a living wage requires a degree or certificate of further education. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is already the problem here.  Any job that pays a living wage requires a degree or certificate of further education. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge3jsg", "score_hidden": true, "stickied": false, "created": 1492490953.0, "created_utc": 1492462153.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wdqq", "likes": null, "replies": "", "user_reports": [], "id": "dgdotsb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "verfmeer", "parent_id": "t3_65wdqq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Having no tuition fees doesn't mean studying is free. You still need to support yourself for the years you're not working. Study books, rent, food and health inscurance can easily cost 1000 dollar/month. That means that a 4 year program still sets you back 48,000 dollar. If you fail to much and need an extra year that's another 12.000 dollar. That is a hefty price to pay, and people are only paying it if they expect to get returns from it.\n\nFor motivation we have other options that tuition fees to guarantee that students are motivated. If the course is at the right level slacking off means that you won't be able to follow the lectures and fail the course. At my university people who fail too much courses in their first year have to quit their program and can't join for the next 4 years. So people who don't want to work for their education will be leave the university pretty quickly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having no tuition fees doesn&amp;#39;t mean studying is free. You still need to support yourself for the years you&amp;#39;re not working. Study books, rent, food and health inscurance can easily cost 1000 dollar/month. That means that a 4 year program still sets you back 48,000 dollar. If you fail to much and need an extra year that&amp;#39;s another 12.000 dollar. That is a hefty price to pay, and people are only paying it if they expect to get returns from it.&lt;/p&gt;\n\n&lt;p&gt;For motivation we have other options that tuition fees to guarantee that students are motivated. If the course is at the right level slacking off means that you won&amp;#39;t be able to follow the lectures and fail the course. At my university people who fail too much courses in their first year have to quit their program and can&amp;#39;t join for the next 4 years. So people who don&amp;#39;t want to work for their education will be leave the university pretty quickly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdotsb", "score_hidden": true, "stickied": false, "created": 1492474489.0, "created_utc": 1492445689.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]