[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I participate in online discussions often, and there is usually a common thread to when they derail. If a person ends up using a fallacious argument, I call them on it directly and explain why it is fallacious. A few things can happen from this point:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;The person admits their mistake and pursues a new avenue for their position.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The person does not understand why their argument is fallacious.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The person reacts defensively and denies that the argument is fallacious, even though it definitly is.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Option 1 is exceedingly rare, because while it is demonstrable that the argument is fallacious the source of the fallacious argument is based on the arguer&amp;#39;s fallacious logic or reckoning of events. For one to understand why their argument is fallacious, they need to reconcile why they&amp;#39;ve come to the poor conclusion that their argument was valid.&lt;/p&gt;\n\n&lt;p&gt;Option 2 and 3 are more common. Worse, Option 2 rarely leads to the first outcome. Instead, not understanding why in my experience usually leads to Option 3, for the same reason that Option 1 is rare.&lt;/p&gt;\n\n&lt;p&gt;Given the above, calling out fallacious arguments rarely leads to a positive effect in the discussion, no matter how true the accusation is.&lt;/p&gt;\n\n&lt;p&gt;This leads to uncomfortable conclusions. If a person is making a fallacious argument, more often than not this doesn&amp;#39;t lead to any ground gained if they are called out. Worse, a person behaving according to option 3 is liable to be arguing dishonestly or in bad faith to waste your time or to attempt to aggravate you. Pointing out a fallacious argument becomes useless. But the problem with a fallacious argument is that it privileges logic in favor of the fallacious argument in that it takes liberty with what is and is not valid. The person making the fallacious argument if not called out on it has an advantage over the other because they are using privileged logic. The conversation can&amp;#39;t continue unless the flaw in logic is pointed out. &lt;/p&gt;\n\n&lt;p&gt;To me, it is possible to infer a best course of action from the above information:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;If I notice a person arguing fallaciously, call it out by demonstrating why it is fallacious.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If the person appears to not understand the accusation, try to correct misunderstandings one more time.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If the person ever tries to turn the accusation back on you or defend the argument as not fallacious immediately disengage.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;To CMV, contend with my reckoning of what options are available to  interlocutor&amp;#39;s after a fallacious argument has been pointed out or their relative rarity, contend with the conclusions based on that information, or contend with the best course of action I laid out in response.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I participate in online discussions often, and there is usually a common thread to when they derail. If a person ends up using a fallacious argument, I call them on it directly and explain why it is fallacious. A few things can happen from this point:\n\n1. The person admits their mistake and pursues a new avenue for their position.\n\n2. The person does not understand why their argument is fallacious.\n\n3. The person reacts defensively and denies that the argument is fallacious, even though it definitly is.\n\nOption 1 is exceedingly rare, because while it is demonstrable that the argument is fallacious the source of the fallacious argument is based on the arguer's fallacious logic or reckoning of events. For one to understand why their argument is fallacious, they need to reconcile why they've come to the poor conclusion that their argument was valid.\n\nOption 2 and 3 are more common. Worse, Option 2 rarely leads to the first outcome. Instead, not understanding why in my experience usually leads to Option 3, for the same reason that Option 1 is rare.\n\nGiven the above, calling out fallacious arguments rarely leads to a positive effect in the discussion, no matter how true the accusation is.\n\nThis leads to uncomfortable conclusions. If a person is making a fallacious argument, more often than not this doesn't lead to any ground gained if they are called out. Worse, a person behaving according to option 3 is liable to be arguing dishonestly or in bad faith to waste your time or to attempt to aggravate you. Pointing out a fallacious argument becomes useless. But the problem with a fallacious argument is that it privileges logic in favor of the fallacious argument in that it takes liberty with what is and is not valid. The person making the fallacious argument if not called out on it has an advantage over the other because they are using privileged logic. The conversation can't continue unless the flaw in logic is pointed out. \n\nTo me, it is possible to infer a best course of action from the above information:\n\n1. If I notice a person arguing fallaciously, call it out by demonstrating why it is fallacious.\n\n2. If the person appears to not understand the accusation, try to correct misunderstandings one more time.\n\n3. If the person ever tries to turn the accusation back on you or defend the argument as not fallacious immediately disengage.\n\nTo CMV, contend with my reckoning of what options are available to  interlocutor's after a fallacious argument has been pointed out or their relative rarity, contend with the conclusions based on that information, or contend with the best course of action I laid out in response.", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "[∆(s) from OP]", "id": "65wycd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 32, "report_reasons": null, "author": "Mitoza", "saved": false, "mod_reports": [], "name": "t3_65wycd", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": false, "link_flair_css_class": "OPdelta", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/65wycd/cmv_calling_out_fallacious_arguments_rarely/", "num_reports": null, "locked": false, "stickied": false, "created": 1492478639.0, "url": "https://www.reddit.com/r/changemyview/comments/65wycd/cmv_calling_out_fallacious_arguments_rarely/", "author_flair_text": "29∆", "quarantine": false, "title": "CMV: Calling out fallacious arguments rarely provides a positive effect, but must occur.", "created_utc": 1492449839.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 78, "visited": false, "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": "", "user_reports": [], "id": "dgdybmr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t3_65wycd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "/u/Mitoza (OP) has awarded 2 deltas in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [**here**](/r/DeltaLog/comments/65xn48), in /r/DeltaLog.\n\nPlease note that a change of view [doesn't necessarily mean a reversal](https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F), or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)", "edited": 1492457376.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/Mitoza\"&gt;/u/Mitoza&lt;/a&gt; (OP) has awarded 2 deltas in this post.&lt;/p&gt;\n\n&lt;p&gt;All comments that earned deltas (from OP or other users) are listed &lt;a href=\"/r/DeltaLog/comments/65xn48\"&gt;&lt;strong&gt;here&lt;/strong&gt;&lt;/a&gt;, in &lt;a href=\"/r/DeltaLog\"&gt;/r/DeltaLog&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Please note that a change of view &lt;a href=\"https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F\"&gt;doesn&amp;#39;t necessarily mean a reversal&lt;/a&gt;, or that the conversation has ended.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdybmr", "score_hidden": true, "stickied": true, "created": 1492485077.0, "created_utc": 1492456277.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dge5cg2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dge4bx2", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; I'm explaining that adding \"and explain it\" fails to address the problem of definition I pointed out.\n\nYes, you are now. Not before when your point was simply \"asserting something as a fallacy alone is meaningless\" and you condescended about me not making myself clear.\n\n&gt;That's how you should apply it if you want to have productive discussions instead of slapfights.\n\nThe principle of charity does not dictate how I observe arguments, it dictates favoring interpretations that favor the opponent. At a certain point, it can become clear when I'm making concessions for bad behaviour. If an argument turns into a slapfight, it's because interpreting their argument in the best possible light has been shown to be undue. \n\n&gt;That's not what I said.\n\nThis is what you said:\n\n&gt;Considering how much of our lives and beliefs are dictated by which subjective premises we believe in, it can be very hard (sometimes impossible) to conclusively prove that an argument is fallacious even when we vehemently disagree with it.\n\nI'm not far off unless you want to correct me. \n\nSound logic is not a premise that needs to be accepted before it is demanded of people. What is and is not valid argumentation will never be up to subjective understanding. Arguments for or against subjective content *must* be based on a sound reckoning of logic, and everyone should be expected to use it. \n\nYour solution to informal fallacies of asking for more justification is incorrect, because the issue is not that there isn't enough proof, it's proof of the wrong type. There are no unstated premises that could justify a fallacy of relative privation, for instance.\n\nBye.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m explaining that adding &amp;quot;and explain it&amp;quot; fails to address the problem of definition I pointed out.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, you are now. Not before when your point was simply &amp;quot;asserting something as a fallacy alone is meaningless&amp;quot; and you condescended about me not making myself clear.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;That&amp;#39;s how you should apply it if you want to have productive discussions instead of slapfights.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The principle of charity does not dictate how I observe arguments, it dictates favoring interpretations that favor the opponent. At a certain point, it can become clear when I&amp;#39;m making concessions for bad behaviour. If an argument turns into a slapfight, it&amp;#39;s because interpreting their argument in the best possible light has been shown to be undue. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;That&amp;#39;s not what I said.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is what you said:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Considering how much of our lives and beliefs are dictated by which subjective premises we believe in, it can be very hard (sometimes impossible) to conclusively prove that an argument is fallacious even when we vehemently disagree with it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not far off unless you want to correct me. &lt;/p&gt;\n\n&lt;p&gt;Sound logic is not a premise that needs to be accepted before it is demanded of people. What is and is not valid argumentation will never be up to subjective understanding. Arguments for or against subjective content &lt;em&gt;must&lt;/em&gt; be based on a sound reckoning of logic, and everyone should be expected to use it. &lt;/p&gt;\n\n&lt;p&gt;Your solution to informal fallacies of asking for more justification is incorrect, because the issue is not that there isn&amp;#39;t enough proof, it&amp;#39;s proof of the wrong type. There are no unstated premises that could justify a fallacy of relative privation, for instance.&lt;/p&gt;\n\n&lt;p&gt;Bye.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge5cg2", "score_hidden": true, "stickied": false, "created": 1492493052.0, "created_utc": 1492464252.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge4bx2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Grunt08", "parent_id": "t1_dge1u34", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Now you're trying to retroactively apply points to this misunderstanding as though that qualifies your mistake.\n\nI'm explaining that adding \"and explain it\" fails to address the problem of definition I pointed out.  Your ability to \"explain it\" is necessarily faulty and constricted, and doesn't substantively add to simply stating it.\n\n&gt;That's how I will choose to apply it so that I'm not walked all over, especially when that same principle is not applied to me.\n\nThat's how you *should* apply it if you want to have productive discussions instead of slapfights.  You seem to be approaching these ideas as tactics to use in conflict - that might explain why you often have discussions that are so acrimonious.\n\n&gt;That is what I implied from you saying something to the effect \"you can't prove that something is fallacious conclusively due to individual's subjectivities\". Things are fallacious regardless of subjectivities. It does not matter how people see the world differently regarding how fallacious or valid their argument is.\n\nThat's not what I said.\n\nLogic is a process of justifying knowledge that absolutely requires that one accept certain premises before the process begins - and we rarely share all the same premises.  You literally cannot engage in logic without accepting that some things are true or false beforehand. This is demonstrated conditional \"if, then\" statements; if a certain condition is met, then another is true.  What I'm talking about where there are ideas of value, morality, or probability that are treated as \"ifs\".  Someone else considers the condition to be met, and they then produce a chain of logic that seems erroneous to you because that same condition isn't met for you.\n\nThis is particularly important when dealing with informal fallacies - the only type of fallacy you've alluded to.  Informal fallacies are only fallacies in that they fail to state sufficient premises to justify their conclusions.  But if an apparent informal fallacy were presented from a worldview that took other, unstated premises as a given, the argument might not be fallacious at all.  Fallacy hunting precludes the understanding of those principles, the principle of charity would allow you to discover them.\n\nHave a nice day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Now you&amp;#39;re trying to retroactively apply points to this misunderstanding as though that qualifies your mistake.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m explaining that adding &amp;quot;and explain it&amp;quot; fails to address the problem of definition I pointed out.  Your ability to &amp;quot;explain it&amp;quot; is necessarily faulty and constricted, and doesn&amp;#39;t substantively add to simply stating it.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;That&amp;#39;s how I will choose to apply it so that I&amp;#39;m not walked all over, especially when that same principle is not applied to me.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s how you &lt;em&gt;should&lt;/em&gt; apply it if you want to have productive discussions instead of slapfights.  You seem to be approaching these ideas as tactics to use in conflict - that might explain why you often have discussions that are so acrimonious.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;That is what I implied from you saying something to the effect &amp;quot;you can&amp;#39;t prove that something is fallacious conclusively due to individual&amp;#39;s subjectivities&amp;quot;. Things are fallacious regardless of subjectivities. It does not matter how people see the world differently regarding how fallacious or valid their argument is.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s not what I said.&lt;/p&gt;\n\n&lt;p&gt;Logic is a process of justifying knowledge that absolutely requires that one accept certain premises before the process begins - and we rarely share all the same premises.  You literally cannot engage in logic without accepting that some things are true or false beforehand. This is demonstrated conditional &amp;quot;if, then&amp;quot; statements; if a certain condition is met, then another is true.  What I&amp;#39;m talking about where there are ideas of value, morality, or probability that are treated as &amp;quot;ifs&amp;quot;.  Someone else considers the condition to be met, and they then produce a chain of logic that seems erroneous to you because that same condition isn&amp;#39;t met for you.&lt;/p&gt;\n\n&lt;p&gt;This is particularly important when dealing with informal fallacies - the only type of fallacy you&amp;#39;ve alluded to.  Informal fallacies are only fallacies in that they fail to state sufficient premises to justify their conclusions.  But if an apparent informal fallacy were presented from a worldview that took other, unstated premises as a given, the argument might not be fallacious at all.  Fallacy hunting precludes the understanding of those principles, the principle of charity would allow you to discover them.&lt;/p&gt;\n\n&lt;p&gt;Have a nice day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge4bx2", "score_hidden": true, "stickied": false, "created": 1492491838.0, "created_utc": 1492463038.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge1u34", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dge198n", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; In a lengthy set of comments, you've only generally alluded to your obligation to explain your reasoning behind declaring a fallacy\n\nActually, within the first few lines of the OP you're responding to. Making arguments against things that are not my position are just going to be ignored by me. You may have made those other points, but only after being corrected. You initially admitted that you misunderstood my position that this is in reference to (though continue to blame it on me). Now you're trying to retroactively apply points to this misunderstanding as though that qualifies your mistake. \n\n&gt;That's also not how the principle of charity works. \n\nThat's how I will choose to apply it so that I'm not walked all over, especially when that same principle is not applied to me.\n\n&gt;You seem to labor under the idea that when I'm talking about premises, I'm somehow referring to a flawed or fallen condition where a person believes that a fallacy is not actually a fallacy, but that's not the case.\n\nThat is what I implied from you saying something to the effect \"you can't prove that something is fallacious conclusively due to individual's subjectivities\". Things are fallacious regardless of subjectivities. It does not matter how people see the world differently regarding how fallacious or valid their argument is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In a lengthy set of comments, you&amp;#39;ve only generally alluded to your obligation to explain your reasoning behind declaring a fallacy&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Actually, within the first few lines of the OP you&amp;#39;re responding to. Making arguments against things that are not my position are just going to be ignored by me. You may have made those other points, but only after being corrected. You initially admitted that you misunderstood my position that this is in reference to (though continue to blame it on me). Now you&amp;#39;re trying to retroactively apply points to this misunderstanding as though that qualifies your mistake. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;That&amp;#39;s also not how the principle of charity works. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s how I will choose to apply it so that I&amp;#39;m not walked all over, especially when that same principle is not applied to me.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You seem to labor under the idea that when I&amp;#39;m talking about premises, I&amp;#39;m somehow referring to a flawed or fallen condition where a person believes that a fallacy is not actually a fallacy, but that&amp;#39;s not the case.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That is what I implied from you saying something to the effect &amp;quot;you can&amp;#39;t prove that something is fallacious conclusively due to individual&amp;#39;s subjectivities&amp;quot;. Things are fallacious regardless of subjectivities. It does not matter how people see the world differently regarding how fallacious or valid their argument is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge1u34", "score_hidden": true, "stickied": false, "created": 1492489042.0, "created_utc": 1492460242.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge198n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Grunt08", "parent_id": "t1_dgdz9zr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It might be prudent to treat comments as arguments that are internally consistent and not line-by-line criticisms that each apply to you.  If something didn't apply to you as an obvious criticism, you shouldn't treat it as such.\n\n&gt;My view doesn't seem to be this at all. In fact, I just got done correcting you that it isn't. So what purpose is there in you repeating it? I don't disagree with it.\n\nYour view did seem to be just that.  In a lengthy set of comments, you've only generally alluded to your obligation to explain your reasoning behind declaring a fallacy.  Setting that aside, I've made the point  that the problem rests in the actual declaration of a fallacy - and that problem persists whether you explain or not.\n\nMaybe this will clarify: saying \"this is fallacious, here's why\" is an inherently combative, self-centered approach to a discussion that often precludes fully understanding an argument or position.  It's better to question specific ideas (as opposed to declaring them wrong) or make arguments for alternative positions.\n\n&gt;in my experience the contentious nature of the debates I'm participating in the fallacies are transparent, and after a few back and forths it is possible to know if a person is worth the charity.\n\nThat's also not how the [principle of charity](https://en.wikipedia.org/wiki/Principle_of_charity) works.  It can and should be extended in any discussion where participants are hoping for mutual benefit.  A discussion without it turns into a pointless, partisan slapfight.\n\n&gt;I think this obscures the actual steps you laid out.\n\nI'm not sure how.  You seem to labor under the idea that when I'm talking about premises, I'm somehow referring to a flawed or fallen condition where a person believes that a fallacy is not actually a fallacy, but that's not the case.  I'm saying they believe something that changes the way you and they see the world.\n\nExample 1: over the course of Bob's life, he's been fairly successful attributing correlation to causation ~50% of the time.  Your rate of success had been much lower...say ~20%.  You and Bob discuss a topic and you see that he's much more comfortable attributing something to a correlated event.  You know that correlation doesn't prove causation, but often implies it.  You also know that Bob may well be right, fallacy notwithstanding.\n\nExample 2: Bob believes in God and you don't.  This leads Bob to make various presumptions about the nature of morality, duty, cosmology, natural order, and so on.  Many elements of that presupposition cannot be addressed logically *at all* because they rest on an assumption about the fundamental nature of the universe.  Based on those ideas, proceeding arguments are entirely logical.  The only way you could identify a fallacious argument in the broad sense would be to address elements of the argument that are subjective disagreements to which logic has limited access.\n\nMy point it that most intelligent disagreements don't boil down to a series of mistakes made by one side or the other.  They boil down to differences in the essential truths we take as a given.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It might be prudent to treat comments as arguments that are internally consistent and not line-by-line criticisms that each apply to you.  If something didn&amp;#39;t apply to you as an obvious criticism, you shouldn&amp;#39;t treat it as such.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;My view doesn&amp;#39;t seem to be this at all. In fact, I just got done correcting you that it isn&amp;#39;t. So what purpose is there in you repeating it? I don&amp;#39;t disagree with it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Your view did seem to be just that.  In a lengthy set of comments, you&amp;#39;ve only generally alluded to your obligation to explain your reasoning behind declaring a fallacy.  Setting that aside, I&amp;#39;ve made the point  that the problem rests in the actual declaration of a fallacy - and that problem persists whether you explain or not.&lt;/p&gt;\n\n&lt;p&gt;Maybe this will clarify: saying &amp;quot;this is fallacious, here&amp;#39;s why&amp;quot; is an inherently combative, self-centered approach to a discussion that often precludes fully understanding an argument or position.  It&amp;#39;s better to question specific ideas (as opposed to declaring them wrong) or make arguments for alternative positions.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;in my experience the contentious nature of the debates I&amp;#39;m participating in the fallacies are transparent, and after a few back and forths it is possible to know if a person is worth the charity.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s also not how the &lt;a href=\"https://en.wikipedia.org/wiki/Principle_of_charity\"&gt;principle of charity&lt;/a&gt; works.  It can and should be extended in any discussion where participants are hoping for mutual benefit.  A discussion without it turns into a pointless, partisan slapfight.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I think this obscures the actual steps you laid out.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not sure how.  You seem to labor under the idea that when I&amp;#39;m talking about premises, I&amp;#39;m somehow referring to a flawed or fallen condition where a person believes that a fallacy is not actually a fallacy, but that&amp;#39;s not the case.  I&amp;#39;m saying they believe something that changes the way you and they see the world.&lt;/p&gt;\n\n&lt;p&gt;Example 1: over the course of Bob&amp;#39;s life, he&amp;#39;s been fairly successful attributing correlation to causation ~50% of the time.  Your rate of success had been much lower...say ~20%.  You and Bob discuss a topic and you see that he&amp;#39;s much more comfortable attributing something to a correlated event.  You know that correlation doesn&amp;#39;t prove causation, but often implies it.  You also know that Bob may well be right, fallacy notwithstanding.&lt;/p&gt;\n\n&lt;p&gt;Example 2: Bob believes in God and you don&amp;#39;t.  This leads Bob to make various presumptions about the nature of morality, duty, cosmology, natural order, and so on.  Many elements of that presupposition cannot be addressed logically &lt;em&gt;at all&lt;/em&gt; because they rest on an assumption about the fundamental nature of the universe.  Based on those ideas, proceeding arguments are entirely logical.  The only way you could identify a fallacious argument in the broad sense would be to address elements of the argument that are subjective disagreements to which logic has limited access.&lt;/p&gt;\n\n&lt;p&gt;My point it that most intelligent disagreements don&amp;#39;t boil down to a series of mistakes made by one side or the other.  They boil down to differences in the essential truths we take as a given.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge198n", "score_hidden": true, "stickied": false, "created": 1492488399.0, "created_utc": 1492459599.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": "", "user_reports": [], "id": "dgdza6m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dgdz9zr", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/Grunt08 ([136∆](/r/changemyview/wiki/user/Grunt08)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"Grunt08\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/Grunt08\"&gt;/u/Grunt08&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/Grunt08\"&gt;136∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22Grunt08%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdza6m", "score_hidden": true, "stickied": false, "created": 1492486175.0, "created_utc": 1492457375.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdz9zr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdy7ct", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;The proper way to say this would include some acceptance of accountability on your part for communicating poorly. \n\nThat is perhaps the polite way to do so, but I don't owe that to you. Frankly, you took no accountability for your misinterpretation though I quoted something from the main post that clearly contradicts your assumption of my position. It would be forgivable for you to have not read it carefully, but you also insisted on your point as if it were still relevant:\n\n&gt;As it stands, your view seems to be that there is some inherent value in saying \"that's fallacious\"; my point is that there's very little value in that because saying it is usually meaningless.\n\nMy view doesn't seem to be this at all. In fact, I just got done correcting you that it isn't. So what purpose is there in you repeating it? I don't disagree with it.\n\n&gt;That's misunderstanding the principle of charity. \n\nYou're correct. !Delta. Caveat: in my experience the contentious nature of the debates I'm participating in the fallacies are transparent, and after a few back and forths it is possible to know if a person is worth the charity.\n\n&gt;Considering how much of our lives and beliefs are dictated by which subjective premises we believe in, it can be very hard (sometimes impossible) to conclusively prove that an argument is fallacious even when we vehemently disagree with it.\n\nI think this obscures the actual steps you laid out. A person may have matured in a subjectivity that has lead them to believing that an appeal to authority is not fallacious, but the mere nature of their upbringing being subjective does not make it unable to be proven to be fallacious. It's actually quite easy. What may be difficult is demonstrating this to the person who has flawed reasoning in the first place.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The proper way to say this would include some acceptance of accountability on your part for communicating poorly. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That is perhaps the polite way to do so, but I don&amp;#39;t owe that to you. Frankly, you took no accountability for your misinterpretation though I quoted something from the main post that clearly contradicts your assumption of my position. It would be forgivable for you to have not read it carefully, but you also insisted on your point as if it were still relevant:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As it stands, your view seems to be that there is some inherent value in saying &amp;quot;that&amp;#39;s fallacious&amp;quot;; my point is that there&amp;#39;s very little value in that because saying it is usually meaningless.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;My view doesn&amp;#39;t seem to be this at all. In fact, I just got done correcting you that it isn&amp;#39;t. So what purpose is there in you repeating it? I don&amp;#39;t disagree with it.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;That&amp;#39;s misunderstanding the principle of charity. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re correct. !Delta. Caveat: in my experience the contentious nature of the debates I&amp;#39;m participating in the fallacies are transparent, and after a few back and forths it is possible to know if a person is worth the charity.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Considering how much of our lives and beliefs are dictated by which subjective premises we believe in, it can be very hard (sometimes impossible) to conclusively prove that an argument is fallacious even when we vehemently disagree with it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think this obscures the actual steps you laid out. A person may have matured in a subjectivity that has lead them to believing that an appeal to authority is not fallacious, but the mere nature of their upbringing being subjective does not make it unable to be proven to be fallacious. It&amp;#39;s actually quite easy. What may be difficult is demonstrating this to the person who has flawed reasoning in the first place.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdz9zr", "score_hidden": true, "stickied": false, "created": 1492486169.0, "created_utc": 1492457369.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdy7ct", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Grunt08", "parent_id": "t1_dgdwyho", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;So, I've attempted to clear up your misunderstanding my position as being in favor of \"empty accusation\" by directly quoting one of the first lines in it explaining my process for \"calling out\", and you insist on making your point dismissing empty accusations.\n\nThe proper way to say this would include some acceptance of accountability on your part for communicating poorly.  This is not just my misunderstanding, this is you not sufficiently articulating what you mean by \"calling out.\"  You've left it so open-ended that the term can mean whatever you need it to mean so long as it's not what I'm talking about.\n\n&gt;Calling out a fallacy need not be uncharitable if the argument is indeed obviously fallacious. That's the point of explaining why it is fallacious. Charity is maintained by assuming that the fallacious argument was made by mistake, not dishonesty or malice.\n\nThat's misunderstanding the principle of charity.  You're not just assuming a person is well-intentioned and not malicious, you're interpreting what they say to mean that which you would most agree with until proven otherwise.  If someone says \"Bob's not a real Muslim,\" you don't linger on the No True Scotsman, you reasonably deduce that they meant Bob doesn't accurately represent Muslims in his actions.  Focusing on fallacious construction of an argument instead of charitably interpreting is a way of strategically avoiding the discovery of common ground for fear of conceding any point at all for the sake of argument.\n\n&gt;I disagree that fallacies are hard to conclusively prove, and I wonder what presuppositions you're talking about. To me, arguments being flawed or not is a factor of how logic works at all.\n\nStarting premises are fairly important in any system of logic.  We all have different assumptions, learned ideas, and experiences telling us how the world works and those combine with more proximate observations to lead us to logical conclusions.  Depending on what premises I accept, I may have an entirely logical, fallacy-free argument that's actually based on a subjective premise you don't agree with.  In that case, it would be profoundly difficult for you to charitably address my argument while fallacy hunting - you would be hard pressed to discover the locus of disagreement and turn the discussion to that point.  Even if we did reach that point, it's far from certain that any conclusive argument could be made that would persuade either of us to change that subjective premise.\n\nConsidering how much of our lives and beliefs are dictated by which subjective premises we believe in, it can be very hard (sometimes impossible) to conclusively prove that an argument is fallacious even when we vehemently disagree with it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;So, I&amp;#39;ve attempted to clear up your misunderstanding my position as being in favor of &amp;quot;empty accusation&amp;quot; by directly quoting one of the first lines in it explaining my process for &amp;quot;calling out&amp;quot;, and you insist on making your point dismissing empty accusations.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The proper way to say this would include some acceptance of accountability on your part for communicating poorly.  This is not just my misunderstanding, this is you not sufficiently articulating what you mean by &amp;quot;calling out.&amp;quot;  You&amp;#39;ve left it so open-ended that the term can mean whatever you need it to mean so long as it&amp;#39;s not what I&amp;#39;m talking about.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Calling out a fallacy need not be uncharitable if the argument is indeed obviously fallacious. That&amp;#39;s the point of explaining why it is fallacious. Charity is maintained by assuming that the fallacious argument was made by mistake, not dishonesty or malice.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s misunderstanding the principle of charity.  You&amp;#39;re not just assuming a person is well-intentioned and not malicious, you&amp;#39;re interpreting what they say to mean that which you would most agree with until proven otherwise.  If someone says &amp;quot;Bob&amp;#39;s not a real Muslim,&amp;quot; you don&amp;#39;t linger on the No True Scotsman, you reasonably deduce that they meant Bob doesn&amp;#39;t accurately represent Muslims in his actions.  Focusing on fallacious construction of an argument instead of charitably interpreting is a way of strategically avoiding the discovery of common ground for fear of conceding any point at all for the sake of argument.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I disagree that fallacies are hard to conclusively prove, and I wonder what presuppositions you&amp;#39;re talking about. To me, arguments being flawed or not is a factor of how logic works at all.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Starting premises are fairly important in any system of logic.  We all have different assumptions, learned ideas, and experiences telling us how the world works and those combine with more proximate observations to lead us to logical conclusions.  Depending on what premises I accept, I may have an entirely logical, fallacy-free argument that&amp;#39;s actually based on a subjective premise you don&amp;#39;t agree with.  In that case, it would be profoundly difficult for you to charitably address my argument while fallacy hunting - you would be hard pressed to discover the locus of disagreement and turn the discussion to that point.  Even if we did reach that point, it&amp;#39;s far from certain that any conclusive argument could be made that would persuade either of us to change that subjective premise.&lt;/p&gt;\n\n&lt;p&gt;Considering how much of our lives and beliefs are dictated by which subjective premises we believe in, it can be very hard (sometimes impossible) to conclusively prove that an argument is fallacious even when we vehemently disagree with it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdy7ct", "score_hidden": true, "stickied": false, "created": 1492484942.0, "created_utc": 1492456142.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdwyho", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdvr4i", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So, I've attempted to clear up your misunderstanding my position as being in favor of \"empty accusation\" by directly quoting one of the first lines in it explaining my process for \"calling out\", and you insist on making your point dismissing empty accusations. Thank you, I agree, but it's not relevant to what I'm talking about.\n\nCalling out a fallacy need not be uncharitable if the argument is indeed obviously fallacious. That's the point of explaining why it is fallacious. Charity is maintained by assuming that the fallacious argument was made by mistake, not dishonesty or malice.\n\n&gt;I'm sure you argue quite a bit, but if the arguments aim to prove that a particular argument is fallacious and not that a conclusion is wrong, you'll get very little traction. \n\nCountering fallacious arguments is in direct service to figuring out whether or not the conclusion is wrong, especially if I disagree with the conclusion. I'll never know if the conclusion is right or wrong if all that is made to support it are flawed arguments. I disagree that fallacies are hard to conclusively prove, and I wonder what presuppositions you're talking about. To me, arguments being flawed or not is a factor of how logic works at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, I&amp;#39;ve attempted to clear up your misunderstanding my position as being in favor of &amp;quot;empty accusation&amp;quot; by directly quoting one of the first lines in it explaining my process for &amp;quot;calling out&amp;quot;, and you insist on making your point dismissing empty accusations. Thank you, I agree, but it&amp;#39;s not relevant to what I&amp;#39;m talking about.&lt;/p&gt;\n\n&lt;p&gt;Calling out a fallacy need not be uncharitable if the argument is indeed obviously fallacious. That&amp;#39;s the point of explaining why it is fallacious. Charity is maintained by assuming that the fallacious argument was made by mistake, not dishonesty or malice.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m sure you argue quite a bit, but if the arguments aim to prove that a particular argument is fallacious and not that a conclusion is wrong, you&amp;#39;ll get very little traction. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Countering fallacious arguments is in direct service to figuring out whether or not the conclusion is wrong, especially if I disagree with the conclusion. I&amp;#39;ll never know if the conclusion is right or wrong if all that is made to support it are flawed arguments. I disagree that fallacies are hard to conclusively prove, and I wonder what presuppositions you&amp;#39;re talking about. To me, arguments being flawed or not is a factor of how logic works at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdwyho", "score_hidden": true, "stickied": false, "created": 1492483528.0, "created_utc": 1492454728.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvr4i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Grunt08", "parent_id": "t1_dgdux4b", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It's not very clear what you mean by \"calling out.\"  If you're using that as a euphemism for arguing against things you disagree with, I think your phrasing could've been better.  As it stands, your view seems to be that there is some inherent value in saying \"that's fallacious\"; my point is that there's very little value in that because saying it is usually meaningless.\n\nMoreover, the hunt for fallacies often requires that a person be deliberately uncharitable in their interpretation of other people's comments.  If I'm looking for ways to dismiss what you say based on some error in logic (that is often trivial) that effectively poisons everything else, I'm probably not giving your argument a fair interpretation.  I may achieve my rhetorical goal, but I've produced a stalemate with the person I'm actually speaking to.\n\n&gt;That's my conception as well, I don't understand the distinction you see between what I describe in my OP and what you wrote here.\n\nI didn't suggest that there was, I only defined terms so that if there was some difference, it would be evident to you immediately.  For instance, some people think the term only refers to those instances where an argument is *necessarily* invalid, not just *potentially* invalid.\n\n&gt;My practice is not to simply say \"that's fallacious\" so I don't think what you wrote in regards to my accusations being empty statements.\n\nI'm sure you argue quite a bit, but if the arguments aim to prove that a particular argument is fallacious and not that a conclusion is wrong, you'll get very little traction.  Fallacies are often difficult to conclusively prove because they're usually contingent on various presuppositions that people who disagree rarely share.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not very clear what you mean by &amp;quot;calling out.&amp;quot;  If you&amp;#39;re using that as a euphemism for arguing against things you disagree with, I think your phrasing could&amp;#39;ve been better.  As it stands, your view seems to be that there is some inherent value in saying &amp;quot;that&amp;#39;s fallacious&amp;quot;; my point is that there&amp;#39;s very little value in that because saying it is usually meaningless.&lt;/p&gt;\n\n&lt;p&gt;Moreover, the hunt for fallacies often requires that a person be deliberately uncharitable in their interpretation of other people&amp;#39;s comments.  If I&amp;#39;m looking for ways to dismiss what you say based on some error in logic (that is often trivial) that effectively poisons everything else, I&amp;#39;m probably not giving your argument a fair interpretation.  I may achieve my rhetorical goal, but I&amp;#39;ve produced a stalemate with the person I&amp;#39;m actually speaking to.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;That&amp;#39;s my conception as well, I don&amp;#39;t understand the distinction you see between what I describe in my OP and what you wrote here.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I didn&amp;#39;t suggest that there was, I only defined terms so that if there was some difference, it would be evident to you immediately.  For instance, some people think the term only refers to those instances where an argument is &lt;em&gt;necessarily&lt;/em&gt; invalid, not just &lt;em&gt;potentially&lt;/em&gt; invalid.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;My practice is not to simply say &amp;quot;that&amp;#39;s fallacious&amp;quot; so I don&amp;#39;t think what you wrote in regards to my accusations being empty statements.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m sure you argue quite a bit, but if the arguments aim to prove that a particular argument is fallacious and not that a conclusion is wrong, you&amp;#39;ll get very little traction.  Fallacies are often difficult to conclusively prove because they&amp;#39;re usually contingent on various presuppositions that people who disagree rarely share.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdvr4i", "score_hidden": true, "stickied": false, "created": 1492482169.0, "created_utc": 1492453369.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdux4b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdtk31", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Broadly speaking, a fallacy is just an error in reasoning that renders an argument invalid.\n\nThat's my conception as well, I don't understand the distinction you see between what I describe in my OP and what you wrote here.\n\nFrom my main post:\n\n&gt;I call them on it directly and explain why it is fallacious\n\nMy practice is not to simply say \"that's fallacious\" so I don't think what you wrote in regards to my accusations being empty statements. If the person I'm speaking to is trying to convince me of a claim that I disagree with by way of invalid arguments, I won't be capable of being convinced. In this case, proof is necessary.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Broadly speaking, a fallacy is just an error in reasoning that renders an argument invalid.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s my conception as well, I don&amp;#39;t understand the distinction you see between what I describe in my OP and what you wrote here.&lt;/p&gt;\n\n&lt;p&gt;From my main post:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I call them on it directly and explain why it is fallacious&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;My practice is not to simply say &amp;quot;that&amp;#39;s fallacious&amp;quot; so I don&amp;#39;t think what you wrote in regards to my accusations being empty statements. If the person I&amp;#39;m speaking to is trying to convince me of a claim that I disagree with by way of invalid arguments, I won&amp;#39;t be capable of being convinced. In this case, proof is necessary.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdux4b", "score_hidden": true, "stickied": false, "created": 1492481234.0, "created_utc": 1492452434.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtk31", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Grunt08", "parent_id": "t3_65wycd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You're overestimating the value of recognizing and labelling fallacies - at least, fallacies as you're describing them.\n\nBroadly speaking, a fallacy is just an error in reasoning that renders an argument invalid.  It follows that any discussion or debate is really aimed at discovering whose arguments are fallacious.  In that context, saying \"that's fallacious\" is an empty statement; it should go without saying that you think their arguments are wrong, you have to articulate the how and why.  It is often necessary to address arguments that *suggest* and thereby convince, rather than *prove.*  We accept beliefs all the time that aren't strictly supported by logic, so that behavior is fairly normal and acceptable.\n\nFor example: correlation =/= causation, but it does sometimes suggest it.  If a person sees a high correlation between an apparent cause and effect, it's not enough to just point out the potential fallacy and await your reward.  You may need to demonstrate that similar correlations don't indicate causation or some other solution.\n\nInformal fallacies are even weaker.  If I say \"Bob who did X isn't a true Muslim,\" you may plausibly claim that I've No True Scotsmanned you...but I might also be correct.  If I say you're not a reliable commenter on a subject, I may be guilty of ad hominem...but I may also be right.  So many informal fallacies are used a cudgels to nitpick generally convincing arguments that they've lost a lot of force in discussion.\n\nTo put all this another way: \"calling out\" a fallacy rarely works because the person doesn't believe it's a fallacy.  You have to show instead of tell.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re overestimating the value of recognizing and labelling fallacies - at least, fallacies as you&amp;#39;re describing them.&lt;/p&gt;\n\n&lt;p&gt;Broadly speaking, a fallacy is just an error in reasoning that renders an argument invalid.  It follows that any discussion or debate is really aimed at discovering whose arguments are fallacious.  In that context, saying &amp;quot;that&amp;#39;s fallacious&amp;quot; is an empty statement; it should go without saying that you think their arguments are wrong, you have to articulate the how and why.  It is often necessary to address arguments that &lt;em&gt;suggest&lt;/em&gt; and thereby convince, rather than &lt;em&gt;prove.&lt;/em&gt;  We accept beliefs all the time that aren&amp;#39;t strictly supported by logic, so that behavior is fairly normal and acceptable.&lt;/p&gt;\n\n&lt;p&gt;For example: correlation =/= causation, but it does sometimes suggest it.  If a person sees a high correlation between an apparent cause and effect, it&amp;#39;s not enough to just point out the potential fallacy and await your reward.  You may need to demonstrate that similar correlations don&amp;#39;t indicate causation or some other solution.&lt;/p&gt;\n\n&lt;p&gt;Informal fallacies are even weaker.  If I say &amp;quot;Bob who did X isn&amp;#39;t a true Muslim,&amp;quot; you may plausibly claim that I&amp;#39;ve No True Scotsmanned you...but I might also be correct.  If I say you&amp;#39;re not a reliable commenter on a subject, I may be guilty of ad hominem...but I may also be right.  So many informal fallacies are used a cudgels to nitpick generally convincing arguments that they&amp;#39;ve lost a lot of force in discussion.&lt;/p&gt;\n\n&lt;p&gt;To put all this another way: &amp;quot;calling out&amp;quot; a fallacy rarely works because the person doesn&amp;#39;t believe it&amp;#39;s a fallacy.  You have to show instead of tell.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdtk31", "score_hidden": true, "stickied": false, "created": 1492479738.0, "created_utc": 1492450938.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dge21nb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dge0mr3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "That's not me justifying it, that's apparently how it works as a logic construct. Arguments that can be construed as fallacious given their context may or may not be necessarily fallacious depending on their context. I don't have a list of all the fallacies memorized, so I can't say of hand if there are any others.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s not me justifying it, that&amp;#39;s apparently how it works as a logic construct. Arguments that can be construed as fallacious given their context may or may not be necessarily fallacious depending on their context. I don&amp;#39;t have a list of all the fallacies memorized, so I can&amp;#39;t say of hand if there are any others.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge21nb", "score_hidden": true, "stickied": false, "created": 1492489276.0, "created_utc": 1492460476.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge0mr3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GnosticGnome", "parent_id": "t1_dge084o", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "If you can justify even affirming the consequent as nonfallacious, is there any fallacy other than appeal to force that we can't accept as \"not necessarily fallacious if we are using informal or inductive reasoning\"?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you can justify even affirming the consequent as nonfallacious, is there any fallacy other than appeal to force that we can&amp;#39;t accept as &amp;quot;not necessarily fallacious if we are using informal or inductive reasoning&amp;quot;?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge0mr3", "score_hidden": true, "stickied": false, "created": 1492487689.0, "created_utc": 1492458889.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge084o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdzlb8", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You've sent me on a google spree.\n\nFrom what I can tell, affirming the consequent in this manner isn't necessarily fallacious, because the end result is inductive reasoning rather than inductive. At best, science is not stating the truth of how things definitly are, they are generalizing reality.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ve sent me on a google spree.&lt;/p&gt;\n\n&lt;p&gt;From what I can tell, affirming the consequent in this manner isn&amp;#39;t necessarily fallacious, because the end result is inductive reasoning rather than inductive. At best, science is not stating the truth of how things definitly are, they are generalizing reality.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge084o", "score_hidden": true, "stickied": false, "created": 1492487234.0, "created_utc": 1492458434.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzlb8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GnosticGnome", "parent_id": "t1_dgdzhmh", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The scientific method requires us to take a hypothesis/theory, make predictions based off it, and then if those predictions keep coming true say it's more likely a correct theory.  That's affirming the consequent.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The scientific method requires us to take a hypothesis/theory, make predictions based off it, and then if those predictions keep coming true say it&amp;#39;s more likely a correct theory.  That&amp;#39;s affirming the consequent.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdzlb8", "score_hidden": true, "stickied": false, "created": 1492486525.0, "created_utc": 1492457725.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzhmh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdycor", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I don't believe science is based on fallacy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t believe science is based on fallacy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdzhmh", "score_hidden": true, "stickied": false, "created": 1492486411.0, "created_utc": 1492457611.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdycor", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GnosticGnome", "parent_id": "t1_dgdxrug", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;I believe I said the opposite of above. Fallacious arguments are not compelling.\n\nDo you think that science should be considered highly compelling, despite being based on fallacy? I'm not talking about \"personal factors\" so much as reasoning that is likely to lead to truth.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I believe I said the opposite of above. Fallacious arguments are not compelling.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Do you think that science should be considered highly compelling, despite being based on fallacy? I&amp;#39;m not talking about &amp;quot;personal factors&amp;quot; so much as reasoning that is likely to lead to truth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdycor", "score_hidden": true, "stickied": false, "created": 1492485109.0, "created_utc": 1492456309.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdxrug", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdvxy4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "A thing may be imperfect while still being more or less useful in other regards. Giving Richard Feynman's testimony in regards to physics is not inherently fallacious if you're trying to demonstrate the status quo in physics. It is fallacious if you're saying that someone is wrong *because* Feynman says otherwise. It is more fallacious if you're simply saying \"Feynman is smart and he says this so he must be right\". \n\n&gt;Would you likewise claim it's not fallacious to let your opponent know what denying the antecedent would imply, what level of force you intend to apply if he continues talking, or what the most popular opinion is?\n\nThese all depend on context. To use one example, simply saying \"many people agree with me\" does not make an argument fallacious. Only if that is applied to the truth of the claim is it so.\n\n&gt;Wait, are you one of those people who think that compelling reasoning magically ceases to be fallacious? \n\nI believe I said the opposite of above. Fallacious arguments are not compelling. That doesn't mean that compelling reasoning automatically becomes non fallacious in all cases, because what is and is not compelling depends on personal factors.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A thing may be imperfect while still being more or less useful in other regards. Giving Richard Feynman&amp;#39;s testimony in regards to physics is not inherently fallacious if you&amp;#39;re trying to demonstrate the status quo in physics. It is fallacious if you&amp;#39;re saying that someone is wrong &lt;em&gt;because&lt;/em&gt; Feynman says otherwise. It is more fallacious if you&amp;#39;re simply saying &amp;quot;Feynman is smart and he says this so he must be right&amp;quot;. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Would you likewise claim it&amp;#39;s not fallacious to let your opponent know what denying the antecedent would imply, what level of force you intend to apply if he continues talking, or what the most popular opinion is?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;These all depend on context. To use one example, simply saying &amp;quot;many people agree with me&amp;quot; does not make an argument fallacious. Only if that is applied to the truth of the claim is it so.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Wait, are you one of those people who think that compelling reasoning magically ceases to be fallacious? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I believe I said the opposite of above. Fallacious arguments are not compelling. That doesn&amp;#39;t mean that compelling reasoning automatically becomes non fallacious in all cases, because what is and is not compelling depends on personal factors.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdxrug", "score_hidden": true, "stickied": false, "created": 1492484453.0, "created_utc": 1492455653.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvxy4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GnosticGnome", "parent_id": "t1_dgdvam3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;An appeal to authority is different than getting an expert's opinion, and in many cases letting your opponent know what the authorities have to say on the matter is not fallacious. It is fallacious if you refuse to entertain that the experts may be wrong or if you are trying to apply a person's authority outside the realm of their expertise (I.E. Richard Feynman on video game design).\n\nI'm really confused now.  Why would it be any more or less of a fallacy to apply their authority outside the realm of their expertise as inside it, if their authority is imperfect in either regard.  Feynman is not always right or wrong about physics, and is not always right or wrong about video game design.  I can see how consulting him would be committing a more *useful* fallacy in the case of physics than video game design, of course.\n\n&gt;An appeal to authority is different than getting an expert's opinion, and in many cases letting your opponent know what the authorities have to say on the matter is not fallacious.\n\nWould you likewise claim it's not fallacious to let your opponent know what denying the antecedent would imply, what level of force you intend to apply if he continues talking, or what the most popular opinion is?  \n\n&gt;Can it be classified as miscommunication if they are trying to convince me of something or attempting to counter my arguments? Saying something is fallacious would seem to also imply that the reasoning isn't compelling.\n\nWait, are you one of those people who think that compelling reasoning (such as a Bayesian computation involving a string of Denied Antecedents and Affirmed Consequents, a sufficiently damning ad hominem argument, a sufficiently wide-ranging ad populum argument, maybe even an appeal to sufficient force) magically ceases to be fallacious?  Plenty of compelling reasoning is fallacious.  Do you agree that the scientific method is based upon a string of (fallacious) Affirming the Consequent arguments, and is nevertheless super compelling and likely to lead to truth?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;An appeal to authority is different than getting an expert&amp;#39;s opinion, and in many cases letting your opponent know what the authorities have to say on the matter is not fallacious. It is fallacious if you refuse to entertain that the experts may be wrong or if you are trying to apply a person&amp;#39;s authority outside the realm of their expertise (I.E. Richard Feynman on video game design).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m really confused now.  Why would it be any more or less of a fallacy to apply their authority outside the realm of their expertise as inside it, if their authority is imperfect in either regard.  Feynman is not always right or wrong about physics, and is not always right or wrong about video game design.  I can see how consulting him would be committing a more &lt;em&gt;useful&lt;/em&gt; fallacy in the case of physics than video game design, of course.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;An appeal to authority is different than getting an expert&amp;#39;s opinion, and in many cases letting your opponent know what the authorities have to say on the matter is not fallacious.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Would you likewise claim it&amp;#39;s not fallacious to let your opponent know what denying the antecedent would imply, what level of force you intend to apply if he continues talking, or what the most popular opinion is?  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Can it be classified as miscommunication if they are trying to convince me of something or attempting to counter my arguments? Saying something is fallacious would seem to also imply that the reasoning isn&amp;#39;t compelling.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Wait, are you one of those people who think that compelling reasoning (such as a Bayesian computation involving a string of Denied Antecedents and Affirmed Consequents, a sufficiently damning ad hominem argument, a sufficiently wide-ranging ad populum argument, maybe even an appeal to sufficient force) magically ceases to be fallacious?  Plenty of compelling reasoning is fallacious.  Do you agree that the scientific method is based upon a string of (fallacious) Affirming the Consequent arguments, and is nevertheless super compelling and likely to lead to truth?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdvxy4", "score_hidden": true, "stickied": false, "created": 1492482381.0, "created_utc": 1492453581.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvam3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdtgsk", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "A large number of people believing that fallacious arguments as long are valid so long as they are useful does not make these arguments not fallacious.\n\nAn appeal to authority is different than getting an expert's opinion, and in many cases letting your opponent know what the authorities have to say on the matter is not fallacious. It is fallacious if you refuse to entertain that the experts may be wrong or if you are trying to apply a person's authority outside the realm of their expertise (I.E. Richard Feynman on video game design).\n\n&gt;Anyway, I wonder if the people who claim fallacious arguments aren't fallacious aren't merely miscommunicating with you?\n\nCan it be classified as miscommunication if they are trying to convince me of something or attempting to counter my arguments? Saying something is fallacious would seem to also imply that the reasoning isn't compelling. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A large number of people believing that fallacious arguments as long are valid so long as they are useful does not make these arguments not fallacious.&lt;/p&gt;\n\n&lt;p&gt;An appeal to authority is different than getting an expert&amp;#39;s opinion, and in many cases letting your opponent know what the authorities have to say on the matter is not fallacious. It is fallacious if you refuse to entertain that the experts may be wrong or if you are trying to apply a person&amp;#39;s authority outside the realm of their expertise (I.E. Richard Feynman on video game design).&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Anyway, I wonder if the people who claim fallacious arguments aren&amp;#39;t fallacious aren&amp;#39;t merely miscommunicating with you?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Can it be classified as miscommunication if they are trying to convince me of something or attempting to counter my arguments? Saying something is fallacious would seem to also imply that the reasoning isn&amp;#39;t compelling. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdvam3", "score_hidden": true, "stickied": false, "created": 1492481656.0, "created_utc": 1492452856.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtgsk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GnosticGnome", "parent_id": "t3_65wycd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Worse, a person behaving according to option 3 is liable to be arguing dishonestly or in bad faith to waste your time or to attempt to aggravate you.\n\nOr perhaps they have a different understanding than you of what \"fallacy\" means?  For instance, I know a large number of people who think that reasoning processes that tend to produce good results are therefore not fallacious.  Some will claim that an appeal to authority is only fallacious when it is an \"appeal to inappropriate authority\" - that for instance, it is not fallacious to quote Richard Feynman on questions of physics even though of course it is still fallacious since he could plausibly be wrong.  He just usually isn't.  Likewise, many will claim that the scientific method somehow \"launders\" a chain of Affirming the Consequent fallacies and makes it nonfallacious.  Of course, it is fallacious and yet highly useful and likely to produce truth.  But people sometimes get stuck on the \"fallacy = wrong\" thing and want to claim that fallacies used properly to lead us toward truth somehow cease to be fallacies.\n\nAnyway, I wonder if the people who claim fallacious arguments aren't fallacious aren't merely miscommunicating with you?  Where they think they are saying \"this is highly compelling reasoning\" and you think they are denying using reasoning that is classified as fallacious in formal reasoning, and so speaking past one another?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Worse, a person behaving according to option 3 is liable to be arguing dishonestly or in bad faith to waste your time or to attempt to aggravate you.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Or perhaps they have a different understanding than you of what &amp;quot;fallacy&amp;quot; means?  For instance, I know a large number of people who think that reasoning processes that tend to produce good results are therefore not fallacious.  Some will claim that an appeal to authority is only fallacious when it is an &amp;quot;appeal to inappropriate authority&amp;quot; - that for instance, it is not fallacious to quote Richard Feynman on questions of physics even though of course it is still fallacious since he could plausibly be wrong.  He just usually isn&amp;#39;t.  Likewise, many will claim that the scientific method somehow &amp;quot;launders&amp;quot; a chain of Affirming the Consequent fallacies and makes it nonfallacious.  Of course, it is fallacious and yet highly useful and likely to produce truth.  But people sometimes get stuck on the &amp;quot;fallacy = wrong&amp;quot; thing and want to claim that fallacies used properly to lead us toward truth somehow cease to be fallacies.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I wonder if the people who claim fallacious arguments aren&amp;#39;t fallacious aren&amp;#39;t merely miscommunicating with you?  Where they think they are saying &amp;quot;this is highly compelling reasoning&amp;quot; and you think they are denying using reasoning that is classified as fallacious in formal reasoning, and so speaking past one another?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdtgsk", "score_hidden": true, "stickied": false, "created": 1492479638.0, "created_utc": 1492450838.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": "", "user_reports": [], "id": "dgdz6al", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FlexPlexico12", "parent_id": "t1_dgdy207", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think a lot of people with valid ideas would not be well equipped to format an argument in a way that doesn't violate any of these fallacies. It kind of shifts the debate away from the content to the format and gives you the high ground as you are no doubt the one who is more familiar with these fallacies in most of your encounters. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think a lot of people with valid ideas would not be well equipped to format an argument in a way that doesn&amp;#39;t violate any of these fallacies. It kind of shifts the debate away from the content to the format and gives you the high ground as you are no doubt the one who is more familiar with these fallacies in most of your encounters. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdz6al", "score_hidden": true, "stickied": false, "created": 1492486052.0, "created_utc": 1492457252.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdy207", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdwp2c", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "\"Defend the argument as not fallacious\" is a specific defense in my mind, where a person either simply denies it with no qualification or moves to justify their use of it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Defend the argument as not fallacious&amp;quot; is a specific defense in my mind, where a person either simply denies it with no qualification or moves to justify their use of it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdy207", "score_hidden": true, "stickied": false, "created": 1492484774.0, "created_utc": 1492455974.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdwp2c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FlexPlexico12", "parent_id": "t1_dgdwcat", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; If the person ever tries to turn the accusation back on you or defend the argument as not fallacious immediately disengage.\n\nIf you disengage then do they really have a chance to clear up the misunderstanding?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If the person ever tries to turn the accusation back on you or defend the argument as not fallacious immediately disengage.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you disengage then do they really have a chance to clear up the misunderstanding?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdwp2c", "score_hidden": true, "stickied": false, "created": 1492483233.0, "created_utc": 1492454433.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdwcat", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdv3rf", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "If I am wrong, they have a chance to clear up the misunderstanding before cutting off contact. If it is just a misunderstanding on my part, this should be easy. The difference between defending a fallacious argument and explaining what a person actually meant seems obvious. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I am wrong, they have a chance to clear up the misunderstanding before cutting off contact. If it is just a misunderstanding on my part, this should be easy. The difference between defending a fallacious argument and explaining what a person actually meant seems obvious. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdwcat", "score_hidden": true, "stickied": false, "created": 1492482832.0, "created_utc": 1492454032.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdv3rf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FlexPlexico12", "parent_id": "t3_65wycd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "4) The person denies that the argument is fallacious, and after further research/debate their view holds up.\n\nIt seems to me like you are participating in the same behavior that frustrates you so much by ignoring the possibility that you are the one who is wrong. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;4) The person denies that the argument is fallacious, and after further research/debate their view holds up.&lt;/p&gt;\n\n&lt;p&gt;It seems to me like you are participating in the same behavior that frustrates you so much by ignoring the possibility that you are the one who is wrong. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdv3rf", "score_hidden": true, "stickied": false, "created": 1492481442.0, "created_utc": 1492452642.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": "", "user_reports": [], "id": "dgdt302", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdsu79", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The fallacy fallacy only applies to extending the judgement of the argument to judgement of the claim. If a person trying to prove a claim only provides a fallacious argument in its defense or its support and I disagree with the claim, the fallacious argument cannot prove it. In discussions where a person takes a stance against the claim being made, no progress can be made until the person attempting to further the claim in question does so in a non fallacious way", "edited": 1492450667.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The fallacy fallacy only applies to extending the judgement of the argument to judgement of the claim. If a person trying to prove a claim only provides a fallacious argument in its defense or its support and I disagree with the claim, the fallacious argument cannot prove it. In discussions where a person takes a stance against the claim being made, no progress can be made until the person attempting to further the claim in question does so in a non fallacious way&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdt302", "score_hidden": true, "stickied": false, "created": 1492479222.0, "created_utc": 1492450422.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdsu79", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PM_For_Soros_Money", "parent_id": "t3_65wycd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Or is this just hinging on the \"fallacy fallacy\" or the idea that a fallacious argument is automatically wrong. \n\nIf I said \"healthy people exercise often\" I used a sweeping generalization fallacy. What's \"healthy people\". But my argument is not wrong. By nature of deductive reasoning of subset A \"people who exercise\" and the subset B \"people who are 'healthy'\" would essentially be the a circle. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or is this just hinging on the &amp;quot;fallacy fallacy&amp;quot; or the idea that a fallacious argument is automatically wrong. &lt;/p&gt;\n\n&lt;p&gt;If I said &amp;quot;healthy people exercise often&amp;quot; I used a sweeping generalization fallacy. What&amp;#39;s &amp;quot;healthy people&amp;quot;. But my argument is not wrong. By nature of deductive reasoning of subset A &amp;quot;people who exercise&amp;quot; and the subset B &amp;quot;people who are &amp;#39;healthy&amp;#39;&amp;quot; would essentially be the a circle. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdsu79", "score_hidden": true, "stickied": false, "created": 1492478950.0, "created_utc": 1492450150.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": "", "user_reports": [], "id": "dge0cda", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jclk1", "parent_id": "t1_dgdybgl", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Thanks for the delta. I agree that it is hard to actually practice this form of argumentation, personally it does feel kind of wrong, but by actually ignoring an argument that is fallacious you delegitimize it and can sometimes effectively move the conversation to your point. If you attack a fallacious argument for being fallacious the argument suddenly becomes about whether or not it was fallacious and you rarely get back to arguing the validity of the argument itself so it stands. Its actually a really effective tactic used by people to get an argument into a debate but then bog the debate down with details and particulars so the original argument never really gets challenged. Ignoring it and continuing to provide support for your view may just be the more effective means of convincing people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the delta. I agree that it is hard to actually practice this form of argumentation, personally it does feel kind of wrong, but by actually ignoring an argument that is fallacious you delegitimize it and can sometimes effectively move the conversation to your point. If you attack a fallacious argument for being fallacious the argument suddenly becomes about whether or not it was fallacious and you rarely get back to arguing the validity of the argument itself so it stands. Its actually a really effective tactic used by people to get an argument into a debate but then bog the debate down with details and particulars so the original argument never really gets challenged. Ignoring it and continuing to provide support for your view may just be the more effective means of convincing people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge0cda", "score_hidden": true, "stickied": false, "created": 1492487367.0, "created_utc": 1492458567.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": "", "user_reports": [], "id": "dgdybld", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dgdybgl", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/jclk1 ([2∆](/r/changemyview/wiki/user/jclk1)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"jclk1\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/jclk1\"&gt;/u/jclk1&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/jclk1\"&gt;2∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22jclk1%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdybld", "score_hidden": true, "stickied": false, "created": 1492485076.0, "created_utc": 1492456276.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdybgl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdxroe", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "!Delta\n\nYou and I agree that calling out fallacious arguments rarely leads to a positive effect, but your alternative may be better than mine. I still have doubts about the effectiveness of this technique, because to me it could seem like I'm ignoring the argument if I don't address it in its entirety. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;!Delta&lt;/p&gt;\n\n&lt;p&gt;You and I agree that calling out fallacious arguments rarely leads to a positive effect, but your alternative may be better than mine. I still have doubts about the effectiveness of this technique, because to me it could seem like I&amp;#39;m ignoring the argument if I don&amp;#39;t address it in its entirety. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdybgl", "score_hidden": true, "stickied": false, "created": 1492485072.0, "created_utc": 1492456272.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdxroe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jclk1", "parent_id": "t3_65wycd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "There is a quote that goes, \"to convince someone don't tell them why their glass of water is dirty and undesirable, instead show them your clean glass water and they will want to drink from your glass.\" Basically, the alternative route of argumentation I would suggest is not to call out the glass of water as being dirty, fallacious, instead continue to provide non fallacious arguments that provide a clearly better alternative. While, I personally do agree with you that fallacious arguments should be called out, I think this comes from my personal desire to seek truth in argumentation, I know, and research shows it, providing positive alternatives is actually more effective in convincing someone of your point than calling out the errors in their arguments.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is a quote that goes, &amp;quot;to convince someone don&amp;#39;t tell them why their glass of water is dirty and undesirable, instead show them your clean glass water and they will want to drink from your glass.&amp;quot; Basically, the alternative route of argumentation I would suggest is not to call out the glass of water as being dirty, fallacious, instead continue to provide non fallacious arguments that provide a clearly better alternative. While, I personally do agree with you that fallacious arguments should be called out, I think this comes from my personal desire to seek truth in argumentation, I know, and research shows it, providing positive alternatives is actually more effective in convincing someone of your point than calling out the errors in their arguments.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdxroe", "score_hidden": true, "stickied": false, "created": 1492484448.0, "created_utc": 1492455648.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": "", "user_reports": [], "id": "dgdwl1q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdvndt", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I don't think I have a difficult time understanding people's content, though I may disagree with it. In this case, the form of the argument is crucial *because* I disagree with the content. I will be unable to be convinced by a person who uses invalid forms of argument.\n\nI've seen you on this forum and I've always been impressed by how reasonable you seem. Assuming the problem is calling out the fallacy and you decide not to do so, how can the conversation possibly evolve from there? You've noticed that your partner is using privileged logic in favor of their position and to the detriment of yours. How can you participate in that system without demonstrating the system to be flawed?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think I have a difficult time understanding people&amp;#39;s content, though I may disagree with it. In this case, the form of the argument is crucial &lt;em&gt;because&lt;/em&gt; I disagree with the content. I will be unable to be convinced by a person who uses invalid forms of argument.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen you on this forum and I&amp;#39;ve always been impressed by how reasonable you seem. Assuming the problem is calling out the fallacy and you decide not to do so, how can the conversation possibly evolve from there? You&amp;#39;ve noticed that your partner is using privileged logic in favor of their position and to the detriment of yours. How can you participate in that system without demonstrating the system to be flawed?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdwl1q", "score_hidden": true, "stickied": false, "created": 1492483106.0, "created_utc": 1492454306.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvndt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PreacherJudge", "parent_id": "t3_65wycd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "One very terrible trend in internet discourse is the exclusive focus of so many people on The Gotcha.  \"You say you care about racism, but *you're the real racist*!\"  \"Why are you talking about this if you can't even be reasonable?\"  \"It looks like all you have is ad hominems, so I guess you don't have anything worthwhile to say.\"\n\nThese never have anything to do with the actual IDEAS purportedly being discussed, but they're also often immediately emotionally rewarding.  You get to be smarter than that other guy, because you turned his own words against him and you knew a smarty-pants latin phrase!  People are motivated to do inherently rewarding things.  It all spirals.\n\nThe problem is, this runs the danger of focusing people exclusively on form and not content, and even worse, it runs the danger of keeping people from CARING about content.  Who cares what you're talking about if you can memorize a list of fallacies to throw in people's faces?  Who cares about being right yourself when you have so many ways to call your opponents wrong?\n\nThis isn't to say that talking about fallacies is useless.  But if anything, people ALREADY do it too MUCH.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One very terrible trend in internet discourse is the exclusive focus of so many people on The Gotcha.  &amp;quot;You say you care about racism, but &lt;em&gt;you&amp;#39;re the real racist&lt;/em&gt;!&amp;quot;  &amp;quot;Why are you talking about this if you can&amp;#39;t even be reasonable?&amp;quot;  &amp;quot;It looks like all you have is ad hominems, so I guess you don&amp;#39;t have anything worthwhile to say.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;These never have anything to do with the actual IDEAS purportedly being discussed, but they&amp;#39;re also often immediately emotionally rewarding.  You get to be smarter than that other guy, because you turned his own words against him and you knew a smarty-pants latin phrase!  People are motivated to do inherently rewarding things.  It all spirals.&lt;/p&gt;\n\n&lt;p&gt;The problem is, this runs the danger of focusing people exclusively on form and not content, and even worse, it runs the danger of keeping people from CARING about content.  Who cares what you&amp;#39;re talking about if you can memorize a list of fallacies to throw in people&amp;#39;s faces?  Who cares about being right yourself when you have so many ways to call your opponents wrong?&lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t to say that talking about fallacies is useless.  But if anything, people ALREADY do it too MUCH.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdvndt", "score_hidden": true, "stickied": false, "created": 1492482053.0, "created_utc": 1492453253.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": "", "user_reports": [], "id": "dgdvyki", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgduj6q", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;\"A person rarely changes their mind jsut becasue someone points out an argument is fallacious\"\n\nMy view extends to my participation as well. In this case, pointing out their bad argument doesn't just serve my purpose in trying to prove something to them, it also refers to the utility of understanding if I'm wrong. If the person making the fallacious argument actually is actually correct in their claim, then I cannot know it if all they provide is fallacious arguments and defense of fallacious arguments.\n\n&gt;pointing out possible or actual fallacies in the reasoning of other helps you and others notice these fallacies in that argument and then hopefully in others.\n\nThis is why in my \"best practices\" section I still insist on demonstrating the fallacy, but I won't waste my time in case they are using these arguments to mislead on purpose.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;A person rarely changes their mind jsut becasue someone points out an argument is fallacious&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;My view extends to my participation as well. In this case, pointing out their bad argument doesn&amp;#39;t just serve my purpose in trying to prove something to them, it also refers to the utility of understanding if I&amp;#39;m wrong. If the person making the fallacious argument actually is actually correct in their claim, then I cannot know it if all they provide is fallacious arguments and defense of fallacious arguments.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;pointing out possible or actual fallacies in the reasoning of other helps you and others notice these fallacies in that argument and then hopefully in others.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is why in my &amp;quot;best practices&amp;quot; section I still insist on demonstrating the fallacy, but I won&amp;#39;t waste my time in case they are using these arguments to mislead on purpose.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdvyki", "score_hidden": true, "stickied": false, "created": 1492482401.0, "created_utc": 1492453601.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgduj6q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BlckJck103", "parent_id": "t3_65wycd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think you should narrow your CMV to \"A person rarely changes their mind jsut becasue someone points out an argument is fallacious\".\n\nThere's a regular CMV of \"Debating doesn't matter because I don't change their mind\". Which misses the point that a debate has an audience and is just as useful for you to define you own opinions as it is to change other peoples. You also might have an effect on the audience as well.\n\nIn a similar way, pointing out possible or actual fallacies in the reasoning of other helps you and others notice these fallacies in that argument and then hopefully in others. Even the though the person won't change their mind on their position even they might understand more about their reasoning on it.\n\nTo your direct point though; being able to walk away from a discussion (especially online) is also useful. I think most people on this subreddit will know that there's sometimes a view that just isn't going to be changed and the discussion is going nowhere. In the situation you describe it provides an indicator that the person may not be willing to actually have a discussion in the first place. If see 10 replies all pointing out major flaws and all the replys are \"No you're just wrong\" then it's probably not worth my time trying to engage in the discussion either.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you should narrow your CMV to &amp;quot;A person rarely changes their mind jsut becasue someone points out an argument is fallacious&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a regular CMV of &amp;quot;Debating doesn&amp;#39;t matter because I don&amp;#39;t change their mind&amp;quot;. Which misses the point that a debate has an audience and is just as useful for you to define you own opinions as it is to change other peoples. You also might have an effect on the audience as well.&lt;/p&gt;\n\n&lt;p&gt;In a similar way, pointing out possible or actual fallacies in the reasoning of other helps you and others notice these fallacies in that argument and then hopefully in others. Even the though the person won&amp;#39;t change their mind on their position even they might understand more about their reasoning on it.&lt;/p&gt;\n\n&lt;p&gt;To your direct point though; being able to walk away from a discussion (especially online) is also useful. I think most people on this subreddit will know that there&amp;#39;s sometimes a view that just isn&amp;#39;t going to be changed and the discussion is going nowhere. In the situation you describe it provides an indicator that the person may not be willing to actually have a discussion in the first place. If see 10 replies all pointing out major flaws and all the replys are &amp;quot;No you&amp;#39;re just wrong&amp;quot; then it&amp;#39;s probably not worth my time trying to engage in the discussion either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgduj6q", "score_hidden": true, "stickied": false, "created": 1492480807.0, "created_utc": 1492452007.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": "", "user_reports": [], "id": "dgdwbv8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Havenkeld", "parent_id": "t1_dgdvhjt", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I strongly disagree that the wording doesn't matter. Even adjusting \"your reasoning is incorrect\" to a more inquiring phrase like \"...but how does X follow from Y?\" make a difference in my experience. As, I think, can explaining and demonstrating the problem in logic, or guiding a person to that recognition with inquiry, before labeling it a fallacy. You have to adjust your language according to the experience and maturity of who you're discussing/debating, and usually on the internet it's with a younger and more egotistic demographic. This may mean more time consuming and... I guess I'd just say annoying conversations, but if you're not up for that you're wasting your time with most people regardless of the fallacy issue in particular.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I strongly disagree that the wording doesn&amp;#39;t matter. Even adjusting &amp;quot;your reasoning is incorrect&amp;quot; to a more inquiring phrase like &amp;quot;...but how does X follow from Y?&amp;quot; make a difference in my experience. As, I think, can explaining and demonstrating the problem in logic, or guiding a person to that recognition with inquiry, before labeling it a fallacy. You have to adjust your language according to the experience and maturity of who you&amp;#39;re discussing/debating, and usually on the internet it&amp;#39;s with a younger and more egotistic demographic. This may mean more time consuming and... I guess I&amp;#39;d just say annoying conversations, but if you&amp;#39;re not up for that you&amp;#39;re wasting your time with most people regardless of the fallacy issue in particular.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdwbv8", "score_hidden": true, "stickied": false, "created": 1492482820.0, "created_utc": 1492454020.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvhjt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdu02p", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "From my post:\n\n&gt;I call them on it directly and explain why it is fallacious\n\nI'm in the practice of making sure why I am perceiving their argument as fallacious. The use of \"call out\" through out the rest of the post is meant to imply the entire act of pointing it out and explaining its fallacious nature. \n\n&gt;The demonstration or explanation of the problem in the logic is the important thing\n\nTo me, I don't think the wording matters. A person might have a negative reaction to the word \"fallacy\", but even if one uses euphemism the contention is still \"your reasoning is incorrect\", and that's contentious.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From my post:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I call them on it directly and explain why it is fallacious&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m in the practice of making sure why I am perceiving their argument as fallacious. The use of &amp;quot;call out&amp;quot; through out the rest of the post is meant to imply the entire act of pointing it out and explaining its fallacious nature. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The demonstration or explanation of the problem in the logic is the important thing&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To me, I don&amp;#39;t think the wording matters. A person might have a negative reaction to the word &amp;quot;fallacy&amp;quot;, but even if one uses euphemism the contention is still &amp;quot;your reasoning is incorrect&amp;quot;, and that&amp;#39;s contentious.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdvhjt", "score_hidden": true, "stickied": false, "created": 1492481871.0, "created_utc": 1492453071.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdu02p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Havenkeld", "parent_id": "t3_65wycd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "If you're just saying \"that's X fallacy\", sure, it's rarely going to get good reactions from people. I think if you demonstrate how it's a fallacy, then it's not as problematic. Toning down the confrontational nature is important, especially since many people understand fallacy to simply mean \"you're wrong\".\n\nSo it depends on how you're \"calling out\" or what you mean by \"calling out\". In my opinion, from my experience, if using the word fallacy is necessary to qualify something as calling out a fallacy, then I disagree that it must occur for the conversation to get past a fallacy. If not, then I disagree that it rarely provides a positive effect - it becomes a matter of tactfulness in how you address a fallacy at that point. \n\nThe demonstration or explanation of the problem in the logic is the important thing, not whether it's directly referred to as a fallacy - which I think is rarely useful. I also don't think everything people call a fallacy is one, so I disagree that a person defending an argument as not fallacious should be immediately disengaged from.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re just saying &amp;quot;that&amp;#39;s X fallacy&amp;quot;, sure, it&amp;#39;s rarely going to get good reactions from people. I think if you demonstrate how it&amp;#39;s a fallacy, then it&amp;#39;s not as problematic. Toning down the confrontational nature is important, especially since many people understand fallacy to simply mean &amp;quot;you&amp;#39;re wrong&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;So it depends on how you&amp;#39;re &amp;quot;calling out&amp;quot; or what you mean by &amp;quot;calling out&amp;quot;. In my opinion, from my experience, if using the word fallacy is necessary to qualify something as calling out a fallacy, then I disagree that it must occur for the conversation to get past a fallacy. If not, then I disagree that it rarely provides a positive effect - it becomes a matter of tactfulness in how you address a fallacy at that point. &lt;/p&gt;\n\n&lt;p&gt;The demonstration or explanation of the problem in the logic is the important thing, not whether it&amp;#39;s directly referred to as a fallacy - which I think is rarely useful. I also don&amp;#39;t think everything people call a fallacy is one, so I disagree that a person defending an argument as not fallacious should be immediately disengaged from.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdu02p", "score_hidden": true, "stickied": false, "created": 1492480230.0, "created_utc": 1492451430.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dge22t2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dge0nxe", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm asking you to be direct. Assume I'm willing to be wrong here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m asking you to be direct. Assume I&amp;#39;m willing to be wrong here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge22t2", "score_hidden": true, "stickied": false, "created": 1492489312.0, "created_utc": 1492460512.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge0nxe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bguy74", "parent_id": "t1_dge0c5g", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Of course you can't.  Thats the point.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of course you can&amp;#39;t.  Thats the point.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge0nxe", "score_hidden": true, "stickied": false, "created": 1492487727.0, "created_utc": 1492458927.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge0c5g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dge07u2", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "What fallacies are those? I can't see where you've shown my argument to be fallacious, so I don't think my post would apply to this case.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What fallacies are those? I can&amp;#39;t see where you&amp;#39;ve shown my argument to be fallacious, so I don&amp;#39;t think my post would apply to this case.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge0c5g", "score_hidden": true, "stickied": false, "created": 1492487360.0, "created_utc": 1492458560.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge07u2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bguy74", "parent_id": "t1_dgdzkln", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm simply suggesting that your resistance to a very reasonable argument, one that points out many fallacies in your position, is something you're stubbornly resisting.  If it doesn't provide a \"positive effect\" should I then retreat to the position you've taken in your post?  Is your analysis of what happens when you put forward an argument an accurate analysis of what is happening here?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m simply suggesting that your resistance to a very reasonable argument, one that points out many fallacies in your position, is something you&amp;#39;re stubbornly resisting.  If it doesn&amp;#39;t provide a &amp;quot;positive effect&amp;quot; should I then retreat to the position you&amp;#39;ve taken in your post?  Is your analysis of what happens when you put forward an argument an accurate analysis of what is happening here?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge07u2", "score_hidden": true, "stickied": false, "created": 1492487225.0, "created_utc": 1492458425.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzkln", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdyf23", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You're entitled to your feelings, but I'm also not very concerned with them. This post, however, is about my views. This is why I'm expressing them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re entitled to your feelings, but I&amp;#39;m also not very concerned with them. This post, however, is about my views. This is why I&amp;#39;m expressing them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdzkln", "score_hidden": true, "stickied": false, "created": 1492486502.0, "created_utc": 1492457702.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdyf23", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bguy74", "parent_id": "t1_dgdy83q", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So..here I am discussing something with you.  I believe you are being irrational, short-sighted, looking for something in a momentary discussion you should not reasonably expect given what we know about human nature.  You're seeing 'bad outcomes' in an online forum where you should expect no more or less of an outcome than words on a screen.  You shouldn't be so stubborn to expect instantaneous response and turn-of-position even from your most compelling argument.\n\nWhy should I not feel about you right now how you feel about these people?  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So..here I am discussing something with you.  I believe you are being irrational, short-sighted, looking for something in a momentary discussion you should not reasonably expect given what we know about human nature.  You&amp;#39;re seeing &amp;#39;bad outcomes&amp;#39; in an online forum where you should expect no more or less of an outcome than words on a screen.  You shouldn&amp;#39;t be so stubborn to expect instantaneous response and turn-of-position even from your most compelling argument.&lt;/p&gt;\n\n&lt;p&gt;Why should I not feel about you right now how you feel about these people?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdyf23", "score_hidden": true, "stickied": false, "created": 1492485184.0, "created_utc": 1492456384.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdy83q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdx2e3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm making a judgement about the people I'm talking with, not the world. I'm willing to believe that people are capable of getting over flawed reasoning, but more often than not this leads to bad outcomes , specifically to me. If the person is too stubborn or aren't seeing things clearly, wasting my time going posts deep with them isn't going to help them, and pursuing them rhetorically can lead them to viewing me as the bad guy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m making a judgement about the people I&amp;#39;m talking with, not the world. I&amp;#39;m willing to believe that people are capable of getting over flawed reasoning, but more often than not this leads to bad outcomes , specifically to me. If the person is too stubborn or aren&amp;#39;t seeing things clearly, wasting my time going posts deep with them isn&amp;#39;t going to help them, and pursuing them rhetorically can lead them to viewing me as the bad guy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdy83q", "score_hidden": true, "stickied": false, "created": 1492484966.0, "created_utc": 1492456166.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdx2e3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bguy74", "parent_id": "t1_dgdw85a", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The people making their fallacious claim also don't think they are often wrong, needless to say.  \n\nI think the important missing point is that many people will argue a position until it falls apart and then take that as a learning to the next conversation.  You're making a judgment about the world based only on singular point-in-time interactions.  \n\nFor example, in 3rd grade I stubbornly insisted that fraction division didn't make any sense at all because multiplication should always make a number bigger than the biggest input.  Needless to say, I was very wrong.  Should my teacher believe that still here today because of my stubborn insistence that day in class that I still don't believe that 100 x (1/2) could possibly be 50?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The people making their fallacious claim also don&amp;#39;t think they are often wrong, needless to say.  &lt;/p&gt;\n\n&lt;p&gt;I think the important missing point is that many people will argue a position until it falls apart and then take that as a learning to the next conversation.  You&amp;#39;re making a judgment about the world based only on singular point-in-time interactions.  &lt;/p&gt;\n\n&lt;p&gt;For example, in 3rd grade I stubbornly insisted that fraction division didn&amp;#39;t make any sense at all because multiplication should always make a number bigger than the biggest input.  Needless to say, I was very wrong.  Should my teacher believe that still here today because of my stubborn insistence that day in class that I still don&amp;#39;t believe that 100 x (1/2) could possibly be 50?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdx2e3", "score_hidden": true, "stickied": false, "created": 1492483652.0, "created_utc": 1492454852.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdw85a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgduzsk", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You're right, my post assumes that I'm accurate in calling out the fallacy. However, I don't think I'm often wrong. If I'm calling someone on a fallacy it is most certainly because the fallacy is obvious.\n\nExplaining a misunderstanding is different than defending a dishonest argument, and to me the difference seems pretty clear on a case by case basis. If I point out a fallacy and they clear up what they meant, then the \"best practices\" won't apply.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right, my post assumes that I&amp;#39;m accurate in calling out the fallacy. However, I don&amp;#39;t think I&amp;#39;m often wrong. If I&amp;#39;m calling someone on a fallacy it is most certainly because the fallacy is obvious.&lt;/p&gt;\n\n&lt;p&gt;Explaining a misunderstanding is different than defending a dishonest argument, and to me the difference seems pretty clear on a case by case basis. If I point out a fallacy and they clear up what they meant, then the &amp;quot;best practices&amp;quot; won&amp;#39;t apply.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdw85a", "score_hidden": true, "stickied": false, "created": 1492482700.0, "created_utc": 1492453900.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgduzsk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bguy74", "parent_id": "t3_65wycd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Firstly, consider what you have access to - a single transaction at a point in time.  What you don't know is what happens later.  In the context that actually matters - not the one that involves your ego, their ego, etc. - I suspect more people learn from those interactions than you suspect.  \n\nYou did leave out the \"you're wrong\".  There are many times when people think something is fallacious, but they simply have misunderstood or don't understand the original post (either truly don't get it, or it it was poorly communicated).  This one also happens a fair bit!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Firstly, consider what you have access to - a single transaction at a point in time.  What you don&amp;#39;t know is what happens later.  In the context that actually matters - not the one that involves your ego, their ego, etc. - I suspect more people learn from those interactions than you suspect.  &lt;/p&gt;\n\n&lt;p&gt;You did leave out the &amp;quot;you&amp;#39;re wrong&amp;quot;.  There are many times when people think something is fallacious, but they simply have misunderstood or don&amp;#39;t understand the original post (either truly don&amp;#39;t get it, or it it was poorly communicated).  This one also happens a fair bit!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgduzsk", "score_hidden": true, "stickied": false, "created": 1492481317.0, "created_utc": 1492452517.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": "", "user_reports": [], "id": "dge560z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thereasonableman_", "parent_id": "t1_dgdx51a", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It doesn't rest on any one thing. It's evidence of what should be done and it's good evidence. If two random people with no science background are debating if vaccines cause autism, the weight of the medical consensus on the issue is great evidence. You are going to arrive at the right answer on complex medical issues more often by listening to people who are well educated on the topic and have studied the issue. You aren't going to be able to reason the correct answer yourself unless you are going to spend a year on the topic which isn't feasible. ", "edited": 1492464857.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It doesn&amp;#39;t rest on any one thing. It&amp;#39;s evidence of what should be done and it&amp;#39;s good evidence. If two random people with no science background are debating if vaccines cause autism, the weight of the medical consensus on the issue is great evidence. You are going to arrive at the right answer on complex medical issues more often by listening to people who are well educated on the topic and have studied the issue. You aren&amp;#39;t going to be able to reason the correct answer yourself unless you are going to spend a year on the topic which isn&amp;#39;t feasible. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge560z", "score_hidden": true, "stickied": false, "created": 1492492835.0, "created_utc": 1492464035.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdx51a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdvwag", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "The problem with this is then that an argument about the intentions of a law now rests of the credentials of certain people rather than really engaging with what ought to be done.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem with this is then that an argument about the intentions of a law now rests of the credentials of certain people rather than really engaging with what ought to be done.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdx51a", "score_hidden": true, "stickied": false, "created": 1492483736.0, "created_utc": 1492454936.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvwag", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thereasonableman_", "parent_id": "t1_dgdvmji", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It doesn't prove something, it is evidence of something. Most things that people argue about aren't going to be able to be definitively shown be to be true or false. \n\nFor example, if I'm debating with someone if the 14th Amendment meant to apply the Bill of Rights against the states, no one can be proven right or wrong. All you can do is provide evidence. If literally every person who has studied the congressional record and the language etc says it was, then that is very good evidence for the position.\n\nExperts are going to be right far more often than non-experts so their opinions constitute evidence.  I'm better off trusting doctors that vaccines cause autism than trying to figure it out for myself or basing my opinion off some random blog. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It doesn&amp;#39;t prove something, it is evidence of something. Most things that people argue about aren&amp;#39;t going to be able to be definitively shown be to be true or false. &lt;/p&gt;\n\n&lt;p&gt;For example, if I&amp;#39;m debating with someone if the 14th Amendment meant to apply the Bill of Rights against the states, no one can be proven right or wrong. All you can do is provide evidence. If literally every person who has studied the congressional record and the language etc says it was, then that is very good evidence for the position.&lt;/p&gt;\n\n&lt;p&gt;Experts are going to be right far more often than non-experts so their opinions constitute evidence.  I&amp;#39;m better off trusting doctors that vaccines cause autism than trying to figure it out for myself or basing my opinion off some random blog. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdvwag", "score_hidden": true, "stickied": false, "created": 1492482330.0, "created_utc": 1492453530.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvmji", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mitoza", "parent_id": "t1_dgdu1o7", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Something can be great evidence even if it is a logical fallacy\n\nI would ask for more justification of this. To me, the use of a logical fallacy immediately diminishes something as proof of anything. While the claim may still be correct that the argument is trying to prove, the fallacy does not serve that utility. While it may be \"good enough\" for people who want to believe or are ignorant of the issue, it is completely useless for contentious debates.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Something can be great evidence even if it is a logical fallacy&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I would ask for more justification of this. To me, the use of a logical fallacy immediately diminishes something as proof of anything. While the claim may still be correct that the argument is trying to prove, the fallacy does not serve that utility. While it may be &amp;quot;good enough&amp;quot; for people who want to believe or are ignorant of the issue, it is completely useless for contentious debates.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdvmji", "score_hidden": true, "stickied": false, "created": 1492482027.0, "created_utc": 1492453227.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdu1o7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thereasonableman_", "parent_id": "t3_65wycd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Criticizing sound arguments as logical fallacies often should not be done.  Something can be great evidence even if it is a logical fallacy. This often occurs in the case of \"appeal to authority\" type arguments.\n\nVirtually every single doctor on the planet believes that vaccines don't cause autism.  The fact that doctors have studied the issue and don't think vaccines cause autism is a great argument for the fact that vaccines don't cause autism.  It doesn't logically prove that vaccines don't cause autism, but it's great evidence.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Criticizing sound arguments as logical fallacies often should not be done.  Something can be great evidence even if it is a logical fallacy. This often occurs in the case of &amp;quot;appeal to authority&amp;quot; type arguments.&lt;/p&gt;\n\n&lt;p&gt;Virtually every single doctor on the planet believes that vaccines don&amp;#39;t cause autism.  The fact that doctors have studied the issue and don&amp;#39;t think vaccines cause autism is a great argument for the fact that vaccines don&amp;#39;t cause autism.  It doesn&amp;#39;t logically prove that vaccines don&amp;#39;t cause autism, but it&amp;#39;s great evidence.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgdu1o7", "score_hidden": true, "stickied": false, "created": 1492480279.0, "created_utc": 1492451479.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": "", "user_reports": [], "id": "dge3xf5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ralph-j", "parent_id": "t3_65wycd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Perhaps it won't often have a positive effect on the direct interlocutor, but maybe the wider audience, e.g. in online debates or public debates.\n\nFor example, presenters of the [Atheist Experience](http://www.atheist-experience.com/) TV show/webcast regularly report that they get e-mails from viewers who have begun to doubt their own bad reasoning, precisely because similar cases of bad reasoning (by callers to the show) were pointed out by the presenters.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Perhaps it won&amp;#39;t often have a positive effect on the direct interlocutor, but maybe the wider audience, e.g. in online debates or public debates.&lt;/p&gt;\n\n&lt;p&gt;For example, presenters of the &lt;a href=\"http://www.atheist-experience.com/\"&gt;Atheist Experience&lt;/a&gt; TV show/webcast regularly report that they get e-mails from viewers who have begun to doubt their own bad reasoning, precisely because similar cases of bad reasoning (by callers to the show) were pointed out by the presenters.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge3xf5", "score_hidden": true, "stickied": false, "created": 1492491376.0, "created_utc": 1492462576.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65wycd", "likes": null, "replies": "", "user_reports": [], "id": "dge10cg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LUClEN", "parent_id": "t3_65wycd", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "This depends entirely on who is involved in the discussion. I post in quite a few places where outcome 1 and 2 happen. Outside of philosophy circles, it's helpful to explain why the argument doesn't follow rather than just naming the fallacy. People aren't always acquainted with the jargon ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This depends entirely on who is involved in the discussion. I post in quite a few places where outcome 1 and 2 happen. Outside of philosophy circles, it&amp;#39;s helpful to explain why the argument doesn&amp;#39;t follow rather than just naming the fallacy. People aren&amp;#39;t always acquainted with the jargon &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge10cg", "score_hidden": true, "stickied": false, "created": 1492488116.0, "created_utc": 1492459316.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]