[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just a quick backstory of myself because I know this will push buttons from the get go. Also, this is an opinion piece, so I&amp;#39;m completely open to statistics/research as long as they are properly cited, come from some form of accredited journal or study, and explain the subject matter (correlation != causation). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a mixed race american born to African (black) and American (white) parents. I spent all of my schooling (besides high school) around the world mainly in Africa and the Middle East.  &lt;/p&gt;\n\n&lt;p&gt;I went to high school in the U.S (the south, and which is kind of were this issue stems from), and then joined the Marine Corps. I&amp;#39;m out now and currently studying physics on a moderately liberal university in Virginia. &lt;/p&gt;\n\n&lt;p&gt;What I have noticed living in both the northern and southern america as well as both coasts. Is the American obsession with diversity; now I don&amp;#39;t want to make my point coming off as I&amp;#39;m anti-diversity (I wouldn&amp;#39;t be alive if it that was the case). &lt;/p&gt;\n\n&lt;p&gt;My point is with racial tensions growing and the increased social awareness of minorities (to include, race, gender, orientation). I feel that as American&amp;#39;s increasingly align themselves to some specific identity, they inadvertently separate themselves from values that are typically representative of a democratic state such as unity, equality (or more accurately, equity), and tolerance. &lt;/p&gt;\n\n&lt;p&gt;A great example of this is race. Because I&amp;#39;m a weird shade of brown, thats typically the first thing people ask me about. Rather than give a genealogy lesson I just say I&amp;#39;m 50/50 white/black. Which can elicit responses such as: &amp;quot;Your accepted by both groups then!&amp;quot; To which I find hilariously false, I&amp;#39;m an oddity in both circles, from experience. I&amp;#39;m told to celebrate my heritage to which I have no attachment to on either side because I don&amp;#39;t fit in either circle. &lt;/p&gt;\n\n&lt;p&gt;Growing up in the international community and having experiences with people of all socio-economic backgrounds taught me one thing: Everyone is human. This was also a central ideologue in the military: We were all equally worthless. &lt;/p&gt;\n\n&lt;p&gt;Further than that, entering scientific community has taught me one thing is that, it doesn&amp;#39;t matter who or what you are, but are you curious?&lt;/p&gt;\n\n&lt;p&gt;So TL;DR, unchecked emphasis on diversity is have a hypocritical nature on what it means to be american.&lt;/p&gt;\n\n&lt;p&gt;Whats my view to be changed: Diversity must have a limit. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;This is a footnote from the CMV moderators. We&amp;#39;d like to remind you of a couple of things. Firstly, please&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules\"&gt;read through our rules&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting\"&gt;downvotes don&amp;#39;t change views&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;! Any questions or concerns? Feel free to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/message/compose?to=/r/changemyview\"&gt;message us&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;Happy CMVing!&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Just a quick backstory of myself because I know this will push buttons from the get go. Also, this is an opinion piece, so I'm completely open to statistics/research as long as they are properly cited, come from some form of accredited journal or study, and explain the subject matter (correlation != causation). \n\nI'm a mixed race american born to African (black) and American (white) parents. I spent all of my schooling (besides high school) around the world mainly in Africa and the Middle East.  \n\nI went to high school in the U.S (the south, and which is kind of were this issue stems from), and then joined the Marine Corps. I'm out now and currently studying physics on a moderately liberal university in Virginia. \n\nWhat I have noticed living in both the northern and southern america as well as both coasts. Is the American obsession with diversity; now I don't want to make my point coming off as I'm anti-diversity (I wouldn't be alive if it that was the case). \n\nMy point is with racial tensions growing and the increased social awareness of minorities (to include, race, gender, orientation). I feel that as American's increasingly align themselves to some specific identity, they inadvertently separate themselves from values that are typically representative of a democratic state such as unity, equality (or more accurately, equity), and tolerance. \n\nA great example of this is race. Because I'm a weird shade of brown, thats typically the first thing people ask me about. Rather than give a genealogy lesson I just say I'm 50/50 white/black. Which can elicit responses such as: \"Your accepted by both groups then!\" To which I find hilariously false, I'm an oddity in both circles, from experience. I'm told to celebrate my heritage to which I have no attachment to on either side because I don't fit in either circle. \n\nGrowing up in the international community and having experiences with people of all socio-economic backgrounds taught me one thing: Everyone is human. This was also a central ideologue in the military: We were all equally worthless. \n\nFurther than that, entering scientific community has taught me one thing is that, it doesn't matter who or what you are, but are you curious?\n\nSo TL;DR, unchecked emphasis on diversity is have a hypocritical nature on what it means to be american.\n\nWhats my view to be changed: Diversity must have a limit. \n\n_____\n\n&gt; *This is a footnote from the CMV moderators. We'd like to remind you of a couple of things. Firstly, please* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "[∆(s) from OP]", "id": "65y0lb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "KingOoblar", "saved": false, "mod_reports": [], "name": "t3_65y0lb", "subreddit_name_prefixed": "r/changemyview", "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": false, "link_flair_css_class": "OPdelta", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/changemyview/comments/65y0lb/cmv_americas_emphasis_on_diversity_has_gone_too/", "num_reports": null, "locked": false, "stickied": false, "created": 1492488622.0, "url": "https://www.reddit.com/r/changemyview/comments/65y0lb/cmv_americas_emphasis_on_diversity_has_gone_too/", "author_flair_text": null, "quarantine": false, "title": "CMV: America's emphasis on diversity has gone too far.", "created_utc": 1492459822.0, "distinguished": null, "media": null, "upvote_ratio": 0.7, "num_comments": 30, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": "", "user_reports": [], "id": "dge8q37", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t3_65y0lb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "/u/KingOoblar (OP) has awarded 1 delta in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [**here**](/r/DeltaLog/comments/65yw30), in /r/DeltaLog.\n\nPlease note that a change of view [doesn't necessarily mean a reversal](https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F), or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/KingOoblar\"&gt;/u/KingOoblar&lt;/a&gt; (OP) has awarded 1 delta in this post.&lt;/p&gt;\n\n&lt;p&gt;All comments that earned deltas (from OP or other users) are listed &lt;a href=\"/r/DeltaLog/comments/65yw30\"&gt;&lt;strong&gt;here&lt;/strong&gt;&lt;/a&gt;, in &lt;a href=\"/r/DeltaLog\"&gt;/r/DeltaLog&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Please note that a change of view &lt;a href=\"https://www.reddit.com/r/changemyview/wiki/index#wiki_what_is_a_.27view.27.3F\"&gt;doesn&amp;#39;t necessarily mean a reversal&lt;/a&gt;, or that the conversation has ended.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge8q37", "score_hidden": true, "stickied": true, "created": 1492497280.0, "created_utc": 1492468480.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": "", "user_reports": [], "id": "dge6thu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KingOoblar", "parent_id": "t1_dge5d8l", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;I do not understand this statement. Do you agree diversity is at least an attempt of a people to step towards accepting the breadth of their culture? How can an attempt at accepting your uniqueness into a culture deny you access to that culture? And if that truly is the case, explain a situation that would allow you to be admitted into that culture.\n\nBy this I mean, people who don't have particular foundation in any one culture. Myself as an example, my mother is Ugandan and I grew up in Africa for a good part of my childhood. While some aspects of my life represent Ugandan values, I don't necessarily stake my life purpose on it. \n\nFast forward to America, and first day in high school. Besides people asking me what state Uganda was in, I was also looked at with skepticism by the african americans in the class and ridiculed as an \"oreo\" or \"not a real black man\" is what I was called. \nNow I'm not saying this is representative of all african americans, this highlighted the difference between africans and african americans in america for me at a young age.  \n\n&gt;I disagree. The last 200 years have greatly improved the social understanding of the average individual. Case in point: The average American is capable of reading. However it's best not to look at the progress of one individual. IQ is not a great measure, but it is a kind of measure. Think of the volume accumulated by the growth of intelligence when an entire population was taught to read within 1 or 2 generations. It's staggering.\n\nWhen in comparison to the rate that say the scientific community has evolved its horrendous, which is the point that I failed to clarify.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I do not understand this statement. Do you agree diversity is at least an attempt of a people to step towards accepting the breadth of their culture? How can an attempt at accepting your uniqueness into a culture deny you access to that culture? And if that truly is the case, explain a situation that would allow you to be admitted into that culture.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;By this I mean, people who don&amp;#39;t have particular foundation in any one culture. Myself as an example, my mother is Ugandan and I grew up in Africa for a good part of my childhood. While some aspects of my life represent Ugandan values, I don&amp;#39;t necessarily stake my life purpose on it. &lt;/p&gt;\n\n&lt;p&gt;Fast forward to America, and first day in high school. Besides people asking me what state Uganda was in, I was also looked at with skepticism by the african americans in the class and ridiculed as an &amp;quot;oreo&amp;quot; or &amp;quot;not a real black man&amp;quot; is what I was called. \nNow I&amp;#39;m not saying this is representative of all african americans, this highlighted the difference between africans and african americans in america for me at a young age.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I disagree. The last 200 years have greatly improved the social understanding of the average individual. Case in point: The average American is capable of reading. However it&amp;#39;s best not to look at the progress of one individual. IQ is not a great measure, but it is a kind of measure. Think of the volume accumulated by the growth of intelligence when an entire population was taught to read within 1 or 2 generations. It&amp;#39;s staggering.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;When in comparison to the rate that say the scientific community has evolved its horrendous, which is the point that I failed to clarify.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge6thu", "score_hidden": true, "stickied": false, "created": 1492494868.0, "created_utc": 1492466068.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge5d8l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bawiddah", "parent_id": "t1_dge4941", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; society moves at an agonizing and slow pace.\n\nI disagree. The last 200 years have greatly improved the social understanding of the average individual. Case in point: The average American is capable of reading. \nHowever it's best not to look at the progress of one individual. IQ is not a great measure, but it *is* a kind of measure. Think of the volume accumulated by the growth of intelligence when an entire population was taught to read within 1 or 2 generations. It's staggering.\n\n&gt; we have also alienated a growing number of people who don't have such concrete backgrounds in race or other social issues\n\nI do not understand this statement. Do you agree diversity is at least an attempt of a people to step towards accepting the breadth of their culture? How can an attempt at accepting your uniqueness into a culture deny you access to that culture? And if that truly is the case, explain a situation that would allow you to be admitted into that culture.\n\nIf there is an open door, you are free not to take it. But you can't acknowledge the door and then say there exists no passage for you to enter.\n\n&gt; A race car winning a race an crossing the finish line, but now its out of track so now its careening towards a cliff.\n\nArgument by analogy often fails. All I need to say in this case is that the car needs a better driver. However, I'll take you to mean that diversity is now running amok. \n\nI get the sense that perhaps your greatest concern is that you see the myriad of niches but find none holds a place specifically for you. Does this sound accurate? America is full families with inter-European lineages. It took a few generations for this to work, but ultimately it succeeded. Multiracial individuals face a similar issue. Before the issue was one of language and history. Now the issue is one of skin color. \n\nIt was hard for those Europeans to imagine a world where their history did not matter. It will be hard to imagine a world where skin color does not matter. But likely our ancestors will look back on this time and wonder what all the fuss was about.\n\nPerhaps this is a kind of answer. You are the one who must stake your claim to a plot of land. Excuse the colonialist language, but every peoples must send settlers to a land. Perhaps you are one of the first? Perhaps you have the unenviable and difficult position of planting a flag and acting as a beacon for the children yet to come. Multiracial families are the future. You are simply one of the first.\n\nAs for those who view the reality of a diverse nation as a a source of worry or fear or discomfort? We need to protect them, as we protect children who are afraid of the dark.", "edited": 1492465005.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;society moves at an agonizing and slow pace.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I disagree. The last 200 years have greatly improved the social understanding of the average individual. Case in point: The average American is capable of reading. \nHowever it&amp;#39;s best not to look at the progress of one individual. IQ is not a great measure, but it &lt;em&gt;is&lt;/em&gt; a kind of measure. Think of the volume accumulated by the growth of intelligence when an entire population was taught to read within 1 or 2 generations. It&amp;#39;s staggering.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;we have also alienated a growing number of people who don&amp;#39;t have such concrete backgrounds in race or other social issues&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I do not understand this statement. Do you agree diversity is at least an attempt of a people to step towards accepting the breadth of their culture? How can an attempt at accepting your uniqueness into a culture deny you access to that culture? And if that truly is the case, explain a situation that would allow you to be admitted into that culture.&lt;/p&gt;\n\n&lt;p&gt;If there is an open door, you are free not to take it. But you can&amp;#39;t acknowledge the door and then say there exists no passage for you to enter.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A race car winning a race an crossing the finish line, but now its out of track so now its careening towards a cliff.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Argument by analogy often fails. All I need to say in this case is that the car needs a better driver. However, I&amp;#39;ll take you to mean that diversity is now running amok. &lt;/p&gt;\n\n&lt;p&gt;I get the sense that perhaps your greatest concern is that you see the myriad of niches but find none holds a place specifically for you. Does this sound accurate? America is full families with inter-European lineages. It took a few generations for this to work, but ultimately it succeeded. Multiracial individuals face a similar issue. Before the issue was one of language and history. Now the issue is one of skin color. &lt;/p&gt;\n\n&lt;p&gt;It was hard for those Europeans to imagine a world where their history did not matter. It will be hard to imagine a world where skin color does not matter. But likely our ancestors will look back on this time and wonder what all the fuss was about.&lt;/p&gt;\n\n&lt;p&gt;Perhaps this is a kind of answer. You are the one who must stake your claim to a plot of land. Excuse the colonialist language, but every peoples must send settlers to a land. Perhaps you are one of the first? Perhaps you have the unenviable and difficult position of planting a flag and acting as a beacon for the children yet to come. Multiracial families are the future. You are simply one of the first.&lt;/p&gt;\n\n&lt;p&gt;As for those who view the reality of a diverse nation as a a source of worry or fear or discomfort? We need to protect them, as we protect children who are afraid of the dark.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge5d8l", "score_hidden": true, "stickied": false, "created": 1492493079.0, "created_utc": 1492464279.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge4941", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KingOoblar", "parent_id": "t1_dge2sih", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;if you're working in science, you likely accept that any model or simulation that is a step closer to reality is better than the previous one simply because it more accurately reflects reality. Better model, better experiments, better results.\n\nAgreed, while it is difficult to realize that the world doesn't operate on such simple principles it is nonetheless true, but even in the scientific community its generally accepted that social issues are a backseat unless it impedes progress. Case in point being how far science has made social strides since the enlightenment, society moves at an agonizing and slow pace.   \n\n&gt;The increased emphasis on diversity is a direct result of individual societies recognizing true breadth of their cultures. Diversity is an attempt to accept the reality of the culture as it stands today. It often fails. The progress disappoints. But each step moves the assumed identity of a culture closer towards the reality of that culture.\n\nWhile this may be true, I feel my point could be analogous to say: A race car winning a race an crossing the finish line, but now its out of track so now its careening towards a cliff. \n\nWith the increased social awareness that we have, we have also alienated a growing number of people who don't have such concrete backgrounds in race or other social issues (me for example), people who's cultural identity is hybrid (* gasp * appropriation ) and patchwork. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;if you&amp;#39;re working in science, you likely accept that any model or simulation that is a step closer to reality is better than the previous one simply because it more accurately reflects reality. Better model, better experiments, better results.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Agreed, while it is difficult to realize that the world doesn&amp;#39;t operate on such simple principles it is nonetheless true, but even in the scientific community its generally accepted that social issues are a backseat unless it impedes progress. Case in point being how far science has made social strides since the enlightenment, society moves at an agonizing and slow pace.   &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The increased emphasis on diversity is a direct result of individual societies recognizing true breadth of their cultures. Diversity is an attempt to accept the reality of the culture as it stands today. It often fails. The progress disappoints. But each step moves the assumed identity of a culture closer towards the reality of that culture.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;While this may be true, I feel my point could be analogous to say: A race car winning a race an crossing the finish line, but now its out of track so now its careening towards a cliff. &lt;/p&gt;\n\n&lt;p&gt;With the increased social awareness that we have, we have also alienated a growing number of people who don&amp;#39;t have such concrete backgrounds in race or other social issues (me for example), people who&amp;#39;s cultural identity is hybrid (* gasp * appropriation ) and patchwork. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge4941", "score_hidden": true, "stickied": false, "created": 1492491747.0, "created_utc": 1492462947.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge2sih", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bawiddah", "parent_id": "t3_65y0lb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "If you're working in science, you likely accept that any model or simulation that is a step closer to reality is better than the previous one simply because it more accurately reflects reality. Better model, better experiments, better results.\n\nThe increased emphasis on diversity is a direct result of individual societies recognizing true breadth of their cultures. Diversity is an attempt to accept the reality of the culture as it stands today. It often fails. The progress disappoints. But each step moves the assumed identity of a culture closer towards the reality of that culture.\n\nHowever I agree that American's are too closely aligning themselves with specific identities. People are being taught to adopt political positions as part of their identity. \"I am a Democrat.\" No. You are an American that agrees with specific portions of various political parties. Admitting one entire set of political viewpoints into yourself and adopting those beliefs as a portion of your identity is irresponsible and dangerous. When you've hooked ideology to personhood, then an insult to the party is a direct insult to your person. And now you'll have to deal with a lot of insults.\n\nBut as for diversity? The limits of diversity is the reality of your country. It's messy and confusing because all sorts of peoples and cultures intermixing is itself messy and confusing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re working in science, you likely accept that any model or simulation that is a step closer to reality is better than the previous one simply because it more accurately reflects reality. Better model, better experiments, better results.&lt;/p&gt;\n\n&lt;p&gt;The increased emphasis on diversity is a direct result of individual societies recognizing true breadth of their cultures. Diversity is an attempt to accept the reality of the culture as it stands today. It often fails. The progress disappoints. But each step moves the assumed identity of a culture closer towards the reality of that culture.&lt;/p&gt;\n\n&lt;p&gt;However I agree that American&amp;#39;s are too closely aligning themselves with specific identities. People are being taught to adopt political positions as part of their identity. &amp;quot;I am a Democrat.&amp;quot; No. You are an American that agrees with specific portions of various political parties. Admitting one entire set of political viewpoints into yourself and adopting those beliefs as a portion of your identity is irresponsible and dangerous. When you&amp;#39;ve hooked ideology to personhood, then an insult to the party is a direct insult to your person. And now you&amp;#39;ll have to deal with a lot of insults.&lt;/p&gt;\n\n&lt;p&gt;But as for diversity? The limits of diversity is the reality of your country. It&amp;#39;s messy and confusing because all sorts of peoples and cultures intermixing is itself messy and confusing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge2sih", "score_hidden": true, "stickied": false, "created": 1492490106.0, "created_utc": 1492461306.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": "", "user_reports": [], "id": "dgec0d8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zirconium", "parent_id": "t1_dge99mb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;  That was my whole point on the process of Science, they see issues that hinder our progress\n\nHistorically all male teams are less able to \"See\" the issues of women's health. So in the example of women's health the issue exists, but practically speaking tends to be unseen or under-championed until the \"identity politics\" of having actual women on a team happens.\n\nThe process of science exists on one level of scope while issues of diversity exist in a different one. Can science answer questions? Yes. Does science tell you what questions to ask? No.\n\n&gt;  While the problems aren't fixed, scientific hubs like silicon valley are feverishly looking for ways to solve them. Can the same be said for our government, or society outside of science or silicon valley?\n\nSilicon Valley has massive biases towards solving: 1. certain kinds of problems; 2. in specific ways. Either or both of those can become roadblocks in the way of solving issues effectively. Silicon Valley after all is not a process of science, it's a culture that tends towards valuing business investment and programming.\n\nMeanwhile government and society have the same problem of having bias towards certain problems, and solving them in particular ways. That's fine. Problems can be hard and unsatisfying and still be worth solving. A single tool can't fix all problems. That's life, and is not really a valid argument against using government or social forces to solve things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;That was my whole point on the process of Science, they see issues that hinder our progress&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Historically all male teams are less able to &amp;quot;See&amp;quot; the issues of women&amp;#39;s health. So in the example of women&amp;#39;s health the issue exists, but practically speaking tends to be unseen or under-championed until the &amp;quot;identity politics&amp;quot; of having actual women on a team happens.&lt;/p&gt;\n\n&lt;p&gt;The process of science exists on one level of scope while issues of diversity exist in a different one. Can science answer questions? Yes. Does science tell you what questions to ask? No.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;While the problems aren&amp;#39;t fixed, scientific hubs like silicon valley are feverishly looking for ways to solve them. Can the same be said for our government, or society outside of science or silicon valley?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Silicon Valley has massive biases towards solving: 1. certain kinds of problems; 2. in specific ways. Either or both of those can become roadblocks in the way of solving issues effectively. Silicon Valley after all is not a process of science, it&amp;#39;s a culture that tends towards valuing business investment and programming.&lt;/p&gt;\n\n&lt;p&gt;Meanwhile government and society have the same problem of having bias towards certain problems, and solving them in particular ways. That&amp;#39;s fine. Problems can be hard and unsatisfying and still be worth solving. A single tool can&amp;#39;t fix all problems. That&amp;#39;s life, and is not really a valid argument against using government or social forces to solve things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgec0d8", "score_hidden": true, "stickied": false, "created": 1492501561.0, "created_utc": 1492472761.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge99mb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KingOoblar", "parent_id": "t1_dge8o5g", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;You seem to be saying that people recognizing their unique experiences in life is an issue to overcome. Not everyone believes that. On the contrary, I would say that people being realistic about, and willing to represent, who they are and what their experiences in life have been is critical to the kind of forward moving society I want to live in. I believe our political, cultural, and economic concerns would all be improved by that. E.g. see how long it's taken for Silicon valley to begin thinking seriously about apps tracking women's health, and how weird the reception was when they first started appearing.\n\nThat was my whole point on the process of Science, they see issues that hinder our progress (i.e women's health issues, actually anyone's health issues), fix them(arguably they are not all fixed), so we can move towards larger objectives, say apps that can find cancer, or other life threatening diseases. \n\nWhile the problems aren't fixed, scientific hubs like silicon valley are feverishly looking for ways to solve them. Can the same be said for our government, or society outside of science or silicon valley?\n\n&gt;Finally, I'm a little suspicious of how you've avoiding bringing up specific examples. Can you tell us exactly what kinds of things you're talking about, hopefully examples that aren't outliers? And to provide context, you seem to be suggesting that something else should be tried, can you tell us what you think is being tried and what might be better?\n\nAs you should be, and as I a lot of these experiences are my own. I also welcomed the inclusion of facts, or a direction to find them (which you've done, and I am reading them). \n\nI also stated previously also that this was an opinion piece, and if a convincing argument is made I will gladly change my view or at least work towards understanding why I think this way. To which I did when /u/James_McNulty provided a convincing explanation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You seem to be saying that people recognizing their unique experiences in life is an issue to overcome. Not everyone believes that. On the contrary, I would say that people being realistic about, and willing to represent, who they are and what their experiences in life have been is critical to the kind of forward moving society I want to live in. I believe our political, cultural, and economic concerns would all be improved by that. E.g. see how long it&amp;#39;s taken for Silicon valley to begin thinking seriously about apps tracking women&amp;#39;s health, and how weird the reception was when they first started appearing.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That was my whole point on the process of Science, they see issues that hinder our progress (i.e women&amp;#39;s health issues, actually anyone&amp;#39;s health issues), fix them(arguably they are not all fixed), so we can move towards larger objectives, say apps that can find cancer, or other life threatening diseases. &lt;/p&gt;\n\n&lt;p&gt;While the problems aren&amp;#39;t fixed, scientific hubs like silicon valley are feverishly looking for ways to solve them. Can the same be said for our government, or society outside of science or silicon valley?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Finally, I&amp;#39;m a little suspicious of how you&amp;#39;ve avoiding bringing up specific examples. Can you tell us exactly what kinds of things you&amp;#39;re talking about, hopefully examples that aren&amp;#39;t outliers? And to provide context, you seem to be suggesting that something else should be tried, can you tell us what you think is being tried and what might be better?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As you should be, and as I a lot of these experiences are my own. I also welcomed the inclusion of facts, or a direction to find them (which you&amp;#39;ve done, and I am reading them). &lt;/p&gt;\n\n&lt;p&gt;I also stated previously also that this was an opinion piece, and if a convincing argument is made I will gladly change my view or at least work towards understanding why I think this way. To which I did when &lt;a href=\"/u/James_McNulty\"&gt;/u/James_McNulty&lt;/a&gt; provided a convincing explanation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge99mb", "score_hidden": true, "stickied": false, "created": 1492497992.0, "created_utc": 1492469192.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge8o5g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zirconium", "parent_id": "t1_dge77fq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;  \"over coming issues is central to the process of science. Not reiterating them louder and louder.\"\n\nYou seem to be saying that people recognizing their unique experiences in life is an issue to overcome. Not everyone believes that.\n\nOn the contrary, I would say that people being realistic about, and willing to represent, who they are and what their experiences in life have been is critical to the kind of forward moving society I want to live in. I believe our political, cultural, and economic concerns would all be improved by that. E.g. see how long it's taken for Silicon valley to begin thinking seriously about apps tracking women's health, and how weird the reception was when they first started appearing.\n\n&gt;  Yes but like politics that does nothing to solve the problem, in fact it states the complexity of the problem and states why nothing can be done about it, because its so complex. Its circular, and our failure realize that maybe we should try something else showing now.\n\nRecognizing that something is hard or has a reason for existing is not the same thing as saying it will never change. I have a feeling you might want to search this subreddit for people arguing that social science is not a science, and read the responses.\n\nFinally, I'm a little suspicious of how you've avoiding bringing up specific examples. Can you tell us exactly what kinds of things you're talking about, hopefully examples that aren't outliers? And to provide context, you seem to be suggesting that something else should be tried, can you tell us what you think is being tried and what might be better?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;over coming issues is central to the process of science. Not reiterating them louder and louder.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You seem to be saying that people recognizing their unique experiences in life is an issue to overcome. Not everyone believes that.&lt;/p&gt;\n\n&lt;p&gt;On the contrary, I would say that people being realistic about, and willing to represent, who they are and what their experiences in life have been is critical to the kind of forward moving society I want to live in. I believe our political, cultural, and economic concerns would all be improved by that. E.g. see how long it&amp;#39;s taken for Silicon valley to begin thinking seriously about apps tracking women&amp;#39;s health, and how weird the reception was when they first started appearing.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Yes but like politics that does nothing to solve the problem, in fact it states the complexity of the problem and states why nothing can be done about it, because its so complex. Its circular, and our failure realize that maybe we should try something else showing now.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Recognizing that something is hard or has a reason for existing is not the same thing as saying it will never change. I have a feeling you might want to search this subreddit for people arguing that social science is not a science, and read the responses.&lt;/p&gt;\n\n&lt;p&gt;Finally, I&amp;#39;m a little suspicious of how you&amp;#39;ve avoiding bringing up specific examples. Can you tell us exactly what kinds of things you&amp;#39;re talking about, hopefully examples that aren&amp;#39;t outliers? And to provide context, you seem to be suggesting that something else should be tried, can you tell us what you think is being tried and what might be better?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge8o5g", "score_hidden": true, "stickied": false, "created": 1492497210.0, "created_utc": 1492468410.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge77fq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KingOoblar", "parent_id": "t1_dge4ccz", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;When and where, do you think, was the correct sweet spot of just enough diversity, in our history?\n\nThis is a good point, that I frankly don't have an answer for. In truth we still don't have enough. My point is not in how much there is maybe, but the way it is being enacted. \n\n&gt;You named some naive attitudes, and some shortcomings of our culture, but it's not clear what model you have for a better one.\n\nThe best example could be the scientific community; albeit not perfect by a long shot, but recognizing and over coming issues is central to the process of science. Not reiterating them louder and louder. \n\n&gt;To me, the idea that our level of diversity is bad because we have racial tensions and detachment from society, is a bit like saying that democracy is bad because politiians lie and they are corrupt. They sure are, but less so than under any other system we have tried before.\n\nYes but like politics that does nothing to solve the problem, in fact it states the complexity of the problem and states why nothing can be done about it, because its so complex. Its circular, and our failure realize that maybe we should try something else showing now.\n\n&gt;Similarly, you might condemn our approach to diversity as being less than perfect. But at the same time, injustice against minorities exists, and past experience taught as that \"We are all just human, let's only appeal to generic human 'equality' without naming any group's grievances\" has always been the rhetoric of those who were intending to preserve the status quo.\n\nI replied in a previous post, to something like this. I know the value and necessity of diversity in a society, however I think my problem is less with how much there is, and more about how it is enacted. With that said, with the way diversity is enacted in the U.S, any gains from it will be lost if we stay on this course. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;When and where, do you think, was the correct sweet spot of just enough diversity, in our history?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is a good point, that I frankly don&amp;#39;t have an answer for. In truth we still don&amp;#39;t have enough. My point is not in how much there is maybe, but the way it is being enacted. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You named some naive attitudes, and some shortcomings of our culture, but it&amp;#39;s not clear what model you have for a better one.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The best example could be the scientific community; albeit not perfect by a long shot, but recognizing and over coming issues is central to the process of science. Not reiterating them louder and louder. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;To me, the idea that our level of diversity is bad because we have racial tensions and detachment from society, is a bit like saying that democracy is bad because politiians lie and they are corrupt. They sure are, but less so than under any other system we have tried before.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes but like politics that does nothing to solve the problem, in fact it states the complexity of the problem and states why nothing can be done about it, because its so complex. Its circular, and our failure realize that maybe we should try something else showing now.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Similarly, you might condemn our approach to diversity as being less than perfect. But at the same time, injustice against minorities exists, and past experience taught as that &amp;quot;We are all just human, let&amp;#39;s only appeal to generic human &amp;#39;equality&amp;#39; without naming any group&amp;#39;s grievances&amp;quot; has always been the rhetoric of those who were intending to preserve the status quo.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I replied in a previous post, to something like this. I know the value and necessity of diversity in a society, however I think my problem is less with how much there is, and more about how it is enacted. With that said, with the way diversity is enacted in the U.S, any gains from it will be lost if we stay on this course. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge77fq", "score_hidden": true, "stickied": false, "created": 1492495344.0, "created_utc": 1492466544.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge4ccz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Genoscythe_", "parent_id": "t3_65y0lb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "When and where, do you think, was the correct sweet spot of just enough diversity, in our history? \n\nWhen would have been someone with your ethnic background, be treated as **more of** \"just a human\", than today? \n\nYou named some naive attitudes, and some shortcomings of our culture, but it's not clear what model you have for a better one.\n\nTo me, the idea that our level of diversity is bad because we have racial tensions and detachment from society, is a bit like saying that democracy is bad because politiians lie and they are corrupt. They sure are, but less so than under any other system we have tried before. \n\nSimilarly, you might condemn our approach to diversity as being less than perfect. But at the same time, injustice against minorities exists, and past experience taught as that \"We are all just human, let's only appeal to generic human 'equality' without naming any group's grievances\" has always been the rhetoric of those who were intending to preserve the status quo. \n\nTLDR, promoting diversity has it's shortcomings, but it's better than any alternative that we know of. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When and where, do you think, was the correct sweet spot of just enough diversity, in our history? &lt;/p&gt;\n\n&lt;p&gt;When would have been someone with your ethnic background, be treated as &lt;strong&gt;more of&lt;/strong&gt; &amp;quot;just a human&amp;quot;, than today? &lt;/p&gt;\n\n&lt;p&gt;You named some naive attitudes, and some shortcomings of our culture, but it&amp;#39;s not clear what model you have for a better one.&lt;/p&gt;\n\n&lt;p&gt;To me, the idea that our level of diversity is bad because we have racial tensions and detachment from society, is a bit like saying that democracy is bad because politiians lie and they are corrupt. They sure are, but less so than under any other system we have tried before. &lt;/p&gt;\n\n&lt;p&gt;Similarly, you might condemn our approach to diversity as being less than perfect. But at the same time, injustice against minorities exists, and past experience taught as that &amp;quot;We are all just human, let&amp;#39;s only appeal to generic human &amp;#39;equality&amp;#39; without naming any group&amp;#39;s grievances&amp;quot; has always been the rhetoric of those who were intending to preserve the status quo. &lt;/p&gt;\n\n&lt;p&gt;TLDR, promoting diversity has it&amp;#39;s shortcomings, but it&amp;#39;s better than any alternative that we know of. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge4ccz", "score_hidden": true, "stickied": false, "created": 1492491852.0, "created_utc": 1492463052.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": "", "user_reports": [], "id": "dge9oa9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KingOoblar", "parent_id": "t1_dge9e1u", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;If there was an option to pursue an Americorps type position where it was clear you'd be helping America and your countrymen for a 1 or 2-year stint, which also either improved or at least didn't hamper your future plans after (so stuff like college deferment), that might go a long way toward people feeling more connected. I don't know what the economic ramifications of something like that would be, but I really haven't heard any politician or public speaker advocate for communal sacrifice.\n\nLike a (home) Peace Corps. Well the military offers the GI Bill, to which I am happily taking advantage of. If some similar incentive could be offered it could be a game changer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If there was an option to pursue an Americorps type position where it was clear you&amp;#39;d be helping America and your countrymen for a 1 or 2-year stint, which also either improved or at least didn&amp;#39;t hamper your future plans after (so stuff like college deferment), that might go a long way toward people feeling more connected. I don&amp;#39;t know what the economic ramifications of something like that would be, but I really haven&amp;#39;t heard any politician or public speaker advocate for communal sacrifice.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Like a (home) Peace Corps. Well the military offers the GI Bill, to which I am happily taking advantage of. If some similar incentive could be offered it could be a game changer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge9oa9", "score_hidden": true, "stickied": false, "created": 1492498530.0, "created_utc": 1492469730.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge9e1u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "James_McNulty", "parent_id": "t1_dge8ppt", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It's been 56 years since JFK told us to ask what we can do for our country, and I hope beyond reason that a civic spirit such as that can take hold again.  There is a growing energy for change, which presently manifests itself as a resistance movement against President Trump.  If there was an entity (politician, organization, celebrity, whatever) that could guide people from that activism toward a more tangibly constructive service, I think it would bear fruit.  I think most Americans would sacrifice both time and money to make the country a better place, the problem is that no one can agree on how best achieve that.\n\nIf there was an option to pursue an Americorps type position where it was clear you'd be helping America and your countrymen for a 1 or 2-year stint, which also either improved or at least didn't hamper your future plans after (so stuff like college deferment), that might go a long way toward people feeling more connected.  I don't know what the economic ramifications of something like that would be, but I really haven't heard any politician or public speaker advocate for communal sacrifice.\n\nIt probably couldn't be mandatory, but if it became *cool* it would be even more effective.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s been 56 years since JFK told us to ask what we can do for our country, and I hope beyond reason that a civic spirit such as that can take hold again.  There is a growing energy for change, which presently manifests itself as a resistance movement against President Trump.  If there was an entity (politician, organization, celebrity, whatever) that could guide people from that activism toward a more tangibly constructive service, I think it would bear fruit.  I think most Americans would sacrifice both time and money to make the country a better place, the problem is that no one can agree on how best achieve that.&lt;/p&gt;\n\n&lt;p&gt;If there was an option to pursue an Americorps type position where it was clear you&amp;#39;d be helping America and your countrymen for a 1 or 2-year stint, which also either improved or at least didn&amp;#39;t hamper your future plans after (so stuff like college deferment), that might go a long way toward people feeling more connected.  I don&amp;#39;t know what the economic ramifications of something like that would be, but I really haven&amp;#39;t heard any politician or public speaker advocate for communal sacrifice.&lt;/p&gt;\n\n&lt;p&gt;It probably couldn&amp;#39;t be mandatory, but if it became &lt;em&gt;cool&lt;/em&gt; it would be even more effective.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge9e1u", "score_hidden": true, "stickied": false, "created": 1492498155.0, "created_utc": 1492469355.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": "", "user_reports": [], "id": "dge8q27", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeltaBot", "parent_id": "t1_dge8ppt", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Confirmed: 1 delta awarded to /u/James_McNulty ([8∆](/r/changemyview/wiki/user/James_McNulty)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)\n[​](HTTP://DB3PARAMSSTART\n{\n  \"comment\": \"This is hidden text for DB3 to parse. Please contact the author of DB3 if you see this\",\n  \"issues\": {},\n  \"parentUserName\": \"James_McNulty\"\n}\nDB3PARAMSEND)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/James_McNulty\"&gt;/u/James_McNulty&lt;/a&gt; (&lt;a href=\"/r/changemyview/wiki/user/James_McNulty\"&gt;8∆&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltasystem\"&gt;Delta System Explained&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"https://www.reddit.com/r/changemyview/wiki/deltaboards\"&gt;Deltaboards&lt;/a&gt;&lt;/sup&gt;\n&lt;a href=\"HTTP://DB3PARAMSSTART%0A%7B%0A%20%20%22comment%22:%20%22This%20is%20hidden%20text%20for%20DB3%20to%20parse.%20Please%20contact%20the%20author%20of%20DB3%20if%20you%20see%20this%22,%0A%20%20%22issues%22:%20%7B%7D,%0A%20%20%22parentUserName%22:%20%22James_McNulty%22%0A%7D%0ADB3PARAMSEND\"&gt;​&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge8q27", "score_hidden": true, "stickied": false, "created": 1492497279.0, "created_utc": 1492468479.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge8ppt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KingOoblar", "parent_id": "t1_dge6ncl", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "∆\n\nThis is the hardest part, admitting that we are flawed in the first place. But I think my biggest issue is the fact that no solution seems to be in sight. \n\nSure, while the scientific community would be an excellent model, its un-realistic and if executed on a larger scale it could collapse under the weight of ethical problems. \n\nThere is no \"brainstorming\" going on where it should be. \n\n&gt;It's interesting that you're a vet, because the integration of the US Army went a long way toward improving race relations in the United States. Additionally, your services means you've likely spent a lot of time with people of different background from all parts of the US, and you recognize the similarities you have. Most people simply don't have that experience, which is very unfortunate.\n\nThe integration was the first step, but the catalyst for bonding is always war, Vietnam, Afghanistan, Iraq (what ever war comes next, North Korea?) \n\nWhen you realize that the person who could save your life is completely different than you it doesn't really matter. The problem is, how do you bestow that feeling on a whole society? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;∆&lt;/p&gt;\n\n&lt;p&gt;This is the hardest part, admitting that we are flawed in the first place. But I think my biggest issue is the fact that no solution seems to be in sight. &lt;/p&gt;\n\n&lt;p&gt;Sure, while the scientific community would be an excellent model, its un-realistic and if executed on a larger scale it could collapse under the weight of ethical problems. &lt;/p&gt;\n\n&lt;p&gt;There is no &amp;quot;brainstorming&amp;quot; going on where it should be. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s interesting that you&amp;#39;re a vet, because the integration of the US Army went a long way toward improving race relations in the United States. Additionally, your services means you&amp;#39;ve likely spent a lot of time with people of different background from all parts of the US, and you recognize the similarities you have. Most people simply don&amp;#39;t have that experience, which is very unfortunate.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The integration was the first step, but the catalyst for bonding is always war, Vietnam, Afghanistan, Iraq (what ever war comes next, North Korea?) &lt;/p&gt;\n\n&lt;p&gt;When you realize that the person who could save your life is completely different than you it doesn&amp;#39;t really matter. The problem is, how do you bestow that feeling on a whole society? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge8ppt", "score_hidden": true, "stickied": false, "created": 1492497266.0, "created_utc": 1492468466.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge6ncl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "James_McNulty", "parent_id": "t3_65y0lb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "You're hitting on an inherent issue with identity, diversity and equality: if we acknowledge that the US is not currently a completely fair, equal and just place to live, we must then acknowledge the ways in which inequality and injustice permeate society.  And in that examination, one finds tremendous evidence of inequality and injustice perpetrated along divisions such as race, ethnicity, sex, sexual orientation, etc.  How can we as a society address these inequalities and injustices without acknowledging the divisions upon which those inequalities and injustices are built?\n\n&gt; I feel that as American's increasingly align themselves to some specific identity, they inadvertently separate themselves from values that are typically representative of a democratic state such as unity, equality (or more accurately, equity), and tolerance.\n\nIt's important to remember that this phenomenon is only increasing among white Americans.  Black Americans have seldom had the luxury of identifying as an American first and a black American second.  The fault lines which are becoming more clear weren't created in the most recent swell of identity politics.  They have existed all along, and are only now showing as facade of white supremacy continues to fail under the weight of its own ideology.  I use the term white supremacy intentionally, because that is the ideology on which this country became rich and an legacy which continues to the present time.\n\nIt's interesting that you're a vet, because the integration of the US Army went a long way toward improving race relations in the United States.  Additionally, your services means you've likely spent a lot of time with people of different background from all parts of the US, and you recognize the similarities you have.  Most people simply don't have that experience, which is very unfortunate.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re hitting on an inherent issue with identity, diversity and equality: if we acknowledge that the US is not currently a completely fair, equal and just place to live, we must then acknowledge the ways in which inequality and injustice permeate society.  And in that examination, one finds tremendous evidence of inequality and injustice perpetrated along divisions such as race, ethnicity, sex, sexual orientation, etc.  How can we as a society address these inequalities and injustices without acknowledging the divisions upon which those inequalities and injustices are built?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I feel that as American&amp;#39;s increasingly align themselves to some specific identity, they inadvertently separate themselves from values that are typically representative of a democratic state such as unity, equality (or more accurately, equity), and tolerance.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s important to remember that this phenomenon is only increasing among white Americans.  Black Americans have seldom had the luxury of identifying as an American first and a black American second.  The fault lines which are becoming more clear weren&amp;#39;t created in the most recent swell of identity politics.  They have existed all along, and are only now showing as facade of white supremacy continues to fail under the weight of its own ideology.  I use the term white supremacy intentionally, because that is the ideology on which this country became rich and an legacy which continues to the present time.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s interesting that you&amp;#39;re a vet, because the integration of the US Army went a long way toward improving race relations in the United States.  Additionally, your services means you&amp;#39;ve likely spent a lot of time with people of different background from all parts of the US, and you recognize the similarities you have.  Most people simply don&amp;#39;t have that experience, which is very unfortunate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge6ncl", "score_hidden": true, "stickied": false, "created": 1492494650.0, "created_utc": 1492465850.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": "", "user_reports": [], "id": "dgebma6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KingOoblar", "parent_id": "t1_dgebghb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I'm asking you to clarify your reasoning, what I'm getting is gilded bitterness.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m asking you to clarify your reasoning, what I&amp;#39;m getting is gilded bitterness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgebma6", "score_hidden": true, "stickied": false, "created": 1492501063.0, "created_utc": 1492472263.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgebghb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "strong_potato", "parent_id": "t1_dge9upj", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I think you know that's not what I'm suggesting. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you know that&amp;#39;s not what I&amp;#39;m suggesting. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgebghb", "score_hidden": true, "stickied": false, "created": 1492500863.0, "created_utc": 1492472063.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge9upj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KingOoblar", "parent_id": "t1_dge9nbq", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "So, do you propose just taking their money and giving it to everybody not white? Poof, problem solved, identity issues, race relations, gay rights, etc? All we had to do was be Robin hood? Even if money or power were never even mentioned in OP?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, do you propose just taking their money and giving it to everybody not white? Poof, problem solved, identity issues, race relations, gay rights, etc? All we had to do was be Robin hood? Even if money or power were never even mentioned in OP?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge9upj", "score_hidden": true, "stickied": false, "created": 1492498761.0, "created_utc": 1492469961.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge9nbq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "strong_potato", "parent_id": "t1_dge9g6c", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It's not about who's fault it is. My point is if \"diversity\" had gone too far would whit men have the amount of money and power that they currently have? I assume not. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not about who&amp;#39;s fault it is. My point is if &amp;quot;diversity&amp;quot; had gone too far would whit men have the amount of money and power that they currently have? I assume not. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge9nbq", "score_hidden": true, "stickied": false, "created": 1492498495.0, "created_utc": 1492469695.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge9g6c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KingOoblar", "parent_id": "t1_dge8583", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "That does nothing to address my issue with diversity. \n\nIs it all white men's fault, are they alone in their fault? \n\nDo other races, demographics, and other social class identifiers have a problem to with it? Was money or power ever mentioned? \n\nI have no information to provide a convincing argument or counter argument based on your comment. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That does nothing to address my issue with diversity. &lt;/p&gt;\n\n&lt;p&gt;Is it all white men&amp;#39;s fault, are they alone in their fault? &lt;/p&gt;\n\n&lt;p&gt;Do other races, demographics, and other social class identifiers have a problem to with it? Was money or power ever mentioned? &lt;/p&gt;\n\n&lt;p&gt;I have no information to provide a convincing argument or counter argument based on your comment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge9g6c", "score_hidden": true, "stickied": false, "created": 1492498233.0, "created_utc": 1492469433.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge8583", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "strong_potato", "parent_id": "t3_65y0lb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "If it's gone so far way do white men still have so much money and power? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it&amp;#39;s gone so far way do white men still have so much money and power? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge8583", "score_hidden": true, "stickied": false, "created": 1492496532.0, "created_utc": 1492467732.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": "", "user_reports": [], "id": "dgee3j9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "benjotron", "parent_id": "t1_dgebjw3", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; But is there an inherent difference in purpose of why we chose these identities? I mean being black is being black, being white is being white. If your end goal is to be amongst people like you isn't that just restating my problem?\n\nOkay, if I'm following you're saying that since identities are arbitrary anyway, which the focus on racial diversity over diversity of opinion or beliefs, etc. Lemme know if I'm wrong, I'm making a number of assumptions there. Not sure whose end goal you are asking about, or if you're trying to make a point.\n\nI agree that identities are arbitrary.\n\n&gt; In the US (the world is a whole other can of worms), wouldn't everything be different (better) if everyone identified as a particular positive value (curious, protective, intelligent, brave) as opposed to some arbitrary skin tone? While people would still find ways to argue I feel that a society government by diverse values vs diverse skin tones would have a better chance?\n\nAlmost definitely. But maybe not. Impossible to say, really. And from a curiosity standpoint, it's kind of a pointless question since 1) we can never test it and 2) you assume the answer is yes. It's a thought experiment. They can be useful as a way to raise questions, but you can't draw conclusions from them.\n\nWouldn't one of those ideals be diversity? My problem isn't that I think you're wrong. My question is how can you people (however you distinguish them from yourself) who believe they are acting in the best interests of diversity (a positive value) that they aren't actually being as effective as they could without first claiming to be better than them in some way? Don't you need to assume you have better information, judgement, beliefs, higher moral ground, divine right, superior physical force or something to justify that you are right and they are wrong?\n\nMy argument isn't that you're wrong. It's that I don't see how you can claim to be right.\n\n&gt; wouldn't everything be different (better) if everyone identified as a particular positive value (curious, protective, intelligent, brave) as opposed to some arbitrary skin tone?\n\nDo you see how this is different than your claim? You claim that diversity efforts has gone too far, but how can you know that ceasing these efforts would lead to this scenario instead? At the risk of making human suffering worse, how sure would you need to be to stop being curious about the answer?\n\n&gt; IE \"Ok, were all white. What now?\" vs \"Were all curious, whats that shiny thing?\"\nI'm assuming pain is bad, and that ultimately all pain is caused in service of or reaction to perceived differences. It doesn't matter to me if that difference is skin color or mindset. What matters to me is how much pain is caused in service of it. In our history, curiosity has served us better than race. But if my curiosity led me to dissect living people to see how they work, then that would be worse than a world where everyone happened to have the same skin color - say a distant future where skin tone has somehow averaged out until our modern concept of race is indistinguishable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But is there an inherent difference in purpose of why we chose these identities? I mean being black is being black, being white is being white. If your end goal is to be amongst people like you isn&amp;#39;t that just restating my problem?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Okay, if I&amp;#39;m following you&amp;#39;re saying that since identities are arbitrary anyway, which the focus on racial diversity over diversity of opinion or beliefs, etc. Lemme know if I&amp;#39;m wrong, I&amp;#39;m making a number of assumptions there. Not sure whose end goal you are asking about, or if you&amp;#39;re trying to make a point.&lt;/p&gt;\n\n&lt;p&gt;I agree that identities are arbitrary.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In the US (the world is a whole other can of worms), wouldn&amp;#39;t everything be different (better) if everyone identified as a particular positive value (curious, protective, intelligent, brave) as opposed to some arbitrary skin tone? While people would still find ways to argue I feel that a society government by diverse values vs diverse skin tones would have a better chance?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Almost definitely. But maybe not. Impossible to say, really. And from a curiosity standpoint, it&amp;#39;s kind of a pointless question since 1) we can never test it and 2) you assume the answer is yes. It&amp;#39;s a thought experiment. They can be useful as a way to raise questions, but you can&amp;#39;t draw conclusions from them.&lt;/p&gt;\n\n&lt;p&gt;Wouldn&amp;#39;t one of those ideals be diversity? My problem isn&amp;#39;t that I think you&amp;#39;re wrong. My question is how can you people (however you distinguish them from yourself) who believe they are acting in the best interests of diversity (a positive value) that they aren&amp;#39;t actually being as effective as they could without first claiming to be better than them in some way? Don&amp;#39;t you need to assume you have better information, judgement, beliefs, higher moral ground, divine right, superior physical force or something to justify that you are right and they are wrong?&lt;/p&gt;\n\n&lt;p&gt;My argument isn&amp;#39;t that you&amp;#39;re wrong. It&amp;#39;s that I don&amp;#39;t see how you can claim to be right.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;wouldn&amp;#39;t everything be different (better) if everyone identified as a particular positive value (curious, protective, intelligent, brave) as opposed to some arbitrary skin tone?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Do you see how this is different than your claim? You claim that diversity efforts has gone too far, but how can you know that ceasing these efforts would lead to this scenario instead? At the risk of making human suffering worse, how sure would you need to be to stop being curious about the answer?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;IE &amp;quot;Ok, were all white. What now?&amp;quot; vs &amp;quot;Were all curious, whats that shiny thing?&amp;quot;\nI&amp;#39;m assuming pain is bad, and that ultimately all pain is caused in service of or reaction to perceived differences. It doesn&amp;#39;t matter to me if that difference is skin color or mindset. What matters to me is how much pain is caused in service of it. In our history, curiosity has served us better than race. But if my curiosity led me to dissect living people to see how they work, then that would be worse than a world where everyone happened to have the same skin color - say a distant future where skin tone has somehow averaged out until our modern concept of race is indistinguishable.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgee3j9", "score_hidden": true, "stickied": false, "created": 1492504230.0, "created_utc": 1492475430.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgebjw3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KingOoblar", "parent_id": "t1_dgeaibk", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;I said \"other people\" and meant white people as just one example. Did you assume I meant only see it that way because you started with the assumption that we don't share the same viewpoint, or was my phrasing not precise enough? You could take it literally. Other people are all people but you. No one has your exact experiences, and no one has your exact viewpoint. So the division of people into two groups by experience or viewpoint is always going to be an arbitrary distinction. All people contain 99.5% genetic makeup and we're all going to die eventually. That should be enough to round up and just say we're all the same, and that someone's viewpoints on diversity are ultimately not that important, but you didn't say that.\nSome people will have the same experiences as you and some won't. Most people with different experiences will end up with different viewpoints. No one will ever have identical experiences or identical viewpoints.\n\nI did take it literally, thank you for the clarification, my apologies.\n\n&gt;But you share the same struggle, ultimately. Black or white, conservative or liberal, they chose an identity from the options presented to them. And in doing so, they seek out differences or similarities to groups to reinforce the identity they have chosen.\nYou felt that you couldn't chose black or white. Conservatism didn't appeal to you - you don't say why specifically that I see, but there are plenty of reasons why it wouldn't - and liberalism seemed to obsessed with something that ultimately isn't that important.\nI'm pretty much exactly the same way. I'm an engineer and I seek out differences as a way to understand things. If you put forward enough curiosity about differences, you can end up understand anything, really. And that's how you see yourself - as a scientist, to whom curiosity is foremost.\n\nBut is there an inherent difference in purpose of why we chose these identities? I mean being black is being black, being white is being white. If your end goal is to be amongst people like you isn't that just restating my problem? \n\nI think what I am trying to say is that diversity in America is represented as what you **are** not what you want to **be**. Where is the progress (yes I understand social progress, but in the context of problem solving) in that? Where is the direction in that? \n\nIE \"Ok, were all white. What now?\" vs \"Were all curious, whats that shiny thing?\"\n\n&gt;So you don't believe that the color of your skin makes you different or superior, like racists do. You don't believe that your inclusiveness or fighting for the disadvantaged makes you different or superior, like liberals do. But you do believe that your curiosity makes you different and better. A better person? Maybe, maybe not. A better scientist? Yes. You might be right, curiosity might be a better ideal than compassion or racial supremacy (I really really hope that's true).\nAnd a world where everyone lived with curiosity would certainly be a better place, assuming no one was forcing them to be curious. But a world with unlimited compassion would also be a better place, assuming no one was forcing you to be compassionate.\n\nIn the US (the world is a whole other can of worms), wouldn't everything be different (better) if everyone identified as a particular positive value (curious, protective, intelligent, brave) as opposed to some arbitrary skin tone? While people would still find ways to argue I feel that a society government by diverse **values** vs diverse **skin tones** would have a better chance?\n\n&gt;But most people do not see themselves as scientists, and don't value curiosity as the ultimate ideal. Is it an act of curiosity to tell them they are wrong? Is it curiosity that prompts you to look for differences between yourself and the non-curious? Or is it your desire to see yourself as perfectly curious that leads you to seek out ways you are more curious than those around you. Do you think you are more curious than I am? How can you be unless you question that assertion itself?\n\nWouldn't they have to see themselves as scientists? Instead why not just as americans (hell, people) who can work together to solve issues? Help is help. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I said &amp;quot;other people&amp;quot; and meant white people as just one example. Did you assume I meant only see it that way because you started with the assumption that we don&amp;#39;t share the same viewpoint, or was my phrasing not precise enough? You could take it literally. Other people are all people but you. No one has your exact experiences, and no one has your exact viewpoint. So the division of people into two groups by experience or viewpoint is always going to be an arbitrary distinction. All people contain 99.5% genetic makeup and we&amp;#39;re all going to die eventually. That should be enough to round up and just say we&amp;#39;re all the same, and that someone&amp;#39;s viewpoints on diversity are ultimately not that important, but you didn&amp;#39;t say that.\nSome people will have the same experiences as you and some won&amp;#39;t. Most people with different experiences will end up with different viewpoints. No one will ever have identical experiences or identical viewpoints.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I did take it literally, thank you for the clarification, my apologies.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But you share the same struggle, ultimately. Black or white, conservative or liberal, they chose an identity from the options presented to them. And in doing so, they seek out differences or similarities to groups to reinforce the identity they have chosen.\nYou felt that you couldn&amp;#39;t chose black or white. Conservatism didn&amp;#39;t appeal to you - you don&amp;#39;t say why specifically that I see, but there are plenty of reasons why it wouldn&amp;#39;t - and liberalism seemed to obsessed with something that ultimately isn&amp;#39;t that important.\nI&amp;#39;m pretty much exactly the same way. I&amp;#39;m an engineer and I seek out differences as a way to understand things. If you put forward enough curiosity about differences, you can end up understand anything, really. And that&amp;#39;s how you see yourself - as a scientist, to whom curiosity is foremost.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But is there an inherent difference in purpose of why we chose these identities? I mean being black is being black, being white is being white. If your end goal is to be amongst people like you isn&amp;#39;t that just restating my problem? &lt;/p&gt;\n\n&lt;p&gt;I think what I am trying to say is that diversity in America is represented as what you &lt;strong&gt;are&lt;/strong&gt; not what you want to &lt;strong&gt;be&lt;/strong&gt;. Where is the progress (yes I understand social progress, but in the context of problem solving) in that? Where is the direction in that? &lt;/p&gt;\n\n&lt;p&gt;IE &amp;quot;Ok, were all white. What now?&amp;quot; vs &amp;quot;Were all curious, whats that shiny thing?&amp;quot;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So you don&amp;#39;t believe that the color of your skin makes you different or superior, like racists do. You don&amp;#39;t believe that your inclusiveness or fighting for the disadvantaged makes you different or superior, like liberals do. But you do believe that your curiosity makes you different and better. A better person? Maybe, maybe not. A better scientist? Yes. You might be right, curiosity might be a better ideal than compassion or racial supremacy (I really really hope that&amp;#39;s true).\nAnd a world where everyone lived with curiosity would certainly be a better place, assuming no one was forcing them to be curious. But a world with unlimited compassion would also be a better place, assuming no one was forcing you to be compassionate.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In the US (the world is a whole other can of worms), wouldn&amp;#39;t everything be different (better) if everyone identified as a particular positive value (curious, protective, intelligent, brave) as opposed to some arbitrary skin tone? While people would still find ways to argue I feel that a society government by diverse &lt;strong&gt;values&lt;/strong&gt; vs diverse &lt;strong&gt;skin tones&lt;/strong&gt; would have a better chance?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But most people do not see themselves as scientists, and don&amp;#39;t value curiosity as the ultimate ideal. Is it an act of curiosity to tell them they are wrong? Is it curiosity that prompts you to look for differences between yourself and the non-curious? Or is it your desire to see yourself as perfectly curious that leads you to seek out ways you are more curious than those around you. Do you think you are more curious than I am? How can you be unless you question that assertion itself?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Wouldn&amp;#39;t they have to see themselves as scientists? Instead why not just as americans (hell, people) who can work together to solve issues? Help is help. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgebjw3", "score_hidden": true, "stickied": false, "created": 1492500984.0, "created_utc": 1492472184.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeaibk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "benjotron", "parent_id": "t1_dge88a4", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "I completely agree.\n\n&gt;&gt; Other people (IE white people) don't have these experiences, or anything prompting them to seek them out. Nor do they have a rational scientific decision making process.\n\n&gt; Statements like this are what I'm generally frustrated by. By saying this you exclude an entire group of people (who happen to be white) who work and live in the international community, or the plethora of \"white\" scientists. Then when defending white people I'm criticized for thinking things like reverse racism are true.\n\n&gt; In fact I could replace \"other white people\" in your statement with african americans and it would apply the same way, and suddenly be racist. By singling out a specific race of people you become the problem.\n\nI said \"other people\" and meant white people as just one example. Did you assume I meant only see it that way because you started with the assumption that we don't share the same viewpoint, or was my phrasing not precise enough? You could take it literally. Other people are all people but you. No one has your exact experiences, and no one has your exact viewpoint. So the division of people into two groups by experience or viewpoint is always going to be an arbitrary distinction. All people contain 99.5% genetic makeup and we're all going to die eventually. That should be enough to round up and just say we're all the same, and that someone's viewpoints on diversity are ultimately not that important, but you didn't say that.\n\nSome people will have the same experiences as you and some won't. Most people with different experiences will end up with different viewpoints. No one will ever have identical experiences or identical viewpoints.\n\n&gt; My argument isn't with a specific race of people in America. Its that in country where everyone is supposed to be a tolerant and inclusive american, we try really hard not to be. This isn't just exclusive to white people, its all americans. As an american, americans don't see me as american because I'm not in a set box they're comfortable with.\n\nBut you share the same struggle, ultimately. Black or white, conservative or liberal, they chose an identity from the options presented to them. And in doing so, they seek out differences or similarities to groups to reinforce the identity they have chosen.\n\nYou felt that you couldn't chose black or white. Conservatism didn't appeal to you - you don't say why specifically that I see, but there are plenty of reasons why it wouldn't - and liberalism seemed to obsessed with something that ultimately isn't that important.\n\nI'm pretty much exactly the same way. I'm an engineer and I seek out differences as a way to understand things. If you put forward enough curiosity about differences, you can end up understand anything, really. And that's how you see yourself - as a scientist, to whom curiosity is foremost.\n\n&gt;Further than that, entering scientific community has taught me one thing is that, it doesn't matter who or what you are, but are you curious?\n\nSo you don't believe that the color of your skin makes you different or superior, like racists do. You don't believe that your inclusiveness or fighting for the disadvantaged makes you different or superior, like liberals do. But you do believe that your curiosity makes you different and better. A better person? Maybe, maybe not. A better scientist? Yes. You might be right, curiosity might be a better ideal than compassion or racial supremacy (I really really hope that's true).\n\nAnd a world where everyone lived with curiosity would certainly be a better place, assuming no one was forcing them to be curious. But a world with unlimited compassion would also be a better place, assuming no one was forcing you to be compassionate.\n\nBut most people do not see themselves as scientists, and don't value curiosity as the ultimate ideal. Is it an act of curiosity to tell them they are wrong? Is it curiosity that prompts you to look for differences between yourself and the non-curious? Or is it your desire to see yourself as perfectly curious that leads you to seek out ways you are more curious than those around you. Do you think you are more curious than I am? How can you be unless you question that assertion itself?\n\n&gt; Yet we provide no new steps towards bring either side together, in fact they are more polarized then ever.\nYou cannot bring two sides together while simultaneously separating yourself from both. I'd argue you can't do it while separating yourself from either.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I completely agree.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Other people (IE white people) don&amp;#39;t have these experiences, or anything prompting them to seek them out. Nor do they have a rational scientific decision making process.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Statements like this are what I&amp;#39;m generally frustrated by. By saying this you exclude an entire group of people (who happen to be white) who work and live in the international community, or the plethora of &amp;quot;white&amp;quot; scientists. Then when defending white people I&amp;#39;m criticized for thinking things like reverse racism are true.&lt;/p&gt;\n\n&lt;p&gt;In fact I could replace &amp;quot;other white people&amp;quot; in your statement with african americans and it would apply the same way, and suddenly be racist. By singling out a specific race of people you become the problem.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I said &amp;quot;other people&amp;quot; and meant white people as just one example. Did you assume I meant only see it that way because you started with the assumption that we don&amp;#39;t share the same viewpoint, or was my phrasing not precise enough? You could take it literally. Other people are all people but you. No one has your exact experiences, and no one has your exact viewpoint. So the division of people into two groups by experience or viewpoint is always going to be an arbitrary distinction. All people contain 99.5% genetic makeup and we&amp;#39;re all going to die eventually. That should be enough to round up and just say we&amp;#39;re all the same, and that someone&amp;#39;s viewpoints on diversity are ultimately not that important, but you didn&amp;#39;t say that.&lt;/p&gt;\n\n&lt;p&gt;Some people will have the same experiences as you and some won&amp;#39;t. Most people with different experiences will end up with different viewpoints. No one will ever have identical experiences or identical viewpoints.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;My argument isn&amp;#39;t with a specific race of people in America. Its that in country where everyone is supposed to be a tolerant and inclusive american, we try really hard not to be. This isn&amp;#39;t just exclusive to white people, its all americans. As an american, americans don&amp;#39;t see me as american because I&amp;#39;m not in a set box they&amp;#39;re comfortable with.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But you share the same struggle, ultimately. Black or white, conservative or liberal, they chose an identity from the options presented to them. And in doing so, they seek out differences or similarities to groups to reinforce the identity they have chosen.&lt;/p&gt;\n\n&lt;p&gt;You felt that you couldn&amp;#39;t chose black or white. Conservatism didn&amp;#39;t appeal to you - you don&amp;#39;t say why specifically that I see, but there are plenty of reasons why it wouldn&amp;#39;t - and liberalism seemed to obsessed with something that ultimately isn&amp;#39;t that important.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m pretty much exactly the same way. I&amp;#39;m an engineer and I seek out differences as a way to understand things. If you put forward enough curiosity about differences, you can end up understand anything, really. And that&amp;#39;s how you see yourself - as a scientist, to whom curiosity is foremost.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Further than that, entering scientific community has taught me one thing is that, it doesn&amp;#39;t matter who or what you are, but are you curious?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So you don&amp;#39;t believe that the color of your skin makes you different or superior, like racists do. You don&amp;#39;t believe that your inclusiveness or fighting for the disadvantaged makes you different or superior, like liberals do. But you do believe that your curiosity makes you different and better. A better person? Maybe, maybe not. A better scientist? Yes. You might be right, curiosity might be a better ideal than compassion or racial supremacy (I really really hope that&amp;#39;s true).&lt;/p&gt;\n\n&lt;p&gt;And a world where everyone lived with curiosity would certainly be a better place, assuming no one was forcing them to be curious. But a world with unlimited compassion would also be a better place, assuming no one was forcing you to be compassionate.&lt;/p&gt;\n\n&lt;p&gt;But most people do not see themselves as scientists, and don&amp;#39;t value curiosity as the ultimate ideal. Is it an act of curiosity to tell them they are wrong? Is it curiosity that prompts you to look for differences between yourself and the non-curious? Or is it your desire to see yourself as perfectly curious that leads you to seek out ways you are more curious than those around you. Do you think you are more curious than I am? How can you be unless you question that assertion itself?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Yet we provide no new steps towards bring either side together, in fact they are more polarized then ever.\nYou cannot bring two sides together while simultaneously separating yourself from both. I&amp;#39;d argue you can&amp;#39;t do it while separating yourself from either.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgeaibk", "score_hidden": true, "stickied": false, "created": 1492499623.0, "created_utc": 1492470823.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge88a4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KingOoblar", "parent_id": "t1_dge5kkw", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt;Other people (IE white people) don't have these experiences, or anything prompting them to seek them out. Nor do they have a rational scientific decision making process.\n\nStatements like this are what I'm generally frustrated by. By saying this you exclude an entire group of people (who happen to be white) who work and live in the international community, or the plethora of \"white\" scientists. Then when defending white people I'm criticized for thinking things like reverse racism are true.  \n\nIn fact I could replace \"other white people\" in your statement with african americans and it would apply the same way, and suddenly be racist. By singling out a specific race of people you become the problem. \n\nMy argument isn't with a specific race of people in America. Its that in country where everyone is supposed to be a tolerant and inclusive american, we try really hard not to be. This isn't just exclusive to white people, its all americans. As an american, americans don't see me as american because I'm not in a set box they're comfortable with. \n\n&gt;I effectively agree that diversity must have a limit, and that identity is the source of a lot of pain (I'd argue all pain, actually.) But what indicator do you have that it has gone too far? Racial and identity tension is exactly new. You don't offer a lot of other evidence beyond your own lack of bias.\n\nWhile we won't know until its too late, a good indicator would be how handle diversity issues now. How our society chooses to see diversity: \n\nYou have some types that believe that there isn't a diversity problem, that it should all be merit based; and they typically don't understand why a merit based system wouldn't work for diversity. \n\nYou have other types that believe diversity is a thing to be celebrated, almost to the point of preserving purity, while not understanding the concept of a melting pot, or the word diversity. \n\nYet we provide no new steps towards bring either side together, in fact they are more polarized then ever. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Other people (IE white people) don&amp;#39;t have these experiences, or anything prompting them to seek them out. Nor do they have a rational scientific decision making process.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Statements like this are what I&amp;#39;m generally frustrated by. By saying this you exclude an entire group of people (who happen to be white) who work and live in the international community, or the plethora of &amp;quot;white&amp;quot; scientists. Then when defending white people I&amp;#39;m criticized for thinking things like reverse racism are true.  &lt;/p&gt;\n\n&lt;p&gt;In fact I could replace &amp;quot;other white people&amp;quot; in your statement with african americans and it would apply the same way, and suddenly be racist. By singling out a specific race of people you become the problem. &lt;/p&gt;\n\n&lt;p&gt;My argument isn&amp;#39;t with a specific race of people in America. Its that in country where everyone is supposed to be a tolerant and inclusive american, we try really hard not to be. This isn&amp;#39;t just exclusive to white people, its all americans. As an american, americans don&amp;#39;t see me as american because I&amp;#39;m not in a set box they&amp;#39;re comfortable with. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I effectively agree that diversity must have a limit, and that identity is the source of a lot of pain (I&amp;#39;d argue all pain, actually.) But what indicator do you have that it has gone too far? Racial and identity tension is exactly new. You don&amp;#39;t offer a lot of other evidence beyond your own lack of bias.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;While we won&amp;#39;t know until its too late, a good indicator would be how handle diversity issues now. How our society chooses to see diversity: &lt;/p&gt;\n\n&lt;p&gt;You have some types that believe that there isn&amp;#39;t a diversity problem, that it should all be merit based; and they typically don&amp;#39;t understand why a merit based system wouldn&amp;#39;t work for diversity. &lt;/p&gt;\n\n&lt;p&gt;You have other types that believe diversity is a thing to be celebrated, almost to the point of preserving purity, while not understanding the concept of a melting pot, or the word diversity. &lt;/p&gt;\n\n&lt;p&gt;Yet we provide no new steps towards bring either side together, in fact they are more polarized then ever. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge88a4", "score_hidden": true, "stickied": false, "created": 1492496640.0, "created_utc": 1492467840.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge5kkw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "benjotron", "parent_id": "t3_65y0lb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "&gt; Growing up in the international community and having experiences with people of all socio-economic backgrounds taught me one thing: Everyone is human. This was also a central ideologue in the military: We were all equally worthless.\n\nOther people (IE white people) don't have these experiences, or anything prompting them to seek them out. Nor do they have a rational scientific decision making process.\n\nI effectively agree that diversity must have a limit, and that identity is the source of a lot of pain (I'd argue all pain, actually.) But what indicator do you have that it has gone too far? Racial and identity tension is exactly new. You don't offer a lot of other evidence beyond your own lack of bias.\n\nBut being on the side of \"too much diversity\" or \"not enough diversity\" is also an identity that will serve to separate people. \n\nThe world would be better if people didn't see differences as a threat to their identity. Given that this is not how most people behave, should we give up? Look for a way to teach this behavior? Wait until everyone is a weird shade of brown and let nature sort it out? If we stop pushing, how would we know if we start regressing?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Growing up in the international community and having experiences with people of all socio-economic backgrounds taught me one thing: Everyone is human. This was also a central ideologue in the military: We were all equally worthless.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Other people (IE white people) don&amp;#39;t have these experiences, or anything prompting them to seek them out. Nor do they have a rational scientific decision making process.&lt;/p&gt;\n\n&lt;p&gt;I effectively agree that diversity must have a limit, and that identity is the source of a lot of pain (I&amp;#39;d argue all pain, actually.) But what indicator do you have that it has gone too far? Racial and identity tension is exactly new. You don&amp;#39;t offer a lot of other evidence beyond your own lack of bias.&lt;/p&gt;\n\n&lt;p&gt;But being on the side of &amp;quot;too much diversity&amp;quot; or &amp;quot;not enough diversity&amp;quot; is also an identity that will serve to separate people. &lt;/p&gt;\n\n&lt;p&gt;The world would be better if people didn&amp;#39;t see differences as a threat to their identity. Given that this is not how most people behave, should we give up? Look for a way to teach this behavior? Wait until everyone is a weird shade of brown and let nature sort it out? If we stop pushing, how would we know if we start regressing?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dge5kkw", "score_hidden": true, "stickied": false, "created": 1492493325.0, "created_utc": 1492464525.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": "", "user_reports": [], "id": "dgec5vb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "daynightninja", "parent_id": "t1_dgebubv", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "And you think that's a *recent* phenomenon? Brought on because of emphasis on diversity? Who do you believe is to blame here? Because based on your phrasing it sounds like you believe that the blame is on progressive social forces rather than human nature/old social issues (e.g. racism, sexism, xenophobia, nationalist tendencies)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And you think that&amp;#39;s a &lt;em&gt;recent&lt;/em&gt; phenomenon? Brought on because of emphasis on diversity? Who do you believe is to blame here? Because based on your phrasing it sounds like you believe that the blame is on progressive social forces rather than human nature/old social issues (e.g. racism, sexism, xenophobia, nationalist tendencies)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgec5vb", "score_hidden": true, "stickied": false, "created": 1492501758.0, "created_utc": 1492472958.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgebubv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KingOoblar", "parent_id": "t1_dgeave2", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Good question, I'm stating (or stated) that Americans emphasize their identities as a \"gate\" more or less. You're one of us or your not. With the intention of bringing these identities together and unifying them under \"American\" we have inadvertently isolated each other. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good question, I&amp;#39;m stating (or stated) that Americans emphasize their identities as a &amp;quot;gate&amp;quot; more or less. You&amp;#39;re one of us or your not. With the intention of bringing these identities together and unifying them under &amp;quot;American&amp;quot; we have inadvertently isolated each other. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgebubv", "score_hidden": true, "stickied": false, "created": 1492501345.0, "created_utc": 1492472545.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeave2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "daynightninja", "parent_id": "t3_65y0lb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "It seems like you're mostly saying that Americans emphasize their individual *identities* rather than *diversity*, would you say that's fair in characterizing your view? You don't seem to be talking about the merits or detriments of having diverse groups of people making decisions, only about people defining themselves by their ethnic backgrounds. \n\nI ask as clarification, so I can know the view that you're asking to be changed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It seems like you&amp;#39;re mostly saying that Americans emphasize their individual &lt;em&gt;identities&lt;/em&gt; rather than &lt;em&gt;diversity&lt;/em&gt;, would you say that&amp;#39;s fair in characterizing your view? You don&amp;#39;t seem to be talking about the merits or detriments of having diverse groups of people making decisions, only about people defining themselves by their ethnic backgrounds. &lt;/p&gt;\n\n&lt;p&gt;I ask as clarification, so I can know the view that you&amp;#39;re asking to be changed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgeave2", "score_hidden": true, "stickied": false, "created": 1492500101.0, "created_utc": 1492471301.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "removal_reason": null, "link_id": "t3_65y0lb", "likes": null, "replies": "", "user_reports": [], "id": "dgedjzy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "strong_potato", "parent_id": "t3_65y0lb", "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "body": "Ok. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "changemyview", "name": "t1_dgedjzy", "score_hidden": true, "stickied": false, "created": 1492503540.0, "created_utc": 1492474740.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]