[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {"content": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/ucTg6rZJCu4?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "width": 459, "scrolling": false, "height": 344}, "subreddit": "Music", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": {"oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Link Wray - Rumble [HQ - Best Version]", "thumbnail_width": 480, "height": 344, "width": 459, "html": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/ucTg6rZJCu4?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "author_name": "n3v05h", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/ucTg6rZJCu4/hqdefault.jpg", "type": "video", "thumbnail_height": 360, "author_url": "https://www.youtube.com/user/n3v05h"}, "type": "youtube.com"}, "link_flair_text": "music streaming", "id": "64hsq9", "gilded": 0, "secure_media_embed": {"content": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/ucTg6rZJCu4?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "width": 459, "scrolling": false, "height": 344}, "clicked": false, "score": 30, "report_reasons": null, "author": "nino-fukosima", "saved": false, "mod_reports": [], "name": "t3_64hsq9", "subreddit_name_prefixed": "r/Music", "approved_by": null, "over_18": false, "domain": "youtube.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh1u", "edited": false, "link_flair_css_class": "streaming", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/Music/comments/64hsq9/link_wray_rumble_rock/", "num_reports": null, "locked": false, "stickied": false, "created": 1491831032.0, "url": "https://www.youtube.com/watch?v=ucTg6rZJCu4", "author_flair_text": null, "quarantine": false, "title": "Link Wray - Rumble [Rock]", "created_utc": 1491802232.0, "distinguished": null, "media": {"oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Link Wray - Rumble [HQ - Best Version]", "thumbnail_width": 480, "height": 344, "width": 459, "html": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/ucTg6rZJCu4?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "author_name": "n3v05h", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/ucTg6rZJCu4/hqdefault.jpg", "type": "video", "thumbnail_height": 360, "author_url": "https://www.youtube.com/user/n3v05h"}, "type": "youtube.com"}, "upvote_ratio": 0.86, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 30}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1u", "removal_reason": null, "link_id": "t3_64hsq9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1u", "removal_reason": null, "link_id": "t3_64hsq9", "likes": null, "replies": "", "user_reports": [], "id": "dg304eh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MC5EVP", "parent_id": "t1_dg29g2t", "subreddit_name_prefixed": "r/Music", "controversiality": 0, "body": "How the hell is he not in the Rock n Roll hall of fame?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How the hell is he not in the Rock n Roll hall of fame?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Music", "name": "t1_dg304eh", "score_hidden": false, "stickied": false, "created": 1491876771.0, "created_utc": 1491847971.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg29g2t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DJ_Spam", "parent_id": "t3_64hsq9", "subreddit_name_prefixed": "r/Music", "controversiality": 0, "body": "**Link Wray**  \n [artist pic](https://lastfm-img2.akamaized.net/i/u/252/f530793f5dc04cdba04d47199beadaaa.png)  \n\n&gt; Frederick Lincoln \"Link\" Wray Jr (May 2, 1929 – November 5, 2005) was an American rock and roll guitarist, songwriter and occasional singer.\n\n&gt; Wray was noted for pioneering a new sound for electric guitars, as exemplified in his hit 1958 instrumental \"Rumble\", by Link Wray and his Ray Men, which pioneered an overdriven, distorted electric guitar sound, and also for having \"invented the power chord, the major modus operandi of modern rock guitarist,\" \"and in doing so fathering,\" or making possible, \"punk and heavy rock\". Rolling Stone included Link at number 67 on their list of the 100 greatest guitarist of all time.\n\n&gt; Wray was born in Dunn, North Carolina to Lillie M. Coats and Frederick Lincoln Wray. It was there that Link first heard slide guitar at age eight from a traveling carnival worker, an African-American man named \"Hambone.\" Wray was a veteran of the Korean war, where he contracted tuberculosis that ultimately cost him a lung. His doctors told him that he would never sing again. So Link concentrated on his heavy guitar work. Despite this, on his rare vocal numbers he displays a strong voice and a range equivalent to Clarence \"Frogman\" Henry.\n\n&gt; Part Shawnee Indian, Wray frequently spoke of his ancestry in performances and interviews. Three of the songs he performed bear the names of American Indian tribes: \"Shawnee\", \"Apache\", and \"Comanche.\" \"Apache\" was an instrumental composed by Jerry Lordan, which became a hit in the UK for The Shadows in 1960. Wray recorded one of the better covers of the song 30 years later, somehow finding new life in this mythic, minor-key, guitar/drum dialogue which by then was also associated with everyone from The Ventures to the Incredible Bongo Band.\n\n&gt; After discharge from the Army, Wray and his brothers Doug and Vernon Wray, with friends Shorty Horton and Dixie Neal, formed Lucky Wray and the Lazy Pine Wranglers, later known as Lucky Wray and the Palomino Ranch Hands. They had been playing country music and Western swing for several years when they took a gig as the house band on the daily live TV show Milt Grant's House Party, a Washington, D.C. version of American Bandstand. The band made their first recordings in 1956 as Lucky Wray and the Palomino Ranch Hands for Starday Records.\n\n&gt; For the TV show, they also backed many performers, from Fats Domino to Ricky Nelson. In 1958, at a live gig of the D.C.-based Milt Grant's House Party, attempting—at the urging of the local crowd—to work up a cover sound-alike for The Diamonds' hit, \"The Stroll\", they came up with an eleven and one half bar blues titled \"Rumble\" which they first called \"Oddball\". The song was an instant hit with the live audience, which demanded four repeats that night. Eventually the song came to the attention of record producer Archie Bleyer of Cadence Records, who hated it, particularly after Wray poked holes in his amplifier's speakers to make the recording sound more like the live version. Searching for a title that would hit home with radio listeners, Bleyer sought the advice of Phil Everly, who listened and suggested it should be called \"Rumble\", as it had a rough attitude that reminded him of a street gang. (Rumble is slang for a \"gang fight\".)\n\n&gt; The menacing stalking sound of \"Rumble\" (and its title) led to a ban on several radio stations, a rare feat for a song with no lyrics, on the grounds that it glorified juvenile delinquency. Nevertheless it became a huge hit, not only in the United States, but also Great Britain, where it has been cited as an influence on The Kinks, The Who, and Jimmy Page among others. Jimmy Page cites the song in the Davis Guggenheim documentary \"It Might Get Loud\" and proceeds to play air guitar to the song in the movie. Pete Townshend stated in unpublished liner notes for the 1970 comeback album, \"He is the king; if it hadn't been for Link Wray and 'Rumble,' I would have never picked up a guitar.\" In other liner notes in 1974, Townshend said, of \"Rumble\": \"I remember being made very uneasy the first time I heard it, and yet excited by the savage guitar sounds.\"\n\n&gt; Jeff Beck, Duff McKagan, Jimmy Page, Jimi Hendrix, Marc Bolan, Neil Young and Bob Dylan have all cited Wray as an influence. Billy Childish has covered several Link Wray tracks, including \"Rumble\", \"Jack the Ripper\" and \"Comanche\", which he still performs in his set. The 1980 Adam and the Ants song \"Killer in the Home\" from their Kings of the Wild Frontier album is based on the same ominous, descending three-chord glissando riff that is featured in \"Rumble\" Ants' guitarist Marco Pirroni, an avid Wray fan, has described the song as \"Link Wray meets Col. Kurtz\" — the latter being a reference to Apocalypse Now. Mark E. Smith of The Fall sang the line \"I used to have this thing about Link Wray, I used to play him every Saturday, God bless Saturday\" in the song \"Neighbourhood of Infinity\" on the album Perverted by Language. \"Rumble\" has also been used as an intro theme to TV shows, particularly the original incarnation of Svengoolie.\n\n&gt; The band had several more hard-rocking instrumental hits in the late 1950s and early 1960s, including \"Rawhide\", \"Ace of Spades\", and \"Jack the Ripper\", the latter named after a \"dirty boogie\" dance popular in Baltimore at the time. The dirty boogie dance was among the several dance crazes featured in the 1988 film Hairspray.\n\n&gt; After his initial hits, Wray's career had periods of retirement followed by renewed popularity, particularly in Europe. He toured and recorded two albums with retro-rockabilly artist Robert Gordon in the late 1970s. The 1980s to the present day saw a large number of reissues as well as new material. One member of his band in the 1980s, on drums, was Anton Fig, who later became drummer in the CBS Orchestra on the David Letterman show. 1997 saw the release of Shadowman, generally regarded as the Rumble Man's return to his raw rock'n'roll roots. Backed by a Dutch band consisting of Eric Geevers on bass and Rob Louwers on drums, Wray toured Europe and Australia, which were documented on a live album and DVD. Link's last recording was 2000s Barbed Wire, again recorded with his Dutch rhythm section. He was generally accompanied on tour by his wife Olive Julie, and since the late nineties his Irish born road manager John Tynan. His regular backing band in the USA from 1998 until 2003 were bassist Atom Ellis and drummers Danny Heifetz (Mr. Bungle, Dieselhed) and Dustin Donaldson (I Am Spoonbender). He continued to tour up until four months before his death in 2005.\n\n&gt; His music has been featured in numerous films, including Pulp Fiction, Desperado, Independence Day, Twelve Monkeys, This Boy's Life, Blow, Johnny Suede, The Shadow, Breathless, Roadracers, and Pink Flamingos.\n\n&gt; in 2003, Link Wray was ranked at number sixty-seven in Rolling Stone magazine's list of the Hundred Greatest Guitarists of all time, but still has not yet been inducted into the Rock and Roll Hall of Fame. He is, however, a member of the Rockabilly Hall of Fame. Read more on Last.fm.\n\n [last.fm](https://www.last.fm/music/Link+Wray): 193,554 listeners, 1,850,131 plays  \n tags: *rockabilly, Surf, surf rock, Rock and Roll*  \n\n^^Please ^^downvote ^^if ^^incorrect!  ^^Self-deletes ^^if ^^score ^^is ^^0.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Link Wray&lt;/strong&gt;&lt;br/&gt;\n &lt;a href=\"https://lastfm-img2.akamaized.net/i/u/252/f530793f5dc04cdba04d47199beadaaa.png\"&gt;artist pic&lt;/a&gt;  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Frederick Lincoln &amp;quot;Link&amp;quot; Wray Jr (May 2, 1929 – November 5, 2005) was an American rock and roll guitarist, songwriter and occasional singer.&lt;/p&gt;\n\n&lt;p&gt;Wray was noted for pioneering a new sound for electric guitars, as exemplified in his hit 1958 instrumental &amp;quot;Rumble&amp;quot;, by Link Wray and his Ray Men, which pioneered an overdriven, distorted electric guitar sound, and also for having &amp;quot;invented the power chord, the major modus operandi of modern rock guitarist,&amp;quot; &amp;quot;and in doing so fathering,&amp;quot; or making possible, &amp;quot;punk and heavy rock&amp;quot;. Rolling Stone included Link at number 67 on their list of the 100 greatest guitarist of all time.&lt;/p&gt;\n\n&lt;p&gt;Wray was born in Dunn, North Carolina to Lillie M. Coats and Frederick Lincoln Wray. It was there that Link first heard slide guitar at age eight from a traveling carnival worker, an African-American man named &amp;quot;Hambone.&amp;quot; Wray was a veteran of the Korean war, where he contracted tuberculosis that ultimately cost him a lung. His doctors told him that he would never sing again. So Link concentrated on his heavy guitar work. Despite this, on his rare vocal numbers he displays a strong voice and a range equivalent to Clarence &amp;quot;Frogman&amp;quot; Henry.&lt;/p&gt;\n\n&lt;p&gt;Part Shawnee Indian, Wray frequently spoke of his ancestry in performances and interviews. Three of the songs he performed bear the names of American Indian tribes: &amp;quot;Shawnee&amp;quot;, &amp;quot;Apache&amp;quot;, and &amp;quot;Comanche.&amp;quot; &amp;quot;Apache&amp;quot; was an instrumental composed by Jerry Lordan, which became a hit in the UK for The Shadows in 1960. Wray recorded one of the better covers of the song 30 years later, somehow finding new life in this mythic, minor-key, guitar/drum dialogue which by then was also associated with everyone from The Ventures to the Incredible Bongo Band.&lt;/p&gt;\n\n&lt;p&gt;After discharge from the Army, Wray and his brothers Doug and Vernon Wray, with friends Shorty Horton and Dixie Neal, formed Lucky Wray and the Lazy Pine Wranglers, later known as Lucky Wray and the Palomino Ranch Hands. They had been playing country music and Western swing for several years when they took a gig as the house band on the daily live TV show Milt Grant&amp;#39;s House Party, a Washington, D.C. version of American Bandstand. The band made their first recordings in 1956 as Lucky Wray and the Palomino Ranch Hands for Starday Records.&lt;/p&gt;\n\n&lt;p&gt;For the TV show, they also backed many performers, from Fats Domino to Ricky Nelson. In 1958, at a live gig of the D.C.-based Milt Grant&amp;#39;s House Party, attempting—at the urging of the local crowd—to work up a cover sound-alike for The Diamonds&amp;#39; hit, &amp;quot;The Stroll&amp;quot;, they came up with an eleven and one half bar blues titled &amp;quot;Rumble&amp;quot; which they first called &amp;quot;Oddball&amp;quot;. The song was an instant hit with the live audience, which demanded four repeats that night. Eventually the song came to the attention of record producer Archie Bleyer of Cadence Records, who hated it, particularly after Wray poked holes in his amplifier&amp;#39;s speakers to make the recording sound more like the live version. Searching for a title that would hit home with radio listeners, Bleyer sought the advice of Phil Everly, who listened and suggested it should be called &amp;quot;Rumble&amp;quot;, as it had a rough attitude that reminded him of a street gang. (Rumble is slang for a &amp;quot;gang fight&amp;quot;.)&lt;/p&gt;\n\n&lt;p&gt;The menacing stalking sound of &amp;quot;Rumble&amp;quot; (and its title) led to a ban on several radio stations, a rare feat for a song with no lyrics, on the grounds that it glorified juvenile delinquency. Nevertheless it became a huge hit, not only in the United States, but also Great Britain, where it has been cited as an influence on The Kinks, The Who, and Jimmy Page among others. Jimmy Page cites the song in the Davis Guggenheim documentary &amp;quot;It Might Get Loud&amp;quot; and proceeds to play air guitar to the song in the movie. Pete Townshend stated in unpublished liner notes for the 1970 comeback album, &amp;quot;He is the king; if it hadn&amp;#39;t been for Link Wray and &amp;#39;Rumble,&amp;#39; I would have never picked up a guitar.&amp;quot; In other liner notes in 1974, Townshend said, of &amp;quot;Rumble&amp;quot;: &amp;quot;I remember being made very uneasy the first time I heard it, and yet excited by the savage guitar sounds.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Jeff Beck, Duff McKagan, Jimmy Page, Jimi Hendrix, Marc Bolan, Neil Young and Bob Dylan have all cited Wray as an influence. Billy Childish has covered several Link Wray tracks, including &amp;quot;Rumble&amp;quot;, &amp;quot;Jack the Ripper&amp;quot; and &amp;quot;Comanche&amp;quot;, which he still performs in his set. The 1980 Adam and the Ants song &amp;quot;Killer in the Home&amp;quot; from their Kings of the Wild Frontier album is based on the same ominous, descending three-chord glissando riff that is featured in &amp;quot;Rumble&amp;quot; Ants&amp;#39; guitarist Marco Pirroni, an avid Wray fan, has described the song as &amp;quot;Link Wray meets Col. Kurtz&amp;quot; — the latter being a reference to Apocalypse Now. Mark E. Smith of The Fall sang the line &amp;quot;I used to have this thing about Link Wray, I used to play him every Saturday, God bless Saturday&amp;quot; in the song &amp;quot;Neighbourhood of Infinity&amp;quot; on the album Perverted by Language. &amp;quot;Rumble&amp;quot; has also been used as an intro theme to TV shows, particularly the original incarnation of Svengoolie.&lt;/p&gt;\n\n&lt;p&gt;The band had several more hard-rocking instrumental hits in the late 1950s and early 1960s, including &amp;quot;Rawhide&amp;quot;, &amp;quot;Ace of Spades&amp;quot;, and &amp;quot;Jack the Ripper&amp;quot;, the latter named after a &amp;quot;dirty boogie&amp;quot; dance popular in Baltimore at the time. The dirty boogie dance was among the several dance crazes featured in the 1988 film Hairspray.&lt;/p&gt;\n\n&lt;p&gt;After his initial hits, Wray&amp;#39;s career had periods of retirement followed by renewed popularity, particularly in Europe. He toured and recorded two albums with retro-rockabilly artist Robert Gordon in the late 1970s. The 1980s to the present day saw a large number of reissues as well as new material. One member of his band in the 1980s, on drums, was Anton Fig, who later became drummer in the CBS Orchestra on the David Letterman show. 1997 saw the release of Shadowman, generally regarded as the Rumble Man&amp;#39;s return to his raw rock&amp;#39;n&amp;#39;roll roots. Backed by a Dutch band consisting of Eric Geevers on bass and Rob Louwers on drums, Wray toured Europe and Australia, which were documented on a live album and DVD. Link&amp;#39;s last recording was 2000s Barbed Wire, again recorded with his Dutch rhythm section. He was generally accompanied on tour by his wife Olive Julie, and since the late nineties his Irish born road manager John Tynan. His regular backing band in the USA from 1998 until 2003 were bassist Atom Ellis and drummers Danny Heifetz (Mr. Bungle, Dieselhed) and Dustin Donaldson (I Am Spoonbender). He continued to tour up until four months before his death in 2005.&lt;/p&gt;\n\n&lt;p&gt;His music has been featured in numerous films, including Pulp Fiction, Desperado, Independence Day, Twelve Monkeys, This Boy&amp;#39;s Life, Blow, Johnny Suede, The Shadow, Breathless, Roadracers, and Pink Flamingos.&lt;/p&gt;\n\n&lt;p&gt;in 2003, Link Wray was ranked at number sixty-seven in Rolling Stone magazine&amp;#39;s list of the Hundred Greatest Guitarists of all time, but still has not yet been inducted into the Rock and Roll Hall of Fame. He is, however, a member of the Rockabilly Hall of Fame. Read more on Last.fm.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.last.fm/music/Link+Wray\"&gt;last.fm&lt;/a&gt;: 193,554 listeners, 1,850,131 plays&lt;br/&gt;\n tags: &lt;em&gt;rockabilly, Surf, surf rock, Rock and Roll&lt;/em&gt;  &lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;sup&gt;Please&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;downvote&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;if&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;incorrect!&lt;/sup&gt;&lt;/sup&gt;  &lt;sup&gt;&lt;sup&gt;Self-deletes&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;if&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;score&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;is&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;0.&lt;/sup&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Music", "name": "t1_dg29g2t", "score_hidden": false, "stickied": false, "created": 1491831189.0, "created_utc": 1491802389.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1u", "removal_reason": null, "link_id": "t3_64hsq9", "likes": null, "replies": "", "user_reports": [], "id": "dg33jlh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "calvinball_guru", "parent_id": "t3_64hsq9", "subreddit_name_prefixed": "r/Music", "controversiality": 0, "body": "God damn, that's a pretty fucking good milkshake!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;God damn, that&amp;#39;s a pretty fucking good milkshake!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Music", "name": "t1_dg33jlh", "score_hidden": false, "stickied": false, "created": 1491880341.0, "created_utc": 1491851541.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]