[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {"content": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/_wCkmuRkZz4?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "width": 600, "scrolling": false, "height": 338}, "subreddit": "Music", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": {"oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Nick Drake // Pink Moon (1972)", "thumbnail_width": 480, "height": 338, "width": 600, "html": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/_wCkmuRkZz4?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "author_name": "Anteye LaVey", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/_wCkmuRkZz4/hqdefault.jpg", "type": "video", "thumbnail_height": 360, "author_url": "https://www.youtube.com/channel/UCuUXjunr9P0HU0E1xecQsCw"}, "type": "youtube.com"}, "link_flair_text": "music streaming", "id": "64vezt", "gilded": 0, "secure_media_embed": {"content": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/_wCkmuRkZz4?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "width": 600, "scrolling": false, "height": 338}, "clicked": false, "score": 27, "report_reasons": null, "author": "rebelboywonder", "saved": false, "mod_reports": [], "name": "t3_64vezt", "subreddit_name_prefixed": "r/Music", "approved_by": null, "over_18": false, "domain": "youtube.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh1u", "edited": false, "link_flair_css_class": "streaming", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/Music/comments/64vezt/nick_drake_pink_moon_folk/", "num_reports": null, "locked": false, "stickied": false, "created": 1491991973.0, "url": "https://www.youtube.com/watch?v=_wCkmuRkZz4", "author_flair_text": null, "quarantine": false, "title": "Nick Drake - Pink Moon [Folk]", "created_utc": 1491963173.0, "distinguished": null, "media": {"oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Nick Drake // Pink Moon (1972)", "thumbnail_width": 480, "height": 338, "width": 600, "html": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/_wCkmuRkZz4?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "author_name": "Anteye LaVey", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/_wCkmuRkZz4/hqdefault.jpg", "type": "video", "thumbnail_height": 360, "author_url": "https://www.youtube.com/channel/UCuUXjunr9P0HU0E1xecQsCw"}, "type": "youtube.com"}, "upvote_ratio": 0.85, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1u", "removal_reason": null, "link_id": "t3_64vezt", "likes": null, "replies": "", "user_reports": [], "id": "dg5bmwr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DJ_Spam", "parent_id": "t3_64vezt", "subreddit_name_prefixed": "r/Music", "controversiality": 0, "body": "**Nick Drake**  \n [artist pic](https://lastfm-img2.akamaized.net/i/u/252/d5f335c86e9c8f6c3a5909b7428f7dbe.png)  \n\n&gt; Nick Drake (Nicholas Rodney Drake, Rangoon, Burma, June 19, 1948 - Tanworth-in-Arden, England, November 25, 1974) was an English folk singer known for his gentle, enigmatic songs and his virtuoso right-hand finger picking technique.\n\n&gt; Although he recorded only three albums, critics and fellow musicians hold his work in very high esteem. Drake failed to find a wide audience during his lifetime, and had a strong aversion to performing. Since his death, however, Drake's music has gained a significant cult following. \n\n&gt; Drake's father worked as an engineer. Although he was born in Rangoon, Burma, Nick's family moved back to England soon afterward, and Drake was brought up in Tanworth-in-Arden, a small village in the English county of Warwickshire. He went to public school at Marlborough College, where he learned to play the clarinet and piano. As a young adult, Drake enrolled in Fitzwilliam College, Cambridge, to study English. His older sister, Gabrielle Drake, is an actress.\n\n&gt; Drake was a fan of British and the emerging American folk music scene, including artists Bob Dylan and Phil Ochs. While a university student, Drake began performing in local clubs and coffee houses. He was discovered by Ashley Hutchings, the bass player of the folk rock group Fairport Convention. Hutchings introduced Drake to the other members of Fairport Convention, folk singer John Martyn and producer Joe Boyd.\n\n&gt; He delayed attendance to spend six months at the University of Aix-Marseille, France, beginning in February 1967. While in Aix, he began to practice guitar in earnest, and to earn money would often busk with friends in the town centre. Drake began to smoke cannabis, and that spring he travelled with friends to Morocco, because, according to travelling companion Richard Charkin, \"that was where you got the best pot\". Drake's associates convinced Island Records to sign the young singer-songwriter to a three-album contract. Drake began recording his debut album Five Leaves Left later in 1968, with Boyd assuming the role of producer. The sessions took place in Sound Techniques studio, London, with Drake skipping lectures to travel by train to the capital. At the age of twenty, he released his first album Five Leaves Left (1969), which featured a chamber music quartet on several songs and had a light, breezy sound. Drake's second album Bryter Layter (1970) introduced a more upbeat, jazzier sound, with keyboards, horns and several brass instruments. Both albums were produced by Boyd and featured several members of Fairport Convention.\n\n&gt; Many accounts of Drake focus on his mythology, but a large part of his enduring popularity is due to his meticulous songwriting, prosody, odd guitar tunings and lyricism.\n\n&gt; Drake was pathologically shy and resented touring. The few concerts he did play were usually in support of other British folk acts of the time, such as Fairport Convention or John Martyn and were often brief and awkward. Partially because of this, his work received little attention and sold poorly. Whilst in the recording studio, he was so shy that he'd always play into the wall so as to avoid people's gazes.\n\n&gt; Severely depressed and doubting his abilities as a musician, Drake recorded his final album Pink Moon (1972) in two two-hour sessions, both starting at midnight. The songs of Pink Moon were short (the album consists of eleven of them and lasts only 28 minutes) and emotionally bleak.  Drake recorded them unaccompanied, in the presence of only a sound engineer (a piano was later overdubbed on the title track). Naked and sincere, it is widely thought to be his best work. \n\n&gt; At this point he considered other careers including the army and as a computer programmer, but more suitably as a songwriter for other artists. However, none of Drake's plans materialized. In the next few months, Drake grew severely depressed and maintained relationships only with close friends such as John Martyn, who wrote the title song of his 1973 album Solid Air for and about Drake and with Sophia Ryde. He was hospitalized several times and lived with Hardy for a few months. Friends from that time have described how much his appearance changed: his nails grown, his hair and frame gaunt and thin.\n\n&gt; In 1974, Drake felt well enough to write and record a few new songs. However, on November 25, he died of an overdose of antidepressants. The coroner concluded that the cause of Drake's death was suicide, although this was disputed by friends and relatives. Antidepressants of that time were quite lethal if ingested in any higher dosage than the one prescribed. His mother recounts that he must have had difficulty sleeping and had got up in the night to have a bowl of cornflakes. It's unclear whether he took more pills to help him sleep or to take his own life.\n\n&gt; His simple gravestone in the Tanworth churchyard bears the line \"And now we rise/And we are everywhere\", taken from From the Morning - the last song on the last album Nick lived to complete.\n\n&gt; Posthumous popularity\nSince Drake’s death, his music has grown steadily in popularity. Several modern musicians, such as Lucinda Williams, Badly Drawn Boy, Matthew Good, Sebadoh's Lou Barlow, R.E.M. guitarist Peter Buck, Blur’s Graham Coxon, and Belle and Sebastian, consider Drake an important influence. In early 1999, BBC2 aired a 40-minute Nick Drake documentary, \"A Stranger Among Us — In Search of Nick Drake\", as part of its Picture This strand. The following year saw the release of a documentary by Dutch director Jeroen Berkvens, titled A Skin Too Few: The Days of Nick Drake and featuring interviews with Joe Boyd, Gabrielle Drake, audio engineer John Wood and arranger Robert Kirby. Brad Pitt is a fan of Drake and, in 2004, he narrated a BBC radio documentary about the singer.\n\n&gt; Island has responded to Drake’s popularity with several new releases including Time of No Reply (1986), an album of unreleased material including four new songs recorded in 1974, Way to Blue: An Introduction to Nick Drake (1994), a \"best of\" album, remastered HDCD releases of his three studio albums in 2000, and Made to Love Magic (2004), featuring one new track and some newly recorded orchestration for a previously released track. A replacement for Way to Blue called A Treasury was also released in 2004 on Hybrid-SACD.\n\n&gt; In 2000, Volkswagen licensed the track Pink Moon, the title track from Nick's third release, for a particularly serene car commercial in the US. The advertisement caused a significant bounce in Drake’s popularity, bolstered by uses of Drake's music on a number of film soundtracks, including 1998's Hideous Kinky and Practical Magic (featuring \"Road\" from Pink Moon and \"Black Eyed Dog\" from Time of No Reply, respectively). In 2001, two Bryter Layter tracks appeared in mainstream films: \"Northern Sky\" in Serendipity, and \"Fly\" in The Royal Tenenbaums. In the same year, \"Cello Song\" from Five Leaves Left was featured in Me Without You. In 2004, \"One of These Things First\" appeared in Garden State and \"Northern Sky\" was featured again, this time in Fever Pitch.\n\n&gt; Drake's \"River Man\" has become quite popular among Jazz musicians. A piano improvisation based on the melody was released by Brad Mehldau on the album \"Progression: Art Of The Trio, Volume 5\", and a Jazz vocal version by Claire Martin appears on the album Take My Heart.\n\n&gt; Drake's posthumous popularity has made many fans consider the lyrics to \"Fruit Tree\" a song from Five Leaves Left prophetic: “Fame is but a fruit tree / So very unsound. / It can never flourish / Till its stock is in the ground. / So men of fame / Can never find a way / Till time has flown / Far from their dying day.” In 2004 two of his singles reached low positions in the UK charts - \"Magic\" and \"River Man\".\n\n&gt; Most recently, Nick Drake has emerged as a key influence in the resurgence of 1960's and 1970's folk traditions, apparent in the works of artists including Devendra Banhart, Joanna Newsom, and Six Organs of Admittance.\n\n&gt; In 2005, performer Beck updated his website during Christmas time with covers of three songs from Pink Moon: \"Pink Moon\", \"Which Will\" and \"Parasite.\"\n\n&gt; Family Tree, the next Bryter Music/Island record was released in July, 2007. Read more on Last.fm.\n\n [last.fm](https://www.last.fm/music/Nick+Drake): 1,355,758 listeners, 41,080,899 plays  \n tags: *folk, singer-songwriter, acoustic, indie, Mellow*  \n\n^^Please ^^downvote ^^if ^^incorrect!  ^^Self-deletes ^^if ^^score ^^is ^^0.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Nick Drake&lt;/strong&gt;&lt;br/&gt;\n &lt;a href=\"https://lastfm-img2.akamaized.net/i/u/252/d5f335c86e9c8f6c3a5909b7428f7dbe.png\"&gt;artist pic&lt;/a&gt;  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Nick Drake (Nicholas Rodney Drake, Rangoon, Burma, June 19, 1948 - Tanworth-in-Arden, England, November 25, 1974) was an English folk singer known for his gentle, enigmatic songs and his virtuoso right-hand finger picking technique.&lt;/p&gt;\n\n&lt;p&gt;Although he recorded only three albums, critics and fellow musicians hold his work in very high esteem. Drake failed to find a wide audience during his lifetime, and had a strong aversion to performing. Since his death, however, Drake&amp;#39;s music has gained a significant cult following. &lt;/p&gt;\n\n&lt;p&gt;Drake&amp;#39;s father worked as an engineer. Although he was born in Rangoon, Burma, Nick&amp;#39;s family moved back to England soon afterward, and Drake was brought up in Tanworth-in-Arden, a small village in the English county of Warwickshire. He went to public school at Marlborough College, where he learned to play the clarinet and piano. As a young adult, Drake enrolled in Fitzwilliam College, Cambridge, to study English. His older sister, Gabrielle Drake, is an actress.&lt;/p&gt;\n\n&lt;p&gt;Drake was a fan of British and the emerging American folk music scene, including artists Bob Dylan and Phil Ochs. While a university student, Drake began performing in local clubs and coffee houses. He was discovered by Ashley Hutchings, the bass player of the folk rock group Fairport Convention. Hutchings introduced Drake to the other members of Fairport Convention, folk singer John Martyn and producer Joe Boyd.&lt;/p&gt;\n\n&lt;p&gt;He delayed attendance to spend six months at the University of Aix-Marseille, France, beginning in February 1967. While in Aix, he began to practice guitar in earnest, and to earn money would often busk with friends in the town centre. Drake began to smoke cannabis, and that spring he travelled with friends to Morocco, because, according to travelling companion Richard Charkin, &amp;quot;that was where you got the best pot&amp;quot;. Drake&amp;#39;s associates convinced Island Records to sign the young singer-songwriter to a three-album contract. Drake began recording his debut album Five Leaves Left later in 1968, with Boyd assuming the role of producer. The sessions took place in Sound Techniques studio, London, with Drake skipping lectures to travel by train to the capital. At the age of twenty, he released his first album Five Leaves Left (1969), which featured a chamber music quartet on several songs and had a light, breezy sound. Drake&amp;#39;s second album Bryter Layter (1970) introduced a more upbeat, jazzier sound, with keyboards, horns and several brass instruments. Both albums were produced by Boyd and featured several members of Fairport Convention.&lt;/p&gt;\n\n&lt;p&gt;Many accounts of Drake focus on his mythology, but a large part of his enduring popularity is due to his meticulous songwriting, prosody, odd guitar tunings and lyricism.&lt;/p&gt;\n\n&lt;p&gt;Drake was pathologically shy and resented touring. The few concerts he did play were usually in support of other British folk acts of the time, such as Fairport Convention or John Martyn and were often brief and awkward. Partially because of this, his work received little attention and sold poorly. Whilst in the recording studio, he was so shy that he&amp;#39;d always play into the wall so as to avoid people&amp;#39;s gazes.&lt;/p&gt;\n\n&lt;p&gt;Severely depressed and doubting his abilities as a musician, Drake recorded his final album Pink Moon (1972) in two two-hour sessions, both starting at midnight. The songs of Pink Moon were short (the album consists of eleven of them and lasts only 28 minutes) and emotionally bleak.  Drake recorded them unaccompanied, in the presence of only a sound engineer (a piano was later overdubbed on the title track). Naked and sincere, it is widely thought to be his best work. &lt;/p&gt;\n\n&lt;p&gt;At this point he considered other careers including the army and as a computer programmer, but more suitably as a songwriter for other artists. However, none of Drake&amp;#39;s plans materialized. In the next few months, Drake grew severely depressed and maintained relationships only with close friends such as John Martyn, who wrote the title song of his 1973 album Solid Air for and about Drake and with Sophia Ryde. He was hospitalized several times and lived with Hardy for a few months. Friends from that time have described how much his appearance changed: his nails grown, his hair and frame gaunt and thin.&lt;/p&gt;\n\n&lt;p&gt;In 1974, Drake felt well enough to write and record a few new songs. However, on November 25, he died of an overdose of antidepressants. The coroner concluded that the cause of Drake&amp;#39;s death was suicide, although this was disputed by friends and relatives. Antidepressants of that time were quite lethal if ingested in any higher dosage than the one prescribed. His mother recounts that he must have had difficulty sleeping and had got up in the night to have a bowl of cornflakes. It&amp;#39;s unclear whether he took more pills to help him sleep or to take his own life.&lt;/p&gt;\n\n&lt;p&gt;His simple gravestone in the Tanworth churchyard bears the line &amp;quot;And now we rise/And we are everywhere&amp;quot;, taken from From the Morning - the last song on the last album Nick lived to complete.&lt;/p&gt;\n\n&lt;p&gt;Posthumous popularity\nSince Drake’s death, his music has grown steadily in popularity. Several modern musicians, such as Lucinda Williams, Badly Drawn Boy, Matthew Good, Sebadoh&amp;#39;s Lou Barlow, R.E.M. guitarist Peter Buck, Blur’s Graham Coxon, and Belle and Sebastian, consider Drake an important influence. In early 1999, BBC2 aired a 40-minute Nick Drake documentary, &amp;quot;A Stranger Among Us — In Search of Nick Drake&amp;quot;, as part of its Picture This strand. The following year saw the release of a documentary by Dutch director Jeroen Berkvens, titled A Skin Too Few: The Days of Nick Drake and featuring interviews with Joe Boyd, Gabrielle Drake, audio engineer John Wood and arranger Robert Kirby. Brad Pitt is a fan of Drake and, in 2004, he narrated a BBC radio documentary about the singer.&lt;/p&gt;\n\n&lt;p&gt;Island has responded to Drake’s popularity with several new releases including Time of No Reply (1986), an album of unreleased material including four new songs recorded in 1974, Way to Blue: An Introduction to Nick Drake (1994), a &amp;quot;best of&amp;quot; album, remastered HDCD releases of his three studio albums in 2000, and Made to Love Magic (2004), featuring one new track and some newly recorded orchestration for a previously released track. A replacement for Way to Blue called A Treasury was also released in 2004 on Hybrid-SACD.&lt;/p&gt;\n\n&lt;p&gt;In 2000, Volkswagen licensed the track Pink Moon, the title track from Nick&amp;#39;s third release, for a particularly serene car commercial in the US. The advertisement caused a significant bounce in Drake’s popularity, bolstered by uses of Drake&amp;#39;s music on a number of film soundtracks, including 1998&amp;#39;s Hideous Kinky and Practical Magic (featuring &amp;quot;Road&amp;quot; from Pink Moon and &amp;quot;Black Eyed Dog&amp;quot; from Time of No Reply, respectively). In 2001, two Bryter Layter tracks appeared in mainstream films: &amp;quot;Northern Sky&amp;quot; in Serendipity, and &amp;quot;Fly&amp;quot; in The Royal Tenenbaums. In the same year, &amp;quot;Cello Song&amp;quot; from Five Leaves Left was featured in Me Without You. In 2004, &amp;quot;One of These Things First&amp;quot; appeared in Garden State and &amp;quot;Northern Sky&amp;quot; was featured again, this time in Fever Pitch.&lt;/p&gt;\n\n&lt;p&gt;Drake&amp;#39;s &amp;quot;River Man&amp;quot; has become quite popular among Jazz musicians. A piano improvisation based on the melody was released by Brad Mehldau on the album &amp;quot;Progression: Art Of The Trio, Volume 5&amp;quot;, and a Jazz vocal version by Claire Martin appears on the album Take My Heart.&lt;/p&gt;\n\n&lt;p&gt;Drake&amp;#39;s posthumous popularity has made many fans consider the lyrics to &amp;quot;Fruit Tree&amp;quot; a song from Five Leaves Left prophetic: “Fame is but a fruit tree / So very unsound. / It can never flourish / Till its stock is in the ground. / So men of fame / Can never find a way / Till time has flown / Far from their dying day.” In 2004 two of his singles reached low positions in the UK charts - &amp;quot;Magic&amp;quot; and &amp;quot;River Man&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Most recently, Nick Drake has emerged as a key influence in the resurgence of 1960&amp;#39;s and 1970&amp;#39;s folk traditions, apparent in the works of artists including Devendra Banhart, Joanna Newsom, and Six Organs of Admittance.&lt;/p&gt;\n\n&lt;p&gt;In 2005, performer Beck updated his website during Christmas time with covers of three songs from Pink Moon: &amp;quot;Pink Moon&amp;quot;, &amp;quot;Which Will&amp;quot; and &amp;quot;Parasite.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Family Tree, the next Bryter Music/Island record was released in July, 2007. Read more on Last.fm.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.last.fm/music/Nick+Drake\"&gt;last.fm&lt;/a&gt;: 1,355,758 listeners, 41,080,899 plays&lt;br/&gt;\n tags: &lt;em&gt;folk, singer-songwriter, acoustic, indie, Mellow&lt;/em&gt;  &lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;sup&gt;Please&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;downvote&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;if&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;incorrect!&lt;/sup&gt;&lt;/sup&gt;  &lt;sup&gt;&lt;sup&gt;Self-deletes&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;if&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;score&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;is&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;0.&lt;/sup&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Music", "name": "t1_dg5bmwr", "score_hidden": false, "stickied": false, "created": 1491992163.0, "created_utc": 1491963363.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1u", "removal_reason": null, "link_id": "t3_64vezt", "likes": null, "replies": "", "user_reports": [], "id": "dg5q137", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lizardz4u80", "parent_id": "t3_64vezt", "subreddit_name_prefixed": "r/Music", "controversiality": 0, "body": "He recorded this album lying on the floor because he was too depressed to stand", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He recorded this album lying on the floor because he was too depressed to stand&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Music", "name": "t1_dg5q137", "score_hidden": false, "stickied": false, "created": 1492023672.0, "created_utc": 1491994872.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]