[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {"content": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/rTVjnBo96Ug?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "width": 459, "scrolling": false, "height": 344}, "subreddit": "Music", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": {"oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Otis Redding - (Sittin' On) The Dock Of The Bay (Official Video)", "thumbnail_width": 480, "height": 344, "width": 459, "html": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/rTVjnBo96Ug?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "author_name": "RHINO", "thumbnail_height": 360, "thumbnail_url": "https://i.ytimg.com/vi/rTVjnBo96Ug/hqdefault.jpg", "type": "video", "provider_name": "YouTube", "author_url": "https://www.youtube.com/user/RhinoEntertainment"}, "type": "youtube.com"}, "link_flair_text": "music streaming", "id": "659vl1", "gilded": 0, "secure_media_embed": {"content": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/rTVjnBo96Ug?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "width": 459, "scrolling": false, "height": 344}, "clicked": false, "score": 41, "report_reasons": null, "author": "GavinDickieBitchFree", "saved": false, "mod_reports": [], "name": "t3_659vl1", "subreddit_name_prefixed": "r/Music", "approved_by": null, "over_18": false, "domain": "youtube.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh1u", "edited": false, "link_flair_css_class": "streaming", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/Music/comments/659vl1/otis_redding_sittin_on_the_dock_of_the_baysoul/", "num_reports": null, "locked": false, "stickied": false, "created": 1492164001.0, "url": "https://www.youtube.com/watch?v=rTVjnBo96Ug", "author_flair_text": null, "quarantine": false, "title": "Otis Redding - (Sittin' On) The Dock Of The Bay[Soul]", "created_utc": 1492135201.0, "distinguished": null, "media": {"oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Otis Redding - (Sittin' On) The Dock Of The Bay (Official Video)", "thumbnail_width": 480, "height": 344, "width": 459, "html": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/rTVjnBo96Ug?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "author_name": "RHINO", "thumbnail_height": 360, "thumbnail_url": "https://i.ytimg.com/vi/rTVjnBo96Ug/hqdefault.jpg", "type": "video", "provider_name": "YouTube", "author_url": "https://www.youtube.com/user/RhinoEntertainment"}, "type": "youtube.com"}, "upvote_ratio": 0.88, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 41}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1u", "removal_reason": null, "link_id": "t3_659vl1", "likes": null, "replies": "", "user_reports": [], "id": "dg8llas", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "DJ_Spam", "parent_id": "t3_659vl1", "subreddit_name_prefixed": "r/Music", "controversiality": 0, "body": "**Otis Redding**  \n [artist pic](https://lastfm-img2.akamaized.net/i/u/252/4e799fbdcb5a4a69a955d8241ec844ce.png)  \n\n&gt; Otis Redding (Otis Ray Redding Jr., September 9, 1941 – December 10, 1967) was an American, highly influential, rhythm &amp; blues and soul singer, and songwriter.\nHe is considered one of the greatest singers in the history of American popular music and a seminal artist in soul music and rhythm and blues. His singing style influenced many other soul artists of the 1960s. During his lifetime, his recordings were produced by Stax Records, based in Memphis, Tennessee, and exemplify the sound of Stax.\nRedding received many posthumous accolades, including the Grammy Lifetime Achievement Award and induction into the Rock and Roll Hall of Fame and the Songwriters Hall of Fame. In addition to \"(Sittin' on) The Dock of the Bay,\" \"Respect\" and \"Try a Little Tenderness\" are among his best-known songs.\n\n&gt; Redding was born in the small town of Dawson, Georgia. When he was 5, his family moved to Macon, Georgia. Redding sang in the choir at church, and as a teenager won the talent show at the Douglass Theatre for 15 weeks in a row. His early influences were Little Richard and Sam Cooke. Richard Pennyman (Little Richard) was also a Macon resident. Redding said, \"If it hadn't been for Little Richard, I would not be here. I entered the music business because of Richard; he is my inspiration. I used to sing like Little Richard, his Rock 'n' Roll stuff, you know. Richard has soul, too. My present music has a lot of him in it.\"\n\n&gt; In 1960, Redding began touring the South with Johnny Jenkins and The Pinetoppers. In addition to singing, Redding also served as Jenkins' driver since the bandleader did not possess a driver's license. That same year he made his first recordings, \"Fat Gal\" and \"Shout Bamalama\" with this group under the name \"Otis Redding and The Pinetoppers\" Issued on the Orbit and Confederate record labels before being picked up by King.\n\n&gt; In 1962, Redding made his first real mark in the music business during a Johnny Jenkins session when, during studio time left over, he recorded \"These Arms of Mine\", a ballad that he had written. The song became a minor hit. on Volt Records, a subsidiary of the renowned Southern soul label Stax, based in Memphis, Tennessee.\n\n&gt; Along with others such as Wilson Pickett, Sam &amp; Dave, Eddie Floyd and Carla Thomas, Redding was a key exponent of the raw and electrifying \"Southern Fried\" soul sounds coming from Stax/Volt label. There were also similarities and interactions with Atlantic artists such as Solomon Burke, Arthur Conley, Percy Sledge and Aretha Franklin.\n\n&gt; Redding's death in an air crash, aged just 26, deprived soul music of one of its most promising stars. His biggest hit single, and a breakthrough to a mainstream audience, (Sittin' On) the Dock of the Bay, was released posthumously. Other notable tracks are I've Been Loving You Too Long, Try a Little Tenderness, Fa-Fa-Fa-Fa-Fa (Sad Song), Respect (also a big hit for Aretha Franklin), I Can't Turn You Loose, Mr Pitiful, Shake and Tramp (with Carla Thomas).\n\n&gt; Unlike their Tamla Motown brethren, artists at Stax could still see cotton fields being worked outside the studio and were not as vigorously coached into \"white acceptable\" forms of expression by label policy. Thus, the concurrent Stax/Volt releases of the time tend to be less polished and formulaic, still managing to cross blurring color lines. Atlantic Records, based in New York, also did not try to 'manufacture' its artists in the Motown fashion.\n\n&gt; \"(Sittin' On) The Dock of the Bay\" was recorded only three days before Redding's death. According to Nashid Munyan, curator of the Stax Museum of American Soul Music, Redding considered the song unfinished, having whistled the tune of one verse for which he intended to compose lyrics later. The song was released (with the place-holding whistling intact) in January 1968 and became Redding's only number-one single on the Billboard Hot 100, and the first posthumous single in U.S. chart history. \"(Sittin' On) The Dock of the Bay\" was a significant stylistic departure from the bulk of his previous work, and might have presaged a change in direction for the singer.\n\n&gt; Redding wrote many of his own songs, which was unusual for the time, often with Steve Cropper (of the Stax house band Booker T. and the MGs the main backing band of the Stax label, with the Bar-Kays filling the second slot. \n\n&gt; On December 9, 1967, Redding and his backup band, The Bar-Kays, made an appearance in Cleveland, Ohio on the local \"Upbeat\" television show. The next afternoon, Redding, his manager, the pilot, and four members of The Bar-Kays were killed when his Beechcraft 18 airplane crashed into Lake Monona in Madison, Wisconsin, on December 10, 1967. The two remaining Bar-Kays were Ben Cauley and James Alexander. Cauley was the only person aboard Redding's plane to survive the crash. Alexander was on another plane, since there were eight members in Redding's party and the plane could only hold seven, and it was Alexander's turn in the rotation to take a commercial flight.\n\n&gt; Shortly after Redding's death, Atlantic Records, distributor of the Stax/Volt releases, was purchased by Warner Bros. Stax was required to renegotiate its distribution deal, and found that Atlantic actually owned the entire Stax/Volt back catalog.  Stax was unable to regain the rights to their recordings, and severed their relationship with Atlantic. Atlantic also retained the rights to all unreleased Otis Redding masters. \n\n&gt; Redding had recorded a massive amount of material in late 1967 just before his death (it was from these sessions that \"(Sittin' On) The Dock of the Bay\" emerged). Atlantic had enough material for three new Redding studio albums - The Immortal Otis Redding (1968), Love Man (1969), and Tell the Truth (1970) - which were all issued on Atlantic's Atco Records.  A number of successful singles emerged from these LPs, among them \"Amen\" (1968), \"Hard to Handle\" (1968), \"I've Got Dreams to Remember\" (1968), \"Love Man\" (1969), and \"Look at That Girl\" (1969). Singles were also lifted from two live Atlantic-issued Redding albums, In Person at the Whisky a Go Go, recorded in 1966 and issued 1968 on Atco, and Monterey International Pop Festival, a Reprise Records release featuring the live Monterey Pop Festival performances of The Jimi Hendrix Experience on side one and Redding on side two.\n\n&gt; In 1993, the U.S. Post Office issued an Otis Redding 29 cents commemorative postage stamp. Redding was inducted in the Songwriters Hall of Fame in 1994, and in 1999 he posthumously received the Grammy Lifetime Achievement Award. The Rock and Roll Hall of Fame listed three Redding recordings (\"Shake,\" \"(Sittin' On) The Dock of the Bay,\" and \"Try a Little Tenderness\") among its list of \"The 500 Songs that Shaped Rock and Roll.\"  Rolling Stone ranked Redding #21 on their list of the 100 Greatest Artists of All Time.\n\n&gt; In 2002, the city of Macon honored its native son, unveiling a memorial statue of Redding in the city's Gateway Park. The Rhythm and Blues Foundation named Redding as the recipient of its 2006 Legacy Award.\n\n&gt; In September 2007, the first official DVD anthology of Redding's live performances was released by Concord Music Group, the current owners of the Stax catalog. The DVD, entitled Dreams To Remember: The Legacy of Otis Redding, featured 16 classic full-length performances and 40 minutes of new interviews documenting Redding's life and career. It was premiered at the Douglass Theatre.\n\n&gt; In November 2008, Rolling Stone Magazine placed Redding at number 8 in their list of \"100 Greatest Singers of All-Time\".\n\n&gt; \n Read more on Last.fm.\n\n [last.fm](https://www.last.fm/music/Otis+Redding): 1,317,040 listeners, 21,634,762 plays  \n tags: *soul, rhythm and blues, 60s, oldies*  \n\n^^Please ^^downvote ^^if ^^incorrect!  ^^Self-deletes ^^if ^^score ^^is ^^0.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Otis Redding&lt;/strong&gt;&lt;br/&gt;\n &lt;a href=\"https://lastfm-img2.akamaized.net/i/u/252/4e799fbdcb5a4a69a955d8241ec844ce.png\"&gt;artist pic&lt;/a&gt;  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Otis Redding (Otis Ray Redding Jr., September 9, 1941 – December 10, 1967) was an American, highly influential, rhythm &amp;amp; blues and soul singer, and songwriter.\nHe is considered one of the greatest singers in the history of American popular music and a seminal artist in soul music and rhythm and blues. His singing style influenced many other soul artists of the 1960s. During his lifetime, his recordings were produced by Stax Records, based in Memphis, Tennessee, and exemplify the sound of Stax.\nRedding received many posthumous accolades, including the Grammy Lifetime Achievement Award and induction into the Rock and Roll Hall of Fame and the Songwriters Hall of Fame. In addition to &amp;quot;(Sittin&amp;#39; on) The Dock of the Bay,&amp;quot; &amp;quot;Respect&amp;quot; and &amp;quot;Try a Little Tenderness&amp;quot; are among his best-known songs.&lt;/p&gt;\n\n&lt;p&gt;Redding was born in the small town of Dawson, Georgia. When he was 5, his family moved to Macon, Georgia. Redding sang in the choir at church, and as a teenager won the talent show at the Douglass Theatre for 15 weeks in a row. His early influences were Little Richard and Sam Cooke. Richard Pennyman (Little Richard) was also a Macon resident. Redding said, &amp;quot;If it hadn&amp;#39;t been for Little Richard, I would not be here. I entered the music business because of Richard; he is my inspiration. I used to sing like Little Richard, his Rock &amp;#39;n&amp;#39; Roll stuff, you know. Richard has soul, too. My present music has a lot of him in it.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;In 1960, Redding began touring the South with Johnny Jenkins and The Pinetoppers. In addition to singing, Redding also served as Jenkins&amp;#39; driver since the bandleader did not possess a driver&amp;#39;s license. That same year he made his first recordings, &amp;quot;Fat Gal&amp;quot; and &amp;quot;Shout Bamalama&amp;quot; with this group under the name &amp;quot;Otis Redding and The Pinetoppers&amp;quot; Issued on the Orbit and Confederate record labels before being picked up by King.&lt;/p&gt;\n\n&lt;p&gt;In 1962, Redding made his first real mark in the music business during a Johnny Jenkins session when, during studio time left over, he recorded &amp;quot;These Arms of Mine&amp;quot;, a ballad that he had written. The song became a minor hit. on Volt Records, a subsidiary of the renowned Southern soul label Stax, based in Memphis, Tennessee.&lt;/p&gt;\n\n&lt;p&gt;Along with others such as Wilson Pickett, Sam &amp;amp; Dave, Eddie Floyd and Carla Thomas, Redding was a key exponent of the raw and electrifying &amp;quot;Southern Fried&amp;quot; soul sounds coming from Stax/Volt label. There were also similarities and interactions with Atlantic artists such as Solomon Burke, Arthur Conley, Percy Sledge and Aretha Franklin.&lt;/p&gt;\n\n&lt;p&gt;Redding&amp;#39;s death in an air crash, aged just 26, deprived soul music of one of its most promising stars. His biggest hit single, and a breakthrough to a mainstream audience, (Sittin&amp;#39; On) the Dock of the Bay, was released posthumously. Other notable tracks are I&amp;#39;ve Been Loving You Too Long, Try a Little Tenderness, Fa-Fa-Fa-Fa-Fa (Sad Song), Respect (also a big hit for Aretha Franklin), I Can&amp;#39;t Turn You Loose, Mr Pitiful, Shake and Tramp (with Carla Thomas).&lt;/p&gt;\n\n&lt;p&gt;Unlike their Tamla Motown brethren, artists at Stax could still see cotton fields being worked outside the studio and were not as vigorously coached into &amp;quot;white acceptable&amp;quot; forms of expression by label policy. Thus, the concurrent Stax/Volt releases of the time tend to be less polished and formulaic, still managing to cross blurring color lines. Atlantic Records, based in New York, also did not try to &amp;#39;manufacture&amp;#39; its artists in the Motown fashion.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;(Sittin&amp;#39; On) The Dock of the Bay&amp;quot; was recorded only three days before Redding&amp;#39;s death. According to Nashid Munyan, curator of the Stax Museum of American Soul Music, Redding considered the song unfinished, having whistled the tune of one verse for which he intended to compose lyrics later. The song was released (with the place-holding whistling intact) in January 1968 and became Redding&amp;#39;s only number-one single on the Billboard Hot 100, and the first posthumous single in U.S. chart history. &amp;quot;(Sittin&amp;#39; On) The Dock of the Bay&amp;quot; was a significant stylistic departure from the bulk of his previous work, and might have presaged a change in direction for the singer.&lt;/p&gt;\n\n&lt;p&gt;Redding wrote many of his own songs, which was unusual for the time, often with Steve Cropper (of the Stax house band Booker T. and the MGs the main backing band of the Stax label, with the Bar-Kays filling the second slot. &lt;/p&gt;\n\n&lt;p&gt;On December 9, 1967, Redding and his backup band, The Bar-Kays, made an appearance in Cleveland, Ohio on the local &amp;quot;Upbeat&amp;quot; television show. The next afternoon, Redding, his manager, the pilot, and four members of The Bar-Kays were killed when his Beechcraft 18 airplane crashed into Lake Monona in Madison, Wisconsin, on December 10, 1967. The two remaining Bar-Kays were Ben Cauley and James Alexander. Cauley was the only person aboard Redding&amp;#39;s plane to survive the crash. Alexander was on another plane, since there were eight members in Redding&amp;#39;s party and the plane could only hold seven, and it was Alexander&amp;#39;s turn in the rotation to take a commercial flight.&lt;/p&gt;\n\n&lt;p&gt;Shortly after Redding&amp;#39;s death, Atlantic Records, distributor of the Stax/Volt releases, was purchased by Warner Bros. Stax was required to renegotiate its distribution deal, and found that Atlantic actually owned the entire Stax/Volt back catalog.  Stax was unable to regain the rights to their recordings, and severed their relationship with Atlantic. Atlantic also retained the rights to all unreleased Otis Redding masters. &lt;/p&gt;\n\n&lt;p&gt;Redding had recorded a massive amount of material in late 1967 just before his death (it was from these sessions that &amp;quot;(Sittin&amp;#39; On) The Dock of the Bay&amp;quot; emerged). Atlantic had enough material for three new Redding studio albums - The Immortal Otis Redding (1968), Love Man (1969), and Tell the Truth (1970) - which were all issued on Atlantic&amp;#39;s Atco Records.  A number of successful singles emerged from these LPs, among them &amp;quot;Amen&amp;quot; (1968), &amp;quot;Hard to Handle&amp;quot; (1968), &amp;quot;I&amp;#39;ve Got Dreams to Remember&amp;quot; (1968), &amp;quot;Love Man&amp;quot; (1969), and &amp;quot;Look at That Girl&amp;quot; (1969). Singles were also lifted from two live Atlantic-issued Redding albums, In Person at the Whisky a Go Go, recorded in 1966 and issued 1968 on Atco, and Monterey International Pop Festival, a Reprise Records release featuring the live Monterey Pop Festival performances of The Jimi Hendrix Experience on side one and Redding on side two.&lt;/p&gt;\n\n&lt;p&gt;In 1993, the U.S. Post Office issued an Otis Redding 29 cents commemorative postage stamp. Redding was inducted in the Songwriters Hall of Fame in 1994, and in 1999 he posthumously received the Grammy Lifetime Achievement Award. The Rock and Roll Hall of Fame listed three Redding recordings (&amp;quot;Shake,&amp;quot; &amp;quot;(Sittin&amp;#39; On) The Dock of the Bay,&amp;quot; and &amp;quot;Try a Little Tenderness&amp;quot;) among its list of &amp;quot;The 500 Songs that Shaped Rock and Roll.&amp;quot;  Rolling Stone ranked Redding #21 on their list of the 100 Greatest Artists of All Time.&lt;/p&gt;\n\n&lt;p&gt;In 2002, the city of Macon honored its native son, unveiling a memorial statue of Redding in the city&amp;#39;s Gateway Park. The Rhythm and Blues Foundation named Redding as the recipient of its 2006 Legacy Award.&lt;/p&gt;\n\n&lt;p&gt;In September 2007, the first official DVD anthology of Redding&amp;#39;s live performances was released by Concord Music Group, the current owners of the Stax catalog. The DVD, entitled Dreams To Remember: The Legacy of Otis Redding, featured 16 classic full-length performances and 40 minutes of new interviews documenting Redding&amp;#39;s life and career. It was premiered at the Douglass Theatre.&lt;/p&gt;\n\n&lt;p&gt;In November 2008, Rolling Stone Magazine placed Redding at number 8 in their list of &amp;quot;100 Greatest Singers of All-Time&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Read more on Last.fm.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.last.fm/music/Otis+Redding\"&gt;last.fm&lt;/a&gt;: 1,317,040 listeners, 21,634,762 plays&lt;br/&gt;\n tags: &lt;em&gt;soul, rhythm and blues, 60s, oldies&lt;/em&gt;  &lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;sup&gt;Please&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;downvote&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;if&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;incorrect!&lt;/sup&gt;&lt;/sup&gt;  &lt;sup&gt;&lt;sup&gt;Self-deletes&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;if&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;score&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;is&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;0.&lt;/sup&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Music", "name": "t1_dg8llas", "score_hidden": false, "stickied": false, "created": 1492164192.0, "created_utc": 1492135392.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1u", "removal_reason": null, "link_id": "t3_659vl1", "likes": null, "replies": "", "user_reports": [], "id": "dg8rnpi", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TotalCinephile", "parent_id": "t3_659vl1", "subreddit_name_prefixed": "r/Music", "controversiality": 0, "body": "One of my all time favorites", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One of my all time favorites&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Music", "name": "t1_dg8rnpi", "score_hidden": false, "stickied": false, "created": 1492173539.0, "created_utc": 1492144739.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1u", "removal_reason": null, "link_id": "t3_659vl1", "likes": null, "replies": "", "user_reports": [], "id": "dg8ylqo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "YawnocThaDestroyer", "parent_id": "t3_659vl1", "subreddit_name_prefixed": "r/Music", "controversiality": 0, "body": "This was the song my parents played after I was born. I love it so much.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was the song my parents played after I was born. I love it so much.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Music", "name": "t1_dg8ylqo", "score_hidden": false, "stickied": false, "created": 1492191115.0, "created_utc": 1492162315.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1u", "removal_reason": null, "link_id": "t3_659vl1", "likes": null, "replies": "", "user_reports": [], "id": "dg99f0j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "foll-trood", "parent_id": "t3_659vl1", "subreddit_name_prefixed": "r/Music", "controversiality": 0, "body": "[sittin on a cock cause I'm gay](https://www.youtube.com/watch?v=FQ5I8wIy-H8)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=FQ5I8wIy-H8\"&gt;sittin on a cock cause I&amp;#39;m gay&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Music", "name": "t1_dg99f0j", "score_hidden": false, "stickied": false, "created": 1492211952.0, "created_utc": 1492183152.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1u", "removal_reason": null, "link_id": "t3_659vl1", "likes": null, "replies": "", "user_reports": [], "id": "dg9dx3i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "epzik8", "parent_id": "t3_659vl1", "subreddit_name_prefixed": "r/Music", "controversiality": 0, "body": "I was in St. Pete Beach, Florida the last weekend of this February for my dad and stepmom's wedding, and at the beach bar at my hotel that Saturday, there was a guy singing cover versions of popular songs while playing a guitar. This was one of the songs he performed, and as a nod to that area of Florida, instead of singing \"headed for the 'Frisco Bay\", he sang \"headed for the Tampa Bay\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was in St. Pete Beach, Florida the last weekend of this February for my dad and stepmom&amp;#39;s wedding, and at the beach bar at my hotel that Saturday, there was a guy singing cover versions of popular songs while playing a guitar. This was one of the songs he performed, and as a nod to that area of Florida, instead of singing &amp;quot;headed for the &amp;#39;Frisco Bay&amp;quot;, he sang &amp;quot;headed for the Tampa Bay&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Music", "name": "t1_dg9dx3i", "score_hidden": false, "stickied": false, "created": 1492217076.0, "created_utc": 1492188276.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]