[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {"content": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/17lkdqoLt44?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "width": 459, "scrolling": false, "height": 344}, "subreddit": "Music", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": {"oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The Gap Band - You Dropped A Bomb On Me", "type": "video", "thumbnail_width": 480, "height": 344, "width": 459, "html": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/17lkdqoLt44?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "author_name": "TheGapBandVEVO", "thumbnail_height": 360, "thumbnail_url": "https://i.ytimg.com/vi/17lkdqoLt44/hqdefault.jpg", "provider_name": "YouTube", "author_url": "https://www.youtube.com/user/TheGapBandVEVO"}, "type": "youtube.com"}, "link_flair_text": "music streaming", "id": "65u072", "gilded": 0, "secure_media_embed": {"content": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/17lkdqoLt44?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "width": 459, "scrolling": false, "height": 344}, "clicked": false, "score": 42, "report_reasons": null, "author": "herhaa", "saved": false, "mod_reports": [], "name": "t3_65u072", "subreddit_name_prefixed": "r/Music", "approved_by": null, "over_18": false, "domain": "youtu.be", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh1u", "edited": false, "link_flair_css_class": "streaming", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/Music/comments/65u072/the_gap_band_you_dropped_a_bomb_on_me_electrofunk/", "num_reports": null, "locked": false, "stickied": false, "created": 1492439527.0, "url": "https://youtu.be/17lkdqoLt44", "author_flair_text": null, "quarantine": false, "title": "The Gap Band - You Dropped A Bomb On Me [Electro-Funk]", "created_utc": 1492410727.0, "distinguished": null, "media": {"oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The Gap Band - You Dropped A Bomb On Me", "type": "video", "thumbnail_width": 480, "height": 344, "width": 459, "html": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/17lkdqoLt44?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "author_name": "TheGapBandVEVO", "thumbnail_height": 360, "thumbnail_url": "https://i.ytimg.com/vi/17lkdqoLt44/hqdefault.jpg", "provider_name": "YouTube", "author_url": "https://www.youtube.com/user/TheGapBandVEVO"}, "type": "youtube.com"}, "upvote_ratio": 0.81, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 42}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1u", "removal_reason": null, "link_id": "t3_65u072", "likes": null, "replies": "", "user_reports": [], "id": "dgd7lr8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DJ_Spam", "parent_id": "t3_65u072", "subreddit_name_prefixed": "r/Music", "controversiality": 0, "body": "**The Gap Band**  \n [artist pic](https://lastfm-img2.akamaized.net/i/u/252/70ca59434c9b495cb731eba50318e6bf.png)  \n\n&gt; The Gap Band was a funk and soul group, the three-piece being known for hits such as \"Outstanding\" and \"You Dropped a Bomb on Me\".Their first major hit was a snazzy rnb tune called \"Shake\". Just prior to the completion of their first major album, bringing them under the wing of Mercury, musician Charlie Wilson ran the song by his brothers Robert and Ronnie, thinking that they might ridicule the lyrics. His brothers loved it though, and the 1979 song ended up being a popular single in numerous clubs, elevating the three of them to national status. As parent album 'The Gap Band' rose up to the #10 slot on the top R&amp;B Albums chart, their critical praise proved that they had earned the spotlight.\n\n&gt; Born and raised in Tulsa, Oklahoma, the Wilson brothers began singing and playing in their father's Pentecostal church, and it was also mandatory they practice their music lessons at home as well. They learned various instruments, which primarily included lots of playing the piano. As much as they despised the lessons at the time, it proved to be a value tool for all three. With Ronnie being the oldest, he established his own band when he was just a fourteen-year-old.\n\n&gt; Charlie, a few years younger, joined a rival band a couple of years later. One particular night, the two bands were performing just across the street from one another. Ronnie stopped by to check out Charlie grooving on the organ. While there, Ronnie asked Charlie to join his band for $50 over what he was making. Though Charlie's band-mates doubled his offer, he joined his brother's band as fate would have it\n\n&gt; At a gig not too long after the two had joined forces, the group's bass player quit; Ronnie and Charlie summoned their younger brother Robert, barely fourteen himself, to the group to play bass. For a short while, the group performed without a name. Musician Carlton Morales, co-writer of Julian Lennon's pop hit \"Vallotte\" played with the band shortly after leaving the outfit The Mighty Majors.  Finally, the Wilson brothers began calling their outfit the \"Greenwood, Archer and Pine Streets Band\". As such a name proved too long for music posters, the band shortened their name to the \"G.A.P. Street Band\". Due to a typographical error, the group was actually advertised as \"Gap Band\" and \"The Gap Band\". That title stuck.\n\n&gt; They performed at various venues around the Tulsa area, including country &amp; western joints, tennis clubs, rock clubs, and wherever else called on their services. However, by the middle of the 70s, Charlie became interested in Los Angeles, California and left Tulsa to explore his possibilities; the country's big cities were in the middle of a soul music boom, and he wanted in.. A short time later, Charlie convinced his brothers to join him. The group floundered about L.A.; hitting and missing on record deals, gigs, and the like, the guys had a lot of talent but needed guidance. Still maintaining their interest in major label work, the group met entertainment businessman Lonnie Simmons through a friend, a musician D.J. Rogers, and their destiny was set. Simmons owned a nightclub called \"The Total Experience\" on Crenshaw Blvd and a recording studio at the time, and he signed the group to his company, which was called \"Total Experience Records\". Simmons would later start up a record label, also co-songwriting the Gap Band's tunes at times.\n\n&gt; The Top Five single \"Shake\" followed in 1979, along with \"Steppin' Out\" (number ten) and \"I Don't Believe You Want to Get Up and Dance (Oops, Up Side Your Head)\" (number four) in 1980. The latter was inspired at a concert in Pittsburgh where some kids were chanting the groove and the Gap Band picked up on it. In December of 1980, the trio dropped its first number one single with \"Burn Rubber (Why You Wanna Hurt Me)\" and followed it with the Top Five ballad \"Yearning for Your Love\" (1981). \n\n&gt; The group went on to score three more number one songs (\"Early in the Morning\" and \"Outstanding\" in 1982 and \"All of My Love\" in 1989), three more number two songs (\"You Dropped a Bomb on Me\" in 1982, \"Beep a Freak\" in 1984, and \"Going in Circles\" in 1986) and a horde of Top Ten hits. They also did the soundtracks for Leon Isaac Kennedy's Penitentiary III and Keena Ivory Waynans' I'm Gonna Get You Sucker. The group was given only 24 hours notice to complete the title song. \n\n&gt; In 1984 Ronnie became a born-again Christian and started pastoring. He joined Melba Moore and David Peaston in the touring play Mama, I'm Sorry.  Charlie went through rough times fighting a cocaine addiction until finally rehabilitating a few years later. Charlie has been one of most sought-after vocalists in the music industry. He has worked with Quincy Jones, Ray Charles, Eurythmics, Snoop Dogg, and scores of others. The Gap Band has recorded for various labels, including Mercury and Capitol Records. The group remained together for quite song time, enduring the good with the bad, and kept on touring into the new millennium.\n\n&gt; The death of Robert Wilson, at the age of 53, on August 15, 2010 changed everything. Mourned by fans of the group across the world, many musicians cited his role in creating the band's funky soul sound. Numerous singles such as \"Outstanding\" and \"You Dropped a Bomb on Me\" remain radio classics to this day. Read more on Last.fm.\n\n [last.fm](https://www.last.fm/music/The+Gap+Band): 278,902 listeners, 1,537,300 plays  \n tags: *funk, soul, Disco, 80s, rnb*  \n\n^^Please ^^downvote ^^if ^^incorrect!  ^^Self-deletes ^^if ^^score ^^is ^^0.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;The Gap Band&lt;/strong&gt;&lt;br/&gt;\n &lt;a href=\"https://lastfm-img2.akamaized.net/i/u/252/70ca59434c9b495cb731eba50318e6bf.png\"&gt;artist pic&lt;/a&gt;  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The Gap Band was a funk and soul group, the three-piece being known for hits such as &amp;quot;Outstanding&amp;quot; and &amp;quot;You Dropped a Bomb on Me&amp;quot;.Their first major hit was a snazzy rnb tune called &amp;quot;Shake&amp;quot;. Just prior to the completion of their first major album, bringing them under the wing of Mercury, musician Charlie Wilson ran the song by his brothers Robert and Ronnie, thinking that they might ridicule the lyrics. His brothers loved it though, and the 1979 song ended up being a popular single in numerous clubs, elevating the three of them to national status. As parent album &amp;#39;The Gap Band&amp;#39; rose up to the #10 slot on the top R&amp;amp;B Albums chart, their critical praise proved that they had earned the spotlight.&lt;/p&gt;\n\n&lt;p&gt;Born and raised in Tulsa, Oklahoma, the Wilson brothers began singing and playing in their father&amp;#39;s Pentecostal church, and it was also mandatory they practice their music lessons at home as well. They learned various instruments, which primarily included lots of playing the piano. As much as they despised the lessons at the time, it proved to be a value tool for all three. With Ronnie being the oldest, he established his own band when he was just a fourteen-year-old.&lt;/p&gt;\n\n&lt;p&gt;Charlie, a few years younger, joined a rival band a couple of years later. One particular night, the two bands were performing just across the street from one another. Ronnie stopped by to check out Charlie grooving on the organ. While there, Ronnie asked Charlie to join his band for $50 over what he was making. Though Charlie&amp;#39;s band-mates doubled his offer, he joined his brother&amp;#39;s band as fate would have it&lt;/p&gt;\n\n&lt;p&gt;At a gig not too long after the two had joined forces, the group&amp;#39;s bass player quit; Ronnie and Charlie summoned their younger brother Robert, barely fourteen himself, to the group to play bass. For a short while, the group performed without a name. Musician Carlton Morales, co-writer of Julian Lennon&amp;#39;s pop hit &amp;quot;Vallotte&amp;quot; played with the band shortly after leaving the outfit The Mighty Majors.  Finally, the Wilson brothers began calling their outfit the &amp;quot;Greenwood, Archer and Pine Streets Band&amp;quot;. As such a name proved too long for music posters, the band shortened their name to the &amp;quot;G.A.P. Street Band&amp;quot;. Due to a typographical error, the group was actually advertised as &amp;quot;Gap Band&amp;quot; and &amp;quot;The Gap Band&amp;quot;. That title stuck.&lt;/p&gt;\n\n&lt;p&gt;They performed at various venues around the Tulsa area, including country &amp;amp; western joints, tennis clubs, rock clubs, and wherever else called on their services. However, by the middle of the 70s, Charlie became interested in Los Angeles, California and left Tulsa to explore his possibilities; the country&amp;#39;s big cities were in the middle of a soul music boom, and he wanted in.. A short time later, Charlie convinced his brothers to join him. The group floundered about L.A.; hitting and missing on record deals, gigs, and the like, the guys had a lot of talent but needed guidance. Still maintaining their interest in major label work, the group met entertainment businessman Lonnie Simmons through a friend, a musician D.J. Rogers, and their destiny was set. Simmons owned a nightclub called &amp;quot;The Total Experience&amp;quot; on Crenshaw Blvd and a recording studio at the time, and he signed the group to his company, which was called &amp;quot;Total Experience Records&amp;quot;. Simmons would later start up a record label, also co-songwriting the Gap Band&amp;#39;s tunes at times.&lt;/p&gt;\n\n&lt;p&gt;The Top Five single &amp;quot;Shake&amp;quot; followed in 1979, along with &amp;quot;Steppin&amp;#39; Out&amp;quot; (number ten) and &amp;quot;I Don&amp;#39;t Believe You Want to Get Up and Dance (Oops, Up Side Your Head)&amp;quot; (number four) in 1980. The latter was inspired at a concert in Pittsburgh where some kids were chanting the groove and the Gap Band picked up on it. In December of 1980, the trio dropped its first number one single with &amp;quot;Burn Rubber (Why You Wanna Hurt Me)&amp;quot; and followed it with the Top Five ballad &amp;quot;Yearning for Your Love&amp;quot; (1981). &lt;/p&gt;\n\n&lt;p&gt;The group went on to score three more number one songs (&amp;quot;Early in the Morning&amp;quot; and &amp;quot;Outstanding&amp;quot; in 1982 and &amp;quot;All of My Love&amp;quot; in 1989), three more number two songs (&amp;quot;You Dropped a Bomb on Me&amp;quot; in 1982, &amp;quot;Beep a Freak&amp;quot; in 1984, and &amp;quot;Going in Circles&amp;quot; in 1986) and a horde of Top Ten hits. They also did the soundtracks for Leon Isaac Kennedy&amp;#39;s Penitentiary III and Keena Ivory Waynans&amp;#39; I&amp;#39;m Gonna Get You Sucker. The group was given only 24 hours notice to complete the title song. &lt;/p&gt;\n\n&lt;p&gt;In 1984 Ronnie became a born-again Christian and started pastoring. He joined Melba Moore and David Peaston in the touring play Mama, I&amp;#39;m Sorry.  Charlie went through rough times fighting a cocaine addiction until finally rehabilitating a few years later. Charlie has been one of most sought-after vocalists in the music industry. He has worked with Quincy Jones, Ray Charles, Eurythmics, Snoop Dogg, and scores of others. The Gap Band has recorded for various labels, including Mercury and Capitol Records. The group remained together for quite song time, enduring the good with the bad, and kept on touring into the new millennium.&lt;/p&gt;\n\n&lt;p&gt;The death of Robert Wilson, at the age of 53, on August 15, 2010 changed everything. Mourned by fans of the group across the world, many musicians cited his role in creating the band&amp;#39;s funky soul sound. Numerous singles such as &amp;quot;Outstanding&amp;quot; and &amp;quot;You Dropped a Bomb on Me&amp;quot; remain radio classics to this day. Read more on Last.fm.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.last.fm/music/The+Gap+Band\"&gt;last.fm&lt;/a&gt;: 278,902 listeners, 1,537,300 plays&lt;br/&gt;\n tags: &lt;em&gt;funk, soul, Disco, 80s, rnb&lt;/em&gt;  &lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;sup&gt;Please&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;downvote&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;if&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;incorrect!&lt;/sup&gt;&lt;/sup&gt;  &lt;sup&gt;&lt;sup&gt;Self-deletes&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;if&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;score&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;is&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;0.&lt;/sup&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Music", "name": "t1_dgd7lr8", "score_hidden": false, "stickied": false, "created": 1492439604.0, "created_utc": 1492410804.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]