[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "raspberry_pi", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello, I&amp;#39;m new on this community and I would like to learn more about Raspberry Pi. \nToday I was browsing on YouTube and I found this video on Orange Pi and I was amazed \nby the specs which are similar to Raspberry Pi. I want to know if someone has used both\nand what are the Pro and Cons of both. Thank you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello, I'm new on this community and I would like to learn more about Raspberry Pi. \nToday I was browsing on YouTube and I found this video on Orange Pi and I was amazed \nby the specs which are similar to Raspberry Pi. I want to know if someone has used both\nand what are the Pro and Cons of both. Thank you.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65qnjj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "ErosX6", "saved": false, "mod_reports": [], "name": "t3_65qnjj", "subreddit_name_prefixed": "r/raspberry_pi", "approved_by": null, "over_18": false, "domain": "self.raspberry_pi", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2syto", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/raspberry_pi/comments/65qnjj/orange_pi_vs_raspberry_pi/", "num_reports": null, "locked": false, "stickied": false, "created": 1492396875.0, "url": "https://www.reddit.com/r/raspberry_pi/comments/65qnjj/orange_pi_vs_raspberry_pi/", "author_flair_text": null, "quarantine": false, "title": "Orange Pi VS Raspberry Pi.", "created_utc": 1492368075.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2syto", "removal_reason": null, "link_id": "t3_65qnjj", "likes": null, "replies": "", "user_reports": [], "id": "dgcm21g", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "asker89", "parent_id": "t3_65qnjj", "subreddit_name_prefixed": "r/raspberry_pi", "controversiality": 0, "body": "The pros of the Orange Pi is that it's got better hardware power for the buck compared to the Raspberry Pi. Unfortunately the software support just isn't there relative to what's available for the Raspberry Pi - particularly on the graphics side. There is community support for the Orange Pi however it's not particularly well backed by their vendor, their ARM Mali GPUs not only lack a dedicated open source support effort but is also unlikely to develop any major projects as the previous attempt Lima driver was squashed ruthlessly by ARM holdings with blacklisting of the primary developer.  \n\nRaspberry Pi on the other hand has had more and more support with time. Their vendor Broadcom has gone so far as hiring a seasoned ex-Intel FOSS developer dedicated to writing an open source GPU driver with contracted embedded Linux engineering support. The Raspberry Pi Foundation also has dedicated hardware and software engineers as well as deep connections with both Broadcom and Cambridge University. The community for the Raspberry Pi has been maturing since commercial release 6 years ago and has also been in close collaboration with the Raspberry Pi Foundation. As a result there's a lot of custom hardware out there that's supported out of the box. The Foundation as well as Broadcom have been working on upstreaming the Raspberry Pi and so every year there is more and more mainstream Linux support. I'd go so far as to say that the Raspberry Pi is the face of single board computers right now and will likely continue to be for at least the next 3 years. This sort of publicity is a big deal, it makes it more likely to get supported by big software projects. \n\nI wish the Orange Pi or Odroid could compare but the support just isn't there. The software for these boards is getting better with time but it's nothing like the Raspberry Pi where it's almost certain that the software next year is going to be much better in performance and capability. For this reason I'd recommend the Raspberry Pi over any other single board computer especially for a beginner. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The pros of the Orange Pi is that it&amp;#39;s got better hardware power for the buck compared to the Raspberry Pi. Unfortunately the software support just isn&amp;#39;t there relative to what&amp;#39;s available for the Raspberry Pi - particularly on the graphics side. There is community support for the Orange Pi however it&amp;#39;s not particularly well backed by their vendor, their ARM Mali GPUs not only lack a dedicated open source support effort but is also unlikely to develop any major projects as the previous attempt Lima driver was squashed ruthlessly by ARM holdings with blacklisting of the primary developer.  &lt;/p&gt;\n\n&lt;p&gt;Raspberry Pi on the other hand has had more and more support with time. Their vendor Broadcom has gone so far as hiring a seasoned ex-Intel FOSS developer dedicated to writing an open source GPU driver with contracted embedded Linux engineering support. The Raspberry Pi Foundation also has dedicated hardware and software engineers as well as deep connections with both Broadcom and Cambridge University. The community for the Raspberry Pi has been maturing since commercial release 6 years ago and has also been in close collaboration with the Raspberry Pi Foundation. As a result there&amp;#39;s a lot of custom hardware out there that&amp;#39;s supported out of the box. The Foundation as well as Broadcom have been working on upstreaming the Raspberry Pi and so every year there is more and more mainstream Linux support. I&amp;#39;d go so far as to say that the Raspberry Pi is the face of single board computers right now and will likely continue to be for at least the next 3 years. This sort of publicity is a big deal, it makes it more likely to get supported by big software projects. &lt;/p&gt;\n\n&lt;p&gt;I wish the Orange Pi or Odroid could compare but the support just isn&amp;#39;t there. The software for these boards is getting better with time but it&amp;#39;s nothing like the Raspberry Pi where it&amp;#39;s almost certain that the software next year is going to be much better in performance and capability. For this reason I&amp;#39;d recommend the Raspberry Pi over any other single board computer especially for a beginner. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raspberry_pi", "name": "t1_dgcm21g", "score_hidden": false, "stickied": false, "created": 1492407288.0, "created_utc": 1492378488.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2syto", "removal_reason": null, "link_id": "t3_65qnjj", "likes": null, "replies": "", "user_reports": [], "id": "dgci6kv", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "piacco", "parent_id": "t3_65qnjj", "subreddit_name_prefixed": "r/raspberry_pi", "controversiality": 0, "body": "I have not worked with an orange pi myself, but from what I have found there is way more support for raspberry stuff. So if you are new I would recommend sticking with the raspberry stuff", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have not worked with an orange pi myself, but from what I have found there is way more support for raspberry stuff. So if you are new I would recommend sticking with the raspberry stuff&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raspberry_pi", "name": "t1_dgci6kv", "score_hidden": false, "stickied": false, "created": 1492402254.0, "created_utc": 1492373454.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2syto", "removal_reason": null, "link_id": "t3_65qnjj", "likes": null, "replies": "", "user_reports": [], "id": "dgdho4n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Fidgitt", "parent_id": "t3_65qnjj", "subreddit_name_prefixed": "r/raspberry_pi", "controversiality": 0, "body": "Definitely go for the raspberry if you're new to it. Some orange pis come with sata and better LAN, but as mentioned by others their support pales in comparison to the raspberry. You can find step by step guides for just about anything on the raspberry and while it won't be much different using an orange, it's definitely best to begin with a more active community ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely go for the raspberry if you&amp;#39;re new to it. Some orange pis come with sata and better LAN, but as mentioned by others their support pales in comparison to the raspberry. You can find step by step guides for just about anything on the raspberry and while it won&amp;#39;t be much different using an orange, it&amp;#39;s definitely best to begin with a more active community &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raspberry_pi", "name": "t1_dgdho4n", "score_hidden": false, "stickied": false, "created": 1492465440.0, "created_utc": 1492436640.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2syto", "removal_reason": null, "link_id": "t3_65qnjj", "likes": null, "replies": "", "user_reports": [], "id": "dgdzpau", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "The-Bent", "parent_id": "t3_65qnjj", "subreddit_name_prefixed": "r/raspberry_pi", "controversiality": 0, "body": "I have an orange pi zero. It is way better than a raspberry pi zero with the exception of community support. Right now my orange pi sits in a drawer because I couldn't find anything that told me which pin the video out was on and I used a pi zero for the project instead. One of the biggest reasons that the raspberry pi is popular is because it is so popular. They were the first to hit the market with a device targeted at beginners and hobbiests and it gained a ton of traction. The community has added a lot of libraries for different programming languages to simplify interacting with hardware through a language like python.  \n  \nIf you are just getting started then get a raspberry. If you are experienced and want a challenge or have a specific need look at the other fruits but be prepared to comb through poorly translated documents and basically doing a lot more book work to get any progress. You are trading time and ease of use for more power and features.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have an orange pi zero. It is way better than a raspberry pi zero with the exception of community support. Right now my orange pi sits in a drawer because I couldn&amp;#39;t find anything that told me which pin the video out was on and I used a pi zero for the project instead. One of the biggest reasons that the raspberry pi is popular is because it is so popular. They were the first to hit the market with a device targeted at beginners and hobbiests and it gained a ton of traction. The community has added a lot of libraries for different programming languages to simplify interacting with hardware through a language like python.  &lt;/p&gt;\n\n&lt;p&gt;If you are just getting started then get a raspberry. If you are experienced and want a challenge or have a specific need look at the other fruits but be prepared to comb through poorly translated documents and basically doing a lot more book work to get any progress. You are trading time and ease of use for more power and features.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "raspberry_pi", "name": "t1_dgdzpau", "score_hidden": false, "stickied": false, "created": 1492486651.0, "created_utc": 1492457851.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]