[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TwoXChromosomes", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I met somebody last year who I fell for. I fell hard. I think he felt the same. We talked constantly for months - messaging, facetime. We had something really intense. &lt;/p&gt;\n\n&lt;p&gt;I ended things and asked for no contact for a number of reasons - there&amp;#39;s a big age difference and it was always going to be an issue further down the line. I&amp;#39;m still studying. He also lives half the world away and no amount of messages could make up for that. &lt;/p&gt;\n\n&lt;p&gt;I know it was the right thing to do but it&amp;#39;s been a month now and I still struggle with this everyday. I think of messaging him all the time and I know that&amp;#39;s selfish of me. &lt;/p&gt;\n\n&lt;p&gt;Things could never easily work between us and I don&amp;#39;t want to cause either of us pain by coming back into his life when I know that. I love him.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m struggling a lot with standing by my decision. Rationally, I know I did the right thing for both of us. But he made me happy and I feel muted and broken without him.&lt;/p&gt;\n\n&lt;p&gt;It just feels so unbearably lonely when I walk past the places that we in together. I see him all around me - it&amp;#39;s like that Neruda poem - \n&amp;quot;everything carries me to you, \nas if everything that exists, \naromas, light, metals, \nwere little boats \nthat sail \ntoward those isles of yours that wait for me&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I know time heals all - but I&amp;#39;ve been trying so hard and it&amp;#39;s as if no time has passed and the way I feel is the same. I&amp;#39;ve been asked on dates since but I just don&amp;#39;t think it would be fair to rebound onto somebody. I&amp;#39;m really struggling. I guess I just needed to put my thoughts to paper.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I met somebody last year who I fell for. I fell hard. I think he felt the same. We talked constantly for months - messaging, facetime. We had something really intense. \n\nI ended things and asked for no contact for a number of reasons - there's a big age difference and it was always going to be an issue further down the line. I'm still studying. He also lives half the world away and no amount of messages could make up for that. \n\nI know it was the right thing to do but it's been a month now and I still struggle with this everyday. I think of messaging him all the time and I know that's selfish of me. \n\nThings could never easily work between us and I don't want to cause either of us pain by coming back into his life when I know that. I love him.\n\nI'm struggling a lot with standing by my decision. Rationally, I know I did the right thing for both of us. But he made me happy and I feel muted and broken without him.\n\nIt just feels so unbearably lonely when I walk past the places that we in together. I see him all around me - it's like that Neruda poem - \n\"everything carries me to you, \nas if everything that exists, \naromas, light, metals, \nwere little boats \nthat sail \ntoward those isles of yours that wait for me\"\n\nI know time heals all - but I've been trying so hard and it's as if no time has passed and the way I feel is the same. I've been asked on dates since but I just don't think it would be fair to rebound onto somebody. I'm really struggling. I guess I just needed to put my thoughts to paper.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64mp0d", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "anklefishes5", "saved": false, "mod_reports": [], "name": "t3_64mp0d", "subreddit_name_prefixed": "r/TwoXChromosomes", "approved_by": null, "over_18": false, "domain": "self.TwoXChromosomes", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r2jt", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TwoXChromosomes/comments/64mp0d/how_do_you_get_over_somebody_you_loved_but/", "num_reports": null, "locked": false, "stickied": false, "created": 1491890365.0, "url": "https://www.reddit.com/r/TwoXChromosomes/comments/64mp0d/how_do_you_get_over_somebody_you_loved_but/", "author_flair_text": null, "quarantine": false, "title": "How do you get over somebody you loved but couldn't be with because of circumstances?", "created_utc": 1491861565.0, "distinguished": null, "media": null, "upvote_ratio": 0.67, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64mp0d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64mp0d", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64mp0d", "likes": null, "replies": "", "user_reports": [], "id": "dg3qow0", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Hurras", "parent_id": "t1_dg3n92e", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I did, and I know that I could not have found him if the other hadn't happened first.\n\nOP, sending you much love and light and potential.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did, and I know that I could not have found him if the other hadn&amp;#39;t happened first.&lt;/p&gt;\n\n&lt;p&gt;OP, sending you much love and light and potential.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg3qow0", "score_hidden": false, "stickied": false, "created": 1491907717.0, "created_utc": 1491878917.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3n92e", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Myamaranth", "parent_id": "t1_dg3kcnm", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "That's beautiful. I hope you found a love like that again", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s beautiful. I hope you found a love like that again&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg3n92e", "score_hidden": false, "stickied": false, "created": 1491903564.0, "created_utc": 1491874764.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64mp0d", "likes": null, "replies": "", "user_reports": [], "id": "dg3r91w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "meat_tunnel", "parent_id": "t1_dg3kcnm", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg3r91w", "score_hidden": false, "stickied": false, "created": 1491908444.0, "created_utc": 1491879644.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3kcnm", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Hurras", "parent_id": "t3_64mp0d", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I had something similar happen.  We were both dating after divorce, and we lived across the country from one another.  Either of us moving would have meant a court battle and major upheaval for our kids, plus we came from very different families of origin which would have been difficult to integrate.\n\nStill, we were madly, madly in love and tried to make it work for a year or so.  He finally said that while he wanted it to work and loved me, that we wouldn't ever be able to get married and have a family together, and it was time to end our relationship.\n\nI was very sad and very resistant, and there were many late night phone calls that made it worse - I would cry and he would comfort me, which only reminded me more of why I cared about him.  Finally I said \"no more\" and set out to go on dates locally, and just put my feelings for him in a little box in my heart.  \n\nLooking back, it was just what I needed: someone who loved me madly and deeply and unconditionally, with passion and without restraint.  It made me remember what it was like to feel loved and to feel worthy of love.  \n\nThis was almost fifteen years ago, and writing this makes me a little wistful - and very grateful to him for his kindness and love.  I regret nothing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had something similar happen.  We were both dating after divorce, and we lived across the country from one another.  Either of us moving would have meant a court battle and major upheaval for our kids, plus we came from very different families of origin which would have been difficult to integrate.&lt;/p&gt;\n\n&lt;p&gt;Still, we were madly, madly in love and tried to make it work for a year or so.  He finally said that while he wanted it to work and loved me, that we wouldn&amp;#39;t ever be able to get married and have a family together, and it was time to end our relationship.&lt;/p&gt;\n\n&lt;p&gt;I was very sad and very resistant, and there were many late night phone calls that made it worse - I would cry and he would comfort me, which only reminded me more of why I cared about him.  Finally I said &amp;quot;no more&amp;quot; and set out to go on dates locally, and just put my feelings for him in a little box in my heart.  &lt;/p&gt;\n\n&lt;p&gt;Looking back, it was just what I needed: someone who loved me madly and deeply and unconditionally, with passion and without restraint.  It made me remember what it was like to feel loved and to feel worthy of love.  &lt;/p&gt;\n\n&lt;p&gt;This was almost fifteen years ago, and writing this makes me a little wistful - and very grateful to him for his kindness and love.  I regret nothing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg3kcnm", "score_hidden": false, "stickied": false, "created": 1491899911.0, "created_utc": 1491871111.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64mp0d", "likes": null, "replies": "", "user_reports": [], "id": "dg3e72f", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nightintheslammer", "parent_id": "t3_64mp0d", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "All your arguments for not contacting him seem reasonable and valid, so perhaps let getting back together with him be Plan B. Meanwhile, if you allow yourself to experiment a little, try dating again, but keep your expectations low. Just go on coffee dates where no one expects anything more than to meet up. I went through a bunch of coffee dates when I was single. I'm a male, by the way. And when I decided to just see what happens without any pressure on me, I found someone who stood out among the rest. This may work for you. Staying at home and pining is ineffective. If you mourn too long, that mindset becomes your default way of thinking, and it only brings hurt. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All your arguments for not contacting him seem reasonable and valid, so perhaps let getting back together with him be Plan B. Meanwhile, if you allow yourself to experiment a little, try dating again, but keep your expectations low. Just go on coffee dates where no one expects anything more than to meet up. I went through a bunch of coffee dates when I was single. I&amp;#39;m a male, by the way. And when I decided to just see what happens without any pressure on me, I found someone who stood out among the rest. This may work for you. Staying at home and pining is ineffective. If you mourn too long, that mindset becomes your default way of thinking, and it only brings hurt. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg3e72f", "score_hidden": false, "stickied": false, "created": 1491892025.0, "created_utc": 1491863225.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64mp0d", "likes": null, "replies": "", "user_reports": [], "id": "dg3vldi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "2ner1337", "parent_id": "t3_64mp0d", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I met a girl a long time ago. We clicked like it was an everyday occurrence. Like we had always been, for centuries. We had a brief relationship, But we couldn't be together. After that, We had contact off and on over the years. It always seemed to come back to her. It still does. We still speak, but my love for her has never died. I know deep down we are soul mates, which is why after a decade we can't let go of each other. Unfortunately we can't be together. Our paths have separated too far to be. However I can still keep her within reach. If it was meant to be it will  find a way. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I met a girl a long time ago. We clicked like it was an everyday occurrence. Like we had always been, for centuries. We had a brief relationship, But we couldn&amp;#39;t be together. After that, We had contact off and on over the years. It always seemed to come back to her. It still does. We still speak, but my love for her has never died. I know deep down we are soul mates, which is why after a decade we can&amp;#39;t let go of each other. Unfortunately we can&amp;#39;t be together. Our paths have separated too far to be. However I can still keep her within reach. If it was meant to be it will  find a way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg3vldi", "score_hidden": false, "stickied": false, "created": 1491915086.0, "created_utc": 1491886286.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64mp0d", "likes": null, "replies": "", "user_reports": [], "id": "dg410md", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fingeringabear", "parent_id": "t3_64mp0d", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "When I was 19 I met a man online who was five years older... we started as good friends but I knew that I was in love with him for months before I told him, luckily he loved me too.  We had a relationship until he gave me the ultimatum that I move to his city within a certain timeframe or we just remain friends.  I wanted to finish school where I was and he wanted me there... so we ended our relationship, much to my dismay.  Two months later he ended our friendship too.  I assume he either got bored of my friendship or it was too hard to deal with everything that was going on in his life at that point.  It took me forever to get over, at least a year before I felt emotionally healed enough to date again.  I obsessed over him for that whole year, I won't lie.  It was really hard to go from near constant contact with my best friend and my first love to literally nothing.  I'm married with a child now, six years after the end, and I still think about him frequently, wondering how he is doing.  It doesn't help that I now live in the same area he does.  I often wonder if I would recognize him or if he would recognize me if we saw each other in passing.  \n\nI know this isn't very helpful to you, OP.  I'm sorry. It can take a long time to heal from heartbreak.  I did find therapy to be helpful in getting over the obsession and depression part... maybe a therapist can help you work things out?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I was 19 I met a man online who was five years older... we started as good friends but I knew that I was in love with him for months before I told him, luckily he loved me too.  We had a relationship until he gave me the ultimatum that I move to his city within a certain timeframe or we just remain friends.  I wanted to finish school where I was and he wanted me there... so we ended our relationship, much to my dismay.  Two months later he ended our friendship too.  I assume he either got bored of my friendship or it was too hard to deal with everything that was going on in his life at that point.  It took me forever to get over, at least a year before I felt emotionally healed enough to date again.  I obsessed over him for that whole year, I won&amp;#39;t lie.  It was really hard to go from near constant contact with my best friend and my first love to literally nothing.  I&amp;#39;m married with a child now, six years after the end, and I still think about him frequently, wondering how he is doing.  It doesn&amp;#39;t help that I now live in the same area he does.  I often wonder if I would recognize him or if he would recognize me if we saw each other in passing.  &lt;/p&gt;\n\n&lt;p&gt;I know this isn&amp;#39;t very helpful to you, OP.  I&amp;#39;m sorry. It can take a long time to heal from heartbreak.  I did find therapy to be helpful in getting over the obsession and depression part... maybe a therapist can help you work things out?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg410md", "score_hidden": false, "stickied": false, "created": 1491928054.0, "created_utc": 1491899254.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64mp0d", "likes": null, "replies": "", "user_reports": [], "id": "dg3rhhs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "goingindry127", "parent_id": "t3_64mp0d", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I had a long distance love. We started seeing each other right before he moved over seas and it was passion like I'd never experienced. We kept in touch but I had to eventually ask for space due to the fact that it was hard to move on. I put myself out there, did the tinder thing, slept around a bit. Some people made me miss him more, one helped me move on in a way I didn't think was possible. Friends listening to me talk about my ex incessantly helped. Going on trips or little hikes with girlfriends helped. Getting drunk and crying and writing terrible poetry really helped. Being patient helped. It's difficult but put away anything that reminds you of him. Don't entertain too many thoughts of him for the time being. Eventually you get to a place where it feels like some sweet dream you just woke up from. I cherish the memory now because I know what that kind of passion and love feels like. I know it's possible with others. Patience (not forcing progress or being judgemental of the time it's taking to move on) and self love and reaching out. Those are what helped me and I hope this helps you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a long distance love. We started seeing each other right before he moved over seas and it was passion like I&amp;#39;d never experienced. We kept in touch but I had to eventually ask for space due to the fact that it was hard to move on. I put myself out there, did the tinder thing, slept around a bit. Some people made me miss him more, one helped me move on in a way I didn&amp;#39;t think was possible. Friends listening to me talk about my ex incessantly helped. Going on trips or little hikes with girlfriends helped. Getting drunk and crying and writing terrible poetry really helped. Being patient helped. It&amp;#39;s difficult but put away anything that reminds you of him. Don&amp;#39;t entertain too many thoughts of him for the time being. Eventually you get to a place where it feels like some sweet dream you just woke up from. I cherish the memory now because I know what that kind of passion and love feels like. I know it&amp;#39;s possible with others. Patience (not forcing progress or being judgemental of the time it&amp;#39;s taking to move on) and self love and reaching out. Those are what helped me and I hope this helps you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg3rhhs", "score_hidden": false, "stickied": false, "created": 1491908767.0, "created_utc": 1491879967.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64mp0d", "likes": null, "replies": "", "user_reports": [], "id": "dg3tcw9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Candelent", "parent_id": "t3_64mp0d", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I think you made a wise decision. I had to do the same recently and I'm really sad about it. But no contact is the best way for both of you to move on. \n\nI think it is okay to date again sooner rather than later. Just let the other party know that you are not looking for anything serious at the moment. And date multiple people to avoid getting too attached to any one person as a rebound. Just go have fun with that for awhile. It will help. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you made a wise decision. I had to do the same recently and I&amp;#39;m really sad about it. But no contact is the best way for both of you to move on. &lt;/p&gt;\n\n&lt;p&gt;I think it is okay to date again sooner rather than later. Just let the other party know that you are not looking for anything serious at the moment. And date multiple people to avoid getting too attached to any one person as a rebound. Just go have fun with that for awhile. It will help. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg3tcw9", "score_hidden": false, "stickied": false, "created": 1491911411.0, "created_utc": 1491882611.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64mp0d", "likes": null, "replies": "", "user_reports": [], "id": "dg43cnj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gracepark", "parent_id": "t3_64mp0d", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "You're mostly there... Time heals all for sure but that doesn't mean you won't feel things when you look backwards.  Likely there were things about that relationship that were awesome, so finding ways to get those things in the future will help stop you from looking backwards in time.\n\nHonestly, this kind of healing can take a while. Be patient. Look forward and to the present, and fill your days with things that stop you from looking back.  Soon, it'll be a fond, rather than a painful thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re mostly there... Time heals all for sure but that doesn&amp;#39;t mean you won&amp;#39;t feel things when you look backwards.  Likely there were things about that relationship that were awesome, so finding ways to get those things in the future will help stop you from looking backwards in time.&lt;/p&gt;\n\n&lt;p&gt;Honestly, this kind of healing can take a while. Be patient. Look forward and to the present, and fill your days with things that stop you from looking back.  Soon, it&amp;#39;ll be a fond, rather than a painful thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg43cnj", "score_hidden": false, "stickied": false, "created": 1491935330.0, "created_utc": 1491906530.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]