[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TwoXChromosomes", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I dont know how to take the steps necessary in order to fix myself. I was diagnosed bipolar, with anxiety, and depression. Ive fallen into a deeper depression because I am so lost. Ive gotten to the point were I hate myself because I ruin everything. My relationship is really suffering. And I cant do this to him anymore. Hes been dealing with this for too long. I want to do this for not only me but for him. Im on medication but it doesnt seem to work. I dont want to be so negative. I dont even know who I am anymore. Ive honestly become such a hermit and ive lost majority of my friends. I need motivation and advice on how to deal with this. I want to be better and id love to hear from anyone how theyve overcome this and what theyve done to help themselves. And how they found happiness and what they do to keep themselves from acting out. Any advice is appreciated :) &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I dont know how to take the steps necessary in order to fix myself. I was diagnosed bipolar, with anxiety, and depression. Ive fallen into a deeper depression because I am so lost. Ive gotten to the point were I hate myself because I ruin everything. My relationship is really suffering. And I cant do this to him anymore. Hes been dealing with this for too long. I want to do this for not only me but for him. Im on medication but it doesnt seem to work. I dont want to be so negative. I dont even know who I am anymore. Ive honestly become such a hermit and ive lost majority of my friends. I need motivation and advice on how to deal with this. I want to be better and id love to hear from anyone how theyve overcome this and what theyve done to help themselves. And how they found happiness and what they do to keep themselves from acting out. Any advice is appreciated :) ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Support", "id": "64suxq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "imnotarobot1269", "saved": false, "mod_reports": [], "name": "t3_64suxq", "subreddit_name_prefixed": "r/TwoXChromosomes", "approved_by": null, "over_18": false, "domain": "self.TwoXChromosomes", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r2jt", "edited": false, "link_flair_css_class": "support", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TwoXChromosomes/comments/64suxq/i_need_advice_on_how_to_deal_with_my_mental/", "num_reports": null, "locked": false, "stickied": false, "created": 1491965559.0, "url": "https://www.reddit.com/r/TwoXChromosomes/comments/64suxq/i_need_advice_on_how_to_deal_with_my_mental/", "author_flair_text": null, "quarantine": false, "title": "I need advice on how to deal with my mental illnesses..", "created_utc": 1491936759.0, "distinguished": null, "media": null, "upvote_ratio": 0.68, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": "", "user_reports": [], "id": "dg4qm55", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "thyhaj", "parent_id": "t3_64suxq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Ah, it was a journey and I'm certainly not 100% but I would say I'm way better. \nAlong with medication and therapy, I also fixed my finances which were the basis of my stress and anxiety. I focused all of my energy on myself. I realize that you have a partner and you want to do this for him but ultimately you need to get better in order to have a better relationship with him- this requires some selfish actions on your end. Remove every toxic and negative person in your life. If you don't want to do something, don't. \nI started exercising and reading more. Stimulating my mind. I made sure that I was 100% every time I was at work. Doing well at work provided me with some happiness. \n\nMy psychiatrist tried different drugs and combinations and I feel like I'm almost to my perfect dosage. Practicing everything my therapist recommended. It takes a lot of hard work but change is difficult. I hope you get better. Stay strong and take it one day at a time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah, it was a journey and I&amp;#39;m certainly not 100% but I would say I&amp;#39;m way better. \nAlong with medication and therapy, I also fixed my finances which were the basis of my stress and anxiety. I focused all of my energy on myself. I realize that you have a partner and you want to do this for him but ultimately you need to get better in order to have a better relationship with him- this requires some selfish actions on your end. Remove every toxic and negative person in your life. If you don&amp;#39;t want to do something, don&amp;#39;t. \nI started exercising and reading more. Stimulating my mind. I made sure that I was 100% every time I was at work. Doing well at work provided me with some happiness. &lt;/p&gt;\n\n&lt;p&gt;My psychiatrist tried different drugs and combinations and I feel like I&amp;#39;m almost to my perfect dosage. Practicing everything my therapist recommended. It takes a lot of hard work but change is difficult. I hope you get better. Stay strong and take it one day at a time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg4qm55", "score_hidden": false, "stickied": false, "created": 1491966211.0, "created_utc": 1491937411.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": "", "user_reports": [], "id": "dg4sm41", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rosebunse", "parent_id": "t1_dg4rrjh", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I find that TV can help me, though normally just a good documentary or a cartoon does the trick. Social media is definitely one of the worst things you can do when you're upset because it makes you compare yourself to everyone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I find that TV can help me, though normally just a good documentary or a cartoon does the trick. Social media is definitely one of the worst things you can do when you&amp;#39;re upset because it makes you compare yourself to everyone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg4sm41", "score_hidden": false, "stickied": false, "created": 1491968348.0, "created_utc": 1491939548.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4rrjh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Bearcat_6", "parent_id": "t3_64suxq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I agree with the previous comment. I've had to work on not being anxious and depressed also, and have most likely taken it out on my friends and partners at times. Doing things that feel selfish like setting boundaries and cutting out toxic people has been really helpful to my mental health and to the relationship I'm in. It's hard, but worth it. Reading and exercising &gt; social media and TV. Try to avoid social media or limit your use of it while you get better.  I've noticed also that sugary and prepackaged foods make me feel more lethargic, foggy headed, and depressive, so I try to limit them and choose fruits, veggies, eggs, potatoes, legumes, homemade bread, etc. Medication is a tough thing to work out because sometimes the side effects can seem worse than the symptoms. Make sure you have a doctor who listens to you, and if you don't, seek out someone else if you can. When I'm having a bad day or just feel bummed out, I have to look at my partner, take a deep breath, and remind myself that if I vent and complain a lot, he's going to wind up feeling horrible too, and that my complaining will draw me deeper into my own negative thought loop with the added layer of guilt because I treated him badly and took my depression out on him. If I feel bad, I ask myself how much venting about it will improve the situation and if it won't, sometimes I keep it to myself and consciously refocus my energy. A long run or a good book is usually key. Anything that directs your focus to the present moment rather than the past you're ruminating over or the future you're worrying about. Good luck with everything. It can get better, I promise", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with the previous comment. I&amp;#39;ve had to work on not being anxious and depressed also, and have most likely taken it out on my friends and partners at times. Doing things that feel selfish like setting boundaries and cutting out toxic people has been really helpful to my mental health and to the relationship I&amp;#39;m in. It&amp;#39;s hard, but worth it. Reading and exercising &amp;gt; social media and TV. Try to avoid social media or limit your use of it while you get better.  I&amp;#39;ve noticed also that sugary and prepackaged foods make me feel more lethargic, foggy headed, and depressive, so I try to limit them and choose fruits, veggies, eggs, potatoes, legumes, homemade bread, etc. Medication is a tough thing to work out because sometimes the side effects can seem worse than the symptoms. Make sure you have a doctor who listens to you, and if you don&amp;#39;t, seek out someone else if you can. When I&amp;#39;m having a bad day or just feel bummed out, I have to look at my partner, take a deep breath, and remind myself that if I vent and complain a lot, he&amp;#39;s going to wind up feeling horrible too, and that my complaining will draw me deeper into my own negative thought loop with the added layer of guilt because I treated him badly and took my depression out on him. If I feel bad, I ask myself how much venting about it will improve the situation and if it won&amp;#39;t, sometimes I keep it to myself and consciously refocus my energy. A long run or a good book is usually key. Anything that directs your focus to the present moment rather than the past you&amp;#39;re ruminating over or the future you&amp;#39;re worrying about. Good luck with everything. It can get better, I promise&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg4rrjh", "score_hidden": false, "stickied": false, "created": 1491967431.0, "created_utc": 1491938631.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": "", "user_reports": [], "id": "dg690vx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kupo_moogle", "parent_id": "t3_64suxq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I was diagnosed with anxiety at 23, depression at 25 and they were both really bad for 4-5 years. However with proper medication I've made a 99% recovery. Treat it like an illness (It is!) and see a doctor", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was diagnosed with anxiety at 23, depression at 25 and they were both really bad for 4-5 years. However with proper medication I&amp;#39;ve made a 99% recovery. Treat it like an illness (It is!) and see a doctor&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg690vx", "score_hidden": false, "stickied": false, "created": 1492048341.0, "created_utc": 1492019541.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": "", "user_reports": [], "id": "dg6m9yz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "funchy", "parent_id": "t3_64suxq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "The answer is pretty straightforward.  Go to the psychiatrist to get medication adjusted.   Go to therapist regularly to get counseling.   Tell your psychiatrist and therapist about your feelings and difficulties.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The answer is pretty straightforward.  Go to the psychiatrist to get medication adjusted.   Go to therapist regularly to get counseling.   Tell your psychiatrist and therapist about your feelings and difficulties.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6m9yz", "score_hidden": false, "stickied": false, "created": 1492062346.0, "created_utc": 1492033546.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": "", "user_reports": [], "id": "dg4styp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rosebunse", "parent_id": "t3_64suxq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "*It's going to be OK*\n\nI say this as a matter of survival. This wave of depression will pass, and then it'll be OK. And then, sooner or latter, another wave of depression will hit but you know what? You'll be OK. \n\nI'm going through a bit of an episode right now myself. It feels like I'm so toxic and wrong, but I keep making excuses for myself. I know people say that you shouldn't make excuses, but honestly, sometimes you have to because if you don't, you're just going to wallow in self-pity. \n\nI know this wave of depression will end and that I'll feel something better, and I refuse to let it totally take over my life. Why? Spite and the will to prove other people wrong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;It&amp;#39;s going to be OK&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I say this as a matter of survival. This wave of depression will pass, and then it&amp;#39;ll be OK. And then, sooner or latter, another wave of depression will hit but you know what? You&amp;#39;ll be OK. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going through a bit of an episode right now myself. It feels like I&amp;#39;m so toxic and wrong, but I keep making excuses for myself. I know people say that you shouldn&amp;#39;t make excuses, but honestly, sometimes you have to because if you don&amp;#39;t, you&amp;#39;re just going to wallow in self-pity. &lt;/p&gt;\n\n&lt;p&gt;I know this wave of depression will end and that I&amp;#39;ll feel something better, and I refuse to let it totally take over my life. Why? Spite and the will to prove other people wrong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg4styp", "score_hidden": false, "stickied": false, "created": 1491968586.0, "created_utc": 1491939786.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": "", "user_reports": [], "id": "dg4ukrx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "biggems89", "parent_id": "t3_64suxq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I suffer from PTSD myself and have been diagnosed with Anxiety and Depression as well. I refuse to go to stores such as Walmart, Target, the mall, etc. It's frustrating because I can't even take my 2 year old Daughter to the park. I don't feel safe to take her in the event something happens to her. This has affected my relationship and finances don't help with the situation either. Luckily I work from home or else I would be in even more trouble. I have lost all of my friends and my days are ridiculously repetitive. I have picked up reading recently and it's my escape to another world. Reading really helps with literally everything. I also take medication which helps as well and if I don't take it, I am a wreck. The VA has been helpful, but I don't feel that it's enough. \n\nJust know this. You are not alone. There are people like you and me struggling everyday, but it's what you do to help yourself matters. I have learned that I need to do this for my family and for myself. How can I take care of my daughter if I can't take care of myself first. Keep on fighting my friend. It will get better. If you ever need anything message me, I am here for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I suffer from PTSD myself and have been diagnosed with Anxiety and Depression as well. I refuse to go to stores such as Walmart, Target, the mall, etc. It&amp;#39;s frustrating because I can&amp;#39;t even take my 2 year old Daughter to the park. I don&amp;#39;t feel safe to take her in the event something happens to her. This has affected my relationship and finances don&amp;#39;t help with the situation either. Luckily I work from home or else I would be in even more trouble. I have lost all of my friends and my days are ridiculously repetitive. I have picked up reading recently and it&amp;#39;s my escape to another world. Reading really helps with literally everything. I also take medication which helps as well and if I don&amp;#39;t take it, I am a wreck. The VA has been helpful, but I don&amp;#39;t feel that it&amp;#39;s enough. &lt;/p&gt;\n\n&lt;p&gt;Just know this. You are not alone. There are people like you and me struggling everyday, but it&amp;#39;s what you do to help yourself matters. I have learned that I need to do this for my family and for myself. How can I take care of my daughter if I can&amp;#39;t take care of myself first. Keep on fighting my friend. It will get better. If you ever need anything message me, I am here for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg4ukrx", "score_hidden": false, "stickied": false, "created": 1491970497.0, "created_utc": 1491941697.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": "", "user_reports": [], "id": "dg4v75l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sillytricks123", "parent_id": "t3_64suxq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I know exactly how you feel I'm doing the same thing in my relationships with family friends.\nI'm borderline personality , anxiety disorder PTSD major depression and also a drug addict on top of that . it's the only thing keeping me stable, is using   Just to get by in life  I've lost myself I HATE myself don't know who I am. I have been ruining my relationship with my boyfriend who's probably gonna leave me.in a lot always I want him too so he won't deal with me anymore I can't even deal with myself.  My meds  don't do shit  .          You're not alone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know exactly how you feel I&amp;#39;m doing the same thing in my relationships with family friends.\nI&amp;#39;m borderline personality , anxiety disorder PTSD major depression and also a drug addict on top of that . it&amp;#39;s the only thing keeping me stable, is using   Just to get by in life  I&amp;#39;ve lost myself I HATE myself don&amp;#39;t know who I am. I have been ruining my relationship with my boyfriend who&amp;#39;s probably gonna leave me.in a lot always I want him too so he won&amp;#39;t deal with me anymore I can&amp;#39;t even deal with myself.  My meds  don&amp;#39;t do shit  .          You&amp;#39;re not alone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg4v75l", "score_hidden": false, "stickied": false, "created": 1491971190.0, "created_utc": 1491942390.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": "", "user_reports": [], "id": "dg4vzss", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "or10r", "parent_id": "t3_64suxq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Don't give up! In spite of how you feel and the desire to isolate, push forward for your own recovery. If your meds aren't working then have the Drs change them. Exercise when you can. Its a natural combatant of depression. Keep yourself and your mind busy. Do some volunteer work.  Be tenacious about yourself. It may take some work with a Dr to get the right meds and dosage but you are worth it! All the best to you in your journey. You CAN do this! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t give up! In spite of how you feel and the desire to isolate, push forward for your own recovery. If your meds aren&amp;#39;t working then have the Drs change them. Exercise when you can. Its a natural combatant of depression. Keep yourself and your mind busy. Do some volunteer work.  Be tenacious about yourself. It may take some work with a Dr to get the right meds and dosage but you are worth it! All the best to you in your journey. You CAN do this! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg4vzss", "score_hidden": false, "stickied": false, "created": 1491972085.0, "created_utc": 1491943285.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": "", "user_reports": [], "id": "dg4wgvu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "octohussy", "parent_id": "t3_64suxq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This isn't necessarily the right step for you, but I found being single allowed me to focus 100% of my time on dealing with fixing my own head. As a fellow hermit due to mental health issues, please know you're not alone. It's all about taking baby steps forward with mental health issues. I've been chipping away at my issues, slowly but surely, and have went from totally housebound to volunteering once a week. A good place to start is going LC with anyone whose exacerbating your symptoms and formulating some small goals to reach over the next couple of months. Hope things get better!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t necessarily the right step for you, but I found being single allowed me to focus 100% of my time on dealing with fixing my own head. As a fellow hermit due to mental health issues, please know you&amp;#39;re not alone. It&amp;#39;s all about taking baby steps forward with mental health issues. I&amp;#39;ve been chipping away at my issues, slowly but surely, and have went from totally housebound to volunteering once a week. A good place to start is going LC with anyone whose exacerbating your symptoms and formulating some small goals to reach over the next couple of months. Hope things get better!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg4wgvu", "score_hidden": false, "stickied": false, "created": 1491972613.0, "created_utc": 1491943813.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": "", "user_reports": [], "id": "dg54jom", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg51s2o", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "but isn't comparison the main problem that needs to be solved in the first place. Why strengthen the groove your mind has fallen into instead of tackling the original problem of internal conflict that society breeds into man . Its not a new problem , this has been going on for thousands of years since the dawn on humanity. I refuse to accept that human being is forever doomed to live in constant internal( and external) conflict. Everyone from a poor uneducated person in a remote country to billionaire in America suffers from this . Sorrow is not personal its human. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;but isn&amp;#39;t comparison the main problem that needs to be solved in the first place. Why strengthen the groove your mind has fallen into instead of tackling the original problem of internal conflict that society breeds into man . Its not a new problem , this has been going on for thousands of years since the dawn on humanity. I refuse to accept that human being is forever doomed to live in constant internal( and external) conflict. Everyone from a poor uneducated person in a remote country to billionaire in America suffers from this . Sorrow is not personal its human. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg54jom", "score_hidden": false, "stickied": false, "created": 1491982801.0, "created_utc": 1491954001.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg51s2o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bsci4", "parent_id": "t1_dg51jm2", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I think that's the idea. Also, in terms of comparing yourself to others, usually people place themselves in the lesser position relative to the other. A pretty effective method, as silly as it's going to sound, is comparing yourself to others but thinking you're better than them. Because the person is so often feeling worse relative to others, it's not going to flip them into a narcissistic person but rather it tends to balance them out in a more healthy way than thinking everyone is better than you at everything.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that&amp;#39;s the idea. Also, in terms of comparing yourself to others, usually people place themselves in the lesser position relative to the other. A pretty effective method, as silly as it&amp;#39;s going to sound, is comparing yourself to others but thinking you&amp;#39;re better than them. Because the person is so often feeling worse relative to others, it&amp;#39;s not going to flip them into a narcissistic person but rather it tends to balance them out in a more healthy way than thinking everyone is better than you at everything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg51s2o", "score_hidden": false, "stickied": false, "created": 1491979106.0, "created_utc": 1491950306.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg51jm2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg4x6es", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Interesting approach. I always thought that the idea of 'self' is at the root of all physiological issues, eg: *I am* less talented than someone else, *I am* a failure in life ect.  Unfortunately, we have been bought up in a society that is ambitious, where self is everything.\n\nWe always find so much fun and comfort in activities in which self is not involved, i.e it doesn't profit you in some way. Like a deep hobby in which you get lost, flow state.  \n\nWouldn't the approach you suggested strengthen the idea of self though. 'compliment yourself' sounds a little awkward to me, who is this other entity that is complimenting 'you' isn't that also 'you'?  Identifying yourself with a noble entity that is chiding the undesirable 'you' would create more internal conflict . right? \n\n Just thinking out loud. ", "edited": 1491950290.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting approach. I always thought that the idea of &amp;#39;self&amp;#39; is at the root of all physiological issues, eg: &lt;em&gt;I am&lt;/em&gt; less talented than someone else, &lt;em&gt;I am&lt;/em&gt; a failure in life ect.  Unfortunately, we have been bought up in a society that is ambitious, where self is everything.&lt;/p&gt;\n\n&lt;p&gt;We always find so much fun and comfort in activities in which self is not involved, i.e it doesn&amp;#39;t profit you in some way. Like a deep hobby in which you get lost, flow state.  &lt;/p&gt;\n\n&lt;p&gt;Wouldn&amp;#39;t the approach you suggested strengthen the idea of self though. &amp;#39;compliment yourself&amp;#39; sounds a little awkward to me, who is this other entity that is complimenting &amp;#39;you&amp;#39; isn&amp;#39;t that also &amp;#39;you&amp;#39;?  Identifying yourself with a noble entity that is chiding the undesirable &amp;#39;you&amp;#39; would create more internal conflict . right? &lt;/p&gt;\n\n&lt;p&gt;Just thinking out loud. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg51jm2", "score_hidden": false, "stickied": false, "created": 1491978804.0, "created_utc": 1491950004.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4x6es", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bsci4", "parent_id": "t3_64suxq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I'll just give you one piece of advice. I was in an inpatient facility for anxiety and depression for a few months and the one central theme to a lot of their approach/treatment was how you speak to yourself in your own mind. It was literally giving yourself positive affirmations, which means telling yourself something nice about yourself in your head. The second component is when you catch yourself thinking something negative about yourself you're supposed to stop it and think of the reverse and compliment yourself. It doesn't matter whether you believe it or not, which was also a key part of it. Good luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll just give you one piece of advice. I was in an inpatient facility for anxiety and depression for a few months and the one central theme to a lot of their approach/treatment was how you speak to yourself in your own mind. It was literally giving yourself positive affirmations, which means telling yourself something nice about yourself in your head. The second component is when you catch yourself thinking something negative about yourself you&amp;#39;re supposed to stop it and think of the reverse and compliment yourself. It doesn&amp;#39;t matter whether you believe it or not, which was also a key part of it. Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg4x6es", "score_hidden": false, "stickied": false, "created": 1491973431.0, "created_utc": 1491944631.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": "", "user_reports": [], "id": "dg50pro", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sided_Truer", "parent_id": "t3_64suxq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Well I know people will probably ignore the [link](https://gfycat.com/SplendidCalculatingCattle), but I hope you might spend some time reading through the success stories.  As a small background tip, my wife of 19 years had been taking various medicines for large portions of our time together since we started dating in 1995.  To include welbutrin, trileptal, celexa, cymbalta, effexor, lexapro, norpramin, paxil, pristiq, zoloft, etc.  \n\nThen in 2014, we made changes in our lifestyle that have resulted in no need for the medicines that helped her with the crippling waves of depression and anxiety that used to come over her.\n\nGood luck with your struggle.  I wish you the best.  BTW that link is sorted by depression &amp; mental health, but there are lots of categories including autoimmune disease, fertility, thyroid problems, etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I know people will probably ignore the &lt;a href=\"https://gfycat.com/SplendidCalculatingCattle\"&gt;link&lt;/a&gt;, but I hope you might spend some time reading through the success stories.  As a small background tip, my wife of 19 years had been taking various medicines for large portions of our time together since we started dating in 1995.  To include welbutrin, trileptal, celexa, cymbalta, effexor, lexapro, norpramin, paxil, pristiq, zoloft, etc.  &lt;/p&gt;\n\n&lt;p&gt;Then in 2014, we made changes in our lifestyle that have resulted in no need for the medicines that helped her with the crippling waves of depression and anxiety that used to come over her.&lt;/p&gt;\n\n&lt;p&gt;Good luck with your struggle.  I wish you the best.  BTW that link is sorted by depression &amp;amp; mental health, but there are lots of categories including autoimmune disease, fertility, thyroid problems, etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg50pro", "score_hidden": false, "stickied": false, "created": 1491977753.0, "created_utc": 1491948953.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_64suxq", "likes": null, "replies": "", "user_reports": [], "id": "dgbskjj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "reddishrobin", "parent_id": "t3_64suxq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "keep a mood chart so your doctor can see that the medication is not working. ask for the medication to be changed.  this is the illness talking", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;keep a mood chart so your doctor can see that the medication is not working. ask for the medication to be changed.  this is the illness talking&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgbskjj", "score_hidden": false, "stickied": false, "created": 1492354133.0, "created_utc": 1492325333.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]