[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TwoXChromosomes", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have had the same best friend for 20 years now, henceforth known as Friend A. She had been planning a trip to France with her husband and said she wanted to go September 20-29th. Cool, I&amp;#39;m really happy for her because I know she&amp;#39;s wanted to go for some time. Another friend texted me a couple of days ago and said Hopper had sent her a notification for $450 round trip flights to France for 9/25-10/9 and that if I wanted to go with her, she&amp;#39;d spring for the tickets. Awesome, I&amp;#39;m not going to turn that down. She posted about it on Facebook, tagging me and including the dates we were going. Friend A saw this and sent me a string of nasty text messages that started out &amp;quot;OMG some of our dates overlap.&amp;quot; I didn&amp;#39;t see the texts immediately and she sent more &amp;quot;This cheapens the excitement of my trip&amp;quot; and &amp;quot;I can&amp;#39;t believe my luck.&amp;quot; I replied that she had every right to be excited, that I understood the premise of her trip was to spend time with her husband and that I wasn&amp;#39;t going to try to hang out with them on the trip. She responded that she was really angry about it and that she couldn&amp;#39;t talk to me and that she hopes I have a &amp;quot;Fucking amazing time.&amp;quot; I did not engage that and several hours later she messaged me stating she wasn&amp;#39;t sure what came over her and she was sorry for her outburst and said she hoped I would forgive her. I said &amp;quot;Of course!&amp;quot; She didn&amp;#39;t speak to me for a day and a half which is very rare and just now messaged me that she booked her tickets, but that she changed the dates so we wouldn&amp;#39;t be there at the same time. I&amp;#39;m kind of at a loss for words. I don&amp;#39;t understand how me being in the same country at all effects her. Was I supposed to turn down a free plane ticket because she was going to be there, too? I haven&amp;#39;t responded yet, but I was thinking about saying &amp;quot;I&amp;#39;m really excited for you, you&amp;#39;re going to have a great time. It makes me a little sad that me being in the same country as you makes your experience worse.&amp;quot; Thoughts? Normally I would try not to engage, but in my opinion she&amp;#39;s so out of line that I feel it is merited.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have had the same best friend for 20 years now, henceforth known as Friend A. She had been planning a trip to France with her husband and said she wanted to go September 20-29th. Cool, I'm really happy for her because I know she's wanted to go for some time. Another friend texted me a couple of days ago and said Hopper had sent her a notification for $450 round trip flights to France for 9/25-10/9 and that if I wanted to go with her, she'd spring for the tickets. Awesome, I'm not going to turn that down. She posted about it on Facebook, tagging me and including the dates we were going. Friend A saw this and sent me a string of nasty text messages that started out \"OMG some of our dates overlap.\" I didn't see the texts immediately and she sent more \"This cheapens the excitement of my trip\" and \"I can't believe my luck.\" I replied that she had every right to be excited, that I understood the premise of her trip was to spend time with her husband and that I wasn't going to try to hang out with them on the trip. She responded that she was really angry about it and that she couldn't talk to me and that she hopes I have a \"Fucking amazing time.\" I did not engage that and several hours later she messaged me stating she wasn't sure what came over her and she was sorry for her outburst and said she hoped I would forgive her. I said \"Of course!\" She didn't speak to me for a day and a half which is very rare and just now messaged me that she booked her tickets, but that she changed the dates so we wouldn't be there at the same time. I'm kind of at a loss for words. I don't understand how me being in the same country at all effects her. Was I supposed to turn down a free plane ticket because she was going to be there, too? I haven't responded yet, but I was thinking about saying \"I'm really excited for you, you're going to have a great time. It makes me a little sad that me being in the same country as you makes your experience worse.\" Thoughts? Normally I would try not to engage, but in my opinion she's so out of line that I feel it is merited.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "650az9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "TriSarahTops47", "saved": false, "mod_reports": [], "name": "t3_650az9", "subreddit_name_prefixed": "r/TwoXChromosomes", "approved_by": null, "over_18": false, "domain": "self.TwoXChromosomes", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r2jt", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TwoXChromosomes/comments/650az9/my_best_friend_of_20_years_kind_of_went_crazyhow/", "num_reports": null, "locked": false, "stickied": false, "created": 1492053311.0, "url": "https://www.reddit.com/r/TwoXChromosomes/comments/650az9/my_best_friend_of_20_years_kind_of_went_crazyhow/", "author_flair_text": null, "quarantine": false, "title": "My Best Friend of 20 Years Kind of Went Crazy--How do I respond?", "created_utc": 1492024511.0, "distinguished": null, "media": null, "upvote_ratio": 0.66, "num_comments": 37, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6f4hm", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "RedShinyButton", "parent_id": "t1_dg6ejkq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I think this is absolutely what is going on. It doesn't tell you what to respond to her but it might help to know that this is likely what is going on inside her head. It sucks to feel jealous and at least she knew it enough to apologize. I think maybe you could just let it go as something she is doing that is wrong but she likely knows it and doesn't feel all that great about. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this is absolutely what is going on. It doesn&amp;#39;t tell you what to respond to her but it might help to know that this is likely what is going on inside her head. It sucks to feel jealous and at least she knew it enough to apologize. I think maybe you could just let it go as something she is doing that is wrong but she likely knows it and doesn&amp;#39;t feel all that great about. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6f4hm", "score_hidden": false, "stickied": false, "created": 1492054616.0, "created_utc": 1492025816.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6jtqf", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "funchy", "parent_id": "t1_dg6ejkq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "The dress analogy is perfect.\n\nop: your friend needs to get over herself. I wouldn't respond to her drama at all.  Nothing you say will make her act decent. Dont get sucked into her emotional issue. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The dress analogy is perfect.&lt;/p&gt;\n\n&lt;p&gt;op: your friend needs to get over herself. I wouldn&amp;#39;t respond to her drama at all.  Nothing you say will make her act decent. Dont get sucked into her emotional issue. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6jtqf", "score_hidden": false, "stickied": false, "created": 1492059490.0, "created_utc": 1492030690.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ejkq", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "DConstructed", "parent_id": "t3_650az9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I guess it's that feeling that you'll be wearing the same dress as she is at the cocktail party but it will fit you better or your shoes will be nicer than hers.\n\nShe has a bit of a competitive streak and even if her rational mind knows you weren't trying to one up her or \"steal\" her fantasy of being in France he irrational side feels like that's the case.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess it&amp;#39;s that feeling that you&amp;#39;ll be wearing the same dress as she is at the cocktail party but it will fit you better or your shoes will be nicer than hers.&lt;/p&gt;\n\n&lt;p&gt;She has a bit of a competitive streak and even if her rational mind knows you weren&amp;#39;t trying to one up her or &amp;quot;steal&amp;quot; her fantasy of being in France he irrational side feels like that&amp;#39;s the case.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6ejkq", "score_hidden": false, "stickied": false, "created": 1492054026.0, "created_utc": 1492025226.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6e5dd", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "1984stardusta", "parent_id": "t3_650az9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "France is big enough for you both", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;France is big enough for you both&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6e5dd", "score_hidden": false, "stickied": false, "created": 1492053616.0, "created_utc": 1492024816.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6f4in", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "letmestandalone", "parent_id": "t3_650az9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "It sounds like she is angry at you for taking attention away from her. Is she one of those people who plasters her social life/trips/good things all over the place? I've often read, and found from personal experience, that those people feel like they can't let other peoples enjoyment and happiness overshadow their own, and feel the need to make everything all about themselves. So it may be less about you personally, and more about her need to be the center of attention. Whatever it is, her response is concerning because of how negative is, how she is turning this into you hurting her, and almost sounds like she is trying to make you feel guilty for going on a trip you will enjoy. I wouldn't say end the friendship, but maybe take a step back and look at your interactions, both past and present. If this is abnormal behavior, then maybe something is up with her personally. If she constantly has to make everything about her, you might have to do some serious thinking about how you want to be interacting with her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like she is angry at you for taking attention away from her. Is she one of those people who plasters her social life/trips/good things all over the place? I&amp;#39;ve often read, and found from personal experience, that those people feel like they can&amp;#39;t let other peoples enjoyment and happiness overshadow their own, and feel the need to make everything all about themselves. So it may be less about you personally, and more about her need to be the center of attention. Whatever it is, her response is concerning because of how negative is, how she is turning this into you hurting her, and almost sounds like she is trying to make you feel guilty for going on a trip you will enjoy. I wouldn&amp;#39;t say end the friendship, but maybe take a step back and look at your interactions, both past and present. If this is abnormal behavior, then maybe something is up with her personally. If she constantly has to make everything about her, you might have to do some serious thinking about how you want to be interacting with her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6f4in", "score_hidden": false, "stickied": false, "created": 1492054617.0, "created_utc": 1492025817.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6fx6w", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "JetsettingBeauty", "parent_id": "t3_650az9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Your friend sounds petty af. Don't bother saying anything. If it was me, I'd accept not making the most effort in that relationship with that kind of person. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your friend sounds petty af. Don&amp;#39;t bother saying anything. If it was me, I&amp;#39;d accept not making the most effort in that relationship with that kind of person. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6fx6w", "score_hidden": false, "stickied": false, "created": 1492055434.0, "created_utc": 1492026634.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6hoqk", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Odins_dottir", "parent_id": "t1_dg6eh49", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "You did nothing wrong and IMO you should not dignify that kind of behavior with a response at all. \n\nDo you live in the same country as her now? It shouldn't be a problem to go to any another country any time you want without her approval. \n\nTo me it sounds like she thinks France is a special magical place just for her and you are taking away from the special-ness and her perceived \"exclusivity\" when in reality it's just another country, people come and go all the time. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You did nothing wrong and IMO you should not dignify that kind of behavior with a response at all. &lt;/p&gt;\n\n&lt;p&gt;Do you live in the same country as her now? It shouldn&amp;#39;t be a problem to go to any another country any time you want without her approval. &lt;/p&gt;\n\n&lt;p&gt;To me it sounds like she thinks France is a special magical place just for her and you are taking away from the special-ness and her perceived &amp;quot;exclusivity&amp;quot; when in reality it&amp;#39;s just another country, people come and go all the time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6hoqk", "score_hidden": false, "stickied": false, "created": 1492057246.0, "created_utc": 1492028446.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6eh49", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TriSarahTops47", "parent_id": "t1_dg6e8r9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I'm trying to be an adult and not respond to the message about changing her plans, but it's so hard because I don't feel like I did anything wrong...and who I am as a person. I understand people get annoyed about things that they logically know shouldn't annoy them, but don't put that into the world! Keep that to yourself! Ugh.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m trying to be an adult and not respond to the message about changing her plans, but it&amp;#39;s so hard because I don&amp;#39;t feel like I did anything wrong...and who I am as a person. I understand people get annoyed about things that they logically know shouldn&amp;#39;t annoy them, but don&amp;#39;t put that into the world! Keep that to yourself! Ugh.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6eh49", "score_hidden": false, "stickied": false, "created": 1492053954.0, "created_utc": 1492025154.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6e8r9", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "itschaaarlieee", "parent_id": "t3_650az9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Is she really going with her husband? Maybe she was going with someone else and didn't want you to know. \nJust a thought. \n\nOr maybe it's just that this is a getaway she's been looking forward for a very long time and needed to disconnect 100% from her life back home. And you being there even if you didn't try and hang out with them was bursting her bubble. \n\nI would say you give her some space... Saying a passive aggressive comment like \"I'm sorry my being in the same country as you makes you so uncomfortable\". I think it won't make things any better... probably you just caught her in a bad moment and she lashed out against the first person that crossed her path. Don't take it so personally, if you guys are good friends and she said she's sorry then let it go :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is she really going with her husband? Maybe she was going with someone else and didn&amp;#39;t want you to know. \nJust a thought. &lt;/p&gt;\n\n&lt;p&gt;Or maybe it&amp;#39;s just that this is a getaway she&amp;#39;s been looking forward for a very long time and needed to disconnect 100% from her life back home. And you being there even if you didn&amp;#39;t try and hang out with them was bursting her bubble. &lt;/p&gt;\n\n&lt;p&gt;I would say you give her some space... Saying a passive aggressive comment like &amp;quot;I&amp;#39;m sorry my being in the same country as you makes you so uncomfortable&amp;quot;. I think it won&amp;#39;t make things any better... probably you just caught her in a bad moment and she lashed out against the first person that crossed her path. Don&amp;#39;t take it so personally, if you guys are good friends and she said she&amp;#39;s sorry then let it go :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6e8r9", "score_hidden": false, "stickied": false, "created": 1492053713.0, "created_utc": 1492024913.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6mvj5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "AbyssLookedBack", "parent_id": "t3_650az9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "What the everloving fuck?  I hope she's an amazing best friend in every way other than this because honestly, I can't imagine a woman this batshit crazy being anyone's \"best\" friend.  Possibly you should suggest she get scanned for a brain tumor if she actually thinks that two people can't take vacations to the same place at the same time and she has to change her dates for some unspecified and utterly bizarre reason.   Because that seriously sounds ... mental. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What the everloving fuck?  I hope she&amp;#39;s an amazing best friend in every way other than this because honestly, I can&amp;#39;t imagine a woman this batshit crazy being anyone&amp;#39;s &amp;quot;best&amp;quot; friend.  Possibly you should suggest she get scanned for a brain tumor if she actually thinks that two people can&amp;#39;t take vacations to the same place at the same time and she has to change her dates for some unspecified and utterly bizarre reason.   Because that seriously sounds ... mental. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6mvj5", "score_hidden": false, "stickied": false, "created": 1492063069.0, "created_utc": 1492034269.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6f9hv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Luciditii", "parent_id": "t3_650az9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Honestly I am a female and I am not sure what is wrong with what you did in any way. A passive aggressive comment may put a huge kink in your friendship though. Maybe she honestly felt that she would be obligated since you are her best friend to hang out with you and whatnot. Or maybe that you got to go for free bugged her for some reason. Idk her mind so I am unsure but it seems like she wanted the spotlight and you were getting to go for free so it shoved you in the spotlight and she didn't want any of that. Whatever the case is just let it go tell her to have a good time. If she continues just ignore it otherwise you might have some friendship hurdles. It's all about picking your battles! Good luck", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly I am a female and I am not sure what is wrong with what you did in any way. A passive aggressive comment may put a huge kink in your friendship though. Maybe she honestly felt that she would be obligated since you are her best friend to hang out with you and whatnot. Or maybe that you got to go for free bugged her for some reason. Idk her mind so I am unsure but it seems like she wanted the spotlight and you were getting to go for free so it shoved you in the spotlight and she didn&amp;#39;t want any of that. Whatever the case is just let it go tell her to have a good time. If she continues just ignore it otherwise you might have some friendship hurdles. It&amp;#39;s all about picking your battles! Good luck&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6f9hv", "score_hidden": false, "stickied": false, "created": 1492054760.0, "created_utc": 1492025960.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6hbg1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Odins_dottir", "parent_id": "t3_650az9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "My opinion, YMMV: \nWith that reaction, publicly posted on Facebook, she isn't really a friend. I know it sucks to lose a friend after that long, but people change. I'd personally distance myself, I need less of that type of drama in my life, not more. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My opinion, YMMV: \nWith that reaction, publicly posted on Facebook, she isn&amp;#39;t really a friend. I know it sucks to lose a friend after that long, but people change. I&amp;#39;d personally distance myself, I need less of that type of drama in my life, not more. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6hbg1", "score_hidden": false, "stickied": false, "created": 1492056864.0, "created_utc": 1492028064.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6sqmm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "brookasaurusrex", "parent_id": "t1_dg6q1ce", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Good way to go. Take the high road, if it comes up again, I hope it's because she wants to apologize. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good way to go. Take the high road, if it comes up again, I hope it&amp;#39;s because she wants to apologize. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6sqmm", "score_hidden": false, "stickied": false, "created": 1492070333.0, "created_utc": 1492041533.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6q1ce", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TriSarahTops47", "parent_id": "t1_dg6pxld", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I decided to ignore it for now and hope she starts talking to me about normal stuff again. If she brings it up again, I'm going to have to address it, I suppose.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I decided to ignore it for now and hope she starts talking to me about normal stuff again. If she brings it up again, I&amp;#39;m going to have to address it, I suppose.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6q1ce", "score_hidden": false, "stickied": false, "created": 1492066987.0, "created_utc": 1492038187.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pxld", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "brookasaurusrex", "parent_id": "t3_650az9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Sometimes people are childish and I think she feels like you're \"stealing her spotlight\". People can be silly and irrational, and maybe there's other stress factors in her life that you're not aware of and she just had a moment of feeling like, \"really? I finally get to do this thing and someone else is doing it too?\" I wouldn't take it personally and I wouldn't let it affect your relationship, especially if this is a first time offense like this. It could have just been a bad day for her. Is it silly? Yes. People are silly. Don't let her reaction put a damper on your awesome trip. And don't stress, if she chooses to make a big deal out of this then you know more about what kind of person she is. But it's more likely that this will blow over like nothing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes people are childish and I think she feels like you&amp;#39;re &amp;quot;stealing her spotlight&amp;quot;. People can be silly and irrational, and maybe there&amp;#39;s other stress factors in her life that you&amp;#39;re not aware of and she just had a moment of feeling like, &amp;quot;really? I finally get to do this thing and someone else is doing it too?&amp;quot; I wouldn&amp;#39;t take it personally and I wouldn&amp;#39;t let it affect your relationship, especially if this is a first time offense like this. It could have just been a bad day for her. Is it silly? Yes. People are silly. Don&amp;#39;t let her reaction put a damper on your awesome trip. And don&amp;#39;t stress, if she chooses to make a big deal out of this then you know more about what kind of person she is. But it&amp;#39;s more likely that this will blow over like nothing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6pxld", "score_hidden": false, "stickied": false, "created": 1492066856.0, "created_utc": 1492038056.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg7d819", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Scarsandthings", "parent_id": "t1_dg6tdwr", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This is 100% it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is 100% it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg7d819", "score_hidden": false, "stickied": false, "created": 1492106454.0, "created_utc": 1492077654.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6tdwr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "keepstiring", "parent_id": "t3_650az9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Does she post a lot on social media? She may be upset because you two would be posting similar dazzling pictures from the same country at the same time. Assuming your social circles over lap you would be taking the special-ness of her moment away from her (in her head). This trip is likely more a spitting contest between her and her friends like \"Look what my husband does for me!!!!\" and you doing a similar thing especially without the pampering husband puts a wet blanket on her opportunity to rub it in her \"friends\" faces. Does this sound like her? The type to keep up the the Jones and gossip about Peggy's marriage behind her back?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does she post a lot on social media? She may be upset because you two would be posting similar dazzling pictures from the same country at the same time. Assuming your social circles over lap you would be taking the special-ness of her moment away from her (in her head). This trip is likely more a spitting contest between her and her friends like &amp;quot;Look what my husband does for me!!!!&amp;quot; and you doing a similar thing especially without the pampering husband puts a wet blanket on her opportunity to rub it in her &amp;quot;friends&amp;quot; faces. Does this sound like her? The type to keep up the the Jones and gossip about Peggy&amp;#39;s marriage behind her back?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6tdwr", "score_hidden": false, "stickied": false, "created": 1492071150.0, "created_utc": 1492042350.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6mz81", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Zooloretti", "parent_id": "t1_dg6mdz9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Yeah, don't bother with her any more. If you can't tell a person something exciting without knowing they'll throw a shit fit they're not a friend.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, don&amp;#39;t bother with her any more. If you can&amp;#39;t tell a person something exciting without knowing they&amp;#39;ll throw a shit fit they&amp;#39;re not a friend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6mz81", "score_hidden": false, "stickied": false, "created": 1492063190.0, "created_utc": 1492034390.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6s2xm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "breakfastburritotime", "parent_id": "t1_dg6mdz9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This is just going to continue. If you two get promotions/new jobs, move to a new city, get a new pet at the same time, she's going to be upset that you stole her thunder and try to one-up you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is just going to continue. If you two get promotions/new jobs, move to a new city, get a new pet at the same time, she&amp;#39;s going to be upset that you stole her thunder and try to one-up you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6s2xm", "score_hidden": false, "stickied": false, "created": 1492069509.0, "created_utc": 1492040709.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg74txk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DieLoserDie", "parent_id": "t1_dg6mdz9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "She sounds pathetic.\nWhy bother with her?\n\nEspecially shit like buyng a house or having a baby.  If you're friends with people of the same/similar age its pretty common for things like graduations, engagements, weddings, house-buying, babies to happen around the same time.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She sounds pathetic.\nWhy bother with her?&lt;/p&gt;\n\n&lt;p&gt;Especially shit like buyng a house or having a baby.  If you&amp;#39;re friends with people of the same/similar age its pretty common for things like graduations, engagements, weddings, house-buying, babies to happen around the same time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg74txk", "score_hidden": false, "stickied": false, "created": 1492085998.0, "created_utc": 1492057198.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg7oj9d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "threequarterchubb", "parent_id": "t1_dg6mdz9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "She sounds really selfish, does she have redeeming qualities as a friend? You didn't mention much positive about her for it being such a long relationship, even her apology didn't seem sincere with her following behavior. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She sounds really selfish, does she have redeeming qualities as a friend? You didn&amp;#39;t mention much positive about her for it being such a long relationship, even her apology didn&amp;#39;t seem sincere with her following behavior. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg7oj9d", "score_hidden": false, "stickied": false, "created": 1492125156.0, "created_utc": 1492096356.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mdz9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TriSarahTops47", "parent_id": "t1_dg6jvey", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Towards me, yes, but she's had similar reactions towards other people doing things she perceives as her \"thing.\" Like buying a house or having a baby, etc. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Towards me, yes, but she&amp;#39;s had similar reactions towards other people doing things she perceives as her &amp;quot;thing.&amp;quot; Like buying a house or having a baby, etc. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6mdz9", "score_hidden": false, "stickied": false, "created": 1492062479.0, "created_utc": 1492033679.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jvey", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "threequarterchubb", "parent_id": "t3_650az9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Is this the first time she's ever acted like that?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is this the first time she&amp;#39;s ever acted like that?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6jvey", "score_hidden": false, "stickied": false, "created": 1492059542.0, "created_utc": 1492030742.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6i13d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ravynn15", "parent_id": "t3_650az9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "That is straight up psycho and abusive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is straight up psycho and abusive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6i13d", "score_hidden": false, "stickied": false, "created": 1492057587.0, "created_utc": 1492028787.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6n2c9", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Zooloretti", "parent_id": "t1_dg6l59t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Normal people don't go on vacation because it looks good to other people. They go because they want to go. Sure, it might be a bit sad to think you had to save for five years and your friend can afford to just up sticks and go, but if you think that way then you'll neve have any friends.\n\nGirl A does not own France, nor does she own the concept of vacations.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Normal people don&amp;#39;t go on vacation because it looks good to other people. They go because they want to go. Sure, it might be a bit sad to think you had to save for five years and your friend can afford to just up sticks and go, but if you think that way then you&amp;#39;ll neve have any friends.&lt;/p&gt;\n\n&lt;p&gt;Girl A does not own France, nor does she own the concept of vacations.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6n2c9", "score_hidden": false, "stickied": false, "created": 1492063293.0, "created_utc": 1492034493.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6ndgl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "beckdaddy1", "parent_id": "t1_dg6mies", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "She would totally get offended by the \"stolen thunder\" comment. Once it cools off a bit, I think a real conversation might squash this for good. Messages always have a chance of being misunderstood, or taken in the wrong tone. A conversation between true friends can smooth out most things pretty quickly.  Good luck, and have a great trip!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She would totally get offended by the &amp;quot;stolen thunder&amp;quot; comment. Once it cools off a bit, I think a real conversation might squash this for good. Messages always have a chance of being misunderstood, or taken in the wrong tone. A conversation between true friends can smooth out most things pretty quickly.  Good luck, and have a great trip!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6ndgl", "score_hidden": false, "stickied": false, "created": 1492063679.0, "created_utc": 1492034879.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mies", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TriSarahTops47", "parent_id": "t1_dg6l59t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "The stole her thunder thing makes sense. We don't live in the same city so that makes it a little more difficult. I'm not trying to lose a friend, at all, I'm not \"mad.\" There's not a great way to say \"I'm sorry I stole your thunder\" because I think that will offend her as well, implying her pride had something to do with her reaction. I'm gonna ignore the text about changing her dates, I don't think anything I have to say to that is going to have a positive outcome. Hopefully she'll get back to normal, but we shall see.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The stole her thunder thing makes sense. We don&amp;#39;t live in the same city so that makes it a little more difficult. I&amp;#39;m not trying to lose a friend, at all, I&amp;#39;m not &amp;quot;mad.&amp;quot; There&amp;#39;s not a great way to say &amp;quot;I&amp;#39;m sorry I stole your thunder&amp;quot; because I think that will offend her as well, implying her pride had something to do with her reaction. I&amp;#39;m gonna ignore the text about changing her dates, I don&amp;#39;t think anything I have to say to that is going to have a positive outcome. Hopefully she&amp;#39;ll get back to normal, but we shall see.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6mies", "score_hidden": false, "stickied": false, "created": 1492062626.0, "created_utc": 1492033826.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg74wxh", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "DieLoserDie", "parent_id": "t1_dg6l59t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "If her feelings are hurt over that, she is pathetic and doesnt deserve friends.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If her feelings are hurt over that, she is pathetic and doesnt deserve friends.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg74wxh", "score_hidden": false, "stickied": false, "created": 1492086131.0, "created_utc": 1492057331.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6l59t", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "beckdaddy1", "parent_id": "t3_650az9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "You kind of stole her thunder.  Did you do anything wrong? Absolutely not.  But that is not the point. You stated\"because I know she's wanted to go for some time\". So you know how much this trip meant to her. The trip to France was, in a way, \"her thing\", and before she got everything booked, you and Friend B are plastered on her news feed, boasting about \"your trip\". I can see why she was hurt. It was certainly inappropriate for her to lash out at you, but she has apologized for that. Again you didn't do anything \"wrong\", and you should never pass up on a free plane ticket to France! Maybe you and friend A just need to sit down and talk, in person, (not though passive-aggressive messages). If you understand that her feelings were hurt, and she understands that you weren't going to pass up free tickets, you get to keep your best friend. True friends are not easy to come by, I would never let one walk away over something like this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You kind of stole her thunder.  Did you do anything wrong? Absolutely not.  But that is not the point. You stated&amp;quot;because I know she&amp;#39;s wanted to go for some time&amp;quot;. So you know how much this trip meant to her. The trip to France was, in a way, &amp;quot;her thing&amp;quot;, and before she got everything booked, you and Friend B are plastered on her news feed, boasting about &amp;quot;your trip&amp;quot;. I can see why she was hurt. It was certainly inappropriate for her to lash out at you, but she has apologized for that. Again you didn&amp;#39;t do anything &amp;quot;wrong&amp;quot;, and you should never pass up on a free plane ticket to France! Maybe you and friend A just need to sit down and talk, in person, (not though passive-aggressive messages). If you understand that her feelings were hurt, and she understands that you weren&amp;#39;t going to pass up free tickets, you get to keep your best friend. True friends are not easy to come by, I would never let one walk away over something like this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6l59t", "score_hidden": false, "stickied": false, "created": 1492061002.0, "created_utc": 1492032202.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg6tydj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crankyhedgiebutt", "parent_id": "t1_dg6mcqf", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "LMAO! I swear you must be talking about one of my old high school friends. She was mad I lost my virginity before her and made the conversation when I told her all about herself. She cried on the phone for like half an hour and I had to console her. The funny thing is, I wasn't even happy to lose it then and really needed to talk myself.\n\nMy random tangent aside, man I guess I would try talking to her. I'd be super annoyed if I were you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;LMAO! I swear you must be talking about one of my old high school friends. She was mad I lost my virginity before her and made the conversation when I told her all about herself. She cried on the phone for like half an hour and I had to console her. The funny thing is, I wasn&amp;#39;t even happy to lose it then and really needed to talk myself.&lt;/p&gt;\n\n&lt;p&gt;My random tangent aside, man I guess I would try talking to her. I&amp;#39;d be super annoyed if I were you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6tydj", "score_hidden": false, "stickied": false, "created": 1492071842.0, "created_utc": 1492043042.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mcqf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TriSarahTops47", "parent_id": "t1_dg6itaf", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "She definitely likes things to be \"her thing,\" if that makes any sense and she definitely wants to be the first to do things. She got really upset when her brother and sister in law (younger) had a baby because she thought she should have one first. People are entitled to be annoyed about whatever, I guess.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She definitely likes things to be &amp;quot;her thing,&amp;quot; if that makes any sense and she definitely wants to be the first to do things. She got really upset when her brother and sister in law (younger) had a baby because she thought she should have one first. People are entitled to be annoyed about whatever, I guess.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6mcqf", "score_hidden": false, "stickied": false, "created": 1492062439.0, "created_utc": 1492033639.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6itaf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crankyhedgiebutt", "parent_id": "t1_dg6i36i", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "That comment would be warranted, depending on how honest you can be with her (i.e. Because of how she reacts to things). But idk...sounds like she needs to cool off for a little bit before you say something. \n\nIt might make things worse when she's upset. I like what you wrote as a possible response, that it makes you sad that she wouldn't want you to be in the same country. Maybe try reasoning with her after a few days when she can maybe think a little more rationally. \n\nDoes she normally get upset about strange things like this? \n\nETA: oops...my reading comprehension sucks! 20 years, damn I'd hope you could be honest with a friend you've known that long.", "edited": 1492029828.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That comment would be warranted, depending on how honest you can be with her (i.e. Because of how she reacts to things). But idk...sounds like she needs to cool off for a little bit before you say something. &lt;/p&gt;\n\n&lt;p&gt;It might make things worse when she&amp;#39;s upset. I like what you wrote as a possible response, that it makes you sad that she wouldn&amp;#39;t want you to be in the same country. Maybe try reasoning with her after a few days when she can maybe think a little more rationally. &lt;/p&gt;\n\n&lt;p&gt;Does she normally get upset about strange things like this? &lt;/p&gt;\n\n&lt;p&gt;ETA: oops...my reading comprehension sucks! 20 years, damn I&amp;#39;d hope you could be honest with a friend you&amp;#39;ve known that long.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6itaf", "score_hidden": false, "stickied": false, "created": 1492058409.0, "created_utc": 1492029609.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_650az9", "likes": null, "replies": "", "user_reports": [], "id": "dg74zn0", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "DieLoserDie", "parent_id": "t1_dg6i36i", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "WHY ARE YOU FRIENDS WITH HER?\n\nShe sounds like a dick, and you dont sound like you like her. You've come here to getvalidation about how petty she is.  Just Move on", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;WHY ARE YOU FRIENDS WITH HER?&lt;/p&gt;\n\n&lt;p&gt;She sounds like a dick, and you dont sound like you like her. You&amp;#39;ve come here to getvalidation about how petty she is.  Just Move on&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg74zn0", "score_hidden": false, "stickied": false, "created": 1492086250.0, "created_utc": 1492057450.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6i36i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TriSarahTops47", "parent_id": "t1_dg6hytt", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I want to, but I'm trying really hard not to. I know it will make things worse, but I just want to be like \"You know that's fucking insane, right?\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to, but I&amp;#39;m trying really hard not to. I know it will make things worse, but I just want to be like &amp;quot;You know that&amp;#39;s fucking insane, right?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6i36i", "score_hidden": false, "stickied": false, "created": 1492057648.0, "created_utc": 1492028848.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6hytt", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "krazeesheet", "parent_id": "t3_650az9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "get crazy with her!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;get crazy with her!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg6hytt", "score_hidden": false, "stickied": false, "created": 1492057522.0, "created_utc": 1492028722.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}]