[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TwoXChromosomes", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I wasn&amp;#39;t sure where to post this and didn&amp;#39;t really know how to title this post. From what I&amp;#39;d estimate to be about the age of 9, my father would lightly slap (a bit more than a pat) my bottom as I walked past him. I don&amp;#39;t remember when he stopped but I must have been about 13. He never touched me or did anything clearly inappropriate, in fact we have sort of a normal relationship now even though we aren&amp;#39;t close at all (I&amp;#39;m 20 and I do still live at home).&lt;/p&gt;\n\n&lt;p&gt;I understand how dumb it sounds. Not like a big deal at all. But I can&amp;#39;t express how much I hated it, how disgusting and violated and ashamed I felt every time he did it, even when I was a young kid. I know parents sometimes spank their kids to punish them but this isn&amp;#39;t what that was. It was different from punishing a child, it was just weird. It was casual and literally in passing. My dad never did the same to my brother, and this is what solidifies the creepiness in my head. He used to do that to me because I was a girl.&lt;/p&gt;\n\n&lt;p&gt;(I feel guilty saying how much I hated it, knowing that some people are terribly abused. My discomfort is valid, but I acknowledge that it does not compare to what others may experience.)&lt;/p&gt;\n\n&lt;p&gt;When I was about 14-15 there was one day where we had a fight and somehow we landed up on my bed sort of wrestle-fighting (he wasn&amp;#39;t physically abusive but was somewhat aggressive with me like some parents can be), which is so weird to think about now, and he hit my butt a few times which is especially disgusting to me because at that age I was sexually mature. As in, objectively speaking about this, it&amp;#39;s easy to brush off a father spanking his young child but it is objectively creepier if it&amp;#39;s his teenage child. Luckily my brother walked in after only a few seconds of my being on the bed. That was a minor incident that bothered me back then, that I haven&amp;#39;t really thought about since. I thought I&amp;#39;d mention it since it seemed relevant though.&lt;/p&gt;\n\n&lt;p&gt;What bothers me is that I can&amp;#39;t talk to anyone in real life about this. My father didn&amp;#39;t rape me or molest me and isn&amp;#39;t an evil person. I just always perceived his actions as creepy, he may not even have been a creep, I may just be over reacting. At the same time it&amp;#39;s not fair that I feel so disgusted and sad thinking about this. I was so obviously uncomfortable about it and would flinch when I walked near him but I never flat out told him it was uncomfortable. I was only a child.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never read this kind of a grey area story, and I&amp;#39;m wondering if anyone else has ever experienced anything like this that wasn&amp;#39;t clearly abuse but still uncomfortable. I&amp;#39;d like to hear anyone&amp;#39;s take on this, really. I guess I also just wanted to get this off my chest since I don&amp;#39;t want to talk about it in real life. Thanks for listening.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I wasn't sure where to post this and didn't really know how to title this post. From what I'd estimate to be about the age of 9, my father would lightly slap (a bit more than a pat) my bottom as I walked past him. I don't remember when he stopped but I must have been about 13. He never touched me or did anything clearly inappropriate, in fact we have sort of a normal relationship now even though we aren't close at all (I'm 20 and I do still live at home).\n\nI understand how dumb it sounds. Not like a big deal at all. But I can't express how much I hated it, how disgusting and violated and ashamed I felt every time he did it, even when I was a young kid. I know parents sometimes spank their kids to punish them but this isn't what that was. It was different from punishing a child, it was just weird. It was casual and literally in passing. My dad never did the same to my brother, and this is what solidifies the creepiness in my head. He used to do that to me because I was a girl.\n\n(I feel guilty saying how much I hated it, knowing that some people are terribly abused. My discomfort is valid, but I acknowledge that it does not compare to what others may experience.)\n\nWhen I was about 14-15 there was one day where we had a fight and somehow we landed up on my bed sort of wrestle-fighting (he wasn't physically abusive but was somewhat aggressive with me like some parents can be), which is so weird to think about now, and he hit my butt a few times which is especially disgusting to me because at that age I was sexually mature. As in, objectively speaking about this, it's easy to brush off a father spanking his young child but it is objectively creepier if it's his teenage child. Luckily my brother walked in after only a few seconds of my being on the bed. That was a minor incident that bothered me back then, that I haven't really thought about since. I thought I'd mention it since it seemed relevant though.\n\nWhat bothers me is that I can't talk to anyone in real life about this. My father didn't rape me or molest me and isn't an evil person. I just always perceived his actions as creepy, he may not even have been a creep, I may just be over reacting. At the same time it's not fair that I feel so disgusted and sad thinking about this. I was so obviously uncomfortable about it and would flinch when I walked near him but I never flat out told him it was uncomfortable. I was only a child.\n\nI've never read this kind of a grey area story, and I'm wondering if anyone else has ever experienced anything like this that wasn't clearly abuse but still uncomfortable. I'd like to hear anyone's take on this, really. I guess I also just wanted to get this off my chest since I don't want to talk about it in real life. Thanks for listening.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "658424", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "throwsawsay", "saved": false, "mod_reports": [], "name": "t3_658424", "subreddit_name_prefixed": "r/TwoXChromosomes", "approved_by": null, "over_18": false, "domain": "self.TwoXChromosomes", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r2jt", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TwoXChromosomes/comments/658424/i_was_never_molested_but_i_was_always_made_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492144387.0, "url": "https://www.reddit.com/r/TwoXChromosomes/comments/658424/i_was_never_molested_but_i_was_always_made_to/", "author_flair_text": null, "quarantine": false, "title": "I was never molested, but I was always made to feel uncomfortable", "created_utc": 1492115587.0, "distinguished": null, "media": null, "upvote_ratio": 0.64, "num_comments": 25, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": "", "user_reports": [], "id": "dg8duuh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dejohns2", "parent_id": "t1_dg8b1hj", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "That's tough, but I that's why I recommended going through a university. Appointments are usually $10-$20 per session. Similar rates for cities. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s tough, but I that&amp;#39;s why I recommended going through a university. Appointments are usually $10-$20 per session. Similar rates for cities. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg8duuh", "score_hidden": false, "stickied": false, "created": 1492153629.0, "created_utc": 1492124829.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": "", "user_reports": [], "id": "dg8ezva", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "peeingclitoris", "parent_id": "t1_dg8b1hj", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "A lot of clinics have sliding scale counseling and lots of youth centers actually cater to people under 21. Even a LGBT youth center would be worth a shot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A lot of clinics have sliding scale counseling and lots of youth centers actually cater to people under 21. Even a LGBT youth center would be worth a shot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg8ezva", "score_hidden": false, "stickied": false, "created": 1492155145.0, "created_utc": 1492126345.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8b1hj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "throwsawsay", "parent_id": "t1_dg86qlk", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I've tried to see a counselor before but unfortunately I'm not in the position to see one since I'm financially dependent on my parents who believe counselling is bs, and mental healthcare isn't a priority in the country I live.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve tried to see a counselor before but unfortunately I&amp;#39;m not in the position to see one since I&amp;#39;m financially dependent on my parents who believe counselling is bs, and mental healthcare isn&amp;#39;t a priority in the country I live.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg8b1hj", "score_hidden": false, "stickied": false, "created": 1492149911.0, "created_utc": 1492121111.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": "", "user_reports": [], "id": "dgafds7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dejohns2", "parent_id": "t1_dga91bt", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "That sounds like super creepy, and not aphasia. You are not overreacting, you are correct that this is not an appropriate adjective for a child.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That sounds like super creepy, and not aphasia. You are not overreacting, you are correct that this is not an appropriate adjective for a child.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgafds7", "score_hidden": false, "stickied": false, "created": 1492270576.0, "created_utc": 1492241776.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga91bt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Parlaie", "parent_id": "t1_dg86qlk", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "My father in law has called my 2 yr old daughter sexy and I'm completely disturbed by it. He also says things like \"how's my girlfriend doing?\" He's an old man so I'm hoping it's word aphasia or something (he does frequently confuse words), but I will never ever allow him to be alone with her. I don't think I'm over reacting. Sexy is not an appropriate adjective for a child. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My father in law has called my 2 yr old daughter sexy and I&amp;#39;m completely disturbed by it. He also says things like &amp;quot;how&amp;#39;s my girlfriend doing?&amp;quot; He&amp;#39;s an old man so I&amp;#39;m hoping it&amp;#39;s word aphasia or something (he does frequently confuse words), but I will never ever allow him to be alone with her. I don&amp;#39;t think I&amp;#39;m over reacting. Sexy is not an appropriate adjective for a child. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dga91bt", "score_hidden": false, "stickied": false, "created": 1492257429.0, "created_utc": 1492228629.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86qlk", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Dejohns2", "parent_id": "t3_658424", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "You felt creepy about this because it was a fucking creepy thing to do. \n\nIf you go to a university, please consider seeing a counselor through them. If you don't, see if your city offers services. There's nothing wrong with talking to someone about this in real life, and it will probably help.\n\nIt's okay to have gross feelings about that, it's gross. FWIW, my dad did the same thing, as well as calling me \"sexy\" and \"foxy\" as young as five. Like, a five-year-old isn't fucking sexy. Gross.\n\nNo this behavior is not appropriate. Yes, it is disgusting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You felt creepy about this because it was a fucking creepy thing to do. &lt;/p&gt;\n\n&lt;p&gt;If you go to a university, please consider seeing a counselor through them. If you don&amp;#39;t, see if your city offers services. There&amp;#39;s nothing wrong with talking to someone about this in real life, and it will probably help.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s okay to have gross feelings about that, it&amp;#39;s gross. FWIW, my dad did the same thing, as well as calling me &amp;quot;sexy&amp;quot; and &amp;quot;foxy&amp;quot; as young as five. Like, a five-year-old isn&amp;#39;t fucking sexy. Gross.&lt;/p&gt;\n\n&lt;p&gt;No this behavior is not appropriate. Yes, it is disgusting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg86qlk", "score_hidden": false, "stickied": false, "created": 1492144733.0, "created_utc": 1492115933.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": "", "user_reports": [], "id": "dg8z7ez", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "knoerifast13", "parent_id": "t3_658424", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "As someone who has been through some shit, I don't feel like you should feel guilty for comparing at all. If it made you feel uncomfortable and you're still thinking about it years later, then it meant something. If you felt that at that age, it was real. \n\nAnyone who's been through something similar/sexually abusive will recognise that and will try to help you, that's the only way you can give a negative experience a positive twist. So don't feel like you shouldn't talk about it because others have had different (\"worse\") experiences. It's what it meant to you that counts, not what it may mean to someone else. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone who has been through some shit, I don&amp;#39;t feel like you should feel guilty for comparing at all. If it made you feel uncomfortable and you&amp;#39;re still thinking about it years later, then it meant something. If you felt that at that age, it was real. &lt;/p&gt;\n\n&lt;p&gt;Anyone who&amp;#39;s been through something similar/sexually abusive will recognise that and will try to help you, that&amp;#39;s the only way you can give a negative experience a positive twist. So don&amp;#39;t feel like you shouldn&amp;#39;t talk about it because others have had different (&amp;quot;worse&amp;quot;) experiences. It&amp;#39;s what it meant to you that counts, not what it may mean to someone else. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg8z7ez", "score_hidden": false, "stickied": false, "created": 1492193101.0, "created_utc": 1492164301.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": "", "user_reports": [], "id": "dg8u8ea", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "planethaley", "parent_id": "t1_dg8eyl8", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Yes! Seriously important and good point about not comparing to others for things like this ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes! Seriously important and good point about not comparing to others for things like this &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg8u8ea", "score_hidden": false, "stickied": false, "created": 1492178646.0, "created_utc": 1492149846.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8eyl8", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "peeingclitoris", "parent_id": "t3_658424", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I had the same- almost the exact same problem with my dad and I'm your age. I've also had a lot of trouble thinking about it and wondering what it all means. In the end I think it's still pretty gross to do to a young girl. I'm friends with a lot of guys and none of them would even do that to a grown woman. It's definitely a power play thing. I don't know if I'll ever confront him but that along with other bad stuff he's done to my family makes me angry at him.\nEDIT: Also there's no reason why you should compare yourself with others. Everyone's circumstances are different and you can't control that. I worked at a homeless shelter for a while and people whose lives had been absolutely shitty were accepting and willing to listen to other peoples' problems and empathetic. Even with silly stuff like \"my parents pay more attention to my brother than me.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had the same- almost the exact same problem with my dad and I&amp;#39;m your age. I&amp;#39;ve also had a lot of trouble thinking about it and wondering what it all means. In the end I think it&amp;#39;s still pretty gross to do to a young girl. I&amp;#39;m friends with a lot of guys and none of them would even do that to a grown woman. It&amp;#39;s definitely a power play thing. I don&amp;#39;t know if I&amp;#39;ll ever confront him but that along with other bad stuff he&amp;#39;s done to my family makes me angry at him.\nEDIT: Also there&amp;#39;s no reason why you should compare yourself with others. Everyone&amp;#39;s circumstances are different and you can&amp;#39;t control that. I worked at a homeless shelter for a while and people whose lives had been absolutely shitty were accepting and willing to listen to other peoples&amp;#39; problems and empathetic. Even with silly stuff like &amp;quot;my parents pay more attention to my brother than me.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg8eyl8", "score_hidden": false, "stickied": false, "created": 1492155100.0, "created_utc": 1492126300.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": "", "user_reports": [], "id": "dg8ao8s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "throwsawsay", "parent_id": "t1_dg87tji", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "It definitely felt weird to type this out.. But it makes me happy that my opening up caused you to open up. Hope you're doing well &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It definitely felt weird to type this out.. But it makes me happy that my opening up caused you to open up. Hope you&amp;#39;re doing well &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg8ao8s", "score_hidden": false, "stickied": false, "created": 1492149444.0, "created_utc": 1492120644.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87tji", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "CheeseNutz1", "parent_id": "t1_dg87a58", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This is brave of you to write this as I would probably have not told a soul if it weren't for you, thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is brave of you to write this as I would probably have not told a soul if it weren&amp;#39;t for you, thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg87tji", "score_hidden": false, "stickied": false, "created": 1492145960.0, "created_utc": 1492117160.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87a58", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CheeseNutz1", "parent_id": "t3_658424", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "When I was in primary school there was one day, I went out into the hall to grab something from my bag and my Italian teacher walked past me and well I wouldnt say it was a slap but more of what you are describing and I felt really creeped out by what she did, then she walked down the hall looking back at me smiling, she was old about 40, and I was only a 10 year old boy, I've haven't spoken to anyone about this but I just felt creeped out by her, it only happened once, but I wonder how many other kids she has done it too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I was in primary school there was one day, I went out into the hall to grab something from my bag and my Italian teacher walked past me and well I wouldnt say it was a slap but more of what you are describing and I felt really creeped out by what she did, then she walked down the hall looking back at me smiling, she was old about 40, and I was only a 10 year old boy, I&amp;#39;ve haven&amp;#39;t spoken to anyone about this but I just felt creeped out by her, it only happened once, but I wonder how many other kids she has done it too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg87a58", "score_hidden": false, "stickied": false, "created": 1492145352.0, "created_utc": 1492116552.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": "", "user_reports": [], "id": "dg89lih", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "zerodawnspawn", "parent_id": "t1_dg89i9m", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "No dude. Your trolling isn't really excusable here. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No dude. Your trolling isn&amp;#39;t really excusable here. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg89lih", "score_hidden": false, "stickied": false, "created": 1492148097.0, "created_utc": 1492119297.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg89i9m", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg894qz", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg89i9m", "score_hidden": false, "stickied": false, "created": 1492147985.0, "created_utc": 1492119185.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg894qz", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "zerodawnspawn", "parent_id": "t1_dg88ga3", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Still doesn't excuse the fact that you're asking someone who was violated by their father if they have a fetish for it for your own curiosity. Jesus Christ who raised you? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Still doesn&amp;#39;t excuse the fact that you&amp;#39;re asking someone who was violated by their father if they have a fetish for it for your own curiosity. Jesus Christ who raised you? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg894qz", "score_hidden": false, "stickied": false, "created": 1492147526.0, "created_utc": 1492118726.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg88ga3", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg87iz2", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg88ga3", "score_hidden": false, "stickied": false, "created": 1492146705.0, "created_utc": 1492117905.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87iz2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ravynn15", "parent_id": "t1_dg86w9s", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "you're not in gonewild.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you&amp;#39;re not in gonewild.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg87iz2", "score_hidden": false, "stickied": false, "created": 1492145634.0, "created_utc": 1492116834.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": "", "user_reports": [], "id": "dg8b3h0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PM_Me_Yer_Kittiez", "parent_id": "t1_dg86w9s", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Stop being creepy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stop being creepy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg8b3h0", "score_hidden": false, "stickied": false, "created": 1492149982.0, "created_utc": 1492121182.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86w9s", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_658424", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "[removed]", "edited": 1492121383.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg86w9s", "score_hidden": false, "stickied": false, "created": 1492144911.0, "created_utc": 1492116111.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": "", "user_reports": [], "id": "dg8al7a", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "throwsawsay", "parent_id": "t1_dg89ihk", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "He doesn't do this with other family. It was just me as far as I know.\n\nI live with and do maintain a relationship with my dad. It kind of only just occurred to me how fucked up it was that he did that.\nI was never close to my dad and I don't really care to rebuild trust.\n\nThanks for the response.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He doesn&amp;#39;t do this with other family. It was just me as far as I know.&lt;/p&gt;\n\n&lt;p&gt;I live with and do maintain a relationship with my dad. It kind of only just occurred to me how fucked up it was that he did that.\nI was never close to my dad and I don&amp;#39;t really care to rebuild trust.&lt;/p&gt;\n\n&lt;p&gt;Thanks for the response.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg8al7a", "score_hidden": false, "stickied": false, "created": 1492149339.0, "created_utc": 1492120539.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg89ihk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jberg18", "parent_id": "t3_658424", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "To preference my response I would like to mention that if it made you uncomfortable it is obviously an issue and something you can dislike even if it wasn't wholly \"inappropriate\" in intention. So if you are creeped out by it it is creepy.     \n     \nThat being said, pats have a spectrum of meaning. A swat on the bum could be sexual or playful or completely without meaning. It's a common thing in baseball, or as a joke, an indication to move along, or just a mildly sensitive spot to swat to make someone jump and cause a laugh.     \n       \nIf your dad does this with other family members it could be a way of being playful. If it was only you and/or your mom it could be something else. Much like a big kiss on the cheek from an Aunt it may just be something understandably unwelcome. At this point I would suggest saying \"I don't like that, stop it,\" if it ever comes up again.      \n       \nYou've probably already went through all that in your head and your looking for what to do next. You've clearly lost some trust in you dad because of these actions, and you will need time to build trust again if you feel like it is deserving. If this is the only action your ever felt was inappropriate then the trust should come back eventually. If not, then you may want to conciser what family relationship, if any, you are willing to maintain with your dad. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To preference my response I would like to mention that if it made you uncomfortable it is obviously an issue and something you can dislike even if it wasn&amp;#39;t wholly &amp;quot;inappropriate&amp;quot; in intention. So if you are creeped out by it it is creepy.     &lt;/p&gt;\n\n&lt;p&gt;That being said, pats have a spectrum of meaning. A swat on the bum could be sexual or playful or completely without meaning. It&amp;#39;s a common thing in baseball, or as a joke, an indication to move along, or just a mildly sensitive spot to swat to make someone jump and cause a laugh.     &lt;/p&gt;\n\n&lt;p&gt;If your dad does this with other family members it could be a way of being playful. If it was only you and/or your mom it could be something else. Much like a big kiss on the cheek from an Aunt it may just be something understandably unwelcome. At this point I would suggest saying &amp;quot;I don&amp;#39;t like that, stop it,&amp;quot; if it ever comes up again.      &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve probably already went through all that in your head and your looking for what to do next. You&amp;#39;ve clearly lost some trust in you dad because of these actions, and you will need time to build trust again if you feel like it is deserving. If this is the only action your ever felt was inappropriate then the trust should come back eventually. If not, then you may want to conciser what family relationship, if any, you are willing to maintain with your dad. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg89ihk", "score_hidden": false, "stickied": false, "created": 1492147993.0, "created_utc": 1492119193.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_658424", "likes": null, "replies": "", "user_reports": [], "id": "dg8or4c", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "littlewoolie", "parent_id": "t3_658424", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "It's called covert incest", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s called covert incest&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg8or4c", "score_hidden": false, "stickied": false, "created": 1492168793.0, "created_utc": 1492139993.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]