[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TwoXChromosomes", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My husband can be a wonderful person. He&amp;#39;s an extremely involved father and always helps when I ask him. But he doesn&amp;#39;t believe in saying he&amp;#39;s sorry. If we have an argument and he says nasty things he doesn&amp;#39;t see the need to apologize and usually doubles down on his comments. In one recent argument after months of bad sleep (thanks new baby!) we were both cranky and rude to each other one morning. Basically he woke up and immediately started cussing and complaining about sleep( I&amp;#39;m also not sleeping). I asked if he was in another one of his moods. And the argument escalated. I was annoyed that he treats me rude if he gets a bad night of sleep. And he somehow feels it&amp;#39;s okay to be rude and it&amp;#39;s not &amp;quot;technically&amp;quot; towards me. Argument goes on and he tells me I&amp;#39;m selfish and just an okay mother- gives me a list of the most bullshit little things to improve. Despite the fact that he was much more nasty and hurtful then I was, later in the day I apologize for having a cranky attitude but tell him there was no need to take it to where he did and that saying those types of things is on a different level then telling someone you don&amp;#39;t like when they&amp;#39;re grumpy. Instead of saying something like yeah I was in the moment and those weren&amp;#39;t nice things to say, he explains that bc he was provoked by my attitude towards him and he&amp;#39;s not sorry for saying them. If I &amp;quot;don&amp;#39;t want him to hurt me I shouldn&amp;#39;t start it.&amp;quot; He has this attitude of if a fight happens I can say anything and it&amp;#39;s fine bc I was provoked (and any little thing can set him off). He gets an attitude at things I wouldn&amp;#39;t even consider to waste anger on. \nArguments go like this way too often. He never takes accountability if he&amp;#39;s wrong and has told me he doesn&amp;#39;t feel bad if he hurts me. At this point I really don&amp;#39;t know how to move forward with our marriage. I&amp;#39;m absolutely terrified to get divorced and I would be so sad for our 10 month old son to grow up in a divided household. For me, I think in relationships you can have a fight and say something out of character but it&amp;#39;s important to recognize those faults, admit to wrong doing and try to do better in the future. I don&amp;#39;t have a good feeling if I hurt someone I love and it concerns me that my husband could knowingly hurt me and not care to apologize or think about his actions. Is it normal to not care about accountability? Am I putting too much importance on apologizing to your partner if you&amp;#39;ve hurt them? I&amp;#39;m just really confused and don&amp;#39;t know how I could move forward with a person who&amp;#39;s gotten to this place. &lt;/p&gt;\n\n&lt;p&gt;*sorry if there is bad grammar, English isn&amp;#39;t my native language and I don&amp;#39;t often post to Reddit :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My husband can be a wonderful person. He's an extremely involved father and always helps when I ask him. But he doesn't believe in saying he's sorry. If we have an argument and he says nasty things he doesn't see the need to apologize and usually doubles down on his comments. In one recent argument after months of bad sleep (thanks new baby!) we were both cranky and rude to each other one morning. Basically he woke up and immediately started cussing and complaining about sleep( I'm also not sleeping). I asked if he was in another one of his moods. And the argument escalated. I was annoyed that he treats me rude if he gets a bad night of sleep. And he somehow feels it's okay to be rude and it's not \"technically\" towards me. Argument goes on and he tells me I'm selfish and just an okay mother- gives me a list of the most bullshit little things to improve. Despite the fact that he was much more nasty and hurtful then I was, later in the day I apologize for having a cranky attitude but tell him there was no need to take it to where he did and that saying those types of things is on a different level then telling someone you don't like when they're grumpy. Instead of saying something like yeah I was in the moment and those weren't nice things to say, he explains that bc he was provoked by my attitude towards him and he's not sorry for saying them. If I \"don't want him to hurt me I shouldn't start it.\" He has this attitude of if a fight happens I can say anything and it's fine bc I was provoked (and any little thing can set him off). He gets an attitude at things I wouldn't even consider to waste anger on. \nArguments go like this way too often. He never takes accountability if he's wrong and has told me he doesn't feel bad if he hurts me. At this point I really don't know how to move forward with our marriage. I'm absolutely terrified to get divorced and I would be so sad for our 10 month old son to grow up in a divided household. For me, I think in relationships you can have a fight and say something out of character but it's important to recognize those faults, admit to wrong doing and try to do better in the future. I don't have a good feeling if I hurt someone I love and it concerns me that my husband could knowingly hurt me and not care to apologize or think about his actions. Is it normal to not care about accountability? Am I putting too much importance on apologizing to your partner if you've hurt them? I'm just really confused and don't know how I could move forward with a person who's gotten to this place. \n\n*sorry if there is bad grammar, English isn't my native language and I don't often post to Reddit :)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65amxf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "throwaway531100", "saved": false, "mod_reports": [], "name": "t3_65amxf", "subreddit_name_prefixed": "r/TwoXChromosomes", "approved_by": null, "over_18": false, "domain": "self.TwoXChromosomes", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r2jt", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TwoXChromosomes/comments/65amxf/husband_lacks_ability_to_apologize_and_i_dont/", "num_reports": null, "locked": false, "stickied": false, "created": 1492174138.0, "url": "https://www.reddit.com/r/TwoXChromosomes/comments/65amxf/husband_lacks_ability_to_apologize_and_i_dont/", "author_flair_text": null, "quarantine": false, "title": "Husband lacks ability to apologize and I don't know how to move forward with marriage", "created_utc": 1492145338.0, "distinguished": null, "media": null, "upvote_ratio": 0.62, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65amxf", "likes": null, "replies": "", "user_reports": [], "id": "dg8wpu5", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "CluelessWeasel", "parent_id": "t3_65amxf", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Does he admit that you guys are having issues? My husband and I had similar issues and counseling helped us tremendously. It was a battle getting him to admit he/we needed it, but after he did some counseling for anger issues and then we did sessions together, we are doing SO MUCH better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does he admit that you guys are having issues? My husband and I had similar issues and counseling helped us tremendously. It was a battle getting him to admit he/we needed it, but after he did some counseling for anger issues and then we did sessions together, we are doing SO MUCH better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg8wpu5", "score_hidden": false, "stickied": false, "created": 1492185104.0, "created_utc": 1492156304.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65amxf", "likes": null, "replies": "", "user_reports": [], "id": "dg9alcn", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Meownowwow", "parent_id": "t3_65amxf", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt;his moods.\n\nI also used this phrase before I was ready to admit my ex-husband was emotionally abusive to me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;his moods.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I also used this phrase before I was ready to admit my ex-husband was emotionally abusive to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg9alcn", "score_hidden": false, "stickied": false, "created": 1492213344.0, "created_utc": 1492184544.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65amxf", "likes": null, "replies": "", "user_reports": [], "id": "dg8t06t", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "amylsrg", "parent_id": "t3_65amxf", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "The fact that he blatantly says he doesn't feel bad for saying terrible things about you when \"provoked\" is cruel. He shouldn't take an argument about being grumpy in the morning as an opportunity to start criticizing your motherhood. This is not constructive. He is likely aware on some level that he is in the wrong for treating you poorly, but instead of owning up and making up, he escalates the argument to hide his wrongs in an argument that becomes uglier and difficult to resolve. It seems like he does it to protect his ego, but its at the cost of a healthy marriage connection. No one is in the right when two people are unkind to each other, and neither should be exempt from remorse if they wish to truly leave hurtful words in the past.\n\nI am not a mother, nor a wife, so I don't have advice from experience. But I can understand that the first 10 months of parenthood are very trying. He is clearly not well rested, even after he's woken up for the day. This may be clouding his judgement about the way he can treat you. \nHe may also feel frustration about raising a child because there is no perfect way to do it and there is no right answer. He nitpicks about your parenting because he understands that he cannot be in full control of the child's development, and that he needs to trust you now more than ever before. This is a challenge and it can make anyone nervous. Maybe he needs to let go of his need for control, just like he needs to let go of his pride and take responsibility for how he treats you. Once he learns to do these things, you can cooperate as parents, make joint decisions, and reconnect as partners who take care of each other and nurture a romantic connection. \n\nI understand that you're scared about raising a child to divorced parents. It's so common now, I think we all fear it. Remember that you two are both learning to be parents together and it takes practice. You're worn out and weakened now, but if you can address these issues and learn from them, you both can realize strength within one another and push forward. If you need help resolving these issues, I would suggest some form of joint counselling before resorting to divorce, but of course both you and your partner would have to agree to that.\n\nI hope you can work it out. Best wishes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The fact that he blatantly says he doesn&amp;#39;t feel bad for saying terrible things about you when &amp;quot;provoked&amp;quot; is cruel. He shouldn&amp;#39;t take an argument about being grumpy in the morning as an opportunity to start criticizing your motherhood. This is not constructive. He is likely aware on some level that he is in the wrong for treating you poorly, but instead of owning up and making up, he escalates the argument to hide his wrongs in an argument that becomes uglier and difficult to resolve. It seems like he does it to protect his ego, but its at the cost of a healthy marriage connection. No one is in the right when two people are unkind to each other, and neither should be exempt from remorse if they wish to truly leave hurtful words in the past.&lt;/p&gt;\n\n&lt;p&gt;I am not a mother, nor a wife, so I don&amp;#39;t have advice from experience. But I can understand that the first 10 months of parenthood are very trying. He is clearly not well rested, even after he&amp;#39;s woken up for the day. This may be clouding his judgement about the way he can treat you. \nHe may also feel frustration about raising a child because there is no perfect way to do it and there is no right answer. He nitpicks about your parenting because he understands that he cannot be in full control of the child&amp;#39;s development, and that he needs to trust you now more than ever before. This is a challenge and it can make anyone nervous. Maybe he needs to let go of his need for control, just like he needs to let go of his pride and take responsibility for how he treats you. Once he learns to do these things, you can cooperate as parents, make joint decisions, and reconnect as partners who take care of each other and nurture a romantic connection. &lt;/p&gt;\n\n&lt;p&gt;I understand that you&amp;#39;re scared about raising a child to divorced parents. It&amp;#39;s so common now, I think we all fear it. Remember that you two are both learning to be parents together and it takes practice. You&amp;#39;re worn out and weakened now, but if you can address these issues and learn from them, you both can realize strength within one another and push forward. If you need help resolving these issues, I would suggest some form of joint counselling before resorting to divorce, but of course both you and your partner would have to agree to that.&lt;/p&gt;\n\n&lt;p&gt;I hope you can work it out. Best wishes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg8t06t", "score_hidden": false, "stickied": false, "created": 1492176089.0, "created_utc": 1492147289.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65amxf", "likes": null, "replies": "", "user_reports": [], "id": "dg8uapx", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "OscarWilde1854", "parent_id": "t3_65amxf", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I'd say the important thing for you to differentiate is if he has trouble saying he's sorry or if he doesn't *feel* sorry...\n\nIf it's just something he has an issue with (as major as it might be) then it's something you can work through. I sometimes have a hard time apologizing, because it's admitting that I was wrong. I've gotten a *lot* better over the years of my relationship. But there was a time when admitting I was wrong, and admitting I said stupid things, was too much for me. So I just didn't. It was easier to just keep \"being an asshole\" than to feel ashamed openly.\n\nIf he doesn't *feel sorry* then you're right to be concerned. Having no empathy towards your partner and not feeling remorse for treating them poorly isn't something you should overlook. Try and get him to open up more and talk about it. Talk about why he 'can't apologize' and see if it's just something that he has trouble with in every aspect of his life. \n\nBut you're definitely not wrong about being concerned. A relationship is two sided and if he isn't acknowledging that he's hurting you, or he doesn't *care* that he's hurting you, then you need to consider leaving. As much as divorce would suck for your child, living in a home where the father is causing the mother mental anguish can be even more detrimental.\n\nIt isn't a decision to be made lightly though, so make sure you've tried all the avenues to make it work first. See a therapist together, talk it out together, *explain* what's bothering you, tell him that it needs to change. Just make sure the communication is open and then work on the issue together, if possible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d say the important thing for you to differentiate is if he has trouble saying he&amp;#39;s sorry or if he doesn&amp;#39;t &lt;em&gt;feel&lt;/em&gt; sorry...&lt;/p&gt;\n\n&lt;p&gt;If it&amp;#39;s just something he has an issue with (as major as it might be) then it&amp;#39;s something you can work through. I sometimes have a hard time apologizing, because it&amp;#39;s admitting that I was wrong. I&amp;#39;ve gotten a &lt;em&gt;lot&lt;/em&gt; better over the years of my relationship. But there was a time when admitting I was wrong, and admitting I said stupid things, was too much for me. So I just didn&amp;#39;t. It was easier to just keep &amp;quot;being an asshole&amp;quot; than to feel ashamed openly.&lt;/p&gt;\n\n&lt;p&gt;If he doesn&amp;#39;t &lt;em&gt;feel sorry&lt;/em&gt; then you&amp;#39;re right to be concerned. Having no empathy towards your partner and not feeling remorse for treating them poorly isn&amp;#39;t something you should overlook. Try and get him to open up more and talk about it. Talk about why he &amp;#39;can&amp;#39;t apologize&amp;#39; and see if it&amp;#39;s just something that he has trouble with in every aspect of his life. &lt;/p&gt;\n\n&lt;p&gt;But you&amp;#39;re definitely not wrong about being concerned. A relationship is two sided and if he isn&amp;#39;t acknowledging that he&amp;#39;s hurting you, or he doesn&amp;#39;t &lt;em&gt;care&lt;/em&gt; that he&amp;#39;s hurting you, then you need to consider leaving. As much as divorce would suck for your child, living in a home where the father is causing the mother mental anguish can be even more detrimental.&lt;/p&gt;\n\n&lt;p&gt;It isn&amp;#39;t a decision to be made lightly though, so make sure you&amp;#39;ve tried all the avenues to make it work first. See a therapist together, talk it out together, &lt;em&gt;explain&lt;/em&gt; what&amp;#39;s bothering you, tell him that it needs to change. Just make sure the communication is open and then work on the issue together, if possible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg8uapx", "score_hidden": false, "stickied": false, "created": 1492178798.0, "created_utc": 1492149998.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65amxf", "likes": null, "replies": "", "user_reports": [], "id": "dg94bf2", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "RedheadBanshee", "parent_id": "t3_65amxf", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "He's an adult. Adults make choices. He is not forced into anger, he's not forced to choose a particular comment - those are choices. He needs to recognize that he selects his own actions and words. However, you cannot force him to face himself. All you can do is stand your ground and continue to advocate for yourself. \n\nMy husband and I used to really fight terribly. Arguing, screaming, swearing, and it would escalate quickly. We almost ended our marriage several times because it got out of hand so badly. We decided to institute rules about fighting. Here are some of our rules:  1)  Either of us at any time can ask for a \"time-out\" from the other, and it must be recognized. This means when we see a fight coming, one person (or both) can completely stop all discussion and remove themselves from the fight. It is a way of shutting down ALL of it completely. In our last fight, I was incredibly angry and my husband stated he wanted a time-out of this argument. I continued to yell, and he just kept repeating \"I will not engage with you. I am stopping. I want a time-out\" and I did stop and left the room. It gives us time to cool off and get away from each other and clear our heads.   \n\n2)  We are not allowed to curse at each other or about each other. If you want to say \"I am angry that I hate my fucking job!!!\" that is fine, but you can not call *each other* curses. We don't scream fuck you at each other or other curses. Totally wrong, totally against the rules. If that happens - the other person calls them out on it and immediately leaves the room. If it continues, leave the house. The person who *chooses* to curse my apologize and recommit to that rule.\n\n3) We write each other a letter. Fighting is a natural thing to do, but rarely does anything good come out of it, aside from letting off steam. Even if you argue, the end of the argument should result in a written letter to each other outlining what happened, why you are angry, what is upsetting you, and how you want to resolve it. No name calling, no blame, just give the facts. Ask for what you need, apologize for whatever part you played in the fight, ask for an apology also, and give each the letter. Then talk about it after reading. Having a letter, enables you to read about their thoughts and feelings without having them *in your face* yelling. It really, really helps. \n\nI hope some of those tips can help you as you go forward. \nEdit - not sure what happened there LOL", "edited": 1492176452.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s an adult. Adults make choices. He is not forced into anger, he&amp;#39;s not forced to choose a particular comment - those are choices. He needs to recognize that he selects his own actions and words. However, you cannot force him to face himself. All you can do is stand your ground and continue to advocate for yourself. &lt;/p&gt;\n\n&lt;p&gt;My husband and I used to really fight terribly. Arguing, screaming, swearing, and it would escalate quickly. We almost ended our marriage several times because it got out of hand so badly. We decided to institute rules about fighting. Here are some of our rules:  1)  Either of us at any time can ask for a &amp;quot;time-out&amp;quot; from the other, and it must be recognized. This means when we see a fight coming, one person (or both) can completely stop all discussion and remove themselves from the fight. It is a way of shutting down ALL of it completely. In our last fight, I was incredibly angry and my husband stated he wanted a time-out of this argument. I continued to yell, and he just kept repeating &amp;quot;I will not engage with you. I am stopping. I want a time-out&amp;quot; and I did stop and left the room. It gives us time to cool off and get away from each other and clear our heads.   &lt;/p&gt;\n\n&lt;p&gt;2)  We are not allowed to curse at each other or about each other. If you want to say &amp;quot;I am angry that I hate my fucking job!!!&amp;quot; that is fine, but you can not call &lt;em&gt;each other&lt;/em&gt; curses. We don&amp;#39;t scream fuck you at each other or other curses. Totally wrong, totally against the rules. If that happens - the other person calls them out on it and immediately leaves the room. If it continues, leave the house. The person who &lt;em&gt;chooses&lt;/em&gt; to curse my apologize and recommit to that rule.&lt;/p&gt;\n\n&lt;p&gt;3) We write each other a letter. Fighting is a natural thing to do, but rarely does anything good come out of it, aside from letting off steam. Even if you argue, the end of the argument should result in a written letter to each other outlining what happened, why you are angry, what is upsetting you, and how you want to resolve it. No name calling, no blame, just give the facts. Ask for what you need, apologize for whatever part you played in the fight, ask for an apology also, and give each the letter. Then talk about it after reading. Having a letter, enables you to read about their thoughts and feelings without having them &lt;em&gt;in your face&lt;/em&gt; yelling. It really, really helps. &lt;/p&gt;\n\n&lt;p&gt;I hope some of those tips can help you as you go forward. \nEdit - not sure what happened there LOL&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg94bf2", "score_hidden": false, "stickied": false, "created": 1492205046.0, "created_utc": 1492176246.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65amxf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65amxf", "likes": null, "replies": "", "user_reports": [], "id": "dg99baz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "newhampshite", "parent_id": "t1_dg8ss2r", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I was sensing a lot of N from the hubby in this post as well...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was sensing a lot of N from the hubby in this post as well...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg99baz", "score_hidden": false, "stickied": false, "created": 1492211826.0, "created_utc": 1492183026.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ss2r", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "inchwormwrath", "parent_id": "t3_65amxf", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "https://en.wikipedia.org/wiki/Narcissistic_personality_disorder", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Narcissistic_personality_disorder\"&gt;https://en.wikipedia.org/wiki/Narcissistic_personality_disorder&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg8ss2r", "score_hidden": false, "stickied": false, "created": 1492175646.0, "created_utc": 1492146846.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65amxf", "likes": null, "replies": "", "user_reports": [], "id": "dg8udap", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jajskagidaj", "parent_id": "t3_65amxf", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "My wife cannot relate to the fact that I am deeply hurt, by her getting angry with me, when we disagree on any random matter. People that are in love simply don't hurt each other without having remorse and having the urge to say sorry afterwards, should a fallout happen. It is you now, but later on your kids will suffer from it as well.  They will grow up, learning that anger is the legal way of dealing with problems.\n\nI have taught my wife to apologize to our children, if she has been angry and yelled at them. That somehow resonated to her, that kids can get hurt from outbursts og anger. She also say sorry and apologize to me, but the concept of me being hurt by her anger, she still doesn't grasp. We have been together for 20 yrs, and are in a deep crisis, basically because we are not able to communicate without having a fight, where she will be so angry, that she will turn away, and leave it to me to reconcile us. \n\nI am not perfect, but I want to work to improve myself, even if it hurts. Your husband needs to address his issues with anger and the lack og empathy, because he has acquired them before he met you.\n\nI wish you all the best.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My wife cannot relate to the fact that I am deeply hurt, by her getting angry with me, when we disagree on any random matter. People that are in love simply don&amp;#39;t hurt each other without having remorse and having the urge to say sorry afterwards, should a fallout happen. It is you now, but later on your kids will suffer from it as well.  They will grow up, learning that anger is the legal way of dealing with problems.&lt;/p&gt;\n\n&lt;p&gt;I have taught my wife to apologize to our children, if she has been angry and yelled at them. That somehow resonated to her, that kids can get hurt from outbursts og anger. She also say sorry and apologize to me, but the concept of me being hurt by her anger, she still doesn&amp;#39;t grasp. We have been together for 20 yrs, and are in a deep crisis, basically because we are not able to communicate without having a fight, where she will be so angry, that she will turn away, and leave it to me to reconcile us. &lt;/p&gt;\n\n&lt;p&gt;I am not perfect, but I want to work to improve myself, even if it hurts. Your husband needs to address his issues with anger and the lack og empathy, because he has acquired them before he met you.&lt;/p&gt;\n\n&lt;p&gt;I wish you all the best.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg8udap", "score_hidden": false, "stickied": false, "created": 1492178963.0, "created_utc": 1492150163.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65amxf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65amxf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65amxf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65amxf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65amxf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65amxf", "likes": null, "replies": "", "user_reports": [], "id": "dg93hsi", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "celerywife", "parent_id": "t1_dg93gh8", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "lol that's really bad advice though!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol that&amp;#39;s really bad advice though!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg93hsi", "score_hidden": false, "stickied": false, "created": 1492203666.0, "created_utc": 1492174866.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg93gh8", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg92y2f", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg93gh8", "score_hidden": false, "stickied": false, "created": 1492203598.0, "created_utc": 1492174798.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg92y2f", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "celerywife", "parent_id": "t1_dg92usg", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I just want you to know that that blanket statement is not constructive. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just want you to know that that blanket statement is not constructive. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg92y2f", "score_hidden": false, "stickied": false, "created": 1492202660.0, "created_utc": 1492173860.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg92usg", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg92npy", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg92usg", "score_hidden": false, "stickied": false, "created": 1492202490.0, "created_utc": 1492173690.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg92npy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "celerywife", "parent_id": "t1_dg90yk0", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Non native English speaking countries are also capable of having equality in relationships.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Non native English speaking countries are also capable of having equality in relationships.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg92npy", "score_hidden": false, "stickied": false, "created": 1492202116.0, "created_utc": 1492173316.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg90yk0", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65amxf", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dg90yk0", "score_hidden": false, "stickied": false, "created": 1492198329.0, "created_utc": 1492169529.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}]