[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TwoXChromosomes", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just wanted to share this story of something amazing that happened this week. I am a teacher, and it&amp;#39;s moments like this that remind me why I do it.&lt;/p&gt;\n\n&lt;p&gt;Preface- I have an anxiety disorder and a phobia of teeth. It&amp;#39;s stupid and irrational (I feel like it is, anyway), but very, very real for me. While students are aware of the phobia of teeth (I usually use it as an ice breaker), only a few know of my anxiety disorder.&lt;/p&gt;\n\n&lt;p&gt;Story:\nIt has been a long week with a lot of extra stress, so I&amp;#39;m already tightly wound up. Well, a sophomore of mine (who I have a good relationship with) thought it would be funny to prank me by bringing in some deer teeth from a skull he found )I live in a rural area in Idaho) and sprinkle then on my desk. &lt;/p&gt;\n\n&lt;p&gt;While on a normal week I probably could have handled the situation, this week I was already high strung and it triggered a panic attack.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had panic attacks before, and I know how to best handle them for me- which includes walking away from the situation and keeping moving until I regulate my breathing and calm down. This panic attack also had the added joy of uncontrolled sobbing and another class walking past me in the hallway while I was trying to calm down. Super awkward and embarrassed.&lt;/p&gt;\n\n&lt;p&gt;The happy part:\nMy neighbor teacher walked by, recognized what was going on. All I said &amp;quot;teeth on my desk,&amp;quot; and he took charge, went into the room, grabbed a few students, and they lifted every thing on my desk and shook them to make sure they found every tooth.&lt;/p&gt;\n\n&lt;p&gt;An aid who helps one of our students with panic attacks became aware of the situation- he came down and just stood next to me- he didn&amp;#39;t  even say anything, just stood there until I felt comfortable enough to renter the classroom.&lt;/p&gt;\n\n&lt;p&gt;The student who did it felt soooooo bad- he thought I had been exaggerating the phobia and never would have done it if he knew what it would do.&lt;/p&gt;\n\n&lt;p&gt;THE NEXT DAY I started each class with a 10 minute lesson about anxiety disorders, panic attacks, and phobias. The students (Sophomore and Seniors) asked a lot of questions, and I made sure to emphasize that they also have peers who have similar disorders. Two students (in different classes) even raised their hands and came forward about their anxiety disorders! Students were asking then asked about what they&amp;#39;d like done if they have a panic attack- one wanted to be left alone, one wanted to have someone with her at all times.&lt;/p&gt;\n\n&lt;p&gt;By the end of it all, I wanted to cry out of happiness about how my worst experience in school turned into one of the best. I have amazing students! &lt;/p&gt;\n\n&lt;p&gt;😊😊😊&lt;/p&gt;\n\n&lt;p&gt;Edit: word repairs&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I just wanted to share this story of something amazing that happened this week. I am a teacher, and it's moments like this that remind me why I do it.\n\nPreface- I have an anxiety disorder and a phobia of teeth. It's stupid and irrational (I feel like it is, anyway), but very, very real for me. While students are aware of the phobia of teeth (I usually use it as an ice breaker), only a few know of my anxiety disorder.\n\nStory:\nIt has been a long week with a lot of extra stress, so I'm already tightly wound up. Well, a sophomore of mine (who I have a good relationship with) thought it would be funny to prank me by bringing in some deer teeth from a skull he found )I live in a rural area in Idaho) and sprinkle then on my desk. \n\nWhile on a normal week I probably could have handled the situation, this week I was already high strung and it triggered a panic attack.\n\nI've had panic attacks before, and I know how to best handle them for me- which includes walking away from the situation and keeping moving until I regulate my breathing and calm down. This panic attack also had the added joy of uncontrolled sobbing and another class walking past me in the hallway while I was trying to calm down. Super awkward and embarrassed.\n\nThe happy part:\nMy neighbor teacher walked by, recognized what was going on. All I said \"teeth on my desk,\" and he took charge, went into the room, grabbed a few students, and they lifted every thing on my desk and shook them to make sure they found every tooth.\n\nAn aid who helps one of our students with panic attacks became aware of the situation- he came down and just stood next to me- he didn't  even say anything, just stood there until I felt comfortable enough to renter the classroom.\n\nThe student who did it felt soooooo bad- he thought I had been exaggerating the phobia and never would have done it if he knew what it would do.\n\nTHE NEXT DAY I started each class with a 10 minute lesson about anxiety disorders, panic attacks, and phobias. The students (Sophomore and Seniors) asked a lot of questions, and I made sure to emphasize that they also have peers who have similar disorders. Two students (in different classes) even raised their hands and came forward about their anxiety disorders! Students were asking then asked about what they'd like done if they have a panic attack- one wanted to be left alone, one wanted to have someone with her at all times.\n\nBy the end of it all, I wanted to cry out of happiness about how my worst experience in school turned into one of the best. I have amazing students! \n\n😊😊😊\n\nEdit: word repairs", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65l40c", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 19, "report_reasons": null, "author": "ZucchiniMiss", "saved": false, "mod_reports": [], "name": "t3_65l40c", "subreddit_name_prefixed": "r/TwoXChromosomes", "approved_by": null, "over_18": false, "domain": "self.TwoXChromosomes", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r2jt", "edited": 1492289698.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TwoXChromosomes/comments/65l40c/a_horrible_experience_turned_into_something/", "num_reports": null, "locked": false, "stickied": false, "created": 1492315402.0, "url": "https://www.reddit.com/r/TwoXChromosomes/comments/65l40c/a_horrible_experience_turned_into_something/", "author_flair_text": null, "quarantine": false, "title": "A horrible experience turned into something amazing!", "created_utc": 1492286602.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65l40c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65l40c", "likes": null, "replies": "", "user_reports": [], "id": "dgcqtia", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ZucchiniMiss", "parent_id": "t1_dgc1ua5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I've had the phobia for a long time. It may have even started when my teeth were coming out- my mom was pretty aggressive when she tried to pull them. (Ugh- don't want to think about it). \n\nI think I also am just very... vivid... when I imagine tooth- related stuff? Like- if I think about it more than just a moment or two- it's like the situation is happening currently. Does that make sense? \n\nSome times I can keep myself disconnected from it and talk about it without feeling anxious (sort of clinically), but if it happens for too long, it gets overwhelming. \n\nIt doesn't prey on my mind a lot... just in-the-moment. Although it makes for pretty stressful dentist visits... 😞", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had the phobia for a long time. It may have even started when my teeth were coming out- my mom was pretty aggressive when she tried to pull them. (Ugh- don&amp;#39;t want to think about it). &lt;/p&gt;\n\n&lt;p&gt;I think I also am just very... vivid... when I imagine tooth- related stuff? Like- if I think about it more than just a moment or two- it&amp;#39;s like the situation is happening currently. Does that make sense? &lt;/p&gt;\n\n&lt;p&gt;Some times I can keep myself disconnected from it and talk about it without feeling anxious (sort of clinically), but if it happens for too long, it gets overwhelming. &lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t prey on my mind a lot... just in-the-moment. Although it makes for pretty stressful dentist visits... 😞&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcqtia", "score_hidden": false, "stickied": false, "created": 1492413741.0, "created_utc": 1492384941.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1ua5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "-ThievinStealberg-", "parent_id": "t3_65l40c", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I'm glad to hear that everything turned out okay! \n\nHave you always had a phobia of teeth? And is it something that preys on your mind a lot? \nIt's not quite the same, but for as long as I can remember having anxiety issues I've had an irrational fear of death too.  It's something that's on my mind 24/7. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad to hear that everything turned out okay! &lt;/p&gt;\n\n&lt;p&gt;Have you always had a phobia of teeth? And is it something that preys on your mind a lot? \nIt&amp;#39;s not quite the same, but for as long as I can remember having anxiety issues I&amp;#39;ve had an irrational fear of death too.  It&amp;#39;s something that&amp;#39;s on my mind 24/7. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc1ua5", "score_hidden": false, "stickied": false, "created": 1492379880.0, "created_utc": 1492351080.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65l40c", "likes": null, "replies": "", "user_reports": [], "id": "dgc6727", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ohyeahthisawesome", "parent_id": "t3_65l40c", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I have a phobia of teeth, too. It doesn't sound as bad as yours, but I feel you. I have had public panic attacks, too. They are horrible. You handled this amazingly and it's so awesome that you used this as an opportunity to educate your class. Well done! \n\nI love that schools are discussing mental health and self care. It's so important, especially to arm kids with the tools to cope with mental health issues and to have empathy for others who suffer. My kid in grade 1 discussed this at school. It was no big deal when my friend was hospitalized. Kid asked what was wrong with our friend. She was really concerned. I said \"remember when you were learning about mental health? Her mental health wasn't good and she needs some help to fix it.\"  Kid asked some questions and it was no big deal. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a phobia of teeth, too. It doesn&amp;#39;t sound as bad as yours, but I feel you. I have had public panic attacks, too. They are horrible. You handled this amazingly and it&amp;#39;s so awesome that you used this as an opportunity to educate your class. Well done! &lt;/p&gt;\n\n&lt;p&gt;I love that schools are discussing mental health and self care. It&amp;#39;s so important, especially to arm kids with the tools to cope with mental health issues and to have empathy for others who suffer. My kid in grade 1 discussed this at school. It was no big deal when my friend was hospitalized. Kid asked what was wrong with our friend. She was really concerned. I said &amp;quot;remember when you were learning about mental health? Her mental health wasn&amp;#39;t good and she needs some help to fix it.&amp;quot;  Kid asked some questions and it was no big deal. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc6727", "score_hidden": false, "stickied": false, "created": 1492386411.0, "created_utc": 1492357611.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65l40c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65l40c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65l40c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65l40c", "likes": null, "replies": "", "user_reports": [], "id": "dgcqwgj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ZucchiniMiss", "parent_id": "t1_dgbz889", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "No problem! I can talk about it so long as it's in the abstract and I don't focus on the details too much. Thanks for your concern! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No problem! I can talk about it so long as it&amp;#39;s in the abstract and I don&amp;#39;t focus on the details too much. Thanks for your concern! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcqwgj", "score_hidden": false, "stickied": false, "created": 1492413855.0, "created_utc": 1492385055.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbz889", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DriveByScientist", "parent_id": "t1_dgb5r3m", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Thanks for answering!  I didn't want to make you upset by thinking about it but I was really interested.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for answering!  I didn&amp;#39;t want to make you upset by thinking about it but I was really interested.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgbz889", "score_hidden": false, "stickied": false, "created": 1492374589.0, "created_utc": 1492345789.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb5r3m", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ZucchiniMiss", "parent_id": "t1_dgb4g9u", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I think it's from nightmares I've had since I was a child. I have really vivid dreams, and I have had many where my teeth have been ripped out of my mouth, and I've also been chased by monsters with teeth growing out of the side of their faces. \n\nI'm okay with teeth in a person's mouth (that's where they're supposed to be), and I'm also okay with fake teeth (weirdly, dentures are okay). But if I know they're real, it's like all those feelings and horrors hit me over the side of the head, especially when it's unexpected.\n\nI know logically that they're inanimate objects that can't hurt me (albeit a bit gross). But I haven't yet conquered it when they're right there in front of me. \n\nMy kids are at the ages where they're losing their teeth, too. That job is 100% dad. (Or better yet, they come out at school... hahaha)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s from nightmares I&amp;#39;ve had since I was a child. I have really vivid dreams, and I have had many where my teeth have been ripped out of my mouth, and I&amp;#39;ve also been chased by monsters with teeth growing out of the side of their faces. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m okay with teeth in a person&amp;#39;s mouth (that&amp;#39;s where they&amp;#39;re supposed to be), and I&amp;#39;m also okay with fake teeth (weirdly, dentures are okay). But if I know they&amp;#39;re real, it&amp;#39;s like all those feelings and horrors hit me over the side of the head, especially when it&amp;#39;s unexpected.&lt;/p&gt;\n\n&lt;p&gt;I know logically that they&amp;#39;re inanimate objects that can&amp;#39;t hurt me (albeit a bit gross). But I haven&amp;#39;t yet conquered it when they&amp;#39;re right there in front of me. &lt;/p&gt;\n\n&lt;p&gt;My kids are at the ages where they&amp;#39;re losing their teeth, too. That job is 100% dad. (Or better yet, they come out at school... hahaha)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgb5r3m", "score_hidden": false, "stickied": false, "created": 1492318359.0, "created_utc": 1492289559.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb4g9u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DriveByScientist", "parent_id": "t3_65l40c", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Can I ask if you can identify how your phobia of teeth started?  Did something in particular happen or are they just scary in general?\n\nI'm sorry that happened and I'm glad it turned into a teaching moment!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can I ask if you can identify how your phobia of teeth started?  Did something in particular happen or are they just scary in general?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry that happened and I&amp;#39;m glad it turned into a teaching moment!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgb4g9u", "score_hidden": false, "stickied": false, "created": 1492316594.0, "created_utc": 1492287794.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]