[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TwoXChromosomes", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65oi2t", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2100, "report_reasons": null, "author": "loremipsumchecksum", "saved": false, "mod_reports": [], "name": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "approved_by": null, "over_18": false, "domain": "businessinsider.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r2jt", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/TwoXChromosomes/comments/65oi2t/why_is_it_your_right_to_take_away_my_right_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492367273.0, "url": "http://www.businessinsider.com/teenager-rips-republican-senator-jeff-flake-over-planned-parenthood-2017-4?r=US&amp;IR=T", "author_flair_text": null, "quarantine": false, "title": "'Why is it your right to take away my right to choose?': Teenager slams top Republican senator during town hall", "created_utc": 1492338473.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 825, "visited": false, "subreddit_type": "public", "ups": 2100}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcr3ls", "gilded": 0, "archived": false, "score": 104, "report_reasons": null, "author": "JSizzleSlice", "parent_id": "t1_dgcphvq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Thank you. \nThis is the most blatant part of this issue that is ignored. People against PP act like it is an abortion factory. It provides access to knowledge, resources and treatment that no one else cares to provide and it's made affordable. They do std panels and provide contraceptives which protect us.  You may think you owe nothing to PP because you've never been there or had an abortion, but chances are you've benefited from a partner who had been tested, or learned about responsible sex because they came in in an std scare.  Without them, many people wouldn't know if they were  infected and might have given you something before they realized and you'd both be selling treatment. Not to mention,  contraceptives are the best way to reduce abortions, if that's actually what this is about. \n\nIt's just sad because people try to distill this down to 1 issue, 1 facet and they've done an amazing job promoting that and it's fucking up shop for everyone.  You can completely benefit from PP and still not support abortions and there is no reason that they should be designated as 'optional' for funding among our institutions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. \nThis is the most blatant part of this issue that is ignored. People against PP act like it is an abortion factory. It provides access to knowledge, resources and treatment that no one else cares to provide and it&amp;#39;s made affordable. They do std panels and provide contraceptives which protect us.  You may think you owe nothing to PP because you&amp;#39;ve never been there or had an abortion, but chances are you&amp;#39;ve benefited from a partner who had been tested, or learned about responsible sex because they came in in an std scare.  Without them, many people wouldn&amp;#39;t know if they were  infected and might have given you something before they realized and you&amp;#39;d both be selling treatment. Not to mention,  contraceptives are the best way to reduce abortions, if that&amp;#39;s actually what this is about. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just sad because people try to distill this down to 1 issue, 1 facet and they&amp;#39;ve done an amazing job promoting that and it&amp;#39;s fucking up shop for everyone.  You can completely benefit from PP and still not support abortions and there is no reason that they should be designated as &amp;#39;optional&amp;#39; for funding among our institutions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcr3ls", "score_hidden": false, "stickied": false, "created": 1492414128.0, "created_utc": 1492385328.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 104}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgd1fa7", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "jetogill", "parent_id": "t1_dgcphvq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Basically it's a belief that women should not be able to have sex for pleasure.   I've made this argument repeatedly, if you truly believe abortion is murder then to should be shoveling money Into planned parenthood and local health departments to provide sex education  and contraception.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Basically it&amp;#39;s a belief that women should not be able to have sex for pleasure.   I&amp;#39;ve made this argument repeatedly, if you truly believe abortion is murder then to should be shoveling money Into planned parenthood and local health departments to provide sex education  and contraception.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgd1fa7", "score_hidden": false, "stickied": false, "created": 1492428187.0, "created_utc": 1492399387.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcwdbj", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "thenewtbaron", "parent_id": "t1_dgcvrco", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "exactly.\n\nbirth control is an easy and cheap way to make sure that people are prepared for children. no one is forced to use it. I as a dude will never need a gyno examine, I won't need a mammogram.....\n\na cheap and easy way to make sure that women won't have children unless they want one... is great for everyone.\n\nfor the insurance, for the other people on insurance, for the child.\n\nhell, i'd love to be able to say, \"hey, I am a dude with no children and I don't want to pay school tax\" isn't right... but, hey, I don't have kids, I have made that choice... so, wouldn't it be republican for me to not pay for anything child related.. but then they say, \"for the greater good\"... bro.... If a woman doesn't want to get pregnant, I'd be down for putting one of those implants in that stop birth for years...\n\nI don't like abortion. I hate that it has to exist. However, abortion is the symptom, not the cause of the problem. You want more women to not have abortions... you give them proper and honest sexual education, you give them affordable and useful birth control, and then, if those don't work, you give those that have those children proper help with raising that child.\n\nyou'd think that non-abortive birth control would be what every republican/pro-life person would be pushing for to stop abortion. but nah, let's keep all that shit secret.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;exactly.&lt;/p&gt;\n\n&lt;p&gt;birth control is an easy and cheap way to make sure that people are prepared for children. no one is forced to use it. I as a dude will never need a gyno examine, I won&amp;#39;t need a mammogram.....&lt;/p&gt;\n\n&lt;p&gt;a cheap and easy way to make sure that women won&amp;#39;t have children unless they want one... is great for everyone.&lt;/p&gt;\n\n&lt;p&gt;for the insurance, for the other people on insurance, for the child.&lt;/p&gt;\n\n&lt;p&gt;hell, i&amp;#39;d love to be able to say, &amp;quot;hey, I am a dude with no children and I don&amp;#39;t want to pay school tax&amp;quot; isn&amp;#39;t right... but, hey, I don&amp;#39;t have kids, I have made that choice... so, wouldn&amp;#39;t it be republican for me to not pay for anything child related.. but then they say, &amp;quot;for the greater good&amp;quot;... bro.... If a woman doesn&amp;#39;t want to get pregnant, I&amp;#39;d be down for putting one of those implants in that stop birth for years...&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t like abortion. I hate that it has to exist. However, abortion is the symptom, not the cause of the problem. You want more women to not have abortions... you give them proper and honest sexual education, you give them affordable and useful birth control, and then, if those don&amp;#39;t work, you give those that have those children proper help with raising that child.&lt;/p&gt;\n\n&lt;p&gt;you&amp;#39;d think that non-abortive birth control would be what every republican/pro-life person would be pushing for to stop abortion. but nah, let&amp;#39;s keep all that shit secret.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcwdbj", "score_hidden": false, "stickied": false, "created": 1492421143.0, "created_utc": 1492392343.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcvrco", "gilded": 0, "archived": false, "score": 56, "report_reasons": null, "author": "YoshiKoshi", "parent_id": "t1_dgcqvd4", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Somehow they think that insurance shouldn't cover birth control because not everyone needs it and some people, like men and women past child bearing age, will never use it. \n\nBut somehow this never applies to any other medical treatment. My health insurance covers prostate care and sickle cell anemia, despite the fact that I'm a Caucasian woman. I will never have a prostate problem or develop sickle cell anemia. \n\nThey claim their religious beliefs mean they shouldn't have to pay for insurance that covers birth control, but it doesn't bother them in the slightest that Hindus pay for insurance that covers bovine-derived insulin, Jews and Muslims pay for insurance that covers Armour Thyroid (made from pigs) and Jehovah's Witnesses pay for insurance that covers blood transfusions. \n\nTheir concerns about people paying for coverage for conditions they couldn't ever have, and paying for things that are contrary to their religious beliefs, starts and ends with reproductive health care for women. \nThis isn't about a principle. If it was about a principle, they would be talking about all the ways their principles are violated. But they don't. They only have this \"principle\" when it involves reproductive health care for women. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Somehow they think that insurance shouldn&amp;#39;t cover birth control because not everyone needs it and some people, like men and women past child bearing age, will never use it. &lt;/p&gt;\n\n&lt;p&gt;But somehow this never applies to any other medical treatment. My health insurance covers prostate care and sickle cell anemia, despite the fact that I&amp;#39;m a Caucasian woman. I will never have a prostate problem or develop sickle cell anemia. &lt;/p&gt;\n\n&lt;p&gt;They claim their religious beliefs mean they shouldn&amp;#39;t have to pay for insurance that covers birth control, but it doesn&amp;#39;t bother them in the slightest that Hindus pay for insurance that covers bovine-derived insulin, Jews and Muslims pay for insurance that covers Armour Thyroid (made from pigs) and Jehovah&amp;#39;s Witnesses pay for insurance that covers blood transfusions. &lt;/p&gt;\n\n&lt;p&gt;Their concerns about people paying for coverage for conditions they couldn&amp;#39;t ever have, and paying for things that are contrary to their religious beliefs, starts and ends with reproductive health care for women. \nThis isn&amp;#39;t about a principle. If it was about a principle, they would be talking about all the ways their principles are violated. But they don&amp;#39;t. They only have this &amp;quot;principle&amp;quot; when it involves reproductive health care for women. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcvrco", "score_hidden": false, "stickied": false, "created": 1492420378.0, "created_utc": 1492391578.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 56}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqvd4", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "thenewtbaron", "parent_id": "t1_dgcpzgd", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I think the problem lies in the fact that women with medical insurance want their birth control covered.\n\nThe big stink a few years ago about \"the only pill women need is an aspirin between their knees\" or limbaugh's \"joke\" about having to pop birth control every time the woman has sex is kinda part of that. The woman rush was talking about was a woman, who had insurance... wanted that insurance to cover a very common and cheap medication. The insurance was already covering other medications.\n\nIn those cases, it wasn't about everyone one being forced to pay for those medications... it was, companies didn't want to have those as part of the fomulary.\n\nor even the hobby lobby stuff, their deeply held belief was about \"abortions\" and such.. however the medication they were against was not an abortive medication. it was standard hormone stuff.\n\nwhen birth control can be given over the counter... find, but for the most part.. you have to visit a doctor and you have to get an rx. If you have medical insurance, they should have normal medications on the list. Which includes a medication that many people take.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the problem lies in the fact that women with medical insurance want their birth control covered.&lt;/p&gt;\n\n&lt;p&gt;The big stink a few years ago about &amp;quot;the only pill women need is an aspirin between their knees&amp;quot; or limbaugh&amp;#39;s &amp;quot;joke&amp;quot; about having to pop birth control every time the woman has sex is kinda part of that. The woman rush was talking about was a woman, who had insurance... wanted that insurance to cover a very common and cheap medication. The insurance was already covering other medications.&lt;/p&gt;\n\n&lt;p&gt;In those cases, it wasn&amp;#39;t about everyone one being forced to pay for those medications... it was, companies didn&amp;#39;t want to have those as part of the fomulary.&lt;/p&gt;\n\n&lt;p&gt;or even the hobby lobby stuff, their deeply held belief was about &amp;quot;abortions&amp;quot; and such.. however the medication they were against was not an abortive medication. it was standard hormone stuff.&lt;/p&gt;\n\n&lt;p&gt;when birth control can be given over the counter... find, but for the most part.. you have to visit a doctor and you have to get an rx. If you have medical insurance, they should have normal medications on the list. Which includes a medication that many people take.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcqvd4", "score_hidden": false, "stickied": false, "created": 1492413813.0, "created_utc": 1492385013.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 58}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcsjir", "gilded": 0, "archived": false, "score": 76, "report_reasons": null, "author": "JSizzleSlice", "parent_id": "t1_dgcpzgd", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I have heard this a lot in the last few years and it is so flimsy it's amazing how often people point to it like it holds water.\n\nPeople shouldn't pay for they don't agree with? Cool, because I'm opposed to the war. [Which makes me automatically 'anti-patriotic' and apparently I'm against the troops, too, which is weird because I thought I was against the people who were sending them to die.] So I shouldn't have my taxes pay into the billions we just dropped on our already bloated military budget? I neither want nor agree with the war, but i certainly have been forced to pay for it.  What about my beliefs? I also like the environment but despite my beliefs or a consensus of scientists, we are dismantling our already limited system of environmental protection. So not only am i paying for something i am against, I'm not paying for something I'm for.\n\nYour argument 'they simply don't want to be forced to pay for something they neither want nor agree with' is not a valid argument for why they shouldn't have to pay because of their feelings, but oh believe me,  i know it sucks. If YOU get a choice, we ALL do.", "edited": 1492387457.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have heard this a lot in the last few years and it is so flimsy it&amp;#39;s amazing how often people point to it like it holds water.&lt;/p&gt;\n\n&lt;p&gt;People shouldn&amp;#39;t pay for they don&amp;#39;t agree with? Cool, because I&amp;#39;m opposed to the war. [Which makes me automatically &amp;#39;anti-patriotic&amp;#39; and apparently I&amp;#39;m against the troops, too, which is weird because I thought I was against the people who were sending them to die.] So I shouldn&amp;#39;t have my taxes pay into the billions we just dropped on our already bloated military budget? I neither want nor agree with the war, but i certainly have been forced to pay for it.  What about my beliefs? I also like the environment but despite my beliefs or a consensus of scientists, we are dismantling our already limited system of environmental protection. So not only am i paying for something i am against, I&amp;#39;m not paying for something I&amp;#39;m for.&lt;/p&gt;\n\n&lt;p&gt;Your argument &amp;#39;they simply don&amp;#39;t want to be forced to pay for something they neither want nor agree with&amp;#39; is not a valid argument for why they shouldn&amp;#39;t have to pay because of their feelings, but oh believe me,  i know it sucks. If YOU get a choice, we ALL do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcsjir", "score_hidden": false, "stickied": false, "created": 1492416065.0, "created_utc": 1492387265.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 76}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcvuc7", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "SeeBaitClick", "parent_id": "t1_dgcufmi", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "It's a useful political football to keep a part of the base energized. The GOP is a coalition of one issue voters, heavily compromised morally, but highly effective politically. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a useful political football to keep a part of the base energized. The GOP is a coalition of one issue voters, heavily compromised morally, but highly effective politically. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcvuc7", "score_hidden": false, "stickied": false, "created": 1492420484.0, "created_utc": 1492391684.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcufmi", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "CuddlePirate420", "parent_id": "t1_dgcpzgd", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt; \"Let's not make everyone pay for things that only some people want, if we can avoid it.\"\n\nThere are lots of things that fit that criteria.  Why is this the only issue they ever seem to care about?  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Let&amp;#39;s not make everyone pay for things that only some people want, if we can avoid it.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There are lots of things that fit that criteria.  Why is this the only issue they ever seem to care about?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcufmi", "score_hidden": false, "stickied": false, "created": 1492418631.0, "created_utc": 1492389831.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgd2cyr", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "JDubsOchoCinco", "parent_id": "t1_dgcpzgd", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "If I have insurance that covers birth control 100% (as per the ACA) then no one pays for my birth control but me. If I am on Medicaid and I go to PP to get birth control, it's entirely possible that I have polycystic ovary syndrome, acne, incredibly bad PMS, or some other condition which can be controlled or corrected through the use of hormonal birth control.And, as a woman whose doctor has essentially told her not to have more children, I would argue that my IUD is medically necessary as I could actually die if I get pregnant again. So whether it's covered by my personal health insurance or Medicare certainly becomes irrelevant. And the reason behind my IUD, or the birth control pill, or a tubal ligation, is literally none of your, or any Republican's, damn business. \n\nFurthermore, as Medicare covers erectile dysfunction drugs, one could make the argument that Republicans not wanting to cover hormonal birth control actually IS about women and controlling their sexuality and their bodies. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I have insurance that covers birth control 100% (as per the ACA) then no one pays for my birth control but me. If I am on Medicaid and I go to PP to get birth control, it&amp;#39;s entirely possible that I have polycystic ovary syndrome, acne, incredibly bad PMS, or some other condition which can be controlled or corrected through the use of hormonal birth control.And, as a woman whose doctor has essentially told her not to have more children, I would argue that my IUD is medically necessary as I could actually die if I get pregnant again. So whether it&amp;#39;s covered by my personal health insurance or Medicare certainly becomes irrelevant. And the reason behind my IUD, or the birth control pill, or a tubal ligation, is literally none of your, or any Republican&amp;#39;s, damn business. &lt;/p&gt;\n\n&lt;p&gt;Furthermore, as Medicare covers erectile dysfunction drugs, one could make the argument that Republicans not wanting to cover hormonal birth control actually IS about women and controlling their sexuality and their bodies. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgd2cyr", "score_hidden": false, "stickied": false, "created": 1492429578.0, "created_utc": 1492400778.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcxayh", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "misspiggie", "parent_id": "t1_dgcpzgd", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt; In the context of birth control, they simply don't want to be forced to pay for something that they neither want nor agree with. \n\nI can't tell if you personally agree with this idea, but I'll respond anyway. It takes much less money to prevent a pregnancy than to pay for welfare, food stamps, foster care, mental health care, and more resources for unwanted children. That small cost for birth control prevents a costly abortion and an even costlier human being.\n\nAmericans don't live in personal private islands where they get to pay for just the things they think apply to them, and there are more prevented costs with public health policies than one might think. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In the context of birth control, they simply don&amp;#39;t want to be forced to pay for something that they neither want nor agree with. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I can&amp;#39;t tell if you personally agree with this idea, but I&amp;#39;ll respond anyway. It takes much less money to prevent a pregnancy than to pay for welfare, food stamps, foster care, mental health care, and more resources for unwanted children. That small cost for birth control prevents a costly abortion and an even costlier human being.&lt;/p&gt;\n\n&lt;p&gt;Americans don&amp;#39;t live in personal private islands where they get to pay for just the things they think apply to them, and there are more prevented costs with public health policies than one might think. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcxayh", "score_hidden": false, "stickied": false, "created": 1492422392.0, "created_utc": 1492393592.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcuq57", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "IceWaves", "parent_id": "t1_dgcpzgd", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Yes, except they've SO demonized birth control that they don't want it covered under any circumstances, including the valid medical reasons birth control needs to be prescribed: endometriosis, PCOS, PMDD, etc. that over 35% of women have.\n\nSo those 35% of women get fucked over. While if a guy gets limp dick, they throw free viagra at him like beads at mardi gras.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, except they&amp;#39;ve SO demonized birth control that they don&amp;#39;t want it covered under any circumstances, including the valid medical reasons birth control needs to be prescribed: endometriosis, PCOS, PMDD, etc. that over 35% of women have.&lt;/p&gt;\n\n&lt;p&gt;So those 35% of women get fucked over. While if a guy gets limp dick, they throw free viagra at him like beads at mardi gras.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcuq57", "score_hidden": false, "stickied": false, "created": 1492419022.0, "created_utc": 1492390222.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgd5xxq", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "HervorTheElder", "parent_id": "t1_dgcpzgd", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt;  they simply don't want to be forced to pay for something that they neither want nor agree with.\n\nHey, I don't want or need a lot of medical procedures, let's get rid of coverage for those too! Got diabetes? Heart problems? Cancer? Erectile dysfunction? Not my problem, amirite guys?!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;they simply don&amp;#39;t want to be forced to pay for something that they neither want nor agree with.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Hey, I don&amp;#39;t want or need a lot of medical procedures, let&amp;#39;s get rid of coverage for those too! Got diabetes? Heart problems? Cancer? Erectile dysfunction? Not my problem, amirite guys?!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgd5xxq", "score_hidden": false, "stickied": false, "created": 1492436009.0, "created_utc": 1492407209.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcudhz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Hugh_Betcha_1984", "parent_id": "t1_dgcpzgd", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Yeah, I can understand people not wanting to pay for things they don't use, like billions of dollars for defence, and paying for health care or funerals for people shot by (legal) weapons.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I can understand people not wanting to pay for things they don&amp;#39;t use, like billions of dollars for defence, and paying for health care or funerals for people shot by (legal) weapons.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcudhz", "score_hidden": false, "stickied": false, "created": 1492418553.0, "created_utc": 1492389753.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcund0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SoldierZulu", "parent_id": "t1_dgcpzgd", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "But that is absolutely not the position they've taken. It feels like you're trying to translate for a group that doesn't need translation; it doesn't take much searching to find plenty of evidence that they want to control all aspects of sex (through controlling how and when women can do it, as well as adding nebulous 'consequences'), and there is a book that tells them not only are they allowed to but that they should. The \"I don't want to pay for anything\" position may be legit for some people, but let's not pretend that's the main reason.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But that is absolutely not the position they&amp;#39;ve taken. It feels like you&amp;#39;re trying to translate for a group that doesn&amp;#39;t need translation; it doesn&amp;#39;t take much searching to find plenty of evidence that they want to control all aspects of sex (through controlling how and when women can do it, as well as adding nebulous &amp;#39;consequences&amp;#39;), and there is a book that tells them not only are they allowed to but that they should. The &amp;quot;I don&amp;#39;t want to pay for anything&amp;quot; position may be legit for some people, but let&amp;#39;s not pretend that&amp;#39;s the main reason.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcund0", "score_hidden": false, "stickied": false, "created": 1492418914.0, "created_utc": 1492390114.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgdk39e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "itsnotbrexit", "parent_id": "t1_dgcpzgd", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "dude, i respect your arguments (and think they are mostly correct) but this meme of \"republicans don't want to control....\" is just bullshit and ignores a whole history of the right's attempts to control women's sexuality and access to birth control.\n\nPlease recall that ACCESS to birth control only became a constitutional issue in the U.S. in 1965 (griswold v. connecticut) wherein the state was attempting to make contraceptives illegal.  The right has a storied history of attempting to limit and control sexuality.\n\nRepublicans aren't some totally logically consistent group of \"small-government!\"-minded folks.  The religious right, which is a large portion of the right, does want to impose their morality on others. This is control (see, e.g., the right's issues with: prohibition, schools, contraceptives, other  vices, interracial and other \"non-traditional\" types of marriage, etc.).\n\nI agree that the semantics of the abortion argument are stupid and we should acknowledge that it really is the killing of proto-babies but let's not give the right too much credit, here, for logical consistency, which is largely absent from their positions (e.g., life is sacred but the death penalty is totally kosher).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;dude, i respect your arguments (and think they are mostly correct) but this meme of &amp;quot;republicans don&amp;#39;t want to control....&amp;quot; is just bullshit and ignores a whole history of the right&amp;#39;s attempts to control women&amp;#39;s sexuality and access to birth control.&lt;/p&gt;\n\n&lt;p&gt;Please recall that ACCESS to birth control only became a constitutional issue in the U.S. in 1965 (griswold v. connecticut) wherein the state was attempting to make contraceptives illegal.  The right has a storied history of attempting to limit and control sexuality.&lt;/p&gt;\n\n&lt;p&gt;Republicans aren&amp;#39;t some totally logically consistent group of &amp;quot;small-government!&amp;quot;-minded folks.  The religious right, which is a large portion of the right, does want to impose their morality on others. This is control (see, e.g., the right&amp;#39;s issues with: prohibition, schools, contraceptives, other  vices, interracial and other &amp;quot;non-traditional&amp;quot; types of marriage, etc.).&lt;/p&gt;\n\n&lt;p&gt;I agree that the semantics of the abortion argument are stupid and we should acknowledge that it really is the killing of proto-babies but let&amp;#39;s not give the right too much credit, here, for logical consistency, which is largely absent from their positions (e.g., life is sacred but the death penalty is totally kosher).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdk39e", "score_hidden": false, "stickied": false, "created": 1492468852.0, "created_utc": 1492440052.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcpzgd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Bebinpo", "parent_id": "t1_dgcphvq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "&gt; For instance, access to contraceptives. There's no unborn child to talk about here. It's just straight up restricting someone else's choices about their body because of your religious beliefs.\n\nRepublicans no more want to control women by virtue of not buying them birth control than they want to control men by not buying them condoms. In fact, the whole crux of that position lies in the fact that the Republican Party, by and large, doesn't want to control people. There are exceptions to this (gay marriage, marijuana legalization) which stem from \"tradition\" which I think are total bullshit, but the general theme of the Republican Party can be boiled down to \"Let's not make everyone pay for things that only some people want, if we can avoid it.\"\n\nIn the context of birth control, they simply don't want to be forced to pay for something that they neither want nor agree with. Women are absolutely free to buy their *own* birth control. It's not an unreasonable position, and the idea that any position that doesn't endorse buying stuff for women is automatically anti-women is total BS. It's not anti-women, it's anti--buying-stuff.", "edited": 1492384196.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;For instance, access to contraceptives. There&amp;#39;s no unborn child to talk about here. It&amp;#39;s just straight up restricting someone else&amp;#39;s choices about their body because of your religious beliefs.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Republicans no more want to control women by virtue of not buying them birth control than they want to control men by not buying them condoms. In fact, the whole crux of that position lies in the fact that the Republican Party, by and large, doesn&amp;#39;t want to control people. There are exceptions to this (gay marriage, marijuana legalization) which stem from &amp;quot;tradition&amp;quot; which I think are total bullshit, but the general theme of the Republican Party can be boiled down to &amp;quot;Let&amp;#39;s not make everyone pay for things that only some people want, if we can avoid it.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;In the context of birth control, they simply don&amp;#39;t want to be forced to pay for something that they neither want nor agree with. Women are absolutely free to buy their &lt;em&gt;own&lt;/em&gt; birth control. It&amp;#39;s not an unreasonable position, and the idea that any position that doesn&amp;#39;t endorse buying stuff for women is automatically anti-women is total BS. It&amp;#39;s not anti-women, it&amp;#39;s anti--buying-stuff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcpzgd", "score_hidden": false, "stickied": false, "created": 1492412583.0, "created_utc": 1492383783.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcwxr4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Thugpendulum", "parent_id": "t1_dgcphvq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Access to contraceptives does lead to unborn children, just sayin.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Access to contraceptives does lead to unborn children, just sayin.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcwxr4", "score_hidden": false, "stickied": false, "created": 1492421890.0, "created_utc": 1492393090.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcphvq", "gilded": 0, "archived": false, "score": 259, "report_reasons": null, "author": "shinazueli", "parent_id": "t1_dgcm10a", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Right.  If you look at *just* abortion, you could make that argument fairly. \n\nAnd the other policies and beliefs that are dearly held by the Republican party *just* so happen to amount to depriving full grown women autonomy over their own bodies. \n\nFor instance, access to contraceptives. There's no unborn child to talk about here. It's just straight up restricting someone else's choices about their body because of your religious beliefs. \n\nTaken together, the policy of the Republican party **can** be fairly boiled down to: we want control over female bodies.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right.  If you look at &lt;em&gt;just&lt;/em&gt; abortion, you could make that argument fairly. &lt;/p&gt;\n\n&lt;p&gt;And the other policies and beliefs that are dearly held by the Republican party &lt;em&gt;just&lt;/em&gt; so happen to amount to depriving full grown women autonomy over their own bodies. &lt;/p&gt;\n\n&lt;p&gt;For instance, access to contraceptives. There&amp;#39;s no unborn child to talk about here. It&amp;#39;s just straight up restricting someone else&amp;#39;s choices about their body because of your religious beliefs. &lt;/p&gt;\n\n&lt;p&gt;Taken together, the policy of the Republican party &lt;strong&gt;can&lt;/strong&gt; be fairly boiled down to: we want control over female bodies.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcphvq", "score_hidden": false, "stickied": false, "created": 1492411911.0, "created_utc": 1492383111.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 259}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrwgr", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "Equipoisonous", "parent_id": "t1_dgcm10a", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt; Like... they understand it. I promise, they get it, it's not like they just never bothered to think about the alternative before. \n\nI think there are plenty of Republicans that have literally never bothered to think much about it: [\"It's a question I've never even thought about\"](https://www.youtube.com/watch?v=xBKieGz5QiM#t=0m33s)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Like... they understand it. I promise, they get it, it&amp;#39;s not like they just never bothered to think about the alternative before. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think there are plenty of Republicans that have literally never bothered to think much about it: &lt;a href=\"https://www.youtube.com/watch?v=xBKieGz5QiM#t=0m33s\"&gt;&amp;quot;It&amp;#39;s a question I&amp;#39;ve never even thought about&amp;quot;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcrwgr", "score_hidden": false, "stickied": false, "created": 1492415194.0, "created_utc": 1492386394.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcx78u", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "YoshiKoshi", "parent_id": "t1_dgcsinp", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This is one of the most frustrating things about forced-birthers; they act as if pregnancy and childbirth are no more involved or taxing than a trip to the grocery store. They ignore all the possible complications (including death) of pregnancy and childbirth, ignore the fact that a woman might already have medical conditions that make pregnancy inadvisable. They completely dismiss the entire concept that pregnancy and childbirth can have any impact on a woman's health. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is one of the most frustrating things about forced-birthers; they act as if pregnancy and childbirth are no more involved or taxing than a trip to the grocery store. They ignore all the possible complications (including death) of pregnancy and childbirth, ignore the fact that a woman might already have medical conditions that make pregnancy inadvisable. They completely dismiss the entire concept that pregnancy and childbirth can have any impact on a woman&amp;#39;s health. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcx78u", "score_hidden": false, "stickied": false, "created": 1492422251.0, "created_utc": 1492393451.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcwrsg", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Darth_Innovader", "parent_id": "t1_dgcuwco", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Plus after that it costs all your money for a couple decades ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Plus after that it costs all your money for a couple decades &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcwrsg", "score_hidden": false, "stickied": false, "created": 1492421669.0, "created_utc": 1492392869.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcuwco", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "IceWaves", "parent_id": "t1_dgcslnp", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Plus it costs like 20k if you're going to a hospital and there are any, even small, complications.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Plus it costs like 20k if you&amp;#39;re going to a hospital and there are any, even small, complications.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcuwco", "score_hidden": false, "stickied": false, "created": 1492419253.0, "created_utc": 1492390453.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcslnp", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Bebinpo", "parent_id": "t1_dgcsinp", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Yep, another good point. The process of giving birth in itself isn't risk free, and it can permanently change a woman's body (and mental health) in some pretty serious ways. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, another good point. The process of giving birth in itself isn&amp;#39;t risk free, and it can permanently change a woman&amp;#39;s body (and mental health) in some pretty serious ways. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcslnp", "score_hidden": false, "stickied": false, "created": 1492416149.0, "created_utc": 1492387349.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcsinp", "gilded": 0, "archived": false, "score": 37, "report_reasons": null, "author": "piperckles96", "parent_id": "t1_dgcrpqd", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I feel like people always forget about the actual giving birth process. By forcing a woman to remain pregnant you are also forcing her to give birth. I am a labour nurse. You are forcing a woman to endure all the risks and discomforts of pregnancy and then forcing her to literally risk her life and experience excruciating pain REGARDLESS of whether she chooses to raise the child. It isn't just about convenience. Do you know how hard it is to comfort a woman in labour? Have you ever tried to comfort a woman in labour who was pregnant against their own will? Sometimes you tear from vagina to asshole. Childbirth basically always involves one or multiple people's fingers and hands in a woman's vagina. Sorry to freak out the pregnant people of this world but I'm not exaggerating. Imagine forcing someone to go through that against their will. To me it would be comparable to rape. I've had to care for a young girl whose mother wouldn't let her get an abortion. It wasn't fucking pleasant. I'd like to never do it again. ", "edited": 1492387470.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like people always forget about the actual giving birth process. By forcing a woman to remain pregnant you are also forcing her to give birth. I am a labour nurse. You are forcing a woman to endure all the risks and discomforts of pregnancy and then forcing her to literally risk her life and experience excruciating pain REGARDLESS of whether she chooses to raise the child. It isn&amp;#39;t just about convenience. Do you know how hard it is to comfort a woman in labour? Have you ever tried to comfort a woman in labour who was pregnant against their own will? Sometimes you tear from vagina to asshole. Childbirth basically always involves one or multiple people&amp;#39;s fingers and hands in a woman&amp;#39;s vagina. Sorry to freak out the pregnant people of this world but I&amp;#39;m not exaggerating. Imagine forcing someone to go through that against their will. To me it would be comparable to rape. I&amp;#39;ve had to care for a young girl whose mother wouldn&amp;#39;t let her get an abortion. It wasn&amp;#39;t fucking pleasant. I&amp;#39;d like to never do it again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcsinp", "score_hidden": false, "stickied": false, "created": 1492416033.0, "created_utc": 1492387233.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 37}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd9nf0", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Dack_Blick", "parent_id": "t1_dgcwvyf", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Ah, I see. You don't want to even discuss the issue. That's fine. You shouldn't post about it online then.\n\nAnd your logic is still flawed, as there are such things as other human beings. Ever hear of a thing called adoption?\n\nKeep in mind; I do indeed support a women's right to have an abortion. It is your reasoning for it that I think is wrong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah, I see. You don&amp;#39;t want to even discuss the issue. That&amp;#39;s fine. You shouldn&amp;#39;t post about it online then.&lt;/p&gt;\n\n&lt;p&gt;And your logic is still flawed, as there are such things as other human beings. Ever hear of a thing called adoption?&lt;/p&gt;\n\n&lt;p&gt;Keep in mind; I do indeed support a women&amp;#39;s right to have an abortion. It is your reasoning for it that I think is wrong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgd9nf0", "score_hidden": false, "stickied": false, "created": 1492444961.0, "created_utc": 1492416161.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcwvyf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aidentity", "parent_id": "t1_dgcw3oo", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Actually we pop out half baked.  Without nurturing no child survives.\n\nMy logic challenges your preconceptions about who's will is paramount.  An actual living person, vs the potential for one.\n\nMaybe keep your opinion to yourself where it harms no actual people.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually we pop out half baked.  Without nurturing no child survives.&lt;/p&gt;\n\n&lt;p&gt;My logic challenges your preconceptions about who&amp;#39;s will is paramount.  An actual living person, vs the potential for one.&lt;/p&gt;\n\n&lt;p&gt;Maybe keep your opinion to yourself where it harms no actual people.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcwvyf", "score_hidden": false, "stickied": false, "created": 1492421823.0, "created_utc": 1492393023.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcw3oo", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Dack_Blick", "parent_id": "t1_dgcsvl2", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Just going to say your entire reasoning is flawed, as it hinges on the idea that a collection of cells will not grow into another human, just so long as the woman doesn't consider herself a mother.\n\n\nThis is, of course, totally wrong. The baby will grow whether she wants to be a mother or not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just going to say your entire reasoning is flawed, as it hinges on the idea that a collection of cells will not grow into another human, just so long as the woman doesn&amp;#39;t consider herself a mother.&lt;/p&gt;\n\n&lt;p&gt;This is, of course, totally wrong. The baby will grow whether she wants to be a mother or not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcw3oo", "score_hidden": false, "stickied": false, "created": 1492420809.0, "created_utc": 1492392009.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgctmwl", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "buddascrayon", "parent_id": "t1_dgcsvl2", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "To your last retort I will add: yeah it's a wholly spiritual belief that when a sperm meets an egg, somehow at that same instant a \"soul\" is deposited too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To your last retort I will add: yeah it&amp;#39;s a wholly spiritual belief that when a sperm meets an egg, somehow at that same instant a &amp;quot;soul&amp;quot; is deposited too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgctmwl", "score_hidden": false, "stickied": false, "created": 1492417550.0, "created_utc": 1492388750.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcsvl2", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "aidentity", "parent_id": "t1_dgcrpqd", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt; Should that biological function proceed without error,\n\nIf the woman chooses to nurture... the function you refer to here is a woman choosing to be a mother. That clump of cells will never be anything else unless it has a mother. \n\n&gt;The first part is simply the idea that, given two decisions of roughly equal moral weight\n\nNo, that's a false equivalence.  The woman is a person, that's correct, we can agree on that.  Her bodily autonomy exists in the first instance.  Predicting future events is spiritual belief.  The fetus will never become a person without a woman who wishes to be a mother, it's her will that it's important to protect, not Gods.    \n\n&gt; The solution, in my mind, is for the government to leave the decision up to the woman.\n\nI'm glad we agree on that.\n\n&gt; But no part of that argument involves me hand-waving away a very legitimate position.\n\nFair enough, except I strongly believe there is no legitimacy to imposing spiritual beliefs on others. Quite the opposite, and we need laws to protect our freedoms.\n\n&gt;They don't want to coerce women, they want to protect a child.\n\nIt's not a child its a fetus, if you stop using incorrect terminology it becomes clearer.  No one wants to kill children.\n\n&gt;Their argument isn't built out of some spiritual belief\n\nYes it is.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Should that biological function proceed without error,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If the woman chooses to nurture... the function you refer to here is a woman choosing to be a mother. That clump of cells will never be anything else unless it has a mother. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The first part is simply the idea that, given two decisions of roughly equal moral weight&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, that&amp;#39;s a false equivalence.  The woman is a person, that&amp;#39;s correct, we can agree on that.  Her bodily autonomy exists in the first instance.  Predicting future events is spiritual belief.  The fetus will never become a person without a woman who wishes to be a mother, it&amp;#39;s her will that it&amp;#39;s important to protect, not Gods.    &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The solution, in my mind, is for the government to leave the decision up to the woman.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m glad we agree on that.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But no part of that argument involves me hand-waving away a very legitimate position.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Fair enough, except I strongly believe there is no legitimacy to imposing spiritual beliefs on others. Quite the opposite, and we need laws to protect our freedoms.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;They don&amp;#39;t want to coerce women, they want to protect a child.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s not a child its a fetus, if you stop using incorrect terminology it becomes clearer.  No one wants to kill children.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Their argument isn&amp;#39;t built out of some spiritual belief&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes it is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcsvl2", "score_hidden": false, "stickied": false, "created": 1492416530.0, "created_utc": 1492387730.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgde5i7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ParyGanter", "parent_id": "t1_dgcrpqd", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "You skipped over explaining what makes that \"a very legitimate position\".\n\nIts not normally a human right to directly feed off someone else's body from the inside. That's an extra right given only in the womb, and it needs its own justification.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You skipped over explaining what makes that &amp;quot;a very legitimate position&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Its not normally a human right to directly feed off someone else&amp;#39;s body from the inside. That&amp;#39;s an extra right given only in the womb, and it needs its own justification.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgde5i7", "score_hidden": false, "stickied": false, "created": 1492458977.0, "created_utc": 1492430177.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgdoi6c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ParyGanter", "parent_id": "t1_dgdn0sa", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "A zygote doesn't grow into a baby on its own. It lives in and off another person to do so.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A zygote doesn&amp;#39;t grow into a baby on its own. It lives in and off another person to do so.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdoi6c", "score_hidden": false, "stickied": false, "created": 1492474121.0, "created_utc": 1492445321.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgdn0sa", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Bebinpo", "parent_id": "t1_dgdlhas", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt;The same is true of sperm. We all know it will become a human, it just needs the right environment.\n\nI disagree with this argument. Sperm, on its own, will never result in a new human. An egg, on its own, will never result in a new human. After conception occurs, however, the result *will* be a new human. The difference seems clear to me.\n\n&gt;Or maybe you get 20 years in jail?\n\nShe induced an abortion, that's not really what I was talking about. The whole debate here is over the morality of abortions. If abortion is illegal, it would follow that inducing one should be a crime. But we're arguing about that first part, not the second. We need to determine whether an abortion should be legal first.\n\n&gt;Or maybe the child has a 0% chance of survival and you are forced to give birth to it anyway?\n\nI can't watch that video right now, but I agree with you. Mothers shouldn't be forced to give birth to a baby that is dead, or will absolutely not survive outside the womb. There's no potential for it to become a child, so the potential that's normally there shouldn't come into play.\n\nWith that being said, and not knowing what's in the video, I believe the overwhelming majority of Republicans aren't as concerned with scenarios that occur outside the general umbrella of a mother aborting a healthy fetus.\n\n&gt;Yes, we've known for decades how to lower the number of abortions by a huge amount ... just supply good sexual health education and contraception.\n\nAgreed.\n\n&gt;Republicans have fought this constantly, even arguing that some contraceptions are actually abortions to make them harder to distribute and receive. But, sure, it was just the \"woman's actions\" that led to the pregnancy.\n\nAgreed. Republican contraceptive policy is inconsistent with their abortion stance. I think it's a product of their economic conservatism--not wanting to pay for things they see as outside the government's responsibility--but that doesn't mean I think it's right. There's some logic behind it, but it's bad. I'm with you here 100%.\n\n&gt;Then, of course, there's the minor problem of not caring about the human at all as soon as it's born because it's more important to not tax rich people. No food, no housing, no education, pro. life!\n\nI disagree with you here. It's not that Republicans don't care about these children. Republicans are, on average, more charitable than Democrats, and they volunteer more with charities. Republicans just don't think the government belongs in that aspect of society. They don't think it's the government's job to redistribute wealth, or to ensure that everyone has access to every part of society. The goal of the Republican ideology is to create a set of rules which ensures that personal freedoms are maximized.\n\nIn the case of abortion, this means sacrificing the freedom of the mother in exchange for the freedom of the fetus to develop into a child and live its life. That seems internally consistent to me.\n\nIn the case of not wanting to fund social welfare programs, they see taking money from one party to give it to another party as restricting the freedom of the party that earned the money. They think the damage done by taking someone's money is greater than the benefit of someone in poverty getting more money. This feels consistent to me. I don't *agree*, but it makes sense if you agree with their assumptions.\n\nWhen discussing contraceptives, their reasoning for restricting freedom is to protect life, and they claim that, *unfortunately*, they need to restrict a woman's freedom to do that. But by encouraging contraceptive use and proper sex education, they can reduce the restriction on *everyone's* freedom. So I agree with you 100% on that one, it makes no sense and I think it's one of the biggest flaws in the Republican abortion platform.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The same is true of sperm. We all know it will become a human, it just needs the right environment.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I disagree with this argument. Sperm, on its own, will never result in a new human. An egg, on its own, will never result in a new human. After conception occurs, however, the result &lt;em&gt;will&lt;/em&gt; be a new human. The difference seems clear to me.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Or maybe you get 20 years in jail?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She induced an abortion, that&amp;#39;s not really what I was talking about. The whole debate here is over the morality of abortions. If abortion is illegal, it would follow that inducing one should be a crime. But we&amp;#39;re arguing about that first part, not the second. We need to determine whether an abortion should be legal first.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Or maybe the child has a 0% chance of survival and you are forced to give birth to it anyway?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I can&amp;#39;t watch that video right now, but I agree with you. Mothers shouldn&amp;#39;t be forced to give birth to a baby that is dead, or will absolutely not survive outside the womb. There&amp;#39;s no potential for it to become a child, so the potential that&amp;#39;s normally there shouldn&amp;#39;t come into play.&lt;/p&gt;\n\n&lt;p&gt;With that being said, and not knowing what&amp;#39;s in the video, I believe the overwhelming majority of Republicans aren&amp;#39;t as concerned with scenarios that occur outside the general umbrella of a mother aborting a healthy fetus.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Yes, we&amp;#39;ve known for decades how to lower the number of abortions by a huge amount ... just supply good sexual health education and contraception.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Agreed.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Republicans have fought this constantly, even arguing that some contraceptions are actually abortions to make them harder to distribute and receive. But, sure, it was just the &amp;quot;woman&amp;#39;s actions&amp;quot; that led to the pregnancy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Agreed. Republican contraceptive policy is inconsistent with their abortion stance. I think it&amp;#39;s a product of their economic conservatism--not wanting to pay for things they see as outside the government&amp;#39;s responsibility--but that doesn&amp;#39;t mean I think it&amp;#39;s right. There&amp;#39;s some logic behind it, but it&amp;#39;s bad. I&amp;#39;m with you here 100%.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Then, of course, there&amp;#39;s the minor problem of not caring about the human at all as soon as it&amp;#39;s born because it&amp;#39;s more important to not tax rich people. No food, no housing, no education, pro. life!&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I disagree with you here. It&amp;#39;s not that Republicans don&amp;#39;t care about these children. Republicans are, on average, more charitable than Democrats, and they volunteer more with charities. Republicans just don&amp;#39;t think the government belongs in that aspect of society. They don&amp;#39;t think it&amp;#39;s the government&amp;#39;s job to redistribute wealth, or to ensure that everyone has access to every part of society. The goal of the Republican ideology is to create a set of rules which ensures that personal freedoms are maximized.&lt;/p&gt;\n\n&lt;p&gt;In the case of abortion, this means sacrificing the freedom of the mother in exchange for the freedom of the fetus to develop into a child and live its life. That seems internally consistent to me.&lt;/p&gt;\n\n&lt;p&gt;In the case of not wanting to fund social welfare programs, they see taking money from one party to give it to another party as restricting the freedom of the party that earned the money. They think the damage done by taking someone&amp;#39;s money is greater than the benefit of someone in poverty getting more money. This feels consistent to me. I don&amp;#39;t &lt;em&gt;agree&lt;/em&gt;, but it makes sense if you agree with their assumptions.&lt;/p&gt;\n\n&lt;p&gt;When discussing contraceptives, their reasoning for restricting freedom is to protect life, and they claim that, &lt;em&gt;unfortunately&lt;/em&gt;, they need to restrict a woman&amp;#39;s freedom to do that. But by encouraging contraceptive use and proper sex education, they can reduce the restriction on &lt;em&gt;everyone&amp;#39;s&lt;/em&gt; freedom. So I agree with you 100% on that one, it makes no sense and I think it&amp;#39;s one of the biggest flaws in the Republican abortion platform.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdn0sa", "score_hidden": false, "stickied": false, "created": 1492472424.0, "created_utc": 1492443624.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdlhas", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nevyn", "parent_id": "t1_dgcrpqd", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt; Republicans say \"Well, we all know what this clump of cells is for. We all know what it will become.\n\nThe same is true of sperm. We all know it will become a human, it just needs the right environment.\n\n&gt; If it dies on its own in the womb, that's sad, but that's just the way things go.\n\nOr maybe you get 20 years in jail?\n\nhttps://www.theguardian.com/us-news/2016/jul/22/purvi-patel-abortion-sentence-reduced\n\nOr maybe the child has a 0% chance of survival and you are forced to give birth to it anyway?\n\nhttps://www.youtube.com/watch?v=9finqZJJNA8\n\n&gt; But, knowing that this is otherwise going to be a baby in less than a year, we really shouldn't go chopping it up with a knife for the sake of one person's convenience, especially considering their actions led to the baby's conception in the first place.\"\n\nYes, we've known for decades how to lower the number of abortions by a huge amount ... just supply good sexual health education and contraception. Republicans have fought this constantly, even arguing that some contraceptions are actually abortions to make them harder to distribute and receive. But, sure, it was just the \"woman's actions\" that led to the pregnancy.\n\nThen, of course, there's the minor problem of not caring about the human at all as soon as it's born because it's more important to not tax rich people. No food, no housing, no education, pro. life!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Republicans say &amp;quot;Well, we all know what this clump of cells is for. We all know what it will become.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The same is true of sperm. We all know it will become a human, it just needs the right environment.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If it dies on its own in the womb, that&amp;#39;s sad, but that&amp;#39;s just the way things go.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Or maybe you get 20 years in jail?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.theguardian.com/us-news/2016/jul/22/purvi-patel-abortion-sentence-reduced\"&gt;https://www.theguardian.com/us-news/2016/jul/22/purvi-patel-abortion-sentence-reduced&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Or maybe the child has a 0% chance of survival and you are forced to give birth to it anyway?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=9finqZJJNA8\"&gt;https://www.youtube.com/watch?v=9finqZJJNA8&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But, knowing that this is otherwise going to be a baby in less than a year, we really shouldn&amp;#39;t go chopping it up with a knife for the sake of one person&amp;#39;s convenience, especially considering their actions led to the baby&amp;#39;s conception in the first place.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, we&amp;#39;ve known for decades how to lower the number of abortions by a huge amount ... just supply good sexual health education and contraception. Republicans have fought this constantly, even arguing that some contraceptions are actually abortions to make them harder to distribute and receive. But, sure, it was just the &amp;quot;woman&amp;#39;s actions&amp;quot; that led to the pregnancy.&lt;/p&gt;\n\n&lt;p&gt;Then, of course, there&amp;#39;s the minor problem of not caring about the human at all as soon as it&amp;#39;s born because it&amp;#39;s more important to not tax rich people. No food, no housing, no education, pro. life!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdlhas", "score_hidden": false, "stickied": false, "created": 1492470607.0, "created_utc": 1492441807.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgdn6dn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeaZZ", "parent_id": "t1_dgcrpqd", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I believe that the best argument for pro choice is to look at what happens when an unwanted child comes into this world. The child has a high risk of becoming unloved and a criminal. And that is the sad reality. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe that the best argument for pro choice is to look at what happens when an unwanted child comes into this world. The child has a high risk of becoming unloved and a criminal. And that is the sad reality. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdn6dn", "score_hidden": false, "stickied": false, "created": 1492472601.0, "created_utc": 1492443801.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrpqd", "gilded": 0, "archived": false, "score": 50, "report_reasons": null, "author": "Bebinpo", "parent_id": "t1_dgcqq4i", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt;So the will of the woman, (not a mother, a woman) vs the will of the clump of cells that has the potential to become person if nurtured to maturity.\n\nYes, that's the meat of it.\n\n&gt;The argument is that the spiritual beliefs of others should coerce women to bear unwanted children.\n\nNo, the argument is that the biological function of that clump of cells is to produce a human being. Should that biological function proceed without error, that clump of cells *will be a human being*. It will talk to you. It will learn to drive one day, it will register to vote, etc. The only way that clump of cells *won't* become a person is if that biological process fails to successfully produce a child.\n\nRepublicans say \"Well, we all know what this clump of cells is for. We all know what it will become. If it dies on its own in the womb, that's sad, but that's just the way things go. But, *knowing that this is otherwise going to be a baby in less than a year*, we really shouldn't go chopping it up with a knife for the sake of one person's convenience, especially considering their actions led to the baby's conception in the first place.\"\n\nNow, let me be clear. I don't agree that this is an argument with enough weight to prohibit abortion. However, it's ridiculous to sit here and pretend that it's an issue of absolutely no consequence, and to act like *nobody* could *ever* think of defending the baby over the woman in this scenario. There's a very real moral dilemma to consider, and it's totally understandable why someone would side with the baby.\n\nIn my eyes, the alternative argument isn't \"Stop talking about god, and stop trying to coerce me to bear children.\" Most Republicans have done neither--they're coercing you to not kill something, and they're talking about the basic natural rights which form the foundation of all functioning democratic societies on this planet.\n\nThe argument that I agree with is two parts. The first part is simply the idea that, given two decisions of roughly equal moral weight, we should favor the party that possesses consciousness and independence *now* over the party that will require years to develop them. Essentially, the mother's life and autonomy are worth more than the child's. It's a bit cold, but I think it's the most reasonable solution.\n\nThe second half of it comes from practicality. First off, it's impossible to completely prevent unwanted pregnancies, and there's no way to differentiate pregnancies that people attempted to protect against from those they did not. A woman could use birth control, and the guy could use a condom, and there's a chance she can still get pregnant.\n\nThe only true way to guard against pregnancy is to abstain from sex, which people won't do. It's impractical to build policy around expecting people to behave in ways that they don't.\n\nAnd finally, despite all that, if a woman wants an abortion then she'll get one. If we make them illegal, the abortions just become orders of magnitude more dangerous. It's impractical.\n\nThe solution, in my mind, is for the government to leave the decision up to the woman. It's not a pretty decision, and I certainly think it should be a decision that women take very seriously, but at the end of the day there's too much going on that's dependent on the situation for anyone but the woman to be making the final call.\n\nAs far as the government is concerned, it seems like the most *moral* support they can provide is to prevent unwanted pregnancies to begin with. Pro-abortion and pro-choice is always going to be a decision between two shitty options. The government should spend less time deciding which shitty decision is the least shitty, and instead should just prevent that decision from ever having to be made. That means more effective sex education and a better distribution of contraceptives to demographics that struggle with unwanted pregnancies.\n\nBut no part of that argument involves me hand-waving away a very legitimate position. Nobody will ever make progress on these issues if we keep making shit up about those that don't share our beliefs--Republicans aren't evil, they just place different moral weights on the life of the baby and the woman. They don't want to coerce women, they want to protect a child. Their argument isn't built out of some spiritual belief, it's built off the same rules that every other part of our government is built out of.", "edited": 1492386362.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;So the will of the woman, (not a mother, a woman) vs the will of the clump of cells that has the potential to become person if nurtured to maturity.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, that&amp;#39;s the meat of it.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The argument is that the spiritual beliefs of others should coerce women to bear unwanted children.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, the argument is that the biological function of that clump of cells is to produce a human being. Should that biological function proceed without error, that clump of cells &lt;em&gt;will be a human being&lt;/em&gt;. It will talk to you. It will learn to drive one day, it will register to vote, etc. The only way that clump of cells &lt;em&gt;won&amp;#39;t&lt;/em&gt; become a person is if that biological process fails to successfully produce a child.&lt;/p&gt;\n\n&lt;p&gt;Republicans say &amp;quot;Well, we all know what this clump of cells is for. We all know what it will become. If it dies on its own in the womb, that&amp;#39;s sad, but that&amp;#39;s just the way things go. But, &lt;em&gt;knowing that this is otherwise going to be a baby in less than a year&lt;/em&gt;, we really shouldn&amp;#39;t go chopping it up with a knife for the sake of one person&amp;#39;s convenience, especially considering their actions led to the baby&amp;#39;s conception in the first place.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Now, let me be clear. I don&amp;#39;t agree that this is an argument with enough weight to prohibit abortion. However, it&amp;#39;s ridiculous to sit here and pretend that it&amp;#39;s an issue of absolutely no consequence, and to act like &lt;em&gt;nobody&lt;/em&gt; could &lt;em&gt;ever&lt;/em&gt; think of defending the baby over the woman in this scenario. There&amp;#39;s a very real moral dilemma to consider, and it&amp;#39;s totally understandable why someone would side with the baby.&lt;/p&gt;\n\n&lt;p&gt;In my eyes, the alternative argument isn&amp;#39;t &amp;quot;Stop talking about god, and stop trying to coerce me to bear children.&amp;quot; Most Republicans have done neither--they&amp;#39;re coercing you to not kill something, and they&amp;#39;re talking about the basic natural rights which form the foundation of all functioning democratic societies on this planet.&lt;/p&gt;\n\n&lt;p&gt;The argument that I agree with is two parts. The first part is simply the idea that, given two decisions of roughly equal moral weight, we should favor the party that possesses consciousness and independence &lt;em&gt;now&lt;/em&gt; over the party that will require years to develop them. Essentially, the mother&amp;#39;s life and autonomy are worth more than the child&amp;#39;s. It&amp;#39;s a bit cold, but I think it&amp;#39;s the most reasonable solution.&lt;/p&gt;\n\n&lt;p&gt;The second half of it comes from practicality. First off, it&amp;#39;s impossible to completely prevent unwanted pregnancies, and there&amp;#39;s no way to differentiate pregnancies that people attempted to protect against from those they did not. A woman could use birth control, and the guy could use a condom, and there&amp;#39;s a chance she can still get pregnant.&lt;/p&gt;\n\n&lt;p&gt;The only true way to guard against pregnancy is to abstain from sex, which people won&amp;#39;t do. It&amp;#39;s impractical to build policy around expecting people to behave in ways that they don&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;And finally, despite all that, if a woman wants an abortion then she&amp;#39;ll get one. If we make them illegal, the abortions just become orders of magnitude more dangerous. It&amp;#39;s impractical.&lt;/p&gt;\n\n&lt;p&gt;The solution, in my mind, is for the government to leave the decision up to the woman. It&amp;#39;s not a pretty decision, and I certainly think it should be a decision that women take very seriously, but at the end of the day there&amp;#39;s too much going on that&amp;#39;s dependent on the situation for anyone but the woman to be making the final call.&lt;/p&gt;\n\n&lt;p&gt;As far as the government is concerned, it seems like the most &lt;em&gt;moral&lt;/em&gt; support they can provide is to prevent unwanted pregnancies to begin with. Pro-abortion and pro-choice is always going to be a decision between two shitty options. The government should spend less time deciding which shitty decision is the least shitty, and instead should just prevent that decision from ever having to be made. That means more effective sex education and a better distribution of contraceptives to demographics that struggle with unwanted pregnancies.&lt;/p&gt;\n\n&lt;p&gt;But no part of that argument involves me hand-waving away a very legitimate position. Nobody will ever make progress on these issues if we keep making shit up about those that don&amp;#39;t share our beliefs--Republicans aren&amp;#39;t evil, they just place different moral weights on the life of the baby and the woman. They don&amp;#39;t want to coerce women, they want to protect a child. Their argument isn&amp;#39;t built out of some spiritual belief, it&amp;#39;s built off the same rules that every other part of our government is built out of.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcrpqd", "score_hidden": false, "stickied": false, "created": 1492414943.0, "created_utc": 1492386143.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 50}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcxvr8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aidentity", "parent_id": "t1_dgcwz28", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I think you are quite correct.  \n\nThat said, when arguing the point and trying to persuade those with opposing views.  They will never agree to a human life being ended, they will call it murder. \n\nThey need a way to understand interrupting the reproduction process that does not use such evocative terminology.  They will never be persuaded without a better argument, because they care more about the potential for a life than an actual living breathing thinking person.\n\nIt's my understanding, that the conviction that a fetus is a human life stems from a spiritual belief.  A hold over from when we did not have the understanding we do now.  I believe that it can be recognized in law as such, and then individual freedom can be protected against it.    ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you are quite correct.  &lt;/p&gt;\n\n&lt;p&gt;That said, when arguing the point and trying to persuade those with opposing views.  They will never agree to a human life being ended, they will call it murder. &lt;/p&gt;\n\n&lt;p&gt;They need a way to understand interrupting the reproduction process that does not use such evocative terminology.  They will never be persuaded without a better argument, because they care more about the potential for a life than an actual living breathing thinking person.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s my understanding, that the conviction that a fetus is a human life stems from a spiritual belief.  A hold over from when we did not have the understanding we do now.  I believe that it can be recognized in law as such, and then individual freedom can be protected against it.    &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcxvr8", "score_hidden": false, "stickied": false, "created": 1492423206.0, "created_utc": 1492394406.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcwz28", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "YoshiKoshi", "parent_id": "t1_dgcqq4i", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "So the will of an actual person who possess a body vs. the will of an entity that wants to use that body and can potentially harm that body, sometimes permanently. \n\nI don't care about any arguments about the clump of cells turning into a human or life beginning at conception. If it will make a person happy, I'll say that it's a human life starting at conception. \n\nBut even so, that human life does not get to use someone else's body against her will. That's what \"my body, my choice\" means. It means that I have bodily autonomy and I am the only one who decides how my body is used. I can't be forced to donate an organ, even after I'm dead. And I shouldn't be forced to donate the use of multiple organs for use by a fetus. \n\nA living woman shouldn't have less bodily autonomy than a corpse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So the will of an actual person who possess a body vs. the will of an entity that wants to use that body and can potentially harm that body, sometimes permanently. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t care about any arguments about the clump of cells turning into a human or life beginning at conception. If it will make a person happy, I&amp;#39;ll say that it&amp;#39;s a human life starting at conception. &lt;/p&gt;\n\n&lt;p&gt;But even so, that human life does not get to use someone else&amp;#39;s body against her will. That&amp;#39;s what &amp;quot;my body, my choice&amp;quot; means. It means that I have bodily autonomy and I am the only one who decides how my body is used. I can&amp;#39;t be forced to donate an organ, even after I&amp;#39;m dead. And I shouldn&amp;#39;t be forced to donate the use of multiple organs for use by a fetus. &lt;/p&gt;\n\n&lt;p&gt;A living woman shouldn&amp;#39;t have less bodily autonomy than a corpse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcwz28", "score_hidden": false, "stickied": false, "created": 1492421940.0, "created_utc": 1492393140.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqq4i", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "aidentity", "parent_id": "t1_dgcm10a", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt; But one party needs to have their freedom restricted here, either the mother or the unborn child.\n\nSo the will of the woman, (not a mother, a woman) vs the will of the clump of cells that has the potential to become person if nurtured to maturity.\n\nThe argument is that the spiritual beliefs of others should coerce women to bear unwanted children. \n\nIt's absurd that any law should be made except one to protect the woman.\n\n\n     ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But one party needs to have their freedom restricted here, either the mother or the unborn child.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So the will of the woman, (not a mother, a woman) vs the will of the clump of cells that has the potential to become person if nurtured to maturity.&lt;/p&gt;\n\n&lt;p&gt;The argument is that the spiritual beliefs of others should coerce women to bear unwanted children. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s absurd that any law should be made except one to protect the woman.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcqq4i", "score_hidden": false, "stickied": false, "created": 1492413612.0, "created_utc": 1492384812.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcssuj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WhiteKongX", "parent_id": "t1_dgcrrz5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "I'm pro abortion, as in I hate kids we would all be happier without them. \n/s..... sorta ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pro abortion, as in I hate kids we would all be happier without them. \n/s..... sorta &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcssuj", "score_hidden": false, "stickied": false, "created": 1492416425.0, "created_utc": 1492387625.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrrz5", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "techyfiddler", "parent_id": "t1_dgcm10a", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This. 1000 times this. Republicans do get it--their values are just different. This point gets (conveniently) overlooked so much by the pro-choice side, but it's truly the crux of the matter for pro-lifers. This is what the conversation needs to be about for both sides to make progress with each other.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. 1000 times this. Republicans do get it--their values are just different. This point gets (conveniently) overlooked so much by the pro-choice side, but it&amp;#39;s truly the crux of the matter for pro-lifers. This is what the conversation needs to be about for both sides to make progress with each other.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcrrz5", "score_hidden": false, "stickied": false, "created": 1492415026.0, "created_utc": 1492386226.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcti8s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "brainburger", "parent_id": "t1_dgcm10a", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "One thing counter to that that I have noticed, really since using reddit, is that some women claim the absolute right to have an abortion, because of their bodily autonomy. This is a harder, and more principled stance than that common in the UK, which is that abortion must be available when it would be harmful to the mother to continue the pregnancy. That is determined by two doctors here, not by the pregnant woman.\n\nSo there is a tension between the rights of the pregnant woman, and the right of the foetus, even though the foetus is not a person until it is born. (in the UK the time limit for abortion is set at the typical point at which a foetus can survive if removed from the pregnant woman's body).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One thing counter to that that I have noticed, really since using reddit, is that some women claim the absolute right to have an abortion, because of their bodily autonomy. This is a harder, and more principled stance than that common in the UK, which is that abortion must be available when it would be harmful to the mother to continue the pregnancy. That is determined by two doctors here, not by the pregnant woman.&lt;/p&gt;\n\n&lt;p&gt;So there is a tension between the rights of the pregnant woman, and the right of the foetus, even though the foetus is not a person until it is born. (in the UK the time limit for abortion is set at the typical point at which a foetus can survive if removed from the pregnant woman&amp;#39;s body).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcti8s", "score_hidden": false, "stickied": false, "created": 1492417379.0, "created_utc": 1492388579.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgctcqs", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Bebinpo", "parent_id": "t1_dgct0oh", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt;But doesn't agreeing with their premise give their argument more credence?\n\nYes, which is important, because *their argument has credence*. Which is fine. So does yours. But if you never acknowledge that their argument makes sense, and you can understand how they reached it, they'll never acknowledge yours. And then it's just two people shouting at each other over shit that they know the other side doesn't even believe to begin with.\n\n&gt;If you were to discuss it in the context of \"how bad is murdering a baby\" then you're kind of agreeing with them that it is murdering a baby, no?\n\nI wouldn't use that exactly language (it's not murder for a few reasons), but yeah, it's important to acknowledge the validity of certain points they're making. The goal here isn't to be right, it's to find the right answer for everyone. I mean, this is literally arguing over the life and death of whatever potential exists within the fetuses that are going to be aborted. ", "edited": 1492395870.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But doesn&amp;#39;t agreeing with their premise give their argument more credence?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, which is important, because &lt;em&gt;their argument has credence&lt;/em&gt;. Which is fine. So does yours. But if you never acknowledge that their argument makes sense, and you can understand how they reached it, they&amp;#39;ll never acknowledge yours. And then it&amp;#39;s just two people shouting at each other over shit that they know the other side doesn&amp;#39;t even believe to begin with.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If you were to discuss it in the context of &amp;quot;how bad is murdering a baby&amp;quot; then you&amp;#39;re kind of agreeing with them that it is murdering a baby, no?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t use that exactly language (it&amp;#39;s not murder for a few reasons), but yeah, it&amp;#39;s important to acknowledge the validity of certain points they&amp;#39;re making. The goal here isn&amp;#39;t to be right, it&amp;#39;s to find the right answer for everyone. I mean, this is literally arguing over the life and death of whatever potential exists within the fetuses that are going to be aborted. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgctcqs", "score_hidden": false, "stickied": false, "created": 1492417176.0, "created_utc": 1492388376.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgct0oh", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "heatherdunbar", "parent_id": "t1_dgcm10a", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "But doesn't agreeing with their premise give their argument more credence? Like if you, a pro-abortion person, were to discuss it in the context of \"how bad is murdering a baby\" then you're kind of agreeing with them that it is murdering a baby, no?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But doesn&amp;#39;t agreeing with their premise give their argument more credence? Like if you, a pro-abortion person, were to discuss it in the context of &amp;quot;how bad is murdering a baby&amp;quot; then you&amp;#39;re kind of agreeing with them that it is murdering a baby, no?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgct0oh", "score_hidden": false, "stickied": false, "created": 1492416731.0, "created_utc": 1492387931.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd4kuw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "miketeeeveee", "parent_id": "t1_dgcm10a", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This is just factually not true. If conservatives honestly believed in protecting life, they would not be pro capital punishment. If they honestly believed in protecting life they would not be decidedly pro war. Where has Flake expressed concern about border deaths along his state border?  Everything he wants to do along the border increases those deaths.  They are ok with men taking lives, they are not ok with women making similar difficult decisions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is just factually not true. If conservatives honestly believed in protecting life, they would not be pro capital punishment. If they honestly believed in protecting life they would not be decidedly pro war. Where has Flake expressed concern about border deaths along his state border?  Everything he wants to do along the border increases those deaths.  They are ok with men taking lives, they are not ok with women making similar difficult decisions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgd4kuw", "score_hidden": false, "stickied": false, "created": 1492433316.0, "created_utc": 1492404516.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcukji", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "BuboTitan", "parent_id": "t1_dgcm10a", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt;I'm pro-abortion,\n\nThat's interesting. Pro-Choice people tend to say that no one is \"pro abortion\", they are just pro-choice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m pro-abortion,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s interesting. Pro-Choice people tend to say that no one is &amp;quot;pro abortion&amp;quot;, they are just pro-choice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcukji", "score_hidden": false, "stickied": false, "created": 1492418812.0, "created_utc": 1492390012.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcm10a", "gilded": 0, "archived": false, "score": 321, "report_reasons": null, "author": "Bebinpo", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I'm pro-abortion, but I really don't understand why people always pretend the Republican position doesn't exist. Not that they think it doesn't have credit, they *literally pretend it doesn't exist*.\n\nLike, Republicans think abortion is murdering a baby. That's what the discussion needs to be over--determining the moral weight of that action, and comparing it against the moral weight of a restriction on a woman's right to her own body. But every time I see abortion brought up, it's in the context of \"Republicans just want to control women\" or \"Republicans don't understand why women don't want this\".\n\nLike... they understand it. I promise, they get it, it's not like they just never bothered to think about the alternative before. But one party needs to have their freedom restricted here, either the mother or the unborn child. People need to stop pretending that isn't true, because that's the whole crux of the argument.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pro-abortion, but I really don&amp;#39;t understand why people always pretend the Republican position doesn&amp;#39;t exist. Not that they think it doesn&amp;#39;t have credit, they &lt;em&gt;literally pretend it doesn&amp;#39;t exist&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Like, Republicans think abortion is murdering a baby. That&amp;#39;s what the discussion needs to be over--determining the moral weight of that action, and comparing it against the moral weight of a restriction on a woman&amp;#39;s right to her own body. But every time I see abortion brought up, it&amp;#39;s in the context of &amp;quot;Republicans just want to control women&amp;quot; or &amp;quot;Republicans don&amp;#39;t understand why women don&amp;#39;t want this&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Like... they understand it. I promise, they get it, it&amp;#39;s not like they just never bothered to think about the alternative before. But one party needs to have their freedom restricted here, either the mother or the unborn child. People need to stop pretending that isn&amp;#39;t true, because that&amp;#39;s the whole crux of the argument.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcm10a", "score_hidden": false, "stickied": false, "created": 1492407251.0, "created_utc": 1492378451.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 321}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgdrkz5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Tiammatt", "parent_id": "t1_dgcxbal", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Exactly. \"Why does [insert anyone who's not me] get to decide things about my life!?!?\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly. &amp;quot;Why does [insert anyone who&amp;#39;s not me] get to decide things about my life!?!?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdrkz5", "score_hidden": false, "stickied": false, "created": 1492477548.0, "created_utc": 1492448748.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcxbal", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "10mmbestcm", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Further, the whole \"Why do stale old white dudes get to choose what I do with my uterus?\" is similarly irritating. If we only allowed people to have opinions on their own personal proclivities and biologies, machine guns would be legal, drugs would be legal, rape would be legal, etc etc. \n\nThe foundation of or whole political system is that everyone gets a say, not just those directly affected. Sometimes that means you don't get your way, and that's the way it's supposed to be. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Further, the whole &amp;quot;Why do stale old white dudes get to choose what I do with my uterus?&amp;quot; is similarly irritating. If we only allowed people to have opinions on their own personal proclivities and biologies, machine guns would be legal, drugs would be legal, rape would be legal, etc etc. &lt;/p&gt;\n\n&lt;p&gt;The foundation of or whole political system is that everyone gets a say, not just those directly affected. Sometimes that means you don&amp;#39;t get your way, and that&amp;#39;s the way it&amp;#39;s supposed to be. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcxbal", "score_hidden": false, "stickied": false, "created": 1492422405.0, "created_utc": 1492393605.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2hs7", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "MinionCommander", "parent_id": "t1_dgcsqgz", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Completely unrelated", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Completely unrelated&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgd2hs7", "score_hidden": false, "stickied": false, "created": 1492429792.0, "created_utc": 1492400992.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcsqgz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "HumanKapital_", "parent_id": "t1_dgcdotq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "No it's not, it's rich vs poor.  The rich will always have access to abortion even it is outlawed in the US they can travel over-seas.  It is only the poor who are affected by anti-abortion laws.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No it&amp;#39;s not, it&amp;#39;s rich vs poor.  The rich will always have access to abortion even it is outlawed in the US they can travel over-seas.  It is only the poor who are affected by anti-abortion laws.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcsqgz", "score_hidden": false, "stickied": false, "created": 1492416331.0, "created_utc": 1492387531.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdotq", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "MinionCommander", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "The argument will never be really over. It's right to live vs right to bodily autonomy and both for the most part stand on their own.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The argument will never be really over. It&amp;#39;s right to live vs right to bodily autonomy and both for the most part stand on their own.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcdotq", "score_hidden": false, "stickied": false, "created": 1492396328.0, "created_utc": 1492367528.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcjdhx", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Dejohns2", "parent_id": "t1_dgcatto", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt; No amount of asking smart questions, marching, protesting will change that.\n\nDon't say that MLK Jr, or Elizabeth Cady Stanton.\n\nEdit: Flake is going to have to work hard to keep his seat in the senate. AZ is turning bluer everyday, and it's possible he will lose his seat in his reelection bid.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;No amount of asking smart questions, marching, protesting will change that.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Don&amp;#39;t say that MLK Jr, or Elizabeth Cady Stanton.&lt;/p&gt;\n\n&lt;p&gt;Edit: Flake is going to have to work hard to keep his seat in the senate. AZ is turning bluer everyday, and it&amp;#39;s possible he will lose his seat in his reelection bid.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcjdhx", "score_hidden": false, "stickied": false, "created": 1492403794.0, "created_utc": 1492374994.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcurbu", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Hobo_Economist", "parent_id": "t1_dgcatto", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "It's awfully reductive to paint democracy as \"once someone gets elected they have absolute power and fuck the minority\".\nRepresentatives are expected to represent their constituents, and respond to their concerns. That's a pillar of democracy. He doesn't have to change his mind, but it's awfully disrespectful of him to outright ignore the question like he did. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s awfully reductive to paint democracy as &amp;quot;once someone gets elected they have absolute power and fuck the minority&amp;quot;.\nRepresentatives are expected to represent their constituents, and respond to their concerns. That&amp;#39;s a pillar of democracy. He doesn&amp;#39;t have to change his mind, but it&amp;#39;s awfully disrespectful of him to outright ignore the question like he did. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcurbu", "score_hidden": false, "stickied": false, "created": 1492419065.0, "created_utc": 1492390265.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcpff3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Jjmcgrayy", "parent_id": "t1_dgcatto", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I notice people think of \"oppression by majitity\" only when they disagree with a stance. \n\nOtherwise it's \"duh. That's how democracy works. Majority rule is best rule\" ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I notice people think of &amp;quot;oppression by majitity&amp;quot; only when they disagree with a stance. &lt;/p&gt;\n\n&lt;p&gt;Otherwise it&amp;#39;s &amp;quot;duh. That&amp;#39;s how democracy works. Majority rule is best rule&amp;quot; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcpff3", "score_hidden": false, "stickied": false, "created": 1492411820.0, "created_utc": 1492383020.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcnqbj", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "cuttysark9712", "parent_id": "t1_dgcatto", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Direct action, that is, marching, protesting, and civil disobedience, like blocking highways and business entrances, as practiced by Ghandi and Dr. King, is the only thing that has been shown to work. Voting sure doesn't seem to. And, in fact, research has shown if you're in the bottom seventy percent of the wealth distribution, voting has essentially no influence on policy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Direct action, that is, marching, protesting, and civil disobedience, like blocking highways and business entrances, as practiced by Ghandi and Dr. King, is the only thing that has been shown to work. Voting sure doesn&amp;#39;t seem to. And, in fact, research has shown if you&amp;#39;re in the bottom seventy percent of the wealth distribution, voting has essentially no influence on policy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcnqbj", "score_hidden": false, "stickied": false, "created": 1492409490.0, "created_utc": 1492380690.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcatto", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "donaldplsss", "parent_id": "t1_dgc9n2y", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "thats some great info with actual numbers.  Unfortunately that how democracy works, oppression by the majority. shitty people make shitty choices and everyone else has to live with it.  No amount of asking smart questions, marching, protesting will change that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thats some great info with actual numbers.  Unfortunately that how democracy works, oppression by the majority. shitty people make shitty choices and everyone else has to live with it.  No amount of asking smart questions, marching, protesting will change that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcatto", "score_hidden": false, "stickied": false, "created": 1492392531.0, "created_utc": 1492363731.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9n2y", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "Dejohns2", "parent_id": "t1_dgc6g1k", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt; why did they elect him though.\n\nWell, he only won by 3% of the vote, and AZ registered voters break down like this: Republicans - 34%, independents - 34%, Democrats - 30%, Libertarian - 1%, and Green - 1%.\n\nI'm really liberal but registered as an independent here. I would say most registered independents are pro-choice, but don't care about keeping access to it if it conflicts with their ability to pay as little in taxes as possible (while demanding more and more freeways - the irony is ripe).\n\nMormons are also a significant-ish population here (6%) so he automatically gets all their votes because he's mormon, too. And the rural people like him because he's from a smaller town - Snowflake. Yes, his name \"Flake\" is part of the town's name because his grandpa or great grandpa helped found the town. He has serious name recognition here.\n\nHe also had way more money than his challenger. And his challenger (a really good candidate, imo, Richard Carmona) was of Puerto Rican descent and a lot of the white people here (especially in rural areas and between Tucson - Mexico border) are super fucking racist.  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;why did they elect him though.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, he only won by 3% of the vote, and AZ registered voters break down like this: Republicans - 34%, independents - 34%, Democrats - 30%, Libertarian - 1%, and Green - 1%.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m really liberal but registered as an independent here. I would say most registered independents are pro-choice, but don&amp;#39;t care about keeping access to it if it conflicts with their ability to pay as little in taxes as possible (while demanding more and more freeways - the irony is ripe).&lt;/p&gt;\n\n&lt;p&gt;Mormons are also a significant-ish population here (6%) so he automatically gets all their votes because he&amp;#39;s mormon, too. And the rural people like him because he&amp;#39;s from a smaller town - Snowflake. Yes, his name &amp;quot;Flake&amp;quot; is part of the town&amp;#39;s name because his grandpa or great grandpa helped found the town. He has serious name recognition here.&lt;/p&gt;\n\n&lt;p&gt;He also had way more money than his challenger. And his challenger (a really good candidate, imo, Richard Carmona) was of Puerto Rican descent and a lot of the white people here (especially in rural areas and between Tucson - Mexico border) are super fucking racist.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc9n2y", "score_hidden": false, "stickied": false, "created": 1492390964.0, "created_utc": 1492362164.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6oy1", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "parading_goats", "parent_id": "t1_dgc6g1k", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Because there are other issues that voters care about besides abortion (and abortion should be settled law by now).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because there are other issues that voters care about besides abortion (and abortion should be settled law by now).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc6oy1", "score_hidden": false, "stickied": false, "created": 1492387078.0, "created_utc": 1492358278.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6g1k", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "donaldplsss", "parent_id": "t1_dgc4mdl", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "why did they elect him though. Only poll that actually matters are elections not Morrison-Cronkite Poll. he didn't suddenly change his stance after getting elected. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;why did they elect him though. Only poll that actually matters are elections not Morrison-Cronkite Poll. he didn&amp;#39;t suddenly change his stance after getting elected. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc6g1k", "score_hidden": false, "stickied": false, "created": 1492386747.0, "created_utc": 1492357947.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4mdl", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "parading_goats", "parent_id": "t1_dgc3m43", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This is a US senator. He represents his entire state. [Nearly three fourths of Arizona voters are pro choice.](https://morrisoninstitute.asu.edu/news/morrison-cronkite-poll-arizona-voters-split-most-social-issues)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a US senator. He represents his entire state. &lt;a href=\"https://morrisoninstitute.asu.edu/news/morrison-cronkite-poll-arizona-voters-split-most-social-issues\"&gt;Nearly three fourths of Arizona voters are pro choice.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc4mdl", "score_hidden": false, "stickied": false, "created": 1492384225.0, "created_utc": 1492355425.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgc52u6", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "-WinterMute_", "parent_id": "t1_dgc3m43", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "When I said small segment, I meant conservative voters. I took it to be mutually understood that elected officials are supposed to represent all of their constituents.  Half of the American population is pro-choice with the anti-choice crowd closely behind. Conservatives simply cannot force half of the country to see it their way. At least with Roe Vs. Wade, there's room for both parties to disagree in a civil manner, which I think is the corner stone of any healthy democracy. \n\nSorry if that was confusing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I said small segment, I meant conservative voters. I took it to be mutually understood that elected officials are supposed to represent all of their constituents.  Half of the American population is pro-choice with the anti-choice crowd closely behind. Conservatives simply cannot force half of the country to see it their way. At least with Roe Vs. Wade, there&amp;#39;s room for both parties to disagree in a civil manner, which I think is the corner stone of any healthy democracy. &lt;/p&gt;\n\n&lt;p&gt;Sorry if that was confusing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc52u6", "score_hidden": false, "stickied": false, "created": 1492384871.0, "created_utc": 1492356071.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgc3m43", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "grozamesh", "parent_id": "t1_dgc1tp0", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "That small segment gets to dictate policy because they got elected.  They played the popularity contest that is democracy and won.\n\nThe representative can then take those questions, and throw that shit in the trash because they are in a firmly red district and don't have to listen to whining about \"rights\".\n\nThe argument isn't valid in the eyes of the representative's constituents, so she might as well be talking to a wall.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That small segment gets to dictate policy because they got elected.  They played the popularity contest that is democracy and won.&lt;/p&gt;\n\n&lt;p&gt;The representative can then take those questions, and throw that shit in the trash because they are in a firmly red district and don&amp;#39;t have to listen to whining about &amp;quot;rights&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;The argument isn&amp;#39;t valid in the eyes of the representative&amp;#39;s constituents, so she might as well be talking to a wall.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc3m43", "score_hidden": false, "stickied": false, "created": 1492382714.0, "created_utc": 1492353914.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcpgff", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "LastCypher", "parent_id": "t1_dgcmmpj", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Well because reddit disagrees. Right?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well because reddit disagrees. Right?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcpgff", "score_hidden": false, "stickied": false, "created": 1492411856.0, "created_utc": 1492383056.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcmmpj", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "Ramennoodleking87", "parent_id": "t1_dgc1tp0", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "How does thinking that abortion is murder make him a bigot?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How does thinking that abortion is murder make him a bigot?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcmmpj", "score_hidden": false, "stickied": false, "created": 1492408042.0, "created_utc": 1492379242.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcp82t", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Noltonn", "parent_id": "t1_dgc1tp0", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "You seem to have a core misunderstanding of how a democracy works. They get to decide these things because your people chose him to decide those things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You seem to have a core misunderstanding of how a democracy works. They get to decide these things because your people chose him to decide those things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcp82t", "score_hidden": false, "stickied": false, "created": 1492411541.0, "created_utc": 1492382741.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1tp0", "gilded": 0, "archived": false, "score": 75, "report_reasons": null, "author": "-WinterMute_", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "First of all, asking your representative to explain their stance on a political issue is not an empty platitude, it's a fucking question, which is something that should happen in a democracy. Clearly, a reasonable argument isn't ever going to work on a bigot, but that's not the girl's fault. \n\nWhy does a small segment of people get to dictate policy for everyone else? Should that not happen through consensus rather than subterfuge? Are there better alternative solutions?  Just because these questions don't work on a close minded idiot, doesn't diminish the value of her argument. \n\nEdit for clarity: small segment refers to conservatives not politicians. ", "edited": 1492387241.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First of all, asking your representative to explain their stance on a political issue is not an empty platitude, it&amp;#39;s a fucking question, which is something that should happen in a democracy. Clearly, a reasonable argument isn&amp;#39;t ever going to work on a bigot, but that&amp;#39;s not the girl&amp;#39;s fault. &lt;/p&gt;\n\n&lt;p&gt;Why does a small segment of people get to dictate policy for everyone else? Should that not happen through consensus rather than subterfuge? Are there better alternative solutions?  Just because these questions don&amp;#39;t work on a close minded idiot, doesn&amp;#39;t diminish the value of her argument. &lt;/p&gt;\n\n&lt;p&gt;Edit for clarity: small segment refers to conservatives not politicians. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc1tp0", "score_hidden": false, "stickied": false, "created": 1492379850.0, "created_utc": 1492351050.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 75}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgclbcr", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Kluizenaer", "parent_id": "t1_dgciu2x", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Actually where I live parents can already terminate infants with serious birth defects. They can also terminate comatose relatives with little hope of recovery. Suicide is legal, assisted suicide is legal, doctor assisted suicide in the cases of physical suffering is a right and covered by health insurance and they are now moving to doctor-assisted suicide being covered absent physical suffering which already was legal but that didn't mean health insurance had to pay for it.\n\nAll done by the legislative. Unlike in common law systems out supreme court does not have the authority do such things at all; it cannot declare laws unconstitutional.\n\nWhat^if^Rick^Santorum^was^right?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually where I live parents can already terminate infants with serious birth defects. They can also terminate comatose relatives with little hope of recovery. Suicide is legal, assisted suicide is legal, doctor assisted suicide in the cases of physical suffering is a right and covered by health insurance and they are now moving to doctor-assisted suicide being covered absent physical suffering which already was legal but that didn&amp;#39;t mean health insurance had to pay for it.&lt;/p&gt;\n\n&lt;p&gt;All done by the legislative. Unlike in common law systems out supreme court does not have the authority do such things at all; it cannot declare laws unconstitutional.&lt;/p&gt;\n\n&lt;p&gt;What&lt;sup&gt;if&lt;sup&gt;Rick&lt;sup&gt;Santorum&lt;sup&gt;was&lt;sup&gt;right?&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgclbcr", "score_hidden": false, "stickied": false, "created": 1492406320.0, "created_utc": 1492377520.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgciu2x", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "joemartin746", "parent_id": "t1_dgci9uy", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "It's why people argue against slippery slope fallacies but then it starts happening and justifying people's concerns over what's coming. Like there are people in Colorado fighting for the right to drive while under the influence of marijuana. It's the very definition of giving an inch and trying to take a mile. If someone had argued against legal marijuana and said, \"if we legalize it people will just want to drive on it.\" We'd laugh and smash slippery slope. Now we have legal abortion and someone saying we should extend it to 6 months. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s why people argue against slippery slope fallacies but then it starts happening and justifying people&amp;#39;s concerns over what&amp;#39;s coming. Like there are people in Colorado fighting for the right to drive while under the influence of marijuana. It&amp;#39;s the very definition of giving an inch and trying to take a mile. If someone had argued against legal marijuana and said, &amp;quot;if we legalize it people will just want to drive on it.&amp;quot; We&amp;#39;d laugh and smash slippery slope. Now we have legal abortion and someone saying we should extend it to 6 months. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgciu2x", "score_hidden": false, "stickied": false, "created": 1492403086.0, "created_utc": 1492374286.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dgci9uy", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "SilverslawPOG", "parent_id": "t1_dgcbi0v", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "You know I seem more and more suprised everytime I come to one of thesw threads. It use to be when can you abort a baby and now its I dont even have to worry about aborting I can just kill my baby as long as its younger than 6 months.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know I seem more and more suprised everytime I come to one of thesw threads. It use to be when can you abort a baby and now its I dont even have to worry about aborting I can just kill my baby as long as its younger than 6 months.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgci9uy", "score_hidden": false, "stickied": false, "created": 1492402373.0, "created_utc": 1492373573.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcw2ix", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Halvus_I", "parent_id": "t1_dgcp4w0", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "The sticking point to this is always 'who decides viability'? DO you allow parents to take home such a malformed child? Its an ugly thing all around.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The sticking point to this is always &amp;#39;who decides viability&amp;#39;? DO you allow parents to take home such a malformed child? Its an ugly thing all around.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcw2ix", "score_hidden": false, "stickied": false, "created": 1492420768.0, "created_utc": 1492391968.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcp4w0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ComebackOfTheYear", "parent_id": "t1_dgcbi0v", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "When you've seen babies born that absolutely will not thrive, whose whole existence is pain and suffering because they have a severe disorder not compatible with life, it makes it a little easier to understand. In some cases it seems a lot more cruel keeping them alive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you&amp;#39;ve seen babies born that absolutely will not thrive, whose whole existence is pain and suffering because they have a severe disorder not compatible with life, it makes it a little easier to understand. In some cases it seems a lot more cruel keeping them alive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcp4w0", "score_hidden": false, "stickied": false, "created": 1492411418.0, "created_utc": 1492382618.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgck9n9", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Lysah", "parent_id": "t1_dgcclq3", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "Pro-lifer here that doesn't bother arguing with pro-choicers anymore. I don't agree with your 6 months (obviously) but I appreciate the reasoning you use to defend it. I just wanted to let you know I enjoyed your posts and hope you made at least one pro-choice person rethink their life, because you are absolutely right. 99% of abortion discussions immediately devolve into \"it's not a life SCIENCE SAID SO\" and the discussion is already over because pro-choicers aren't willing to discuss the very basic principle the entire argument rests upon, they think they've \"won\" that part of the debate and don't think they need to argue it anymore so logic and reason are out the window already. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pro-lifer here that doesn&amp;#39;t bother arguing with pro-choicers anymore. I don&amp;#39;t agree with your 6 months (obviously) but I appreciate the reasoning you use to defend it. I just wanted to let you know I enjoyed your posts and hope you made at least one pro-choice person rethink their life, because you are absolutely right. 99% of abortion discussions immediately devolve into &amp;quot;it&amp;#39;s not a life SCIENCE SAID SO&amp;quot; and the discussion is already over because pro-choicers aren&amp;#39;t willing to discuss the very basic principle the entire argument rests upon, they think they&amp;#39;ve &amp;quot;won&amp;quot; that part of the debate and don&amp;#39;t think they need to argue it anymore so logic and reason are out the window already. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgck9n9", "score_hidden": false, "stickied": false, "created": 1492404937.0, "created_utc": 1492376137.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcclq3", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "Kluizenaer", "parent_id": "t1_dgcce3i", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "And now you know what pro-lifers feel when you say that a fetus shouldn't count as a human person.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And now you know what pro-lifers feel when you say that a fetus shouldn&amp;#39;t count as a human person.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcclq3", "score_hidden": false, "stickied": false, "created": 1492394874.0, "created_utc": 1492366074.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgctqrt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "incraved", "parent_id": "t1_dgcce3i", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This is a great example of stupidly quoting someone out of context.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a great example of stupidly quoting someone out of context.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgctqrt", "score_hidden": false, "stickied": false, "created": 1492417691.0, "created_utc": 1492388891.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcce3i", "gilded": 0, "archived": false, "score": 48, "report_reasons": null, "author": "Ssrithrowawayssri", "parent_id": "t1_dgcbn08", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt;I don't see why a 6 month old baby should count as a person rather than an animal.\n\nAnd I'm out. See ya later Internet, that's my daily dose of losing faith in humanity. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t see why a 6 month old baby should count as a person rather than an animal.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And I&amp;#39;m out. See ya later Internet, that&amp;#39;s my daily dose of losing faith in humanity. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcce3i", "score_hidden": false, "stickied": false, "created": 1492394590.0, "created_utc": 1492365790.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 48}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqsz4", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "laaaaure", "parent_id": "t1_dgcq5mr", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I understand your logic but I feel there is a large difference between a mammal that has been born and one that requires a womb to sustain itself. Before a certain number of weeks, a fetus cannot live outside its mother. I don't believe that anyone is required to give their body to sustain another life. That is the premise of bodily autonomy. I would argue that a fetus who is able to sustain itself outside the womb should not be terminated for reasons other than incompatibility with life or other medical reasons. In the case that a mother decided she wanted an abortion after the fetus was viable she should be allowed to induce labor. I can't see this ever happening though as a woman would know she was pregnant far before this. \nI also wonder why you give exception to rape cases? If abortion is murder then it is murder no matter how the fetus was conceived. Why should a mother be forced to carry a child if she wasn't raped? The rape exception doesn't make sense to me. It sounds to me that expeditions for rape are made when people oppose abortion because they want to punish women for having sex. Fetuses conceived by consensual and non consensual sex are exactly the same. You cannot argue that one deserves to live and another does not. It is of no fault to the fetus that the mother or father was a rapist. \nFurther, supports of the rape exception recognize that being forced to carry that unwanted child would be cruel and severely psychologically damaging to the mother. It is psychologically damaging to carry an unwanted child no matter how they were conceived. If you can empathize with one mother and not the other then you must feel that being forced to carry an unwanted fetus is punishment for sex.\nfull disclosure: I'm pro choice and believe everyone should have access to abortion ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand your logic but I feel there is a large difference between a mammal that has been born and one that requires a womb to sustain itself. Before a certain number of weeks, a fetus cannot live outside its mother. I don&amp;#39;t believe that anyone is required to give their body to sustain another life. That is the premise of bodily autonomy. I would argue that a fetus who is able to sustain itself outside the womb should not be terminated for reasons other than incompatibility with life or other medical reasons. In the case that a mother decided she wanted an abortion after the fetus was viable she should be allowed to induce labor. I can&amp;#39;t see this ever happening though as a woman would know she was pregnant far before this. \nI also wonder why you give exception to rape cases? If abortion is murder then it is murder no matter how the fetus was conceived. Why should a mother be forced to carry a child if she wasn&amp;#39;t raped? The rape exception doesn&amp;#39;t make sense to me. It sounds to me that expeditions for rape are made when people oppose abortion because they want to punish women for having sex. Fetuses conceived by consensual and non consensual sex are exactly the same. You cannot argue that one deserves to live and another does not. It is of no fault to the fetus that the mother or father was a rapist. \nFurther, supports of the rape exception recognize that being forced to carry that unwanted child would be cruel and severely psychologically damaging to the mother. It is psychologically damaging to carry an unwanted child no matter how they were conceived. If you can empathize with one mother and not the other then you must feel that being forced to carry an unwanted fetus is punishment for sex.\nfull disclosure: I&amp;#39;m pro choice and believe everyone should have access to abortion &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcqsz4", "score_hidden": false, "stickied": false, "created": 1492413721.0, "created_utc": 1492384921.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcq5mr", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "MyCatsNameIsMonster", "parent_id": "t1_dgcj1l4", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I see where you are coming from, but, as someone who just broke off of a vegetarian diet that lasted a year and a half, I can honestly say I eat meat again for no other reasons than the taste and it's nutritious. \nHowever, when I eat a burger *I know that I played a part in that animals death*, I don't hide behind some idea that farm animals are some how less than important than my pets. My thoughts are this: This cow died for a reason, to feed me. I'm thankful for the animal and I'm glad I'm not a cow. \nUsing similar logic, if someone gets an abortion *they should know they played a part in that unborn child's death*. They shouldn't get to hide behind some idea that a fetus in a uterus is some how less important than a new born. My thoughts are this: generally, women should only get abortions when they didn't consent to conceive a child or there is a abnormal health risk. \n\nYou can't say you don't want to hurt animals and then go eat a burger. You can't say you don't want to hurt an unborn human and then get an abortion.\n\nWhatever side you sit on you have to face the truth. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see where you are coming from, but, as someone who just broke off of a vegetarian diet that lasted a year and a half, I can honestly say I eat meat again for no other reasons than the taste and it&amp;#39;s nutritious. \nHowever, when I eat a burger &lt;em&gt;I know that I played a part in that animals death&lt;/em&gt;, I don&amp;#39;t hide behind some idea that farm animals are some how less than important than my pets. My thoughts are this: This cow died for a reason, to feed me. I&amp;#39;m thankful for the animal and I&amp;#39;m glad I&amp;#39;m not a cow. \nUsing similar logic, if someone gets an abortion &lt;em&gt;they should know they played a part in that unborn child&amp;#39;s death&lt;/em&gt;. They shouldn&amp;#39;t get to hide behind some idea that a fetus in a uterus is some how less important than a new born. My thoughts are this: generally, women should only get abortions when they didn&amp;#39;t consent to conceive a child or there is a abnormal health risk. &lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t say you don&amp;#39;t want to hurt animals and then go eat a burger. You can&amp;#39;t say you don&amp;#39;t want to hurt an unborn human and then get an abortion.&lt;/p&gt;\n\n&lt;p&gt;Whatever side you sit on you have to face the truth. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcq5mr", "score_hidden": false, "stickied": false, "created": 1492412823.0, "created_utc": 1492384023.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcsxps", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LaconicGirth", "parent_id": "t1_dgcqvxe", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Not really. We value our own species a lot to the point that people sacrifice their lives for other humans. We view everything else in life as a tool to keep our species alive (or entertained or pleased.) \n\nObviously I'm speaking in sweeping generality", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not really. We value our own species a lot to the point that people sacrifice their lives for other humans. We view everything else in life as a tool to keep our species alive (or entertained or pleased.) &lt;/p&gt;\n\n&lt;p&gt;Obviously I&amp;#39;m speaking in sweeping generality&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcsxps", "score_hidden": false, "stickied": false, "created": 1492416615.0, "created_utc": 1492387815.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqvxe", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "laaaaure", "parent_id": "t1_dgcq566", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "this is true but there is a stark difference between valuing your own species more and reducing other species to mere products", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this is true but there is a stark difference between valuing your own species more and reducing other species to mere products&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcqvxe", "score_hidden": false, "stickied": false, "created": 1492413835.0, "created_utc": 1492385035.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcq566", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "LaconicGirth", "parent_id": "t1_dgcj1l4", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "The only difference being that it's only natural that as humans, humans hold more value to us than other animals. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only difference being that it&amp;#39;s only natural that as humans, humans hold more value to us than other animals. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcq566", "score_hidden": false, "stickied": false, "created": 1492412804.0, "created_utc": 1492384004.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcj1l4", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "laaaaure", "parent_id": "t1_dgcbn08", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "&gt; Same mental gymnastics it takes to eat cow meat.\nAgreed. It's a psychological thing, we learn our morals from our upbringing. If you took an infant and taught them that eating humans was normal they would fiercely defend that to you when they grew up. We teach children that cows and pigs and chickens are for eating and dogs and cats are for loving and that is why grown adults cannot see the hypocrisy in having BBQs and wishing death on those who abuse dogs.  \n\nwe kill 6 month old baby mammals so we can have veal. humans are mammals just like all other animals.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Same mental gymnastics it takes to eat cow meat.\nAgreed. It&amp;#39;s a psychological thing, we learn our morals from our upbringing. If you took an infant and taught them that eating humans was normal they would fiercely defend that to you when they grew up. We teach children that cows and pigs and chickens are for eating and dogs and cats are for loving and that is why grown adults cannot see the hypocrisy in having BBQs and wishing death on those who abuse dogs.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;we kill 6 month old baby mammals so we can have veal. humans are mammals just like all other animals.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcj1l4", "score_hidden": false, "stickied": false, "created": 1492403358.0, "created_utc": 1492374558.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbn08", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Kluizenaer", "parent_id": "t1_dgcbi0v", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "Same mental gymnastics it takes to eat cow meat.\n\nI don't see why a 6 month old baby should count as a person rather than an animal.\n\nIf you say it's due to human DNA you can just as easily put forth that argument against abortion. So I say it's not due to being human but sapience. \n\nI also feel that elephants, other great apes, various cateceans, birds and various cephelapods should count as non-human persons and at least should be granted higher rights some-how because of their demonstrated higher reasoning.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same mental gymnastics it takes to eat cow meat.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t see why a 6 month old baby should count as a person rather than an animal.&lt;/p&gt;\n\n&lt;p&gt;If you say it&amp;#39;s due to human DNA you can just as easily put forth that argument against abortion. So I say it&amp;#39;s not due to being human but sapience. &lt;/p&gt;\n\n&lt;p&gt;I also feel that elephants, other great apes, various cateceans, birds and various cephelapods should count as non-human persons and at least should be granted higher rights some-how because of their demonstrated higher reasoning.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcbn08", "score_hidden": false, "stickied": false, "created": 1492393602.0, "created_utc": 1492364802.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgct3ze", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Doctor0000", "parent_id": "t1_dgcbi0v", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Because there is no delineating factor between a fetus and a human. It's an arbitrary line drawn based on feelings, so it gets fucked up fast. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because there is no delineating factor between a fetus and a human. It&amp;#39;s an arbitrary line drawn based on feelings, so it gets fucked up fast. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgct3ze", "score_hidden": false, "stickied": false, "created": 1492416858.0, "created_utc": 1492388058.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcfvun", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Kluizenaer", "parent_id": "t1_dgcfi7v", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Cats also have a distinct personality; you an euthanize those.\n\nNote that where I live it is legal for parents to euthanize newborn children with serious birth defects. This is part of a common trend here that I support of the continued devaluation of human life. A thing that is most likely going to go through in the next couple of years is obligating insurance companies to pay for doctor-assisted suicide procedures of people who only experience psychological suffering.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cats also have a distinct personality; you an euthanize those.&lt;/p&gt;\n\n&lt;p&gt;Note that where I live it is legal for parents to euthanize newborn children with serious birth defects. This is part of a common trend here that I support of the continued devaluation of human life. A thing that is most likely going to go through in the next couple of years is obligating insurance companies to pay for doctor-assisted suicide procedures of people who only experience psychological suffering.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcfvun", "score_hidden": false, "stickied": false, "created": 1492399264.0, "created_utc": 1492370464.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcfi7v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AppaBearSoup", "parent_id": "t1_dgcbi0v", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "6 month babies have some personality.  An argument I find better is why is it wrong for parents to painlessly euthanize a 6 day old baby who is no more aware than they were 7 days ago.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;6 month babies have some personality.  An argument I find better is why is it wrong for parents to painlessly euthanize a 6 day old baby who is no more aware than they were 7 days ago.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcfi7v", "score_hidden": false, "stickied": false, "created": 1492398765.0, "created_utc": 1492369965.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbi0v", "gilded": 0, "archived": false, "score": 50, "report_reasons": null, "author": "Ssrithrowawayssri", "parent_id": "t1_dgc0qcj", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I can't imagine the magnitude of mental gymnastics it must take to believe killing a 6 month old baby is OK. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t imagine the magnitude of mental gymnastics it must take to believe killing a 6 month old baby is OK. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcbi0v", "score_hidden": false, "stickied": false, "created": 1492393421.0, "created_utc": 1492364621.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 50}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcld6c", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "dslyker", "parent_id": "t1_dgc38eq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Hell. Why not 80 years? Why not just start killing everyone that we don't like. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hell. Why not 80 years? Why not just start killing everyone that we don&amp;#39;t like. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcld6c", "score_hidden": false, "stickied": false, "created": 1492406384.0, "created_utc": 1492377584.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcis7n", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "laaaaure", "parent_id": "t1_dgcdjnl", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I wouldn't say 24 weeks is arbitrary, there is a difference between a fetus that can support itself outside the womb and one that cannot. Women should not be required to sustain the life of another individual but ending the life of one that could live without their support is another story ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t say 24 weeks is arbitrary, there is a difference between a fetus that can support itself outside the womb and one that cannot. Women should not be required to sustain the life of another individual but ending the life of one that could live without their support is another story &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcis7n", "score_hidden": false, "stickied": false, "created": 1492403019.0, "created_utc": 1492374219.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdjnl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Kluizenaer", "parent_id": "t1_dgc4f3f", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "&gt; I'm not a moralist, nor do I believe in the sanctity of life, but the exact threshold of \"180 days\" seems rather arbitrary.\n\nBecause like I said, it's a lower bound because laws work like that. It's just as arbitrary as \"you must be X years to drive\"\n\nA proxy is used because testing each person individually would be too expensive.\n\nIt's exactly as arbitrary as putting a limit of 24 weeks on abortion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m not a moralist, nor do I believe in the sanctity of life, but the exact threshold of &amp;quot;180 days&amp;quot; seems rather arbitrary.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Because like I said, it&amp;#39;s a lower bound because laws work like that. It&amp;#39;s just as arbitrary as &amp;quot;you must be X years to drive&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;A proxy is used because testing each person individually would be too expensive.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s exactly as arbitrary as putting a limit of 24 weeks on abortion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcdjnl", "score_hidden": false, "stickied": false, "created": 1492396134.0, "created_utc": 1492367334.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4f3f", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "Noxious_HS", "parent_id": "t1_dgc3gct", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Someone with whom we can't communicate the notion of death to or that can't object to death cognitively is essentially someone we can cut the life out of, then. That's a whole lot of people, beyond babies.  \n  \n  I don't see why objection is a necessary obstacle to the right to be dispensed death; it's another line in the sand I can't quite follow. Why would we be allowed to die if we can't formulate a cognitive objection _and_ not allowed to be killed if we can?  \n  \n  I've seen 6-month old children communicate with rudimentary sign language, which seems to indicate they've passed a cognitive threshold far beyond that of common household pets. And being on the topic, I'm not entirely sure why \"pets\" are a valid comparison point; the fact that we euthanize pets does not inherently make the act defensible.  \n  \n  I'm not a moralist, nor do I believe in the sanctity of life, but the exact threshold of \"180 days\" seems rather arbitrary.  ", "edited": 1492366318.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Someone with whom we can&amp;#39;t communicate the notion of death to or that can&amp;#39;t object to death cognitively is essentially someone we can cut the life out of, then. That&amp;#39;s a whole lot of people, beyond babies.  &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t see why objection is a necessary obstacle to the right to be dispensed death; it&amp;#39;s another line in the sand I can&amp;#39;t quite follow. Why would we be allowed to die if we can&amp;#39;t formulate a cognitive objection &lt;em&gt;and&lt;/em&gt; not allowed to be killed if we can?  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen 6-month old children communicate with rudimentary sign language, which seems to indicate they&amp;#39;ve passed a cognitive threshold far beyond that of common household pets. And being on the topic, I&amp;#39;m not entirely sure why &amp;quot;pets&amp;quot; are a valid comparison point; the fact that we euthanize pets does not inherently make the act defensible.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not a moralist, nor do I believe in the sanctity of life, but the exact threshold of &amp;quot;180 days&amp;quot; seems rather arbitrary.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc4f3f", "score_hidden": false, "stickied": false, "created": 1492383934.0, "created_utc": 1492355134.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgca668", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Sartyrh", "parent_id": "t1_dgc3gct", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "My grandfather was pushed out of the womb in the 1920's at 20 weeks. He was never expected to live.\n\nHe's ~84 now, and has had lung cancer for about the last 4 years. He just won't give up.\n\nIf your only criteria for whether somebody should be able to be killed or not is whether or not they are conscious beings, your argument will far apart very fast.\n\nYour criteria is ridiculous and no more valid than the pro lifers, by the way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My grandfather was pushed out of the womb in the 1920&amp;#39;s at 20 weeks. He was never expected to live.&lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s ~84 now, and has had lung cancer for about the last 4 years. He just won&amp;#39;t give up.&lt;/p&gt;\n\n&lt;p&gt;If your only criteria for whether somebody should be able to be killed or not is whether or not they are conscious beings, your argument will far apart very fast.&lt;/p&gt;\n\n&lt;p&gt;Your criteria is ridiculous and no more valid than the pro lifers, by the way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgca668", "score_hidden": false, "stickied": false, "created": 1492391668.0, "created_utc": 1492362868.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgc3gct", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kluizenaer", "parent_id": "t1_dgc38eq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "Because the singularity is cognitive language.\n\nI believe that etymologically there is no way to differentiate between \"simulating consciousness\" and \"being conscious\" in the end and since you can't tell the difference they must have the same rights. 6months is a reasonable lower bound to ensure a very low ratio of false negatives. Most children have learnt to talk at 3 years.\n\nEssentially all it takes for me is being able to cognitively communicate an understanding that one is about to die and an objection to that and I believe that essentially no baby 6 months or younger can do that. Essentially externally they show no greater signs of cognition than a pet and thus should be awarded the same rights as ultimately you can't differentiate between cognition and showing signs of cognition.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because the singularity is cognitive language.&lt;/p&gt;\n\n&lt;p&gt;I believe that etymologically there is no way to differentiate between &amp;quot;simulating consciousness&amp;quot; and &amp;quot;being conscious&amp;quot; in the end and since you can&amp;#39;t tell the difference they must have the same rights. 6months is a reasonable lower bound to ensure a very low ratio of false negatives. Most children have learnt to talk at 3 years.&lt;/p&gt;\n\n&lt;p&gt;Essentially all it takes for me is being able to cognitively communicate an understanding that one is about to die and an objection to that and I believe that essentially no baby 6 months or younger can do that. Essentially externally they show no greater signs of cognition than a pet and thus should be awarded the same rights as ultimately you can&amp;#39;t differentiate between cognition and showing signs of cognition.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc3gct", "score_hidden": false, "stickied": false, "created": 1492382467.0, "created_utc": 1492353667.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgc38eq", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Noxious_HS", "parent_id": "t1_dgc0qcj", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I'm all ears: why 6 months and not 3 years? Seems awfully arbitrary to me.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m all ears: why 6 months and not 3 years? Seems awfully arbitrary to me.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc38eq", "score_hidden": false, "stickied": false, "created": 1492382128.0, "created_utc": 1492353328.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcj7k0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "GmPrgrmmng", "parent_id": "t1_dgce12h", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Man mute people must be rare as fuck there. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man mute people must be rare as fuck there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcj7k0", "score_hidden": false, "stickied": false, "created": 1492403581.0, "created_utc": 1492374781.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgce12h", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "jinxes_are_pretend", "parent_id": "t1_dgc0qcj", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "It is my understanding that some native tribes don't consider babies fully human with all the rights thereof (including the right to life) until they begin to speak. So even though some posters took umbrage with your comment, it is not outside the observed realm of human behaviors. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is my understanding that some native tribes don&amp;#39;t consider babies fully human with all the rights thereof (including the right to life) until they begin to speak. So even though some posters took umbrage with your comment, it is not outside the observed realm of human behaviors. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgce12h", "score_hidden": false, "stickied": false, "created": 1492396794.0, "created_utc": 1492367994.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcpcrn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Noltonn", "parent_id": "t1_dgc0qcj", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Yep. It's all about when you draw a line at personhood. Agree or disagree with others, it doesn't matter, the fact of the matter is that it depends on wheere you put this arbitrary line. I disagree with your view, I draw the line at the simplest point (conception), but I completely see why you came to your conclusion. Your line is not much more arbitrary than mine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep. It&amp;#39;s all about when you draw a line at personhood. Agree or disagree with others, it doesn&amp;#39;t matter, the fact of the matter is that it depends on wheere you put this arbitrary line. I disagree with your view, I draw the line at the simplest point (conception), but I completely see why you came to your conclusion. Your line is not much more arbitrary than mine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcpcrn", "score_hidden": false, "stickied": false, "created": 1492411723.0, "created_utc": 1492382923.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcv046", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CuddlePirate420", "parent_id": "t1_dgc0qcj", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt; I've long realized that most pro-legal-abortion things posted on this sub aren't interested in convincing anyone who's not already convinced.\n\nIt's not just abortion, it's anything political.  Has anyone ever changed their political stance after reading a reddit post?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;ve long realized that most pro-legal-abortion things posted on this sub aren&amp;#39;t interested in convincing anyone who&amp;#39;s not already convinced.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s not just abortion, it&amp;#39;s anything political.  Has anyone ever changed their political stance after reading a reddit post?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcv046", "score_hidden": false, "stickied": false, "created": 1492419392.0, "created_utc": 1492390592.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgc0qcj", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "Kluizenaer", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "I've long realized that most pro-legal-abortion things posted on this sub aren't interested in convincing anyone who's not already convinced.\n\nThey mean to address the people who are already convinced for page views. If they are actually trying to convince people they are being pretty horrible at it.\n\nI can't believe how many people here treat it like a simple issue of a victim-less crime and aren't even willing to debate the _possibility_ that the fetus qualifies as a human person because that's the point of contention in the debate and they just dismiss it a-priori like they are automatically right without having to argue it.\n\nFor what it's worth, I personally believe babies up til 6 months after birth should still be euthanizeable in a humane way. I think that up till that point normal legal parent obligation should apply and after that point actual legal parent obligations should apply. The difference is that I have arguments for that.", "edited": 1492351264.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve long realized that most pro-legal-abortion things posted on this sub aren&amp;#39;t interested in convincing anyone who&amp;#39;s not already convinced.&lt;/p&gt;\n\n&lt;p&gt;They mean to address the people who are already convinced for page views. If they are actually trying to convince people they are being pretty horrible at it.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t believe how many people here treat it like a simple issue of a victim-less crime and aren&amp;#39;t even willing to debate the &lt;em&gt;possibility&lt;/em&gt; that the fetus qualifies as a human person because that&amp;#39;s the point of contention in the debate and they just dismiss it a-priori like they are automatically right without having to argue it.&lt;/p&gt;\n\n&lt;p&gt;For what it&amp;#39;s worth, I personally believe babies up til 6 months after birth should still be euthanizeable in a humane way. I think that up till that point normal legal parent obligation should apply and after that point actual legal parent obligations should apply. The difference is that I have arguments for that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc0qcj", "score_hidden": false, "stickied": false, "created": 1492377827.0, "created_utc": 1492349027.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcp3hn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Noltonn", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Yeah, people use this very often as the \"ultimate argument against pro-life\". It's just not. You have a core disagreement about the definition of life. It's not about the woman's choice to pro-life people, it's about legalising murder. Agree or disagree with pro-life, at the very least you should try and understand their argument.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, people use this very often as the &amp;quot;ultimate argument against pro-life&amp;quot;. It&amp;#39;s just not. You have a core disagreement about the definition of life. It&amp;#39;s not about the woman&amp;#39;s choice to pro-life people, it&amp;#39;s about legalising murder. Agree or disagree with pro-life, at the very least you should try and understand their argument.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcp3hn", "score_hidden": false, "stickied": false, "created": 1492411362.0, "created_utc": 1492382562.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcq2q5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "notwhoyouthinkiammom", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Yuuuup. People refuse to believe or accept that pro lifers think life begins at conception and the government's job is literally, to protect your right to life. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yuuuup. People refuse to believe or accept that pro lifers think life begins at conception and the government&amp;#39;s job is literally, to protect your right to life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcq2q5", "score_hidden": false, "stickied": false, "created": 1492412710.0, "created_utc": 1492383910.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcu2c4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "diffyqgirl", "parent_id": "t1_dgcc89j", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Yeah it saddens me that the prochoice and the prolife crowd should be on the same page about so much. We should all be campaigning for comprehensive sex ed, insurance to cover BC, etc. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah it saddens me that the prochoice and the prolife crowd should be on the same page about so much. We should all be campaigning for comprehensive sex ed, insurance to cover BC, etc. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcu2c4", "score_hidden": false, "stickied": false, "created": 1492418133.0, "created_utc": 1492389333.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcc89j", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "MegaTrain", "parent_id": "t1_dgc59vz", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt; Pretty sure most republicans don't actually believe it's murder.\n\nNot sure why you'd think that. As a former right-winger, in my experience they are absolutely, completely sincere in their belief on this issue.\n\n&gt; Why do you think they always include exceptions for women who have been raped, or who's lives are at risk?\n\nThey don't actually believe in these exceptions either (very easy to find quotes supporting this, I'll leave that as an exercise to the reader), it's simply a concession they know they have to make, they know they've already lost that argument.\n\n&gt; They just want to punish women who have recreational sex. So they change laws to make it as hard for women as possible to access their healthcare while saying the laws are for 'womens health'.\n\nI'm as critical of the anti-abortion right as you are, but the \"motive\" argument, in my opinion, is not a winning argument.\n\nMuch more effective is the \"what are the proven methods to actually reduce abortion\" argument. Of course the answers are:\n\n1. Comprehensive sex education\n2. Low cost, widely available birth control\n3. Programs to help young and poor mothers (low cost child care, financial support programs for low income families, etc)\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Pretty sure most republicans don&amp;#39;t actually believe it&amp;#39;s murder.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not sure why you&amp;#39;d think that. As a former right-winger, in my experience they are absolutely, completely sincere in their belief on this issue.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Why do you think they always include exceptions for women who have been raped, or who&amp;#39;s lives are at risk?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They don&amp;#39;t actually believe in these exceptions either (very easy to find quotes supporting this, I&amp;#39;ll leave that as an exercise to the reader), it&amp;#39;s simply a concession they know they have to make, they know they&amp;#39;ve already lost that argument.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;They just want to punish women who have recreational sex. So they change laws to make it as hard for women as possible to access their healthcare while saying the laws are for &amp;#39;womens health&amp;#39;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m as critical of the anti-abortion right as you are, but the &amp;quot;motive&amp;quot; argument, in my opinion, is not a winning argument.&lt;/p&gt;\n\n&lt;p&gt;Much more effective is the &amp;quot;what are the proven methods to actually reduce abortion&amp;quot; argument. Of course the answers are:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Comprehensive sex education&lt;/li&gt;\n&lt;li&gt;Low cost, widely available birth control&lt;/li&gt;\n&lt;li&gt;Programs to help young and poor mothers (low cost child care, financial support programs for low income families, etc)&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcc89j", "score_hidden": false, "stickied": false, "created": 1492394376.0, "created_utc": 1492365576.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcktd1", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Ssrithrowawayssri", "parent_id": "t1_dgckhnk", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "In my opinion there are circumstances where killing is the most humane option. I think the parents should be the ones to decide this, not the government. \n\nKilling is not always wrong. If you shot and killed someone in self defense, you still ended someone's life, but it was justified. I think the same can be said for abortion; you're ending a life but sometimes that's justified. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my opinion there are circumstances where killing is the most humane option. I think the parents should be the ones to decide this, not the government. &lt;/p&gt;\n\n&lt;p&gt;Killing is not always wrong. If you shot and killed someone in self defense, you still ended someone&amp;#39;s life, but it was justified. I think the same can be said for abortion; you&amp;#39;re ending a life but sometimes that&amp;#39;s justified. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcktd1", "score_hidden": false, "stickied": false, "created": 1492405682.0, "created_utc": 1492376882.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcwvwp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Hootablob", "parent_id": "t1_dgckhnk", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Pretty sure that's just a compromise. Most pro lifers would prefer that no babies are aborted regardless of how it was conceived.  There are definitely plenty of conservatives that aren't that \"liberal\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pretty sure that&amp;#39;s just a compromise. Most pro lifers would prefer that no babies are aborted regardless of how it was conceived.  There are definitely plenty of conservatives that aren&amp;#39;t that &amp;quot;liberal&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcwvwp", "score_hidden": false, "stickied": false, "created": 1492421821.0, "created_utc": 1492393021.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcv05p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "UWillNeverGetDis", "parent_id": "t1_dgckhnk", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "The same reason most pro-choice people will disagree with killing a 6-month old despite it possessing the qualities of the fetus that is ok to abort.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The same reason most pro-choice people will disagree with killing a 6-month old despite it possessing the qualities of the fetus that is ok to abort.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcv05p", "score_hidden": false, "stickied": false, "created": 1492419394.0, "created_utc": 1492390594.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgckhnk", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "FolkmasterFlex", "parent_id": "t1_dgcbds9", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Then why do so many agree with making exceptions based on incest or rape? How was that make it not murder anymore?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Then why do so many agree with making exceptions based on incest or rape? How was that make it not murder anymore?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgckhnk", "score_hidden": false, "stickied": false, "created": 1492405240.0, "created_utc": 1492376440.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbds9", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "Ssrithrowawayssri", "parent_id": "t1_dgc59vz", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I think it's much more likely that these people think abortion is murder rather than there being some conspiracy to keep women from having recreational sex. You don't really have any proof that would be the case. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s much more likely that these people think abortion is murder rather than there being some conspiracy to keep women from having recreational sex. You don&amp;#39;t really have any proof that would be the case. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcbds9", "score_hidden": false, "stickied": false, "created": 1492393267.0, "created_utc": 1492364467.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcvf49", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CashInPrison", "parent_id": "t1_dgc59vz", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "My family votes red, my mother and sister have both protested, with pictures of aborted fetuses, outside of a *hospital*. They all believe that abortion at any stage, and \"Plan B\" are literal murder. Sure, they'll throw scripture at you, but deep down, they just want to protect babies.\n\nNow that's not everyone, but it's the folks that I know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My family votes red, my mother and sister have both protested, with pictures of aborted fetuses, outside of a &lt;em&gt;hospital&lt;/em&gt;. They all believe that abortion at any stage, and &amp;quot;Plan B&amp;quot; are literal murder. Sure, they&amp;#39;ll throw scripture at you, but deep down, they just want to protect babies.&lt;/p&gt;\n\n&lt;p&gt;Now that&amp;#39;s not everyone, but it&amp;#39;s the folks that I know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcvf49", "score_hidden": false, "stickied": false, "created": 1492419936.0, "created_utc": 1492391136.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgc59vz", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "Lick_The_Wrapper", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Do they? Pretty sure most republicans don't actually  believe it's murder. Why do you think they always include exceptions for women who have been raped, or who's lives are at risk? They just want to punish women who have recreational sex. So they change laws to make it as hard for women as possible to access their healthcare while saying the laws are for 'womens health'. \n\nThey use the 'it's murder' argument to keep their constituents voting for them. Because no one is going to keep voting for you if you try to defund planned parenthood on the basis of you hating women having recreational sex and wanting them to be breeding machines. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do they? Pretty sure most republicans don&amp;#39;t actually  believe it&amp;#39;s murder. Why do you think they always include exceptions for women who have been raped, or who&amp;#39;s lives are at risk? They just want to punish women who have recreational sex. So they change laws to make it as hard for women as possible to access their healthcare while saying the laws are for &amp;#39;womens health&amp;#39;. &lt;/p&gt;\n\n&lt;p&gt;They use the &amp;#39;it&amp;#39;s murder&amp;#39; argument to keep their constituents voting for them. Because no one is going to keep voting for you if you try to defund planned parenthood on the basis of you hating women having recreational sex and wanting them to be breeding machines. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc59vz", "score_hidden": false, "stickied": false, "created": 1492385143.0, "created_utc": 1492356343.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgc3f2t", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "grozamesh", "parent_id": "t1_dgc1ojq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "From what I understand, the view is that IVF clinics are \"Holocaust centers\" those who see it that way.  The difference is that they feel they have more leverage the more mature the fetus.  \n\nBut these arguments were centered around why stem cell research was frozen in the US in the early 2000's under bush.  The fear was that more IVF would take place to feed research, and use of IVF was equivalent to legal genocide.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From what I understand, the view is that IVF clinics are &amp;quot;Holocaust centers&amp;quot; those who see it that way.  The difference is that they feel they have more leverage the more mature the fetus.  &lt;/p&gt;\n\n&lt;p&gt;But these arguments were centered around why stem cell research was frozen in the US in the early 2000&amp;#39;s under bush.  The fear was that more IVF would take place to feed research, and use of IVF was equivalent to legal genocide.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc3f2t", "score_hidden": false, "stickied": false, "created": 1492382411.0, "created_utc": 1492353611.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgctthl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Doctor0000", "parent_id": "t1_dgc1ojq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "The false equivalence here is between viability and murder. The difference being incidental loss of life in an attempt to create, and ending life for the purpose of not having life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The false equivalence here is between viability and murder. The difference being incidental loss of life in an attempt to create, and ending life for the purpose of not having life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgctthl", "score_hidden": false, "stickied": false, "created": 1492417797.0, "created_utc": 1492388997.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcvjax", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CashInPrison", "parent_id": "t1_dgc1ojq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Dude IVF was, and is, highly controversial for exactly these reasons. But frankly, the pictures of aborted fetuses just market better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude IVF was, and is, highly controversial for exactly these reasons. But frankly, the pictures of aborted fetuses just market better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcvjax", "score_hidden": false, "stickied": false, "created": 1492420086.0, "created_utc": 1492391286.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1ojq", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "47South", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I call bullshit on the literal murder part.  Why?  Because these people aren't standing outside of IVF clinics protesting them, shooting the doctors, bombing the clinics, and harassing the patients.\n\nIf a fertilized egg is human life and destroying a fertilized human egg is murder, then IVF clinics are genocidal monstrosities.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I call bullshit on the literal murder part.  Why?  Because these people aren&amp;#39;t standing outside of IVF clinics protesting them, shooting the doctors, bombing the clinics, and harassing the patients.&lt;/p&gt;\n\n&lt;p&gt;If a fertilized egg is human life and destroying a fertilized human egg is murder, then IVF clinics are genocidal monstrosities.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc1ojq", "score_hidden": false, "stickied": false, "created": 1492379601.0, "created_utc": 1492350801.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcwk1e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dazedandlost11", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Thank you for putting it so well.  I'm pro life and believe it's murder to abort.  Pro life and pro choice are such radically different mindsets, that a middle ground is impossible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for putting it so well.  I&amp;#39;m pro life and believe it&amp;#39;s murder to abort.  Pro life and pro choice are such radically different mindsets, that a middle ground is impossible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcwk1e", "score_hidden": false, "stickied": false, "created": 1492421382.0, "created_utc": 1492392582.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcpee3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Drachefly", "parent_id": "t1_dgcmaeg", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt; This was not about abortion.\n\nThis was *technically* not about abortion. It was all about Republican efforts to annihilate Planned Parenthood mostly because of its providing abortions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;This was not about abortion.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This was &lt;em&gt;technically&lt;/em&gt; not about abortion. It was all about Republican efforts to annihilate Planned Parenthood mostly because of its providing abortions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcpee3", "score_hidden": false, "stickied": false, "created": 1492411783.0, "created_utc": 1492382983.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcmaeg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "recyclopath_", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This was not about abortion. This was about access to health care and family planning services through PP and defunding that access. Maybe you should have read the article", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was not about abortion. This was about access to health care and family planning services through PP and defunding that access. Maybe you should have read the article&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcmaeg", "score_hidden": false, "stickied": false, "created": 1492407593.0, "created_utc": 1492378793.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcmu9u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "pwrmaster7", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Yea I'm pro life and you are exactly right. Exactly the argument I would make. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea I&amp;#39;m pro life and you are exactly right. Exactly the argument I would make. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcmu9u", "score_hidden": false, "stickied": false, "created": 1492408323.0, "created_utc": 1492379523.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgclxtw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "totallynotarobotnope", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "You are correct.  No war against stupidity was ever won by someone shouting at a deaf man. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are correct.  No war against stupidity was ever won by someone shouting at a deaf man. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgclxtw", "score_hidden": false, "stickied": false, "created": 1492407134.0, "created_utc": 1492378334.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcrzj9", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ihatetoiron", "parent_id": "t1_dgcoqsq", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I would make sure that my vote have people a choice\n\nEdit: I thought about it, and I would vote for it to be illegal. Here's why:\n\nI'm not vegan, I eat eggs. I don't believe in killing human beings after birth, so I don't believe in killing animals after birth either. Must seem crazy to everyone reading it, but it makes sense to me. ", "edited": 1492392377.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would make sure that my vote have people a choice&lt;/p&gt;\n\n&lt;p&gt;Edit: I thought about it, and I would vote for it to be illegal. Here&amp;#39;s why:&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not vegan, I eat eggs. I don&amp;#39;t believe in killing human beings after birth, so I don&amp;#39;t believe in killing animals after birth either. Must seem crazy to everyone reading it, but it makes sense to me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcrzj9", "score_hidden": false, "stickied": false, "created": 1492415309.0, "created_utc": 1492386509.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcoqsq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Tiammatt", "parent_id": "t1_dgcnfj1", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "So if there was a national referendum and your vote was the deciding factor, who you vote to make eating meat illegal?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So if there was a national referendum and your vote was the deciding factor, who you vote to make eating meat illegal?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcoqsq", "score_hidden": false, "stickied": false, "created": 1492410876.0, "created_utc": 1492382076.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcnfj1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ihatetoiron", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I see what you're saying, but then I apply that logic to something else and can't agree. I'm a vegetarian for ethical reasons, and think that it is murder, and no less atrocious than torturing, murdering, and eating a human being. Despite this, I don't ever try to sway other people into not eating meat ever again. I'll explain my views if they insist on asking me, but I don't make them feel bad about their own choice to eat it and I certainly don't try to take away that choice. I will never understand it, find it funny or lighthearted (e.g \"I just love bacon so much har har har!\" jokes), or condone it. I also know that others just don't see it the same way,  so I accept it and don't see them as lesser people for it.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see what you&amp;#39;re saying, but then I apply that logic to something else and can&amp;#39;t agree. I&amp;#39;m a vegetarian for ethical reasons, and think that it is murder, and no less atrocious than torturing, murdering, and eating a human being. Despite this, I don&amp;#39;t ever try to sway other people into not eating meat ever again. I&amp;#39;ll explain my views if they insist on asking me, but I don&amp;#39;t make them feel bad about their own choice to eat it and I certainly don&amp;#39;t try to take away that choice. I will never understand it, find it funny or lighthearted (e.g &amp;quot;I just love bacon so much har har har!&amp;quot; jokes), or condone it. I also know that others just don&amp;#39;t see it the same way,  so I accept it and don&amp;#39;t see them as lesser people for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcnfj1", "score_hidden": false, "stickied": false, "created": 1492409101.0, "created_utc": 1492380301.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcot6t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BestGarbagePerson", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Except the issue isn't pro-life vs. pro-choice, it's where she can get healthcare. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Except the issue isn&amp;#39;t pro-life vs. pro-choice, it&amp;#39;s where she can get healthcare. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcot6t", "score_hidden": false, "stickied": false, "created": 1492410965.0, "created_utc": 1492382165.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcn4t8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Curururu", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "It's a simple minded and intellectually dishonest way to reframe the question.  Kind of like when pro-lifers decry federal support for abortion rights as \"taking away powers from states\".  Everybody looks foolish.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a simple minded and intellectually dishonest way to reframe the question.  Kind of like when pro-lifers decry federal support for abortion rights as &amp;quot;taking away powers from states&amp;quot;.  Everybody looks foolish.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcn4t8", "score_hidden": false, "stickied": false, "created": 1492408719.0, "created_utc": 1492379919.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgdko35", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MyNameIsUnimportantK", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Louis CK in his newest standup illustrates that argument really well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Louis CK in his newest standup illustrates that argument really well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdko35", "score_hidden": false, "stickied": false, "created": 1492469595.0, "created_utc": 1492440795.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgdla47", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "name_is_arbitrary", "parent_id": "t1_dgby5q5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "The title of this post doesn't include the her whole statement \n&gt;So, I'm wondering, as a Planned Parenthood patient and someone who relies on Title X, who you are clearly not, why it's your right to take away my right to choose Planned Parenthood and to choose no-co-pay birth control, to access that", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The title of this post doesn&amp;#39;t include the her whole statement &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So, I&amp;#39;m wondering, as a Planned Parenthood patient and someone who relies on Title X, who you are clearly not, why it&amp;#39;s your right to take away my right to choose Planned Parenthood and to choose no-co-pay birth control, to access that&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdla47", "score_hidden": false, "stickied": false, "created": 1492470357.0, "created_utc": 1492441557.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgby5q5", "gilded": 0, "archived": false, "score": 989, "report_reasons": null, "author": "Tiammatt", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I'm pro choice, but these platitudes are so empty. Pro life people think it's literal murder: this argument means nothing to them.  Imagine if someone told you you were taking away their right to choose to murder people. You'd laugh or roll your eyes or maybe even feel insulted.  That's how they feel.\n\nIts not a good tack to take, and it's certainly not the mic drop moment people tend to think it is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pro choice, but these platitudes are so empty. Pro life people think it&amp;#39;s literal murder: this argument means nothing to them.  Imagine if someone told you you were taking away their right to choose to murder people. You&amp;#39;d laugh or roll your eyes or maybe even feel insulted.  That&amp;#39;s how they feel.&lt;/p&gt;\n\n&lt;p&gt;Its not a good tack to take, and it&amp;#39;s certainly not the mic drop moment people tend to think it is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgby5q5", "score_hidden": false, "stickied": false, "created": 1492371773.0, "created_utc": 1492342973.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 989}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcoaki", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "WhineyThePooh", "parent_id": "t1_dgc0zc0", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "While I don't entirely disagree with you there, I don't think she is trying to say that his opinion is less valid.  I think she's trying to highlight, for him and for others in the room/viewing the exchange, that the narrow scope of his life experience (something I think all people have to work to see past) could be preventing him from seeing why Planned Parenthood is a valuable resource for people that may not have had the money/support/education/whatever that he had growing up.  This is important when those people are then being directly impacted by his actions as their representative.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While I don&amp;#39;t entirely disagree with you there, I don&amp;#39;t think she is trying to say that his opinion is less valid.  I think she&amp;#39;s trying to highlight, for him and for others in the room/viewing the exchange, that the narrow scope of his life experience (something I think all people have to work to see past) could be preventing him from seeing why Planned Parenthood is a valuable resource for people that may not have had the money/support/education/whatever that he had growing up.  This is important when those people are then being directly impacted by his actions as their representative.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcoaki", "score_hidden": false, "stickied": false, "created": 1492410249.0, "created_utc": 1492381449.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc0zc0", "gilded": 0, "archived": false, "score": 77, "report_reasons": null, "author": "Madpenguin_CH", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I am pro choice but i still immediately dislike any post of format “X slams Y over subject Z“ and any argumentation of the type “you enjoyed some privileges whilst growing up, so now your opinion is less valid“", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am pro choice but i still immediately dislike any post of format “X slams Y over subject Z“ and any argumentation of the type “you enjoyed some privileges whilst growing up, so now your opinion is less valid“&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgc0zc0", "score_hidden": false, "stickied": false, "created": 1492378311.0, "created_utc": 1492349511.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 77}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcp543", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aRabidFurby", "parent_id": "t1_dgcewfz", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I would love it if politicians had to be able to reconcile each their stances on big issues rather than having them stand separate. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would love it if politicians had to be able to reconcile each their stances on big issues rather than having them stand separate. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcp543", "score_hidden": false, "stickied": false, "created": 1492411427.0, "created_utc": 1492382627.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcq6wd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EskimoRocket", "parent_id": "t1_dgcewfz", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "The other thing aside from the issues of overpopulation and economics is that it seems weird for people to think they can exert their moral judgements over others.. if the vast majority of people in society agree that something is wrong, then I see why it would be made illegal. But when it's this split, it basically comes down to one side either forcing the other to abide by their moral values or the other side just getting to practice their moral values. I get that some people see abortion as murder (although I don't think there is much of a rational argument for this if you get down into the nitty gritty philosophical fallacies this notion carries with it) but also some people see aborting an unwanted child that probably a) wouldn't have proper financial support and b) wouldn't be treated properly because their parents don't want to or don't have the means to, as a moral choice. I think it is immoral to have children and condemn them to a subpar or maybe even abusive childhood. If the republicans who thought this was wrong adopted as many children as they could afford, I would be more willing to hear them out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The other thing aside from the issues of overpopulation and economics is that it seems weird for people to think they can exert their moral judgements over others.. if the vast majority of people in society agree that something is wrong, then I see why it would be made illegal. But when it&amp;#39;s this split, it basically comes down to one side either forcing the other to abide by their moral values or the other side just getting to practice their moral values. I get that some people see abortion as murder (although I don&amp;#39;t think there is much of a rational argument for this if you get down into the nitty gritty philosophical fallacies this notion carries with it) but also some people see aborting an unwanted child that probably a) wouldn&amp;#39;t have proper financial support and b) wouldn&amp;#39;t be treated properly because their parents don&amp;#39;t want to or don&amp;#39;t have the means to, as a moral choice. I think it is immoral to have children and condemn them to a subpar or maybe even abusive childhood. If the republicans who thought this was wrong adopted as many children as they could afford, I would be more willing to hear them out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcq6wd", "score_hidden": false, "stickied": false, "created": 1492412872.0, "created_utc": 1492384072.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcewfz", "gilded": 0, "archived": false, "score": 68, "report_reasons": null, "author": "-Mediocrates-", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I think this is a math and money issue.  Unwanted children statistically require more social services throughout their life. A 200 dollar abortion saves millions in taxes; consider welfare and hospital bills and all other things.  As if a woman giving up her child wasn't hard enough already.  Let women choose... let the couple involved choose.  Government shouldn't have a say and they should also front the bill because it's our taxes anyways and will also save a ton in the long run \n\nPro lifers sure seem to be pro war and shun the homeless all the time... ironic", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this is a math and money issue.  Unwanted children statistically require more social services throughout their life. A 200 dollar abortion saves millions in taxes; consider welfare and hospital bills and all other things.  As if a woman giving up her child wasn&amp;#39;t hard enough already.  Let women choose... let the couple involved choose.  Government shouldn&amp;#39;t have a say and they should also front the bill because it&amp;#39;s our taxes anyways and will also save a ton in the long run &lt;/p&gt;\n\n&lt;p&gt;Pro lifers sure seem to be pro war and shun the homeless all the time... ironic&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcewfz", "score_hidden": false, "stickied": false, "created": 1492397969.0, "created_utc": 1492369169.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 68}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgctxuc", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Polaritical", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This wasn't a debate about abortion for the record. It was about efforts to remove planned parenthood as a covered in network provider for health plans. It was about their defacto defunding by arguing they shouldn't be reimbursed for services provided that are covered by insurance because the organization also provides abortions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This wasn&amp;#39;t a debate about abortion for the record. It was about efforts to remove planned parenthood as a covered in network provider for health plans. It was about their defacto defunding by arguing they shouldn&amp;#39;t be reimbursed for services provided that are covered by insurance because the organization also provides abortions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgctxuc", "score_hidden": false, "stickied": false, "created": 1492417963.0, "created_utc": 1492389163.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgd16h1", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "KrishanuAR", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt;Flake said, before adding that he was **one of 11 children** and paid his own college tuition\n\nSounds like Flake could have had an easier childhood if his parents had had access to birth control.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Flake said, before adding that he was &lt;strong&gt;one of 11 children&lt;/strong&gt; and paid his own college tuition&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sounds like Flake could have had an easier childhood if his parents had had access to birth control.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgd16h1", "score_hidden": false, "stickied": false, "created": 1492427838.0, "created_utc": 1492399038.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcpjpi", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Jjmcgrayy", "parent_id": "t1_dgcc2u4", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Instant abort. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Instant abort. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcpjpi", "score_hidden": false, "stickied": false, "created": 1492411981.0, "created_utc": 1492383181.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcc2u4", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "coop882", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I wanted to read this, but then it told me to turn off my adblock so i guess not", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wanted to read this, but then it told me to turn off my adblock so i guess not&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcc2u4", "score_hidden": false, "stickied": false, "created": 1492394177.0, "created_utc": 1492365377.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgd1ymh", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "blbrd30", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "PEOPLE THIS IS NOT A RESTRICTION OF A NEGATIVE RIGHT-STOP TALKING ABOUT IT AS IF IT IS.  Just because it's phrased as a decision on whether or not to take away planned parenthood, it's actually something that requires funding and isn't always going to just be there because you're a human on this earth.  Planned parenthood is a positive right, not a negative right.  That means if resources are tight, decisions are going to have to be made.  Do I think they're making this decision because they're effectively prioritizing and have concluded that this must go? No; I think what's being prioritized is a lot of stupid shit that no one but the 70+ group at the country club care about because they have the money, but that still doesn't mean this is some God-given right that the government is taking away from you.  They're not taking away your virginity or your freedom (i.e. locking you up in a cell).\n\nFor the record, I think planned parenthood should continue to be funded.  I just think this whole thing exposes terrible people's reasoning skills are and how the left reverts to this position of entitlement sometimes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;PEOPLE THIS IS NOT A RESTRICTION OF A NEGATIVE RIGHT-STOP TALKING ABOUT IT AS IF IT IS.  Just because it&amp;#39;s phrased as a decision on whether or not to take away planned parenthood, it&amp;#39;s actually something that requires funding and isn&amp;#39;t always going to just be there because you&amp;#39;re a human on this earth.  Planned parenthood is a positive right, not a negative right.  That means if resources are tight, decisions are going to have to be made.  Do I think they&amp;#39;re making this decision because they&amp;#39;re effectively prioritizing and have concluded that this must go? No; I think what&amp;#39;s being prioritized is a lot of stupid shit that no one but the 70+ group at the country club care about because they have the money, but that still doesn&amp;#39;t mean this is some God-given right that the government is taking away from you.  They&amp;#39;re not taking away your virginity or your freedom (i.e. locking you up in a cell).&lt;/p&gt;\n\n&lt;p&gt;For the record, I think planned parenthood should continue to be funded.  I just think this whole thing exposes terrible people&amp;#39;s reasoning skills are and how the left reverts to this position of entitlement sometimes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgd1ymh", "score_hidden": false, "stickied": false, "created": 1492428977.0, "created_utc": 1492400177.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcpo6w", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Jjmcgrayy", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "There is no rational argument against affordable birth control for all. \n\n\nHowever, no one can deny that the argument with abortion is a valid one.\n\n\nMi matter what side you are in, you should be all for preventing unwanted pregnancies at all costs. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is no rational argument against affordable birth control for all. &lt;/p&gt;\n\n&lt;p&gt;However, no one can deny that the argument with abortion is a valid one.&lt;/p&gt;\n\n&lt;p&gt;Mi matter what side you are in, you should be all for preventing unwanted pregnancies at all costs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcpo6w", "score_hidden": false, "stickied": false, "created": 1492412149.0, "created_utc": 1492383349.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcvdqp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ssrithrowawayssri", "parent_id": "t1_dgcup82", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Good point. I'll have to think that over. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good point. I&amp;#39;ll have to think that over. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcvdqp", "score_hidden": false, "stickied": false, "created": 1492419888.0, "created_utc": 1492391088.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcup82", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mar504", "parent_id": "t1_dgckcv4", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Your view brings a dilemma though. If personhood starts at fertilization, then an abortion would be the equivalent of murder. I'm guessing you wouldn't support a parents ability to kill a 2 year old, 4 year old, etc based on their situation. How do you consolidate this problem? I'm assuming you put more value on the life of a child outside the womb, but if they are both \"people\" then why does one have less of a right to live than another?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your view brings a dilemma though. If personhood starts at fertilization, then an abortion would be the equivalent of murder. I&amp;#39;m guessing you wouldn&amp;#39;t support a parents ability to kill a 2 year old, 4 year old, etc based on their situation. How do you consolidate this problem? I&amp;#39;m assuming you put more value on the life of a child outside the womb, but if they are both &amp;quot;people&amp;quot; then why does one have less of a right to live than another?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcup82", "score_hidden": false, "stickied": false, "created": 1492418986.0, "created_utc": 1492390186.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcp1mx", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Cokaol", "parent_id": "t1_dgckcv4", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Have you ever seen an *embryo* grow into a person out of the womb??", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you ever seen an &lt;em&gt;embryo&lt;/em&gt; grow into a person out of the womb??&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcp1mx", "score_hidden": false, "stickied": false, "created": 1492411288.0, "created_utc": 1492382488.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgckpg5", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "sydofbee", "parent_id": "t1_dgckcv4", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Hm, interesting. For me, there's more to personhood. Maybe you'll get something out of this video on personhood: https://www.youtube.com/watch?v=GxM9BZeRrUI&amp;ab_channel=CrashCourse\n\nIn general, I have to say that I'm not sure when a fetus becomes a person for me. Women are always pregnant to me, not ... I don't know, pregnant with a person (ew?) or just ... carrying a baby. Pregnancy is a condition of the mother to me first, not the creation of a new person.\n\nThat said though, I think people should do what they're comfortable with. If someone's a doctor and they think like you do, they should absolutely be able to refuse to perform an abortion - but they should also defer the case to a colleague who would be open to doing it. Because after all, the woman should have a right to choose, too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hm, interesting. For me, there&amp;#39;s more to personhood. Maybe you&amp;#39;ll get something out of this video on personhood: &lt;a href=\"https://www.youtube.com/watch?v=GxM9BZeRrUI&amp;amp;ab_channel=CrashCourse\"&gt;https://www.youtube.com/watch?v=GxM9BZeRrUI&amp;amp;ab_channel=CrashCourse&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;In general, I have to say that I&amp;#39;m not sure when a fetus becomes a person for me. Women are always pregnant to me, not ... I don&amp;#39;t know, pregnant with a person (ew?) or just ... carrying a baby. Pregnancy is a condition of the mother to me first, not the creation of a new person.&lt;/p&gt;\n\n&lt;p&gt;That said though, I think people should do what they&amp;#39;re comfortable with. If someone&amp;#39;s a doctor and they think like you do, they should absolutely be able to refuse to perform an abortion - but they should also defer the case to a colleague who would be open to doing it. Because after all, the woman should have a right to choose, too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgckpg5", "score_hidden": false, "stickied": false, "created": 1492405537.0, "created_utc": 1492376737.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcyvp3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HumanKapital_", "parent_id": "t1_dgcyoe7", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I don't know a system of a combination of checks and balances where minority rights are protected by the US Constitution.  Oh we have that", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know a system of a combination of checks and balances where minority rights are protected by the US Constitution.  Oh we have that&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcyvp3", "score_hidden": false, "stickied": false, "created": 1492424596.0, "created_utc": 1492395796.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcyoe7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ssrithrowawayssri", "parent_id": "t1_dgcxfm2", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "If you can come up with a better system I'm sure the world would like to hear it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you can come up with a better system I&amp;#39;m sure the world would like to hear it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcyoe7", "score_hidden": false, "stickied": false, "created": 1492424314.0, "created_utc": 1492395514.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcxfm2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HumanKapital_", "parent_id": "t1_dgcv1lm", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Oppression by the masses, it's great when fifty-one percent of the population can oppress the other forty-nine percent.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oppression by the masses, it&amp;#39;s great when fifty-one percent of the population can oppress the other forty-nine percent.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcxfm2", "score_hidden": false, "stickied": false, "created": 1492422573.0, "created_utc": 1492393773.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcv1lm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ssrithrowawayssri", "parent_id": "t1_dgct01l", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Yes. That's how we're doing it now. That's how democracy works. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. That&amp;#39;s how we&amp;#39;re doing it now. That&amp;#39;s how democracy works. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcv1lm", "score_hidden": false, "stickied": false, "created": 1492419446.0, "created_utc": 1492390646.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgct01l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HumanKapital_", "parent_id": "t1_dgckcv4", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "My opinion is that religion should be out-lawed.  Should we start doing things based off people's opinions?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My opinion is that religion should be out-lawed.  Should we start doing things based off people&amp;#39;s opinions?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgct01l", "score_hidden": false, "stickied": false, "created": 1492416707.0, "created_utc": 1492387907.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgckcv4", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Ssrithrowawayssri", "parent_id": "t1_dgcjfqk", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "At fertilization. The way I see it, if it has the full potential to be a living human out of the womb in 9 months, aborting it at any point is ending that life. \n\nMy whole opinion is that abortion is killing a person, always. However, sometimes ending a life is the most humane thing to do in certain circumstances. I think it should be up to the discretion of the parent(s), after all they know what is best for their situation. But I also think doctors should have the ability to refuse to perform an abortion for any reason. Overall the government has no business controlling abortion. The parents best judgment is usually what's most beneficial to all parties involved. There may be some people that exploit this, but I think those people are irrelevantly rare", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At fertilization. The way I see it, if it has the full potential to be a living human out of the womb in 9 months, aborting it at any point is ending that life. &lt;/p&gt;\n\n&lt;p&gt;My whole opinion is that abortion is killing a person, always. However, sometimes ending a life is the most humane thing to do in certain circumstances. I think it should be up to the discretion of the parent(s), after all they know what is best for their situation. But I also think doctors should have the ability to refuse to perform an abortion for any reason. Overall the government has no business controlling abortion. The parents best judgment is usually what&amp;#39;s most beneficial to all parties involved. There may be some people that exploit this, but I think those people are irrelevantly rare&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgckcv4", "score_hidden": false, "stickied": false, "created": 1492405058.0, "created_utc": 1492376258.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjfqk", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "sydofbee", "parent_id": "t1_dgcbmcm", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Honestly curious, where does personhood start for you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly curious, where does personhood start for you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcjfqk", "score_hidden": false, "stickied": false, "created": 1492403872.0, "created_utc": 1492375072.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcp2dd", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Cokaol", "parent_id": "t1_dgclqdc", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "That's a conclusion not a convincing justification", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a conclusion not a convincing justification&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcp2dd", "score_hidden": false, "stickied": false, "created": 1492411318.0, "created_utc": 1492382518.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgd1igh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "peppaz", "parent_id": "t1_dgd0mbl", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "What about them? It's your job, that you signed up for willingly. If you don't want to perform abortions don't become an abortion doctor.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What about them? It&amp;#39;s your job, that you signed up for willingly. If you don&amp;#39;t want to perform abortions don&amp;#39;t become an abortion doctor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgd1igh", "score_hidden": false, "stickied": false, "created": 1492428317.0, "created_utc": 1492399517.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0mbl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "knot_city", "parent_id": "t1_dgclqdc", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "What about the person who has to perform the procedure?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What about the person who has to perform the procedure?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgd0mbl", "score_hidden": false, "stickied": false, "created": 1492427026.0, "created_utc": 1492398226.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgclqdc", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "peppaz", "parent_id": "t1_dgckjkn", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "Right, so let the mother decide", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right, so let the mother decide&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgclqdc", "score_hidden": false, "stickied": false, "created": 1492406859.0, "created_utc": 1492378059.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcriq9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "EskimoRocket", "parent_id": "t1_dgcr44b", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Nobody is making you get an abortion? \n\nSome people think premarital sex is immoral, but that doesn't mean they have the right to stop me from having it. ", "edited": 1492386226.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nobody is making you get an abortion? &lt;/p&gt;\n\n&lt;p&gt;Some people think premarital sex is immoral, but that doesn&amp;#39;t mean they have the right to stop me from having it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcriq9", "score_hidden": false, "stickied": false, "created": 1492414692.0, "created_utc": 1492385892.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrpqm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "EskimoRocket", "parent_id": "t1_dgcr44b", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Similarly, society doesn't mutually agree upon the idea that aborting a pregnancy is murder, so nobody is really at the liberty to call it that. You realize the female human body regularly aborts pregnancies all of the time and you don't even know it? By your logic, women should just never be able to bear children at all because there's a chance the body will abort the fertilized egg. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Similarly, society doesn&amp;#39;t mutually agree upon the idea that aborting a pregnancy is murder, so nobody is really at the liberty to call it that. You realize the female human body regularly aborts pregnancies all of the time and you don&amp;#39;t even know it? By your logic, women should just never be able to bear children at all because there&amp;#39;s a chance the body will abort the fertilized egg. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcrpqm", "score_hidden": false, "stickied": false, "created": 1492414943.0, "created_utc": 1492386143.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd4fk3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Skunk-Bear", "parent_id": "t1_dgcrupx", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt; Have you ever adopted any children? No? Oh, then it appears you haven't aided the massive issue we have of unwanted/abused children in America\n\nSure I have, mostly by not getting pregnant. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Have you ever adopted any children? No? Oh, then it appears you haven&amp;#39;t aided the massive issue we have of unwanted/abused children in America&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sure I have, mostly by not getting pregnant. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgd4fk3", "score_hidden": false, "stickied": false, "created": 1492433040.0, "created_utc": 1492404240.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrupx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EskimoRocket", "parent_id": "t1_dgcr44b", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Have you ever adopted any children? No? Oh, then it appears you haven't aided the massive issue we have of unwanted/abused children in America... you just seem to want to create more of them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you ever adopted any children? No? Oh, then it appears you haven&amp;#39;t aided the massive issue we have of unwanted/abused children in America... you just seem to want to create more of them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcrupx", "score_hidden": false, "stickied": false, "created": 1492415128.0, "created_utc": 1492386328.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcr44b", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Skunk-Bear", "parent_id": "t1_dgcqhz1", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt; If you think abortion is immoral you don't have to ever have one.\n\nIf you think murder is immoral you don't ever have to murder someone. By preventing me from murdering, you are limiting my right to express my moral beliefs. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If you think abortion is immoral you don&amp;#39;t have to ever have one.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you think murder is immoral you don&amp;#39;t ever have to murder someone. By preventing me from murdering, you are limiting my right to express my moral beliefs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcr44b", "score_hidden": false, "stickied": false, "created": 1492414147.0, "created_utc": 1492385347.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqhz1", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "EskimoRocket", "parent_id": "t1_dgckjkn", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "If you think abortion is immoral you don't have to ever have one. Personally, I think having a child I cannot support or do not want is immoral. By preventing me from having an abortion you are limiting my right to express my moral beliefs. \n\nI have personally been on birth control for 5 years and have never been pregnant. But if I became pregnant, I could absolutely not support a child and would seek an abortion. ", "edited": 1492384749.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you think abortion is immoral you don&amp;#39;t have to ever have one. Personally, I think having a child I cannot support or do not want is immoral. By preventing me from having an abortion you are limiting my right to express my moral beliefs. &lt;/p&gt;\n\n&lt;p&gt;I have personally been on birth control for 5 years and have never been pregnant. But if I became pregnant, I could absolutely not support a child and would seek an abortion. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcqhz1", "score_hidden": false, "stickied": false, "created": 1492413304.0, "created_utc": 1492384504.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgckjkn", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "porncrank", "parent_id": "t1_dgcjvb1", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Unfortunately this is something that is open to interpretation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unfortunately this is something that is open to interpretation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgckjkn", "score_hidden": false, "stickied": false, "created": 1492405315.0, "created_utc": 1492376515.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcxjf1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SeventyThreeDegrees", "parent_id": "t1_dgcuxhk", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Even the Bible says it's when god breathed into Adams nostrils and he took his first breath. That's post uterus vagina train.  Not a life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even the Bible says it&amp;#39;s when god breathed into Adams nostrils and he took his first breath. That&amp;#39;s post uterus vagina train.  Not a life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcxjf1", "score_hidden": false, "stickied": false, "created": 1492422721.0, "created_utc": 1492393921.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcuxhk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PontusMagna", "parent_id": "t1_dgcjvb1", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "In your opinion. In theirs, it is. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In your opinion. In theirs, it is. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcuxhk", "score_hidden": false, "stickied": false, "created": 1492419294.0, "created_utc": 1492390494.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjvb1", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "SeventyThreeDegrees", "parent_id": "t1_dgcbmcm", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "But it's not killing a person. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But it&amp;#39;s not killing a person. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcjvb1", "score_hidden": false, "stickied": false, "created": 1492404429.0, "created_utc": 1492375629.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcmmhb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "recyclopath_", "parent_id": "t1_dgcbmcm", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This article is about access to birth control and women's health services through planned Parenthood. Not abortion. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This article is about access to birth control and women&amp;#39;s health services through planned Parenthood. Not abortion. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcmmhb", "score_hidden": false, "stickied": false, "created": 1492408033.0, "created_utc": 1492379233.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbmcm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ssrithrowawayssri", "parent_id": "t1_dgby50o", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "Because killing a person is immoral to some people... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because killing a person is immoral to some people... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcbmcm", "score_hidden": false, "stickied": false, "created": 1492393580.0, "created_utc": 1492364780.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgby50o", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "MySoulIsInHospice", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This article sums up how I feel everytime I see news of laws against women's reproductive rights. How is it their right to take away the rights of other people in regards to an issue that should be between a woman and her doctor. Who are they to say whats best for our reproductive health? Especially since they are not doctors.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This article sums up how I feel everytime I see news of laws against women&amp;#39;s reproductive rights. How is it their right to take away the rights of other people in regards to an issue that should be between a woman and her doctor. Who are they to say whats best for our reproductive health? Especially since they are not doctors.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgby50o", "score_hidden": false, "stickied": false, "created": 1492371716.0, "created_utc": 1492342916.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcvbsr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Harleydamienson", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Republican business people only think about abortion in supply and demand terms, a lot of people equals cheap labor and soldiers. They only use religion and pretending to care about human life as a way to further their agenda. Try to think of another area where republicans are willing to spend money to help someone else. You only have to look at their policies after that unwanted child is born to see what bald faced cynical liars they really are.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Republican business people only think about abortion in supply and demand terms, a lot of people equals cheap labor and soldiers. They only use religion and pretending to care about human life as a way to further their agenda. Try to think of another area where republicans are willing to spend money to help someone else. You only have to look at their policies after that unwanted child is born to see what bald faced cynical liars they really are.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcvbsr", "score_hidden": false, "stickied": false, "created": 1492419816.0, "created_utc": 1492391016.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgclhpl", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ASpiralKnight", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Every law is taking away someones right to choose to do something. That is the nature of law. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Every law is taking away someones right to choose to do something. That is the nature of law. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgclhpl", "score_hidden": false, "stickied": false, "created": 1492406544.0, "created_utc": 1492377744.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcsnwj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EndlessArgument", "parent_id": "t1_dgcpjaz", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This is my exact thought on most of these debates. I'm sitting in the middle trying to weigh the respective issues, but one side seems to be pulling on a rope tied to the wall while the other tries to dig a hole with a broom.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is my exact thought on most of these debates. I&amp;#39;m sitting in the middle trying to weigh the respective issues, but one side seems to be pulling on a rope tied to the wall while the other tries to dig a hole with a broom.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcsnwj", "score_hidden": false, "stickied": false, "created": 1492416235.0, "created_utc": 1492387435.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcpjaz", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Drachefly", "parent_id": "t1_dgcp2g1", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Top comment doesn't say the pro-life argument is *legitimate*; it says that none of this addresses it. You wouldn't know that the pro-life arguments are illegitimate from reading those arguments. It doesn't actually do any good to make these kinds of arguments which don't get at the heart of the opposition.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Top comment doesn&amp;#39;t say the pro-life argument is &lt;em&gt;legitimate&lt;/em&gt;; it says that none of this addresses it. You wouldn&amp;#39;t know that the pro-life arguments are illegitimate from reading those arguments. It doesn&amp;#39;t actually do any good to make these kinds of arguments which don&amp;#39;t get at the heart of the opposition.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcpjaz", "score_hidden": false, "stickied": false, "created": 1492411966.0, "created_utc": 1492383166.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcp2g1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Polaritical", "parent_id": "t1_dgcdb69", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "Can we just go make a second identical version of this sub that isn't a main. \n\nIf I see one more post where the top  3 comments are all about how I'm narrow minded for not considering and viewing the pro-life argument as legitimate I'm going to scream.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can we just go make a second identical version of this sub that isn&amp;#39;t a main. &lt;/p&gt;\n\n&lt;p&gt;If I see one more post where the top  3 comments are all about how I&amp;#39;m narrow minded for not considering and viewing the pro-life argument as legitimate I&amp;#39;m going to scream.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcp2g1", "score_hidden": false, "stickied": false, "created": 1492411321.0, "created_utc": 1492382521.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdb69", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "lucao_psellus", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "Damn, this post got brigaded hard. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn, this post got brigaded hard. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcdb69", "score_hidden": false, "stickied": false, "created": 1492395821.0, "created_utc": 1492367021.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgca9hp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ElectronGuru", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I thought the answer was pretty clear \n\nBecause single issue voters are more likely to vote.\n\nA more interesting question is why reproductive freedom isn't a single issue...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought the answer was pretty clear &lt;/p&gt;\n\n&lt;p&gt;Because single issue voters are more likely to vote.&lt;/p&gt;\n\n&lt;p&gt;A more interesting question is why reproductive freedom isn&amp;#39;t a single issue...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgca9hp", "score_hidden": false, "stickied": false, "created": 1492391789.0, "created_utc": 1492362989.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgchfyf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "hi_im_horse", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "#**SLAMS** ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;h1&gt;&lt;strong&gt;SLAMS&lt;/strong&gt;&lt;/h1&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgchfyf", "score_hidden": false, "stickied": false, "created": 1492401301.0, "created_utc": 1492372501.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgct20j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "leary96", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "I'm a young, practical, pro choice republican, but that isn't slamming him. Sorry. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a young, practical, pro choice republican, but that isn&amp;#39;t slamming him. Sorry. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgct20j", "score_hidden": false, "stickied": false, "created": 1492416783.0, "created_utc": 1492387983.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcpq3l", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Jjmcgrayy", "parent_id": "t1_dgcpep0", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "That's a consistency issue. And yes, 8 hate that shit too. \n\nPick one. An unborn child is just cells, or a person with the right to live. Pick one. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a consistency issue. And yes, 8 hate that shit too. &lt;/p&gt;\n\n&lt;p&gt;Pick one. An unborn child is just cells, or a person with the right to live. Pick one. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcpq3l", "score_hidden": false, "stickied": false, "created": 1492412220.0, "created_utc": 1492383420.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcw6sr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hikoh", "parent_id": "t1_dgcpep0", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "The answer is : when you kill a woman and thereby terminate her body's pregnancy, you have violated her rights twice.\n\nOnce by violating HER right to liberty of HER body remaining pregnant and twice by violating HER right to life. \n\nI don't think a wrongful pregnancy termination should be charged as a homicide UNLESS the fetus was already viable, but it should be a federal crime because it is a violation of her rights for another person to terminate HER body's pregnancy against her will.", "edited": 1492392555.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The answer is : when you kill a woman and thereby terminate her body&amp;#39;s pregnancy, you have violated her rights twice.&lt;/p&gt;\n\n&lt;p&gt;Once by violating HER right to liberty of HER body remaining pregnant and twice by violating HER right to life. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think a wrongful pregnancy termination should be charged as a homicide UNLESS the fetus was already viable, but it should be a federal crime because it is a violation of her rights for another person to terminate HER body&amp;#39;s pregnancy against her will.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcw6sr", "score_hidden": false, "stickied": false, "created": 1492420916.0, "created_utc": 1492392116.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcpep0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "prop764", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 1, "body": "Here's my two cents... It's a double homicide when a pregnant woman is killed. I think people on both sides can agree to that fact. So... Why is it not a single homicide when said pregnant woman's fetus is \"evacuated\"? If a pregnant women is murdered on her way to the abortion clinic to have an abortion, should we still consider it a double murder? I really don't mind either way, but the laws need to be consistent imo. The laws aren't meant to be convenient for a certain demographic (mothers).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s my two cents... It&amp;#39;s a double homicide when a pregnant woman is killed. I think people on both sides can agree to that fact. So... Why is it not a single homicide when said pregnant woman&amp;#39;s fetus is &amp;quot;evacuated&amp;quot;? If a pregnant women is murdered on her way to the abortion clinic to have an abortion, should we still consider it a double murder? I really don&amp;#39;t mind either way, but the laws need to be consistent imo. The laws aren&amp;#39;t meant to be convenient for a certain demographic (mothers).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcpep0", "score_hidden": false, "stickied": false, "created": 1492411794.0, "created_utc": 1492382994.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgcv2ix", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "UWillNeverGetDis", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "**SLAMS**", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;SLAMS&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgcv2ix", "score_hidden": false, "stickied": false, "created": 1492419479.0, "created_utc": 1492390679.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65oi2t", "likes": null, "replies": "", "user_reports": [], "id": "dgczyyd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Trashman667", "parent_id": "t3_65oi2t", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "You could make the same argument about school vouchers. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could make the same argument about school vouchers. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgczyyd", "score_hidden": false, "stickied": false, "created": 1492426112.0, "created_utc": 1492397312.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}]