[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TwoXChromosomes", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My mother grew up in the Missouri Synod Lutheran Church. Her parents were extremely faithful, built their home a block away from their church, and sent both their daughters to the small church school from kindergarten through the 8th grade. &lt;/p&gt;\n\n&lt;p&gt;My mother stayed with the church after school and was married there, with my dad converting to become Lutheran after being raised Methodist. When I was born, I was baptized into this church, and later took confirmation classes there. &lt;/p&gt;\n\n&lt;p&gt;My extended family so deeply believes that it was considered horrifying when one of my cousins married a Baptist and converted - her mother literally believes she will go to hell for being a Baptist instead of LCMS.&lt;/p&gt;\n\n&lt;p&gt;As I got older, I started having questions about Christianity in general, and especially LCMS. I was considering trying out other choices, and in the meantime I took a break from church as I started college.&lt;/p&gt;\n\n&lt;p&gt;Three months into my first semester, my best friend broke down in front of me and told me her boyfriend had raped her. She was not a member of my church, but was deeply Christian and had intended to &amp;quot;save herself&amp;quot; for marriage. After the rape, she was among other things consumed by guilt that she was now &amp;quot;tainted&amp;quot; and no longer a &amp;quot;good Christian girl&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I wanted to comfort her and told her that personally I did not believe rape &amp;quot;counted&amp;quot; as a loss of virginity, but I could tell that didn&amp;#39;t have much impact. At a loss, I emailed my church&amp;#39;s pastor, the only spiritual adviser I ever knew. I explained what happened and asked a simple question - what does the Bible say, if anything? What does the church say? What can I tell my friend?&lt;/p&gt;\n\n&lt;p&gt;Weeks passed with no response. I was disappointed, but assumed my email was lost, that perhaps my pastor didn&amp;#39;t even check his email. &lt;/p&gt;\n\n&lt;p&gt;Over a year later, I returned home for Christmas and happily attended church services. As I shook the pastor&amp;#39;s hand after the service, he smiled at me and said, &amp;quot;I want you to know your email is in my to-do pile, and I&amp;#39;m going to answer you soon.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I walked away in shocked silence. I&amp;#39;d requested immediate help from someone - I had a friend who was depressed and struggling, even self-harming because of this situation, and my pastor had &amp;quot;put it in his to-do pile&amp;quot; for a &lt;em&gt;year&lt;/em&gt;? I realized that he had no way of knowing the girl in my email was actually a friend - it could have just as easily been &lt;strong&gt;me&lt;/strong&gt; who had been raped, who was afraid to admit it an hiding behind a falsehood.&lt;/p&gt;\n\n&lt;p&gt;For me, this was the straw that broke the camel&amp;#39;s back. I never went back to the church. I classified myself first as &amp;quot;spiritual&amp;quot;, then &amp;quot;agnostic&amp;quot; and finally now identify as an atheist. &lt;/p&gt;\n\n&lt;p&gt;A few years ago, when my mom was pressuring me to go to church with her on Easter Sunday, I reluctantly told her this story.  My mother, too, was raped by a boyfriend as a teenager. She&amp;#39;d had similar reactions to my friend - guilt, despair, self-harm - and had never told anyone at the church what happened.&lt;/p&gt;\n\n&lt;p&gt;It took time, but two months ago she called me to say she&amp;#39;d asked the church to remove her as a member. She is 64 years old. When I asked her what influenced her decision, she said, &amp;quot;I had started questioning the church, and then I kept thinking about that email.&amp;quot; She said she thinking about how I reached out to the pastor for help in a crisis, and he never even bother to answer, even though that&amp;#39;s exactly the pastor&amp;#39;s job. She also realized that the answer I&amp;#39;d have gotten probably wasn&amp;#39;t very good, and that the LCMS was probably the &lt;em&gt;reason&lt;/em&gt; why she had such a bad time recovering from her own rape.&lt;/p&gt;\n\n&lt;p&gt;LCMS in many parts of the country is a branch of Christianity that is slowly dying, and this is why. They teach and breed intolerance - of other religions, sexuality, abortion, women. Their young members like me grow up and leave, and their old members either age and die or, like my mom, realize that these beliefs no longer have a place in their homes.&lt;/p&gt;\n\n&lt;p&gt;Most people I meet are unaware of LCMS, or how it differs from the &amp;quot;Lutherans&amp;quot; that people usually tell potluck jokes about, an I think that&amp;#39;s a good thing, because it means they&amp;#39;re completely irrelevant in most people&amp;#39;s lives - including mine.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My mother grew up in the Missouri Synod Lutheran Church. Her parents were extremely faithful, built their home a block away from their church, and sent both their daughters to the small church school from kindergarten through the 8th grade. \n\nMy mother stayed with the church after school and was married there, with my dad converting to become Lutheran after being raised Methodist. When I was born, I was baptized into this church, and later took confirmation classes there. \n\nMy extended family so deeply believes that it was considered horrifying when one of my cousins married a Baptist and converted - her mother literally believes she will go to hell for being a Baptist instead of LCMS.\n\nAs I got older, I started having questions about Christianity in general, and especially LCMS. I was considering trying out other choices, and in the meantime I took a break from church as I started college.\n\nThree months into my first semester, my best friend broke down in front of me and told me her boyfriend had raped her. She was not a member of my church, but was deeply Christian and had intended to \"save herself\" for marriage. After the rape, she was among other things consumed by guilt that she was now \"tainted\" and no longer a \"good Christian girl\".\n\nI wanted to comfort her and told her that personally I did not believe rape \"counted\" as a loss of virginity, but I could tell that didn't have much impact. At a loss, I emailed my church's pastor, the only spiritual adviser I ever knew. I explained what happened and asked a simple question - what does the Bible say, if anything? What does the church say? What can I tell my friend?\n\nWeeks passed with no response. I was disappointed, but assumed my email was lost, that perhaps my pastor didn't even check his email. \n\nOver a year later, I returned home for Christmas and happily attended church services. As I shook the pastor's hand after the service, he smiled at me and said, \"I want you to know your email is in my to-do pile, and I'm going to answer you soon.\"\n\nI walked away in shocked silence. I'd requested immediate help from someone - I had a friend who was depressed and struggling, even self-harming because of this situation, and my pastor had \"put it in his to-do pile\" for a *year*? I realized that he had no way of knowing the girl in my email was actually a friend - it could have just as easily been **me** who had been raped, who was afraid to admit it an hiding behind a falsehood.\n\nFor me, this was the straw that broke the camel's back. I never went back to the church. I classified myself first as \"spiritual\", then \"agnostic\" and finally now identify as an atheist. \n\nA few years ago, when my mom was pressuring me to go to church with her on Easter Sunday, I reluctantly told her this story.  My mother, too, was raped by a boyfriend as a teenager. She'd had similar reactions to my friend - guilt, despair, self-harm - and had never told anyone at the church what happened.\n\nIt took time, but two months ago she called me to say she'd asked the church to remove her as a member. She is 64 years old. When I asked her what influenced her decision, she said, \"I had started questioning the church, and then I kept thinking about that email.\" She said she thinking about how I reached out to the pastor for help in a crisis, and he never even bother to answer, even though that's exactly the pastor's job. She also realized that the answer I'd have gotten probably wasn't very good, and that the LCMS was probably the *reason* why she had such a bad time recovering from her own rape.\n\nLCMS in many parts of the country is a branch of Christianity that is slowly dying, and this is why. They teach and breed intolerance - of other religions, sexuality, abortion, women. Their young members like me grow up and leave, and their old members either age and die or, like my mom, realize that these beliefs no longer have a place in their homes.\n\nMost people I meet are unaware of LCMS, or how it differs from the \"Lutherans\" that people usually tell potluck jokes about, an I think that's a good thing, because it means they're completely irrelevant in most people's lives - including mine.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65wioo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 98, "report_reasons": null, "author": "sidebirch", "saved": false, "mod_reports": [], "name": "t3_65wioo", "subreddit_name_prefixed": "r/TwoXChromosomes", "approved_by": null, "over_18": false, "domain": "self.TwoXChromosomes", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r2jt", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TwoXChromosomes/comments/65wioo/after_a_lifetime_my_mother_ended_her_church/", "num_reports": null, "locked": false, "stickied": false, "created": 1492474567.0, "url": "https://www.reddit.com/r/TwoXChromosomes/comments/65wioo/after_a_lifetime_my_mother_ended_her_church/", "author_flair_text": null, "quarantine": false, "title": "After a lifetime, my mother ended her church membership over an email her pastor didn't send 10 years ago", "created_utc": 1492445767.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 30, "visited": false, "subreddit_type": "public", "ups": 98}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": "", "user_reports": [], "id": "dgdsoog", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "gensleuth", "parent_id": "t1_dgdqww4", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This makes me sad. She is not \"tainted.\" Growing up in a conservative church can really skew one's view of healthy sex and self worth. It is particularly damaging to females as males are more easily forgiven - even for rape. One of my daughter's friends was sexually assaulted and the girl called the boy's Baptist youth group pastor. The church did nothing. It seriously hurt my daughter's view of that church and leadership in general. \n\nI hope your friend can one day see therapy/counseling as a positive thing. Maybe you could call a rape crisis center and get some feedback on a good therapist and give her the information with no pressure.  The crisis center would be able to confirm whether this approach is correct. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This makes me sad. She is not &amp;quot;tainted.&amp;quot; Growing up in a conservative church can really skew one&amp;#39;s view of healthy sex and self worth. It is particularly damaging to females as males are more easily forgiven - even for rape. One of my daughter&amp;#39;s friends was sexually assaulted and the girl called the boy&amp;#39;s Baptist youth group pastor. The church did nothing. It seriously hurt my daughter&amp;#39;s view of that church and leadership in general. &lt;/p&gt;\n\n&lt;p&gt;I hope your friend can one day see therapy/counseling as a positive thing. Maybe you could call a rape crisis center and get some feedback on a good therapist and give her the information with no pressure.  The crisis center would be able to confirm whether this approach is correct. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdsoog", "score_hidden": false, "stickied": false, "created": 1492478776.0, "created_utc": 1492449976.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqww4", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "sidebirch", "parent_id": "t1_dgdqj85", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "She still has a lot of issues around sex and relationships, honestly. She does well on a day to day basis - lots of friends, a good job, a supportive family - but probably still is in need of some formal therapy or counselling to deal with what happened. \n\nShe gave up on \"saving herself\" and started having sex but still sees sex as a \"bad\" thing - like, she'll call me up and tell me that a man she's seeing spent the night \"but nothing bad happened\" and when she says that she means sexual activity, not just actual bad things like rape. \"Nothing bad happened\" to her means \"*I* wasn't a *bad girl* and I didn't *let* him sleep with me\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She still has a lot of issues around sex and relationships, honestly. She does well on a day to day basis - lots of friends, a good job, a supportive family - but probably still is in need of some formal therapy or counselling to deal with what happened. &lt;/p&gt;\n\n&lt;p&gt;She gave up on &amp;quot;saving herself&amp;quot; and started having sex but still sees sex as a &amp;quot;bad&amp;quot; thing - like, she&amp;#39;ll call me up and tell me that a man she&amp;#39;s seeing spent the night &amp;quot;but nothing bad happened&amp;quot; and when she says that she means sexual activity, not just actual bad things like rape. &amp;quot;Nothing bad happened&amp;quot; to her means &amp;quot;&lt;em&gt;I&lt;/em&gt; wasn&amp;#39;t a &lt;em&gt;bad girl&lt;/em&gt; and I didn&amp;#39;t &lt;em&gt;let&lt;/em&gt; him sleep with me&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdqww4", "score_hidden": false, "stickied": false, "created": 1492476803.0, "created_utc": 1492448003.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqj85", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "gensleuth", "parent_id": "t3_65wioo", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "How is your friend doing today? It makes me ill to think of the pastor's response. It is negligence and a breach of trust. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How is your friend doing today? It makes me ill to think of the pastor&amp;#39;s response. It is negligence and a breach of trust. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdqj85", "score_hidden": false, "stickied": false, "created": 1492476382.0, "created_utc": 1492447582.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": "", "user_reports": [], "id": "dgdrhu6", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "imabsolutelyatwork", "parent_id": "t3_65wioo", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I was raised in a Lutheran church but wasn't particularly religious once I reached Elementary school. I had no idea there were other sects of the Lutheran faith. I guess I was lucky enough to be raised in a rather tolerant church with a number of the young people who attended being trans/queer (myself included) and I never noticed anyone being explicitly intolerant or dismissive beside some of the \"church elders\" which part of me chops up to them just being older and having grown up in a small community. Although if I think my pastor had been in a similar situation, I'm not sure how he'd have responded and that kind of upsets me. Then again, he wasn't too fond of me after I would routinely question his logic. I'm sorry about what you had to experience, and even more so for your friend. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was raised in a Lutheran church but wasn&amp;#39;t particularly religious once I reached Elementary school. I had no idea there were other sects of the Lutheran faith. I guess I was lucky enough to be raised in a rather tolerant church with a number of the young people who attended being trans/queer (myself included) and I never noticed anyone being explicitly intolerant or dismissive beside some of the &amp;quot;church elders&amp;quot; which part of me chops up to them just being older and having grown up in a small community. Although if I think my pastor had been in a similar situation, I&amp;#39;m not sure how he&amp;#39;d have responded and that kind of upsets me. Then again, he wasn&amp;#39;t too fond of me after I would routinely question his logic. I&amp;#39;m sorry about what you had to experience, and even more so for your friend. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdrhu6", "score_hidden": false, "stickied": false, "created": 1492477448.0, "created_utc": 1492448648.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": "", "user_reports": [], "id": "dgdrxg9", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "kyreannightblood", "parent_id": "t3_65wioo", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Ugh, Missouri Synod Lutherans abused the shit outta me my entire childhood and left me bitter and angry with anxiety and depression and c-PTSD. *Fuck them.* \n\nGlad your mom got out, even if it's late in her life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ugh, Missouri Synod Lutherans abused the shit outta me my entire childhood and left me bitter and angry with anxiety and depression and c-PTSD. &lt;em&gt;Fuck them.&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;Glad your mom got out, even if it&amp;#39;s late in her life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdrxg9", "score_hidden": false, "stickied": false, "created": 1492477938.0, "created_utc": 1492449138.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": "", "user_reports": [], "id": "dgdyj5h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sidebirch", "parent_id": "t1_dgdxsp5", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Yeah, I googled it after your comment and it does look like the official teaching is that Jesus's actual body and blood are *present* at communion but there's not a literal transformation. Well. Just another example that pastors are human and make mistakes, I guess. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I googled it after your comment and it does look like the official teaching is that Jesus&amp;#39;s actual body and blood are &lt;em&gt;present&lt;/em&gt; at communion but there&amp;#39;s not a literal transformation. Well. Just another example that pastors are human and make mistakes, I guess. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdyj5h", "score_hidden": true, "stickied": false, "created": 1492485314.0, "created_utc": 1492456514.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdxsp5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TrueBlonde", "parent_id": "t1_dgdvo36", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Yeah whoa. I'm not super into church doctrine or anything, but that is tottttttttally contrary to Lutheran teachings.\n\nFrom what I remember from Confirmation classes (it's been awhile), it's somewhere in between being the actual body/blood and being a symbol. So it's not the actual body and blood, but it's more than a symbol, but it's still bread and wine. Doesn't make a ton of sense to me (it didn't then either).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah whoa. I&amp;#39;m not super into church doctrine or anything, but that is tottttttttally contrary to Lutheran teachings.&lt;/p&gt;\n\n&lt;p&gt;From what I remember from Confirmation classes (it&amp;#39;s been awhile), it&amp;#39;s somewhere in between being the actual body/blood and being a symbol. So it&amp;#39;s not the actual body and blood, but it&amp;#39;s more than a symbol, but it&amp;#39;s still bread and wine. Doesn&amp;#39;t make a ton of sense to me (it didn&amp;#39;t then either).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdxsp5", "score_hidden": true, "stickied": false, "created": 1492484479.0, "created_utc": 1492455679.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvo36", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sidebirch", "parent_id": "t1_dgdvjmr", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "According to the church I grew up in they do. I directly questioned my pastor on this during my confirmation classes and the \"This IS my body\" statement that mentioned is word for word what he told me - the wine and wafers literally become the body and blood of Christ, not just a symbol of them.\n\nIt's possible that he was misleading us and this isn't a belief of LCMS at large, but it is what I was taught.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;According to the church I grew up in they do. I directly questioned my pastor on this during my confirmation classes and the &amp;quot;This IS my body&amp;quot; statement that mentioned is word for word what he told me - the wine and wafers literally become the body and blood of Christ, not just a symbol of them.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s possible that he was misleading us and this isn&amp;#39;t a belief of LCMS at large, but it is what I was taught.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdvo36", "score_hidden": false, "stickied": false, "created": 1492482075.0, "created_utc": 1492453275.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvjmr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TrueBlonde", "parent_id": "t1_dgdtvqz", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Whoa whoa whoa whoa whoa, the LCMS does NOT believe in transubstantiation. That's only a Catholic thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whoa whoa whoa whoa whoa, the LCMS does NOT believe in transubstantiation. That&amp;#39;s only a Catholic thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdvjmr", "score_hidden": false, "stickied": false, "created": 1492481938.0, "created_utc": 1492453138.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": "", "user_reports": [], "id": "dgdukyn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SuperbOwlSundae", "parent_id": "t1_dgdtvqz", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Did they have tassels on the corners of their clothing?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did they have tassels on the corners of their clothing?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdukyn", "score_hidden": false, "stickied": false, "created": 1492480862.0, "created_utc": 1492452062.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtvqz", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "sidebirch", "parent_id": "t1_dgdrqua", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Basically the LCMS is more literalist than ECLA - they take scripture and the teachings of Martin Luther literally whereas ECLA is more flexible. For example, LCMS believes in transubstantiation - that during communion the wine and bread become literally Jesus' flesh and blood - because Jesus in the last supper says \"This *is* my body. This *is* my blood.\"\n\nThat kind of carries over in a general way to ECLA churches being more liberal - some have female pastors and welcome LGBT members - whereas LCMS believes homosexuality is a sin, women cannot be pastors, and abortion is absolutely murder even in cases of rape or incest.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Basically the LCMS is more literalist than ECLA - they take scripture and the teachings of Martin Luther literally whereas ECLA is more flexible. For example, LCMS believes in transubstantiation - that during communion the wine and bread become literally Jesus&amp;#39; flesh and blood - because Jesus in the last supper says &amp;quot;This &lt;em&gt;is&lt;/em&gt; my body. This &lt;em&gt;is&lt;/em&gt; my blood.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That kind of carries over in a general way to ECLA churches being more liberal - some have female pastors and welcome LGBT members - whereas LCMS believes homosexuality is a sin, women cannot be pastors, and abortion is absolutely murder even in cases of rape or incest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdtvqz", "score_hidden": false, "stickied": false, "created": 1492480097.0, "created_utc": 1492451297.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrqua", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "SuperbOwlSundae", "parent_id": "t1_dgdr8o7", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "What's the difference?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What&amp;#39;s the difference?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdrqua", "score_hidden": false, "stickied": false, "created": 1492477730.0, "created_utc": 1492448930.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": "", "user_reports": [], "id": "dge2535", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sidebirch", "parent_id": "t1_dge0yyg", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "It's always possible. When I was in high school I remember we did a unit in my sunday school group on other religions, and if I could go back in time I'd tape that shit. The stuff they told us about other religions - including other branches of Christianity - is truly amazing in retrospect. \n\nI was well into college before I found out most people believe both Catholics and Mormons are Christians.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s always possible. When I was in high school I remember we did a unit in my sunday school group on other religions, and if I could go back in time I&amp;#39;d tape that shit. The stuff they told us about other religions - including other branches of Christianity - is truly amazing in retrospect. &lt;/p&gt;\n\n&lt;p&gt;I was well into college before I found out most people believe both Catholics and Mormons are Christians.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dge2535", "score_hidden": true, "stickied": false, "created": 1492489383.0, "created_utc": 1492460583.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge0yyg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mega_trex", "parent_id": "t1_dgdr8o7", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Did we go to the same church? I was told they weren't real Lutherans because they were ok with gay marriage.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did we go to the same church? I was told they weren&amp;#39;t real Lutherans because they were ok with gay marriage.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dge0yyg", "score_hidden": true, "stickied": false, "created": 1492488073.0, "created_utc": 1492459273.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdr8o7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sidebirch", "parent_id": "t1_dgdqj5b", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I went through a brief period of fascinating with ECLA and considered attending services. My LCMS church never acknowledged that ECLA even existed. When I got older, I remember asking a Sunday school teacher why we didn't ever do anything with our town's other Lutheran church and he told me they weren't \"real\" Lutherans.\n\nI now understand that he meant it in the same way he claimed that Catholics are \"not real Christians\" and grouped ECLA members alongside the Baptists, Methodists, Presbyterians, etc that he argued would all be damned for not being the right type of Christian.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went through a brief period of fascinating with ECLA and considered attending services. My LCMS church never acknowledged that ECLA even existed. When I got older, I remember asking a Sunday school teacher why we didn&amp;#39;t ever do anything with our town&amp;#39;s other Lutheran church and he told me they weren&amp;#39;t &amp;quot;real&amp;quot; Lutherans.&lt;/p&gt;\n\n&lt;p&gt;I now understand that he meant it in the same way he claimed that Catholics are &amp;quot;not real Christians&amp;quot; and grouped ECLA members alongside the Baptists, Methodists, Presbyterians, etc that he argued would all be damned for not being the right type of Christian.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdr8o7", "score_hidden": false, "stickied": false, "created": 1492477167.0, "created_utc": 1492448367.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqj5b", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "greviousmisadventure", "parent_id": "t3_65wioo", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I grew up attending a Lutheran church under the ELCA. While they aren't the same as the Missouri Synod, I feel your pain. There is a lot of hypocrisy and weird viewpoints that come from these groups which is why I eventually became agnostic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I grew up attending a Lutheran church under the ELCA. While they aren&amp;#39;t the same as the Missouri Synod, I feel your pain. There is a lot of hypocrisy and weird viewpoints that come from these groups which is why I eventually became agnostic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdqj5b", "score_hidden": false, "stickied": false, "created": 1492476380.0, "created_utc": 1492447580.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": "", "user_reports": [], "id": "dgdty00", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "KrystinLashley", "parent_id": "t3_65wioo", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Thank you for telling your story 📚 ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for telling your story 📚 &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdty00", "score_hidden": false, "stickied": false, "created": 1492480166.0, "created_utc": 1492451366.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": "", "user_reports": [], "id": "dgdsmys", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "TrueBlonde", "parent_id": "t1_dgdqp7a", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "That's fair. The one I attend now is much more ELCA-like - it's very open and tolerant. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s fair. The one I attend now is much more ELCA-like - it&amp;#39;s very open and tolerant. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdsmys", "score_hidden": false, "stickied": false, "created": 1492478724.0, "created_utc": 1492449924.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqp7a", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "sidebirch", "parent_id": "t1_dgdqe2b", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Well, a lot of the *doctrine* is pretty intolerant, that's hard to argue against, but I'll agree that doesn't mean every LCMS pastor or congregation is the type that would ignore a parishioner during a crisis. I've visited a couple other LCMS churches but never had any major contact with them outside of my home church. I would certainly *hope* that most pastors and church members are kind and caring people who are genuinely interested in looking out for each other.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, a lot of the &lt;em&gt;doctrine&lt;/em&gt; is pretty intolerant, that&amp;#39;s hard to argue against, but I&amp;#39;ll agree that doesn&amp;#39;t mean every LCMS pastor or congregation is the type that would ignore a parishioner during a crisis. I&amp;#39;ve visited a couple other LCMS churches but never had any major contact with them outside of my home church. I would certainly &lt;em&gt;hope&lt;/em&gt; that most pastors and church members are kind and caring people who are genuinely interested in looking out for each other.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdqp7a", "score_hidden": false, "stickied": false, "created": 1492476563.0, "created_utc": 1492447763.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqe2b", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "TrueBlonde", "parent_id": "t3_65wioo", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "To be fair - that's not necessarily indicative of a problem with Christianity or LCMS churches. I was also raised LCMS. I asked a similar question to my pastor and he responded the next day. When I was going through a terrible break-up after college, at a new LCMS church, the pastor who hardly knew me met with me at a Starbucks and just let me cry with him. Women at the church who hardly knew me made sure to sit with me at church, took me out to lunch, and would check in on me during the week.\n\nI know this wasn't your intention with the post - but I don't want LCMS churches to all be unfairly categorized as intolerant, uncaring places.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To be fair - that&amp;#39;s not necessarily indicative of a problem with Christianity or LCMS churches. I was also raised LCMS. I asked a similar question to my pastor and he responded the next day. When I was going through a terrible break-up after college, at a new LCMS church, the pastor who hardly knew me met with me at a Starbucks and just let me cry with him. Women at the church who hardly knew me made sure to sit with me at church, took me out to lunch, and would check in on me during the week.&lt;/p&gt;\n\n&lt;p&gt;I know this wasn&amp;#39;t your intention with the post - but I don&amp;#39;t want LCMS churches to all be unfairly categorized as intolerant, uncaring places.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdqe2b", "score_hidden": false, "stickied": false, "created": 1492476227.0, "created_utc": 1492447427.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": "", "user_reports": [], "id": "dgdra86", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "remembersarah18", "parent_id": "t3_65wioo", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "R/exchristian would love this story. Proud of you and your mom. Hugs to all of you and your friend. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;R/exchristian would love this story. Proud of you and your mom. Hugs to all of you and your friend. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdra86", "score_hidden": false, "stickied": false, "created": 1492477215.0, "created_utc": 1492448415.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": "", "user_reports": [], "id": "dgduylh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sir_Loin_Cloth", "parent_id": "t3_65wioo", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I'm sorry for your mother, your friend and your experience. I grew up in the Wisconsin Evangelical Lutheran Synod which split from the Missouri Synod. I don't know much about the history of the split or the theological differences , but in comparison two other forms of Christianity I feel they're probably pretty similar. However, I'm sure the leaders of both synods disagree completely. I know WELS looks down on the Missouri Synod and God help you if you belong to the dangerously open-minded Evangelical Lutheran Church of America. They tolerate and condone homosexuality! Gasp! I too have witnessed intolerance, bigotry, closet-racism and judgement from a sect that truly views itself as not judgemental. My mother was excommunicated from our church for divorcing my dad. There was no marital unfaithfulness or physical abuse, so in the eyes of the church it was not warranted in the eyes of God and therefore, a sin deserving excommunication. The elders of this very small, close-knit congregation  condescended direct judgement using unsound theological law. It didn't matter that she worshipped with them nearly every Sunday, participated in every church event, hosted parties, quietly assisted some of the less-fortunate families  of the church, volunteered with the parochial School attached to the church, taught Sunday School, etc. The list goes on. In a nutshell, a very dedicated, faithful and involved member for nearly twenty years. I know many amazing and beautiful Christians, but the overarching, nonsensical canon of secular (they would say \"spiritual\") law that promotes an atmosphere of judgment and bigotry started making zero sense to me. I was already struggling with the concept of the Christian God and the hypocrisy of organized religion, but the excommunication of my mother was the last straw for me. Now, she is still a faithful non-denominational Christian , however, one of the least judgemental and open-minded ones I have known. I know there are many others like her, but the foundation of organized religion has allowed for a non-taxable corporate entity to steal from people's wholehearted charity while at the same time detaching and diluting spirituality. Sorry for the rant. I know it was a bit convoluted but I had to express my empathy. Your post reopened an old sore. I hope you guys have found the peace I have in removing yourselves from theological tyranny. Congratulations to your mother, she sounds like a strong and practical woman!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry for your mother, your friend and your experience. I grew up in the Wisconsin Evangelical Lutheran Synod which split from the Missouri Synod. I don&amp;#39;t know much about the history of the split or the theological differences , but in comparison two other forms of Christianity I feel they&amp;#39;re probably pretty similar. However, I&amp;#39;m sure the leaders of both synods disagree completely. I know WELS looks down on the Missouri Synod and God help you if you belong to the dangerously open-minded Evangelical Lutheran Church of America. They tolerate and condone homosexuality! Gasp! I too have witnessed intolerance, bigotry, closet-racism and judgement from a sect that truly views itself as not judgemental. My mother was excommunicated from our church for divorcing my dad. There was no marital unfaithfulness or physical abuse, so in the eyes of the church it was not warranted in the eyes of God and therefore, a sin deserving excommunication. The elders of this very small, close-knit congregation  condescended direct judgement using unsound theological law. It didn&amp;#39;t matter that she worshipped with them nearly every Sunday, participated in every church event, hosted parties, quietly assisted some of the less-fortunate families  of the church, volunteered with the parochial School attached to the church, taught Sunday School, etc. The list goes on. In a nutshell, a very dedicated, faithful and involved member for nearly twenty years. I know many amazing and beautiful Christians, but the overarching, nonsensical canon of secular (they would say &amp;quot;spiritual&amp;quot;) law that promotes an atmosphere of judgment and bigotry started making zero sense to me. I was already struggling with the concept of the Christian God and the hypocrisy of organized religion, but the excommunication of my mother was the last straw for me. Now, she is still a faithful non-denominational Christian , however, one of the least judgemental and open-minded ones I have known. I know there are many others like her, but the foundation of organized religion has allowed for a non-taxable corporate entity to steal from people&amp;#39;s wholehearted charity while at the same time detaching and diluting spirituality. Sorry for the rant. I know it was a bit convoluted but I had to express my empathy. Your post reopened an old sore. I hope you guys have found the peace I have in removing yourselves from theological tyranny. Congratulations to your mother, she sounds like a strong and practical woman!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgduylh", "score_hidden": false, "stickied": false, "created": 1492481280.0, "created_utc": 1492452480.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": "", "user_reports": [], "id": "dge1cve", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "deedee25252", "parent_id": "t1_dge00u1", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "My husband is the catholic. He says he's a bad one. He used to go every Sunday and holiday with his mom. We had a mass for our wedding. (After many \"classes\") \n\nNow he doesn't care. He goes because his mom asks him too (for holidays)  I go to support him. I try to hide my eye rolling as much as possible. \n\nCatholicism is ridiculous. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My husband is the catholic. He says he&amp;#39;s a bad one. He used to go every Sunday and holiday with his mom. We had a mass for our wedding. (After many &amp;quot;classes&amp;quot;) &lt;/p&gt;\n\n&lt;p&gt;Now he doesn&amp;#39;t care. He goes because his mom asks him too (for holidays)  I go to support him. I try to hide my eye rolling as much as possible. &lt;/p&gt;\n\n&lt;p&gt;Catholicism is ridiculous. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dge1cve", "score_hidden": true, "stickied": false, "created": 1492488509.0, "created_utc": 1492459709.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge00u1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sidebirch", "parent_id": "t1_dgdzjn8", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "&gt; I loath my mother in law and her sister for pushing that shit on my daughter who is 5 and impressionable.\n\nOne of the comments I got from my mom after she quit the church was an apology. She said, \"As a kid I hated that my parents drug me to that church every Sunday, and as a teenager I swore I'd never do that to my child the way they did me. I'm sorry I did the same thing to you anyway, I guess I just didn't know what else to do.\"\n\nIn my mom's generation I guess it was pretty common to question religion in your teens and twenties but then go back to church when you had kids. I still see some of this in friends my age who are having children but it doesn't seem as common as it was 30 years ago. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I loath my mother in law and her sister for pushing that shit on my daughter who is 5 and impressionable.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;One of the comments I got from my mom after she quit the church was an apology. She said, &amp;quot;As a kid I hated that my parents drug me to that church every Sunday, and as a teenager I swore I&amp;#39;d never do that to my child the way they did me. I&amp;#39;m sorry I did the same thing to you anyway, I guess I just didn&amp;#39;t know what else to do.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;In my mom&amp;#39;s generation I guess it was pretty common to question religion in your teens and twenties but then go back to church when you had kids. I still see some of this in friends my age who are having children but it doesn&amp;#39;t seem as common as it was 30 years ago. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dge00u1", "score_hidden": true, "stickied": false, "created": 1492487008.0, "created_utc": 1492458208.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzjn8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "deedee25252", "parent_id": "t3_65wioo", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "This is why \"some\" religions are a pox and should be removed or ignored until they pop on their own. I loath the church. I loath my mother in law and her sister for pushing that shit on my daughter who is 5 and impressionable.  \n\n\nNope you will not make her feel less of a person for your bullshit religion. I will happily not allow them near her if they continue that shit. Grrrrr.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is why &amp;quot;some&amp;quot; religions are a pox and should be removed or ignored until they pop on their own. I loath the church. I loath my mother in law and her sister for pushing that shit on my daughter who is 5 and impressionable.  &lt;/p&gt;\n\n&lt;p&gt;Nope you will not make her feel less of a person for your bullshit religion. I will happily not allow them near her if they continue that shit. Grrrrr.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdzjn8", "score_hidden": true, "stickied": false, "created": 1492486472.0, "created_utc": 1492457672.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": "", "user_reports": [], "id": "dge0je2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Glewellin", "parent_id": "t3_65wioo", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Thank you for this. My mother was raised in the church and left around when I was born precisely because of their teachings about women. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for this. My mother was raised in the church and left around when I was born precisely because of their teachings about women. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dge0je2", "score_hidden": true, "stickied": false, "created": 1492487584.0, "created_utc": 1492458784.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": "", "user_reports": [], "id": "dge0tqv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mega_trex", "parent_id": "t3_65wioo", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I grew up lcms too, now agnostic. I didn't realize how intolerant and sexist the doctrine was until I was out of it. While I was growing up I thought my parents raise me to be fairly liberal, but now looking back I realized how brainwashed I was. In the same time I was in sex ed at school my parents put me through a class at church teaching me that birth control, premarital sex, and masturbation are wrong. Women couldn't be pastors, but that was ok because they could decorate the alter instead ??? And just so many made up statistics and \"facts\" to justify what they taught. Plus so many topics were not up for discussion, you either agreed or you were sinning. That shit follows you for life even if you're not religious anymore. It's gross. \n\nNote: I can't say this applies to all lcms churches, just my experience. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I grew up lcms too, now agnostic. I didn&amp;#39;t realize how intolerant and sexist the doctrine was until I was out of it. While I was growing up I thought my parents raise me to be fairly liberal, but now looking back I realized how brainwashed I was. In the same time I was in sex ed at school my parents put me through a class at church teaching me that birth control, premarital sex, and masturbation are wrong. Women couldn&amp;#39;t be pastors, but that was ok because they could decorate the alter instead ??? And just so many made up statistics and &amp;quot;facts&amp;quot; to justify what they taught. Plus so many topics were not up for discussion, you either agreed or you were sinning. That shit follows you for life even if you&amp;#39;re not religious anymore. It&amp;#39;s gross. &lt;/p&gt;\n\n&lt;p&gt;Note: I can&amp;#39;t say this applies to all lcms churches, just my experience. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dge0tqv", "score_hidden": true, "stickied": false, "created": 1492487909.0, "created_utc": 1492459109.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2jt", "removal_reason": null, "link_id": "t3_65wioo", "likes": null, "replies": "", "user_reports": [], "id": "dgdt7da", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "itusedtobeagoodname", "parent_id": "t1_dgdrngg", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "I was going to ask if he ever got around to sending an email, since it wasn't clear.  Wow.  So, just as a human being, I would make damn sure that I sent an email back immediately upon receipt to let you know I'd received it.  And, if I felt out of my depth, I'd communicate as much and do my best to direct you to someone who I thought could help you better.  The idea that someone who chose a profession that handles those kinds of times of crisis as a main bullet point of their job would ignore the issue for well over a year is disturbing.  I see it a lot less as a Christian thing and more of that guy failing to do the most important part of his job.  I can't speak to anything LCMS related, as I'm not familiar, but I totally get being jaded by church experiences.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was going to ask if he ever got around to sending an email, since it wasn&amp;#39;t clear.  Wow.  So, just as a human being, I would make damn sure that I sent an email back immediately upon receipt to let you know I&amp;#39;d received it.  And, if I felt out of my depth, I&amp;#39;d communicate as much and do my best to direct you to someone who I thought could help you better.  The idea that someone who chose a profession that handles those kinds of times of crisis as a main bullet point of their job would ignore the issue for well over a year is disturbing.  I see it a lot less as a Christian thing and more of that guy failing to do the most important part of his job.  I can&amp;#39;t speak to anything LCMS related, as I&amp;#39;m not familiar, but I totally get being jaded by church experiences.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdt7da", "score_hidden": false, "stickied": false, "created": 1492479355.0, "created_utc": 1492450555.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrngg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "sidebirch", "parent_id": "t1_dgdr96f", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "Yes, it came up again after the Christmas where he mentioned it to me. I saw him at the store a few months later, and asked if maybe I'd missed his email in my spam filter somehow. I was still thinking after all this time that maybe seeing me at Christmas and mentioning it had prompted him to respond. He told me he was \"still getting around to it\", and I told him he didn't need to bother at that point. \n\nI recently told my friend that I did this for the first time. I'd never mentioned it because I saw it as a failure - I never got an answer, and so I was never able to really help. When I told her what I did, she started crying. She held my hand and thanked me, and told me that she was incredibly touched that I'd been so concerned and that I'd tried not only to help her but to do it in a way she would really appreciate and care about. So in the end, some good did come of it although I never got an answer for her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, it came up again after the Christmas where he mentioned it to me. I saw him at the store a few months later, and asked if maybe I&amp;#39;d missed his email in my spam filter somehow. I was still thinking after all this time that maybe seeing me at Christmas and mentioning it had prompted him to respond. He told me he was &amp;quot;still getting around to it&amp;quot;, and I told him he didn&amp;#39;t need to bother at that point. &lt;/p&gt;\n\n&lt;p&gt;I recently told my friend that I did this for the first time. I&amp;#39;d never mentioned it because I saw it as a failure - I never got an answer, and so I was never able to really help. When I told her what I did, she started crying. She held my hand and thanked me, and told me that she was incredibly touched that I&amp;#39;d been so concerned and that I&amp;#39;d tried not only to help her but to do it in a way she would really appreciate and care about. So in the end, some good did come of it although I never got an answer for her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdrngg", "score_hidden": false, "stickied": false, "created": 1492477625.0, "created_utc": 1492448825.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdr96f", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "JPWRana", "parent_id": "t3_65wioo", "subreddit_name_prefixed": "r/TwoXChromosomes", "controversiality": 0, "body": "It is very unfortunate the experience YOU went through and I'm so sorry. Did   you speak to the pastor at a later date and told him how that is not cool that he didn't respond right away? If you or anyone else did, then ignore this message. \n\nRemember, pastors are human too and prone to mistakes. How would you feel if you made a big mistake and didn't know about it. You would keep on repeating that mistake until someone lets you know or someone fires you / kicks you out for not changing. \n\nI always try to give an approachable tone so that I can be approached when I drop the ball. Yes, I understand... He is someone who should have known better. I too am in a position of religious authority. I always need to remember to humble myself and pray (and act upon it) that I do the best that I can to the whole flock. I feel soo bad when I have dropped the ball. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is very unfortunate the experience YOU went through and I&amp;#39;m so sorry. Did   you speak to the pastor at a later date and told him how that is not cool that he didn&amp;#39;t respond right away? If you or anyone else did, then ignore this message. &lt;/p&gt;\n\n&lt;p&gt;Remember, pastors are human too and prone to mistakes. How would you feel if you made a big mistake and didn&amp;#39;t know about it. You would keep on repeating that mistake until someone lets you know or someone fires you / kicks you out for not changing. &lt;/p&gt;\n\n&lt;p&gt;I always try to give an approachable tone so that I can be approached when I drop the ball. Yes, I understand... He is someone who should have known better. I too am in a position of religious authority. I always need to remember to humble myself and pray (and act upon it) that I do the best that I can to the whole flock. I feel soo bad when I have dropped the ball. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TwoXChromosomes", "name": "t1_dgdr96f", "score_hidden": false, "stickied": false, "created": 1492477183.0, "created_utc": 1492448383.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]