[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "headphones", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello everyone,&lt;/p&gt;\n\n&lt;p&gt;It has been over a week since I bought my first pair of audiophile level headphones which are Audio-Technica ATH-MSR7 and I just wanted to share my opinions and experience here, just so people who are considering to buy this headphone can have an idea.&lt;/p&gt;\n\n&lt;p&gt;To start off, I am not an audiophile so I won&amp;#39;t be able to give you a detailed information about the sound signature, I will just try to describe how it sounds compared to some other popular headphones that I tried.&lt;/p&gt;\n\n&lt;p&gt;So to give you a bit background about why I decided to buy this pair I will talk a bit about my thought process. As I mentioned above I have never had an audiophile grade headphone before and I wanted to purchase my first pair for a very long time. About 2 months ago I finally started doing research about it everywhere, I read pretty much every forum, watched all of those popular headphone reviewers on youtube like Zeos, Metal571, lachlan and Innerfidelity and so on. As a result of my research I decided on these headphones : DT770 Pro 80ohms, MDR1-A, M50x, M40x or MSR7.&lt;/p&gt;\n\n&lt;p&gt;I found 2 local shops in which I could try m50x, msr7, dt770 and some other headphones so I tried them all. Sadly my laptop was not really enough to drive DT770 80ohms, even at the max level the volume was not &amp;quot;too much&amp;quot;. I liked how incredibly comfortable those headphones were, and the bass was also strong and deep. However I wasn&amp;#39;t really impressed by the overall sound signature, probably because I didnt have a setup that could get the most out of them.&lt;/p&gt;\n\n&lt;p&gt;Then I went on to try m50x and msr7 on some other shop. My expectations were : m50x with too much bass, and msr7 with like no bass at all, because according to some people m50x has an emphasis on bass while msr7 being more &amp;quot;neutral&amp;quot; and so on. However that wasn&amp;#39;t really the case, I couldn&amp;#39;t really hear a big difference in terms of bass performance between msr7 and m50x, in fact the bass on msr7 felt more deep and tight. So as I mentioned I am not an audiophile, but the only difference between m50x and msr7 in terms of sound signature was that, m50x has a bit more emphasis on the highs, like you can hear the drum bells louder on m50x, on msr7 it feels more natural, and I guess that&amp;#39;s why people say m50x is &amp;quot;v-shaped&amp;quot;. But I believe for longer listening sessions msr7 is a better option because even with msr7 sometimes highs on some songs are more than enough, so I guess m50x could be disturbing after some point. &lt;/p&gt;\n\n&lt;p&gt;I was expecting a poor bass performance from msr7 as people say that they are a &amp;quot;bright and neutral&amp;quot; pair, however I was still quite impressed by the amount of bass these headphones had. I listen to genres like death metal, thrash metal, funk, acid jazz and just a bit of rap &amp;amp; hip hop and the amount of bass these headphones have feels perfect for all of these genres. It feels &amp;quot;just right&amp;quot;, not too much or not to weak. Even depending on the song it can be quite deep and tight. &lt;/p&gt;\n\n&lt;p&gt;I would like to talk a bit about the build quality and the comfort aswell. The build quality feels fantastic compared to any other premium level headphones that I&amp;#39;ve tried before. Compared to headphones like DT770, M50x, Bose QC 25/35 and some Beats and JBL models, msr7 is the one that feels most premium and high quality. Even headphones like Bose QC35, which are supposed to be more premium and comfortable, doesn&amp;#39;t feel as high quality as msr7. The ear pads, the cables and the overall build quality definitely feels like it&amp;#39;s sturdy and high quality. The comfort is not the best, because DT770 and Bose QC35 are definitely more comfortable compared to msr7. However this doesn&amp;#39;t mean that msr7 is uncomfortable and bad for long listening sessions. Out of the box for the first couple of days the headband felt a bit too tight for me and it even hurted my head a bit. However it feels just fine and comfortable now, I guess it gets more loose and comfortable as you use it. The ear pads are super soft and deep, have no complaints about that part. I had listening sessions that lasted more than an hour as well as some gaming and movie sessions and didnt feel any discomfort whatsoever. &lt;/p&gt;\n\n&lt;p&gt;The accessories that are included are really good for me. Having 3 options for cable is really nice. The carrying bag is really handy for me as I bring my headphones out almost everyday and it just feels great to have a nice carrying bag. The sound isolation feels good enough, the ear pads block out quite a bit of noise so it&amp;#39;s also good for listening outside.&lt;/p&gt;\n\n&lt;p&gt;They are easy to drive, even at my iphone I can&amp;#39;t max out the volume because it gets a bit too much. At my laptop 50% volume is the most I&amp;#39;ve used so far, because more would be disturbing and harmful.&lt;/p&gt;\n\n&lt;p&gt;Lastly, I would like to ask a question. How much of a difference would it make if I bought an amp/dac combo like Fiio e10k right now, in terms of sound quality? Would it make a huge difference?&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s already been a long post, so I would like to stop here. Please ask any questions that you have in your mind. &lt;/p&gt;\n\n&lt;p&gt;Cheers!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello everyone,\n\nIt has been over a week since I bought my first pair of audiophile level headphones which are Audio-Technica ATH-MSR7 and I just wanted to share my opinions and experience here, just so people who are considering to buy this headphone can have an idea.\n\nTo start off, I am not an audiophile so I won't be able to give you a detailed information about the sound signature, I will just try to describe how it sounds compared to some other popular headphones that I tried.\n\nSo to give you a bit background about why I decided to buy this pair I will talk a bit about my thought process. As I mentioned above I have never had an audiophile grade headphone before and I wanted to purchase my first pair for a very long time. About 2 months ago I finally started doing research about it everywhere, I read pretty much every forum, watched all of those popular headphone reviewers on youtube like Zeos, Metal571, lachlan and Innerfidelity and so on. As a result of my research I decided on these headphones : DT770 Pro 80ohms, MDR1-A, M50x, M40x or MSR7.\n\nI found 2 local shops in which I could try m50x, msr7, dt770 and some other headphones so I tried them all. Sadly my laptop was not really enough to drive DT770 80ohms, even at the max level the volume was not \"too much\". I liked how incredibly comfortable those headphones were, and the bass was also strong and deep. However I wasn't really impressed by the overall sound signature, probably because I didnt have a setup that could get the most out of them.\n\nThen I went on to try m50x and msr7 on some other shop. My expectations were : m50x with too much bass, and msr7 with like no bass at all, because according to some people m50x has an emphasis on bass while msr7 being more \"neutral\" and so on. However that wasn't really the case, I couldn't really hear a big difference in terms of bass performance between msr7 and m50x, in fact the bass on msr7 felt more deep and tight. So as I mentioned I am not an audiophile, but the only difference between m50x and msr7 in terms of sound signature was that, m50x has a bit more emphasis on the highs, like you can hear the drum bells louder on m50x, on msr7 it feels more natural, and I guess that's why people say m50x is \"v-shaped\". But I believe for longer listening sessions msr7 is a better option because even with msr7 sometimes highs on some songs are more than enough, so I guess m50x could be disturbing after some point. \n\nI was expecting a poor bass performance from msr7 as people say that they are a \"bright and neutral\" pair, however I was still quite impressed by the amount of bass these headphones had. I listen to genres like death metal, thrash metal, funk, acid jazz and just a bit of rap &amp; hip hop and the amount of bass these headphones have feels perfect for all of these genres. It feels \"just right\", not too much or not to weak. Even depending on the song it can be quite deep and tight. \n\nI would like to talk a bit about the build quality and the comfort aswell. The build quality feels fantastic compared to any other premium level headphones that I've tried before. Compared to headphones like DT770, M50x, Bose QC 25/35 and some Beats and JBL models, msr7 is the one that feels most premium and high quality. Even headphones like Bose QC35, which are supposed to be more premium and comfortable, doesn't feel as high quality as msr7. The ear pads, the cables and the overall build quality definitely feels like it's sturdy and high quality. The comfort is not the best, because DT770 and Bose QC35 are definitely more comfortable compared to msr7. However this doesn't mean that msr7 is uncomfortable and bad for long listening sessions. Out of the box for the first couple of days the headband felt a bit too tight for me and it even hurted my head a bit. However it feels just fine and comfortable now, I guess it gets more loose and comfortable as you use it. The ear pads are super soft and deep, have no complaints about that part. I had listening sessions that lasted more than an hour as well as some gaming and movie sessions and didnt feel any discomfort whatsoever. \n\nThe accessories that are included are really good for me. Having 3 options for cable is really nice. The carrying bag is really handy for me as I bring my headphones out almost everyday and it just feels great to have a nice carrying bag. The sound isolation feels good enough, the ear pads block out quite a bit of noise so it's also good for listening outside.\n\nThey are easy to drive, even at my iphone I can't max out the volume because it gets a bit too much. At my laptop 50% volume is the most I've used so far, because more would be disturbing and harmful.\n\nLastly, I would like to ask a question. How much of a difference would it make if I bought an amp/dac combo like Fiio e10k right now, in terms of sound quality? Would it make a huge difference?\n\nIt's already been a long post, so I would like to stop here. Please ask any questions that you have in your mind. \n\nCheers!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "*", "id": "64x9st", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 26, "report_reasons": null, "author": "Mannevond", "saved": false, "mod_reports": [], "name": "t3_64x9st", "subreddit_name_prefixed": "r/headphones", "approved_by": null, "over_18": false, "domain": "self.headphones", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rcyx", "edited": false, "link_flair_css_class": "red", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/headphones/comments/64x9st/here_are_my_thoughts_on_audiotechnica_msr7/", "num_reports": null, "locked": false, "stickied": false, "created": 1492020920.0, "url": "https://www.reddit.com/r/headphones/comments/64x9st/here_are_my_thoughts_on_audiotechnica_msr7/", "author_flair_text": null, "quarantine": false, "title": "Here are my thoughts on Audio-Technica MSR7", "created_utc": 1491992120.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 50, "visited": false, "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg6galk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bradyrulez", "parent_id": "t1_dg5ptf9", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I really hope the S8 packs a helluva nice amp/DAC this time around.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really hope the S8 packs a helluva nice amp/DAC this time around.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg6galk", "score_hidden": false, "stickied": false, "created": 1492055809.0, "created_utc": 1492027009.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ptf9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "malvinvnv", "parent_id": "t1_dg5pn5e", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Not the original commenter, but not much tbh. But if you want it to go louder while retaining the coherency, or in the need of some bass-boost, getting an amp is good. IMO, while the MSR7 is not power hungry, a better amp can drive it to higher volume and not let it distort like when you drive it at 100% out of a phone (Flagship models like iPhone and S8 should be fine imo)\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not the original commenter, but not much tbh. But if you want it to go louder while retaining the coherency, or in the need of some bass-boost, getting an amp is good. IMO, while the MSR7 is not power hungry, a better amp can drive it to higher volume and not let it distort like when you drive it at 100% out of a phone (Flagship models like iPhone and S8 should be fine imo)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5ptf9", "score_hidden": false, "stickied": false, "created": 1492023093.0, "created_utc": 1491994293.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5pn5e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Mannevond", "parent_id": "t1_dg5pjr4", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Yes honestly they already sound perfect without any amp or dac, I can't really complain about anything about the sound signature. Was just curious how much potential they have which can be explored with an amp/dac combo.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes honestly they already sound perfect without any amp or dac, I can&amp;#39;t really complain about anything about the sound signature. Was just curious how much potential they have which can be explored with an amp/dac combo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5pn5e", "score_hidden": false, "stickied": false, "created": 1492022611.0, "created_utc": 1491993811.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg5pn2r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "malvinvnv", "parent_id": "t1_dg5pjr4", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Can agree with this. Not a Mojo owner, but it works very well out of a phone and a PC with decent amp. The FiiO E10K should pair well with these too if needed, and it's a great entry level DAC/Amo combo to try out before you go ballin' like /u/nodasque", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can agree with this. Not a Mojo owner, but it works very well out of a phone and a PC with decent amp. The FiiO E10K should pair well with these too if needed, and it&amp;#39;s a great entry level DAC/Amo combo to try out before you go ballin&amp;#39; like &lt;a href=\"/u/nodasque\"&gt;/u/nodasque&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5pn2r", "score_hidden": false, "stickied": false, "created": 1492022605.0, "created_utc": 1491993805.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5pjr4", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "nodasque", "parent_id": "t3_64x9st", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Hello fellow MSR7 user, I previously paired FiiO E10K with MSR7 for a year before upgrading to Chord Mojo. E10K adds warmth to MSR7, more bass impact and a bit darker sound. E10K is good to start your journey in DAC-AMP.\n\nIMO, MSR7 stock sound without amp is already amazing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello fellow MSR7 user, I previously paired FiiO E10K with MSR7 for a year before upgrading to Chord Mojo. E10K adds warmth to MSR7, more bass impact and a bit darker sound. E10K is good to start your journey in DAC-AMP.&lt;/p&gt;\n\n&lt;p&gt;IMO, MSR7 stock sound without amp is already amazing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5pjr4", "score_hidden": false, "stickied": false, "created": 1492022343.0, "created_utc": 1491993543.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg62vde", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "_OVERHATE_", "parent_id": "t1_dg61hvs", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "well fuck me sideways, i never thought on putting the headphones on the tower... clever.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;well fuck me sideways, i never thought on putting the headphones on the tower... clever.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg62vde", "score_hidden": false, "stickied": false, "created": 1492042029.0, "created_utc": 1492013229.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg61hvs", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "vipxpress", "parent_id": "t1_dg5x3zv", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Totally agree with the HM5 pads, I got the hybrids and had to return them as they made my MSR7 sound really horrible and bassless, I am still in search for some that fit and sound good with them. \nI put mine over my PC tower at night, this also works to soften the clamping force.\nAnd, a good DAC makes the cans sound so much better and may compensate the slight lack in the lower ends.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Totally agree with the HM5 pads, I got the hybrids and had to return them as they made my MSR7 sound really horrible and bassless, I am still in search for some that fit and sound good with them. \nI put mine over my PC tower at night, this also works to soften the clamping force.\nAnd, a good DAC makes the cans sound so much better and may compensate the slight lack in the lower ends.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg61hvs", "score_hidden": false, "stickied": false, "created": 1492040537.0, "created_utc": 1492011737.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg6pq8z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Nickslife89", "parent_id": "t1_dg5x3zv", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "To get the clamp down do not put them on a block or pillow. Instead, extend both adjusters out fully. Then start to bend the headphone back, while holding the metal with your thumb. Do this for 15 second increments, going back further every time until its as loose as you like. They will stay like this forever.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To get the clamp down do not put them on a block or pillow. Instead, extend both adjusters out fully. Then start to bend the headphone back, while holding the metal with your thumb. Do this for 15 second increments, going back further every time until its as loose as you like. They will stay like this forever.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg6pq8z", "score_hidden": false, "stickied": false, "created": 1492066599.0, "created_utc": 1492037799.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg60nah", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_OVERHATE_", "parent_id": "t1_dg5y5nn", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Sure. Gain is the voltage used in the amplification stage. Higher impedance headphones need more voltage to sound at normal volumes. High gain means, in layman terms, it sounds louder with the same volume setting. Usually, with higher gain, noise and distortion is included. Fear not, since the Q1 is not THAT powerful enough to get to that point where noise is actually perceived.\n \nMost of the times, you will use the Q1 on the Low Gain option (with the delicate but tasty Bass Boost On) unless you are noticing that you need way more volume for some songs or something. High gain sounds more \" boomy \" when you turn it on, so it has the placebo effect of making it sound more \"powerful\". There is not a problem with running it in either mode, so test and find the one you like the most. In my time with those, the Q1 was most of the time in High Gain since i listen mostly to heavy/folk metal and the \"boomy\" sound was delightful. \n\nNow for the reliable source.. i bought it from amazon, so i really can't say but depending on which country you are on, you can maybe try to find a local FiiO dealer or partner, so you have a local to complain about quality or warranty. If US, then go amazon all the way. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure. Gain is the voltage used in the amplification stage. Higher impedance headphones need more voltage to sound at normal volumes. High gain means, in layman terms, it sounds louder with the same volume setting. Usually, with higher gain, noise and distortion is included. Fear not, since the Q1 is not THAT powerful enough to get to that point where noise is actually perceived.&lt;/p&gt;\n\n&lt;p&gt;Most of the times, you will use the Q1 on the Low Gain option (with the delicate but tasty Bass Boost On) unless you are noticing that you need way more volume for some songs or something. High gain sounds more &amp;quot; boomy &amp;quot; when you turn it on, so it has the placebo effect of making it sound more &amp;quot;powerful&amp;quot;. There is not a problem with running it in either mode, so test and find the one you like the most. In my time with those, the Q1 was most of the time in High Gain since i listen mostly to heavy/folk metal and the &amp;quot;boomy&amp;quot; sound was delightful. &lt;/p&gt;\n\n&lt;p&gt;Now for the reliable source.. i bought it from amazon, so i really can&amp;#39;t say but depending on which country you are on, you can maybe try to find a local FiiO dealer or partner, so you have a local to complain about quality or warranty. If US, then go amazon all the way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg60nah", "score_hidden": false, "stickied": false, "created": 1492039602.0, "created_utc": 1492010802.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5y5nn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mannevond", "parent_id": "t1_dg5x3zv", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Hello mate,\n\nThanks a lot for the detailed recommendations :). For now I can't really complain about the ear pads or the cables as I find them really comfortable/good enough for me, however I will still keep your suggestion in mind. \n\nI searched it a bit and in fact it seems like FiiO Q1 seems to be a better choice for me than E10k. I learnt that this amp has low gain / high gain and bass boost options. Could you tell me what is low gain and high gain option? And lastly, could you provide me a reliable source from which I could buy a FiiO Q1? \n\nThanks in advance! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello mate,&lt;/p&gt;\n\n&lt;p&gt;Thanks a lot for the detailed recommendations :). For now I can&amp;#39;t really complain about the ear pads or the cables as I find them really comfortable/good enough for me, however I will still keep your suggestion in mind. &lt;/p&gt;\n\n&lt;p&gt;I searched it a bit and in fact it seems like FiiO Q1 seems to be a better choice for me than E10k. I learnt that this amp has low gain / high gain and bass boost options. Could you tell me what is low gain and high gain option? And lastly, could you provide me a reliable source from which I could buy a FiiO Q1? &lt;/p&gt;\n\n&lt;p&gt;Thanks in advance! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5y5nn", "score_hidden": false, "stickied": false, "created": 1492036810.0, "created_utc": 1492008010.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg62ue0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_OVERHATE_", "parent_id": "t1_dg61ntc", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Ohh the beautiful gunmetal?  Unfortunately i can only find protein pads available in several colors. If you really want the improvement in comfort, and keep the great sound on those cans, you need to get Cowhide or Lambskin which are black. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ohh the beautiful gunmetal?  Unfortunately i can only find protein pads available in several colors. If you really want the improvement in comfort, and keep the great sound on those cans, you need to get Cowhide or Lambskin which are black. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg62ue0", "score_hidden": false, "stickied": false, "created": 1492042000.0, "created_utc": 1492013200.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg61ntc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fightinchunk", "parent_id": "t1_dg5x3zv", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "For those of us with the graphite/brown msr7's, what options do we have that closely color matches the stock pads? plus... I think the stock pads are thicker than the m50x, and also equipped with memory foam so I don't think I ever really need to change them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For those of us with the graphite/brown msr7&amp;#39;s, what options do we have that closely color matches the stock pads? plus... I think the stock pads are thicker than the m50x, and also equipped with memory foam so I don&amp;#39;t think I ever really need to change them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg61ntc", "score_hidden": false, "stickied": false, "created": 1492040718.0, "created_utc": 1492011918.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg6l2ik", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_OVERHATE_", "parent_id": "t1_dg6kjq8", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Havent tried them, i think they look very comfy, but i dont know how much the sound will be affected. Sorry :(\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Havent tried them, i think they look very comfy, but i dont know how much the sound will be affected. Sorry :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg6l2ik", "score_hidden": false, "stickied": false, "created": 1492060913.0, "created_utc": 1492032113.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dgc5v6i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vipxpress", "parent_id": "t1_dgbsipr", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Hey, if sound remains the same is good enough for me, will have to try them out. Thx :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, if sound remains the same is good enough for me, will have to try them out. Thx :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgc5v6i", "score_hidden": false, "stickied": false, "created": 1492385955.0, "created_utc": 1492357155.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbsipr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Evilem", "parent_id": "t1_dg7jyow", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I got em for $13, they are MUCH more comfy. Trust it's worth it. Bigger so it sounds less congested. even if it's not a better the sound quality isn't worse", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I got em for $13, they are MUCH more comfy. Trust it&amp;#39;s worth it. Bigger so it sounds less congested. even if it&amp;#39;s not a better the sound quality isn&amp;#39;t worse&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgbsipr", "score_hidden": false, "stickied": false, "created": 1492354000.0, "created_utc": 1492325200.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jyow", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vipxpress", "parent_id": "t1_dg6kjq8", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Please give feedback once you try them out, they are only 18€ on Amazon and I'm looking for some comfy/good sounding ones. They don't look that different from the original msr7 ones tho..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please give feedback once you try them out, they are only 18€ on Amazon and I&amp;#39;m looking for some comfy/good sounding ones. They don&amp;#39;t look that different from the original msr7 ones tho..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg7jyow", "score_hidden": false, "stickied": false, "created": 1492119732.0, "created_utc": 1492090932.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6kjq8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Evilem", "parent_id": "t1_dg5x3zv", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I bought the Shure 840 pads, think those will be ok for the sound and comfort? The stock earpads kinda suck :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I bought the Shure 840 pads, think those will be ok for the sound and comfort? The stock earpads kinda suck :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg6kjq8", "score_hidden": false, "stickied": false, "created": 1492060312.0, "created_utc": 1492031512.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5x3zv", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "_OVERHATE_", "parent_id": "t3_64x9st", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Hello!\n\nI had the MSR7's for 8 months until i sold them to get the WS1100. Now:\n\n- DONT, NO MATTER WHAT YOU DO, DONT PUT HM5 PLEATHER PADS ON THEM. YOU'VE BEEN WARNED. It will annihilate the already thin bass it has, and will make them sound very bright and harsh. Get some Lambskin or cowhide pads (ZMF) for them if you want an upgrade on the comfort department. \n\n- Another good comfort tip: Grab a yoga block or a big pillow, and put them there. Let them be there every single second you are not wearing them. That eases the clamp strength a bit and helps quite a lot with the hot zone they have at the top of the headband, that gets quite uncomfortable after an hour or so.\n\n- Yes, DAC/AMPS will make a difference. Instead of the already popular E10K, i will recommend however the Fiio Q1. Its way better for portability, which compliments well the MSR7's portable nature, and are a bit cheaper while offering a very similar DAC to the E10K. Its a good entry level DAC.  Try getting DAC/AMPS that offer Bass Boost or similar controls, they benefit quite a lot from it.\n\n- Replace the wire for some V-Moda wires if you can. Audio Technica's plasticky wires get tangled a lot with stuff on (at least my) desk.\n\n- Out of the group you tested, which is very similar to the group i tested back then, the MSR7 is quite the champion there. \n\n\nGood luck with those! :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello!&lt;/p&gt;\n\n&lt;p&gt;I had the MSR7&amp;#39;s for 8 months until i sold them to get the WS1100. Now:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;DONT, NO MATTER WHAT YOU DO, DONT PUT HM5 PLEATHER PADS ON THEM. YOU&amp;#39;VE BEEN WARNED. It will annihilate the already thin bass it has, and will make them sound very bright and harsh. Get some Lambskin or cowhide pads (ZMF) for them if you want an upgrade on the comfort department. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Another good comfort tip: Grab a yoga block or a big pillow, and put them there. Let them be there every single second you are not wearing them. That eases the clamp strength a bit and helps quite a lot with the hot zone they have at the top of the headband, that gets quite uncomfortable after an hour or so.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Yes, DAC/AMPS will make a difference. Instead of the already popular E10K, i will recommend however the Fiio Q1. Its way better for portability, which compliments well the MSR7&amp;#39;s portable nature, and are a bit cheaper while offering a very similar DAC to the E10K. Its a good entry level DAC.  Try getting DAC/AMPS that offer Bass Boost or similar controls, they benefit quite a lot from it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Replace the wire for some V-Moda wires if you can. Audio Technica&amp;#39;s plasticky wires get tangled a lot with stuff on (at least my) desk.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Out of the group you tested, which is very similar to the group i tested back then, the MSR7 is quite the champion there. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Good luck with those! :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5x3zv", "score_hidden": false, "stickied": false, "created": 1492035575.0, "created_utc": 1492006775.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg5pq55", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ggabriele3", "parent_id": "t1_dg5pjaa", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Agreed - most of the headphones I review end up being V-shaped which is great for modern popular music but terrible for metal.\n\nA headphone that can make black metal not sound like a muddy mess is becoming rare, but the MSR7 are great for it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed - most of the headphones I review end up being V-shaped which is great for modern popular music but terrible for metal.&lt;/p&gt;\n\n&lt;p&gt;A headphone that can make black metal not sound like a muddy mess is becoming rare, but the MSR7 are great for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5pq55", "score_hidden": false, "stickied": false, "created": 1492022842.0, "created_utc": 1491994042.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5pjaa", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Mannevond", "parent_id": "t1_dg5pc89", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Yep, especially for any kind of metal the bass is just perfect imo :) I believe more would make it sound muddy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, especially for any kind of metal the bass is just perfect imo :) I believe more would make it sound muddy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5pjaa", "score_hidden": false, "stickied": false, "created": 1492022306.0, "created_utc": 1491993506.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5pc89", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ggabriele3", "parent_id": "t3_64x9st", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Nice writeup! I agree about the bass. It has extension and clarity, it's not over emphasized. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice writeup! I agree about the bass. It has extension and clarity, it&amp;#39;s not over emphasized. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5pc89", "score_hidden": false, "stickied": false, "created": 1492021731.0, "created_utc": 1491992931.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg61rkp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fightinchunk", "parent_id": "t1_dg5zdo2", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Hear, Hear!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hear, Hear!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg61rkp", "score_hidden": false, "stickied": false, "created": 1492040831.0, "created_utc": 1492012031.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zdo2", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Kuxir-F3", "parent_id": "t3_64x9st", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "\"I am not an audiophile\" yet you go on the internet and talk about it with a bunch of random people. You are an audiophile because you care enough to share your opinion and try to find what fits you. \n\n[Head fi post I loved](http://www.head-fi.org/a/what-makes-an-audiophile)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;I am not an audiophile&amp;quot; yet you go on the internet and talk about it with a bunch of random people. You are an audiophile because you care enough to share your opinion and try to find what fits you. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.head-fi.org/a/what-makes-an-audiophile\"&gt;Head fi post I loved&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5zdo2", "score_hidden": false, "stickied": false, "created": 1492038198.0, "created_utc": 1492009398.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg5uuwg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mannevond", "parent_id": "t1_dg5qvpz", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I think the only problem with the build is that after some point it gets squeaky when you move the earcups. Like there was an open pair of msr7 for trial purposes in the shop, and I could hear some squeaky sounds from the headphones. Zeos also mentioned about this problem in his review, in which he stated that he was also reviewing a used pair.\n\nBut all in all, the build quality just feels superior compared to any headphones that I've tried so far, obviously I haven't tried any high end stuff :) I'm just surprised that they feel much more premium compared to Bose QC35, which has a price tag of 380 Euros in my country.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the only problem with the build is that after some point it gets squeaky when you move the earcups. Like there was an open pair of msr7 for trial purposes in the shop, and I could hear some squeaky sounds from the headphones. Zeos also mentioned about this problem in his review, in which he stated that he was also reviewing a used pair.&lt;/p&gt;\n\n&lt;p&gt;But all in all, the build quality just feels superior compared to any headphones that I&amp;#39;ve tried so far, obviously I haven&amp;#39;t tried any high end stuff :) I&amp;#39;m just surprised that they feel much more premium compared to Bose QC35, which has a price tag of 380 Euros in my country.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5uuwg", "score_hidden": false, "stickied": false, "created": 1492032645.0, "created_utc": 1492003845.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg6c5us", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FYLegend", "parent_id": "t1_dg5qvpz", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I agree they creak quite a bit, especially in the winter, but I've flexed the hinges many times and they're still going strong. Flexing the hinges seems to temporarily get rid of creaking as well.\n\nThey don't creak or crinkle much when I'm wearing them (unless I yawn or suddenly open my jaw) but the rubber pad on the hinge sometimes hits the housing which causes a clunking sound. I taped some foam to the pads to reduce this sound. The M50x and Sony MDR-1000X have a lot more creaking.\n\nAnother point of crinkling comes from the cable socket. After some time the jack is very slightly loose and when tugged I will hear a sound coming from there. If I'm listening on my computer I usually have the cable laid out on my desk which reduces the crinkling.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree they creak quite a bit, especially in the winter, but I&amp;#39;ve flexed the hinges many times and they&amp;#39;re still going strong. Flexing the hinges seems to temporarily get rid of creaking as well.&lt;/p&gt;\n\n&lt;p&gt;They don&amp;#39;t creak or crinkle much when I&amp;#39;m wearing them (unless I yawn or suddenly open my jaw) but the rubber pad on the hinge sometimes hits the housing which causes a clunking sound. I taped some foam to the pads to reduce this sound. The M50x and Sony MDR-1000X have a lot more creaking.&lt;/p&gt;\n\n&lt;p&gt;Another point of crinkling comes from the cable socket. After some time the jack is very slightly loose and when tugged I will hear a sound coming from there. If I&amp;#39;m listening on my computer I usually have the cable laid out on my desk which reduces the crinkling.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg6c5us", "score_hidden": false, "stickied": false, "created": 1492051550.0, "created_utc": 1492022750.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qvpz", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Shining_Desert", "parent_id": "t3_64x9st", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Love my msr7s so much, the highs are incredibly clean. I'm surprised you like the build though, I think the plastic is too creaky and the hinges feel like they'll snap real easy. Kinda wish they were made in Japan rather than China. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Love my msr7s so much, the highs are incredibly clean. I&amp;#39;m surprised you like the build though, I think the plastic is too creaky and the hinges feel like they&amp;#39;ll snap real easy. Kinda wish they were made in Japan rather than China. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5qvpz", "score_hidden": false, "stickied": false, "created": 1492025726.0, "created_utc": 1491996926.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg7l60i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "metal571", "parent_id": "t1_dg7b36p", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Not at all. The MSR7 is specifically designed to operate from a mobile device so I'm not seeing the need for one. I'd buy a serious amp with some actual power if you think you're going to pursue a home open back setup but otherwise, no need. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not at all. The MSR7 is specifically designed to operate from a mobile device so I&amp;#39;m not seeing the need for one. I&amp;#39;d buy a serious amp with some actual power if you think you&amp;#39;re going to pursue a home open back setup but otherwise, no need. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg7l60i", "score_hidden": false, "stickied": false, "created": 1492121274.0, "created_utc": 1492092474.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7b36p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mannevond", "parent_id": "t1_dg6tow5", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Hey man, been following your channel for like a month now. Your reviews are great! :) Sadly I didn't have the chance to try out all of the headphones that I would consider buying, so I simply ended up buying the ones that sounded the best for me among the ones that I had tried. I also heard that momentum 2 is a pretty good pair, never really had the chance to try them out though. \n\nAnd since this was my first purchase into the audiophile level, I couldn't take the risk of buying a headphone without trying it. Lastly I would like to ask a question which is probably too cliche but still curious, do you think buying a dac/amp combo that costs less than 100$ would make a huge difference in terms of sound quality for my msr7?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man, been following your channel for like a month now. Your reviews are great! :) Sadly I didn&amp;#39;t have the chance to try out all of the headphones that I would consider buying, so I simply ended up buying the ones that sounded the best for me among the ones that I had tried. I also heard that momentum 2 is a pretty good pair, never really had the chance to try them out though. &lt;/p&gt;\n\n&lt;p&gt;And since this was my first purchase into the audiophile level, I couldn&amp;#39;t take the risk of buying a headphone without trying it. Lastly I would like to ask a question which is probably too cliche but still curious, do you think buying a dac/amp combo that costs less than 100$ would make a huge difference in terms of sound quality for my msr7?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg7b36p", "score_hidden": false, "stickied": false, "created": 1492099937.0, "created_utc": 1492071137.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg7kx1k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "metal571", "parent_id": "t1_dg77w73", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Probably will just pin a comment to the comment section on my old review. It's not totally irrelevant, but buying a brand new one might give you different results than my review, that's all", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Probably will just pin a comment to the comment section on my old review. It&amp;#39;s not totally irrelevant, but buying a brand new one might give you different results than my review, that&amp;#39;s all&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg7kx1k", "score_hidden": false, "stickied": false, "created": 1492120962.0, "created_utc": 1492092162.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg77w73", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fightinchunk", "parent_id": "t1_dg6tow5", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "ohh wow, hopefully we're getting a dt770 pt2?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ohh wow, hopefully we&amp;#39;re getting a dt770 pt2?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg77w73", "score_hidden": false, "stickied": false, "created": 1492091582.0, "created_utc": 1492062782.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg7ldv9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vb90", "parent_id": "t1_dg7kz3l", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Yeah it's significantly less than that but still it was noticeable for me. Brand new they were really well behaved. Now they do have some slight slight sibilance on some tracks. But quite rare. And now they are V-shaped in every sense of the word. At the beginning I would've tried to argue otherwise, find some wonky curve to describe them, no I'm more inline with what everyone else is thinking of them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah it&amp;#39;s significantly less than that but still it was noticeable for me. Brand new they were really well behaved. Now they do have some slight slight sibilance on some tracks. But quite rare. And now they are V-shaped in every sense of the word. At the beginning I would&amp;#39;ve tried to argue otherwise, find some wonky curve to describe them, no I&amp;#39;m more inline with what everyone else is thinking of them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg7ldv9", "score_hidden": false, "stickied": false, "created": 1492121545.0, "created_utc": 1492092745.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7kz3l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "metal571", "parent_id": "t1_dg7aacb", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I didn't really remember having any issues with midrange detail with the MSR7, that's odd. No burn in I've ever experienced would give a headphone about 5 dB less treble overall, which is what the difference sounds like to me compared to my old DT770... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t really remember having any issues with midrange detail with the MSR7, that&amp;#39;s odd. No burn in I&amp;#39;ve ever experienced would give a headphone about 5 dB less treble overall, which is what the difference sounds like to me compared to my old DT770... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg7kz3l", "score_hidden": false, "stickied": false, "created": 1492121035.0, "created_utc": 1492092235.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7aacb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vb90", "parent_id": "t1_dg6tow5", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "The DT770's 80ohm open up in the treble region in my experience with usage. Probably because the pads get stiffer or something. I'm planning on buying a back-up pair of pads for mine.\n\nAbout the MSR7s I'm surprised you're not bothered by its midrange flaws, I couldn't justify them really. I expect an audiophile grade portable can to still keep up in delivering fidelity in that range. I can understand the M50s which are consumer-level headphones but it's inexcusable for the MSR7s which I thought were the m50s for audiophiles.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The DT770&amp;#39;s 80ohm open up in the treble region in my experience with usage. Probably because the pads get stiffer or something. I&amp;#39;m planning on buying a back-up pair of pads for mine.&lt;/p&gt;\n\n&lt;p&gt;About the MSR7s I&amp;#39;m surprised you&amp;#39;re not bothered by its midrange flaws, I couldn&amp;#39;t justify them really. I expect an audiophile grade portable can to still keep up in delivering fidelity in that range. I can understand the M50s which are consumer-level headphones but it&amp;#39;s inexcusable for the MSR7s which I thought were the m50s for audiophiles.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg7aacb", "score_hidden": false, "stickied": false, "created": 1492097638.0, "created_utc": 1492068838.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6tow5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "metal571", "parent_id": "t3_64x9st", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I heard the MSR7 at length, but decided not to even review those. Probably because they were fairly well behaved but didn't really stick out in any bad way, which nowadays I understand much more clearly...is a GOOD thing. However, I did find the 10k peak to be bothersome to some degree and the bass on the lean side, though extension is good. They're pretty decent, and there's a bunch of options out there at around that price. Now that I've heard them, I'd personally probably go with the Momentum 2 though instead. That JBL Everest Elite 700 also has my eye, but haven't heard those yet.\n\nSide note: my DT770 80 ohm review is very outdated. Older units you can buy on the used market seem to sound like I reviewed, but I bought a brand new one recently and it was a big mistake. Plenty of FU-treble just like the 250 ohm, so not sure what happened there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I heard the MSR7 at length, but decided not to even review those. Probably because they were fairly well behaved but didn&amp;#39;t really stick out in any bad way, which nowadays I understand much more clearly...is a GOOD thing. However, I did find the 10k peak to be bothersome to some degree and the bass on the lean side, though extension is good. They&amp;#39;re pretty decent, and there&amp;#39;s a bunch of options out there at around that price. Now that I&amp;#39;ve heard them, I&amp;#39;d personally probably go with the Momentum 2 though instead. That JBL Everest Elite 700 also has my eye, but haven&amp;#39;t heard those yet.&lt;/p&gt;\n\n&lt;p&gt;Side note: my DT770 80 ohm review is very outdated. Older units you can buy on the used market seem to sound like I reviewed, but I bought a brand new one recently and it was a big mistake. Plenty of FU-treble just like the 250 ohm, so not sure what happened there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg6tow5", "score_hidden": false, "stickied": false, "created": 1492071522.0, "created_utc": 1492042722.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg5w9vq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thebountywarden", "parent_id": "t3_64x9st", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "MSR7 clan reporting! Glad you like em, I did a blind test when they were just released and I fell in love with them. The details are lush and well focused, and the bass is what I'd call just right, not too dark or too bloaty, not too light or thin either.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;MSR7 clan reporting! Glad you like em, I did a blind test when they were just released and I fell in love with them. The details are lush and well focused, and the bass is what I&amp;#39;d call just right, not too dark or too bloaty, not too light or thin either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5w9vq", "score_hidden": false, "stickied": false, "created": 1492034536.0, "created_utc": 1492005736.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg6aq6z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "evilninjaz99", "parent_id": "t3_64x9st", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Love these headphones. They've rendered my M50 trashcan material, and they've made me neglect my SHP9500 to the point where I feel obliged to purchase a pair of open-back headphones of a comparable caliber in terms of resolution and clarity (K712?).\n\nThey're *so* transparent, in fact, that I'm unable to fathom how a pair of headphones could possibly *best* these in transparency. The technical capability of these cans is amazing, notwithstanding the price. \n\nI don't want to call these my endgame, but they almost feel like they could be. But that ruins the fun of funneling money into this \"hobby\", so I'll refrain giving these that title. For now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Love these headphones. They&amp;#39;ve rendered my M50 trashcan material, and they&amp;#39;ve made me neglect my SHP9500 to the point where I feel obliged to purchase a pair of open-back headphones of a comparable caliber in terms of resolution and clarity (K712?).&lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;re &lt;em&gt;so&lt;/em&gt; transparent, in fact, that I&amp;#39;m unable to fathom how a pair of headphones could possibly &lt;em&gt;best&lt;/em&gt; these in transparency. The technical capability of these cans is amazing, notwithstanding the price. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to call these my endgame, but they almost feel like they could be. But that ruins the fun of funneling money into this &amp;quot;hobby&amp;quot;, so I&amp;#39;ll refrain giving these that title. For now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg6aq6z", "score_hidden": false, "stickied": false, "created": 1492050098.0, "created_utc": 1492021298.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg642m7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "malvinvnv", "parent_id": "t1_dg63zng", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I see, U-shaped FR curve seems to work well for you!\n\nThanks for the the update! hope I got a chance to try them all out this week", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see, U-shaped FR curve seems to work well for you!&lt;/p&gt;\n\n&lt;p&gt;Thanks for the the update! hope I got a chance to try them all out this week&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg642m7", "score_hidden": false, "stickied": false, "created": 1492043303.0, "created_utc": 1492014503.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg63zng", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vb90", "parent_id": "t1_dg62w1u", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Yes I have the 80ohm version and love it. To be honest I prefer the DT770s are a favorite of mine, probably the only ~100$ pair I own, and I keep it because it's the perfect match between a V-Shape FR and a neutral mid-range. It's a great combination that shines with metal and hip hop.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes I have the 80ohm version and love it. To be honest I prefer the DT770s are a favorite of mine, probably the only ~100$ pair I own, and I keep it because it&amp;#39;s the perfect match between a V-Shape FR and a neutral mid-range. It&amp;#39;s a great combination that shines with metal and hip hop.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg63zng", "score_hidden": false, "stickied": false, "created": 1492043219.0, "created_utc": 1492014419.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg62w1u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "malvinvnv", "parent_id": "t1_dg62o4z", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Alright, thank you very much for the list! I'll try and have a listen to it with all my gear first, then I'll head down for some comparison on weekend\n\nLastly, I'm assuming the DT770 you're using is the 80 Ohm ones? IIRC the only one I can find rather easily is that one in Singapore.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Alright, thank you very much for the list! I&amp;#39;ll try and have a listen to it with all my gear first, then I&amp;#39;ll head down for some comparison on weekend&lt;/p&gt;\n\n&lt;p&gt;Lastly, I&amp;#39;m assuming the DT770 you&amp;#39;re using is the 80 Ohm ones? IIRC the only one I can find rather easily is that one in Singapore.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg62w1u", "score_hidden": false, "stickied": false, "created": 1492042050.0, "created_utc": 1492013250.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg62o4z", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "vb90", "parent_id": "t1_dg61tti", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "NFB-11 and Dragonfly 1.5\n\nMusic that sounded good on them:\n- well recorded reggae music (so basically modern takes on old reggae classics)\n- Audioslave (Heaven's Dead, Yesterday to Tomorrow were very good)\n- Michael Jackson - Who Is It (sounds good on most things but here it actually comes off as real well balanced perhaps because the mix itself gives the impression of a lot of breathing room and soundstage\n\nEspecially bad:\n\nAnything with bad or remotely bad production:\n\n- Punk stuff: The Stooges first 2 albums for example: they are usually a controlling punchy rocking mess, with the MSR7 it's only a mess\n- Pink Floyd: no idea how you can fuck this up but I think it's the over-accentuated sub-bass and lack of finesse in the vocal region of the FR\n- Nina Simone (vocal centric jazz music) - a common theme for this headphone to severely deter from stuff that is centered on vocal performances\n\nOverall badly produced music has a lot to suffer and with other stuff the lack of vocal presence and general 'body' in a lot of the mid-frequencies makes it quite underwhelming.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;NFB-11 and Dragonfly 1.5&lt;/p&gt;\n\n&lt;p&gt;Music that sounded good on them:\n- well recorded reggae music (so basically modern takes on old reggae classics)\n- Audioslave (Heaven&amp;#39;s Dead, Yesterday to Tomorrow were very good)\n- Michael Jackson - Who Is It (sounds good on most things but here it actually comes off as real well balanced perhaps because the mix itself gives the impression of a lot of breathing room and soundstage&lt;/p&gt;\n\n&lt;p&gt;Especially bad:&lt;/p&gt;\n\n&lt;p&gt;Anything with bad or remotely bad production:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Punk stuff: The Stooges first 2 albums for example: they are usually a controlling punchy rocking mess, with the MSR7 it&amp;#39;s only a mess&lt;/li&gt;\n&lt;li&gt;Pink Floyd: no idea how you can fuck this up but I think it&amp;#39;s the over-accentuated sub-bass and lack of finesse in the vocal region of the FR&lt;/li&gt;\n&lt;li&gt;Nina Simone (vocal centric jazz music) - a common theme for this headphone to severely deter from stuff that is centered on vocal performances&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Overall badly produced music has a lot to suffer and with other stuff the lack of vocal presence and general &amp;#39;body&amp;#39; in a lot of the mid-frequencies makes it quite underwhelming.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg62o4z", "score_hidden": false, "stickied": false, "created": 1492041809.0, "created_utc": 1492013009.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg61tti", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "malvinvnv", "parent_id": "t1_dg619k3", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I'm not entirely sure what genre you're listening to but I agree. This is not a safe tuning by any means from ATH. While it works fine for me for most cases it can get a bit hard at times but never until it's unbearable. \n\nIf you don't mind, may I ask about the genre of songs you listen to? I might be able to try the DT770s during the weekends and I'll bring my MSR7 for comparison as well. Perhaps I'd get where you coming from for the conclusion (if you don't mind, that is)\n\nAlso, what amps are you using right now? Most likely I'll be driving these off my HA-2 SE. If there might be any slight differences I think it'd be nice for me to be able to log it in my impressions", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not entirely sure what genre you&amp;#39;re listening to but I agree. This is not a safe tuning by any means from ATH. While it works fine for me for most cases it can get a bit hard at times but never until it&amp;#39;s unbearable. &lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t mind, may I ask about the genre of songs you listen to? I might be able to try the DT770s during the weekends and I&amp;#39;ll bring my MSR7 for comparison as well. Perhaps I&amp;#39;d get where you coming from for the conclusion (if you don&amp;#39;t mind, that is)&lt;/p&gt;\n\n&lt;p&gt;Also, what amps are you using right now? Most likely I&amp;#39;ll be driving these off my HA-2 SE. If there might be any slight differences I think it&amp;#39;d be nice for me to be able to log it in my impressions&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg61tti", "score_hidden": false, "stickied": false, "created": 1492040901.0, "created_utc": 1492012101.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg6bnev", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FYLegend", "parent_id": "t1_dg619k3", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I didn't think that about the MSR7 but I found the SR9 to sound disjointed. The detail retrieval is outstanding, not necessarily shrill or harsh, but there felt like a lack of coherence and warmth compared to the MSR7. The DSR9 is actually quite different from the SR9, the sub-bass being deeper but slightly less crisp in the highs (more splashy).\n\nAs for the sub-bass I don't think it's bloated and in some measurements you can see there is a roll-off. I found the midbass a tad bloated or \"puffy\" though.\n\nI also found the MSR7 to be somewhat dependent on the fitting in my ears. Wearing glasses or having hair around the pads will alter the sound. Even wearing them with my ears sitting higher or below the pads has an effect (more sibilant if my ears sit on top, warmer near he bottom).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t think that about the MSR7 but I found the SR9 to sound disjointed. The detail retrieval is outstanding, not necessarily shrill or harsh, but there felt like a lack of coherence and warmth compared to the MSR7. The DSR9 is actually quite different from the SR9, the sub-bass being deeper but slightly less crisp in the highs (more splashy).&lt;/p&gt;\n\n&lt;p&gt;As for the sub-bass I don&amp;#39;t think it&amp;#39;s bloated and in some measurements you can see there is a roll-off. I found the midbass a tad bloated or &amp;quot;puffy&amp;quot; though.&lt;/p&gt;\n\n&lt;p&gt;I also found the MSR7 to be somewhat dependent on the fitting in my ears. Wearing glasses or having hair around the pads will alter the sound. Even wearing them with my ears sitting higher or below the pads has an effect (more sibilant if my ears sit on top, warmer near he bottom).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg6bnev", "score_hidden": false, "stickied": false, "created": 1492051031.0, "created_utc": 1492022231.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg619k3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "vb90", "parent_id": "t1_dg5t5ze", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I'm not saying that the MSR7's have something wrong with them (like the MDR-1As do) but the sound signature that they are tuned to is disjointed, uneven from a conceptual perspective that it ruins most music that I listen to (and unfortunately I listen to a range of genres that would seem borderline schizoid to many)\n\nMaybe there is stuff out there that sounds safer on them but to me it really didn't seem like they were worth the time from a sound perspective. Their build is amazing though. Tanks.\n\nAnd they are what they are, changing amplification didn't change them to much for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not saying that the MSR7&amp;#39;s have something wrong with them (like the MDR-1As do) but the sound signature that they are tuned to is disjointed, uneven from a conceptual perspective that it ruins most music that I listen to (and unfortunately I listen to a range of genres that would seem borderline schizoid to many)&lt;/p&gt;\n\n&lt;p&gt;Maybe there is stuff out there that sounds safer on them but to me it really didn&amp;#39;t seem like they were worth the time from a sound perspective. Their build is amazing though. Tanks.&lt;/p&gt;\n\n&lt;p&gt;And they are what they are, changing amplification didn&amp;#39;t change them to much for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg619k3", "score_hidden": false, "stickied": false, "created": 1492040281.0, "created_utc": 1492011481.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5t5ze", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "malvinvnv", "parent_id": "t1_dg5s3jw", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "That's pretty odd. I know the MSRs are bright, but it's not in any way metallic sounding nor having any overbloated subbass. It extends pretty deep down, but not really emphasized. \n\nAlso, taking on the measurements for both, the DT770 seems a lot wonkier and has more meat in the subbass than the MSRs are. So all in all, while I disagree with your opinion, I appreciate the input. Maybe our sound preference is quite different after all\n\nAnd by the way, the description of yours actually match my impression of the Dita Answer IEM :p", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s pretty odd. I know the MSRs are bright, but it&amp;#39;s not in any way metallic sounding nor having any overbloated subbass. It extends pretty deep down, but not really emphasized. &lt;/p&gt;\n\n&lt;p&gt;Also, taking on the measurements for both, the DT770 seems a lot wonkier and has more meat in the subbass than the MSRs are. So all in all, while I disagree with your opinion, I appreciate the input. Maybe our sound preference is quite different after all&lt;/p&gt;\n\n&lt;p&gt;And by the way, the description of yours actually match my impression of the Dita Answer IEM :p&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5t5ze", "score_hidden": false, "stickied": false, "created": 1492030080.0, "created_utc": 1492001280.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_64x9st", "likes": null, "replies": "", "user_reports": [], "id": "dg6c9jn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mannevond", "parent_id": "t1_dg64dh0", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I also feel like it is more pleasant to listen to songs with a cleaner and better production. I used to think that as long as it is 320kbps or flac, it is good to listen. However I realized that it is not the case, the production quality should also be fine.\n\nMost of the time, well known bands from all genre sounds good as they have a superior production quality, amateur and not well known bands however, sometimes sound not so pleasant.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I also feel like it is more pleasant to listen to songs with a cleaner and better production. I used to think that as long as it is 320kbps or flac, it is good to listen. However I realized that it is not the case, the production quality should also be fine.&lt;/p&gt;\n\n&lt;p&gt;Most of the time, well known bands from all genre sounds good as they have a superior production quality, amateur and not well known bands however, sometimes sound not so pleasant.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg6c9jn", "score_hidden": false, "stickied": false, "created": 1492051657.0, "created_utc": 1492022857.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg64dh0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vb90", "parent_id": "t1_dg62p16", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "That's not a bad listing for them actually. I would imagine that they don't sound proper for real dirty death metal like Morbid Angel and Immolation, Entombed etc but with stuff like Benighted and maybe something like Cannibal Corpse - Bloodthirst they could work better. (cleaner production). All the other stuff you mentioned in the rock realm is stuff that I found inoffensive while listening to them. Acid jazz could perhaps be a positive, hip hop is a no-no on them for me.\n\nIn the end if it works for you, nothing else matters. And they do seem to fit your musical taste better than mine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s not a bad listing for them actually. I would imagine that they don&amp;#39;t sound proper for real dirty death metal like Morbid Angel and Immolation, Entombed etc but with stuff like Benighted and maybe something like Cannibal Corpse - Bloodthirst they could work better. (cleaner production). All the other stuff you mentioned in the rock realm is stuff that I found inoffensive while listening to them. Acid jazz could perhaps be a positive, hip hop is a no-no on them for me.&lt;/p&gt;\n\n&lt;p&gt;In the end if it works for you, nothing else matters. And they do seem to fit your musical taste better than mine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg64dh0", "score_hidden": false, "stickied": false, "created": 1492043620.0, "created_utc": 1492014820.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg62p16", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mannevond", "parent_id": "t1_dg61cy1", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Mostly death metal and thrash metal, artists like Deicide, Benighted, Hour of Penance etc. Other than death metal I listen to rock (The Killers, Foo Fighters, Alter Bridge etc), funk &amp; acid jazz (Jamiroquai, Incognito) and some random rap &amp; hip hop", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mostly death metal and thrash metal, artists like Deicide, Benighted, Hour of Penance etc. Other than death metal I listen to rock (The Killers, Foo Fighters, Alter Bridge etc), funk &amp;amp; acid jazz (Jamiroquai, Incognito) and some random rap &amp;amp; hip hop&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg62p16", "score_hidden": false, "stickied": false, "created": 1492041836.0, "created_utc": 1492013036.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg61cy1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vb90", "parent_id": "t1_dg5v5qd", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "What do you listen to ? (like your most listened to songs, artists, albums)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What do you listen to ? (like your most listened to songs, artists, albums)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg61cy1", "score_hidden": false, "stickied": false, "created": 1492040383.0, "created_utc": 1492011583.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v5qd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mannevond", "parent_id": "t1_dg5s3jw", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I can't compare MSR7 to many different headphones as I haven't really tried so many different options, and maybe a dt770 with a proper amp would sound superior but imo msr7 sounds the most balanced and the best for my taste among all the headphones I tried. Wish I had the chance to try the MDR-1A but sadly there was no opportunity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t compare MSR7 to many different headphones as I haven&amp;#39;t really tried so many different options, and maybe a dt770 with a proper amp would sound superior but imo msr7 sounds the most balanced and the best for my taste among all the headphones I tried. Wish I had the chance to try the MDR-1A but sadly there was no opportunity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5v5qd", "score_hidden": false, "stickied": false, "created": 1492033063.0, "created_utc": 1492004263.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5s3jw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "vb90", "parent_id": "t3_64x9st", "subreddit_name_prefixed": "r/headphones", "controversiality": 1, "body": "the DT770's properly amped are vastly superior to the MSR7's. Or Any of the headphones you just listed.\n\nThe MSR7's have IMO the strangest sound signature of all the headphones I've heard, including Grados here. I find close to no genre that actually benefits from it.\n\nThe metallic tone, the overbloated sub-bass and the generally sparkly high-mids to highs make up for a package that hasn't really worked well for me listening to anything really. Perhaps some really squeky-clean produced modern hard rock, if that. You'd think some acoustic/string based stuff would have a sweet spot with them but the bloated sub-bass ruins it.\n\nSure they do have details, a semblance of soundstage (for closed portable cans that is) and less distortion that something like the MDR-1A, but what's the point of being technically proficient if you can't enjoy music with it?\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the DT770&amp;#39;s properly amped are vastly superior to the MSR7&amp;#39;s. Or Any of the headphones you just listed.&lt;/p&gt;\n\n&lt;p&gt;The MSR7&amp;#39;s have IMO the strangest sound signature of all the headphones I&amp;#39;ve heard, including Grados here. I find close to no genre that actually benefits from it.&lt;/p&gt;\n\n&lt;p&gt;The metallic tone, the overbloated sub-bass and the generally sparkly high-mids to highs make up for a package that hasn&amp;#39;t really worked well for me listening to anything really. Perhaps some really squeky-clean produced modern hard rock, if that. You&amp;#39;d think some acoustic/string based stuff would have a sweet spot with them but the bloated sub-bass ruins it.&lt;/p&gt;\n\n&lt;p&gt;Sure they do have details, a semblance of soundstage (for closed portable cans that is) and less distortion that something like the MDR-1A, but what&amp;#39;s the point of being technically proficient if you can&amp;#39;t enjoy music with it?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg5s3jw", "score_hidden": false, "stickied": false, "created": 1492028224.0, "created_utc": 1491999424.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]