[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "headphones", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65fuuo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 21, "report_reasons": null, "author": "STXDakota", "saved": false, "mod_reports": [], "name": "t3_65fuuo", "subreddit_name_prefixed": "r/headphones", "approved_by": null, "over_18": false, "domain": "i.imgur.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rcyx", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/headphones/comments/65fuuo/dragonfly_red_denon_ahd5000/", "num_reports": null, "locked": false, "stickied": false, "created": 1492239781.0, "url": "http://i.imgur.com/yhEW8oV.jpg", "author_flair_text": "Dragonfly Red &gt; Denon AH-D5000 // XBA H3", "quarantine": false, "title": "Dragonfly Red + Denon AH-D5000!", "created_utc": 1492210981.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65fuuo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65fuuo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65fuuo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65fuuo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65fuuo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65fuuo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65fuuo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65fuuo", "likes": null, "replies": "", "user_reports": [], "id": "dgacaj9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Degru", "parent_id": "t1_dgac3yy", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Yep, they also promised MQA support... Honestly I'm not too worried about it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, they also promised MQA support... Honestly I&amp;#39;m not too worried about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgacaj9", "score_hidden": false, "stickied": false, "created": 1492263283.0, "created_utc": 1492234483.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgac3yy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Nightcinder", "parent_id": "t1_dgabsn8", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Sure, just giving you options.  Audioquest promised a 'fix' for android in october, it's april...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure, just giving you options.  Audioquest promised a &amp;#39;fix&amp;#39; for android in october, it&amp;#39;s april...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgac3yy", "score_hidden": false, "stickied": false, "created": 1492262912.0, "created_utc": 1492234112.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgabsn8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Degru", "parent_id": "t1_dgab467", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Huh. Well, I think the return period for my Red is up anyways so I'll just stick with it. Maybe if it breaks out of warranty I'll have a look at the GO", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Huh. Well, I think the return period for my Red is up anyways so I&amp;#39;ll just stick with it. Maybe if it breaks out of warranty I&amp;#39;ll have a look at the GO&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgabsn8", "score_hidden": false, "stickied": false, "created": 1492262287.0, "created_utc": 1492233487.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgab467", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Nightcinder", "parent_id": "t1_dgaay2p", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Well, I can help with this.\n\nSo, GOV2 is balanced, and has a weird single ended gimping, so you'd need a TRRS connector on your hd600's to have the right power.  \n\nAs for the issues with android and DFR, those issues are based on the fact that the DFR reports itself as half volume and android takes that as max volume. \n\nThe Groove and Geekout's both have volume control on them, which bypasses all those issues.  Allowing you to not have to use UAPP.\n\nGeekout 2a supposedly has a fixed SE output, by the way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I can help with this.&lt;/p&gt;\n\n&lt;p&gt;So, GOV2 is balanced, and has a weird single ended gimping, so you&amp;#39;d need a TRRS connector on your hd600&amp;#39;s to have the right power.  &lt;/p&gt;\n\n&lt;p&gt;As for the issues with android and DFR, those issues are based on the fact that the DFR reports itself as half volume and android takes that as max volume. &lt;/p&gt;\n\n&lt;p&gt;The Groove and Geekout&amp;#39;s both have volume control on them, which bypasses all those issues.  Allowing you to not have to use UAPP.&lt;/p&gt;\n\n&lt;p&gt;Geekout 2a supposedly has a fixed SE output, by the way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgab467", "score_hidden": false, "stickied": false, "created": 1492261020.0, "created_utc": 1492232220.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaay2p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Degru", "parent_id": "t1_dgaap6x", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Interested in Geekout v2, but I think I'll stick with my DFR. It's served me well enough. My issues with Android aren't specific to the DFR, either; it's just how Android handles audio in general. The ROM I'm using currently has skipping over USB sometimes, and I have to change a config file to get it to output 44100 instead of resampling everything to 96000 through the rather lackluster resampler. \n\nJust about the only issue specific to the Dragonfly is that it sets the hardware gain to 70% or something by default, so I have to have a Tasker shortcut to use AlsaMixer to set it back to 100% whenever I plug it in.\n\nReally though, a different DAC won't help that much and I've seen reviews where the Geekout v2 doesn't have quite enough power for HD600's. Also not really sure about its power consumption, as the very efficient power delivery is a selling point of the Dragonfly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interested in Geekout v2, but I think I&amp;#39;ll stick with my DFR. It&amp;#39;s served me well enough. My issues with Android aren&amp;#39;t specific to the DFR, either; it&amp;#39;s just how Android handles audio in general. The ROM I&amp;#39;m using currently has skipping over USB sometimes, and I have to change a config file to get it to output 44100 instead of resampling everything to 96000 through the rather lackluster resampler. &lt;/p&gt;\n\n&lt;p&gt;Just about the only issue specific to the Dragonfly is that it sets the hardware gain to 70% or something by default, so I have to have a Tasker shortcut to use AlsaMixer to set it back to 100% whenever I plug it in.&lt;/p&gt;\n\n&lt;p&gt;Really though, a different DAC won&amp;#39;t help that much and I&amp;#39;ve seen reviews where the Geekout v2 doesn&amp;#39;t have quite enough power for HD600&amp;#39;s. Also not really sure about its power consumption, as the very efficient power delivery is a selling point of the Dragonfly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgaay2p", "score_hidden": false, "stickied": false, "created": 1492260716.0, "created_utc": 1492231916.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaap6x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nightcinder", "parent_id": "t1_dga8wnw", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "For what it's worth, I'd try to get a geekout v2 or apogee groove, both will work with android and both are better than either dragonfly. Also both output a good bit more power", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For what it&amp;#39;s worth, I&amp;#39;d try to get a geekout v2 or apogee groove, both will work with android and both are better than either dragonfly. Also both output a good bit more power&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgaap6x", "score_hidden": false, "stickied": false, "created": 1492260286.0, "created_utc": 1492231486.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga8wnw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Degru", "parent_id": "t1_dg9xgp4", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Can confirm, my experience with the DFR matches your own. It injects so much detail into anything I plug into it. \n\nI'm just sad it doesn't work right with my Android phone at the moment, and UAPP is annoying to use :(\n\nI actually tried the Black before this, and didn't like it. It's faster and more aggressive, more bass, but it's also dry and unmusical to me. Probably works better than the Red for metal, but not that well for everything else. Coming from a Fiio K1 which was smooth and sweet, it was quite disappointing, though I was still impressed by the detail and power. Surprisingly, the Black has louder volumes than the Red. Red works better with power-hungry headphones due to the higher voltage, however; as expected. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can confirm, my experience with the DFR matches your own. It injects so much detail into anything I plug into it. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just sad it doesn&amp;#39;t work right with my Android phone at the moment, and UAPP is annoying to use :(&lt;/p&gt;\n\n&lt;p&gt;I actually tried the Black before this, and didn&amp;#39;t like it. It&amp;#39;s faster and more aggressive, more bass, but it&amp;#39;s also dry and unmusical to me. Probably works better than the Red for metal, but not that well for everything else. Coming from a Fiio K1 which was smooth and sweet, it was quite disappointing, though I was still impressed by the detail and power. Surprisingly, the Black has louder volumes than the Red. Red works better with power-hungry headphones due to the higher voltage, however; as expected. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dga8wnw", "score_hidden": false, "stickied": false, "created": 1492257214.0, "created_utc": 1492228414.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9xgp4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "STXDakota", "parent_id": "t3_65fuuo", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I first bought the D5K used, as new a month ago. I was planning to get the schiit magni 2 to power them, but thought it might be a bit impractical considering I use my laptop around the house a lot. When the jack on my laptop broke, I started seriously looking into the dragonflies. The red seemed like the best pairing, so I went for it.\n\nDenon AH-D5000 impressions:\n\nAfter having listened to it unamped for almost a month, my view of it was that it was a great headphone with an apparent V-Shape and big bass. The weakness' being some bass bleed, very intimate sound / lacking in soundstage, and somewhat recessed mids. I was very happy with the headphones as is but I felt they were lacking a bit of power and although sensitive, wasn't driven 100% on my laptop, and even worse on my desktop. \n\nEnter the Dragonfly Red. First some background, I read that the Dragonfly Black had a warmer sound than the Red, and that the Red had more power  and higher resolution. I figured that a warm sounding set of headphones should be paired with a brighter/more neutral ampdac. \n\nWhen I forked out 199$ for the DFR I kinda just expected that I was buying more power for higher volumes and peace of mind so I would just be done with it. \n\nWhen I plugged them in, WOW! I could not believe the sound on this pairing. The Dragonfly Red literally fixed all my issues with the D5K's. \n\nThe most apparant things that I noticed right off the bat was the amazing separation, and \"blackness\" i.e lack of background noise, which is the strangest thing because I had never thought about or noticed this previously, ever. I actually don't know what's doing what as far as sound quality goes, but I've read that the blackness is the DAC's workings. \n\nThe DFR also brought forward the mids, and made the highs even smoother than they already were. I would say the D5Ks are now much more neutral than before, which is largely, I believe, because of the impact the DFR had on the bass. Essentially, the bass extends a tad bit lower, is a bit more weighty in the sub bass region, however is tightened up significantly as far as bass/mid bass goes. This, to my ears, is both a plus and a minus. Essentially, some tracks where I was really enjoying the bass impact isn't as bassy as I once thought they were. Its not a significant minus, but for any bassheads out there, beware. I would probably look into the Dragonfly Black for bassheads. However, the really low reaching sub bass on deep minimal dubstep tracks for instance carry even more weight now than before, and the definition is just wow. \n\nI think what shocked me the most about the dragonfly red is the added clarity. Having gone from m50s, to x2, to d5k, to d5k with dfr, I really thought I had all the details I needed around x2/d5k territory. DFR has introduced me to even more details, and so many tracks are vastly different than before. It all sounds fantastic though. \n\nMoving on, soundstage is wastly improved with DFR. While the imaging was pretty good on the D5K, they were pretty intimate and the soundstage didn't feel all that natural. With the DFR, it sounds very natural and I prefer it to the x2s soundstage, which, while being a tad wider, doesn't feel as natural.\n\nAll in all, the DFR took my good D5Ks and made them great. To my ears, music doesn't get sweeter than this. Are there more technically impressive pairings out there? Probably. But I don't feel I could ever want more from a pair of headphones. For someone with an as eclectic music tastes as myself, the D5K+DFR truly does it all and makes everything sound god damn awesome. I am so happy with my purchase, and the DFR is EASILY worth the 199$ asking price in my book. I'm not sure about headphone pairings and whatnot, but for anyone with fostex cans or denon dx000s, go for it! It sounds FANTASTIC.\n\nLastly, since the X2s are a popular headphone around these parts, I'll do a quick comparison:\n\nThe X2 sounds great, but D5K+DFR beats them at everything expect soundstage width. The X2 lacks body and feels very thin, bass impact cannot be compared to the D5K, none of the sounds is as \"sweet\" as they are in the D5K - nothing sounds as good if that makes sense. \n\nWhen I put the x2s into the DFR, I think they were significantly improved however. The X2s scales as well, it would seem. The bass gets tightened up and while less impactful, sounds way better. X2 is one of those headphones were it tries to be a bunch of different sound signatures if that makes sense. With the DFR, they have accepted their fate as neutral opens. Bass calms down, mids comes forward. Highs get a bit bright so anyone afraid of sibilance, avoid this pairing. It wasn't that bad, but something to be aware of. \n\nIf anyone loves the x2 but wants to tighten everything up a bit and make the sound more hi-res, I recommend the DFR!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I first bought the D5K used, as new a month ago. I was planning to get the schiit magni 2 to power them, but thought it might be a bit impractical considering I use my laptop around the house a lot. When the jack on my laptop broke, I started seriously looking into the dragonflies. The red seemed like the best pairing, so I went for it.&lt;/p&gt;\n\n&lt;p&gt;Denon AH-D5000 impressions:&lt;/p&gt;\n\n&lt;p&gt;After having listened to it unamped for almost a month, my view of it was that it was a great headphone with an apparent V-Shape and big bass. The weakness&amp;#39; being some bass bleed, very intimate sound / lacking in soundstage, and somewhat recessed mids. I was very happy with the headphones as is but I felt they were lacking a bit of power and although sensitive, wasn&amp;#39;t driven 100% on my laptop, and even worse on my desktop. &lt;/p&gt;\n\n&lt;p&gt;Enter the Dragonfly Red. First some background, I read that the Dragonfly Black had a warmer sound than the Red, and that the Red had more power  and higher resolution. I figured that a warm sounding set of headphones should be paired with a brighter/more neutral ampdac. &lt;/p&gt;\n\n&lt;p&gt;When I forked out 199$ for the DFR I kinda just expected that I was buying more power for higher volumes and peace of mind so I would just be done with it. &lt;/p&gt;\n\n&lt;p&gt;When I plugged them in, WOW! I could not believe the sound on this pairing. The Dragonfly Red literally fixed all my issues with the D5K&amp;#39;s. &lt;/p&gt;\n\n&lt;p&gt;The most apparant things that I noticed right off the bat was the amazing separation, and &amp;quot;blackness&amp;quot; i.e lack of background noise, which is the strangest thing because I had never thought about or noticed this previously, ever. I actually don&amp;#39;t know what&amp;#39;s doing what as far as sound quality goes, but I&amp;#39;ve read that the blackness is the DAC&amp;#39;s workings. &lt;/p&gt;\n\n&lt;p&gt;The DFR also brought forward the mids, and made the highs even smoother than they already were. I would say the D5Ks are now much more neutral than before, which is largely, I believe, because of the impact the DFR had on the bass. Essentially, the bass extends a tad bit lower, is a bit more weighty in the sub bass region, however is tightened up significantly as far as bass/mid bass goes. This, to my ears, is both a plus and a minus. Essentially, some tracks where I was really enjoying the bass impact isn&amp;#39;t as bassy as I once thought they were. Its not a significant minus, but for any bassheads out there, beware. I would probably look into the Dragonfly Black for bassheads. However, the really low reaching sub bass on deep minimal dubstep tracks for instance carry even more weight now than before, and the definition is just wow. &lt;/p&gt;\n\n&lt;p&gt;I think what shocked me the most about the dragonfly red is the added clarity. Having gone from m50s, to x2, to d5k, to d5k with dfr, I really thought I had all the details I needed around x2/d5k territory. DFR has introduced me to even more details, and so many tracks are vastly different than before. It all sounds fantastic though. &lt;/p&gt;\n\n&lt;p&gt;Moving on, soundstage is wastly improved with DFR. While the imaging was pretty good on the D5K, they were pretty intimate and the soundstage didn&amp;#39;t feel all that natural. With the DFR, it sounds very natural and I prefer it to the x2s soundstage, which, while being a tad wider, doesn&amp;#39;t feel as natural.&lt;/p&gt;\n\n&lt;p&gt;All in all, the DFR took my good D5Ks and made them great. To my ears, music doesn&amp;#39;t get sweeter than this. Are there more technically impressive pairings out there? Probably. But I don&amp;#39;t feel I could ever want more from a pair of headphones. For someone with an as eclectic music tastes as myself, the D5K+DFR truly does it all and makes everything sound god damn awesome. I am so happy with my purchase, and the DFR is EASILY worth the 199$ asking price in my book. I&amp;#39;m not sure about headphone pairings and whatnot, but for anyone with fostex cans or denon dx000s, go for it! It sounds FANTASTIC.&lt;/p&gt;\n\n&lt;p&gt;Lastly, since the X2s are a popular headphone around these parts, I&amp;#39;ll do a quick comparison:&lt;/p&gt;\n\n&lt;p&gt;The X2 sounds great, but D5K+DFR beats them at everything expect soundstage width. The X2 lacks body and feels very thin, bass impact cannot be compared to the D5K, none of the sounds is as &amp;quot;sweet&amp;quot; as they are in the D5K - nothing sounds as good if that makes sense. &lt;/p&gt;\n\n&lt;p&gt;When I put the x2s into the DFR, I think they were significantly improved however. The X2s scales as well, it would seem. The bass gets tightened up and while less impactful, sounds way better. X2 is one of those headphones were it tries to be a bunch of different sound signatures if that makes sense. With the DFR, they have accepted their fate as neutral opens. Bass calms down, mids comes forward. Highs get a bit bright so anyone afraid of sibilance, avoid this pairing. It wasn&amp;#39;t that bad, but something to be aware of. &lt;/p&gt;\n\n&lt;p&gt;If anyone loves the x2 but wants to tighten everything up a bit and make the sound more hi-res, I recommend the DFR!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dg9xgp4", "score_hidden": false, "stickied": false, "created": 1492241090.0, "created_utc": 1492212290.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65fuuo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65fuuo", "likes": null, "replies": "", "user_reports": [], "id": "dga1fxw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "STXDakota", "parent_id": "t1_dga1cru", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Definitely planning to take care of them! I actually purchased the most expensive D5Ks sold after their discontinuation in my country, they were basically never used. Still well below international prices, luckily - was quite the steal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely planning to take care of them! I actually purchased the most expensive D5Ks sold after their discontinuation in my country, they were basically never used. Still well below international prices, luckily - was quite the steal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dga1fxw", "score_hidden": false, "stickied": false, "created": 1492246375.0, "created_utc": 1492217575.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga1cru", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "__nullptr_t", "parent_id": "t3_65fuuo", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I have a pair of D5ks with a cracked gimbal bolt, so they're in two pieces. I'll fix them someday. Take care of them. One of my favorite headphones of all time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a pair of D5ks with a cracked gimbal bolt, so they&amp;#39;re in two pieces. I&amp;#39;ll fix them someday. Take care of them. One of my favorite headphones of all time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dga1cru", "score_hidden": false, "stickied": false, "created": 1492246258.0, "created_utc": 1492217458.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65fuuo", "likes": null, "replies": "", "user_reports": [], "id": "dgav23m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "triplestarfish", "parent_id": "t3_65fuuo", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I love my Denon D5000s... they're the perfect complement to my HD800s. I would also say they're the most fun sounding headphone I've listened to.\n\nIf you're ever interested in making your Denon D5000s have detachable cables, I recommend you check out this website:\nhttps://www.mimic-cables.com/products/miscellaneous-headphone-soldering-work \n\nCosts only $25 and service is great. Have fun listening :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love my Denon D5000s... they&amp;#39;re the perfect complement to my HD800s. I would also say they&amp;#39;re the most fun sounding headphone I&amp;#39;ve listened to.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re ever interested in making your Denon D5000s have detachable cables, I recommend you check out this website:\n&lt;a href=\"https://www.mimic-cables.com/products/miscellaneous-headphone-soldering-work\"&gt;https://www.mimic-cables.com/products/miscellaneous-headphone-soldering-work&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;Costs only $25 and service is great. Have fun listening :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgav23m", "score_hidden": false, "stickied": false, "created": 1492303854.0, "created_utc": 1492275054.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65fuuo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65fuuo", "likes": null, "replies": "", "user_reports": [], "id": "dgaipxr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "STXDakota", "parent_id": "t1_dgaapt8", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "The DFR delivers plenty of juice! 15% on pc, 80-100% on spotify. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The DFR delivers plenty of juice! 15% on pc, 80-100% on spotify. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgaipxr", "score_hidden": false, "stickied": false, "created": 1492280847.0, "created_utc": 1492252047.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaapt8", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "Nightcinder", "parent_id": "t3_65fuuo", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Odd pairing of a really good headphone and subpar amp :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Odd pairing of a really good headphone and subpar amp :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgaapt8", "score_hidden": false, "stickied": false, "created": 1492260316.0, "created_utc": 1492231516.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}]