[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "headphones", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;in this comparison, I&amp;#39;d be using Bose QC20 with active noise cancelling as reference. &lt;/p&gt;\n\n&lt;p&gt;why? one, because I&amp;#39;m used to them, and two, because if you&amp;#39;re reading this, you can probably go to one of Bose showrooms to sample them and have a frame of reference. &lt;/p&gt;\n\n&lt;p&gt;A little about me, I&amp;#39;ve been using Bose QC20 for over 3 years, with active noise canceling during commute and sometimes at work. However, I just recently lost them. So I&amp;#39;ve been shopping for a different pair for the same purpose: drowning out noise. &lt;/p&gt;\n\n&lt;p&gt;It was mentioned in the purchase guide here that, other than Etymotics, Shure and RHA offer pretty much the best-in-class noise isolation (for non-custom IEMs, anyway). And thus I&amp;#39;ve sampled SE215, SE315, and RHA T10. &lt;/p&gt;\n\n&lt;p&gt;I listen to a lot of Hiroyuki Sawano, audiomachine, two steps from hell... basically epic, full music with lots of war drums, bass, electric guitar, strings, and brass. I also listen to acoustic songs by John Mayer, Alicia Keys. Sometimes I enjoy some RnB, Jazz, and Funk, too. I don&amp;#39;t listen to classical, however.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Reference Tracks&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I like to use this track by Hiroyuki Sawano to sample earphones, as it progresses from lows, mids, and highs (and by that time, god knows how many instruments and vocals are on, good to test sound stage)\n&lt;a href=\"https://www.youtube.com/watch?v=2I3KJp58Rfc\"&gt;https://www.youtube.com/watch?v=2I3KJp58Rfc&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;now, on with the comparison! &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;My thoughts on Bose QC20&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;QC20 is very bassy. If you enabled active noise cancelling, their sub is quite deep. so, they&amp;#39;re great for those wardrums in epic battle music some of us use to work / study (or workout... there&amp;#39;s nothing quite like doing your final rep benchpress and feel like you&amp;#39;re charging into battle with 1000 man army)\nat the beginning of this track when the drum toms kick in (32 seconds mark), you&amp;#39;d &amp;#39;feel&amp;#39; each beating of the tom with a &amp;#39;boom&amp;#39;. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d say the noise cancelling module probably acts like an amplifier, as the difference with and without it is staggering. However, things are muddy. I wasn&amp;#39;t able to hear the &amp;#39;attack&amp;#39; of each tom beat, just the echo. \nMids are nothing out of ordinary. They&amp;#39;re there.&lt;/p&gt;\n\n&lt;p&gt;Highs are rolled off early though. you won&amp;#39;t be hearing the harshness of an open hi-hat (1:02 mark in reference track). In general, you won&amp;#39;t be hearing a lot of presence through this pair of earphones, either. \nSound stage is very narrow. You&amp;#39;d hear a bunch of different instruments, but they&amp;#39;re just mixed together, and they come from every direction. &lt;/p&gt;\n\n&lt;p&gt;I think their branding of &amp;quot;Quiet Comfort&amp;quot; is right on the money here, both audibly and physically. Audibly, you won&amp;#39;t be fatigued from highs and presence, since they&amp;#39;re rolled off early. Physically, their earbuds just kinda sit on your ear, and nothing gets inserted into your ear canal. They&amp;#39;re comfortable to wear for long periods of time. \nBose markets to the common folks, not audiophiles nor musicians... and I&amp;#39;d say their sound signature is right on target with this pair. &lt;/p&gt;\n\n&lt;p&gt;Now that we&amp;#39;re done with the reference pair, let&amp;#39;s talk about the comparisons. \nBear in mind that whenever I mention &amp;#39;more&amp;#39; or &amp;#39;less&amp;#39;, it&amp;#39;s always with respect to the QC20. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Shure SE215&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d like to think that Shure designed these for the common folk. but I&amp;#39;d understand that they&amp;#39;re probably out of their depth, as they&amp;#39;re more experienced in dealing with musicians. &lt;/p&gt;\n\n&lt;p&gt;The bass on this pair seems to be exaggerated.. it&amp;#39;s right on your face. It&amp;#39;d be impossible to ignore. However, as big and fat the bass is, it lacks power. It&amp;#39;s almost like you&amp;#39;re driving next to a big truck, but when it passes by, you don&amp;#39;t feel the road shaking underneath. Compared to QC20, you won&amp;#39;t &lt;em&gt;feel&lt;/em&gt; the toms on 32 seconds mark in the reference track. &lt;/p&gt;\n\n&lt;p&gt;Mids are muddied by the bass... vocals feel like they&amp;#39;re behind a wall of foam. &lt;/p&gt;\n\n&lt;p&gt;Highs are papery thin... and that&amp;#39;s not a good thing. Hi-hats sound like someone playing with a candy wrapper. &lt;/p&gt;\n\n&lt;p&gt;Overall, I&amp;#39;d say QC20 definitely delivers better sound quality than these in almost every aspect. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Shure SE315&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is probably the true entry level to Shure&amp;#39;s sound signature.. If you&amp;#39;re a musician, I can understand why you&amp;#39;d be able to wear these as in ear monitors. &lt;/p&gt;\n\n&lt;p&gt;Bass is very thin... it exists, but they&amp;#39;re kinda like a live band in some private dining event... they&amp;#39;re there, but you won&amp;#39;t be paying attention to them, and you won&amp;#39;t be dancing to them either. &lt;/p&gt;\n\n&lt;p&gt;Mids and highs, however, are MUCH better than the QC20. &lt;/p&gt;\n\n&lt;p&gt;For this pair, it&amp;#39;d be unfair to use the same track above to truly showcase what they&amp;#39;re capable of. So I listened to John Mayer&amp;#39;s performance of &amp;quot;in your atmosphere&amp;quot;:\n&lt;a href=\"https://www.youtube.com/watch?v=7K2DQ8XBRbU\"&gt;https://www.youtube.com/watch?v=7K2DQ8XBRbU&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;First off, when John starts playing his guitar, I got shivers from just how clear the sound of each string being \nplucked.  &lt;/p&gt;\n\n&lt;p&gt;In this song, John plays a lot of natural harmonics, and each one of those sound divine. You&amp;#39;d be able to hear the pick striking the string of the guitar. You&amp;#39;d also be able to hear the strings hitting the guitar fretboard on each hammering. I&amp;#39;ve been missing these with the QC20 all this time! &lt;/p&gt;\n\n&lt;p&gt;I also tried an instrumental track by Yoko Shimomura:\n&lt;a href=\"https://www.youtube.com/watch?v=PGkPEDFRgng\"&gt;https://www.youtube.com/watch?v=PGkPEDFRgng&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;That short piano intro, again, sends shivers down my spine. I could visualize the keys being pressed down delicately from the sound they make when they bottom out. &lt;/p&gt;\n\n&lt;p&gt;If I had to summarize what SE315 has got over QC20, it&amp;#39;s one thing: clarity. and by a very large margin. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;RHA T10 (treble filter)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In terms of bass and power, they&amp;#39;re on par with, if not slightly less than, the QC20.\nI have no complaints about the bass / sub... it&amp;#39;s the mids and highs that I have a problem with. &lt;/p&gt;\n\n&lt;p&gt;The highs are not as rolled off as QC20.. but they sound scathing and messy in general. &lt;/p&gt;\n\n&lt;p&gt;Using the reference track, at 1:02 mark when the choral arrangement and open hi-hat come in, the arrangement becomes messy, with no distinction between mids and highs (strings, hi-hat, choir, brass). It feels very cramped and the sound sources bleed into each other.&lt;/p&gt;\n\n&lt;p&gt;Somehow, QC20 was able to blend the multitude of sound sources better... maybe because they roll off highs earlier? &lt;/p&gt;\n\n&lt;p&gt;If these two were smoothies, then T10 is like a strawberry smoothie with more ice chunks in it, while the QC20 is more like an avocado smoothie with cream and no ice (heavy, fat, no texture) \nBut despite the problem with highs, the T10 offers a more spacious sound stage compared to QC20. &lt;/p&gt;\n\n&lt;p&gt;T10 seems to have a bit of social gap between frequencies. The bass is rich and powerful, with a lot of real estate, but the mids and highs are forced to share a cramped tiny condo. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Additional notes&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;After spending about 3 weeks not using QC20s&amp;#39; active noise cancelling, I bought another pair and started using them again. Fast forward a couple days, I notice that sometimes at nights, especially if I had been using them for long periods of time during the day, I&amp;#39;d get short bouts of tinnitus (gasp!). With this discovery I&amp;#39;m getting a bit worried if active noise cancelling is actually harming my hearing. &lt;/p&gt;\n\n&lt;p&gt;Out of all the earphones in this comparison, the QC20s are still best at drowning out loud talkers and unwanted noises... but if there&amp;#39;s a chance that they&amp;#39;re harming my hearing, then I will avoid them. \nThis is just me though... &lt;/p&gt;\n\n&lt;p&gt;Because of the reason above, I&amp;#39;m tempted to just go with T10, or double down and invest on a pair of T20. \nIf anyone can describe how the T20 sound compared to T10, I&amp;#39;d be very willing to know what you think of them! (ie, if I liked T10, will I like T20? does it fix the problem with mids and highs?)&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s it for my comparison. thanks for reading! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "in this comparison, I'd be using Bose QC20 with active noise cancelling as reference. \n\nwhy? one, because I'm used to them, and two, because if you're reading this, you can probably go to one of Bose showrooms to sample them and have a frame of reference. \n\nA little about me, I've been using Bose QC20 for over 3 years, with active noise canceling during commute and sometimes at work. However, I just recently lost them. So I've been shopping for a different pair for the same purpose: drowning out noise. \n\nIt was mentioned in the purchase guide here that, other than Etymotics, Shure and RHA offer pretty much the best-in-class noise isolation (for non-custom IEMs, anyway). And thus I've sampled SE215, SE315, and RHA T10. \n\nI listen to a lot of Hiroyuki Sawano, audiomachine, two steps from hell... basically epic, full music with lots of war drums, bass, electric guitar, strings, and brass. I also listen to acoustic songs by John Mayer, Alicia Keys. Sometimes I enjoy some RnB, Jazz, and Funk, too. I don't listen to classical, however.\n\n\n**Reference Tracks**\n\nI like to use this track by Hiroyuki Sawano to sample earphones, as it progresses from lows, mids, and highs (and by that time, god knows how many instruments and vocals are on, good to test sound stage)\nhttps://www.youtube.com/watch?v=2I3KJp58Rfc\n\nnow, on with the comparison! \n\n\n**My thoughts on Bose QC20**\n\nQC20 is very bassy. If you enabled active noise cancelling, their sub is quite deep. so, they're great for those wardrums in epic battle music some of us use to work / study (or workout... there's nothing quite like doing your final rep benchpress and feel like you're charging into battle with 1000 man army)\nat the beginning of this track when the drum toms kick in (32 seconds mark), you'd 'feel' each beating of the tom with a 'boom'. \n\nI'd say the noise cancelling module probably acts like an amplifier, as the difference with and without it is staggering. However, things are muddy. I wasn't able to hear the 'attack' of each tom beat, just the echo. \nMids are nothing out of ordinary. They're there.\n\nHighs are rolled off early though. you won't be hearing the harshness of an open hi-hat (1:02 mark in reference track). In general, you won't be hearing a lot of presence through this pair of earphones, either. \nSound stage is very narrow. You'd hear a bunch of different instruments, but they're just mixed together, and they come from every direction. \n\nI think their branding of \"Quiet Comfort\" is right on the money here, both audibly and physically. Audibly, you won't be fatigued from highs and presence, since they're rolled off early. Physically, their earbuds just kinda sit on your ear, and nothing gets inserted into your ear canal. They're comfortable to wear for long periods of time. \nBose markets to the common folks, not audiophiles nor musicians... and I'd say their sound signature is right on target with this pair. \n\nNow that we're done with the reference pair, let's talk about the comparisons. \nBear in mind that whenever I mention 'more' or 'less', it's always with respect to the QC20. \n\n\n**Shure SE215**\n\nI'd like to think that Shure designed these for the common folk. but I'd understand that they're probably out of their depth, as they're more experienced in dealing with musicians. \n\nThe bass on this pair seems to be exaggerated.. it's right on your face. It'd be impossible to ignore. However, as big and fat the bass is, it lacks power. It's almost like you're driving next to a big truck, but when it passes by, you don't feel the road shaking underneath. Compared to QC20, you won't *feel* the toms on 32 seconds mark in the reference track. \n\nMids are muddied by the bass... vocals feel like they're behind a wall of foam. \n\nHighs are papery thin... and that's not a good thing. Hi-hats sound like someone playing with a candy wrapper. \n\nOverall, I'd say QC20 definitely delivers better sound quality than these in almost every aspect. \n\n\n**Shure SE315**\n\nThis is probably the true entry level to Shure's sound signature.. If you're a musician, I can understand why you'd be able to wear these as in ear monitors. \n\nBass is very thin... it exists, but they're kinda like a live band in some private dining event... they're there, but you won't be paying attention to them, and you won't be dancing to them either. \n\nMids and highs, however, are MUCH better than the QC20. \n\nFor this pair, it'd be unfair to use the same track above to truly showcase what they're capable of. So I listened to John Mayer's performance of \"in your atmosphere\":\nhttps://www.youtube.com/watch?v=7K2DQ8XBRbU\n\nFirst off, when John starts playing his guitar, I got shivers from just how clear the sound of each string being \nplucked.  \n\nIn this song, John plays a lot of natural harmonics, and each one of those sound divine. You'd be able to hear the pick striking the string of the guitar. You'd also be able to hear the strings hitting the guitar fretboard on each hammering. I've been missing these with the QC20 all this time! \n\nI also tried an instrumental track by Yoko Shimomura:\nhttps://www.youtube.com/watch?v=PGkPEDFRgng\n\nThat short piano intro, again, sends shivers down my spine. I could visualize the keys being pressed down delicately from the sound they make when they bottom out. \n\nIf I had to summarize what SE315 has got over QC20, it's one thing: clarity. and by a very large margin. \n\n\n**RHA T10 (treble filter)**\n\nIn terms of bass and power, they're on par with, if not slightly less than, the QC20.\nI have no complaints about the bass / sub... it's the mids and highs that I have a problem with. \n\nThe highs are not as rolled off as QC20.. but they sound scathing and messy in general. \n\nUsing the reference track, at 1:02 mark when the choral arrangement and open hi-hat come in, the arrangement becomes messy, with no distinction between mids and highs (strings, hi-hat, choir, brass). It feels very cramped and the sound sources bleed into each other.\n\nSomehow, QC20 was able to blend the multitude of sound sources better... maybe because they roll off highs earlier? \n\nIf these two were smoothies, then T10 is like a strawberry smoothie with more ice chunks in it, while the QC20 is more like an avocado smoothie with cream and no ice (heavy, fat, no texture) \nBut despite the problem with highs, the T10 offers a more spacious sound stage compared to QC20. \n\nT10 seems to have a bit of social gap between frequencies. The bass is rich and powerful, with a lot of real estate, but the mids and highs are forced to share a cramped tiny condo. \n\n\n**Additional notes**\n\nAfter spending about 3 weeks not using QC20s' active noise cancelling, I bought another pair and started using them again. Fast forward a couple days, I notice that sometimes at nights, especially if I had been using them for long periods of time during the day, I'd get short bouts of tinnitus (gasp!). With this discovery I'm getting a bit worried if active noise cancelling is actually harming my hearing. \n\n\nOut of all the earphones in this comparison, the QC20s are still best at drowning out loud talkers and unwanted noises... but if there's a chance that they're harming my hearing, then I will avoid them. \nThis is just me though... \n\n\nBecause of the reason above, I'm tempted to just go with T10, or double down and invest on a pair of T20. \nIf anyone can describe how the T20 sound compared to T10, I'd be very willing to know what you think of them! (ie, if I liked T10, will I like T20? does it fix the problem with mids and highs?)\n\nThat's it for my comparison. thanks for reading! ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "*", "id": "65ge3q", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 22, "report_reasons": null, "author": "jjbblloo", "saved": false, "mod_reports": [], "name": "t3_65ge3q", "subreddit_name_prefixed": "r/headphones", "approved_by": null, "over_18": false, "domain": "self.headphones", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rcyx", "edited": 1492219237.0, "link_flair_css_class": "red", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/headphones/comments/65ge3q/shure_se215_se315_rha_t10_comparison_from_a_long/", "num_reports": null, "locked": false, "stickied": false, "created": 1492246356.0, "url": "https://www.reddit.com/r/headphones/comments/65ge3q/shure_se215_se315_rha_t10_comparison_from_a_long/", "author_flair_text": null, "quarantine": false, "title": "Shure SE215, SE315, RHA T10 comparison from a long time Bose QC20 user (Long Post)", "created_utc": 1492217556.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65ge3q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65ge3q", "likes": null, "replies": "", "user_reports": [], "id": "dgbinxn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jjbblloo", "parent_id": "t1_dga92a3", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I did, and they did sort of help the upper ranges... by filtering them out =/ \nwhen using reference filter, the upper ranges are dampened a little bit (but still lets out more than QC20). \nbass filter would dampen the upper ranges even further, around QC20's levels. as an effect, the lower registers become more prominent and boomy. ", "edited": 1492310556.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did, and they did sort of help the upper ranges... by filtering them out =/ \nwhen using reference filter, the upper ranges are dampened a little bit (but still lets out more than QC20). \nbass filter would dampen the upper ranges even further, around QC20&amp;#39;s levels. as an effect, the lower registers become more prominent and boomy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgbinxn", "score_hidden": false, "stickied": false, "created": 1492336739.0, "created_utc": 1492307939.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga92a3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "djfakey", "parent_id": "t3_65ge3q", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Did you test the reference or bass filter on the T10? Curious if that helped the mid or upper range at all. From what I read T20 are overall better and more \"reference\" I guess. \n\nThanks for your review. I'm going to listen to your reference track now hah", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did you test the reference or bass filter on the T10? Curious if that helped the mid or upper range at all. From what I read T20 are overall better and more &amp;quot;reference&amp;quot; I guess. &lt;/p&gt;\n\n&lt;p&gt;Thanks for your review. I&amp;#39;m going to listen to your reference track now hah&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dga92a3", "score_hidden": false, "stickied": false, "created": 1492257475.0, "created_utc": 1492228675.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65ge3q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65ge3q", "likes": null, "replies": "", "user_reports": [], "id": "dgbj3b3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jjbblloo", "parent_id": "t1_dgatqg5", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I wish that were the case. \n\nI use them around 5 hours a day: 2 hours from my phone during commute at about 50-60% volume, and around 3 - 4 hours from my work computer at 20% volume. \nI don't think this is unreasonable use. \n\nI used to think that it might have been hyper-sensitivity. But after losing my QC20s, I had been using the freebie earphones that came with my phone at significantly higher volumes (no active noise cancelling, needed to pump out more volume to drown out noise)\nThis went on for 3 weeks while I was doing research... and no tinnitus during that time period. \n\nI really wish there was a scientific study on this... but until that happens, personally, I'd err on the side of caution. I value my hearing too much to risk it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish that were the case. &lt;/p&gt;\n\n&lt;p&gt;I use them around 5 hours a day: 2 hours from my phone during commute at about 50-60% volume, and around 3 - 4 hours from my work computer at 20% volume. \nI don&amp;#39;t think this is unreasonable use. &lt;/p&gt;\n\n&lt;p&gt;I used to think that it might have been hyper-sensitivity. But after losing my QC20s, I had been using the freebie earphones that came with my phone at significantly higher volumes (no active noise cancelling, needed to pump out more volume to drown out noise)\nThis went on for 3 weeks while I was doing research... and no tinnitus during that time period. &lt;/p&gt;\n\n&lt;p&gt;I really wish there was a scientific study on this... but until that happens, personally, I&amp;#39;d err on the side of caution. I value my hearing too much to risk it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgbj3b3", "score_hidden": false, "stickied": false, "created": 1492337369.0, "created_utc": 1492308569.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgatqg5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Soarinfire", "parent_id": "t3_65ge3q", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "You either push your phones way too loud or just wear them for unreasonable amount of time per day. There's no way a noise canceller can directly harm yer hearing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You either push your phones way too loud or just wear them for unreasonable amount of time per day. There&amp;#39;s no way a noise canceller can directly harm yer hearing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgatqg5", "score_hidden": false, "stickied": false, "created": 1492301984.0, "created_utc": 1492273184.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65ge3q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65ge3q", "likes": null, "replies": "", "user_reports": [], "id": "dgbj5cg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jjbblloo", "parent_id": "t1_dgbcya4", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I was so tempted to get them regardless... but I haven't been playing on stage for a while now. Maybe some time in the future!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was so tempted to get them regardless... but I haven&amp;#39;t been playing on stage for a while now. Maybe some time in the future!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgbj5cg", "score_hidden": false, "stickied": false, "created": 1492337452.0, "created_utc": 1492308652.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbcya4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ghost6x", "parent_id": "t3_65ge3q", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "SE315 is a godsend for tracking your own tone if you play an instrument.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;SE315 is a godsend for tracking your own tone if you play an instrument.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgbcya4", "score_hidden": false, "stickied": false, "created": 1492328581.0, "created_utc": 1492299781.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]