[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "headphones", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;TL;DR:&lt;/strong&gt; I tried a bunch of high-end stuff. I learned three surprising things: &lt;/p&gt;\n\n&lt;p&gt;1)  $4k headphones are a waste of money unless you already have everything else you could possibly want and have so much money that you just can’t be bothered with choices. &lt;/p&gt;\n\n&lt;p&gt;2)  The difference between $1000 headphones like LCD-2s and Elears and headphones upwards of $1600, or even $4000, isn’t nearly as profound as the difference between the DAC in the Jotunheim and even mid-fi dedicated units. &lt;/p&gt;\n\n&lt;p&gt;3)  Instead of upgrading my LCD-2s to something else, I may upgrade my upstream. &lt;/p&gt;\n\n&lt;p&gt;edit: Okay, I&amp;#39;ll come up with some kind of comparison between my NFB-11 and Jotunheim.&lt;/p&gt;\n\n&lt;p&gt;Last weekend I had the opportunity to listen to a variety of high-end headphones under three different DAC/AMP conditions and my results were surprising. First, a bit about me. While I&amp;#39;m a committed enthusiast, I&amp;#39;m not an expert (so if I use jargon for describing sounds wrong don&amp;#39;t skewer me). I currently use Audeze LCD-2s off of a Jotunheim DAC/amp combo. While I love the warm and smooth, liquid musicality of my LCD-2s, I have the following two problems and am seeking an upgrade: a)    Some instruments, especially strings, are not forward enough for me. b) To bring those instruments forward, I have to increase the volume and the bass becomes a bit too overwhelming. &lt;/p&gt;\n\n&lt;p&gt;I tried Sennheiser HD800S, Focal Elear, LCD-3, LCD-X, LCD-4, HiFiman HE-1000, and Focal Utopia. I also got to listen to these over a Jotunheim, a Jotunheim with a portable, stand-alone DAC in the $300 range (I don’t remember what it was) and a $2500 Naim DAC-V1. I was mainly alternating between 4 different albums, including a best of Metallica album, a Bach cello concerto, DeadMau5, and Norah Jones. &lt;/p&gt;\n\n&lt;p&gt;While all of these headphones offered a better—or at least different—sound signature, NOTHING made as big of a difference as DAC/Amp, or even just the DAC. This was very surprising for me because I was of the opinion that a DAC is a DAC.&lt;/p&gt;\n\n&lt;p&gt;Like night and day, bros. Even the Jotunheim with the external DAC made a huge difference that was immediately noticeable. And I mean IMMEDIATE—not like listening for 10 minutes and being like “Oh, I think I hear a slight decrease in blah, blah, blah audiophile non-sense”. Like it was BAM UP IN MY FACE. \nSwitching to the Naim DAC-V1—which was fantastic btw—I can report the following experiences with the above headphones.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Audeze LCD-2 (my baseline):&lt;/strong&gt; While I still felt they were a bit too muted in some instruments, they sounded much better. I feel like I was getting to know them in a much more authentic way. They were still liquidy and beautiful, but somehow lacking in the presence and forwardness of instruments. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Audeze LCD-3:&lt;/strong&gt; Since I still love my LCD-2s, the 3s were the natural thing to try. Like many have said, the LCD-3s are basically like the LCD-2s but better in every way. I found this to be true. The mids and highs were definitely more present. They just sounded better the LCD-2s, but essentially similar in sound signature.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Audeze LCD-X:&lt;/strong&gt; Honestly, these were my favorites. I wasn’t expecting to like these more than the 3s for some unknown reason (probably some kind of irrational bias that I think low-impedance headphones can’t be good). But I was immediately blown away listening to the Bach cello concerto, and I’m not really even into classical music. Like tear inducing strings. These cans still have the “Audeze sound”, but they are definitely very different than the rest of the LCD line. Very balanced but still so musical and enjoyable. They sounded fabulous with everything, but seriously.. those strings I could feel them in my soul.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Sennheiser HD800S:&lt;/strong&gt; I get it. I can see why some people love these things, though I am now confident that they aren’t for me. They’re so damn detailed and transparent. You hear every little thing. However, listening to the same concerto, I was already beginning to feel a bit uncomfortable after only 30 seconds or so—not in terms of fitment, but like an acute ache in my head. Maybe the brightness? They are piercing somehow. They are so damn analytical.. I mean, if I wanted to sit around and analyze music I’d want these, but I can’t think of any time when I would choose them if I wanted to enjoy music. Don’t get me wrong—they’re great headphones and I wouldn’t kick them out of bed if someone gave them to me, but I have no interest in purchasing them against these other options. Lots of soundstage but like so what?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Focal Elear:&lt;/strong&gt; These are beautiful headphones but like the LCD-2s they are flawed, and in the opposite way. They’re like the anti-LCDs. Whereas I feel like the LCD-2s just kind of mute much of the high end (albeit in a tasteful and smooth way), the low-end on these things just seemed wrong—it was there but it sounded distorted like it was trying too hard in order to make it. The bass is rolled off, but somehow unevenly and clumsily. They’re very lively and musical, but something is missing and conspicuously so. Maybe it’s the mid-bass, I don’t know. When the low-end isn’t needed, they were liquid and lively. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I was also very excited that I got to try some “summit-fi” headphones priced upwards of $3k. Let me first say that I was very gratified to have come away with the impression that there isn’t much higher to go past the $2k mark. None of these gave me the “wow” I was expecting for the price. Were they all excellent headphones and “better” than the rest? I suppose. But the difference was very “meh”.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;HiFiman HE-1000:&lt;/strong&gt; I don’t know what I can really say about these. They were comfortable, attractive, and functionally flawless. I also have no desire to hear them again. They did everything well while still managing to be kind of boring. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Audeze LCD-4:&lt;/strong&gt; They’re lighter and more comfortable than the LCD-3s, but this is probably only due to the carbon fiber headband, which you can buy and install on any other LCD can. Were they better than the LCD-3s? I suppose. Whereas the LCD-3 had a distinct sound—perhaps due to some sacrifice or design choice by Audeze—the LCD-4s didn’t seem to. They were buttery like all the LCDs, balanced and more interesting than the HiFimans, but still I was totally underwhelmed for headphone that costs $4k. Total meh.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Focal Utopia:&lt;/strong&gt; I can see why people say these are the best headphones in the world, or at least the best dynamics. Whereas the Elear were flawed, these aren’t. Everything is there and perfect. I heard well-reproduced low bass tones that were so damn clean and tight, while at the same time the highs and mids were all there and perfect, too. The dynamic range was astonishing. The imaging was flawless---listening to some wizzy noises in Deadmau5 moving left and right there as an accuracy and clarity that made it all somehow holographic, like a real thing was going on. I think the Utopias actually gave me a good sense of what $4k headphones sound like. Still, I was very disappointed. Are they the best dynamic headphones in the world? Yes. BUT are they THAT much better than headphones costing half the price? No way. Honestly, I think I still liked the LCD-X better. While not perfect, I just enjoyed them more. And considering that for the difference in price I could also get the $2500 Naim DAC-V1, this just isn’t a difficult decision. I felt very gratified knowing that I will never have to spend $4000 dollars on headphones and can be totally okay with it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**TL;DR:** I tried a bunch of high-end stuff. I learned three surprising things: \n\n1)\t$4k headphones are a waste of money unless you already have everything else you could possibly want and have so much money that you just can’t be bothered with choices. \n\n2)\tThe difference between $1000 headphones like LCD-2s and Elears and headphones upwards of $1600, or even $4000, isn’t nearly as profound as the difference between the DAC in the Jotunheim and even mid-fi dedicated units. \n\n3)\tInstead of upgrading my LCD-2s to something else, I may upgrade my upstream. \n\nedit: Okay, I'll come up with some kind of comparison between my NFB-11 and Jotunheim.\n\nLast weekend I had the opportunity to listen to a variety of high-end headphones under three different DAC/AMP conditions and my results were surprising. First, a bit about me. While I'm a committed enthusiast, I'm not an expert (so if I use jargon for describing sounds wrong don't skewer me). I currently use Audeze LCD-2s off of a Jotunheim DAC/amp combo. While I love the warm and smooth, liquid musicality of my LCD-2s, I have the following two problems and am seeking an upgrade: a)\tSome instruments, especially strings, are not forward enough for me. b) To bring those instruments forward, I have to increase the volume and the bass becomes a bit too overwhelming. \n\nI tried Sennheiser HD800S, Focal Elear, LCD-3, LCD-X, LCD-4, HiFiman HE-1000, and Focal Utopia. I also got to listen to these over a Jotunheim, a Jotunheim with a portable, stand-alone DAC in the $300 range (I don’t remember what it was) and a $2500 Naim DAC-V1. I was mainly alternating between 4 different albums, including a best of Metallica album, a Bach cello concerto, DeadMau5, and Norah Jones. \n\nWhile all of these headphones offered a better—or at least different—sound signature, NOTHING made as big of a difference as DAC/Amp, or even just the DAC. This was very surprising for me because I was of the opinion that a DAC is a DAC.\n\nLike night and day, bros. Even the Jotunheim with the external DAC made a huge difference that was immediately noticeable. And I mean IMMEDIATE—not like listening for 10 minutes and being like “Oh, I think I hear a slight decrease in blah, blah, blah audiophile non-sense”. Like it was BAM UP IN MY FACE. \nSwitching to the Naim DAC-V1—which was fantastic btw—I can report the following experiences with the above headphones.\n\n**Audeze LCD-2 (my baseline):** While I still felt they were a bit too muted in some instruments, they sounded much better. I feel like I was getting to know them in a much more authentic way. They were still liquidy and beautiful, but somehow lacking in the presence and forwardness of instruments. \n\n**Audeze LCD-3:** Since I still love my LCD-2s, the 3s were the natural thing to try. Like many have said, the LCD-3s are basically like the LCD-2s but better in every way. I found this to be true. The mids and highs were definitely more present. They just sounded better the LCD-2s, but essentially similar in sound signature.\n\n**Audeze LCD-X:** Honestly, these were my favorites. I wasn’t expecting to like these more than the 3s for some unknown reason (probably some kind of irrational bias that I think low-impedance headphones can’t be good). But I was immediately blown away listening to the Bach cello concerto, and I’m not really even into classical music. Like tear inducing strings. These cans still have the “Audeze sound”, but they are definitely very different than the rest of the LCD line. Very balanced but still so musical and enjoyable. They sounded fabulous with everything, but seriously.. those strings I could feel them in my soul.\n\n**Sennheiser HD800S:** I get it. I can see why some people love these things, though I am now confident that they aren’t for me. They’re so damn detailed and transparent. You hear every little thing. However, listening to the same concerto, I was already beginning to feel a bit uncomfortable after only 30 seconds or so—not in terms of fitment, but like an acute ache in my head. Maybe the brightness? They are piercing somehow. They are so damn analytical.. I mean, if I wanted to sit around and analyze music I’d want these, but I can’t think of any time when I would choose them if I wanted to enjoy music. Don’t get me wrong—they’re great headphones and I wouldn’t kick them out of bed if someone gave them to me, but I have no interest in purchasing them against these other options. Lots of soundstage but like so what?\n\n**Focal Elear:** These are beautiful headphones but like the LCD-2s they are flawed, and in the opposite way. They’re like the anti-LCDs. Whereas I feel like the LCD-2s just kind of mute much of the high end (albeit in a tasteful and smooth way), the low-end on these things just seemed wrong—it was there but it sounded distorted like it was trying too hard in order to make it. The bass is rolled off, but somehow unevenly and clumsily. They’re very lively and musical, but something is missing and conspicuously so. Maybe it’s the mid-bass, I don’t know. When the low-end isn’t needed, they were liquid and lively. \n\n\n*I was also very excited that I got to try some “summit-fi” headphones priced upwards of $3k. Let me first say that I was very gratified to have come away with the impression that there isn’t much higher to go past the $2k mark. None of these gave me the “wow” I was expecting for the price. Were they all excellent headphones and “better” than the rest? I suppose. But the difference was very “meh”.*\n\n\n**HiFiman HE-1000:** I don’t know what I can really say about these. They were comfortable, attractive, and functionally flawless. I also have no desire to hear them again. They did everything well while still managing to be kind of boring. \n\n**Audeze LCD-4:** They’re lighter and more comfortable than the LCD-3s, but this is probably only due to the carbon fiber headband, which you can buy and install on any other LCD can. Were they better than the LCD-3s? I suppose. Whereas the LCD-3 had a distinct sound—perhaps due to some sacrifice or design choice by Audeze—the LCD-4s didn’t seem to. They were buttery like all the LCDs, balanced and more interesting than the HiFimans, but still I was totally underwhelmed for headphone that costs $4k. Total meh.\n\n**Focal Utopia:** I can see why people say these are the best headphones in the world, or at least the best dynamics. Whereas the Elear were flawed, these aren’t. Everything is there and perfect. I heard well-reproduced low bass tones that were so damn clean and tight, while at the same time the highs and mids were all there and perfect, too. The dynamic range was astonishing. The imaging was flawless---listening to some wizzy noises in Deadmau5 moving left and right there as an accuracy and clarity that made it all somehow holographic, like a real thing was going on. I think the Utopias actually gave me a good sense of what $4k headphones sound like. Still, I was very disappointed. Are they the best dynamic headphones in the world? Yes. BUT are they THAT much better than headphones costing half the price? No way. Honestly, I think I still liked the LCD-X better. While not perfect, I just enjoyed them more. And considering that for the difference in price I could also get the $2500 Naim DAC-V1, this just isn’t a difficult decision. I felt very gratified knowing that I will never have to spend $4000 dollars on headphones and can be totally okay with it.\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "*", "id": "65z8cf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 46, "report_reasons": null, "author": "Ineffable_yet_f-able", "saved": false, "mod_reports": [], "name": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "approved_by": null, "over_18": false, "domain": "self.headphones", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rcyx", "edited": 1492482699.0, "link_flair_css_class": "red", "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/headphones/comments/65z8cf/i_got_to_try_a_bunch_of_highend_gear_these_were/", "num_reports": null, "locked": false, "stickied": false, "created": 1492500987.0, "url": "https://www.reddit.com/r/headphones/comments/65z8cf/i_got_to_try_a_bunch_of_highend_gear_these_were/", "author_flair_text": "Jotunheim-&gt;LCD-2//NFB-11-&gt;HD-650//Fulla2-&gt;SHP9500//LGV20-&gt;m40x", "quarantine": false, "title": "I got to try a bunch of high-end gear. These were my experiences. Surprises: $4k cans underwhelming, DACs make big difference.", "created_utc": 1492472187.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 83, "visited": false, "subreddit_type": "public", "ups": 46}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgel955", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "scenque", "parent_id": "t1_dgekv7n", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "The amp itself is not bad. It's not to my particular tastes, but I can see its appeal. I just wouldn't bother with the DAC module.", "edited": 1492492591.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The amp itself is not bad. It&amp;#39;s not to my particular tastes, but I can see its appeal. I just wouldn&amp;#39;t bother with the DAC module.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgel955", "score_hidden": false, "stickied": false, "created": 1492512959.0, "created_utc": 1492484159.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgekv7n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pieman3141", "parent_id": "t1_dgef41v", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I was fairly curious about the Jotunheim, but it looks like I'll be staying away now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was fairly curious about the Jotunheim, but it looks like I&amp;#39;ll be staying away now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgekv7n", "score_hidden": false, "stickied": false, "created": 1492512463.0, "created_utc": 1492483663.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgef41v", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "scenque", "parent_id": "t1_dgedbho", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "The Jotunheim DAC module is pretty lackluster, IMHO. It's USB-powered and seems particularly susceptible to USB noise. You'll notice a big improvement with a Modi Multibit or even a better-executed AKM4490 implementation. I would absolutely consider upgrading amps before looking into buying a DAC that costs more than the base cost of the Jotunheim.", "edited": 1492476904.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Jotunheim DAC module is pretty lackluster, IMHO. It&amp;#39;s USB-powered and seems particularly susceptible to USB noise. You&amp;#39;ll notice a big improvement with a Modi Multibit or even a better-executed AKM4490 implementation. I would absolutely consider upgrading amps before looking into buying a DAC that costs more than the base cost of the Jotunheim.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgef41v", "score_hidden": false, "stickied": false, "created": 1492505483.0, "created_utc": 1492476683.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgedbho", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgecr4f", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I know, right? I was really surprised. Like how big of a difference can a DAC make? But at least compared to the DAC module in my Jotunheim the difference was huge. The question burning me right now isn't whether I need to upgrade my DAC, but how much. Would a $400 Bifrost do just as well as a $1250 Gungnir MB? All these people on the net say so but, you know... i mean a DAC is a DAC right....right? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know, right? I was really surprised. Like how big of a difference can a DAC make? But at least compared to the DAC module in my Jotunheim the difference was huge. The question burning me right now isn&amp;#39;t whether I need to upgrade my DAC, but how much. Would a $400 Bifrost do just as well as a $1250 Gungnir MB? All these people on the net say so but, you know... i mean a DAC is a DAC right....right? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgedbho", "score_hidden": false, "stickied": false, "created": 1492503246.0, "created_utc": 1492474446.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgepdkb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HandsomeEarHair", "parent_id": "t1_dgecr4f", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Anyone who shares an honest opinion is brave around these parts. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anyone who shares an honest opinion is brave around these parts. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgepdkb", "score_hidden": false, "stickied": false, "created": 1492518793.0, "created_utc": 1492489993.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgecr4f", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "teainhaler77", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "You are a brave man to say that DACs sound different :D \n\nI also felt that with my HD800s everything downstream mattered much more.   Amp, DAC, and source  all made very noticeable difference.   At summit-fi all downstream components are critical much more so that mid-fi / hi-fi.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are a brave man to say that DACs sound different :D &lt;/p&gt;\n\n&lt;p&gt;I also felt that with my HD800s everything downstream mattered much more.   Amp, DAC, and source  all made very noticeable difference.   At summit-fi all downstream components are critical much more so that mid-fi / hi-fi.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgecr4f", "score_hidden": false, "stickied": false, "created": 1492502517.0, "created_utc": 1492473717.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgen7g1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgemu01", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Point taken. Still, I really don't believe that was the case this time. I've messed around with a fair amount of gear, done lots of AB testing on my own toys, etc. I know small differences in volume can really tricky but I have *some* experience dealing with. This time I'm convinced there really was a there there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Point taken. Still, I really don&amp;#39;t believe that was the case this time. I&amp;#39;ve messed around with a fair amount of gear, done lots of AB testing on my own toys, etc. I know small differences in volume can really tricky but I have &lt;em&gt;some&lt;/em&gt; experience dealing with. This time I&amp;#39;m convinced there really was a there there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgen7g1", "score_hidden": false, "stickied": false, "created": 1492515563.0, "created_utc": 1492486763.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemu01", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Mugtrees", "parent_id": "t1_dgeiu32", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Honestly it can make a big difference. Different dacs will output at different volume levels and a small difference in volume is often perceived as an increase in quality :/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly it can make a big difference. Different dacs will output at different volume levels and a small difference in volume is often perceived as an increase in quality :/&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgemu01", "score_hidden": false, "stickied": false, "created": 1492515034.0, "created_utc": 1492486234.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeiu32", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgefxtz", "subreddit_name_prefixed": "r/headphones", "controversiality": 1, "body": "Volume matching is definitely a big deal. I always try to volume match, though obviously I could only \"earball it\" while I was swapping out all this stuff. It shouldn't have made any difference with swapping out the onboard Jotunheim DAC for the others because I was still using the Jot as an amp, but anyway it wasn't even close. Like I said, it was \"night and day\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Volume matching is definitely a big deal. I always try to volume match, though obviously I could only &amp;quot;earball it&amp;quot; while I was swapping out all this stuff. It shouldn&amp;#39;t have made any difference with swapping out the onboard Jotunheim DAC for the others because I was still using the Jot as an amp, but anyway it wasn&amp;#39;t even close. Like I said, it was &amp;quot;night and day&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeiu32", "score_hidden": false, "stickied": false, "created": 1492510035.0, "created_utc": 1492481235.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgefxtz", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Snather", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Did you volume match? This seems to be the deciding factor as to whether people notice differences between DACs or not. At least that's what \"objectivists\" on forums seem to insist.\n\nDisclaimer: I notice differences between DACs but I have never volume matched properly. I will be doing so in the future to check.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did you volume match? This seems to be the deciding factor as to whether people notice differences between DACs or not. At least that&amp;#39;s what &amp;quot;objectivists&amp;quot; on forums seem to insist.&lt;/p&gt;\n\n&lt;p&gt;Disclaimer: I notice differences between DACs but I have never volume matched properly. I will be doing so in the future to check.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgefxtz", "score_hidden": false, "stickied": false, "created": 1492506507.0, "created_utc": 1492477707.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgen8dz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgemydf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "lol. that's funny. I guess we're all a bit guilty of that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol. that&amp;#39;s funny. I guess we&amp;#39;re all a bit guilty of that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgen8dz", "score_hidden": false, "stickied": false, "created": 1492515601.0, "created_utc": 1492486801.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgesqdx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "zoom25", "parent_id": "t1_dgesbdi", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I've been posting here for 5 years and the first few years were tolerable. The past 2 it has really gone down the toilet.\n\nFunny thing about blind testing. Somebody posted two files (lossless and 320 versions) awhile back, and nobody wanted to discuss how they hear things or what to look for. I posted full comments on what segments to look out in the track and what differences I heard. Only 1 person somewhat engaged me about the actual sound, everyone else was stuck on their same preconceived notion. Zero discussion on the actual sound from the self-professed \"objectivists.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been posting here for 5 years and the first few years were tolerable. The past 2 it has really gone down the toilet.&lt;/p&gt;\n\n&lt;p&gt;Funny thing about blind testing. Somebody posted two files (lossless and 320 versions) awhile back, and nobody wanted to discuss how they hear things or what to look for. I posted full comments on what segments to look out in the track and what differences I heard. Only 1 person somewhat engaged me about the actual sound, everyone else was stuck on their same preconceived notion. Zero discussion on the actual sound from the self-professed &amp;quot;objectivists.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgesqdx", "score_hidden": false, "stickied": false, "created": 1492525021.0, "created_utc": 1492496221.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgesbdi", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Elnrik", "parent_id": "t1_dgemydf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "It's also the home of \"if it wasn't double-blind tested in the world's best Anechoic chamber with a shit-ton of other impossible conditions, then it isn't worth shit and I'll stick to my own beliefs formed by confirmation bias and popular tripe\".   AKA, Reddit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s also the home of &amp;quot;if it wasn&amp;#39;t double-blind tested in the world&amp;#39;s best Anechoic chamber with a shit-ton of other impossible conditions, then it isn&amp;#39;t worth shit and I&amp;#39;ll stick to my own beliefs formed by confirmation bias and popular tripe&amp;quot;.   AKA, Reddit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgesbdi", "score_hidden": false, "stickied": false, "created": 1492524077.0, "created_utc": 1492495277.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemydf", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "zoom25", "parent_id": "t1_dgemn95", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "lol you won't make much progress here. As someone said, this is the home of budget-fi and where gear coincidentally stops making a difference past their budget.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol you won&amp;#39;t make much progress here. As someone said, this is the home of budget-fi and where gear coincidentally stops making a difference past their budget.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgemydf", "score_hidden": false, "stickied": false, "created": 1492515200.0, "created_utc": 1492486400.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgeolrb", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "drbobbybones", "parent_id": "t1_dgemn95", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Bravo.  Perfect shutdown.\n\nI see you've now met one of the objectivist trolls on this subreddit.  Somehow, his neckbeard and YouTube education means more than your degrees in umm... detecting bias and eliminating it from your work.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bravo.  Perfect shutdown.&lt;/p&gt;\n\n&lt;p&gt;I see you&amp;#39;ve now met one of the objectivist trolls on this subreddit.  Somehow, his neckbeard and YouTube education means more than your degrees in umm... detecting bias and eliminating it from your work.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeolrb", "score_hidden": false, "stickied": false, "created": 1492517621.0, "created_utc": 1492488821.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemn95", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgem275", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Listen, dude. I'm a statistician and social scientist. I know about bias. I was comparing headphones with no expectation of DACs whatsoever. Somebody else swapped a DAC of their own initiative and said \"listen now\". I know even small differences in volume we may not even be consciously aware of can predict AB test outcomes, but the difference was huge, i.e., too large to be fully explained by a slight difference in volume. \n\nPS. FYI, what people are responding negatively about isn't the \"extensive methodological deficiencies and contradictions with peer-reviewed research\" you identify, it's your condescension and arrogance.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Listen, dude. I&amp;#39;m a statistician and social scientist. I know about bias. I was comparing headphones with no expectation of DACs whatsoever. Somebody else swapped a DAC of their own initiative and said &amp;quot;listen now&amp;quot;. I know even small differences in volume we may not even be consciously aware of can predict AB test outcomes, but the difference was huge, i.e., too large to be fully explained by a slight difference in volume. &lt;/p&gt;\n\n&lt;p&gt;PS. FYI, what people are responding negatively about isn&amp;#39;t the &amp;quot;extensive methodological deficiencies and contradictions with peer-reviewed research&amp;quot; you identify, it&amp;#39;s your condescension and arrogance.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgemn95", "score_hidden": false, "stickied": false, "created": 1492514777.0, "created_utc": 1492485977.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgem275", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "ilkless", "parent_id": "t1_dgel115", "subreddit_name_prefixed": "r/headphones", "controversiality": 1, "body": "Expectation bias is not something that can be consciously willed away, hence the requirement for double-blind setups.\n\nAnd you'll be surprised at the effects of volume differences (not least due to Fletcher-Munson loudness contours).\n\n&gt;this wasn't that close\n\nSighted listening is useless in establishing empirical claims of performance.\n\nMatch loudness, match the filter roll-off, ensure there is no.clipping and you'll see the differences disappear.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Expectation bias is not something that can be consciously willed away, hence the requirement for double-blind setups.&lt;/p&gt;\n\n&lt;p&gt;And you&amp;#39;ll be surprised at the effects of volume differences (not least due to Fletcher-Munson loudness contours).&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;this wasn&amp;#39;t that close&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sighted listening is useless in establishing empirical claims of performance.&lt;/p&gt;\n\n&lt;p&gt;Match loudness, match the filter roll-off, ensure there is no.clipping and you&amp;#39;ll see the differences disappear.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgem275", "score_hidden": false, "stickied": false, "created": 1492513993.0, "created_utc": 1492485193.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgel115", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgeknv0", "subreddit_name_prefixed": "r/headphones", "controversiality": 1, "body": "I don't know about that. I agree that even small volume differences can tip an AB test one way or another but, again, this wasn't that close. It was the difference of looking into a fishbowl with freshly changed water vs one that hasn't been cleaned in a month. It was instantaneous and immediate, and at the time I really had no expectation that there was going to be a difference at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know about that. I agree that even small volume differences can tip an AB test one way or another but, again, this wasn&amp;#39;t that close. It was the difference of looking into a fishbowl with freshly changed water vs one that hasn&amp;#39;t been cleaned in a month. It was instantaneous and immediate, and at the time I really had no expectation that there was going to be a difference at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgel115", "score_hidden": false, "stickied": false, "created": 1492512667.0, "created_utc": 1492483867.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeknv0", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "ilkless", "parent_id": "t1_dgejfml", "subreddit_name_prefixed": "r/headphones", "controversiality": 1, "body": "&gt;I do my best to volume match\n\nUseless as long as the matching is worse than +/- 0.5dB and it is not ascertained that both chains are not clipping.\n\nEDIT: as usual, there seem to be people who are unhappy when extensive methodological deficiencies and contradictions with peer-reviewed research are identified", "edited": 1492485289.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I do my best to volume match&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Useless as long as the matching is worse than +/- 0.5dB and it is not ascertained that both chains are not clipping.&lt;/p&gt;\n\n&lt;p&gt;EDIT: as usual, there seem to be people who are unhappy when extensive methodological deficiencies and contradictions with peer-reviewed research are identified&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeknv0", "score_hidden": false, "stickied": false, "created": 1492512214.0, "created_utc": 1492483414.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgejfml", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgeir05", "subreddit_name_prefixed": "r/headphones", "controversiality": 1, "body": "Yeah, I get you. This is why I was so surprised. And even now I'm skeptical over how much DAC is really necessary. But compared to the DAC on my Jotunheim, there wasn't even a comparison. Night. And. Day. I do my best to volume match--and granted at the time I only had the same crude ability to do so you employ--it wasn't even close. So my question is whether I upgrade to something like a Bifrost or even a Modi MB, or do I go balls out and get a Gumby. I don't feel the need to overpay for stuff that produces no tangible benefit, but GODDAMN this experience really convinced me that DAC matters. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I get you. This is why I was so surprised. And even now I&amp;#39;m skeptical over how much DAC is really necessary. But compared to the DAC on my Jotunheim, there wasn&amp;#39;t even a comparison. Night. And. Day. I do my best to volume match--and granted at the time I only had the same crude ability to do so you employ--it wasn&amp;#39;t even close. So my question is whether I upgrade to something like a Bifrost or even a Modi MB, or do I go balls out and get a Gumby. I don&amp;#39;t feel the need to overpay for stuff that produces no tangible benefit, but GODDAMN this experience really convinced me that DAC matters. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgejfml", "score_hidden": false, "stickied": false, "created": 1492510728.0, "created_utc": 1492481928.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeir05", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "TheJniac", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Part of the problem with DAC comparisons is that different DACs output at different voltages, and this is means that they will have different volumes. I too was blown away when I got my Modi Multibit, but later on I noticed that I was turning the volume down a bit because things were a bit louder than I was used to. Having noticed this, I dug the cable that I used to connect my onboard to my Magni and did a comparison. As expected, the DAC was louder, and here is the part that surprised me: after volume matching by ear, any major differences went away. \n\nAnother point of contention - one upon which I cannot give any personal experience so take the following with that in mind - is that different DACs, even ones that use the same actual converter like the ES9038 or AKM4490, can have different implementations that can make them sound different. This brings up the question of \"is different necessarily better?\" For example, Schiit really harps about their multibit thing, about how it is different and supposedly revolutionary, but I have never actually seen any evidence of this that cannot be attributed to psychology rather than sound quality. I cannot help but wonder if actually using the full 16 bits matters, given that even audiophiles have sung the praises of delta-sigma DACs,  [neither Tyll nor Bob Katz could tell between the Yggrasil and some ridiculous D-S DAC](http://www.innerfidelity.com/content/big-sound-2015-biting-bullet-bob-katz), and that we have ostensibly been fine with delta-sigma for quite a while without any serious \"something is missing\" issues. Even the anal-psychotic that runs [Noaudiophile.com](http://noaudiophile.com/Selah_Mejor/) does not use any kind of fancy DAC in his setup.\n\nTo conclude, I am not saying that DACs do not make a difference. I am saying that I did not notice any differences jumping out after I had crudely volume matched, and that I have not seen any serious evidence that anyone can tell the difference blindly. I am not even saying that conclusive evidence from a meticulously-designed double-blind experiment does not exist, just that *I* have not seen it. If anyone has, let me know. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Part of the problem with DAC comparisons is that different DACs output at different voltages, and this is means that they will have different volumes. I too was blown away when I got my Modi Multibit, but later on I noticed that I was turning the volume down a bit because things were a bit louder than I was used to. Having noticed this, I dug the cable that I used to connect my onboard to my Magni and did a comparison. As expected, the DAC was louder, and here is the part that surprised me: after volume matching by ear, any major differences went away. &lt;/p&gt;\n\n&lt;p&gt;Another point of contention - one upon which I cannot give any personal experience so take the following with that in mind - is that different DACs, even ones that use the same actual converter like the ES9038 or AKM4490, can have different implementations that can make them sound different. This brings up the question of &amp;quot;is different necessarily better?&amp;quot; For example, Schiit really harps about their multibit thing, about how it is different and supposedly revolutionary, but I have never actually seen any evidence of this that cannot be attributed to psychology rather than sound quality. I cannot help but wonder if actually using the full 16 bits matters, given that even audiophiles have sung the praises of delta-sigma DACs,  &lt;a href=\"http://www.innerfidelity.com/content/big-sound-2015-biting-bullet-bob-katz\"&gt;neither Tyll nor Bob Katz could tell between the Yggrasil and some ridiculous D-S DAC&lt;/a&gt;, and that we have ostensibly been fine with delta-sigma for quite a while without any serious &amp;quot;something is missing&amp;quot; issues. Even the anal-psychotic that runs &lt;a href=\"http://noaudiophile.com/Selah_Mejor/\"&gt;Noaudiophile.com&lt;/a&gt; does not use any kind of fancy DAC in his setup.&lt;/p&gt;\n\n&lt;p&gt;To conclude, I am not saying that DACs do not make a difference. I am saying that I did not notice any differences jumping out after I had crudely volume matched, and that I have not seen any serious evidence that anyone can tell the difference blindly. I am not even saying that conclusive evidence from a meticulously-designed double-blind experiment does not exist, just that &lt;em&gt;I&lt;/em&gt; have not seen it. If anyone has, let me know. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeir05", "score_hidden": false, "stickied": false, "created": 1492509936.0, "created_utc": 1492481136.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgerjds", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "florinandrei", "parent_id": "t1_dgeip14", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "As someone who was designing everything from automation to audio (low and high power) to radiofrequency to logic gates to systems with microprocessors, back in college, and almost went on to have a career in the electronics industry (but the Internet gold rush intervened) - all I can say is: if in 2017 a DAC still sucks (i.e. it's not perfect, because any audio domain DAC these days that has any flaw whatsoever is trash can material) after spending $300, then this world has gone to hell already.\n\nI'm not saying you didn't hear what you did hear. I'm just saying this is not 1987 anymore, when I was learning about digital to analog conversion. An audio DAC has no reason nowadays to not be perfect in every way.\n\nMaybe the $300 thing was a bad sample. Maybe who knows what else happened. Maybe the $1.6k DAC had a clever little filter in it to make it sound \"nicer\".\n\nI would accept any moment, without hesitation, that something dishonest is going on (likely by the manufacturers).\n\nBut if you spend $300 on the DAC only, and those dollars are honestly invested in technology during design and manufacturing, fer crying out loud, that DAC ought to be the most accurate link in your whole audio chain by leaps and bounds. Even if you spend millions you should not be able to beat that in any way that the human ear could perceive (again, assuming no deception and no mistakes).\n\nSomething, somewhere, is very, very wrong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone who was designing everything from automation to audio (low and high power) to radiofrequency to logic gates to systems with microprocessors, back in college, and almost went on to have a career in the electronics industry (but the Internet gold rush intervened) - all I can say is: if in 2017 a DAC still sucks (i.e. it&amp;#39;s not perfect, because any audio domain DAC these days that has any flaw whatsoever is trash can material) after spending $300, then this world has gone to hell already.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying you didn&amp;#39;t hear what you did hear. I&amp;#39;m just saying this is not 1987 anymore, when I was learning about digital to analog conversion. An audio DAC has no reason nowadays to not be perfect in every way.&lt;/p&gt;\n\n&lt;p&gt;Maybe the $300 thing was a bad sample. Maybe who knows what else happened. Maybe the $1.6k DAC had a clever little filter in it to make it sound &amp;quot;nicer&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I would accept any moment, without hesitation, that something dishonest is going on (likely by the manufacturers).&lt;/p&gt;\n\n&lt;p&gt;But if you spend $300 on the DAC only, and those dollars are honestly invested in technology during design and manufacturing, fer crying out loud, that DAC ought to be the most accurate link in your whole audio chain by leaps and bounds. Even if you spend millions you should not be able to beat that in any way that the human ear could perceive (again, assuming no deception and no mistakes).&lt;/p&gt;\n\n&lt;p&gt;Something, somewhere, is very, very wrong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgerjds", "score_hidden": false, "stickied": false, "created": 1492522457.0, "created_utc": 1492493657.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeip14", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgehd88", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "$1600 DACs are apparently made with loving hands. Not just hands, loving ones.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;$1600 DACs are apparently made with loving hands. Not just hands, loving ones.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeip14", "score_hidden": false, "stickied": false, "created": 1492509874.0, "created_utc": 1492481074.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgehd88", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "diggexpat", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I'd like to see the bill of materials on a $1,600 DAC vs a $300 DAC. Something smells.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d like to see the bill of materials on a $1,600 DAC vs a $300 DAC. Something smells.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgehd88", "score_hidden": false, "stickied": false, "created": 1492508293.0, "created_utc": 1492479493.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgenxzv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dallagen", "parent_id": "t1_dgemtsa", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "The Jotunheim SE also is worse than the Balanced, making it appear that balanced sounds better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Jotunheim SE also is worse than the Balanced, making it appear that balanced sounds better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgenxzv", "score_hidden": false, "stickied": false, "created": 1492516632.0, "created_utc": 1492487832.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemtsa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "puffyfluppy", "parent_id": "t1_dgedcc2", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "While I don't think there's any SQ difference in balanced vs SE, to say that the Jot's only worth comes from being gullible enough to subscribe to the balanced meme, is just false. \n\nThe balanced pre-outs certainly serve a purpose with eliminating noise in longer cable runs and ground loops. And, the balanced hp out on the Jot delivers more power than the SE, so if you're looking to use that power, you'll need to go balanced. It's a great value amp if you can use its feature set, not _just_ because it has a balanced output.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While I don&amp;#39;t think there&amp;#39;s any SQ difference in balanced vs SE, to say that the Jot&amp;#39;s only worth comes from being gullible enough to subscribe to the balanced meme, is just false. &lt;/p&gt;\n\n&lt;p&gt;The balanced pre-outs certainly serve a purpose with eliminating noise in longer cable runs and ground loops. And, the balanced hp out on the Jot delivers more power than the SE, so if you&amp;#39;re looking to use that power, you&amp;#39;ll need to go balanced. It&amp;#39;s a great value amp if you can use its feature set, not &lt;em&gt;just&lt;/em&gt; because it has a balanced output.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgemtsa", "score_hidden": false, "stickied": false, "created": 1492515026.0, "created_utc": 1492486226.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgeis6d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dallagen", "parent_id": "t1_dgehaio", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Balanced out on an amp has more power just due to how it works, but otherwise it's useless unless you're doing really long cable runs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Balanced out on an amp has more power just due to how it works, but otherwise it&amp;#39;s useless unless you&amp;#39;re doing really long cable runs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeis6d", "score_hidden": false, "stickied": false, "created": 1492509975.0, "created_utc": 1492481175.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgehaio", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tre101", "parent_id": "t1_dgegwxg", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Yeah, I have a relatively basic system atm, but I would have thought at the very least the balanced out from the amp would give more power. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I have a relatively basic system atm, but I would have thought at the very least the balanced out from the amp would give more power. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgehaio", "score_hidden": false, "stickied": false, "created": 1492508204.0, "created_utc": 1492479404.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgend83", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mshenay", "parent_id": "t1_dgejmvq", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I'm not in the mood to start getting into the balanced debate but generally speaking, a  balanced amp/dac uses phase cancellation to eliminate noise, which is good. \n\nSpilt two signals apart, when you put them back together the noise that's picked up is usually out of phase with the source material and is thus silenced, since it's out of phase. \n\nBut at the end of the day, neither is better than the other. As the overall design and the quality of build materials make the bigger difference, that said I found that a balanced Audio GD dac/amp was a better buy for my HE 4, as I need GOBS of power and SE amps around $350 dollars weren't cutting it, so I got my Audio GD NFB10ES2, balanced Dac/Amp that'll push like 5.9w into 50Ohms, which is nice for my HE 4, as it's efficiency is 86 dB SPL at 40 Ohms\n\nstill balanced worked best for MY needs [and I proceeded to balance EVERYTHING I own, even my portable amp is balanced]\n\nTHAT said the FIRST SE amp that tried that impressed me, was a Garage 1217 Hybrid Tube, so that is to say that again, neither one is better. Just different needs for different folks, ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not in the mood to start getting into the balanced debate but generally speaking, a  balanced amp/dac uses phase cancellation to eliminate noise, which is good. &lt;/p&gt;\n\n&lt;p&gt;Spilt two signals apart, when you put them back together the noise that&amp;#39;s picked up is usually out of phase with the source material and is thus silenced, since it&amp;#39;s out of phase. &lt;/p&gt;\n\n&lt;p&gt;But at the end of the day, neither is better than the other. As the overall design and the quality of build materials make the bigger difference, that said I found that a balanced Audio GD dac/amp was a better buy for my HE 4, as I need GOBS of power and SE amps around $350 dollars weren&amp;#39;t cutting it, so I got my Audio GD NFB10ES2, balanced Dac/Amp that&amp;#39;ll push like 5.9w into 50Ohms, which is nice for my HE 4, as it&amp;#39;s efficiency is 86 dB SPL at 40 Ohms&lt;/p&gt;\n\n&lt;p&gt;still balanced worked best for MY needs [and I proceeded to balance EVERYTHING I own, even my portable amp is balanced]&lt;/p&gt;\n\n&lt;p&gt;THAT said the FIRST SE amp that tried that impressed me, was a Garage 1217 Hybrid Tube, so that is to say that again, neither one is better. Just different needs for different folks, &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgend83", "score_hidden": false, "stickied": false, "created": 1492515801.0, "created_utc": 1492487001.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgejmvq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SpacePotatoBear", "parent_id": "t1_dgeisso", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I'm using the balanced cables to my amp. But it doesn't make any difference to the sound quality. \n\nand I have an NFB-1S because I got it for cheap :P ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m using the balanced cables to my amp. But it doesn&amp;#39;t make any difference to the sound quality. &lt;/p&gt;\n\n&lt;p&gt;and I have an NFB-1S because I got it for cheap :P &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgejmvq", "score_hidden": false, "stickied": false, "created": 1492510964.0, "created_utc": 1492482164.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeisso", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ufospls2", "parent_id": "t1_dgegwxg", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Well, it really depends on the amp and the amps design as to whether or not balanced out=good. I would much rather have a good unbalanced amp, than a poor quality balanced implementation. \n\nAlso, wait. Are you not using XLRs out of your NFB-1S to your Liquid Carbon? Whats the point of having a balanced DAC and amp...then using RCA's (which are unbalanced) to connect them?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, it really depends on the amp and the amps design as to whether or not balanced out=good. I would much rather have a good unbalanced amp, than a poor quality balanced implementation. &lt;/p&gt;\n\n&lt;p&gt;Also, wait. Are you not using XLRs out of your NFB-1S to your Liquid Carbon? Whats the point of having a balanced DAC and amp...then using RCA&amp;#39;s (which are unbalanced) to connect them?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeisso", "score_hidden": false, "stickied": false, "created": 1492509994.0, "created_utc": 1492481194.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgegwxg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SpacePotatoBear", "parent_id": "t1_dgeff83", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "yea I got fully balanced shit.\n\nbalanced out on my amp has more power and bring out the bass, balanced out = good.\n\nbalacned cables from dac to amp, zero difference, actually I think it kinda downgraded the sound a bit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yea I got fully balanced shit.&lt;/p&gt;\n\n&lt;p&gt;balanced out on my amp has more power and bring out the bass, balanced out = good.&lt;/p&gt;\n\n&lt;p&gt;balacned cables from dac to amp, zero difference, actually I think it kinda downgraded the sound a bit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgegwxg", "score_hidden": false, "stickied": false, "created": 1492507730.0, "created_utc": 1492478930.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeff83", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "I_want_all_the_tacos", "parent_id": "t1_dgeejwc", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I think he is referring to the huge hype balanced is getting these days as it is starting to really blow up, but there hasn't really been any meaningful measurements to prove the differences, sort of like upgraded cables.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think he is referring to the huge hype balanced is getting these days as it is starting to really blow up, but there hasn&amp;#39;t really been any meaningful measurements to prove the differences, sort of like upgraded cables.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeff83", "score_hidden": false, "stickied": false, "created": 1492505864.0, "created_utc": 1492477064.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeejwc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tre101", "parent_id": "t1_dgedcc2", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Balanced meme? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Balanced meme? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeejwc", "score_hidden": false, "stickied": false, "created": 1492504792.0, "created_utc": 1492475992.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgedcc2", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Dallagen", "parent_id": "t1_dged6w0", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "You don't want a Jot unless you are falling for the balanced meme.\n\nUnder $700ish you won't see much of a difference between dacs outside of some edge cases, but some variations in amps will happen.\n\nNFB-11 is amazing for $300, Jotunheim w/ dac really isn't.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t want a Jot unless you are falling for the balanced meme.&lt;/p&gt;\n\n&lt;p&gt;Under $700ish you won&amp;#39;t see much of a difference between dacs outside of some edge cases, but some variations in amps will happen.&lt;/p&gt;\n\n&lt;p&gt;NFB-11 is amazing for $300, Jotunheim w/ dac really isn&amp;#39;t.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgedcc2", "score_hidden": false, "stickied": false, "created": 1492503276.0, "created_utc": 1492474476.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgee6qq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "I_want_all_the_tacos", "parent_id": "t1_dgedyda", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Great, thanks for the helpful reply. And that is actually a bit surprising that going from Fulla 2 to NFB11 isn't as big of a difference as just switching the DAC on your Jot. Haha I really want to hear this DAC!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great, thanks for the helpful reply. And that is actually a bit surprising that going from Fulla 2 to NFB11 isn&amp;#39;t as big of a difference as just switching the DAC on your Jot. Haha I really want to hear this DAC!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgee6qq", "score_hidden": false, "stickied": false, "created": 1492504337.0, "created_utc": 1492475537.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgedyda", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dged6w0", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "These are good questions. Since my experience I've been meaning to do a more systematic comparison with my NFB-11 and my Jotunheim. Up till now I've been mainly using my LCDs on my Jot and my HD650s on my NFB, so hard to compare. But last night I brought my LCDs up to my home office to listen on the NFB. I'll definitely test it some more later this evening and edit this comment. \n\nAs for the Fulla 2, I use it in my work office with my SHP9500 but I tested in a bit with my other cans before bringing it in. It's a damn impressive little piece of gear for its size and price, as long as you aren't bothered by it not having any lights on it or whatever. I don't recall the difference being \"night and day\" at all. Obviously the amp isn't as powerful as on the NFB or the Jot so my HD650s were maybe a tad thinner and tinnier, but it wasn't anything like the experience I had swapping the DAC on the Jot with the LCD-2s. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;These are good questions. Since my experience I&amp;#39;ve been meaning to do a more systematic comparison with my NFB-11 and my Jotunheim. Up till now I&amp;#39;ve been mainly using my LCDs on my Jot and my HD650s on my NFB, so hard to compare. But last night I brought my LCDs up to my home office to listen on the NFB. I&amp;#39;ll definitely test it some more later this evening and edit this comment. &lt;/p&gt;\n\n&lt;p&gt;As for the Fulla 2, I use it in my work office with my SHP9500 but I tested in a bit with my other cans before bringing it in. It&amp;#39;s a damn impressive little piece of gear for its size and price, as long as you aren&amp;#39;t bothered by it not having any lights on it or whatever. I don&amp;#39;t recall the difference being &amp;quot;night and day&amp;quot; at all. Obviously the amp isn&amp;#39;t as powerful as on the NFB or the Jot so my HD650s were maybe a tad thinner and tinnier, but it wasn&amp;#39;t anything like the experience I had swapping the DAC on the Jot with the LCD-2s. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgedyda", "score_hidden": false, "stickied": false, "created": 1492504050.0, "created_utc": 1492475250.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgen0rb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "puffyfluppy", "parent_id": "t1_dged6w0", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "If it's all you can afford, the fulla 2 will power the 650s. However, it leaves a little to be desired when compared to higher-end amps and it starts to distort once you get to 1-2 o'clock (which can be pretty loud, depending on the music you're listening to).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it&amp;#39;s all you can afford, the fulla 2 will power the 650s. However, it leaves a little to be desired when compared to higher-end amps and it starts to distort once you get to 1-2 o&amp;#39;clock (which can be pretty loud, depending on the music you&amp;#39;re listening to).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgen0rb", "score_hidden": false, "stickied": false, "created": 1492515294.0, "created_utc": 1492486494.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dged6w0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "I_want_all_the_tacos", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "A little off topic, but speaking of DACs (and also amps), could you comment on the differences between your Jot, NFB11, and Fulla 2, particularly paired with HD650? I currently have my HD650's paired with an Xduoo xd-05, which I presume is similar quality as the Fulla 2. Is there a \"night and day\" difference going up to NFB11? I hear the DAC on NFB11 is a significant upgrade, but obviously how that translates into true sound improvement is tough to tell. Would you say it is 3 times better than your Fulla 2 since it is 3 times the price? Also curious as to how the Jot stacks up to NFB11. The few comparisons I have seen seem to favor the NFB11 in both DAC and amp performance, but the Jot is obviously the favorable choice if going for balanced. Thoughts?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A little off topic, but speaking of DACs (and also amps), could you comment on the differences between your Jot, NFB11, and Fulla 2, particularly paired with HD650? I currently have my HD650&amp;#39;s paired with an Xduoo xd-05, which I presume is similar quality as the Fulla 2. Is there a &amp;quot;night and day&amp;quot; difference going up to NFB11? I hear the DAC on NFB11 is a significant upgrade, but obviously how that translates into true sound improvement is tough to tell. Would you say it is 3 times better than your Fulla 2 since it is 3 times the price? Also curious as to how the Jot stacks up to NFB11. The few comparisons I have seen seem to favor the NFB11 in both DAC and amp performance, but the Jot is obviously the favorable choice if going for balanced. Thoughts?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dged6w0", "score_hidden": false, "stickied": false, "created": 1492503082.0, "created_utc": 1492474282.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgeky1s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgekp14", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Very well stated. I feel like I've been taking crazy pills over this DAC thing because I can't explain it. As for the Focals, yeah they were amazing. I'd just have to be in a very different life situation before I bought them. I'm glad they're there for people who want the absolute best of the best.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very well stated. I feel like I&amp;#39;ve been taking crazy pills over this DAC thing because I can&amp;#39;t explain it. As for the Focals, yeah they were amazing. I&amp;#39;d just have to be in a very different life situation before I bought them. I&amp;#39;m glad they&amp;#39;re there for people who want the absolute best of the best.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeky1s", "score_hidden": false, "stickied": false, "created": 1492512561.0, "created_utc": 1492483761.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgekp14", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "drbobbybones", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Very nice review.  I am one of those people that think the DAC matters quite a bit.  I am glad you let your own ears be the judge instead of relying on your own or someone else's preconceived biases.  The first time I heard the Chord DAVE with my own HD800, I was blown away about how much better it sounded than my Oppo HA-1.  Sometimes we can perceive things that we do not yet know how to measure.  \n\nYour point here about value is a good one.  Headphones, like any hobby, are all about the law of diminishing returns.  The slope of cost to improvement is nonlinear.  It is much closer to exponential than anything.  The Utopia is an amazing headphone, and IMO the best headphone in the world (minus non production models like the Orpheus).  But it costs 3-4x as much to get that marginal improvement from a HD800 or the like.  For some, that amount is worth it.  For others it is not.   That definition of of value is different for everyone--and that is something that we all have to decide for ourselves. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very nice review.  I am one of those people that think the DAC matters quite a bit.  I am glad you let your own ears be the judge instead of relying on your own or someone else&amp;#39;s preconceived biases.  The first time I heard the Chord DAVE with my own HD800, I was blown away about how much better it sounded than my Oppo HA-1.  Sometimes we can perceive things that we do not yet know how to measure.  &lt;/p&gt;\n\n&lt;p&gt;Your point here about value is a good one.  Headphones, like any hobby, are all about the law of diminishing returns.  The slope of cost to improvement is nonlinear.  It is much closer to exponential than anything.  The Utopia is an amazing headphone, and IMO the best headphone in the world (minus non production models like the Orpheus).  But it costs 3-4x as much to get that marginal improvement from a HD800 or the like.  For some, that amount is worth it.  For others it is not.   That definition of of value is different for everyone--and that is something that we all have to decide for ourselves. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgekp14", "score_hidden": false, "stickied": false, "created": 1492512255.0, "created_utc": 1492483455.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgeo53a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgenkhi", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Cool, thanks for the review.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cool, thanks for the review.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeo53a", "score_hidden": false, "stickied": false, "created": 1492516929.0, "created_utc": 1492488129.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgenkhi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "noneEggs", "parent_id": "t1_dgemp10", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "It makes everything sounds so T H I C C and full, with very fun 3D imaging, they juice the mid range like never before for me. \n\nBut too bad since everything is thick the mid bass is thick too and sometimes it bleeds on my HD650, also the high range are too gentle even though they're still there, this is also very different from Modi 2U. But overall it's worth it, I love it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It makes everything sounds so T H I C C and full, with very fun 3D imaging, they juice the mid range like never before for me. &lt;/p&gt;\n\n&lt;p&gt;But too bad since everything is thick the mid bass is thick too and sometimes it bleeds on my HD650, also the high range are too gentle even though they&amp;#39;re still there, this is also very different from Modi 2U. But overall it&amp;#39;s worth it, I love it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgenkhi", "score_hidden": false, "stickied": false, "created": 1492516088.0, "created_utc": 1492487288.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemp10", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgemmp0", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "How do you like your Mimby? Worth it?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How do you like your Mimby? Worth it?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgemp10", "score_hidden": false, "stickied": false, "created": 1492514846.0, "created_utc": 1492486046.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemmp0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "noneEggs", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "*grabs popcorn\n\nI'm also a guy who went from Modi 2 to Mimby, the difference is not night and day, but it's really is something like 12:00 and 16:00. The different mostly comes from sound imaging quality between the two and the thickness of sounds. I never dare to say such thing on this sub knowing objective people will stoned me to death, but i'm with you on this one, i can die now, hit me as hard as any of you want to.", "edited": 1492487021.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;*grabs popcorn&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also a guy who went from Modi 2 to Mimby, the difference is not night and day, but it&amp;#39;s really is something like 12:00 and 16:00. The different mostly comes from sound imaging quality between the two and the thickness of sounds. I never dare to say such thing on this sub knowing objective people will stoned me to death, but i&amp;#39;m with you on this one, i can die now, hit me as hard as any of you want to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgemmp0", "score_hidden": false, "stickied": false, "created": 1492514754.0, "created_utc": 1492485954.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgepghc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nightcinder", "parent_id": "t1_dgepahm", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "You could try a Wyrd, or try to find a used Singxer F1.  I'm going to actually get to test a Singxer F1 vs Bifrost USB at my meet on april 29, got a buddy with an F1.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could try a Wyrd, or try to find a used Singxer F1.  I&amp;#39;m going to actually get to test a Singxer F1 vs Bifrost USB at my meet on april 29, got a buddy with an F1.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgepghc", "score_hidden": false, "stickied": false, "created": 1492518913.0, "created_utc": 1492490113.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgepq6z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zoom25", "parent_id": "t1_dgepahm", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Look into the AQ Jitterbug.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Look into the AQ Jitterbug.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgepq6z", "score_hidden": false, "stickied": false, "created": 1492519345.0, "created_utc": 1492490545.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgeq3dd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "scenque", "parent_id": "t1_dgepahm", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "In general, I find a decrapifier to be a very handy device to have around. Usually, cleaning up USB power and/or ground noise tends to reduce a DAC's noise floor (\"blacker\" background) and improve dynamics. Sometimes it can remove harshness or sibilance. In the case of the Jot DAC, however, it cleaned up the sound, but also made the DAC sound really bright. At first, I couldn't figure out why people called the Jotunheim bright, because it seemed like a fairly neutral amp to me. Now I wonder if those people just had cleaner USB ports than me...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In general, I find a decrapifier to be a very handy device to have around. Usually, cleaning up USB power and/or ground noise tends to reduce a DAC&amp;#39;s noise floor (&amp;quot;blacker&amp;quot; background) and improve dynamics. Sometimes it can remove harshness or sibilance. In the case of the Jot DAC, however, it cleaned up the sound, but also made the DAC sound really bright. At first, I couldn&amp;#39;t figure out why people called the Jotunheim bright, because it seemed like a fairly neutral amp to me. Now I wonder if those people just had cleaner USB ports than me...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeq3dd", "score_hidden": false, "stickied": false, "created": 1492519944.0, "created_utc": 1492491144.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgepahm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgeo3l2", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Yeah, I know my description of the Elear sucks. It's so hard to describe. Foamy? It just wasn't right to me. To me the bottom sounded sort of like when you turn up speakers beyond its ability, though it wasn't that loud and the mid and high end still sound great. Overall it was great, but just... wrong (to me) ymmv.\n\nRe: USB, do you think one of those decrapifier things would help? I run off of my laptop and don't have an optical or coax.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I know my description of the Elear sucks. It&amp;#39;s so hard to describe. Foamy? It just wasn&amp;#39;t right to me. To me the bottom sounded sort of like when you turn up speakers beyond its ability, though it wasn&amp;#39;t that loud and the mid and high end still sound great. Overall it was great, but just... wrong (to me) ymmv.&lt;/p&gt;\n\n&lt;p&gt;Re: USB, do you think one of those decrapifier things would help? I run off of my laptop and don&amp;#39;t have an optical or coax.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgepahm", "score_hidden": false, "stickied": false, "created": 1492518659.0, "created_utc": 1492489859.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgeppic", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zoom25", "parent_id": "t1_dgeo3l2", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Agreed on USB. I prefer AES whenever it's available. I did have luck with the Audioquest Jitterbug.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed on USB. I prefer AES whenever it&amp;#39;s available. I did have luck with the Audioquest Jitterbug.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeppic", "score_hidden": false, "stickied": false, "created": 1492519314.0, "created_utc": 1492490514.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeo3l2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Nightcinder", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Everything I've heard says the Jot DAC sucks.\n\nAlso, your Elear comments are very strange to me as there's no measurable bass distortion going on.  Could be your source.\n\nAvoid using USB for your DAC and that'll help a lot, most USB implementations are pretty poor and Schiit's no exception, switching to coax will improve the sound.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everything I&amp;#39;ve heard says the Jot DAC sucks.&lt;/p&gt;\n\n&lt;p&gt;Also, your Elear comments are very strange to me as there&amp;#39;s no measurable bass distortion going on.  Could be your source.&lt;/p&gt;\n\n&lt;p&gt;Avoid using USB for your DAC and that&amp;#39;ll help a lot, most USB implementations are pretty poor and Schiit&amp;#39;s no exception, switching to coax will improve the sound.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeo3l2", "score_hidden": false, "stickied": false, "created": 1492516867.0, "created_utc": 1492488067.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgetwzb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sorwis", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "A broken DAC or cognitive bias? Maybe both? Such a mystery.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A broken DAC or cognitive bias? Maybe both? Such a mystery.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgetwzb", "score_hidden": false, "stickied": false, "created": 1492528026.0, "created_utc": 1492499226.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgegyj3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SpacePotatoBear", "parent_id": "t1_dgefr7a", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "yea, I really don't like the Odac, sounds tiny compared to a Modi, and doesn't stack up at all to my NFB-1s at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yea, I really don&amp;#39;t like the Odac, sounds tiny compared to a Modi, and doesn&amp;#39;t stack up at all to my NFB-1s at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgegyj3", "score_hidden": false, "stickied": false, "created": 1492507787.0, "created_utc": 1492478987.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgefr7a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "toss_overboard", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I'll get mocked here most likely but you can almost always make your system better by improving your source. \nI've heard an odac...it did not come close to the dac I own...it is in one word:boring.\nThe other thing is system matching...it is vitally important. I bet you doughnuts that someone out there has found the right combo for the 800's.\nPick a phone and build around it.\nPS: the chord mojo is amazing for the price ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll get mocked here most likely but you can almost always make your system better by improving your source. \nI&amp;#39;ve heard an odac...it did not come close to the dac I own...it is in one word:boring.\nThe other thing is system matching...it is vitally important. I bet you doughnuts that someone out there has found the right combo for the 800&amp;#39;s.\nPick a phone and build around it.\nPS: the chord mojo is amazing for the price &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgefr7a", "score_hidden": false, "stickied": false, "created": 1492506274.0, "created_utc": 1492477474.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgeu4uh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CarlosUnchained", "parent_id": "t1_dgeqtm7", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I have the LCD-X and I'm looking for a match. How is the nfb-11 with them? What else have you tried?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have the LCD-X and I&amp;#39;m looking for a match. How is the nfb-11 with them? What else have you tried?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeu4uh", "score_hidden": false, "stickied": false, "created": 1492528627.0, "created_utc": 1492499827.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeqtm7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Clintosity", "parent_id": "t1_dgep41c", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Not sure what to get though thinking the nfb-28 since the nfb-11 has been pretty good.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not sure what to get though thinking the nfb-28 since the nfb-11 has been pretty good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeqtm7", "score_hidden": false, "stickied": false, "created": 1492521186.0, "created_utc": 1492492386.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgep41c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgeouk4", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I loved the LCD-Xs, man. I'm now comparing my LCD-2s across my Jot and NFB-11. I think it sounds better on the NFB-11 but still trying to setup a passable AB sitch. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I loved the LCD-Xs, man. I&amp;#39;m now comparing my LCD-2s across my Jot and NFB-11. I think it sounds better on the NFB-11 but still trying to setup a passable AB sitch. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgep41c", "score_hidden": false, "stickied": false, "created": 1492518379.0, "created_utc": 1492489579.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeouk4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Clintosity", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Hmm i've got a pair of lcd-x's running from an NFB-11. Wondering if a better dac will help it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmm i&amp;#39;ve got a pair of lcd-x&amp;#39;s running from an NFB-11. Wondering if a better dac will help it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeouk4", "score_hidden": false, "stickied": false, "created": 1492517973.0, "created_utc": 1492489173.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgeva9q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CarlosUnchained", "parent_id": "t1_dgev83d", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Please do!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please do!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeva9q", "score_hidden": false, "stickied": false, "created": 1492532090.0, "created_utc": 1492503290.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgev83d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgeu8nv", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I spent the night devising a way to compare the Jot and NFB-11. Hopefully I can post my results tomorrow.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I spent the night devising a way to compare the Jot and NFB-11. Hopefully I can post my results tomorrow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgev83d", "score_hidden": false, "stickied": false, "created": 1492531896.0, "created_utc": 1492503096.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeu8nv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CarlosUnchained", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Nice review!\n\nI auditioned the LCD series and the Xs made it for me as well. Now I'm looking for a nice match. I'm considering Lyr 2, Jot, Ember II, nfb-11 and the new iDSD Black Label.\n\nOnly tried Jot and Lyr2, for me the Lyr2 is better fitting. I hope I can find the other ones to test!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice review!&lt;/p&gt;\n\n&lt;p&gt;I auditioned the LCD series and the Xs made it for me as well. Now I&amp;#39;m looking for a nice match. I&amp;#39;m considering Lyr 2, Jot, Ember II, nfb-11 and the new iDSD Black Label.&lt;/p&gt;\n\n&lt;p&gt;Only tried Jot and Lyr2, for me the Lyr2 is better fitting. I hope I can find the other ones to test!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeu8nv", "score_hidden": false, "stickied": false, "created": 1492528915.0, "created_utc": 1492500115.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgevtg5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Comma20", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "See if you can get your hands on a Meier Audio Corda DACCORD, would definitely like to know how it performs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;See if you can get your hands on a Meier Audio Corda DACCORD, would definitely like to know how it performs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgevtg5", "score_hidden": false, "stickied": false, "created": 1492533786.0, "created_utc": 1492504986.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgenp7y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "zoom25", "parent_id": "t1_dgen271", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Regarding D/S vs R2R, I don't really care about the tech but just final results. It's not worth sweating about.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Regarding D/S vs R2R, I don&amp;#39;t really care about the tech but just final results. It&amp;#39;s not worth sweating about.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgenp7y", "score_hidden": false, "stickied": false, "created": 1492516276.0, "created_utc": 1492487476.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgen8g4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zoom25", "parent_id": "t1_dgen271", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I don't have experience with Schiit. I do have experience with stuff like Bryston BDA-2, Naim DAC, NAD M51...search for Dangerous Music Source. I have a Dangerous Source that I power with a Teradak 12V13A linear power supply and it holds up very nicely against these products in the 2k+ range. You'll love the features on it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have experience with Schiit. I do have experience with stuff like Bryston BDA-2, Naim DAC, NAD M51...search for Dangerous Music Source. I have a Dangerous Source that I power with a Teradak 12V13A linear power supply and it holds up very nicely against these products in the 2k+ range. You&amp;#39;ll love the features on it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgen8g4", "score_hidden": false, "stickied": false, "created": 1492515604.0, "created_utc": 1492486804.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgen271", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgemsnj", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Interesting. Those DACs are definitely out of my price range for now. What do you think of the Gungnir and D/S versus R2R?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting. Those DACs are definitely out of my price range for now. What do you think of the Gungnir and D/S versus R2R?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgen271", "score_hidden": false, "stickied": false, "created": 1492515352.0, "created_utc": 1492486552.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemsnj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zoom25", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Yup DACs make a difference. Good on you for first hand trying it. Don't skimp out on pro DACs like the Dangerous Convert-2 or Crane Song Solaris. Top notch stuff. Also, the music itself along with the transport feeding the DAC makes a difference as well. YMMV.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yup DACs make a difference. Good on you for first hand trying it. Don&amp;#39;t skimp out on pro DACs like the Dangerous Convert-2 or Crane Song Solaris. Top notch stuff. Also, the music itself along with the transport feeding the DAC makes a difference as well. YMMV.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgemsnj", "score_hidden": false, "stickied": false, "created": 1492514982.0, "created_utc": 1492486182.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgelxsy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LordDango", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "There were only a few DACs that I could hear and tell a difference. I think it really depends on the DAC", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There were only a few DACs that I could hear and tell a difference. I think it really depends on the DAC&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgelxsy", "score_hidden": false, "stickied": false, "created": 1492513845.0, "created_utc": 1492485045.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgep229", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgeoykg", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I'm doing some comparisons right now between the two, but I'm pretty sure you made the right decision. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m doing some comparisons right now between the two, but I&amp;#39;m pretty sure you made the right decision. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgep229", "score_hidden": false, "stickied": false, "created": 1492518293.0, "created_utc": 1492489493.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeoykg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MiniMoose12", "parent_id": "t1_dgeiuie", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Thanks, I am on the order waiting list on the nfb11 at the moment. Was debating those two, ended up going with the NFB11 because of all the praise it's been given. I've heard that the dac in the jot is very disappointing which is why I decided to skip the Balanced Meme. Hopefully I made the right decision :p", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, I am on the order waiting list on the nfb11 at the moment. Was debating those two, ended up going with the NFB11 because of all the praise it&amp;#39;s been given. I&amp;#39;ve heard that the dac in the jot is very disappointing which is why I decided to skip the Balanced Meme. Hopefully I made the right decision :p&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeoykg", "score_hidden": false, "stickied": false, "created": 1492518142.0, "created_utc": 1492489342.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeiuie", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgeg1gv", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Okay, I'll see if I can compare the two properly and report back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, I&amp;#39;ll see if I can compare the two properly and report back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeiuie", "score_hidden": false, "stickied": false, "created": 1492510050.0, "created_utc": 1492481250.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeg1gv", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "MiniMoose12", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "&gt;Has 2 of the most recommended pieces of source gear,\n\n&gt;talks about how source gear matters the most, \n\n&gt;gives opinion on overpriced headphones instead of his 2 pieces of source gear\n\n**You kidding me mate, no one gives a shit about the HE-1k or Utopia. What about that NFBeee and Jotunmeme? &gt;.&gt;**\n---\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Has 2 of the most recommended pieces of source gear,&lt;/p&gt;\n\n&lt;p&gt;talks about how source gear matters the most, &lt;/p&gt;\n\n&lt;p&gt;gives opinion on overpriced headphones instead of his 2 pieces of source gear&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;h2&gt;&lt;strong&gt;You kidding me mate, no one gives a shit about the HE-1k or Utopia. What about that NFBeee and Jotunmeme? &amp;gt;.&amp;gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeg1gv", "score_hidden": false, "stickied": false, "created": 1492506627.0, "created_utc": 1492477827.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgeo9tu", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "reddstudent", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "I had the exact same experience when I tried out a bunch of expensive cans and DACs. Came away wanting a Chord MoJo but ended up with Audeze iSine since I am all about portability.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had the exact same experience when I tried out a bunch of expensive cans and DACs. Came away wanting a Chord MoJo but ended up with Audeze iSine since I am all about portability.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeo9tu", "score_hidden": false, "stickied": false, "created": 1492517124.0, "created_utc": 1492488324.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgevbtc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HartUndSteil", "parent_id": "t1_dgeszog", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Haha yeah check out SBAF if you want to read circle jerks about measurements. They don't listen to music, they listen to frequency response and distortion graphs. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha yeah check out SBAF if you want to read circle jerks about measurements. They don&amp;#39;t listen to music, they listen to frequency response and distortion graphs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgevbtc", "score_hidden": false, "stickied": false, "created": 1492532227.0, "created_utc": 1492503427.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeszog", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "deewon", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Hey man. First off, check out superbestaudiofriends.org for a community of people who are not limited to small budgets and can give honest insight and feedback on top end gear.\n\nSecondly, upgrade your transducer first so that you can actually hear the upgrades upstream as you make them. You are not wrong that DACs make a big difference. So do amps. But if your transducer can't tell the difference then you can't either. You're on the right path. Don't let the Reddit naysayers dissuade you. They are so busy trying to legitimize their budget gear that they won't listen when you try to rise above their norm.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man. First off, check out superbestaudiofriends.org for a community of people who are not limited to small budgets and can give honest insight and feedback on top end gear.&lt;/p&gt;\n\n&lt;p&gt;Secondly, upgrade your transducer first so that you can actually hear the upgrades upstream as you make them. You are not wrong that DACs make a big difference. So do amps. But if your transducer can&amp;#39;t tell the difference then you can&amp;#39;t either. You&amp;#39;re on the right path. Don&amp;#39;t let the Reddit naysayers dissuade you. They are so busy trying to legitimize their budget gear that they won&amp;#39;t listen when you try to rise above their norm.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeszog", "score_hidden": false, "stickied": false, "created": 1492525629.0, "created_utc": 1492496829.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgep6qb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgeoerv", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "&gt; Chord Mojo\n\nThanks, man. I'll check it out. Loved those LCD-Xs. You got good taste.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Chord Mojo&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Thanks, man. I&amp;#39;ll check it out. Loved those LCD-Xs. You got good taste.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgep6qb", "score_hidden": false, "stickied": false, "created": 1492518496.0, "created_utc": 1492489696.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeoerv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "reddstudent", "parent_id": "t1_dgekuot", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Check out the Chord Mojo. It punches WAY above it's price. I had a similar experience to you and similarly fell in love with the MoJo + LCD-X. Ended up with the new iSine20 and loving it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Check out the Chord Mojo. It punches WAY above it&amp;#39;s price. I had a similar experience to you and similarly fell in love with the MoJo + LCD-X. Ended up with the new iSine20 and loving it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeoerv", "score_hidden": false, "stickied": false, "created": 1492517332.0, "created_utc": 1492488532.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgepuhg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ufospls2", "parent_id": "t1_dgekuot", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Cool. Well I hope you find your own Audio Nirvana :) We are all different.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cool. Well I hope you find your own Audio Nirvana :) We are all different.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgepuhg", "score_hidden": false, "stickied": false, "created": 1492519530.0, "created_utc": 1492490730.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgekuot", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgek0j8", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "This was my experience listening to all these headphones on the Naim DAC-V1. I suppose its possible that its a piece of shit, but I was definitely impressed with it. Compared to my Jotunheim it was another world. For me, the difference between the $4k headphones and $1600 headphones (all on the Naim) was marginal at best. I don't know if there is as large a difference going from, say, a $400 DAC to a $4,000 DAC but going from the cheap DAC in the Jotunheim to a mid-fi DAC made a huge difference. Overall, my LCD-2s had come alive on the Naim more than I thought they could, though I never tested the Naim DAC separately with the Jotunheim amp. This was my experience. Feel free to have your own.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was my experience listening to all these headphones on the Naim DAC-V1. I suppose its possible that its a piece of shit, but I was definitely impressed with it. Compared to my Jotunheim it was another world. For me, the difference between the $4k headphones and $1600 headphones (all on the Naim) was marginal at best. I don&amp;#39;t know if there is as large a difference going from, say, a $400 DAC to a $4,000 DAC but going from the cheap DAC in the Jotunheim to a mid-fi DAC made a huge difference. Overall, my LCD-2s had come alive on the Naim more than I thought they could, though I never tested the Naim DAC separately with the Jotunheim amp. This was my experience. Feel free to have your own.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgekuot", "score_hidden": false, "stickied": false, "created": 1492512446.0, "created_utc": 1492483646.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rcyx", "removal_reason": null, "link_id": "t3_65z8cf", "likes": null, "replies": "", "user_reports": [], "id": "dgepy64", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ufospls2", "parent_id": "t1_dgeplyb", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "\"OP just told us what he heard and here you are trying to convince him he's wrong? \"\n\nNo I'm not. I'm sharing my opinion. \n\n \"What!?! Is he not allowed to like the sound of the Naim DAC-V1?? \"\n\nOf course he is. I just feel that there are much better options for the money. Many people feel the same way about my amp. Different strokes for different folks.\n\n\"Not allowed to have his own opinion on summit-fi gear?\"\n\nOf course he is. Just as I am allowed to have the opinion that headphones make more of a difference than DACs. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;OP just told us what he heard and here you are trying to convince him he&amp;#39;s wrong? &amp;quot;&lt;/p&gt;\n\n&lt;p&gt;No I&amp;#39;m not. I&amp;#39;m sharing my opinion. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What!?! Is he not allowed to like the sound of the Naim DAC-V1?? &amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Of course he is. I just feel that there are much better options for the money. Many people feel the same way about my amp. Different strokes for different folks.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Not allowed to have his own opinion on summit-fi gear?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Of course he is. Just as I am allowed to have the opinion that headphones make more of a difference than DACs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgepy64", "score_hidden": false, "stickied": false, "created": 1492519691.0, "created_utc": 1492490891.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeplyb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoName320", "parent_id": "t1_dgek0j8", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "OP just told us what he heard and here you are trying to convince him he's wrong? What!?! Is he not allowed to like the sound of the Naim DAC-V1?? Not allowed to have his own opinion on summit-fi gear?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP just told us what he heard and here you are trying to convince him he&amp;#39;s wrong? What!?! Is he not allowed to like the sound of the Naim DAC-V1?? Not allowed to have his own opinion on summit-fi gear?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeplyb", "score_hidden": false, "stickied": false, "created": 1492519154.0, "created_utc": 1492490354.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgek0j8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ufospls2", "parent_id": "t1_dgej57m", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Ok. I always recommend upgrading your headphones first, then your amp, then your DAC. \n\nYou have the LCD-2 and HD650, both of which are good headphones. However, in my opinion, if you are dead set on an upgrade somewhere in your chain, you would be better off upgrading your headphones. You have an OK amp, two of them actually. The NFB-11 has a DAC built in right? If I remember correctly its a Sabre implementation. You have the Jotunheim with DAC module right? Thats two all in one's that will drive most headphones on the market, and sound decent (note:decent, not amazing) whilst doing it. \n\n\" a) Some instruments, especially strings, are not forward enough for me. b) To bring those instruments forward, I have to increase the volume and the bass becomes a bit too overwhelming.\"\n\nYou solve this (most easily) by changing your transducer, not your DAC. I'm not a \"ohhh DACs and Amps don't make a difference\" person, I just know that you can make the biggest changes with the headphones.\n\n\"1) $4k headphones are a waste of money unless you already have everything else you could possibly want and have so much money that you just can’t be bothered with choices.\"\n\nI don't have so much money that I can't be bothered with other choices, I also don't have everything else I could possibly want. I don't even have a desktop DAC right now. I do however know that I hear the biggest difference changing the headphone, not the source gear.\n\n\"2) The difference between $1000 headphones like LCD-2s and Elears and headphones upwards of $1600, or even $4000, isn’t nearly as profound as the difference between the DAC in the Jotunheim and even mid-fi dedicated units.\"\n\nMaybe due to power supply the DAC in the Jotunheim is really limited, I'm not sure. However the Naim DAC-V1 is pretty much a piece of shit, so I'm not really sure what you were hearing. There is a difference between your Jotunheim DAC and a good DAC sure, but there is more of a difference to be had elsewhere. \n\n\"3) Instead of upgrading my LCD-2s to something else, I may upgrade my upstream.\"\n\nThat is up to you. Its a funny order to do it in though. \n\nWhat gear did you listen to the LCD-4 on? The Utopia is easy to drive, but the LCD-4 does better with a good amount of power behind it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok. I always recommend upgrading your headphones first, then your amp, then your DAC. &lt;/p&gt;\n\n&lt;p&gt;You have the LCD-2 and HD650, both of which are good headphones. However, in my opinion, if you are dead set on an upgrade somewhere in your chain, you would be better off upgrading your headphones. You have an OK amp, two of them actually. The NFB-11 has a DAC built in right? If I remember correctly its a Sabre implementation. You have the Jotunheim with DAC module right? Thats two all in one&amp;#39;s that will drive most headphones on the market, and sound decent (note:decent, not amazing) whilst doing it. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot; a) Some instruments, especially strings, are not forward enough for me. b) To bring those instruments forward, I have to increase the volume and the bass becomes a bit too overwhelming.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;You solve this (most easily) by changing your transducer, not your DAC. I&amp;#39;m not a &amp;quot;ohhh DACs and Amps don&amp;#39;t make a difference&amp;quot; person, I just know that you can make the biggest changes with the headphones.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;1) $4k headphones are a waste of money unless you already have everything else you could possibly want and have so much money that you just can’t be bothered with choices.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have so much money that I can&amp;#39;t be bothered with other choices, I also don&amp;#39;t have everything else I could possibly want. I don&amp;#39;t even have a desktop DAC right now. I do however know that I hear the biggest difference changing the headphone, not the source gear.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;2) The difference between $1000 headphones like LCD-2s and Elears and headphones upwards of $1600, or even $4000, isn’t nearly as profound as the difference between the DAC in the Jotunheim and even mid-fi dedicated units.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Maybe due to power supply the DAC in the Jotunheim is really limited, I&amp;#39;m not sure. However the Naim DAC-V1 is pretty much a piece of shit, so I&amp;#39;m not really sure what you were hearing. There is a difference between your Jotunheim DAC and a good DAC sure, but there is more of a difference to be had elsewhere. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;3) Instead of upgrading my LCD-2s to something else, I may upgrade my upstream.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That is up to you. Its a funny order to do it in though. &lt;/p&gt;\n\n&lt;p&gt;What gear did you listen to the LCD-4 on? The Utopia is easy to drive, but the LCD-4 does better with a good amount of power behind it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgek0j8", "score_hidden": false, "stickied": false, "created": 1492511412.0, "created_utc": 1492482612.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgej57m", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Ineffable_yet_f-able", "parent_id": "t1_dgeizw3", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "Very insightful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very insightful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgej57m", "score_hidden": false, "stickied": false, "created": 1492510394.0, "created_utc": 1492481594.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeizw3", "gilded": 0, "archived": false, "score": -7, "report_reasons": null, "author": "ufospls2", "parent_id": "t3_65z8cf", "subreddit_name_prefixed": "r/headphones", "controversiality": 0, "body": "1) $4k headphones are a waste of money unless you already have everything else you could possibly want and have so much money that you just can’t be bothered with choices.\n\nWat.\n\n\n2) The difference between $1000 headphones like LCD-2s and Elears and headphones upwards of $1600, or even $4000, isn’t nearly as profound as the difference between the DAC in the Jotunheim and even mid-fi dedicated units.\n\nhmmm. ok. Actually no. Wat.\n\n3) Instead of upgrading my LCD-2s to something else, I may upgrade my upstream.\n\nWat.\n\nhttp://imgur.com/a/hjVbX", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1) $4k headphones are a waste of money unless you already have everything else you could possibly want and have so much money that you just can’t be bothered with choices.&lt;/p&gt;\n\n&lt;p&gt;Wat.&lt;/p&gt;\n\n&lt;p&gt;2) The difference between $1000 headphones like LCD-2s and Elears and headphones upwards of $1600, or even $4000, isn’t nearly as profound as the difference between the DAC in the Jotunheim and even mid-fi dedicated units.&lt;/p&gt;\n\n&lt;p&gt;hmmm. ok. Actually no. Wat.&lt;/p&gt;\n\n&lt;p&gt;3) Instead of upgrading my LCD-2s to something else, I may upgrade my upstream.&lt;/p&gt;\n\n&lt;p&gt;Wat.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://imgur.com/a/hjVbX\"&gt;http://imgur.com/a/hjVbX&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "headphones", "name": "t1_dgeizw3", "score_hidden": false, "stickied": false, "created": 1492510225.0, "created_utc": 1492481425.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -7}}], "after": null, "before": null}}]