[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "talesfromtechsupport", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Before I begin, I want to thank everyone who has read, upvoted, commented, and otherwise enjoyed these stories. I get to relive some good times and knoock the rust off of my writing skills, and all of the positive response has been inspiring. Gracias, grazie, obrigado, danke, arigato, merci, спасибо, or just plain thank you... pick one and run with it.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Previously&lt;/strong&gt;, we &lt;a href=\"https://redd.it/650mxz\"&gt;spent a week with VBro&lt;/a&gt;, then watched as our fearless team leader went Salty Dog on him and fired him/made him quit.&lt;/p&gt;\n\n&lt;p&gt;We were now a man short, we have two sites that need for our team to split up, and no one is sure what time we are leaving for an 8 hour drive.&lt;/p&gt;\n\n&lt;p&gt;Finally, I just text out to the team:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Me: I&amp;#39;m heading in to check out the vehicles and do preliminary inventory at 2 PM. See everyone later.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Since no one gets back to me, I just pack my stuff, text my goodbyes to my kids, and head to the shop.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Chaos, Confusion, and Finally, A Resolution&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;On my way, I got a text from the new guy...&lt;/p&gt;\n\n&lt;p&gt;Pool Shark (BShark, because &amp;quot;PShark&amp;quot; sounds like something that my daughters would giggle at when they were 4): A laid-back, smart tech with an insatiable need to play pool. Any and all Google searches for dinner include a search for a pool hall for the next few weeks.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;BSharK: What time are you thinking of heading out?&lt;/p&gt;\n\n&lt;p&gt;Me: No idea. I haven&amp;#39;t heard from SDog or BendR all day, and I have no idea who our fifth man is. I&amp;#39;m here already, just come when you can.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Our assigned vehicles are as follows:&lt;/p&gt;\n\n&lt;p&gt;1 giant pickup that some team had to swap for at the rental place when the car they were in started to die on a previous trip to Pittsburgh (a detail I left out of my &lt;a href=\"https://redd.it/5ygct3\"&gt;first trip&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;1 van that smells like someone was sick in it... probably because someone got sick in it, and never cleaned the windshield where they got sick.&lt;/p&gt;\n\n&lt;p&gt;We had all of the stuff we needed to leave. We just needed people.&lt;/p&gt;\n\n&lt;p&gt;BShark rolled in around 3:30 PM. Introductions were made, and we had some laughs about the epic text chain between VBro and SDog.&lt;/p&gt;\n\n&lt;p&gt;Next, I get an email from the guy who coordinates all of our teams, takes our expense reports, etc. CGuy has a new teammate to fill VBro&amp;#39;s slot... and oh happy day...&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;CGuy: We&amp;#39;ve switched VBro with ZepFan for this trip due to conflicts in your team.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;&amp;amp;&amp;amp;&amp;amp;&amp;amp;, yeah!!!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I send out a text to ZepFan, attempting to find out when he&amp;#39;ll meet up with us.&lt;/p&gt;\n\n&lt;p&gt;No response.&lt;/p&gt;\n\n&lt;p&gt;I call his phone, leave a voicemail.&lt;/p&gt;\n\n&lt;p&gt;Still nothing.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Me (shrugging): He&amp;#39;ll get back to us.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;(Now, looking back at all of this, I&amp;#39;m realizing that SDog was conspicuously quiet while all of this coordinating and communicating was occurring. I think this may have been the point where the company realized that I would be a good fit as team lead in the future, should something happen to SDog. I was too busy at the time trying to get out of the parking lot and on the road to Pittsburgh at the time to think it through, but later events would make me wonder.)&lt;/p&gt;\n\n&lt;p&gt;Meanwhile, it&amp;#39;s 4:30 PM, and I have heard nothing from 3 teammates. It&amp;#39;s creeping past 90 F, and our projected arrival is creeping well past midnight, with a 9 AM start the next morning.&lt;/p&gt;\n\n&lt;p&gt;Finally, at 5 PM, I headed into the office to grab the van keys and start out. I ran into CGuy there.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;CGuy: I thought you guys had left.&lt;/p&gt;\n\n&lt;p&gt;Me: I haven&amp;#39;t heard from SDog, BendR or ZepFan. Still waiting on any of them to come in.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Just then, my phone buzzes. It&amp;#39;s BendR, telling us he and SDog are on the way there.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Me: All right, looks like only ZepFan is missing.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;CGuy calls him.&lt;/p&gt;\n\n&lt;p&gt;Summary: CGuy emailed him at 6 AM. ZepFan didn&amp;#39;t get the email, because he was otherwise occupied that morning (I suspect he had romanced his girlfriend to the wee hours, and then slept in). He was expecting to leave at 8 PM with a different group for some other destination, and would not be able to get to the shop to rendezvous with us until then.&lt;/p&gt;\n\n&lt;p&gt;It was decided that ZepFan would take the van, drive as far as he could, get a hotel on the road for a few hours, then meet at the branch at 10 AM.&lt;/p&gt;\n\n&lt;p&gt;So, I relayed that to everyone, and we waited in the truck for SDog and BendR to arrive. In the meantime, we threw everything into the bed and prayed that it wouldn&amp;#39;t rain on the ride out.&lt;/p&gt;\n\n&lt;p&gt;BendR showed up first, and directed us to a parking lot across the street, where SDog had parked his car. I suspect that he didn&amp;#39;t want to risk running into any bosses or CGuy, because I still believe he had no authority to &amp;quot;fire&amp;quot; anyone on the team.&lt;/p&gt;\n\n&lt;p&gt;With four adults piled into the super cab of the big ol&amp;#39; pickup truck, and 360 miles ahead of us, we set forth.&lt;/p&gt;\n\n&lt;p&gt;It was an awkward ride, to say the least.&lt;/p&gt;\n\n&lt;p&gt;We chose the I-90 route across NY to northwest PA, met up with I-79 (I believe), took that south to Pittsburgh, and in that entire ride, no one brought up VBro or the events of the past 24 hours.&lt;/p&gt;\n\n&lt;p&gt;We went through my phone&amp;#39;s music library (since I was the only one who seemed to be able to Bluetooth-pair to the stereo), listened to some random albums, switched drivers near Buffalo, and never really had any conversation of substance. We got in around 3 AM and fell comatose.&lt;/p&gt;\n\n&lt;p&gt;Meanwhile, ZepFan got on the road at 8:30 PM, stopping around 2 AM for a shower and about 2 hours of sleep.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Saturday Morning Post-Odyssey Blues&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;No one was in good shape the next morning. After a quick cup of life-water (otherwise known as &amp;quot;coffee&amp;quot;), we all met up at the branch at 10 AM.&lt;/p&gt;\n\n&lt;p&gt;Parking... well, that was another story.&lt;/p&gt;\n\n&lt;p&gt;First, we had to convince the guard at the entrance to the strip mall that we were working in BankB for several hours. Then, we had to wait for two spots to open up. It was a small lot, and a very tight fit. Consequently, we got a late start.&lt;/p&gt;\n\n&lt;p&gt;This did not sit well with the bridge tech.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Tech: You guys should have planned for this better. Left earlier.&lt;/p&gt;\n\n&lt;p&gt;SDog: Let&amp;#39;s just get this over with. We got in late, and we just want to finish this up.&lt;/p&gt;\n\n&lt;p&gt;Tech: Well, you should have left earlier.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;(...really? Ya think?)&lt;/p&gt;\n\n&lt;p&gt;After some heated discussion that, thankfully, stayed almost civil, we got to work doing what we needed to get the process rolling. BShark paired up with BendR, and the two of them got the pinpads up in a flash.&lt;/p&gt;\n\n&lt;p&gt;ZepFan was half-asleep on his feet. I know it took him a while to get the printers up and ready.&lt;/p&gt;\n\n&lt;p&gt;Meanwhile, I was in the basement with SDog. He was labeling cables for the swap, and I was patching PCs.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;SDog: Do you think I handled that well?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;(Wait.. what&amp;#39;s he asking me?)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Me: What&amp;#39;s that?&lt;/p&gt;\n\n&lt;p&gt;SDog: VBro had to go. He was bad for the team, and we need to split the team for two of our sites. I did the right thing.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I nodded. Diplomacy is not my strong suit, but at that moment, I leveled up to UN Ambassador.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Me: I think it could have been done a bit more delicately, but yeah... he was a ship anchor. He needed to be cast off.&lt;/p&gt;\n\n&lt;p&gt;SDog: Thanks, dude.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think I was too distracted by that exchange to notice anything off. This came back to bite me about 2 hours later.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Zombie Conversion Commencing in 3... 2...&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Closing time came upon us, and we set to with... well... not much energy or enthusiasm. Coffee was beginning to wear off, the lack of breakfast or lunch, or a real dinner (BK at a rest stop != balanced meal)... all of these just sucked the energy out of us.&lt;/p&gt;\n\n&lt;p&gt;When I had powered down PCs for staging, I had noticed one was already off. I didn&amp;#39;t think anything of it, and had brought it out for installation at its home on the teller line. When I hooked it up and tried to power it on, however, it wouldn&amp;#39;t stay on.&lt;/p&gt;\n\n&lt;p&gt;Push button: Power light comes on. Let it go... power goes off.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Me: Чёрт! This one&amp;#39;s &amp;lt;redacted&amp;gt;.&lt;/p&gt;\n\n&lt;p&gt;BSharK: That... what?&lt;/p&gt;\n\n&lt;p&gt;Me: It&amp;#39;s not working. I better go let SDog know.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Down to the basement.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Me: Hey, teller PC 004 (not the real number) isn&amp;#39;t powering on.&lt;/p&gt;\n\n&lt;p&gt;SDog: What?&lt;/p&gt;\n\n&lt;p&gt;Me: I hold the button, and the power comes up, but when I let off on it, it shuts off.&lt;/p&gt;\n\n&lt;p&gt;SDog: I&amp;#39;ll let the bridge know. Could you go back up and find out if the printers are all set up?&lt;/p&gt;\n\n&lt;p&gt;Me: Sure.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Back up the stairs.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Me: Hey, guys, are the new printers set up?&lt;/p&gt;\n\n&lt;p&gt;ZepFan: Yeah, plugged in to the network jacks and everything.&lt;/p&gt;\n\n&lt;p&gt;BendR: I redid the configs on teller and platform.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Everyone looked dead. I think that, coupled with being a natural-born smart-ass, was what prompted me to say the next thing...&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Me: Good. I better hurry down and let SDog know so I don&amp;#39;t get fired. It&amp;#39;s a long drive back home.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There was a brief moment of shocked silence.&lt;/p&gt;\n\n&lt;p&gt;Then we all laughed.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;BendR: Dude, too soon! (laughing more)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Back down to SDog.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Me: Everything&amp;#39;s set.&lt;/p&gt;\n\n&lt;p&gt;SDog: Cool. Bridge wants me to look at the PC.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;When we get back up, everyone was a bit more lively, and there were even some smiles.&lt;/p&gt;\n\n&lt;p&gt;Comic timing. It&amp;#39;s everything.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Wrapping Up&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In the end, we couldn&amp;#39;t get the PC to work at all. We swapped power supplies (they were the 65 W external ones, like you get with a laptop), but that did nothing either. It was decided to roll it back to legacy (take it down, replace it with the old PC, and make sure it worked).&lt;/p&gt;\n\n&lt;p&gt;We packed up, signed off, and headed back to possibly nap (ZepFan slept from 4 PM until early the next afternoon... we let him have a room to himself), and look for a place to eat.&lt;/p&gt;\n\n&lt;p&gt;For the rest of the trip, &amp;quot;Don&amp;#39;t do &lt;em&gt;blank&lt;/em&gt; or SDog might fire you&amp;quot; became the running joke.&lt;/p&gt;\n\n&lt;p&gt;(EDIT: Spelling, edited out some possible NSFW words in two languages and a brand name)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Before I begin, I want to thank everyone who has read, upvoted, commented, and otherwise enjoyed these stories. I get to relive some good times and knoock the rust off of my writing skills, and all of the positive response has been inspiring. Gracias, grazie, obrigado, danke, arigato, merci, спасибо, or just plain thank you... pick one and run with it.\n\n**Previously**, we [spent a week with VBro](https://redd.it/650mxz), then watched as our fearless team leader went Salty Dog on him and fired him/made him quit.\n\nWe were now a man short, we have two sites that need for our team to split up, and no one is sure what time we are leaving for an 8 hour drive.\n\nFinally, I just text out to the team:\n\n&gt;Me: I'm heading in to check out the vehicles and do preliminary inventory at 2 PM. See everyone later.\n\nSince no one gets back to me, I just pack my stuff, text my goodbyes to my kids, and head to the shop.\n\n**Chaos, Confusion, and Finally, A Resolution**\n\nOn my way, I got a text from the new guy...\n\nPool Shark (BShark, because \"PShark\" sounds like something that my daughters would giggle at when they were 4): A laid-back, smart tech with an insatiable need to play pool. Any and all Google searches for dinner include a search for a pool hall for the next few weeks.\n\n&gt;BSharK: What time are you thinking of heading out?\n\n&gt;Me: No idea. I haven't heard from SDog or BendR all day, and I have no idea who our fifth man is. I'm here already, just come when you can.\n\nOur assigned vehicles are as follows:\n\n1 giant pickup that some team had to swap for at the rental place when the car they were in started to die on a previous trip to Pittsburgh (a detail I left out of my [first trip](https://redd.it/5ygct3)).\n\n1 van that smells like someone was sick in it... probably because someone got sick in it, and never cleaned the windshield where they got sick.\n\nWe had all of the stuff we needed to leave. We just needed people.\n\nBShark rolled in around 3:30 PM. Introductions were made, and we had some laughs about the epic text chain between VBro and SDog.\n\nNext, I get an email from the guy who coordinates all of our teams, takes our expense reports, etc. CGuy has a new teammate to fill VBro's slot... and oh happy day...\n\n&gt;CGuy: We've switched VBro with ZepFan for this trip due to conflicts in your team.\n\n**&amp;&amp;&amp;&amp;, yeah!!!**\n\nI send out a text to ZepFan, attempting to find out when he'll meet up with us.\n\nNo response.\n\nI call his phone, leave a voicemail.\n\nStill nothing.\n\n&gt;Me (shrugging): He'll get back to us.\n\n(Now, looking back at all of this, I'm realizing that SDog was conspicuously quiet while all of this coordinating and communicating was occurring. I think this may have been the point where the company realized that I would be a good fit as team lead in the future, should something happen to SDog. I was too busy at the time trying to get out of the parking lot and on the road to Pittsburgh at the time to think it through, but later events would make me wonder.)\n\nMeanwhile, it's 4:30 PM, and I have heard nothing from 3 teammates. It's creeping past 90 F, and our projected arrival is creeping well past midnight, with a 9 AM start the next morning.\n\nFinally, at 5 PM, I headed into the office to grab the van keys and start out. I ran into CGuy there.\n\n&gt;CGuy: I thought you guys had left.\n\n&gt;Me: I haven't heard from SDog, BendR or ZepFan. Still waiting on any of them to come in.\n\nJust then, my phone buzzes. It's BendR, telling us he and SDog are on the way there.\n\n&gt;Me: All right, looks like only ZepFan is missing.\n\nCGuy calls him.\n\nSummary: CGuy emailed him at 6 AM. ZepFan didn't get the email, because he was otherwise occupied that morning (I suspect he had romanced his girlfriend to the wee hours, and then slept in). He was expecting to leave at 8 PM with a different group for some other destination, and would not be able to get to the shop to rendezvous with us until then.\n\nIt was decided that ZepFan would take the van, drive as far as he could, get a hotel on the road for a few hours, then meet at the branch at 10 AM.\n\nSo, I relayed that to everyone, and we waited in the truck for SDog and BendR to arrive. In the meantime, we threw everything into the bed and prayed that it wouldn't rain on the ride out.\n\nBendR showed up first, and directed us to a parking lot across the street, where SDog had parked his car. I suspect that he didn't want to risk running into any bosses or CGuy, because I still believe he had no authority to \"fire\" anyone on the team.\n\nWith four adults piled into the super cab of the big ol' pickup truck, and 360 miles ahead of us, we set forth.\n\nIt was an awkward ride, to say the least.\n\nWe chose the I-90 route across NY to northwest PA, met up with I-79 (I believe), took that south to Pittsburgh, and in that entire ride, no one brought up VBro or the events of the past 24 hours.\n\nWe went through my phone's music library (since I was the only one who seemed to be able to Bluetooth-pair to the stereo), listened to some random albums, switched drivers near Buffalo, and never really had any conversation of substance. We got in around 3 AM and fell comatose.\n\nMeanwhile, ZepFan got on the road at 8:30 PM, stopping around 2 AM for a shower and about 2 hours of sleep.\n\n**Saturday Morning Post-Odyssey Blues**\n\nNo one was in good shape the next morning. After a quick cup of life-water (otherwise known as \"coffee\"), we all met up at the branch at 10 AM.\n\nParking... well, that was another story.\n\nFirst, we had to convince the guard at the entrance to the strip mall that we were working in BankB for several hours. Then, we had to wait for two spots to open up. It was a small lot, and a very tight fit. Consequently, we got a late start.\n\nThis did not sit well with the bridge tech.\n\n&gt;Tech: You guys should have planned for this better. Left earlier.\n\n&gt;SDog: Let's just get this over with. We got in late, and we just want to finish this up.\n\n&gt;Tech: Well, you should have left earlier.\n\n(...really? Ya think?)\n\nAfter some heated discussion that, thankfully, stayed almost civil, we got to work doing what we needed to get the process rolling. BShark paired up with BendR, and the two of them got the pinpads up in a flash.\n\nZepFan was half-asleep on his feet. I know it took him a while to get the printers up and ready.\n\nMeanwhile, I was in the basement with SDog. He was labeling cables for the swap, and I was patching PCs.\n\n&gt;SDog: Do you think I handled that well?\n\n(Wait.. what's he asking me?)\n\n&gt;Me: What's that?\n\n&gt;SDog: VBro had to go. He was bad for the team, and we need to split the team for two of our sites. I did the right thing.\n\nI nodded. Diplomacy is not my strong suit, but at that moment, I leveled up to UN Ambassador.\n\n&gt;Me: I think it could have been done a bit more delicately, but yeah... he was a ship anchor. He needed to be cast off.\n\n&gt;SDog: Thanks, dude.\n\nI think I was too distracted by that exchange to notice anything off. This came back to bite me about 2 hours later.\n\n**Zombie Conversion Commencing in 3... 2...**\n\nClosing time came upon us, and we set to with... well... not much energy or enthusiasm. Coffee was beginning to wear off, the lack of breakfast or lunch, or a real dinner (BK at a rest stop != balanced meal)... all of these just sucked the energy out of us.\n\nWhen I had powered down PCs for staging, I had noticed one was already off. I didn't think anything of it, and had brought it out for installation at its home on the teller line. When I hooked it up and tried to power it on, however, it wouldn't stay on.\n\nPush button: Power light comes on. Let it go... power goes off.\n\n&gt;Me: Чёрт! This one's &lt;redacted&gt;.\n\n&gt;BSharK: That... what?\n\n&gt;Me: It's not working. I better go let SDog know.\n\nDown to the basement.\n\n&gt;Me: Hey, teller PC 004 (not the real number) isn't powering on.\n\n&gt;SDog: What?\n\n&gt;Me: I hold the button, and the power comes up, but when I let off on it, it shuts off.\n\n&gt;SDog: I'll let the bridge know. Could you go back up and find out if the printers are all set up?\n\n&gt;Me: Sure.\n\nBack up the stairs.\n\n&gt;Me: Hey, guys, are the new printers set up?\n\n&gt;ZepFan: Yeah, plugged in to the network jacks and everything.\n\n&gt;BendR: I redid the configs on teller and platform.\n\nEveryone looked dead. I think that, coupled with being a natural-born smart-ass, was what prompted me to say the next thing...\n\n&gt;Me: Good. I better hurry down and let SDog know so I don't get fired. It's a long drive back home.\n\nThere was a brief moment of shocked silence.\n\nThen we all laughed.\n\n&gt;BendR: Dude, too soon! (laughing more)\n\nBack down to SDog.\n\n&gt;Me: Everything's set.\n\n&gt;SDog: Cool. Bridge wants me to look at the PC.\n\nWhen we get back up, everyone was a bit more lively, and there were even some smiles.\n\nComic timing. It's everything.\n\n**Wrapping Up**\n\nIn the end, we couldn't get the PC to work at all. We swapped power supplies (they were the 65 W external ones, like you get with a laptop), but that did nothing either. It was decided to roll it back to legacy (take it down, replace it with the old PC, and make sure it worked).\n\nWe packed up, signed off, and headed back to possibly nap (ZepFan slept from 4 PM until early the next afternoon... we let him have a room to himself), and look for a place to eat.\n\nFor the rest of the trip, \"Don't do *blank* or SDog might fire you\" became the running joke.\n\n(EDIT: Spelling, edited out some possible NSFW words in two languages and a brand name)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Long", "id": "65noqc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 98, "report_reasons": null, "author": "molotok_c_518", "saved": false, "mod_reports": [], "name": "t3_65noqc", "subreddit_name_prefixed": "r/talesfromtechsupport", "approved_by": null, "over_18": false, "domain": "self.talesfromtechsupport", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sfg5", "edited": 1492381948.0, "link_flair_css_class": "long", "author_flair_css_class": "tftsflair", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/talesfromtechsupport/comments/65noqc/banking_madness_on_to_pittsburgh_again/", "num_reports": null, "locked": false, "stickied": false, "created": 1492349908.0, "url": "https://www.reddit.com/r/talesfromtechsupport/comments/65noqc/banking_madness_on_to_pittsburgh_again/", "author_flair_text": "Please Don't Call Me For Anything Like That Again.", "quarantine": false, "title": "Banking Madness: On To Pittsburgh! Again!", "created_utc": 1492321108.0, "distinguished": null, "media": null, "upvote_ratio": 0.98, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 98}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65noqc", "likes": null, "replies": "", "user_reports": [], "id": "dgdbevo", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "railyeightseven", "parent_id": "t3_65noqc", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "I really enjoy your stories, I read tfts as bedtime stories for myself and am always excited when I see yours", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really enjoy your stories, I read tfts as bedtime stories for myself and am always excited when I see yours&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdbevo", "score_hidden": false, "stickied": false, "created": 1492451012.0, "created_utc": 1492422212.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65noqc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65noqc", "likes": null, "replies": "", "user_reports": [], "id": "dgdhorg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "molotok_c_518", "parent_id": "t1_dgdgb0m", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "We weren't sure what the problem was. Thankfully, the PCs were small, so repacking it and bringing it back to the shop wasn't a problem.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We weren&amp;#39;t sure what the problem was. Thankfully, the PCs were small, so repacking it and bringing it back to the shop wasn&amp;#39;t a problem.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdhorg", "score_hidden": false, "stickied": false, "created": 1492465467.0, "created_utc": 1492436667.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdgb0m", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "TehSavior", "parent_id": "t3_65noqc", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Power button issue perfectly matches an issue I had years ago where something was shorting the reset pins. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Power button issue perfectly matches an issue I had years ago where something was shorting the reset pins. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdgb0m", "score_hidden": false, "stickied": false, "created": 1492463233.0, "created_utc": 1492434433.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65noqc", "likes": null, "replies": "", "user_reports": [], "id": "dgdxj5l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Teknowlogist", "parent_id": "t3_65noqc", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Wow...how did SDog feel about being 'the dude'?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow...how did SDog feel about being &amp;#39;the dude&amp;#39;?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdxj5l", "score_hidden": false, "stickied": false, "created": 1492484181.0, "created_utc": 1492455381.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]