[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "talesfromtechsupport", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This will be the lamest anonymization ever, but the story won&amp;#39;t make sense without the context. I know you guys like your stories funny, and I&amp;#39;ll try, but this was deadly serious at the time. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a few months after a high profile zombie attack orchestrated by an evil bearded gnome. The government has ordered the creation of the new department of zombieland security, and its first job is to train in new zombie screeners at the flying carports, for obvious reasons. As with most big screwups, there&amp;#39;s now a sudden need for a lot of IT support, and I get in on this along with three of my friends. Our job is to setup testing sites near the flying carports and facilitate the on-site processing and hiring of the zombie screeners. Those who pass the test are handed their new anti-zombie uniforms, sworn in, and then head off to work at the flying carport.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been in touch with my friends for the past couple of weeks while things get going, and the televisions are still ablaze with developments on the current whereabouts of the bearded gnome. Our makeshift locations (hotels, gynmasiums, whatever was available) are secret and there are armed guards everywhere. A concern was raised by one of the supervisors at one of the biggest carports where a friend if mine was stationed, La Gnomia in Yu Nork. It&amp;#39;s also the de facto &amp;#39;command center&amp;#39; for the project. They&amp;#39;re concerned that a zombie might try to steal the test answers, and since this entire project was thrown together very suddenly, the security of the computers is, quite literally, the men with the guns standing in the room with the computers, and there is no internet. We sneaker-net the data to an isolated workstation and upload the test results, then wait for a phone call with approval codes (amongst the techs, we called them the &amp;#39;launch&amp;#39; codes because it determined who got hired, ie, launched).  So, I help my friend by writing up some ad-hoc scripting that will detect any new USB devices that connect to the testing stations. This script gets distributed around and nothing more is thought about it. Remember, this is in the days where cybersecurity isn&amp;#39;t a word yet, and awareness of security is still only a dot above &amp;quot;A password at least 6 characters in length.&amp;quot; Like everything else about the project, it was needed 90 seconds ago and didn&amp;#39;t exist as far as anyone knew. &lt;/p&gt;\n\n&lt;p&gt;Until my phone rings two weeks later. It&amp;#39;s my friend.&lt;/p&gt;\n\n&lt;p&gt;$Him: &amp;quot;Hey.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;$Me: &amp;quot;Oh hey, what&amp;#39;s up?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;$Him: &amp;quot;Dude. That script you made. It&amp;#39;s beeping. I told my boss. The guys with shotguns just ran by.&amp;quot; (Lab like &amp;#39;computer lab&amp;#39; -- he was still sorta fresh out of college)&lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s shaking so bad I can hear the vibration in the earpiece.&lt;/p&gt;\n\n&lt;p&gt;$Me: &amp;quot;Ok, stay with me. What do you need me to do?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;$Him: &amp;quot;Hrrr---kay. Well, I don&amp;#39;t know anything about programming and my boss asked me how it [the script] knew, and I don&amp;#39;t know and then it beeped and--&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;$Me: &amp;quot;[name], You didn&amp;#39;t do anything wrong, the other guy did. The guns are for his soon to be very sorry ###, so focus on the job. What do you need?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;$Him: &amp;quot;Well, I nurrr...&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;(there&amp;#39;s some noises and a single woman&amp;#39;s scream in the background)&lt;/p&gt;\n\n&lt;p&gt;$Me: &amp;quot;Hello? Hello?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;(Sounds of law enforcing and a phone getting dropped)&lt;/p&gt;\n\n&lt;p&gt;A few moments pass... I can hear someone picking the phone up.\n(There&amp;#39;s a loud bang)&lt;/p&gt;\n\n&lt;p&gt;$Unknown: &amp;quot;Who is this?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;$Me: &amp;quot;This is ######### at ##########, who are you?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;(A less loud bang. I can hear what sounds like an excited but indistinct conversation)&lt;/p&gt;\n\n&lt;p&gt;$Unknown: &amp;quot;This is special agent Gnome Detector. Are you the one who saw this guy?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;$Me: &amp;quot;No. I&amp;#39;m tech support for the guy who did.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;$GnomeGuy: &amp;quot;His boss said you caught him. How?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;At this exact moment, It took a monumental amount of willpower not to say &amp;quot;I busted him with science.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;$Me: &amp;quot;Well, I wrote a script that continuously monitors certain hive registr--&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;$GnomeGuy: &amp;quot;Listen nerd squad, I have your, uhh, friend, here... and I better start getting some real answers real fast or he takes the ride too.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Now at this point, I&amp;#39;ve just heard what for all I know could have been them executing this poor bastard in front of my friend, because a script I wrote was running on a computer somewhere beeped and printed off a workstation name. It was just dawning on me now that my zombie-detector script could have lethal consequences. Not &lt;em&gt;exactly&lt;/em&gt; how I thought my day would start. And now I&amp;#39;ve got my friend, who called me for help, quite possibly going with the guy who just Pulp Fiction&amp;#39;d the server room. I summon every last shred of the past five years of my &amp;quot;Authoritative Customer Service Voice&amp;quot; and not a small amount of courage and answer back.&lt;/p&gt;\n\n&lt;p&gt;$Me: &amp;quot;Sir, I would be happy to assist you further, but I need you to put my friend down first.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;(pause)&lt;/p&gt;\n\n&lt;p&gt;$Me: &amp;quot;I can answer any questions you have.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;(more silence)&lt;/p&gt;\n\n&lt;p&gt;$GnomeGuy: &amp;quot;Let me get your phone number and I&amp;#39;ll have my guys call your guys back.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So I give him my contact information and then the call ends. Epilogue: My friend was okay. They didn&amp;#39;t say or do anything to him. So was the guy they dragged out (not executed!), and he was indeed trying to get a copy of the test... but not for the zombies, but for his friends who were also unemployed. Well, the newly crowned King of the Boneheads lived -- he still went to jail. I did receive an e-mail a week or so later just to let me know I needed to call a certain number at a certain place if my phone number or address changed, in case I was needed to testify. My friend did thank me after for &amp;quot;whatever it was&amp;quot; I said to the agent, because it apparently totally changed his demeanor. We surmised after that Authoritative Customer Service Voice must be a lot like Law Enforcement Do What I Say voice. The moral of the story here is, don&amp;#39;t try to steal the test answers when the guy who gave you the test is armed -- and your phone voice has a lot more power than you give it credit for. Use it wisely, young Padawan. &lt;/p&gt;\n\n&lt;p&gt;Edit: Padawan. #NotThatFanGirlySorry&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This will be the lamest anonymization ever, but the story won't make sense without the context. I know you guys like your stories funny, and I'll try, but this was deadly serious at the time. \n\nIt's a few months after a high profile zombie attack orchestrated by an evil bearded gnome. The government has ordered the creation of the new department of zombieland security, and its first job is to train in new zombie screeners at the flying carports, for obvious reasons. As with most big screwups, there's now a sudden need for a lot of IT support, and I get in on this along with three of my friends. Our job is to setup testing sites near the flying carports and facilitate the on-site processing and hiring of the zombie screeners. Those who pass the test are handed their new anti-zombie uniforms, sworn in, and then head off to work at the flying carport.\n\nI've been in touch with my friends for the past couple of weeks while things get going, and the televisions are still ablaze with developments on the current whereabouts of the bearded gnome. Our makeshift locations (hotels, gynmasiums, whatever was available) are secret and there are armed guards everywhere. A concern was raised by one of the supervisors at one of the biggest carports where a friend if mine was stationed, La Gnomia in Yu Nork. It's also the de facto 'command center' for the project. They're concerned that a zombie might try to steal the test answers, and since this entire project was thrown together very suddenly, the security of the computers is, quite literally, the men with the guns standing in the room with the computers, and there is no internet. We sneaker-net the data to an isolated workstation and upload the test results, then wait for a phone call with approval codes (amongst the techs, we called them the 'launch' codes because it determined who got hired, ie, launched).  So, I help my friend by writing up some ad-hoc scripting that will detect any new USB devices that connect to the testing stations. This script gets distributed around and nothing more is thought about it. Remember, this is in the days where cybersecurity isn't a word yet, and awareness of security is still only a dot above \"A password at least 6 characters in length.\" Like everything else about the project, it was needed 90 seconds ago and didn't exist as far as anyone knew. \n\nUntil my phone rings two weeks later. It's my friend.\n\n$Him: \"Hey.\"\n\n$Me: \"Oh hey, what's up?\"\n\n$Him: \"Dude. That script you made. It's beeping. I told my boss. The guys with shotguns just ran by.\" (Lab like 'computer lab' -- he was still sorta fresh out of college)\n\nHe's shaking so bad I can hear the vibration in the earpiece.\n\n$Me: \"Ok, stay with me. What do you need me to do?\"\n\n$Him: \"Hrrr---kay. Well, I don't know anything about programming and my boss asked me how it [the script] knew, and I don't know and then it beeped and--\"\n\n$Me: \"[name], You didn't do anything wrong, the other guy did. The guns are for his soon to be very sorry ###, so focus on the job. What do you need?\"\n\n$Him: \"Well, I nurrr...\" \n\n(there's some noises and a single woman's scream in the background)\n\n$Me: \"Hello? Hello?\"\n\n(Sounds of law enforcing and a phone getting dropped)\n\nA few moments pass... I can hear someone picking the phone up.\n(There's a loud bang)\n\n$Unknown: \"Who is this?\"\n\n$Me: \"This is ######### at ##########, who are you?\"\n\n(A less loud bang. I can hear what sounds like an excited but indistinct conversation)\n\n$Unknown: \"This is special agent Gnome Detector. Are you the one who saw this guy?\"\n\n$Me: \"No. I'm tech support for the guy who did.\"\n\n$GnomeGuy: \"His boss said you caught him. How?\"\n\nAt this exact moment, It took a monumental amount of willpower not to say \"I busted him with science.\"\n\n$Me: \"Well, I wrote a script that continuously monitors certain hive registr--\"\n\n$GnomeGuy: \"Listen nerd squad, I have your, uhh, friend, here... and I better start getting some real answers real fast or he takes the ride too.\"\n\nNow at this point, I've just heard what for all I know could have been them executing this poor bastard in front of my friend, because a script I wrote was running on a computer somewhere beeped and printed off a workstation name. It was just dawning on me now that my zombie-detector script could have lethal consequences. Not *exactly* how I thought my day would start. And now I've got my friend, who called me for help, quite possibly going with the guy who just Pulp Fiction'd the server room. I summon every last shred of the past five years of my \"Authoritative Customer Service Voice\" and not a small amount of courage and answer back.\n\n$Me: \"Sir, I would be happy to assist you further, but I need you to put my friend down first.\"\n\n(pause)\n\n$Me: \"I can answer any questions you have.\"\n\n(more silence)\n\n$GnomeGuy: \"Let me get your phone number and I'll have my guys call your guys back.\"\n\n\nSo I give him my contact information and then the call ends. Epilogue: My friend was okay. They didn't say or do anything to him. So was the guy they dragged out (not executed!), and he was indeed trying to get a copy of the test... but not for the zombies, but for his friends who were also unemployed. Well, the newly crowned King of the Boneheads lived -- he still went to jail. I did receive an e-mail a week or so later just to let me know I needed to call a certain number at a certain place if my phone number or address changed, in case I was needed to testify. My friend did thank me after for \"whatever it was\" I said to the agent, because it apparently totally changed his demeanor. We surmised after that Authoritative Customer Service Voice must be a lot like Law Enforcement Do What I Say voice. The moral of the story here is, don't try to steal the test answers when the guy who gave you the test is armed -- and your phone voice has a lot more power than you give it credit for. Use it wisely, young Padawan. \n\nEdit: Padawan. #NotThatFanGirlySorry", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Long", "id": "65sgh5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 370, "report_reasons": null, "author": "MNGrrl", "saved": false, "mod_reports": [], "name": "t3_65sgh5", "subreddit_name_prefixed": "r/talesfromtechsupport", "approved_by": null, "over_18": false, "domain": "self.talesfromtechsupport", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sfg5", "edited": 1492410517.0, "link_flair_css_class": "long", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/talesfromtechsupport/comments/65sgh5/bad_password_hands_where_i_can_see_them_now/", "num_reports": null, "locked": false, "stickied": false, "created": 1492418118.0, "url": "https://www.reddit.com/r/talesfromtechsupport/comments/65sgh5/bad_password_hands_where_i_can_see_them_now/", "author_flair_text": null, "quarantine": false, "title": "Bad password. Hands where I can see them NOW!", "created_utc": 1492389318.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 57, "visited": false, "subreddit_type": "public", "ups": 370}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgdfywx", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "nosoupforyou", "parent_id": "t1_dgdcsj9", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "It's not entirely this generation.\n\nBack in 84 I quit my retail job because I was just sick of the place.  My mother told me the next day that she called my ex-boss and begged for my job back.\n\n/facepalm", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not entirely this generation.&lt;/p&gt;\n\n&lt;p&gt;Back in 84 I quit my retail job because I was just sick of the place.  My mother told me the next day that she called my ex-boss and begged for my job back.&lt;/p&gt;\n\n&lt;p&gt;/facepalm&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdfywx", "score_hidden": false, "stickied": false, "created": 1492462647.0, "created_utc": 1492433847.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dge0c8m", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "aznelvis", "parent_id": "t1_dgdxvw7", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "This is a situation I can understand, and frankly when public transit is decent in a dense town I'll admit it is *far* easier to take the bus or grab a cab.  The thing is though I'm at a small-ish state school out west so the only reliable bus is the one that covers just the campus and everything else is far enough away that walking isn't realistic.  \n\nI'm only salty because these are the same students who have admittedly turned down a car from their parents when they started college and still have the nerve to bitch about everything being so far away, or complaining that they never get to go anywhere on the weekend.  I actually had to specifically tell my barely acquaintance group-mate that I would not pick them up to go grocery shopping and \"call me if you need anything\" was about the GD project.\n\nIt's only a few weeks in and the whining is already starting to get to me.  Thank god I'm almost done.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a situation I can understand, and frankly when public transit is decent in a dense town I&amp;#39;ll admit it is &lt;em&gt;far&lt;/em&gt; easier to take the bus or grab a cab.  The thing is though I&amp;#39;m at a small-ish state school out west so the only reliable bus is the one that covers just the campus and everything else is far enough away that walking isn&amp;#39;t realistic.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m only salty because these are the same students who have admittedly turned down a car from their parents when they started college and still have the nerve to bitch about everything being so far away, or complaining that they never get to go anywhere on the weekend.  I actually had to specifically tell my barely acquaintance group-mate that I would not pick them up to go grocery shopping and &amp;quot;call me if you need anything&amp;quot; was about the GD project.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s only a few weeks in and the whining is already starting to get to me.  Thank god I&amp;#39;m almost done.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dge0c8m", "score_hidden": false, "stickied": false, "created": 1492487363.0, "created_utc": 1492458563.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdxvw7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JulianSkies", "parent_id": "t1_dgdsama", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "I mean, it's sometimes not *worth* the trouble of getting a license. I'm 29, in the Air Force, live alone in a different state than the one I was born in (not from the U.S., though) and don't have a license.  \nIt's just not worth the time, effort and money to acquire a driver's license at this point of my life given I can get anywhere I need by public transport or foot. Admittedly it gets harder to bail on coworkers if we're at a hangout, but still", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean, it&amp;#39;s sometimes not &lt;em&gt;worth&lt;/em&gt; the trouble of getting a license. I&amp;#39;m 29, in the Air Force, live alone in a different state than the one I was born in (not from the U.S., though) and don&amp;#39;t have a license.&lt;br/&gt;\nIt&amp;#39;s just not worth the time, effort and money to acquire a driver&amp;#39;s license at this point of my life given I can get anywhere I need by public transport or foot. Admittedly it gets harder to bail on coworkers if we&amp;#39;re at a hangout, but still&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdxvw7", "score_hidden": false, "stickied": false, "created": 1492484577.0, "created_utc": 1492455777.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdsama", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "aznelvis", "parent_id": "t1_dgdmnn5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "People like your sister are unfortunately becoming more and more common.  I'm in my 20s and finishing my degree and I just look around at some of these undergrads and fear for the world at large.  In nearly every group project there is at least one person who insists on meeting at the university because they don't have a license... by choice.  FFS I grew up on a farm driving tractors and anything else I could get the keys to since I could reach the pedals and honestly cant imagine that someone would willingly elect to be dependent on someone else for their transportation.\n\nHell when I lived in NY I knew a guy that would have panic attacks every time he left his town of 25k people.  Never did find out why but the man was 36 and fenced into an area of roughly 10 square miles for his whole life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People like your sister are unfortunately becoming more and more common.  I&amp;#39;m in my 20s and finishing my degree and I just look around at some of these undergrads and fear for the world at large.  In nearly every group project there is at least one person who insists on meeting at the university because they don&amp;#39;t have a license... by choice.  FFS I grew up on a farm driving tractors and anything else I could get the keys to since I could reach the pedals and honestly cant imagine that someone would willingly elect to be dependent on someone else for their transportation.&lt;/p&gt;\n\n&lt;p&gt;Hell when I lived in NY I knew a guy that would have panic attacks every time he left his town of 25k people.  Never did find out why but the man was 36 and fenced into an area of roughly 10 square miles for his whole life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdsama", "score_hidden": false, "stickied": false, "created": 1492478342.0, "created_utc": 1492449542.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dge5h3y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PearlClaw", "parent_id": "t1_dgdmnn5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Have you considered that maybe you just got the entire mechanical skill allocation for your generation of your family? Just RNG gone wrong?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you considered that maybe you just got the entire mechanical skill allocation for your generation of your family? Just RNG gone wrong?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dge5h3y", "score_hidden": false, "stickied": false, "created": 1492493210.0, "created_utc": 1492464410.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmnn5", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "MNGrrl", "parent_id": "t1_dgdmahs", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "I'm from Minnesota. I can drive anything with wheels, with any kind of transmission. I once drove a dump truck... when I was 14. Gear box on the floor and everything. Country girl, bitches. And because of our weather, I've driven just about everything in conditions that anywhere else would be considered a national disaster worthy of airdropping generators and water out of fear the end times were upon them. Up here, we call that Tuesday. \n\nNeedless to say, I'm kinda disappointed with her. Like... how are you *my* sister? We gotta like hide you in a closet or something if anyone comes over. It'll destroy my street cred.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m from Minnesota. I can drive anything with wheels, with any kind of transmission. I once drove a dump truck... when I was 14. Gear box on the floor and everything. Country girl, bitches. And because of our weather, I&amp;#39;ve driven just about everything in conditions that anywhere else would be considered a national disaster worthy of airdropping generators and water out of fear the end times were upon them. Up here, we call that Tuesday. &lt;/p&gt;\n\n&lt;p&gt;Needless to say, I&amp;#39;m kinda disappointed with her. Like... how are you &lt;em&gt;my&lt;/em&gt; sister? We gotta like hide you in a closet or something if anyone comes over. It&amp;#39;ll destroy my street cred.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdmnn5", "score_hidden": false, "stickied": false, "created": 1492472001.0, "created_utc": 1492443201.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dge2qql", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "masasuka", "parent_id": "t1_dgdmahs", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "I can understand that, there's a difference between 'oh my god so many other people with large death dealers trying to kill me' and 'I can't do it because mom will do it for me'. A friend of mine back in high school had the same problem, fine driving a 4 wheeler offroading at 40mph, but damned if he'd take his parents car out for a drive in the city because other drivers scared him. He did not have helicopter parents, he was just very untrusting of other drivers. There are a lot of stigmatism's about 'city drivers' and how ... stupid they are. I've seen people (and nearly been hit by them) pull 3/4 of the way though a left turn, only to swerve back into my lane nearly smoking me/other drivers... people are stupid, just do a youtube search for 'stupid drivers' and you'll get a plethora of ... well, stupid. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can understand that, there&amp;#39;s a difference between &amp;#39;oh my god so many other people with large death dealers trying to kill me&amp;#39; and &amp;#39;I can&amp;#39;t do it because mom will do it for me&amp;#39;. A friend of mine back in high school had the same problem, fine driving a 4 wheeler offroading at 40mph, but damned if he&amp;#39;d take his parents car out for a drive in the city because other drivers scared him. He did not have helicopter parents, he was just very untrusting of other drivers. There are a lot of stigmatism&amp;#39;s about &amp;#39;city drivers&amp;#39; and how ... stupid they are. I&amp;#39;ve seen people (and nearly been hit by them) pull 3/4 of the way though a left turn, only to swerve back into my lane nearly smoking me/other drivers... people are stupid, just do a youtube search for &amp;#39;stupid drivers&amp;#39; and you&amp;#39;ll get a plethora of ... well, stupid. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dge2qql", "score_hidden": false, "stickied": false, "created": 1492490049.0, "created_utc": 1492461249.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmahs", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "distractedsquirrel", "parent_id": "t1_dgdjxoo", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "My early-20s brother refuses to drive in any town bigger than our hometown. He says it causes him anxiety. Then you have me in my 30s. I'll drive just about anywhere. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My early-20s brother refuses to drive in any town bigger than our hometown. He says it causes him anxiety. Then you have me in my 30s. I&amp;#39;ll drive just about anywhere. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdmahs", "score_hidden": false, "stickied": false, "created": 1492471574.0, "created_utc": 1492442774.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdjxoo", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "MNGrrl", "parent_id": "t1_dgdg8xn", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "&gt; There isn't much helpful support in place for people with such issues. \"Here are some meds, and we'll shove you in rehab if you freak out enough. Now pretend it's all fixed.\"\n\nWell, there is. We have meetings every Friday evening... at the bar. But yeah, I mean you're absolutely right. A lot of us take for granted that we stumbled into adulthood, faceplanted a bunch of times, but learned to run with it and stand on our own two feet. Most of the time, anyway. But even in my generation (I'm mid-30s) where this level of helicoptering wasn't *really* a thing, we all know people who got saddled with it, and it does... it really does just fucking destroy them a lot of times.\n\nMy sister, who is 20 now, still hasn't learned to drive because it \"makes her uncomfortable\", and throws up her arms and runs off in a huff whenever I so much as mention the word \"car\". She's gotten so used to just having mom do it that she's developed a crippling case of self-doubt. And yes... she comes to me with every little computer problem. Tech-savvy \"millennials\" indeed. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;There isn&amp;#39;t much helpful support in place for people with such issues. &amp;quot;Here are some meds, and we&amp;#39;ll shove you in rehab if you freak out enough. Now pretend it&amp;#39;s all fixed.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, there is. We have meetings every Friday evening... at the bar. But yeah, I mean you&amp;#39;re absolutely right. A lot of us take for granted that we stumbled into adulthood, faceplanted a bunch of times, but learned to run with it and stand on our own two feet. Most of the time, anyway. But even in my generation (I&amp;#39;m mid-30s) where this level of helicoptering wasn&amp;#39;t &lt;em&gt;really&lt;/em&gt; a thing, we all know people who got saddled with it, and it does... it really does just fucking destroy them a lot of times.&lt;/p&gt;\n\n&lt;p&gt;My sister, who is 20 now, still hasn&amp;#39;t learned to drive because it &amp;quot;makes her uncomfortable&amp;quot;, and throws up her arms and runs off in a huff whenever I so much as mention the word &amp;quot;car&amp;quot;. She&amp;#39;s gotten so used to just having mom do it that she&amp;#39;s developed a crippling case of self-doubt. And yes... she comes to me with every little computer problem. Tech-savvy &amp;quot;millennials&amp;quot; indeed. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdjxoo", "score_hidden": false, "stickied": false, "created": 1492468652.0, "created_utc": 1492439852.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdg8xn", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Sphen5117", "parent_id": "t1_dgdcsj9", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "I can't help but feel somewhat sorry for him, too. That kind of helicoptering can seriously damage a person's ability to function in society on their own. And overcoming its effects isn't as simple as just witnessing the rest of society and trying to mimic it. There isn't much helpful support in place for people with such issues. \"Here are some meds, and we'll shove you in rehab if you freak out enough. Now pretend it's all fixed.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t help but feel somewhat sorry for him, too. That kind of helicoptering can seriously damage a person&amp;#39;s ability to function in society on their own. And overcoming its effects isn&amp;#39;t as simple as just witnessing the rest of society and trying to mimic it. There isn&amp;#39;t much helpful support in place for people with such issues. &amp;quot;Here are some meds, and we&amp;#39;ll shove you in rehab if you freak out enough. Now pretend it&amp;#39;s all fixed.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdg8xn", "score_hidden": false, "stickied": false, "created": 1492463129.0, "created_utc": 1492434329.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdcsj9", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "pbaus", "parent_id": "t1_dgcyo39", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "There's a guy where I work who went off his meds, and had some kind of psychotic break at work, and then left.  He was subsequently fired.  This is heresay, but apparently his mom called to get him his job back.  He was at least 26, and while I feel for the guy, he was also an adult.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a guy where I work who went off his meds, and had some kind of psychotic break at work, and then left.  He was subsequently fired.  This is heresay, but apparently his mom called to get him his job back.  He was at least 26, and while I feel for the guy, he was also an adult.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdcsj9", "score_hidden": false, "stickied": false, "created": 1492455456.0, "created_utc": 1492426656.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcyo39", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "MNGrrl", "parent_id": "t1_dgcyb9g", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "&gt; You probably shouldn't work for umbrella, it never goes well.\n\nThe zombie apocalypse would be preferable to going back to desktop support. And from what I can tell, the industry is just getting weirder at entry level all the time. I sat down with a recruiter a few months ago and he was talking (with a bit of pride) about how the recruiters would go with me to the interview to advocate for me. Like... what? I mean... *WHAT?* I was just there to network. \n\nI mention it to my friend, who works over at uni, and he said they've had to develop special procedures to separate parents from incoming freshman. Apparently though, this kind of helicoptering follows them into the job market. Mind = blown. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You probably shouldn&amp;#39;t work for umbrella, it never goes well.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The zombie apocalypse would be preferable to going back to desktop support. And from what I can tell, the industry is just getting weirder at entry level all the time. I sat down with a recruiter a few months ago and he was talking (with a bit of pride) about how the recruiters would go with me to the interview to advocate for me. Like... what? I mean... &lt;em&gt;WHAT?&lt;/em&gt; I was just there to network. &lt;/p&gt;\n\n&lt;p&gt;I mention it to my friend, who works over at uni, and he said they&amp;#39;ve had to develop special procedures to separate parents from incoming freshman. Apparently though, this kind of helicoptering follows them into the job market. Mind = blown. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgcyo39", "score_hidden": false, "stickied": false, "created": 1492424302.0, "created_utc": 1492395502.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 58}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcyb9g", "gilded": 0, "archived": false, "score": 104, "report_reasons": null, "author": "Snuffsis", "parent_id": "t3_65sgh5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "You probably shouldn't work for umbrella, it never goes well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You probably shouldn&amp;#39;t work for umbrella, it never goes well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgcyb9g", "score_hidden": false, "stickied": false, "created": 1492423807.0, "created_utc": 1492395007.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 104}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgdjdtj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mats852", "parent_id": "t1_dgdc0t5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Tango down", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tango down&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdjdtj", "score_hidden": false, "stickied": false, "created": 1492467910.0, "created_utc": 1492439110.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdc0t5", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "thetoastmonster", "parent_id": "t1_dgd6hgi", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "No, wait, I don't mean that.. I mean.. end his suffering?  No, wait.  Not that either.  I mean.. take him out.  Hello?  What was that noise?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, wait, I don&amp;#39;t mean that.. I mean.. end his suffering?  No, wait.  Not that either.  I mean.. take him out.  Hello?  What was that noise?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdc0t5", "score_hidden": false, "stickied": false, "created": 1492453053.0, "created_utc": 1492424253.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgdqqdq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ApolloFireweaver", "parent_id": "t1_dgd6hgi", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "*bang*\n\nOk, whats step 2?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;bang&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Ok, whats step 2?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdqqdq", "score_hidden": false, "stickied": false, "created": 1492476600.0, "created_utc": 1492447800.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgdlael", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "galkardm", "parent_id": "t1_dgd6hgi", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Would anti-zombie forces hire some as pale and as odd as the Joker?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would anti-zombie forces hire some as pale and as odd as the Joker?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdlael", "score_hidden": false, "stickied": false, "created": 1492470367.0, "created_utc": 1492441567.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd6hgi", "gilded": 0, "archived": false, "score": 62, "report_reasons": null, "author": "Vikings-Call", "parent_id": "t3_65sgh5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "&gt;I need you to put my friend down.\n\nVery poor choice of words.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I need you to put my friend down.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Very poor choice of words.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgd6hgi", "score_hidden": false, "stickied": false, "created": 1492437127.0, "created_utc": 1492408327.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 62}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgd40vb", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "Osiris32", "parent_id": "t3_65sgh5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "As someone who spent several years in customer service, and has law enforcement training, the difference between Authoritative Customer Service Voice and Law Enforcement Do It Now Voice is one word:\n\n\"NOW.\"\n\n[I have direct experience with it.](https://www.reddit.com/r/TalesFromRetail/comments/1e0pd8/dont_do_that_or_four_out_of_five_canadians_are/?utm_content=title&amp;utm_medium=user&amp;utm_source=reddit&amp;utm_name=frontpage)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone who spent several years in customer service, and has law enforcement training, the difference between Authoritative Customer Service Voice and Law Enforcement Do It Now Voice is one word:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;NOW.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/TalesFromRetail/comments/1e0pd8/dont_do_that_or_four_out_of_five_canadians_are/?utm_content=title&amp;amp;utm_medium=user&amp;amp;utm_source=reddit&amp;amp;utm_name=frontpage\"&gt;I have direct experience with it.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgd40vb", "score_hidden": false, "stickied": false, "created": 1492432315.0, "created_utc": 1492403515.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgcxhn9", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "MNGrrl", "parent_id": "t1_dgcx3wd", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Yeah it's my first week posting reddit. I've been a lurker for far too many years and decided I was sufficiently bored/desperate/crazy now to actually get an account so I could get rid of an entire folder out of my bookmarks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah it&amp;#39;s my first week posting reddit. I&amp;#39;ve been a lurker for far too many years and decided I was sufficiently bored/desperate/crazy now to actually get an account so I could get rid of an entire folder out of my bookmarks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgcxhn9", "score_hidden": false, "stickied": false, "created": 1492422652.0, "created_utc": 1492393852.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcx3wd", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "CunningAndConfused", "parent_id": "t3_65sgh5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "The zombie context made the read *way* more interesting than having no context or ambigous context. I also really enjoyed the story.\n\nFor formatting (although you did very well) [this](http://redd.it/cw70q) is a good resource.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The zombie context made the read &lt;em&gt;way&lt;/em&gt; more interesting than having no context or ambigous context. I also really enjoyed the story.&lt;/p&gt;\n\n&lt;p&gt;For formatting (although you did very well) &lt;a href=\"http://redd.it/cw70q\"&gt;this&lt;/a&gt; is a good resource.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgcx3wd", "score_hidden": false, "stickied": false, "created": 1492422123.0, "created_utc": 1492393323.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgdl623", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "MNGrrl", "parent_id": "t1_dgdk7ha", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "It is. It's also worth noting **it is nothing to be ashamed about**. I, the battle hardened alpha geek that has been in the real mix (actual life or death) more than once and I will tell you it's a coin flip on which way you're going to go. Believe me, no matter how trained you might be, or have thought it through, when the time comes you're going to have an overpowering instinctual response in those first few moments you are utterly powerless against. I've found my feet carrying me away from a situation while inside my head I was screaming \"BAD FEET! NO! TAKE ME BACK YOU STUPID USELESS LEGS!\" Other times they fucking grew roots and planted down under a nearly seven foot tall ripped hippo. Like, my body decided it would be a great idea to pop the Super Saiyan while the rest of me was picturing how many different ways he was going to either break me in two or go all Thog the Caveman and drag me off for rape time, survival optional. And no, you think it's a man or woman thing on which way you go? Allow me to break that misconception right now... it goes the same for all of us. Don't kick yourself for which way the coin landed at the time -- but if you're in it and feel that rush of conscious control flowing back in and decide on a different course of action, go with it and don't look back or review what just happened. Whatever you decide, commit to it fully in that moment. In the life or death struggle, there are no second guesses and you're going to need every shred of everything you've got to push through it. It is not the time for caution. \n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is. It&amp;#39;s also worth noting &lt;strong&gt;it is nothing to be ashamed about&lt;/strong&gt;. I, the battle hardened alpha geek that has been in the real mix (actual life or death) more than once and I will tell you it&amp;#39;s a coin flip on which way you&amp;#39;re going to go. Believe me, no matter how trained you might be, or have thought it through, when the time comes you&amp;#39;re going to have an overpowering instinctual response in those first few moments you are utterly powerless against. I&amp;#39;ve found my feet carrying me away from a situation while inside my head I was screaming &amp;quot;BAD FEET! NO! TAKE ME BACK YOU STUPID USELESS LEGS!&amp;quot; Other times they fucking grew roots and planted down under a nearly seven foot tall ripped hippo. Like, my body decided it would be a great idea to pop the Super Saiyan while the rest of me was picturing how many different ways he was going to either break me in two or go all Thog the Caveman and drag me off for rape time, survival optional. And no, you think it&amp;#39;s a man or woman thing on which way you go? Allow me to break that misconception right now... it goes the same for all of us. Don&amp;#39;t kick yourself for which way the coin landed at the time -- but if you&amp;#39;re in it and feel that rush of conscious control flowing back in and decide on a different course of action, go with it and don&amp;#39;t look back or review what just happened. Whatever you decide, commit to it fully in that moment. In the life or death struggle, there are no second guesses and you&amp;#39;re going to need every shred of everything you&amp;#39;ve got to push through it. It is not the time for caution. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdl623", "score_hidden": false, "stickied": false, "created": 1492470218.0, "created_utc": 1492441418.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgdkxj7", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Absolut_Iceland", "parent_id": "t1_dgdkolb", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "As bad as freezing in front of an oncoming car is, fawning over it as it comes hurtling at you has got to be an even worse way to die.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As bad as freezing in front of an oncoming car is, fawning over it as it comes hurtling at you has got to be an even worse way to die.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdkxj7", "score_hidden": false, "stickied": false, "created": 1492469922.0, "created_utc": 1492441122.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dge6ilc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Saesama", "parent_id": "t1_dge62a6", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Nah. It's absolutely an instinctual response. Have you never seen an animal roll over and show its belly in response to another animal getting pissed? It's an immediate, unthinking action, a 'please don't hurt me, I am harmless' placation. An animal rolls over, a human cowers or throws up their hands and backs down.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah. It&amp;#39;s absolutely an instinctual response. Have you never seen an animal roll over and show its belly in response to another animal getting pissed? It&amp;#39;s an immediate, unthinking action, a &amp;#39;please don&amp;#39;t hurt me, I am harmless&amp;#39; placation. An animal rolls over, a human cowers or throws up their hands and backs down.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dge6ilc", "score_hidden": false, "stickied": false, "created": 1492494483.0, "created_utc": 1492465683.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge62a6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MNGrrl", "parent_id": "t1_dgdkolb", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "No. This is not a thing that exists. What you're seeing there a situation where they've chosen to flee, but have been blocked. That's not \"fight or flight\", which is a momentary and instinctual response, but a stress response, or a conditioned response. Someone who is trying to negotiate has regained control of their higher faculties and is making conscious choices. Fight or flight is when the conscious mind flees and something *else* takes over. \n\nRemember: Instincts Are Instant", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No. This is not a thing that exists. What you&amp;#39;re seeing there a situation where they&amp;#39;ve chosen to flee, but have been blocked. That&amp;#39;s not &amp;quot;fight or flight&amp;quot;, which is a momentary and instinctual response, but a stress response, or a conditioned response. Someone who is trying to negotiate has regained control of their higher faculties and is making conscious choices. Fight or flight is when the conscious mind flees and something &lt;em&gt;else&lt;/em&gt; takes over. &lt;/p&gt;\n\n&lt;p&gt;Remember: Instincts Are Instant&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dge62a6", "score_hidden": false, "stickied": false, "created": 1492493925.0, "created_utc": 1492465125.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkolb", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Saesama", "parent_id": "t1_dgdk7ha", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "There is also a fourth one: fawn. Where the entity in danger will try to appeal to their attacker, cowering and placating and doing everything possible to be as non-threatening as possible. Most often seen in humans in abusive relationships.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is also a fourth one: fawn. Where the entity in danger will try to appeal to their attacker, cowering and placating and doing everything possible to be as non-threatening as possible. Most often seen in humans in abusive relationships.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdkolb", "score_hidden": false, "stickied": false, "created": 1492469612.0, "created_utc": 1492440812.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdk7ha", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Absolut_Iceland", "parent_id": "t1_dgd8dti", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Addressing your last point: Fight or flight isn't totally true, it's more accurate to say fight, flight, or freeze.  Not everybody will react in the same way to the same situation, but it's an instinctual response to danger.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Addressing your last point: Fight or flight isn&amp;#39;t totally true, it&amp;#39;s more accurate to say fight, flight, or freeze.  Not everybody will react in the same way to the same situation, but it&amp;#39;s an instinctual response to danger.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdk7ha", "score_hidden": false, "stickied": false, "created": 1492469004.0, "created_utc": 1492440204.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8dti", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "MNGrrl", "parent_id": "t1_dgd84kt", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "There is an exception to that rule in a crisis situation (Bullet in the Ass Risk) -- I can't speak to military life, as I was denied entry on account of that whole being-gay thing was a hangup until past the enlistment age limits -- but I've been in a few of them in civilian life, and my brother was in the military too and backs my observations.\n\nThe exception is: If someone freezes up. Like a computer that's locked up, you can't just click on the interface and get it working, it's wedged. The only thing to do is to (and I mean this) slap them right in the face and reboot their brains to get the thoughts going. For some reason, momentary but sharp physical stimulus refocuses people just long enough to see and hear you again. Then you get their ass moving, either towards or away from the bullets. \n\nI watched a car lose control due to excessive speed and a high center of gravity on a side street, and they barreled onto the sidewalk and straight towards me and a friend. I wasn't frozen, but my friend was. I had to grab him and push him over so he lost his balance. Then he 'woke up'. I barely got out of the way myself in time. I did yell \"MOVE! NOW GO GO GO!\" but he was stuck in place.  I can't explain why people do this, even when in mortal danger, but they do. Don't yell if they're cognizant and aware, like you said, but if they've frozen up, it's the only recourse.", "edited": 1492412933.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is an exception to that rule in a crisis situation (Bullet in the Ass Risk) -- I can&amp;#39;t speak to military life, as I was denied entry on account of that whole being-gay thing was a hangup until past the enlistment age limits -- but I&amp;#39;ve been in a few of them in civilian life, and my brother was in the military too and backs my observations.&lt;/p&gt;\n\n&lt;p&gt;The exception is: If someone freezes up. Like a computer that&amp;#39;s locked up, you can&amp;#39;t just click on the interface and get it working, it&amp;#39;s wedged. The only thing to do is to (and I mean this) slap them right in the face and reboot their brains to get the thoughts going. For some reason, momentary but sharp physical stimulus refocuses people just long enough to see and hear you again. Then you get their ass moving, either towards or away from the bullets. &lt;/p&gt;\n\n&lt;p&gt;I watched a car lose control due to excessive speed and a high center of gravity on a side street, and they barreled onto the sidewalk and straight towards me and a friend. I wasn&amp;#39;t frozen, but my friend was. I had to grab him and push him over so he lost his balance. Then he &amp;#39;woke up&amp;#39;. I barely got out of the way myself in time. I did yell &amp;quot;MOVE! NOW GO GO GO!&amp;quot; but he was stuck in place.  I can&amp;#39;t explain why people do this, even when in mortal danger, but they do. Don&amp;#39;t yell if they&amp;#39;re cognizant and aware, like you said, but if they&amp;#39;ve frozen up, it&amp;#39;s the only recourse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgd8dti", "score_hidden": false, "stickied": false, "created": 1492441424.0, "created_utc": 1492412624.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgditft", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "MNGrrl", "parent_id": "t1_dgde7lg", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "True story. Somewhere on their checklist is \"[ ] Fuck Some Guy's Day\". Don't be the person who earns that mark in the box.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;True story. Somewhere on their checklist is &amp;quot;[ ] Fuck Some Guy&amp;#39;s Day&amp;quot;. Don&amp;#39;t be the person who earns that mark in the box.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgditft", "score_hidden": false, "stickied": false, "created": 1492467129.0, "created_utc": 1492438329.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgde7lg", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Jabberwocky918", "parent_id": "t1_dgd84kt", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "The best thing the military taught me: nobody ever messes with a person who has a clipboard in use. Ever.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The best thing the military taught me: nobody ever messes with a person who has a clipboard in use. Ever.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgde7lg", "score_hidden": false, "stickied": false, "created": 1492459114.0, "created_utc": 1492430314.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dge3q3h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AviN456", "parent_id": "t1_dge0g9p", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "&gt; And start humming Staying Alive\n\nThis is page 1 of CPR training.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;And start humming Staying Alive&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is page 1 of CPR training.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dge3q3h", "score_hidden": false, "stickied": false, "created": 1492491148.0, "created_utc": 1492462348.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dge64vc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MNGrrl", "parent_id": "t1_dge0g9p", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "EMT humor at its finest right here, folks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;EMT humor at its finest right here, folks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dge64vc", "score_hidden": false, "stickied": false, "created": 1492494014.0, "created_utc": 1492465214.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge0g9p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "eddpastafarian", "parent_id": "t1_dgd84kt", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Just like taking control of a situation when you're about to administer CPR: Point to the nearest person and say, \"You. Call 911 right now.\" And start humming *Staying Alive.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just like taking control of a situation when you&amp;#39;re about to administer CPR: Point to the nearest person and say, &amp;quot;You. Call 911 right now.&amp;quot; And start humming &lt;em&gt;Staying Alive.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dge0g9p", "score_hidden": false, "stickied": false, "created": 1492487488.0, "created_utc": 1492458688.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd84kt", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "CapsUnlocker", "parent_id": "t3_65sgh5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "In the military two of the best things they taught me were:\n\nHow to give a command to someone and that if you sound authoritative, then most people will just assume that you are.\n\nFor example. Never be ambiguous. Always give a deadline. Instead of using \"should\", use \"shall\" or \"will\" and never \"could\". Don't yell if bullets aren't zipping past or someone is about to die. Talk evenly.\n\n\"Person, you *will* do *this* by *exact time*.\"\n\nIs much better than \"Hey, could you do this thing as soon as possible?\"\n\nOf course outside the military, I lead off with the polite statement and if I don't get the results I need, I revert back to barking a command. It pretty much works all the time.\n\nThink of it like your voice is carrying a clipboard and coffee mug.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the military two of the best things they taught me were:&lt;/p&gt;\n\n&lt;p&gt;How to give a command to someone and that if you sound authoritative, then most people will just assume that you are.&lt;/p&gt;\n\n&lt;p&gt;For example. Never be ambiguous. Always give a deadline. Instead of using &amp;quot;should&amp;quot;, use &amp;quot;shall&amp;quot; or &amp;quot;will&amp;quot; and never &amp;quot;could&amp;quot;. Don&amp;#39;t yell if bullets aren&amp;#39;t zipping past or someone is about to die. Talk evenly.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Person, you &lt;em&gt;will&lt;/em&gt; do &lt;em&gt;this&lt;/em&gt; by &lt;em&gt;exact time&lt;/em&gt;.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Is much better than &amp;quot;Hey, could you do this thing as soon as possible?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Of course outside the military, I lead off with the polite statement and if I don&amp;#39;t get the results I need, I revert back to barking a command. It pretty much works all the time.&lt;/p&gt;\n\n&lt;p&gt;Think of it like your voice is carrying a clipboard and coffee mug.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgd84kt", "score_hidden": false, "stickied": false, "created": 1492440838.0, "created_utc": 1492412038.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgd9629", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "MNGrrl", "parent_id": "t1_dgd8uu6", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "I've done some work with law enforcement in the field and it was never pleasant. I mean, I get being serious, but... like in my story, especially given what was going on in the country at the time, I legit thought they might have blown the guy away and my brain's RPMs redlined over what that could mean and just how sure I was about my code and you know, the fact that I may have just helped get a man I didn't know or even *see* killed doing some totally routine and unimpressive thing in my field. Screw off about whether or not it was my fault or not -- I didn't sign up to be part of Team Execution Squad... I'm an alpha geek. Like, the closest I want to come to death and destruction is a caffeine overdose or nerd rage over a printer that just. will. not. work.\n\nThe weird thing is, it didn't really hit me in the gut until about a minute after the call ended, when it all just exploded in my gut and I tucked tail with the last shred of composure to get out of the room and into the stairwell before losing it as a shaking hot mess. I was still fearful I hadn't managed to head off my friend getting sent up in a black helicopter to some interrogation/gas chamber to be questioned and or tortured for technical knowledge he had no way of giving them. \n\nThese are the sorts of thoughts encounters with law enforcement prompt... even though, rationally, and after the fact, I can see there was little cause for alarm. Sure the guy would probably get a little roughed up, and the noises I heard were probably just him going ass over tea kettle in a room full of heavy equipment, but... adrenaline and indistinguishable noises through a phone line really prime the imagination!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve done some work with law enforcement in the field and it was never pleasant. I mean, I get being serious, but... like in my story, especially given what was going on in the country at the time, I legit thought they might have blown the guy away and my brain&amp;#39;s RPMs redlined over what that could mean and just how sure I was about my code and you know, the fact that I may have just helped get a man I didn&amp;#39;t know or even &lt;em&gt;see&lt;/em&gt; killed doing some totally routine and unimpressive thing in my field. Screw off about whether or not it was my fault or not -- I didn&amp;#39;t sign up to be part of Team Execution Squad... I&amp;#39;m an alpha geek. Like, the closest I want to come to death and destruction is a caffeine overdose or nerd rage over a printer that just. will. not. work.&lt;/p&gt;\n\n&lt;p&gt;The weird thing is, it didn&amp;#39;t really hit me in the gut until about a minute after the call ended, when it all just exploded in my gut and I tucked tail with the last shred of composure to get out of the room and into the stairwell before losing it as a shaking hot mess. I was still fearful I hadn&amp;#39;t managed to head off my friend getting sent up in a black helicopter to some interrogation/gas chamber to be questioned and or tortured for technical knowledge he had no way of giving them. &lt;/p&gt;\n\n&lt;p&gt;These are the sorts of thoughts encounters with law enforcement prompt... even though, rationally, and after the fact, I can see there was little cause for alarm. Sure the guy would probably get a little roughed up, and the noises I heard were probably just him going ass over tea kettle in a room full of heavy equipment, but... adrenaline and indistinguishable noises through a phone line really prime the imagination!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgd9629", "score_hidden": false, "stickied": false, "created": 1492443478.0, "created_utc": 1492414678.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8uu6", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "settleddown", "parent_id": "t3_65sgh5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "&gt;Now at this point, I've just heard what for all I know could have been them executing this poor bastard in front of my friend, because a script I wrote was running on a computer somewhere beeped and printed off a workstation name.\n\nThere are points when engineering things for security folks when these things dawn on you. I once had such a job. I clearly remember talking with some customers, suddenly realising how important it is that I clarify:\n\n* Yes, there is a good reason we classified this \"oh my god this is really secret guard it with your life\"\n* In case of an actual full on zombie attack, if things go from bad to worse, it is NOT worth anyone actually sacrifising his or her life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Now at this point, I&amp;#39;ve just heard what for all I know could have been them executing this poor bastard in front of my friend, because a script I wrote was running on a computer somewhere beeped and printed off a workstation name.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There are points when engineering things for security folks when these things dawn on you. I once had such a job. I clearly remember talking with some customers, suddenly realising how important it is that I clarify:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Yes, there is a good reason we classified this &amp;quot;oh my god this is really secret guard it with your life&amp;quot;&lt;/li&gt;\n&lt;li&gt;In case of an actual full on zombie attack, if things go from bad to worse, it is NOT worth anyone actually sacrifising his or her life.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgd8uu6", "score_hidden": false, "stickied": false, "created": 1492442583.0, "created_utc": 1492413783.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgd7u0v", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MNGrrl", "parent_id": "t1_dgd65g1", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Fixed. Thanks. Also... appreciate the pedantry, just not as big of a Star Wars fan as you obv. ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fixed. Thanks. Also... appreciate the pedantry, just not as big of a Star Wars fan as you obv. ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgd7u0v", "score_hidden": false, "stickied": false, "created": 1492440130.0, "created_utc": 1492411330.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd65g1", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "LAGAximili", "parent_id": "t3_65sgh5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Great story, the obfuscation was great, one small thing though: Padawan. There, my inner pedant can now be quiet. :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great story, the obfuscation was great, one small thing though: Padawan. There, my inner pedant can now be quiet. :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgd65g1", "score_hidden": false, "stickied": false, "created": 1492436447.0, "created_utc": 1492407647.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgdgmdg", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "TorsteinTheRed", "parent_id": "t1_dgd46g2", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Known among the Bene Gesserit as simply, [The Voice](https://youtu.be/QrCfivcQe48)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Known among the Bene Gesserit as simply, &lt;a href=\"https://youtu.be/QrCfivcQe48\"&gt;The Voice&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdgmdg", "score_hidden": false, "stickied": false, "created": 1492463773.0, "created_utc": 1492434973.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgdi0u4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mirshe", "parent_id": "t1_dgdbgr9", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "My sister-in-law's Teacher Voice is pretty much the same way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My sister-in-law&amp;#39;s Teacher Voice is pretty much the same way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdi0u4", "score_hidden": false, "stickied": false, "created": 1492465984.0, "created_utc": 1492437184.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgdnyua", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lacrimaeveneris", "parent_id": "t1_dgdbgr9", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "I work with behavioral youth, and both my staff and the kids have said that I have an impressive \"Mom Voice.\" Essentially the same thing as the Caregiver Voice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I work with behavioral youth, and both my staff and the kids have said that I have an impressive &amp;quot;Mom Voice.&amp;quot; Essentially the same thing as the Caregiver Voice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdnyua", "score_hidden": false, "stickied": false, "created": 1492473506.0, "created_utc": 1492444706.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdbgr9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "faythofdragons", "parent_id": "t1_dgd46g2", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Yep, I work as a caregiver with mentally disabled folks, and my Caregiver Voice works pretty well on non-disabled people too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, I work as a caregiver with mentally disabled folks, and my Caregiver Voice works pretty well on non-disabled people too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdbgr9", "score_hidden": false, "stickied": false, "created": 1492451189.0, "created_utc": 1492422389.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd46g2", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "VTi-R", "parent_id": "t3_65sgh5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "&gt; We surmised after that Authoritative Customer Service Voice must be a lot like Law Enforcement Do What I Say voice.\n\nCommand Voice, or at least a relative of it. It's a projection of calm, self-assured, confident certainty and finality - \"This. Is. How. It. Is. Going. To. Be.\". It's a combination of individual word tones, clarity of pronunciation, overall inflection and the cadence of what is being said.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;We surmised after that Authoritative Customer Service Voice must be a lot like Law Enforcement Do What I Say voice.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Command Voice, or at least a relative of it. It&amp;#39;s a projection of calm, self-assured, confident certainty and finality - &amp;quot;This. Is. How. It. Is. Going. To. Be.&amp;quot;. It&amp;#39;s a combination of individual word tones, clarity of pronunciation, overall inflection and the cadence of what is being said.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgd46g2", "score_hidden": false, "stickied": false, "created": 1492432585.0, "created_utc": 1492403785.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgdownh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Thecakeisalie25", "parent_id": "t1_dgdjciv", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Terribly sorry for his mistake, but I'll 90% sure that he was talking about the bearded gnome, not you. The bearded gnome can be reached by searching the bolded text in my last comment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Terribly sorry for his mistake, but I&amp;#39;ll 90% sure that he was talking about the bearded gnome, not you. The bearded gnome can be reached by searching the bolded text in my last comment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdownh", "score_hidden": false, "stickied": false, "created": 1492474575.0, "created_utc": 1492445775.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdjciv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MNGrrl", "parent_id": "t1_dgdahs4", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Sounds like someone who needs a lesson in manners. He should be thankful I'm older and wiser than I used to be... those kinds of people used to be target practice for races with friends to see who could be the first to identify them in real life. No, it wasn't hacking (ok, sometimes it was) -- my friend worked as a 'skip tracer' for large balance accounts. If you don't know what that is: Let's say you owe a million bucks for a yacht or something and didn't pay it off and fell behind (the reason is often benign, but...). Well, he was one of the people assigned to track you down and get you served. Very occasionally he'd exhaust all of the legal resources available to him and come to me, sometimes because he picked up on the trail online but needed positive verification either that it was the guy or, if it appeared he had fled the country (it did happen!) to confirm that so he could close out the case -- nothing we can do once they're in timbucktu. Sometimes he just needed a second set of eyes because sometimes people would try for smoke screens thinking they were all 007 on paper and it would confuse the bill collectors. No man, not really. Not. Really. And to be clear, he had a real license as a private investigator (PI) and the work was legit though sometimes had to go in grey areas that The Management(tm) didn't need to know about.\n\nI've got a couple good stories from that time in my life but, not the kind of thing I often talk about online for the same reason we don't let it slip casually that we work in technology -- not interested in fixing your damn sister's computer... take it to a store. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like someone who needs a lesson in manners. He should be thankful I&amp;#39;m older and wiser than I used to be... those kinds of people used to be target practice for races with friends to see who could be the first to identify them in real life. No, it wasn&amp;#39;t hacking (ok, sometimes it was) -- my friend worked as a &amp;#39;skip tracer&amp;#39; for large balance accounts. If you don&amp;#39;t know what that is: Let&amp;#39;s say you owe a million bucks for a yacht or something and didn&amp;#39;t pay it off and fell behind (the reason is often benign, but...). Well, he was one of the people assigned to track you down and get you served. Very occasionally he&amp;#39;d exhaust all of the legal resources available to him and come to me, sometimes because he picked up on the trail online but needed positive verification either that it was the guy or, if it appeared he had fled the country (it did happen!) to confirm that so he could close out the case -- nothing we can do once they&amp;#39;re in timbucktu. Sometimes he just needed a second set of eyes because sometimes people would try for smoke screens thinking they were all 007 on paper and it would confuse the bill collectors. No man, not really. Not. Really. And to be clear, he had a real license as a private investigator (PI) and the work was legit though sometimes had to go in grey areas that The Management(tm) didn&amp;#39;t need to know about.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve got a couple good stories from that time in my life but, not the kind of thing I often talk about online for the same reason we don&amp;#39;t let it slip casually that we work in technology -- not interested in fixing your damn sister&amp;#39;s computer... take it to a store. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdjciv", "score_hidden": false, "stickied": false, "created": 1492467860.0, "created_utc": 1492439060.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdahs4", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Sandwich247", "parent_id": "t1_dgda7lj", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Horrible excuse for a human being, who likes to dox people for fun, and accuse people of being rapists, or paedohpiles.\n\nNasty piece of work, you're better off not knowing about him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Horrible excuse for a human being, who likes to dox people for fun, and accuse people of being rapists, or paedohpiles.&lt;/p&gt;\n\n&lt;p&gt;Nasty piece of work, you&amp;#39;re better off not knowing about him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdahs4", "score_hidden": false, "stickied": false, "created": 1492447809.0, "created_utc": 1492419009.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgdi8a6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "angrydwarfuk", "parent_id": "t1_dgda7lj", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Just gonna leave [this](https://youtu.be/-o3TfHjj_e4) here. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just gonna leave &lt;a href=\"https://youtu.be/-o3TfHjj_e4\"&gt;this&lt;/a&gt; here. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdi8a6", "score_hidden": false, "stickied": false, "created": 1492466290.0, "created_utc": 1492437490.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgda7lj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MNGrrl", "parent_id": "t1_dgda0ad", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Okay, I'm like, not at all into youtube bloggers so if this is the coolest thing ever and I need to check it out, I'm gonna need like a clue-by-four kinda hint. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, I&amp;#39;m like, not at all into youtube bloggers so if this is the coolest thing ever and I need to check it out, I&amp;#39;m gonna need like a clue-by-four kinda hint. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgda7lj", "score_hidden": false, "stickied": false, "created": 1492446823.0, "created_utc": 1492418023.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgda0ad", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Thecakeisalie25", "parent_id": "t1_dgd8kgl", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Someone who reports **drama, alert**ing people to what happens in the world.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Someone who reports &lt;strong&gt;drama, alert&lt;/strong&gt;ing people to what happens in the world.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgda0ad", "score_hidden": false, "stickied": false, "created": 1492446141.0, "created_utc": 1492417341.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8kgl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MNGrrl", "parent_id": "t1_dgd8iqj", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "Certain? I just described most of the hipsters on Youtube. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Certain? I just described most of the hipsters on Youtube. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgd8kgl", "score_hidden": false, "stickied": false, "created": 1492441827.0, "created_utc": 1492413027.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8iqj", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Thecakeisalie25", "parent_id": "t3_65sgh5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "&gt; Bearded gnome\n\nA certain YouTuber comes to mind.", "edited": 1492413133.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Bearded gnome&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A certain YouTuber comes to mind.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgd8iqj", "score_hidden": false, "stickied": false, "created": 1492441726.0, "created_utc": 1492412926.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgdp5ss", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "wmassingham", "parent_id": "t3_65sgh5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "I'm still confused about what exactly happened. There was a script that detected USB devices, and a computer that beeped and printed a computer name... Can you explain more about this?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m still confused about what exactly happened. There was a script that detected USB devices, and a computer that beeped and printed a computer name... Can you explain more about this?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgdp5ss", "score_hidden": false, "stickied": false, "created": 1492474861.0, "created_utc": 1492446061.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dgcvcyv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "hugedrunkrobot", "parent_id": "t3_65sgh5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "This was a great read.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was a great read.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dgcvcyv", "score_hidden": false, "stickied": false, "created": 1492419860.0, "created_utc": 1492391060.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dge0y5z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mrlint", "parent_id": "t3_65sgh5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "*damn*..\n\njust damn", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;damn&lt;/em&gt;..&lt;/p&gt;\n\n&lt;p&gt;just damn&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dge0y5z", "score_hidden": false, "stickied": false, "created": 1492488050.0, "created_utc": 1492459250.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sfg5", "removal_reason": null, "link_id": "t3_65sgh5", "likes": null, "replies": "", "user_reports": [], "id": "dge14ap", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mrlint", "parent_id": "t3_65sgh5", "subreddit_name_prefixed": "r/talesfromtechsupport", "controversiality": 0, "body": "\"$Me: \"Sir, I would be happy to assist you further, but I need you to put my friend down first.\"\n\nOK it took me a min but I finally matched what my brain was thinking ; from HHGttG \"I am now a perfect safe penguin and my colleague here is rapidly running out of limbs\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;$Me: &amp;quot;Sir, I would be happy to assist you further, but I need you to put my friend down first.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;OK it took me a min but I finally matched what my brain was thinking ; from HHGttG &amp;quot;I am now a perfect safe penguin and my colleague here is rapidly running out of limbs&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "talesfromtechsupport", "name": "t1_dge14ap", "score_hidden": false, "stickied": false, "created": 1492488242.0, "created_utc": 1492459442.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]