[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "darksouls", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://manseesnotlight.tumblr.com/\"&gt;https://manseesnotlight.tumblr.com/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Hello. I just started a blog dedicated to extreme over-analyzations of various aspects of the Dark Souls world, particularly things not often covered by the &amp;quot;big&amp;quot; lore guys like Vaati and ENB. this series has always been like a huge puzzle for me, and this is an exercise in seeing how much of the puzzle i (and we, as a community with feedback and discussions) can solve. &lt;/p&gt;\n\n&lt;p&gt;i&amp;#39;ve already posted about two different topics, and i feel like pulling an all-nighter so i&amp;#39;ll likely havea couple more posted here very soon. i really hope that some of you guys might be as dorky as me and interested in devoting time to things that don&amp;#39;t really matter, like obscure lore in video games, but what can i say. i feel a passion for it. so i hope ya&amp;#39;ll will give them a read, and i completely welcome any feedback or alternative theories/counter-arguments anyone might have&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "https://manseesnotlight.tumblr.com/\n\nHello. I just started a blog dedicated to extreme over-analyzations of various aspects of the Dark Souls world, particularly things not often covered by the \"big\" lore guys like Vaati and ENB. this series has always been like a huge puzzle for me, and this is an exercise in seeing how much of the puzzle i (and we, as a community with feedback and discussions) can solve. \n\ni've already posted about two different topics, and i feel like pulling an all-nighter so i'll likely havea couple more posted here very soon. i really hope that some of you guys might be as dorky as me and interested in devoting time to things that don't really matter, like obscure lore in video games, but what can i say. i feel a passion for it. so i hope ya'll will give them a read, and i completely welcome any feedback or alternative theories/counter-arguments anyone might have", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Lore", "id": "65b0ym", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "deathjam5000", "saved": false, "mod_reports": [], "name": "t3_65b0ym", "subreddit_name_prefixed": "r/darksouls", "approved_by": null, "over_18": false, "domain": "self.darksouls", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sazo", "edited": false, "link_flair_css_class": "lore", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/darksouls/comments/65b0ym/starting_a_blog_for_indepth_analysis_of_lore_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492180310.0, "url": "https://www.reddit.com/r/darksouls/comments/65b0ym/starting_a_blog_for_indepth_analysis_of_lore_and/", "author_flair_text": null, "quarantine": false, "title": "Starting a blog for in-depth analysis of lore and world-building", "created_utc": 1492151510.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65b0ym", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65b0ym", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65b0ym", "likes": null, "replies": "", "user_reports": [], "id": "dg9tceg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Gensh", "parent_id": "t1_dg9s8xb", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "One question is whether the light emitted by the player character ought to be considered as an actual in-setting occurrence or merely a player convenience. Rather than phasing in and out at will, the Irithyllian slaves appear once we near them - that is to say, once they're within range of the light our character emits. Given the intermittent talk of secrets being \"elucidated by Fire,\" it sticks out a bit.\n\nThe Untended Graves are indeed an area which invites heavy speculation. To start, I assume that most of the characters in the game originate from a particular era which was dredged up when the geography became a train wreck. Instead of assuming that Andre survived the entire series, I instead assume he is plucked from a timeline shortly after the Chosen Undead Linked the Flame.\n\nBeyond that, I'm not sure we have evidence to properly construct a narrative. Since I write trashy fanfiction, however, I made one without solid evidence. Oceiros might have invited scholars from other lands in order to solve his problem of producing the proper heir, just as various kings in DaS2 did. From there, I presume that Ludleth was among them; that the kingdom of Lothric built Firelink and the Thrones a few cycles prior; and that when the scholars failed, Ludleth volunteered to buy them more time by Linking the Fire with his own soul.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One question is whether the light emitted by the player character ought to be considered as an actual in-setting occurrence or merely a player convenience. Rather than phasing in and out at will, the Irithyllian slaves appear once we near them - that is to say, once they&amp;#39;re within range of the light our character emits. Given the intermittent talk of secrets being &amp;quot;elucidated by Fire,&amp;quot; it sticks out a bit.&lt;/p&gt;\n\n&lt;p&gt;The Untended Graves are indeed an area which invites heavy speculation. To start, I assume that most of the characters in the game originate from a particular era which was dredged up when the geography became a train wreck. Instead of assuming that Andre survived the entire series, I instead assume he is plucked from a timeline shortly after the Chosen Undead Linked the Flame.&lt;/p&gt;\n\n&lt;p&gt;Beyond that, I&amp;#39;m not sure we have evidence to properly construct a narrative. Since I write trashy fanfiction, however, I made one without solid evidence. Oceiros might have invited scholars from other lands in order to solve his problem of producing the proper heir, just as various kings in DaS2 did. From there, I presume that Ludleth was among them; that the kingdom of Lothric built Firelink and the Thrones a few cycles prior; and that when the scholars failed, Ludleth volunteered to buy them more time by Linking the Fire with his own soul.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dg9tceg", "score_hidden": false, "stickied": false, "created": 1492235603.0, "created_utc": 1492206803.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9s8xb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "deathjam5000", "parent_id": "t1_dg9forb", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "EXACTLY the kind of input and discussion i was hoping for. i guess i need to brush up on my DaS2 lore, i was thinking that alken and venn were the kingdoms before the Old Iron King, and he used what little strength he had to wrest one of the two kingdoms for his own before meeting Alonne, but it's been a while since my last read-through of ds2's dialogue and item descriptions.\n\nthanks for pointing out the ghosts i missed. ya know i never even really thought of the irithyllian slaves as ghost-like.....although since they still maintain a physical presence, seemingly being able to phase in and out at will, i'm not sure if they can truly be considered ghosts. although the fact that they have this ability is firing some interesting neurons in my brain regarding my theory on the connection between ghosts and phantoms. from what you've said, i can definitely agree that ghosts are undoubtedly associated with dark, and i like your ideas regarding the status of ghosts corresponding with the level of \"malevolence\" of the dark aspects of the locations they are found in. \n\ni think for my next post i'm going to tackle a big one: the untended graves. i'm gonna have to dig deep because the entire situation of the untended graves is a logical nightmare. out of curiosity, do you have a personal theory on just what the hell is going on in the untended graves? the main things that are giving me trouble with this subject is ludleth's dialogue after finding the fire keeper's eyes, and the fact that the thrones are already present while it is heavily implied to be the past. as if an age of dark has already happened. which i suppose is possible, but you would think SOMEONE would comment on that fact.....the other unkindled you meet probably wouldn't know because they likely awoke around the same time as the PC, but other npc's, particularly yorshka and andre come to mind, i feel would give some sort of indication that an age of dark had occured......and furthermore, they would have had to lived through it. do you have any thoughts on this?\n\npart of me thinks that the untended graves itself is supposed to be the \"vision\" of a world destitute of fire which the firekeeper sees when you give her the eyes. but the shrine handmaiden's dialogue seems to dispute that", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;EXACTLY the kind of input and discussion i was hoping for. i guess i need to brush up on my DaS2 lore, i was thinking that alken and venn were the kingdoms before the Old Iron King, and he used what little strength he had to wrest one of the two kingdoms for his own before meeting Alonne, but it&amp;#39;s been a while since my last read-through of ds2&amp;#39;s dialogue and item descriptions.&lt;/p&gt;\n\n&lt;p&gt;thanks for pointing out the ghosts i missed. ya know i never even really thought of the irithyllian slaves as ghost-like.....although since they still maintain a physical presence, seemingly being able to phase in and out at will, i&amp;#39;m not sure if they can truly be considered ghosts. although the fact that they have this ability is firing some interesting neurons in my brain regarding my theory on the connection between ghosts and phantoms. from what you&amp;#39;ve said, i can definitely agree that ghosts are undoubtedly associated with dark, and i like your ideas regarding the status of ghosts corresponding with the level of &amp;quot;malevolence&amp;quot; of the dark aspects of the locations they are found in. &lt;/p&gt;\n\n&lt;p&gt;i think for my next post i&amp;#39;m going to tackle a big one: the untended graves. i&amp;#39;m gonna have to dig deep because the entire situation of the untended graves is a logical nightmare. out of curiosity, do you have a personal theory on just what the hell is going on in the untended graves? the main things that are giving me trouble with this subject is ludleth&amp;#39;s dialogue after finding the fire keeper&amp;#39;s eyes, and the fact that the thrones are already present while it is heavily implied to be the past. as if an age of dark has already happened. which i suppose is possible, but you would think SOMEONE would comment on that fact.....the other unkindled you meet probably wouldn&amp;#39;t know because they likely awoke around the same time as the PC, but other npc&amp;#39;s, particularly yorshka and andre come to mind, i feel would give some sort of indication that an age of dark had occured......and furthermore, they would have had to lived through it. do you have any thoughts on this?&lt;/p&gt;\n\n&lt;p&gt;part of me thinks that the untended graves itself is supposed to be the &amp;quot;vision&amp;quot; of a world destitute of fire which the firekeeper sees when you give her the eyes. but the shrine handmaiden&amp;#39;s dialogue seems to dispute that&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dg9s8xb", "score_hidden": false, "stickied": false, "created": 1492234189.0, "created_utc": 1492205389.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9forb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Gensh", "parent_id": "t3_65b0ym", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "Lore for all three games below, so those who are still calling spoilers, beware.\n\n\"Alken and Venn, the Old Iron Kingdom\"\n\nThe general understanding is that Iron Keep is in Venn as Belfry Sol has the Bell of Venn - but the Prince of Alken was kept there and people argue over what was going on, since the prince and princess were supposed to be under house arrest. The way I assume it worked was that the OIK was the king of Alken, who then conquered Venn. He stayed in the frontier of his new territory and shipped the captured princess back to the prison near his capital.\n\nFor the ghost discussion, you missed the ghosts in the the Dark Chasm of Old and Shulva. In fact, the Shulva ghosts are clearly artificially created, which is an interesting avenue for study, though I doubt much could be discovered. Of note, however, is that the ghosts are indeed associated with Dark. Let's observe their appearances:\n\n* New Londo fell into madness under the Four Kings, and the ghosts were created when the whole city was drowned. They can be damaged by cursed weapons, including the Greatsword of Artorias which represents Sif's memories of Artorias' fall. Interestingly, the ghosts of women holding infants can cast lightning.\n\n* Drangleic Castle has been thoroughly corrupted by the presence of Nashandra. Chancellor Wellager is completely immune to damage, as there are no cursed weapons in Drangleic.\n* The Undead Crypt is not associated with the usual Dark and indeed is protected from the daughters of Manus by the Shrine of Amana. Rather, it is associated with the peaceful aspects of Dark, which likely has to do with Nito's realm being explicitly lightless. These ghosts can be hurt.\n* The Dark Chasm of Old is likewise associated with the peaceful Dark, and Grandahl is one of the few Dark-aligned NPCs who is not a raging d*******. There ghosts here are witchtrees, which may be sorcerers or - curious again - clerics capable of casting lightning. These ghosts can be hurt.\n* Shulva has, similar to Drangleic Castle, been thoroughly corrupted by Elana. The ghosts here are artificial, created by some sort of magic cast upon the armor of the warriors turned to ghosts. These ghosts are completely immune to damage while under the effect, like Chancellor Wellager and the ghosts of New Londo.\n\nNow, for an honorable mention and possibly the solution: the slaves of Irithyll. Everything in Irithyll is eaten away by insects, which burrow and gnaw and suck away at the blood, which we now know contains the Dark Soul. The slaves in Irithyll have been so devoured that they must suck at blood gems to sustain themselves. Dark magic has a physical presence, so perhaps it is because their inner Dark has been eaten away that they become invisible.\n\nThis could correspond with the ghosts of New Londo having been sealed with the rest of the city. In the case of the locations where the Dark is omnipresent, it could be assumed that their selves are being washed away. Even prior to the rise of the Deep, the Dark has been described as similar to water, so it's little wonder if the lesser Dark of an individual is simply drowned out and absorbed by a greater one. I would go as far as to say that while most of the Undead Curse can be attributed to the seal of Fire, the loss of memories is caused by the onset of Dark.", "edited": 1492190496.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lore for all three games below, so those who are still calling spoilers, beware.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Alken and Venn, the Old Iron Kingdom&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The general understanding is that Iron Keep is in Venn as Belfry Sol has the Bell of Venn - but the Prince of Alken was kept there and people argue over what was going on, since the prince and princess were supposed to be under house arrest. The way I assume it worked was that the OIK was the king of Alken, who then conquered Venn. He stayed in the frontier of his new territory and shipped the captured princess back to the prison near his capital.&lt;/p&gt;\n\n&lt;p&gt;For the ghost discussion, you missed the ghosts in the the Dark Chasm of Old and Shulva. In fact, the Shulva ghosts are clearly artificially created, which is an interesting avenue for study, though I doubt much could be discovered. Of note, however, is that the ghosts are indeed associated with Dark. Let&amp;#39;s observe their appearances:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;New Londo fell into madness under the Four Kings, and the ghosts were created when the whole city was drowned. They can be damaged by cursed weapons, including the Greatsword of Artorias which represents Sif&amp;#39;s memories of Artorias&amp;#39; fall. Interestingly, the ghosts of women holding infants can cast lightning.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Drangleic Castle has been thoroughly corrupted by the presence of Nashandra. Chancellor Wellager is completely immune to damage, as there are no cursed weapons in Drangleic.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The Undead Crypt is not associated with the usual Dark and indeed is protected from the daughters of Manus by the Shrine of Amana. Rather, it is associated with the peaceful aspects of Dark, which likely has to do with Nito&amp;#39;s realm being explicitly lightless. These ghosts can be hurt.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The Dark Chasm of Old is likewise associated with the peaceful Dark, and Grandahl is one of the few Dark-aligned NPCs who is not a raging d*******. There ghosts here are witchtrees, which may be sorcerers or - curious again - clerics capable of casting lightning. These ghosts can be hurt.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Shulva has, similar to Drangleic Castle, been thoroughly corrupted by Elana. The ghosts here are artificial, created by some sort of magic cast upon the armor of the warriors turned to ghosts. These ghosts are completely immune to damage while under the effect, like Chancellor Wellager and the ghosts of New Londo.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Now, for an honorable mention and possibly the solution: the slaves of Irithyll. Everything in Irithyll is eaten away by insects, which burrow and gnaw and suck away at the blood, which we now know contains the Dark Soul. The slaves in Irithyll have been so devoured that they must suck at blood gems to sustain themselves. Dark magic has a physical presence, so perhaps it is because their inner Dark has been eaten away that they become invisible.&lt;/p&gt;\n\n&lt;p&gt;This could correspond with the ghosts of New Londo having been sealed with the rest of the city. In the case of the locations where the Dark is omnipresent, it could be assumed that their selves are being washed away. Even prior to the rise of the Deep, the Dark has been described as similar to water, so it&amp;#39;s little wonder if the lesser Dark of an individual is simply drowned out and absorbed by a greater one. I would go as far as to say that while most of the Undead Curse can be attributed to the seal of Fire, the loss of memories is caused by the onset of Dark.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dg9forb", "score_hidden": false, "stickied": false, "created": 1492219086.0, "created_utc": 1492190286.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]