[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "darksouls", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is my history with the SoulsBorne games.&lt;/p&gt;\n\n&lt;p&gt;I started with DeS when it first came out, bought it and I wanted to like it so bad.  I just couldn&amp;#39;t dedicate myself (too hard, etc) to it.  Tower of Latria turned me off completely, never went back to it.  Got Dark Souls in 2013 for 20$ off the MS Store.  Seemed a little more accessible to me, but still, same thing.  &lt;/p&gt;\n\n&lt;p&gt;Skipped DS 2 (I have it for PC though).  &lt;/p&gt;\n\n&lt;p&gt;Followed BB from the moment it was announced but NEVER watched any gameplay until the reviews hit.  Immediately went out and bought it.  Went over to my buddies house and we both loved it.  It was the atmosphere that drew me in and I loved the faster gameplay.  No shields was what did it for me.  I&amp;#39;ve always been good at games like the Ninja Gaiden series and the PS2 Shinobi (underrated game), so BB just clicked for me.  Still my favorite PS4 exclusive and I don&amp;#39;t ever see than changing.  BB was my first souls game that I completed and holds a special place.&lt;/p&gt;\n\n&lt;p&gt;So after BB and watching Vaati vids for the lore, I started watching his DS3 news videos and decided I would get DS3 and hopefully have a different experience.  After playing BB, I was more than ready for DS3.  I even found it easy at some points, definitely not as hard as BB.  Have about 200 hours sunk into it and the optional boss in Ringed City is the only one I haven&amp;#39;t solo&amp;#39;d.&lt;/p&gt;\n\n&lt;p&gt;After DS3, I decided to go back and play the first.  Tonight, with my little brother (he&amp;#39;s 5, loves watching me play DS and even plays low level areas on my leveled characters!) I finally completed my first playthrough of DS1!  I feel like this has been such a long time coming and I&amp;#39;m so happy I was able to get into these games.  It literally took me years to finally click with them, but when it clicks (you know what that feels like) there is really no other feeling like it in gaming.  Beating certain bosses is like a drug, you get high when you finally win.  &lt;/p&gt;\n\n&lt;p&gt;After all this, I recorded my first ever fight with Gywn and this is how it went:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://youtu.be/iWlOnfCwnoo\"&gt;https://youtu.be/iWlOnfCwnoo&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I just hope more people start to give these games a chance and stick with them.  I know FROM has said DS3 is the last souls game, but I hope they just mean the Souls franchise and the style of game doesn&amp;#39;t disappear.  I&amp;#39;m still hoping for BB2, but we&amp;#39;ll see.  &lt;/p&gt;\n\n&lt;p&gt;Anyway, sorry for the history lesson, I just felt like sharing.  Life has been hard these past few months and being to play Dark Souls 1 at night before bed has been wonderful, as well as checking this subreddit.  &lt;/p&gt;\n\n&lt;p&gt;Long may the Sun shine!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is my history with the SoulsBorne games.\n\nI started with DeS when it first came out, bought it and I wanted to like it so bad.  I just couldn't dedicate myself (too hard, etc) to it.  Tower of Latria turned me off completely, never went back to it.  Got Dark Souls in 2013 for 20$ off the MS Store.  Seemed a little more accessible to me, but still, same thing.  \n\nSkipped DS 2 (I have it for PC though).  \n\nFollowed BB from the moment it was announced but NEVER watched any gameplay until the reviews hit.  Immediately went out and bought it.  Went over to my buddies house and we both loved it.  It was the atmosphere that drew me in and I loved the faster gameplay.  No shields was what did it for me.  I've always been good at games like the Ninja Gaiden series and the PS2 Shinobi (underrated game), so BB just clicked for me.  Still my favorite PS4 exclusive and I don't ever see than changing.  BB was my first souls game that I completed and holds a special place.\n\nSo after BB and watching Vaati vids for the lore, I started watching his DS3 news videos and decided I would get DS3 and hopefully have a different experience.  After playing BB, I was more than ready for DS3.  I even found it easy at some points, definitely not as hard as BB.  Have about 200 hours sunk into it and the optional boss in Ringed City is the only one I haven't solo'd.\n\nAfter DS3, I decided to go back and play the first.  Tonight, with my little brother (he's 5, loves watching me play DS and even plays low level areas on my leveled characters!) I finally completed my first playthrough of DS1!  I feel like this has been such a long time coming and I'm so happy I was able to get into these games.  It literally took me years to finally click with them, but when it clicks (you know what that feels like) there is really no other feeling like it in gaming.  Beating certain bosses is like a drug, you get high when you finally win.  \n\nAfter all this, I recorded my first ever fight with Gywn and this is how it went:\n\nhttps://youtu.be/iWlOnfCwnoo\n\nI just hope more people start to give these games a chance and stick with them.  I know FROM has said DS3 is the last souls game, but I hope they just mean the Souls franchise and the style of game doesn't disappear.  I'm still hoping for BB2, but we'll see.  \n\nAnyway, sorry for the history lesson, I just felt like sharing.  Life has been hard these past few months and being to play Dark Souls 1 at night before bed has been wonderful, as well as checking this subreddit.  \n\nLong may the Sun shine!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65gyag", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "Naz927", "saved": false, "mod_reports": [], "name": "t3_65gyag", "subreddit_name_prefixed": "r/darksouls", "approved_by": null, "over_18": false, "domain": "self.darksouls", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sazo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/darksouls/comments/65gyag/so_i_finally_have_completed_dark_souls/", "num_reports": null, "locked": false, "stickied": false, "created": 1492253857.0, "url": "https://www.reddit.com/r/darksouls/comments/65gyag/so_i_finally_have_completed_dark_souls/", "author_flair_text": null, "quarantine": false, "title": "So I finally have completed Dark Souls!", "created_utc": 1492225057.0, "distinguished": null, "media": null, "upvote_ratio": 0.7, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65gyag", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65gyag", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65gyag", "likes": null, "replies": "", "user_reports": [], "id": "dgb3gmy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Naz927", "parent_id": "t1_dgajdjg", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "I spent 3 days on them, such a good feeling to finally beat them!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I spent 3 days on them, such a good feeling to finally beat them!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgb3gmy", "score_hidden": false, "stickied": false, "created": 1492315231.0, "created_utc": 1492286431.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgajdjg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "App0ly0n", "parent_id": "t1_dga7qcn", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "DS1 was one of the games for gold offers on 360 a few years back, that's when I got it. But like OP I just couldn't get into it. Couple of years went past and I tried again, still no dice. \n\nThen, for some strange reason, decided to get DS2 on PS4 and, despite struggling a bit initially, I loved it. So after 150 hours of that I decided to try and get back into DS1. And here I am in Anor Londo getting my ass handed to me by Ornstein and Smough. \n\nThat Soulsborne series is just phenomenal, but I guess it just takes some of us a while to realise that.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;DS1 was one of the games for gold offers on 360 a few years back, that&amp;#39;s when I got it. But like OP I just couldn&amp;#39;t get into it. Couple of years went past and I tried again, still no dice. &lt;/p&gt;\n\n&lt;p&gt;Then, for some strange reason, decided to get DS2 on PS4 and, despite struggling a bit initially, I loved it. So after 150 hours of that I decided to try and get back into DS1. And here I am in Anor Londo getting my ass handed to me by Ornstein and Smough. &lt;/p&gt;\n\n&lt;p&gt;That Soulsborne series is just phenomenal, but I guess it just takes some of us a while to realise that.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgajdjg", "score_hidden": false, "stickied": false, "created": 1492282903.0, "created_utc": 1492254103.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65gyag", "likes": null, "replies": "", "user_reports": [], "id": "dgb3n64", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Naz927", "parent_id": "t1_dga7qcn", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "Awesome to hear people with similar stories, I'm sure there are many out there!  I want to play DS2 now, and call me crazy but I'm playing the regular version with all DLC and not SotFS.  I had Scholar twice for PS4 and both times couldn't get into it.  I just watched LobosJr's playthrough of the regular DS2 and I decided to go with that!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome to hear people with similar stories, I&amp;#39;m sure there are many out there!  I want to play DS2 now, and call me crazy but I&amp;#39;m playing the regular version with all DLC and not SotFS.  I had Scholar twice for PS4 and both times couldn&amp;#39;t get into it.  I just watched LobosJr&amp;#39;s playthrough of the regular DS2 and I decided to go with that!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgb3n64", "score_hidden": false, "stickied": false, "created": 1492315489.0, "created_utc": 1492286689.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga7qcn", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "JacobHammersley", "parent_id": "t3_65gyag", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "Hey, I'm glad these games finally clicked into place! Sometimes games (this series especially), you need to play at the right time, in the right environment, with the right motivation to keep going. It's hard to go back to something when the last thing you remember is being annoyed and so frustrated to the point where you come off.\n\nI played Dark Souls I for free (can't remember how tbh) and I just couldn't get into it from the get-go, it was so confusing, I didn't get the story, the motive, I chuckled and thought it was a joke and I had no real interest for it. So i put it back and never saw it again, until a few months passed. A year after those few months, I'm on NG+7 for DS1 with 1000/1000G on Xbox, and a completion on PC. 1000/1000G on DS2, and I'm currently on 605/1000 on DS3. All of that came from me having a long time off and thinking \"why not give it ago\" when I was bored. So I made a genuine character on DS1, got to the fir link shrine, and I never looked back.\n\nAll of my progress in the series comes from the whole \"I'll just give it some time, and try it properly\" motivation, with that I've managed to make the progress I have done, which is incomparable to any other series I have ever played. This game is built on your patience, your willingness to try properly and to accept that you can make progress. It is an incredible game series, and I'm glad you found a similar journey!\n\nMay the flames guide thee 🔥", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, I&amp;#39;m glad these games finally clicked into place! Sometimes games (this series especially), you need to play at the right time, in the right environment, with the right motivation to keep going. It&amp;#39;s hard to go back to something when the last thing you remember is being annoyed and so frustrated to the point where you come off.&lt;/p&gt;\n\n&lt;p&gt;I played Dark Souls I for free (can&amp;#39;t remember how tbh) and I just couldn&amp;#39;t get into it from the get-go, it was so confusing, I didn&amp;#39;t get the story, the motive, I chuckled and thought it was a joke and I had no real interest for it. So i put it back and never saw it again, until a few months passed. A year after those few months, I&amp;#39;m on NG+7 for DS1 with 1000/1000G on Xbox, and a completion on PC. 1000/1000G on DS2, and I&amp;#39;m currently on 605/1000 on DS3. All of that came from me having a long time off and thinking &amp;quot;why not give it ago&amp;quot; when I was bored. So I made a genuine character on DS1, got to the fir link shrine, and I never looked back.&lt;/p&gt;\n\n&lt;p&gt;All of my progress in the series comes from the whole &amp;quot;I&amp;#39;ll just give it some time, and try it properly&amp;quot; motivation, with that I&amp;#39;ve managed to make the progress I have done, which is incomparable to any other series I have ever played. This game is built on your patience, your willingness to try properly and to accept that you can make progress. It is an incredible game series, and I&amp;#39;m glad you found a similar journey!&lt;/p&gt;\n\n&lt;p&gt;May the flames guide thee 🔥&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dga7qcn", "score_hidden": false, "stickied": false, "created": 1492255326.0, "created_utc": 1492226526.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65gyag", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65gyag", "likes": null, "replies": "", "user_reports": [], "id": "dgb3iaf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Naz927", "parent_id": "t1_dgaekir", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "DS2 is next, I'm trying to figure out the best settings to play it on my Macbook with a couple mods.  DeS I'd love to but no PS3 ATM.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;DS2 is next, I&amp;#39;m trying to figure out the best settings to play it on my Macbook with a couple mods.  DeS I&amp;#39;d love to but no PS3 ATM.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgb3iaf", "score_hidden": false, "stickied": false, "created": 1492315295.0, "created_utc": 1492286495.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaekir", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "The_Legend120", "parent_id": "t3_65gyag", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "Good job, skeleton!\n\nYou have two games left: DeS and DS2. Go play them, both are kinda similar in gameplay IMO.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good job, skeleton!&lt;/p&gt;\n\n&lt;p&gt;You have two games left: DeS and DS2. Go play them, both are kinda similar in gameplay IMO.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgaekir", "score_hidden": false, "stickied": false, "created": 1492268461.0, "created_utc": 1492239661.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]