[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "darksouls", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(this also applies to DS2 and 3 but posting here as it&amp;#39;s the first proper Souls game)&lt;/p&gt;\n\n&lt;p&gt;So, tell me about your very first experience with Dark Souls and what weapon you mained, and what your favourite game is.&lt;/p&gt;\n\n&lt;p&gt;Mine was after my friend forced the game on me and I tried to play it, and absolutely despised it. It was too difficult, not fair, stupid. Called it every name under the sun. Took me about 10 hours to reach the Gargoyles which I couldn&amp;#39;t beat then I gave up.&lt;/p&gt;\n\n&lt;p&gt;UNTIL&lt;/p&gt;\n\n&lt;p&gt;My friend then forced DS2 on me, which I tried, and played and played until I hit the ceiling, my player ceiling, in which I stopped being lucky and started getting skilled in rolls and timing, and attacking. Rolled through the rest of DS2 with more ease. Then I played DS3 and smashed that, adore the game, then I smashed DS1 and wrecked through it. Now it&amp;#39;s my favourite game series of all time.&lt;/p&gt;\n\n&lt;p&gt;DS1: Black Knight Greatsword\nDS2: Twin Bastard Swords\nDS3: Exile Greatsword&lt;/p&gt;\n\n&lt;p&gt;Favourite game in the series is definitely DS3 though. That&amp;#39;s my hunting ground.&lt;/p&gt;\n\n&lt;p&gt;GO.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "(this also applies to DS2 and 3 but posting here as it's the first proper Souls game)\n\nSo, tell me about your very first experience with Dark Souls and what weapon you mained, and what your favourite game is.\n\nMine was after my friend forced the game on me and I tried to play it, and absolutely despised it. It was too difficult, not fair, stupid. Called it every name under the sun. Took me about 10 hours to reach the Gargoyles which I couldn't beat then I gave up.\n\nUNTIL\n\nMy friend then forced DS2 on me, which I tried, and played and played until I hit the ceiling, my player ceiling, in which I stopped being lucky and started getting skilled in rolls and timing, and attacking. Rolled through the rest of DS2 with more ease. Then I played DS3 and smashed that, adore the game, then I smashed DS1 and wrecked through it. Now it's my favourite game series of all time.\n\nDS1: Black Knight Greatsword\nDS2: Twin Bastard Swords\nDS3: Exile Greatsword\n\nFavourite game in the series is definitely DS3 though. That's my hunting ground.\n\nGO.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65opo3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 18, "report_reasons": null, "author": "ajperry1995", "saved": false, "mod_reports": [], "name": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "approved_by": null, "over_18": false, "domain": "self.darksouls", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sazo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/darksouls/comments/65opo3/your_first_souls_experience/", "num_reports": null, "locked": false, "stickied": false, "created": 1492371570.0, "url": "https://www.reddit.com/r/darksouls/comments/65opo3/your_first_souls_experience/", "author_flair_text": null, "quarantine": false, "title": "Your First Souls Experience", "created_utc": 1492342770.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgbye5e", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Timboron", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "Don't even know anymore why I started DS1. Was really intrigued at the very beginning and went straight to the graveyard (\"DS is supposed to be hard, this has to be the right path\"). Discovered Undead Burg a few hours later and gave up a few days later because I could not handle Taurus Demon or the Black Knight. Came back a few weeks later and ... never stopped since then. The world design and atmosphere completely hooked me. My favourite gaming moment ever has to be finding the shortcut from Blighttown up to Firelink Shrine again and hearing Firelink's soundtrack after dozen of hours in the hell of the Depths and Blighttown ... only to notice a few seconds later that the Firekeeper was not there anymore.\n\nDidn't like DS2 that much, rushed through it once (with dlc) in 50 hours. Couldn't wait for DS3 (and the recent dlcs) and loved it (and I really liked The Ringed City as closure to the series) but Dark Souls is still (and probably will always be) my favorite game ever.\n\nWeapons: DS1 Iaito/Great Scythe, DS2 Greatsword, DS3 Friede's Great Scythe ", "edited": 1492346444.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t even know anymore why I started DS1. Was really intrigued at the very beginning and went straight to the graveyard (&amp;quot;DS is supposed to be hard, this has to be the right path&amp;quot;). Discovered Undead Burg a few hours later and gave up a few days later because I could not handle Taurus Demon or the Black Knight. Came back a few weeks later and ... never stopped since then. The world design and atmosphere completely hooked me. My favourite gaming moment ever has to be finding the shortcut from Blighttown up to Firelink Shrine again and hearing Firelink&amp;#39;s soundtrack after dozen of hours in the hell of the Depths and Blighttown ... only to notice a few seconds later that the Firekeeper was not there anymore.&lt;/p&gt;\n\n&lt;p&gt;Didn&amp;#39;t like DS2 that much, rushed through it once (with dlc) in 50 hours. Couldn&amp;#39;t wait for DS3 (and the recent dlcs) and loved it (and I really liked The Ringed City as closure to the series) but Dark Souls is still (and probably will always be) my favorite game ever.&lt;/p&gt;\n\n&lt;p&gt;Weapons: DS1 Iaito/Great Scythe, DS2 Greatsword, DS3 Friede&amp;#39;s Great Scythe &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgbye5e", "score_hidden": false, "stickied": false, "created": 1492372426.0, "created_utc": 1492343626.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgc4885", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Aredhel_22", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "I was watching my friend playing dark souls and I loved it. Then I bought it myself and started to play on my own. Because of that I know how to fight some enemies. I remember that I died like 7 times on Asylum Demon, 10 times on Capra and Taurus, then about 30 times on gargoyles (didn't know that you can summon Solaire). But the biggest problem for me was Quelaag. I didn't know how to roll throught her attacks and I stopped playing for like a year. Then I read some lore and got hyped because of it and finished the game. It took me about 100 hours, 400 deaths and I was using estoc +15 green grass shield and anastacia armor.\n\nI wish i could play more DS games, but I've got an old laptop. I hope I will have chance to play the rest in the future!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was watching my friend playing dark souls and I loved it. Then I bought it myself and started to play on my own. Because of that I know how to fight some enemies. I remember that I died like 7 times on Asylum Demon, 10 times on Capra and Taurus, then about 30 times on gargoyles (didn&amp;#39;t know that you can summon Solaire). But the biggest problem for me was Quelaag. I didn&amp;#39;t know how to roll throught her attacks and I stopped playing for like a year. Then I read some lore and got hyped because of it and finished the game. It took me about 100 hours, 400 deaths and I was using estoc +15 green grass shield and anastacia armor.&lt;/p&gt;\n\n&lt;p&gt;I wish i could play more DS games, but I&amp;#39;ve got an old laptop. I hope I will have chance to play the rest in the future!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgc4885", "score_hidden": false, "stickied": false, "created": 1492383644.0, "created_utc": 1492354844.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgc2rhx", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Magreiner", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "My first souls game was DS1. I don't even know why I started to play DS1 though. I got into the series pretty late (early 2015) but initially I was really looking forward to Witcher 3 on my new PC. I played and really liked Witcher 3 but one day - for some reason - I just bought DS1 on steam and played it for a bit. And I couldn't stop playing it anymore. I genuinly loved it. Of course it was a bit challenging at the start but after a few hours you learn the basic strategies and after that the only thing you really need is patience. Beat O&amp;S on my first try (probably because everyone told me they were supposed to be super hard and I was really cautious because of that) and finished DS1 after like 120 hours (also collected  every weapon, spells and armor afterward). \nAfter that I went on and played Bloodborne, had a lot of problems with the beginning section and stopped playing it. Instead I started Dark Souls 2 (Sotfs) and didn't like it as much as the first one. Didn't stop me from playing it for 300 hours + though. After that I gave Bloodborne another chance and I loved it after I got past the beginning. I went on and also played Demon's Souls and lastly Dark Souls 3. \nI love them all almost equally (Bloodborne and Demon's Souls are probably my favs though, after that DS1 and DS3, DS2 the least).\n\nWeapons: DS1 Claymore, Bloodborne Kirkhammer, DS2 Fire Longsword/ Greatsword, Demon's Souls Claymore/BBS, DS3 FUGS\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My first souls game was DS1. I don&amp;#39;t even know why I started to play DS1 though. I got into the series pretty late (early 2015) but initially I was really looking forward to Witcher 3 on my new PC. I played and really liked Witcher 3 but one day - for some reason - I just bought DS1 on steam and played it for a bit. And I couldn&amp;#39;t stop playing it anymore. I genuinly loved it. Of course it was a bit challenging at the start but after a few hours you learn the basic strategies and after that the only thing you really need is patience. Beat O&amp;amp;S on my first try (probably because everyone told me they were supposed to be super hard and I was really cautious because of that) and finished DS1 after like 120 hours (also collected  every weapon, spells and armor afterward). \nAfter that I went on and played Bloodborne, had a lot of problems with the beginning section and stopped playing it. Instead I started Dark Souls 2 (Sotfs) and didn&amp;#39;t like it as much as the first one. Didn&amp;#39;t stop me from playing it for 300 hours + though. After that I gave Bloodborne another chance and I loved it after I got past the beginning. I went on and also played Demon&amp;#39;s Souls and lastly Dark Souls 3. \nI love them all almost equally (Bloodborne and Demon&amp;#39;s Souls are probably my favs though, after that DS1 and DS3, DS2 the least).&lt;/p&gt;\n\n&lt;p&gt;Weapons: DS1 Claymore, Bloodborne Kirkhammer, DS2 Fire Longsword/ Greatsword, Demon&amp;#39;s Souls Claymore/BBS, DS3 FUGS&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgc2rhx", "score_hidden": false, "stickied": false, "created": 1492381399.0, "created_utc": 1492352599.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgc3ral", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ArikadoX", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "I started it when I realized I had it on the shelf, my brother brought it home one day and just left it there. This was maybe in 2014 or 2013, a few years ago. I didn't expect to get hooked playing it but I did. And shortly after starting it I was in class and then the last person I thought would've played dark souls says he knows the game like the back of his hand after I somehow brought up dark souls, and I was so shocked lol. after that I used his help/guidance whenever I needed it. I still remember that he was the one who opened my eyes to the very first shortcut which was the ladder you could kick down above that undead burg bonfire. and he told me about the merchant (who i'd discovered on my own) dropping the uchi after I kill him so I bought everything he has, killed him for the uchi, and then used it for the rest of my playthrough! I believe I took a break of maybe a couple weeks-a month after getting deep into blighttown from the depth entrance though, it was really annoying. but my friend was also the one who pointed out the mill shortcut lol.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I started it when I realized I had it on the shelf, my brother brought it home one day and just left it there. This was maybe in 2014 or 2013, a few years ago. I didn&amp;#39;t expect to get hooked playing it but I did. And shortly after starting it I was in class and then the last person I thought would&amp;#39;ve played dark souls says he knows the game like the back of his hand after I somehow brought up dark souls, and I was so shocked lol. after that I used his help/guidance whenever I needed it. I still remember that he was the one who opened my eyes to the very first shortcut which was the ladder you could kick down above that undead burg bonfire. and he told me about the merchant (who i&amp;#39;d discovered on my own) dropping the uchi after I kill him so I bought everything he has, killed him for the uchi, and then used it for the rest of my playthrough! I believe I took a break of maybe a couple weeks-a month after getting deep into blighttown from the depth entrance though, it was really annoying. but my friend was also the one who pointed out the mill shortcut lol.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgc3ral", "score_hidden": false, "stickied": false, "created": 1492382934.0, "created_utc": 1492354134.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgca0f9", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Welded1", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "My friend tells me it's a good game and goes on sale for 10 bucks so I get it. Struggled my way to ornstein and smough with no summons because I didn't know you had to use humanity to summon people.\n Tried for weeks to kill o+s and eventually gave up. 2 years later another friend gets me back into it and I finaly beat o+s since I figured out how to summon people and the rest of the game was pretty easy after all of that glad I got back into it and now I'm working through ds3.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My friend tells me it&amp;#39;s a good game and goes on sale for 10 bucks so I get it. Struggled my way to ornstein and smough with no summons because I didn&amp;#39;t know you had to use humanity to summon people.\n Tried for weeks to kill o+s and eventually gave up. 2 years later another friend gets me back into it and I finaly beat o+s since I figured out how to summon people and the rest of the game was pretty easy after all of that glad I got back into it and now I&amp;#39;m working through ds3.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgca0f9", "score_hidden": false, "stickied": false, "created": 1492391458.0, "created_utc": 1492362658.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgc6ww5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Heigou", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "I think I used the elite knight armor along with the uchigatana, cause I've read that weapon was good. Didn't find the entrance to the aqueduct and went to the graveyard and new londo first, before checking a guide and feelign dumb.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think I used the elite knight armor along with the uchigatana, cause I&amp;#39;ve read that weapon was good. Didn&amp;#39;t find the entrance to the aqueduct and went to the graveyard and new londo first, before checking a guide and feelign dumb.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgc6ww5", "score_hidden": false, "stickied": false, "created": 1492387382.0, "created_utc": 1492358582.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgc8fvo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Phunterrrrr", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "Played DS1 for about 20 hours. Heavy armor and a halberd. Beat gargoyles and capra but then couldn't figure out where to go next. Wandered around Darkroot for way too long. Then I quit because I was tired of wandering. Basically assumed the game wasn't for me.\n\nI picked it up again much later after someone showed me a map of Undead Burg and I saw I missed the staircase to The Depths. Also learned the beauty of fast rolling. I have 6 characters now for a bunch of different builds!\n\nI really like the zwei. So much that I try not to use it anymore. I want to be good with other weapons too and say I beat DS without needing it.\n\nMy most memorable moment was during my first full run when I finished off super Ornstein with a longbow shot while having no estus and basically 1 hp.\n", "edited": 1492360884.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Played DS1 for about 20 hours. Heavy armor and a halberd. Beat gargoyles and capra but then couldn&amp;#39;t figure out where to go next. Wandered around Darkroot for way too long. Then I quit because I was tired of wandering. Basically assumed the game wasn&amp;#39;t for me.&lt;/p&gt;\n\n&lt;p&gt;I picked it up again much later after someone showed me a map of Undead Burg and I saw I missed the staircase to The Depths. Also learned the beauty of fast rolling. I have 6 characters now for a bunch of different builds!&lt;/p&gt;\n\n&lt;p&gt;I really like the zwei. So much that I try not to use it anymore. I want to be good with other weapons too and say I beat DS without needing it.&lt;/p&gt;\n\n&lt;p&gt;My most memorable moment was during my first full run when I finished off super Ornstein with a longbow shot while having no estus and basically 1 hp.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgc8fvo", "score_hidden": false, "stickied": false, "created": 1492389427.0, "created_utc": 1492360627.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgc96vy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ohb9", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "     Technically, my first was Dark Souls 1. I picked it up on sale. Picked warrior and went some sort of quality build, and steamrolled through the early game. Unfortunately, Anor Londo destroyed me. I hadn't learned how to roll and I quit at O&amp;S. During my short time playing, I \"mained\" the Claymore.\n     Then, I learned of SOTFS years later. I wanted to revisit the series but I was bitter about my experience with 1, so I moved on to 2. SOTFS did the trick for me. I built quality again and encountered an old friend that stayed with me to the end, the Claymore. I scoured every area, including the DLC and by the end of my first playthrough, I had clocked in 100 hours. \n     Now I've returned to Dks1 and I'm really enjoying it. All I have left is the DLC and Gwyn :)\n     ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;pre&gt;&lt;code&gt; Technically, my first was Dark Souls 1. I picked it up on sale. Picked warrior and went some sort of quality build, and steamrolled through the early game. Unfortunately, Anor Londo destroyed me. I hadn&amp;#39;t learned how to roll and I quit at O&amp;amp;S. During my short time playing, I &amp;quot;mained&amp;quot; the Claymore.\n Then, I learned of SOTFS years later. I wanted to revisit the series but I was bitter about my experience with 1, so I moved on to 2. SOTFS did the trick for me. I built quality again and encountered an old friend that stayed with me to the end, the Claymore. I scoured every area, including the DLC and by the end of my first playthrough, I had clocked in 100 hours. \n Now I&amp;#39;ve returned to Dks1 and I&amp;#39;m really enjoying it. All I have left is the DLC and Gwyn :)\n&lt;/code&gt;&lt;/pre&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgc96vy", "score_hidden": false, "stickied": false, "created": 1492390403.0, "created_utc": 1492361603.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgc9dgc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "cosplay_noob", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "DS1 is my first souls game and I'm still playing it. I admit I watched a guide on how to beat ceaseless discharge.. but other than that I'm trying to beat the game on my own. I made a bunch of mistakes during the game but I guess that's kind of the point? Maybe? Coming out of blighttown back to firelink shrine I found the firekeeper to be dead and I couldn't use the bonfire. Still no idea if it's part of the game or another played invaded my world and fucked me up. That's how much of a noob I am. I'm playing mainly with shield and the broad sword. Used the zwei in a couple of occasions. Really looking forward to playing the game again with a different build and weapons, and playing the other games in the series. Amazing fucking game and I feel like it ruined other games for me. Well, at least other third person action games. I haven't been so much into a game since Mass Effect 2 and Portal 2 I think, with the exception that Dark Souls is both longer than those two, and you think about it even when you're not playing..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;DS1 is my first souls game and I&amp;#39;m still playing it. I admit I watched a guide on how to beat ceaseless discharge.. but other than that I&amp;#39;m trying to beat the game on my own. I made a bunch of mistakes during the game but I guess that&amp;#39;s kind of the point? Maybe? Coming out of blighttown back to firelink shrine I found the firekeeper to be dead and I couldn&amp;#39;t use the bonfire. Still no idea if it&amp;#39;s part of the game or another played invaded my world and fucked me up. That&amp;#39;s how much of a noob I am. I&amp;#39;m playing mainly with shield and the broad sword. Used the zwei in a couple of occasions. Really looking forward to playing the game again with a different build and weapons, and playing the other games in the series. Amazing fucking game and I feel like it ruined other games for me. Well, at least other third person action games. I haven&amp;#39;t been so much into a game since Mass Effect 2 and Portal 2 I think, with the exception that Dark Souls is both longer than those two, and you think about it even when you&amp;#39;re not playing..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgc9dgc", "score_hidden": false, "stickied": false, "created": 1492390623.0, "created_utc": 1492361823.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgcaatc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SummoningSickness", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "I had heard good things about DS1 and that it was challenging which was what I was looking for at the time. I didn't want to look at a lot of spoilers but after beating the Asylum Demon I saw that you could get a special weapon for killing him before getting your sword. So I restarted with black firebombs as my item just to get the weapon which I never actually used. Took me a month before I beat the Tauren Demon. I was fucking determined to get good and I eventually did it. Rest of the game went more smoothly. Capra was a bitch of course. Archers set me back. O&amp;S took me forever. I think I used the black knight sword for most of that playthrough. Got it early. I used a lot of pyromancy as well. Only boss I never beat was Kalameet and I am looking forward to that boss on my current playthrough where I 1 shot O&amp;S.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had heard good things about DS1 and that it was challenging which was what I was looking for at the time. I didn&amp;#39;t want to look at a lot of spoilers but after beating the Asylum Demon I saw that you could get a special weapon for killing him before getting your sword. So I restarted with black firebombs as my item just to get the weapon which I never actually used. Took me a month before I beat the Tauren Demon. I was fucking determined to get good and I eventually did it. Rest of the game went more smoothly. Capra was a bitch of course. Archers set me back. O&amp;amp;S took me forever. I think I used the black knight sword for most of that playthrough. Got it early. I used a lot of pyromancy as well. Only boss I never beat was Kalameet and I am looking forward to that boss on my current playthrough where I 1 shot O&amp;amp;S.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgcaatc", "score_hidden": false, "stickied": false, "created": 1492391837.0, "created_utc": 1492363037.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgcfk5b", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "FullMetalBiscuit", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "I avoided the series for ages, just due to a lack of interest I guess. I saw [this trailer](https://www.youtube.com/watch?v=fETc77XokxE) for DS3, that being the first full trailer that I had watched, and then I went and bought DS2. Played through the starting area thinking it was fairly meh, then I got to Majula and that was that. Hooked from that point on. The music, the scenery and the atmosphere blew me away. 54 hours later and I finished DS2! I then tried to play DS1, didn't know that DSfix was a thing and disregarded it as a crappy port and moved onto DS3. Finished Dark Souls 3, craved more and found out about DSfix. Happy times. Then I get to Anor Londo and think to myself, \"this seems oddly familiar\". Then it hits me and I regret not looking up fixes for DS1 prior to playing DS3. \n\nAnd now I need a PS4 for Bloodborne.\n\nDS1 main weapon was the silver knight sword and shield, DS2 was the Pursuer Great Sword and Dragonrider Bow and DS3 was the Wolf Knight Greatsword.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I avoided the series for ages, just due to a lack of interest I guess. I saw &lt;a href=\"https://www.youtube.com/watch?v=fETc77XokxE\"&gt;this trailer&lt;/a&gt; for DS3, that being the first full trailer that I had watched, and then I went and bought DS2. Played through the starting area thinking it was fairly meh, then I got to Majula and that was that. Hooked from that point on. The music, the scenery and the atmosphere blew me away. 54 hours later and I finished DS2! I then tried to play DS1, didn&amp;#39;t know that DSfix was a thing and disregarded it as a crappy port and moved onto DS3. Finished Dark Souls 3, craved more and found out about DSfix. Happy times. Then I get to Anor Londo and think to myself, &amp;quot;this seems oddly familiar&amp;quot;. Then it hits me and I regret not looking up fixes for DS1 prior to playing DS3. &lt;/p&gt;\n\n&lt;p&gt;And now I need a PS4 for Bloodborne.&lt;/p&gt;\n\n&lt;p&gt;DS1 main weapon was the silver knight sword and shield, DS2 was the Pursuer Great Sword and Dragonrider Bow and DS3 was the Wolf Knight Greatsword.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgcfk5b", "score_hidden": false, "stickied": false, "created": 1492398834.0, "created_utc": 1492370034.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgcfy0e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ajperry1995", "parent_id": "t1_dgcfs70", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "I'd recommend doing 2, it's very similar to DS1, but when you get to DS3 there's so many new mechanics and the engine is upgraded so it's had to go back a step", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d recommend doing 2, it&amp;#39;s very similar to DS1, but when you get to DS3 there&amp;#39;s so many new mechanics and the engine is upgraded so it&amp;#39;s had to go back a step&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgcfy0e", "score_hidden": false, "stickied": false, "created": 1492399344.0, "created_utc": 1492370544.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcfs70", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "h3rpad3rp", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "My first experience was about two years ago with DS1. I got it on sale from steam. \n\nI loaded it up, and walked over to the cemetery where I got absolutely destroyed multiple times, then I quit. Last year I saw a lets play of it on youtube, and watched it up to O&amp;S in Anor Londo. I decided I would go back and give it another go.\n\nI've now killed all the lords and I just started fighting Manus last night, so it has definitely gone better this time. I sort of wish I hadn't spoiled the first part of the game though.\n\nI switch between Qulaag's fury sword, an uchi, and pyromancy. On my offhand I use either the spider or grass crest shield.\n\nWhich would you guys recommend starting when I finish the game? I own both DS2 and 3.\n\n", "edited": 1492378476.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My first experience was about two years ago with DS1. I got it on sale from steam. &lt;/p&gt;\n\n&lt;p&gt;I loaded it up, and walked over to the cemetery where I got absolutely destroyed multiple times, then I quit. Last year I saw a lets play of it on youtube, and watched it up to O&amp;amp;S in Anor Londo. I decided I would go back and give it another go.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve now killed all the lords and I just started fighting Manus last night, so it has definitely gone better this time. I sort of wish I hadn&amp;#39;t spoiled the first part of the game though.&lt;/p&gt;\n\n&lt;p&gt;I switch between Qulaag&amp;#39;s fury sword, an uchi, and pyromancy. On my offhand I use either the spider or grass crest shield.&lt;/p&gt;\n\n&lt;p&gt;Which would you guys recommend starting when I finish the game? I own both DS2 and 3.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgcfs70", "score_hidden": false, "stickied": false, "created": 1492399128.0, "created_utc": 1492370328.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgcg625", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TheClash15", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "DS3, never played a souls game, no idea where to go, used a claymore until I killed creighton and used his axe raw, had no idea about scaling and had like 40 Vig, 20 Str, 20 Dex, and like 20 end", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;DS3, never played a souls game, no idea where to go, used a claymore until I killed creighton and used his axe raw, had no idea about scaling and had like 40 Vig, 20 Str, 20 Dex, and like 20 end&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgcg625", "score_hidden": false, "stickied": false, "created": 1492399642.0, "created_utc": 1492370842.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgcoetc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Killroy118", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "Super originally was me fucking around on DS1 on my friend's PC about a year before I got it, after that I decided on a whim to get it during a steam sale when it was 5 bucks.  My friend played through it with me as I did a dex/faith build.  I didn't use shields very often and as a consequence, am very good at roll timings today.  I also should note that when I say my friend played through it with me, he only did so for a while.  He stopped playing(because DS3 had come out) just before we got to Manus, and hooo boy, that experience is one of my favorite in my gaming life.  30+ attempts, and the successful one was flawless: I didn't get hit once.  So satisfying.  Mained the Great Scythe, which is a total beast in DS1.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Super originally was me fucking around on DS1 on my friend&amp;#39;s PC about a year before I got it, after that I decided on a whim to get it during a steam sale when it was 5 bucks.  My friend played through it with me as I did a dex/faith build.  I didn&amp;#39;t use shields very often and as a consequence, am very good at roll timings today.  I also should note that when I say my friend played through it with me, he only did so for a while.  He stopped playing(because DS3 had come out) just before we got to Manus, and hooo boy, that experience is one of my favorite in my gaming life.  30+ attempts, and the successful one was flawless: I didn&amp;#39;t get hit once.  So satisfying.  Mained the Great Scythe, which is a total beast in DS1.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgcoetc", "score_hidden": false, "stickied": false, "created": 1492410409.0, "created_utc": 1492381609.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgcbhdl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ChiefDutt", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "First time I had a friend recommend it to me. And by that I basically mean that he based our friendship on me playing it. I picked up the iato eventually and decided that was my favorite weapon, till I upgraded it to the chaos blade. That sword is amazing. Got all the way to Gwyn and then graduated college and didn't see the guy who's ps3 I had been playing anymore.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First time I had a friend recommend it to me. And by that I basically mean that he based our friendship on me playing it. I picked up the iato eventually and decided that was my favorite weapon, till I upgraded it to the chaos blade. That sword is amazing. Got all the way to Gwyn and then graduated college and didn&amp;#39;t see the guy who&amp;#39;s ps3 I had been playing anymore.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgcbhdl", "score_hidden": false, "stickied": false, "created": 1492393398.0, "created_utc": 1492364598.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgcwftt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "iambiglucas", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "First playthrough, got lucky and got the black knight sword from the BK in undead burg. Burned through the game, after I'm thinking, \"well that was pretty easy\". On the next round, I still hadn't found the very large ember, only the large. It was... different... without the bk sword.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First playthrough, got lucky and got the black knight sword from the BK in undead burg. Burned through the game, after I&amp;#39;m thinking, &amp;quot;well that was pretty easy&amp;quot;. On the next round, I still hadn&amp;#39;t found the very large ember, only the large. It was... different... without the bk sword.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgcwftt", "score_hidden": false, "stickied": false, "created": 1492421234.0, "created_utc": 1492392434.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sazo", "removal_reason": null, "link_id": "t3_65opo3", "likes": null, "replies": "", "user_reports": [], "id": "dgdcnqg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aktivb", "parent_id": "t3_65opo3", "subreddit_name_prefixed": "r/darksouls", "controversiality": 0, "body": "DS1: Got it recommended from a friend. Played through it in 2014 and thought it had a very solid core, but was a bit all over the place. DLC made it great. Weapons first PT was Astora SS pre AL, Demon's Spear after.\n\nDS2: Was aware of its reputation, but didn't know any details, wanted to play blind. Played SOFTS, too boring to finish. Weapons was Winged Spear, Old Knight Halberd (?) and Greatsword on rotation.\n\nDS3: Played DS3 from launch. Best in the series, From's technical and polished greatest hits album. Weapons first PT was Uchi and Great Scythe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;DS1: Got it recommended from a friend. Played through it in 2014 and thought it had a very solid core, but was a bit all over the place. DLC made it great. Weapons first PT was Astora SS pre AL, Demon&amp;#39;s Spear after.&lt;/p&gt;\n\n&lt;p&gt;DS2: Was aware of its reputation, but didn&amp;#39;t know any details, wanted to play blind. Played SOFTS, too boring to finish. Weapons was Winged Spear, Old Knight Halberd (?) and Greatsword on rotation.&lt;/p&gt;\n\n&lt;p&gt;DS3: Played DS3 from launch. Best in the series, From&amp;#39;s technical and polished greatest hits album. Weapons first PT was Uchi and Great Scythe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "darksouls", "name": "t1_dgdcnqg", "score_hidden": false, "stickied": false, "created": 1492455062.0, "created_utc": 1492426262.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]