[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "asoiaf", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In AFFC, it is revealed that Doran Martell is not merely a weak old man, but in fact driven by the desire for revenge and has a master plan to achieve it. All this time, he has secretly being planning the downfall of the Lannisters. In fact his Fire and Blood speech is viewed by many readers as one of the best parts of AFFC. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Vengeance.&amp;quot; His voice was soft, as if he were afraid that someone might be listening. &amp;quot;Justice.&amp;quot; Prince Doran pressed the onyx dragon into her palm with his swollen, gouty fingers, and whispered, &amp;quot;Fire and blood.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He certainly views himself as a scheming chessmaster, carefully bringing the pieces together before he strikes. Many on this sub agree with this view and he&amp;#39;s surprisingly popular.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“I am not blind, nor deaf. I know that you all believe me weak, frightened, feeble. Your father knew me better. Oberyn was ever the viper. Deadly, dangerous, unpredictable. No man dared tread on him. I was the grass. Pleasant, complaisant, sweet-smelling, swaying with every breeze. Who fears to walk upon the grass? But it is the grass that hides the viper from his enemies and shelters him until he strikes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;However, the fundamental problem I have is that none of Doran&amp;#39;s words are backed up by action. Sure, he talks as if he has a master plan he has been following for years and maybe he believes it, but there&amp;#39;s no evidence for this. Let&amp;#39;s look at what he did and didn&amp;#39;t do as part of his &amp;quot;plan&amp;quot; and see if it really holds up.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;It began when his sister &lt;strong&gt;Elia was murdered&lt;/strong&gt;. Doran realised that Dorne couldn&amp;#39;t stand alone against the rebels, so he swore loyalty to Robert and began to bide his time. So far, so good, this is all reasonable.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;However, Doran doesn&amp;#39;t actually do anything over the next couple of years to get revenge. &lt;strong&gt;He made no attempt to undermine Robert&amp;#39;s regime&lt;/strong&gt;, never tried to turn other lords against him and the Lannisters. He made no alliances and never tried to get friends into influential places (or make friends out of those already there). The Starks have a rivalry with the Lannisters, why not build a friendship? Open rebellion is out of the question, but what about covert assassination (of say, the Mountain) or sabotage?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When &lt;strong&gt;the Greyjoys rebelled and attacked the Lannisters&lt;/strong&gt;, Doran again did nothing. If he was plotting revenge, this was an opportunity. His foe was being attacked and the loyalty of the other lords was in doubt (that was what sparked the rebellion). The rebellion was probably doomed to failure, but that might not have been clear at the time. At the time Doran didn&amp;#39;t know if he would ever get a better chance at revenge, yet he let he let the opportunity slip through his grasp.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Doran never helped Dany and Viserys&lt;/strong&gt; while they were homeless and hunted by assassins. That was when they truly needed major support, yet Doran did nothing. The marriage pact didn&amp;#39;t help them at all, in fact they didn&amp;#39;t even know it existed. Why make the pact and then ignore it for years? It&amp;#39;s sheer luck that Dany is still alive and that&amp;#39;s no thanks to Doran.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Doran did nothing during the War of Five Kings&lt;/strong&gt;. This is my biggest gripe on the list. For this reason alone the Fire and Blood speech was empty words to me. There couldn&amp;#39;t have been a better opportunity for revenge. You couldn&amp;#39;t dream up a better chance. The kingdom had collapsed, almost every major lord was going their own way such that not rebelling was more unusual than rebellion. The Lannisters were isolated and  he could strike at the them with little risk to himself.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Had Doran intervened, &lt;strong&gt;he would have changed the tide of the war&lt;/strong&gt;. He could have directly shifted the balance at the Battle of the Blackwater, or at least prevented the Tyrells from coming to the rescue. He never even tried to make contact with the Starks, the people attacking his sworn enemies. There was fire and blood and he had nothing to do with it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Quentyn had no idea what to do&lt;/strong&gt;. Doran sent him without anything to win Dany over and he basically had to wing it. They don&amp;#39;t even meet until she has already built and independent power base and much less need for Dorne. The attempted wooing was pathetic, which is mostly Doran&amp;#39;s fault.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;So in short, we have some fine words and no action to back them up. Doran had many opportunities and never took them. To miss a perfect opportunity and only plot revenge now (when the kingdom is much more peaceful). New challenges are rising, but this is pure luck and he had nothing to do with it. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Honestly, Doran is very similar to Cersei, they both think they&amp;#39;re really clever masterminds, both in reality they&amp;#39;re both fools.&lt;/strong&gt; In fact, by the time of the Fire and Blood speech, everyone involved in the murder of Elia (Amory Lorch, the Mountain, Tywin, Robert) has already died, so swearing revenge is meaningless. Doran didn&amp;#39;t have anything to do with any of the deaths, except the Mountain (but even that wasn&amp;#39;t part of his plan). After 17 years, Doran has achieved next to nothing. Not only is his plan rubbish, but the people he trusts it with are incompetent or following their own schemes, so it has even lower chance of success.&lt;/p&gt;\n\n&lt;p&gt;Perhaps in TWOW, a new part of the plan will be revealed that will shine new light and perhaps Doran will finally actually do something. Until that happens, all Doran has to offer are empty words and as we all know, &amp;quot;words are wind&amp;quot;. So far, we&amp;#39;ve seen nothing to justify the admiring Doran.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Doran&amp;#39;s plan is basically to wait for his enemies to die from old age.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "In AFFC, it is revealed that Doran Martell is not merely a weak old man, but in fact driven by the desire for revenge and has a master plan to achieve it. All this time, he has secretly being planning the downfall of the Lannisters. In fact his Fire and Blood speech is viewed by many readers as one of the best parts of AFFC. \n\n&gt; \"Vengeance.\" His voice was soft, as if he were afraid that someone might be listening. \"Justice.\" Prince Doran pressed the onyx dragon into her palm with his swollen, gouty fingers, and whispered, \"Fire and blood.\"\n\nHe certainly views himself as a scheming chessmaster, carefully bringing the pieces together before he strikes. Many on this sub agree with this view and he's surprisingly popular.\n\n&gt; “I am not blind, nor deaf. I know that you all believe me weak, frightened, feeble. Your father knew me better. Oberyn was ever the viper. Deadly, dangerous, unpredictable. No man dared tread on him. I was the grass. Pleasant, complaisant, sweet-smelling, swaying with every breeze. Who fears to walk upon the grass? But it is the grass that hides the viper from his enemies and shelters him until he strikes.\n\n________\n\nHowever, the fundamental problem I have is that none of Doran's words are backed up by action. Sure, he talks as if he has a master plan he has been following for years and maybe he believes it, but there's no evidence for this. Let's look at what he did and didn't do as part of his \"plan\" and see if it really holds up.\n\n* It began when his sister **Elia was murdered**. Doran realised that Dorne couldn't stand alone against the rebels, so he swore loyalty to Robert and began to bide his time. So far, so good, this is all reasonable.\n\n* However, Doran doesn't actually do anything over the next couple of years to get revenge. **He made no attempt to undermine Robert's regime**, never tried to turn other lords against him and the Lannisters. He made no alliances and never tried to get friends into influential places (or make friends out of those already there). The Starks have a rivalry with the Lannisters, why not build a friendship? Open rebellion is out of the question, but what about covert assassination (of say, the Mountain) or sabotage?\n\n* When **the Greyjoys rebelled and attacked the Lannisters**, Doran again did nothing. If he was plotting revenge, this was an opportunity. His foe was being attacked and the loyalty of the other lords was in doubt (that was what sparked the rebellion). The rebellion was probably doomed to failure, but that might not have been clear at the time. At the time Doran didn't know if he would ever get a better chance at revenge, yet he let he let the opportunity slip through his grasp.\n\n* **Doran never helped Dany and Viserys** while they were homeless and hunted by assassins. That was when they truly needed major support, yet Doran did nothing. The marriage pact didn't help them at all, in fact they didn't even know it existed. Why make the pact and then ignore it for years? It's sheer luck that Dany is still alive and that's no thanks to Doran.\n\n* **Doran did nothing during the War of Five Kings**. This is my biggest gripe on the list. For this reason alone the Fire and Blood speech was empty words to me. There couldn't have been a better opportunity for revenge. You couldn't dream up a better chance. The kingdom had collapsed, almost every major lord was going their own way such that not rebelling was more unusual than rebellion. The Lannisters were isolated and  he could strike at the them with little risk to himself.\n\n* Had Doran intervened, **he would have changed the tide of the war**. He could have directly shifted the balance at the Battle of the Blackwater, or at least prevented the Tyrells from coming to the rescue. He never even tried to make contact with the Starks, the people attacking his sworn enemies. There was fire and blood and he had nothing to do with it.\n\n* **Quentyn had no idea what to do**. Doran sent him without anything to win Dany over and he basically had to wing it. They don't even meet until she has already built and independent power base and much less need for Dorne. The attempted wooing was pathetic, which is mostly Doran's fault.\n\n_______________\n\nSo in short, we have some fine words and no action to back them up. Doran had many opportunities and never took them. To miss a perfect opportunity and only plot revenge now (when the kingdom is much more peaceful). New challenges are rising, but this is pure luck and he had nothing to do with it. \n\n**Honestly, Doran is very similar to Cersei, they both think they're really clever masterminds, both in reality they're both fools.** In fact, by the time of the Fire and Blood speech, everyone involved in the murder of Elia (Amory Lorch, the Mountain, Tywin, Robert) has already died, so swearing revenge is meaningless. Doran didn't have anything to do with any of the deaths, except the Mountain (but even that wasn't part of his plan). After 17 years, Doran has achieved next to nothing. Not only is his plan rubbish, but the people he trusts it with are incompetent or following their own schemes, so it has even lower chance of success.\n\nPerhaps in TWOW, a new part of the plan will be revealed that will shine new light and perhaps Doran will finally actually do something. Until that happens, all Doran has to offer are empty words and as we all know, \"words are wind\". So far, we've seen nothing to justify the admiring Doran.\n\n**Doran's plan is basically to wait for his enemies to die from old age.**", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "MAIN", "id": "64sxpv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 60, "report_reasons": null, "author": "TeoKajLibroj", "saved": false, "mod_reports": [], "name": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "approved_by": null, "over_18": false, "domain": "self.asoiaf", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2r2o9", "edited": 1491937750.0, "link_flair_css_class": "main", "author_flair_css_class": "Greyjoy", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/asoiaf/comments/64sxpv/fire_and_mud_why_doran_martell_is_all_talk_and_no/", "num_reports": null, "locked": false, "stickied": false, "created": 1491966213.0, "url": "https://www.reddit.com/r/asoiaf/comments/64sxpv/fire_and_mud_why_doran_martell_is_all_talk_and_no/", "author_flair_text": "The West Awakes", "quarantine": false, "title": "Fire and Mud: Why Doran Martell is all talk and no strategy (Spoiler Main)", "created_utc": 1491937413.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 79, "visited": false, "subreddit_type": "public", "ups": 60}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg508qr", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "popcorngirl000", "parent_id": "t1_dg4uhbh", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;It'd be kind of disappointing to find out at the end of the day that seventeen years of Doran supposedly scheming amounts to nothing more than a plan of \"Sit back, do nothing, hope a Targaryen acquires an army ready to conquer Westeros, marry Quentyn/Arianne to said Targaryen\" and then enacting the Quentyn plan in a manner almost doomed from start. \n\nIt would be doubly disappointing considering that the plot was introduced late in the series and took up much of books four and five.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;d be kind of disappointing to find out at the end of the day that seventeen years of Doran supposedly scheming amounts to nothing more than a plan of &amp;quot;Sit back, do nothing, hope a Targaryen acquires an army ready to conquer Westeros, marry Quentyn/Arianne to said Targaryen&amp;quot; and then enacting the Quentyn plan in a manner almost doomed from start. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It would be doubly disappointing considering that the plot was introduced late in the series and took up much of books four and five.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg508qr", "score_hidden": false, "stickied": false, "created": 1491977147.0, "created_utc": 1491948347.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg4vm27", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "UsernameSnatcher", "parent_id": "t1_dg4vito", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "At least, Varys. I still think he is Doran's \"friend at court\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At least, Varys. I still think he is Doran&amp;#39;s &amp;quot;friend at court&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4vm27", "score_hidden": false, "stickied": false, "created": 1491971661.0, "created_utc": 1491942861.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4vito", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "tpiddles121", "parent_id": "t1_dg4uhbh", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;  \"Sit back, do nothing, hope a Targaryen acquires an army ready to conquer Westeros,\n\nI think it's safe to assume that Doran is working with Varys and Illyrio.  He wasn't \"doing nothing\" he was scrambling to salvage the plan after several setbacks to the Dany+Drogo scheme.  First Viserys dies; then Drogo's Khalasar dissolves and Dany stumbles to Qarth with dragons; then Dany's ship to Pentos turns the wrong way into Slaver's Bay; then it seems like Dany has no intention of leaving Meereen.  It's only then that Doran takes a risk and sends Quentyn.  He's done plenty, but nothing has come to fruit yet.  I hope we see how Dorne's story develops in future books.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Sit back, do nothing, hope a Targaryen acquires an army ready to conquer Westeros,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think it&amp;#39;s safe to assume that Doran is working with Varys and Illyrio.  He wasn&amp;#39;t &amp;quot;doing nothing&amp;quot; he was scrambling to salvage the plan after several setbacks to the Dany+Drogo scheme.  First Viserys dies; then Drogo&amp;#39;s Khalasar dissolves and Dany stumbles to Qarth with dragons; then Dany&amp;#39;s ship to Pentos turns the wrong way into Slaver&amp;#39;s Bay; then it seems like Dany has no intention of leaving Meereen.  It&amp;#39;s only then that Doran takes a risk and sends Quentyn.  He&amp;#39;s done plenty, but nothing has come to fruit yet.  I hope we see how Dorne&amp;#39;s story develops in future books.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4vito", "score_hidden": false, "stickied": false, "created": 1491971557.0, "created_utc": 1491942757.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4uhbh", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "ponch653", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think that's why the notion of their being some super 8-dimensional chess-level Dornish Master Plan is appealing to a lot of people. \n\nIt'd be kind of disappointing to find out at the end of the day that seventeen years of Doran supposedly scheming amounts to nothing more than a plan of \"Sit back, do nothing, hope a Targaryen acquires an army ready to conquer Westeros, marry Quentyn/Arianne to said Targaryen\" and then enacting the Quentyn plan in a manner almost doomed from start. \n\nBut I agree that so far there isn't much backing up Doran other than his own statements. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that&amp;#39;s why the notion of their being some super 8-dimensional chess-level Dornish Master Plan is appealing to a lot of people. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;d be kind of disappointing to find out at the end of the day that seventeen years of Doran supposedly scheming amounts to nothing more than a plan of &amp;quot;Sit back, do nothing, hope a Targaryen acquires an army ready to conquer Westeros, marry Quentyn/Arianne to said Targaryen&amp;quot; and then enacting the Quentyn plan in a manner almost doomed from start. &lt;/p&gt;\n\n&lt;p&gt;But I agree that so far there isn&amp;#39;t much backing up Doran other than his own statements. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4uhbh", "score_hidden": false, "stickied": false, "created": 1491970389.0, "created_utc": 1491941589.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 39}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg4z8l5", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "tpiddles121", "parent_id": "t1_dg4ylk0", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; But they'd be under attack from all sides. The main Lannisters would be dead and the Tyrells would have little reason to keep fighting. \n\nAgain, it's not really logistically possible.  By the time he learns of Renly's death and Stannis' march on Kings Landing, it would be too late for Doran to turn the tide of the Blackwater.  By the time Dorne is marching into the Reach, the battle will be over.  That would be a huge risk with little chance of victory.  \n\n&gt;Still an improvement over Robert and still better than any of his other plans like with Quentyn.\n\nI disagree.  And remember, the Quentyn plan is a last ditch effort.  It's not as though Quentyn's sailing to Slaver's Bay was Plan A.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But they&amp;#39;d be under attack from all sides. The main Lannisters would be dead and the Tyrells would have little reason to keep fighting. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Again, it&amp;#39;s not really logistically possible.  By the time he learns of Renly&amp;#39;s death and Stannis&amp;#39; march on Kings Landing, it would be too late for Doran to turn the tide of the Blackwater.  By the time Dorne is marching into the Reach, the battle will be over.  That would be a huge risk with little chance of victory.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Still an improvement over Robert and still better than any of his other plans like with Quentyn.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I disagree.  And remember, the Quentyn plan is a last ditch effort.  It&amp;#39;s not as though Quentyn&amp;#39;s sailing to Slaver&amp;#39;s Bay was Plan A.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4z8l5", "score_hidden": false, "stickied": false, "created": 1491975909.0, "created_utc": 1491947109.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg5nt1y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Yatagurusu", "parent_id": "t1_dg5nfnl", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Yes but everyone hated the Lannisters in such a way that no one formed an alliance. Even Stannis and Renly were squabbling over something that wasnt theirs yet. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes but everyone hated the Lannisters in such a way that no one formed an alliance. Even Stannis and Renly were squabbling over something that wasnt theirs yet. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5nt1y", "score_hidden": false, "stickied": false, "created": 1492016975.0, "created_utc": 1491988175.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5nfnl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TeoKajLibroj", "parent_id": "t1_dg5j9p9", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I meant \"ally\" in the sense of having a common enemy. They would work together (or at least avoid attacking each other) to destroy the Lannisters. Maybe after that, they would turn on each other, but revenge would be achieved.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I meant &amp;quot;ally&amp;quot; in the sense of having a common enemy. They would work together (or at least avoid attacking each other) to destroy the Lannisters. Maybe after that, they would turn on each other, but revenge would be achieved.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5nfnl", "score_hidden": false, "stickied": false, "created": 1492015769.0, "created_utc": 1491986969.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5j9p9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Waramo", "parent_id": "t1_dg4ylk0", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Stannis would NEVER side with Rob. He is a pretender and flase King for him - he is stealing parts of his right. Thats why Cait is with Renly - and not with Stannis.  \nAnd Doran would not side with Stannis, he is maybe not the reason for the death of his Sister, but on the side of the murder.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stannis would NEVER side with Rob. He is a pretender and flase King for him - he is stealing parts of his right. Thats why Cait is with Renly - and not with Stannis.&lt;br/&gt;\nAnd Doran would not side with Stannis, he is maybe not the reason for the death of his Sister, but on the side of the murder.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5j9p9", "score_hidden": false, "stickied": false, "created": 1492004607.0, "created_utc": 1491975807.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ylk0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TeoKajLibroj", "parent_id": "t1_dg4xxft", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 1, "body": "&gt; The Reach has enough soldiers to destroy Dorne. Even if Stannis takes Kings Landing, the Westerlands and the Reach still have superior numbers.\n\nBut they'd be under attack from all sides. The main Lannisters would be dead and the Tyrells would have little reason to keep fighting. Instead of being small and isolated, Dorne would have two powerful allies (Robb &amp; Stannis) who also hate the Lannisters. Far better than his current situation.\n\n&gt; A man whose family was complicit with the brutal murders of Elia and her children.\n\nStill an improvement over Robert and still better than any of his other plans like with Quentyn.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The Reach has enough soldiers to destroy Dorne. Even if Stannis takes Kings Landing, the Westerlands and the Reach still have superior numbers.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But they&amp;#39;d be under attack from all sides. The main Lannisters would be dead and the Tyrells would have little reason to keep fighting. Instead of being small and isolated, Dorne would have two powerful allies (Robb &amp;amp; Stannis) who also hate the Lannisters. Far better than his current situation.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A man whose family was complicit with the brutal murders of Elia and her children.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Still an improvement over Robert and still better than any of his other plans like with Quentyn.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4ylk0", "score_hidden": false, "stickied": false, "created": 1491975139.0, "created_utc": 1491946339.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4xxft", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "tpiddles121", "parent_id": "t1_dg4xauw", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; Quentyn claims 50,000 (of course he's probably boasting)\n\nAnd Doran says it's *much* smaller than people think and he's been nursing that notion in others' heads. \n\n&gt;It could possibly be enough to threaten the Tyrells into playing defence rather than sending relief to King's Landing.\n\nAnd then what? The Reach has enough soldiers to destroy Dorne.  Even if Stannis takes Kings Landing, the Westerlands and the Reach  still have superior numbers.  Even if everything goes right, the Reach and the Westerlands fall, there's still a Baratheon on the throne. A man whose family was complicit with the brutal murders of Elia and her children.  When Dany comes with dragons, does he want to be the man who helped Stannis win the throne?  I think not.  It's better to wait until your strength is the greatest and let your enemies whittle away at each other until the time is ripe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Quentyn claims 50,000 (of course he&amp;#39;s probably boasting)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And Doran says it&amp;#39;s &lt;em&gt;much&lt;/em&gt; smaller than people think and he&amp;#39;s been nursing that notion in others&amp;#39; heads. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It could possibly be enough to threaten the Tyrells into playing defence rather than sending relief to King&amp;#39;s Landing.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And then what? The Reach has enough soldiers to destroy Dorne.  Even if Stannis takes Kings Landing, the Westerlands and the Reach  still have superior numbers.  Even if everything goes right, the Reach and the Westerlands fall, there&amp;#39;s still a Baratheon on the throne. A man whose family was complicit with the brutal murders of Elia and her children.  When Dany comes with dragons, does he want to be the man who helped Stannis win the throne?  I think not.  It&amp;#39;s better to wait until your strength is the greatest and let your enemies whittle away at each other until the time is ripe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4xxft", "score_hidden": false, "stickied": false, "created": 1491974331.0, "created_utc": 1491945531.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4xauw", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "TeoKajLibroj", "parent_id": "t1_dg4v32t", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; If the chips were down, Ned would never fight against Robert, who would inevitably side with the Lannisters.\n\nI meant politically challenge them. Not open warfare but politically outmaneuver them at court. For example, look at how Littlefinger acts and manipulates people. He is putting a plan into action, Doran is not.\n\n&gt;  If we knew exactly how many soldiers Dorne commanded you might be able to make this claim, but we don't know.\n\nQuentyn claims 50,000 (of course he's probably boasting). [GRRM has said](http://awoiaf.westeros.org/index.php/Dorne#Military_strength) it's roughly equal to the North. It could possibly be enough to threaten the Tyrells into playing defence rather than sending relief to King's Landing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If the chips were down, Ned would never fight against Robert, who would inevitably side with the Lannisters.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I meant politically challenge them. Not open warfare but politically outmaneuver them at court. For example, look at how Littlefinger acts and manipulates people. He is putting a plan into action, Doran is not.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If we knew exactly how many soldiers Dorne commanded you might be able to make this claim, but we don&amp;#39;t know.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Quentyn claims 50,000 (of course he&amp;#39;s probably boasting). &lt;a href=\"http://awoiaf.westeros.org/index.php/Dorne#Military_strength\"&gt;GRRM has said&lt;/a&gt; it&amp;#39;s roughly equal to the North. It could possibly be enough to threaten the Tyrells into playing defence rather than sending relief to King&amp;#39;s Landing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4xauw", "score_hidden": false, "stickied": false, "created": 1491973576.0, "created_utc": 1491944776.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4v32t", "gilded": 0, "archived": false, "score": 37, "report_reasons": null, "author": "tpiddles121", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think that you're failing to understand how absolutely outclassed Dorne is militarily, especially when considering that Robert's rule is built on the monstrous alliance of the North, the Vale, the Riverlands, the Westerlands and the Stormalnds.  Add onto this alliance the fact that the Lords of the Reach absolutely *hate* Dorne and you realize that Doran is shit out of luck when it comes to warfare.  His only possible ally is the Iron Islands, and they aren't large enough or rich enough to tip the scales in Doran's favor.  \n\nThere's nothing really obvious about the Starks hating the Lannisters, and trying to win the North to his side wouldn't accomplish anything. If the chips were down, Ned would never fight against Robert, who would inevitably side with the Lannisters.\n\nI agree with you on the Quentyn issue, but remember that sending Quentyn is a last ditch effort.  First Arianne was to marry Viserys and gain the Dothraki as allies.  Once Viserys is killed, he pivots and plans for Quentyn to marry Daenerys.  But when the ship arrives in Qarth to carry Dany to Pentos, she thwarts that plan by turning to Slaver's Bay.  Finally word comes to Doran that Daenerys was ruling in Meereen and there's no telling when she will sail to Westeros.  So he makes the only move he can: he sends his son on a perilous journey to bring the Last Dragon(s) home. I think he may have wanted to wait longer for Dany, but Tywin's death made him realize that he had to act immediately if he hoped to destroy the Lannisters before his own death.\n\n&gt;Had Doran intervened, he would have changed the tide of the war. He could have directly shifted the balance at the Battle of the Blackwater, or at least prevented the Tyrells from coming to the rescue. He never even tried to make contact with the Starks, the people attacking his sworn enemies. There was fire and blood and he had nothing to do with it.\n\nNot sure if I agree but this could be a good point.  If we knew exactly how many soldiers Dorne commanded you might be able to make this claim, but we don't know.  I don't think he has enough to turn the tide of the Blackwater.  Stannis doesn't have all of the might of the Stormlands, and he was up against a large portion of the army of the Westerlands and the full force of the yet unperturbed, largest kingdom that is the Reach.  I don't think the full force of Dorne would be able to make Stannis into a winner here. Besides, he couldn't logistically have known exactly when the Battle of the Blackwater would take place.  By the time news of Renly's death would have reached Doran, Stannis would already be at least halfway to Kings Landing.  He doesn't have the time to mobilize his entire army and join himself to Stannis' army.\n\nDoran's problem is that he's playing the long game in a world where chaos reigns.  He needs to do a better job of pivoting in the short-term to bring about his long-term goals, I agree, but he isn't a fool like you claim.  He knows how to play people, but there's so much out of his hands that he can't possibly hope to succeed without changing on the fly.  Luckily, the story isn't finished yet so we may see him doing this further on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that you&amp;#39;re failing to understand how absolutely outclassed Dorne is militarily, especially when considering that Robert&amp;#39;s rule is built on the monstrous alliance of the North, the Vale, the Riverlands, the Westerlands and the Stormalnds.  Add onto this alliance the fact that the Lords of the Reach absolutely &lt;em&gt;hate&lt;/em&gt; Dorne and you realize that Doran is shit out of luck when it comes to warfare.  His only possible ally is the Iron Islands, and they aren&amp;#39;t large enough or rich enough to tip the scales in Doran&amp;#39;s favor.  &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s nothing really obvious about the Starks hating the Lannisters, and trying to win the North to his side wouldn&amp;#39;t accomplish anything. If the chips were down, Ned would never fight against Robert, who would inevitably side with the Lannisters.&lt;/p&gt;\n\n&lt;p&gt;I agree with you on the Quentyn issue, but remember that sending Quentyn is a last ditch effort.  First Arianne was to marry Viserys and gain the Dothraki as allies.  Once Viserys is killed, he pivots and plans for Quentyn to marry Daenerys.  But when the ship arrives in Qarth to carry Dany to Pentos, she thwarts that plan by turning to Slaver&amp;#39;s Bay.  Finally word comes to Doran that Daenerys was ruling in Meereen and there&amp;#39;s no telling when she will sail to Westeros.  So he makes the only move he can: he sends his son on a perilous journey to bring the Last Dragon(s) home. I think he may have wanted to wait longer for Dany, but Tywin&amp;#39;s death made him realize that he had to act immediately if he hoped to destroy the Lannisters before his own death.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Had Doran intervened, he would have changed the tide of the war. He could have directly shifted the balance at the Battle of the Blackwater, or at least prevented the Tyrells from coming to the rescue. He never even tried to make contact with the Starks, the people attacking his sworn enemies. There was fire and blood and he had nothing to do with it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not sure if I agree but this could be a good point.  If we knew exactly how many soldiers Dorne commanded you might be able to make this claim, but we don&amp;#39;t know.  I don&amp;#39;t think he has enough to turn the tide of the Blackwater.  Stannis doesn&amp;#39;t have all of the might of the Stormlands, and he was up against a large portion of the army of the Westerlands and the full force of the yet unperturbed, largest kingdom that is the Reach.  I don&amp;#39;t think the full force of Dorne would be able to make Stannis into a winner here. Besides, he couldn&amp;#39;t logistically have known exactly when the Battle of the Blackwater would take place.  By the time news of Renly&amp;#39;s death would have reached Doran, Stannis would already be at least halfway to Kings Landing.  He doesn&amp;#39;t have the time to mobilize his entire army and join himself to Stannis&amp;#39; army.&lt;/p&gt;\n\n&lt;p&gt;Doran&amp;#39;s problem is that he&amp;#39;s playing the long game in a world where chaos reigns.  He needs to do a better job of pivoting in the short-term to bring about his long-term goals, I agree, but he isn&amp;#39;t a fool like you claim.  He knows how to play people, but there&amp;#39;s so much out of his hands that he can&amp;#39;t possibly hope to succeed without changing on the fly.  Luckily, the story isn&amp;#39;t finished yet so we may see him doing this further on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4v32t", "score_hidden": false, "stickied": false, "created": 1491971065.0, "created_utc": 1491942265.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 37}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg6ex9h", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "markg171", "parent_id": "t1_dg680tx", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "The castellan of Sunspear is Doran's own cousin\n\n&gt;No answer came from within the litter. Doran Martell stayed cloaked within his silken walls until the thicker walls of the castle swallowed all of them, and the portcullis came down behind them with a rattling crunch. The sounds of shouting dwindled away slowly. Princess Arianne was waiting in the outer ward to greet her father, with half the court about her: the old blind seneschal Ricasso, **Ser Manfrey Martell the castellan**, young Maester Myles with his grey robes and silky perfumed beard, twoscore of Dornish knights in flowing linen of half a hundred hues. Little Myrcella Baratheon stood with her septa and Ser Arys of the Kingsguard, sweltering in his white-enameled scales.\n\nSo I'd expect that Doran does have a man in Sunspear he trusts considering the ruler is another Martell. Manfrey should be someone loyal enough to Doran.\n\nAdditionally, but it's also possible that Manfrey is only recently the castellan of Sunspear. We aren't told when Manfrey became castellan, but it seems odd to me that Manfrey would be castellan over Oberyn, who was Doran's right hand man and privy to all their plans. Doran needs to go to the Water Gardens, but that doesn't mean that Oberyn needs to follow him there. Oberyn is perfectly capable of ruling in Sunspear for Doran, and passing along the relevant messages to the Water Gardens.\n\nIn fact I'd almost argue that's more likely considering how incised Sunspear is by Oberyn's death and the imprisonment of the Sand Snakes. It stands to reason that they'd be so mad if it was because they were used to Oberyn and his daughters presence, which indicates they spent a lot of time in Sunspear. And it speaks to the fact that Sunspear isn't used to orders from Doran considering it's Doran who orders the arrests which almost prompts riots.\n\nBut either way, yeah Doran should have a man in Sunspear he trusts to send on the messages. Either Manfrey or Oberyn work fine for that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The castellan of Sunspear is Doran&amp;#39;s own cousin&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;No answer came from within the litter. Doran Martell stayed cloaked within his silken walls until the thicker walls of the castle swallowed all of them, and the portcullis came down behind them with a rattling crunch. The sounds of shouting dwindled away slowly. Princess Arianne was waiting in the outer ward to greet her father, with half the court about her: the old blind seneschal Ricasso, &lt;strong&gt;Ser Manfrey Martell the castellan&lt;/strong&gt;, young Maester Myles with his grey robes and silky perfumed beard, twoscore of Dornish knights in flowing linen of half a hundred hues. Little Myrcella Baratheon stood with her septa and Ser Arys of the Kingsguard, sweltering in his white-enameled scales.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So I&amp;#39;d expect that Doran does have a man in Sunspear he trusts considering the ruler is another Martell. Manfrey should be someone loyal enough to Doran.&lt;/p&gt;\n\n&lt;p&gt;Additionally, but it&amp;#39;s also possible that Manfrey is only recently the castellan of Sunspear. We aren&amp;#39;t told when Manfrey became castellan, but it seems odd to me that Manfrey would be castellan over Oberyn, who was Doran&amp;#39;s right hand man and privy to all their plans. Doran needs to go to the Water Gardens, but that doesn&amp;#39;t mean that Oberyn needs to follow him there. Oberyn is perfectly capable of ruling in Sunspear for Doran, and passing along the relevant messages to the Water Gardens.&lt;/p&gt;\n\n&lt;p&gt;In fact I&amp;#39;d almost argue that&amp;#39;s more likely considering how incised Sunspear is by Oberyn&amp;#39;s death and the imprisonment of the Sand Snakes. It stands to reason that they&amp;#39;d be so mad if it was because they were used to Oberyn and his daughters presence, which indicates they spent a lot of time in Sunspear. And it speaks to the fact that Sunspear isn&amp;#39;t used to orders from Doran considering it&amp;#39;s Doran who orders the arrests which almost prompts riots.&lt;/p&gt;\n\n&lt;p&gt;But either way, yeah Doran should have a man in Sunspear he trusts to send on the messages. Either Manfrey or Oberyn work fine for that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6ex9h", "score_hidden": false, "stickied": false, "created": 1492054413.0, "created_utc": 1492025613.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg680tx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "houser2112", "parent_id": "t1_dg552ja", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; It also means that all of Tyrion's correspondence with Doran in ACOK and ASOS, the setting up of the Trystane/Myrcella betrothal and seat on the small council for Doran and what not, occurred while Doran was at the Water Gardens.\n\nIf Tyrion thought Doran was in Sunspear, he'd use ravens attuned to Sunspear (assuming the correspondence was done via raven). This requires leaving someone behind in Sunspear that he'd trust to forward his messages to the WG.\n\nPlot hole?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It also means that all of Tyrion&amp;#39;s correspondence with Doran in ACOK and ASOS, the setting up of the Trystane/Myrcella betrothal and seat on the small council for Doran and what not, occurred while Doran was at the Water Gardens.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If Tyrion thought Doran was in Sunspear, he&amp;#39;d use ravens attuned to Sunspear (assuming the correspondence was done via raven). This requires leaving someone behind in Sunspear that he&amp;#39;d trust to forward his messages to the WG.&lt;/p&gt;\n\n&lt;p&gt;Plot hole?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg680tx", "score_hidden": false, "stickied": false, "created": 1492047338.0, "created_utc": 1492018538.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg552ja", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "markg171", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "My problem with Doran being a shitty schemer is that we're indirectly introduced to a scheme that we know he did pull off, and relatively recently. And no I'm not talking about the fact that he convinced the world that Darkstar tried to assassinate Myrcella but Ser Arys Oakheart valiantly saved her life at the cost of his own. That's right in the books (but is indeed an example of Doran pulling off a scheme). What I'm talking about is that if you read carefully enough you realize that Doran did succeed in convincing the world that he's still able bodied.\n\nWe know that Doran, as of AFFC, is suffering terribly from gout and is practically bound to a wheelchair night all day long, incapable of walking. However, we also learn from Hotah that he moved from Sunspear to the Water Gardens while he could still walk 2 years ago as he knew the Sunspear was full of spies and he didn't want anybody to know how infirm he's become.\n\n&gt;The captain understood. Two years ago, when they had left Sunspear for the peace and isolation of the Water Gardens, Prince Doran's gout had not been half so bad. In those days he had still walked, albeit slowly, leaning on a stick and grimacing with every step. The prince did not wish his enemies to know how feeble he had grown, and the Old Palace and its shadow city were full of eyes. Eyes, the captain thought, and steps he cannot climb. He would need to fly to sit atop the Tower of the Sun.\n\nAFFC occurs in the year 300. If you do the math that means that Doran was still walking and commanding in Sunspear back in 298 when the story began, and moved to the Water Gardens sometime in that book. It also means that all of Tyrion's correspondence with Doran in ACOK and ASOS, the setting up of the Trystane/Myrcella betrothal and seat on the small council for Doran and what not, occurred while Doran was at the Water Gardens. Hence at least partially why the seat on the small council was offered. Doran was expected to come to King's Landing because Tyrion had no reason to know that he couldn't.\n\n&gt;The Dornish leader forked a stallion black as sin with a mane and tail the color of fire. He sat his saddle as if he'd been born there, tall, slim, graceful. A cloak of pale red silk fluttered from his shoulders, and his shirt was armored with overlapping rows of copper disks that glittered like a thousand bright new pennies as he rode. His high gilded helm displayed a copper sun on its brow, and the round shield slung behind him bore the sun-and-spear of House Martell on its polished metal surface.\n\n&gt;A Martell sun, but ten years too young, Tyrion thought as he reined up, too fit as well, and far too fierce. He knew what he must deal with by then. How many Dornishmen does it take to start a war? he asked himself. Only one. Yet he had no choice but to smile. \"Well met, my lords. We had word of your approach, and His Grace King Joffrey bid me ride out to welcome you in his name. My lord father the King's Hand sends his greetings as well.\" He feigned an amiable confusion. \"Which of you is Prince Doran?\"\n\n&gt;\"My brother's health requires he remain at Sunspear.\" The princeling removed his helm. Beneath, his face was lined and saturnine, with thin arched brows above large eyes as black and shiny as pools of coal oil. Only a few streaks of silver marred the lustrous black hair that receded from his brow in a widow's peak as sharply pointed as his nose. A salty Dornishmen for certain. \"Prince Doran has sent me to join King Joffrey's council in his stead, as it please His Grace.\"\n\nTyrion was caught completely off guard when it was Oberyn who came to King's Landing instead of Doran. They knew Doran was sickly because they knew he only travels in a litter, but they had no idea he couldn't make the journey. They expected Doran because they had no reason not to.\n\nBut more importantly, look at that last part I bolded\n\n&gt;My brother's health requires he remain **at Sunspear**\n\nOberyn you old slimy dog, you know perfectly well that Doran has been living in the Water Gardens for at least the last year and a half and isn't in Sunspear. But Tyrion and King's Landing doesn't know that.\n\nOberyn's not only keeping up the pretext that Doran is ruling in Sunspear, he's checking to make sure that that's what they know. And seeing as how we're in Tyrion's head we get to see that no that doesn't set off an alarm in his head that Oberyn said Sunspear instead of the Water Gardens. Because he doesn't know any better as their spies don't know any better.\n\nBasically, Doran was successfully able to fool Westoros into thinking he's still ruling in Sunspear and caught everybody off guard by how successfully he's kept secret his illness as they literally don't even know his current location, let alone condition. And he's only had 2 years for that plan.\n\nIf I can see that one of his most recent plans has already worked out extraordinarily well, even with Oberyn fishing to see if Tyrion could call him out on where Doran actually is, then I have reason to believe that his other plans can and should be doing well also, just like everybody cautions. It's still of course possible his plans will overwhelmingly fail, but I know of at least one that worked brilliantly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My problem with Doran being a shitty schemer is that we&amp;#39;re indirectly introduced to a scheme that we know he did pull off, and relatively recently. And no I&amp;#39;m not talking about the fact that he convinced the world that Darkstar tried to assassinate Myrcella but Ser Arys Oakheart valiantly saved her life at the cost of his own. That&amp;#39;s right in the books (but is indeed an example of Doran pulling off a scheme). What I&amp;#39;m talking about is that if you read carefully enough you realize that Doran did succeed in convincing the world that he&amp;#39;s still able bodied.&lt;/p&gt;\n\n&lt;p&gt;We know that Doran, as of AFFC, is suffering terribly from gout and is practically bound to a wheelchair night all day long, incapable of walking. However, we also learn from Hotah that he moved from Sunspear to the Water Gardens while he could still walk 2 years ago as he knew the Sunspear was full of spies and he didn&amp;#39;t want anybody to know how infirm he&amp;#39;s become.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The captain understood. Two years ago, when they had left Sunspear for the peace and isolation of the Water Gardens, Prince Doran&amp;#39;s gout had not been half so bad. In those days he had still walked, albeit slowly, leaning on a stick and grimacing with every step. The prince did not wish his enemies to know how feeble he had grown, and the Old Palace and its shadow city were full of eyes. Eyes, the captain thought, and steps he cannot climb. He would need to fly to sit atop the Tower of the Sun.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;AFFC occurs in the year 300. If you do the math that means that Doran was still walking and commanding in Sunspear back in 298 when the story began, and moved to the Water Gardens sometime in that book. It also means that all of Tyrion&amp;#39;s correspondence with Doran in ACOK and ASOS, the setting up of the Trystane/Myrcella betrothal and seat on the small council for Doran and what not, occurred while Doran was at the Water Gardens. Hence at least partially why the seat on the small council was offered. Doran was expected to come to King&amp;#39;s Landing because Tyrion had no reason to know that he couldn&amp;#39;t.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The Dornish leader forked a stallion black as sin with a mane and tail the color of fire. He sat his saddle as if he&amp;#39;d been born there, tall, slim, graceful. A cloak of pale red silk fluttered from his shoulders, and his shirt was armored with overlapping rows of copper disks that glittered like a thousand bright new pennies as he rode. His high gilded helm displayed a copper sun on its brow, and the round shield slung behind him bore the sun-and-spear of House Martell on its polished metal surface.&lt;/p&gt;\n\n&lt;p&gt;A Martell sun, but ten years too young, Tyrion thought as he reined up, too fit as well, and far too fierce. He knew what he must deal with by then. How many Dornishmen does it take to start a war? he asked himself. Only one. Yet he had no choice but to smile. &amp;quot;Well met, my lords. We had word of your approach, and His Grace King Joffrey bid me ride out to welcome you in his name. My lord father the King&amp;#39;s Hand sends his greetings as well.&amp;quot; He feigned an amiable confusion. &amp;quot;Which of you is Prince Doran?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;My brother&amp;#39;s health requires he remain at Sunspear.&amp;quot; The princeling removed his helm. Beneath, his face was lined and saturnine, with thin arched brows above large eyes as black and shiny as pools of coal oil. Only a few streaks of silver marred the lustrous black hair that receded from his brow in a widow&amp;#39;s peak as sharply pointed as his nose. A salty Dornishmen for certain. &amp;quot;Prince Doran has sent me to join King Joffrey&amp;#39;s council in his stead, as it please His Grace.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Tyrion was caught completely off guard when it was Oberyn who came to King&amp;#39;s Landing instead of Doran. They knew Doran was sickly because they knew he only travels in a litter, but they had no idea he couldn&amp;#39;t make the journey. They expected Doran because they had no reason not to.&lt;/p&gt;\n\n&lt;p&gt;But more importantly, look at that last part I bolded&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;My brother&amp;#39;s health requires he remain &lt;strong&gt;at Sunspear&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Oberyn you old slimy dog, you know perfectly well that Doran has been living in the Water Gardens for at least the last year and a half and isn&amp;#39;t in Sunspear. But Tyrion and King&amp;#39;s Landing doesn&amp;#39;t know that.&lt;/p&gt;\n\n&lt;p&gt;Oberyn&amp;#39;s not only keeping up the pretext that Doran is ruling in Sunspear, he&amp;#39;s checking to make sure that that&amp;#39;s what they know. And seeing as how we&amp;#39;re in Tyrion&amp;#39;s head we get to see that no that doesn&amp;#39;t set off an alarm in his head that Oberyn said Sunspear instead of the Water Gardens. Because he doesn&amp;#39;t know any better as their spies don&amp;#39;t know any better.&lt;/p&gt;\n\n&lt;p&gt;Basically, Doran was successfully able to fool Westoros into thinking he&amp;#39;s still ruling in Sunspear and caught everybody off guard by how successfully he&amp;#39;s kept secret his illness as they literally don&amp;#39;t even know his current location, let alone condition. And he&amp;#39;s only had 2 years for that plan.&lt;/p&gt;\n\n&lt;p&gt;If I can see that one of his most recent plans has already worked out extraordinarily well, even with Oberyn fishing to see if Tyrion could call him out on where Doran actually is, then I have reason to believe that his other plans can and should be doing well also, just like everybody cautions. It&amp;#39;s still of course possible his plans will overwhelmingly fail, but I know of at least one that worked brilliantly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg552ja", "score_hidden": false, "stickied": false, "created": 1491983518.0, "created_utc": 1491954718.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg53tyx", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "fishymcgee", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "At the risk of stealing /u/guildensterncrantz 's thunder:\n\n&gt;'Doran's plan is to let his enemies live long and fulfilling lives'\n\n:)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At the risk of stealing &lt;a href=\"/u/guildensterncrantz\"&gt;/u/guildensterncrantz&lt;/a&gt; &amp;#39;s thunder:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;#39;Doran&amp;#39;s plan is to let his enemies live long and fulfilling lives&amp;#39;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;:)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg53tyx", "score_hidden": false, "stickied": false, "created": 1491981839.0, "created_utc": 1491953039.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg5p3d0", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "BaelBard", "parent_id": "t1_dg5o9ad", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "It was Arianne who got Myrcella hurt. But it was Doran's secrets and plans that caused it. \n\nHe also got his own child killed by sending him to Meereen.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was Arianne who got Myrcella hurt. But it was Doran&amp;#39;s secrets and plans that caused it. &lt;/p&gt;\n\n&lt;p&gt;He also got his own child killed by sending him to Meereen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5p3d0", "score_hidden": false, "stickied": false, "created": 1492020985.0, "created_utc": 1491992185.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5o9ad", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Vowlantene", "parent_id": "t1_dg5gg7o", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "While this is really moving and a bit mind-blowing, his plans haven't gotten any child hurt or killed. I do like the idea of a mad Dany coming to destroy Dorne and fAegon's allies. Especially if she comes to thing that maybe Quentyn had something to do with the locusts. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While this is really moving and a bit mind-blowing, his plans haven&amp;#39;t gotten any child hurt or killed. I do like the idea of a mad Dany coming to destroy Dorne and fAegon&amp;#39;s allies. Especially if she comes to thing that maybe Quentyn had something to do with the locusts. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5o9ad", "score_hidden": false, "stickied": false, "created": 1492018400.0, "created_utc": 1491989600.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gg7o", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "BaelBard", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "People who think Doran has hidden master plan completely misunderstand what his story is about. The same goes for the stupid \"Quentyn is alive\" theory. \n\nThis storyline is a tragedy, not a series of plot twists and conspiracies. Doran is not a master schemer. He is a man haunted by ghosts of the past, who's peaceful nature is in conflict with desire for vengeance. He is an old crippled man outliving his loved ones one by one.\n\nHis core believe is  \"prince should not wage wars because children will pay\" yet his plans get children hurt or killed. \n\nHis actions are never going to be successfull. Make no mistake, his decision to send the Sand Snakes to the capital will kill even more children (Tommen, Myrcella or both). So even the moment when Lannisters are defeated will not be his triumph, but his horror. \n\nAnd then it will get worse. Daenerys will come for mummers dragon and all those who allied with him. And those beautiful Water Gardens that were build for Daenerys that came to make peace with Dorne, that represent Doran's desire to protect the children - they'll burn when Dany comes to Dorne with fire and blood.\n\nBecause that's what Doran's story is. A tragedy.", "edited": 1492326937.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People who think Doran has hidden master plan completely misunderstand what his story is about. The same goes for the stupid &amp;quot;Quentyn is alive&amp;quot; theory. &lt;/p&gt;\n\n&lt;p&gt;This storyline is a tragedy, not a series of plot twists and conspiracies. Doran is not a master schemer. He is a man haunted by ghosts of the past, who&amp;#39;s peaceful nature is in conflict with desire for vengeance. He is an old crippled man outliving his loved ones one by one.&lt;/p&gt;\n\n&lt;p&gt;His core believe is  &amp;quot;prince should not wage wars because children will pay&amp;quot; yet his plans get children hurt or killed. &lt;/p&gt;\n\n&lt;p&gt;His actions are never going to be successfull. Make no mistake, his decision to send the Sand Snakes to the capital will kill even more children (Tommen, Myrcella or both). So even the moment when Lannisters are defeated will not be his triumph, but his horror. &lt;/p&gt;\n\n&lt;p&gt;And then it will get worse. Daenerys will come for mummers dragon and all those who allied with him. And those beautiful Water Gardens that were build for Daenerys that came to make peace with Dorne, that represent Doran&amp;#39;s desire to protect the children - they&amp;#39;ll burn when Dany comes to Dorne with fire and blood.&lt;/p&gt;\n\n&lt;p&gt;Because that&amp;#39;s what Doran&amp;#39;s story is. A tragedy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5gg7o", "score_hidden": false, "stickied": false, "created": 1491999313.0, "created_utc": 1491970513.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg58lxm", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "-PM_ME_BARA-", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "This is pretty much what I thought the over-ripened blood orange symbolized.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is pretty much what I thought the over-ripened blood orange symbolized.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg58lxm", "score_hidden": false, "stickied": false, "created": 1491988192.0, "created_utc": 1491959392.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg55vlz", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "E36wheelman", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Doran doesn't want to go to war, he just wants vengeance. All his moves have to be untraceable, which takes time and planning. He's proud that no Dornishmen died in the war of five kings. We also don't know what moves he made against the Lannisters during Robert's rule and some argue that he was helping Dany and Viserys early in life. \n\nThe same way people loved Stannis because he followed the rule of law above all, some love Doran because he refused to force Dornishmen to be slaughtered for their noble lords.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Doran doesn&amp;#39;t want to go to war, he just wants vengeance. All his moves have to be untraceable, which takes time and planning. He&amp;#39;s proud that no Dornishmen died in the war of five kings. We also don&amp;#39;t know what moves he made against the Lannisters during Robert&amp;#39;s rule and some argue that he was helping Dany and Viserys early in life. &lt;/p&gt;\n\n&lt;p&gt;The same way people loved Stannis because he followed the rule of law above all, some love Doran because he refused to force Dornishmen to be slaughtered for their noble lords.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg55vlz", "score_hidden": false, "stickied": false, "created": 1491984594.0, "created_utc": 1491955794.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg4r7o7", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "IDELNHAW", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I generally agree but he may have helped Dany and Viserys. The house with a red door had a lemon tree", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I generally agree but he may have helped Dany and Viserys. The house with a red door had a lemon tree&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4r7o7", "score_hidden": false, "stickied": false, "created": 1491966835.0, "created_utc": 1491938035.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg54h6u", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Isauricus", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Sending Oberyn to King's Landing was an horrible idea; he was the person he could trust the most, one that shared his goals 100% and who had the skills to complement his own, you may think he is the right person for the job but no one know Oberyn better than Doran, he knew what kind of reckless person he was and how despite his talents he could get himself and the whole plan at risk, and look what happened, he got himself killed, Dorne lost one of its most talented individuals and Doran lost a brother and his right-hand man in all his conspiracy stuff, hell, you can even say that they got lucky that Oberyn's death was the worst thing that happened, at least he was not caught trying to poison someone at a dinner. You may ask, then who could had Doran send instead? and there is no need to even answer that because if that answer is no one then that by itself is a major flaw.    \n\nHis plans involve trusting favourable circumstances, unreliable people, limited information and poor preparation, he sent his son to wander woefully undermanned into a war-plagued continent for an uncertain alliance and he sent his daughter, who has proved to have pretty poor judgment and a rebellious personality, to pretty much decide what is to be done next, master planner he is not IMO, how things have not exploted in his face yet is a damn wonder.   ", "edited": 1491982906.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sending Oberyn to King&amp;#39;s Landing was an horrible idea; he was the person he could trust the most, one that shared his goals 100% and who had the skills to complement his own, you may think he is the right person for the job but no one know Oberyn better than Doran, he knew what kind of reckless person he was and how despite his talents he could get himself and the whole plan at risk, and look what happened, he got himself killed, Dorne lost one of its most talented individuals and Doran lost a brother and his right-hand man in all his conspiracy stuff, hell, you can even say that they got lucky that Oberyn&amp;#39;s death was the worst thing that happened, at least he was not caught trying to poison someone at a dinner. You may ask, then who could had Doran send instead? and there is no need to even answer that because if that answer is no one then that by itself is a major flaw.    &lt;/p&gt;\n\n&lt;p&gt;His plans involve trusting favourable circumstances, unreliable people, limited information and poor preparation, he sent his son to wander woefully undermanned into a war-plagued continent for an uncertain alliance and he sent his daughter, who has proved to have pretty poor judgment and a rebellious personality, to pretty much decide what is to be done next, master planner he is not IMO, how things have not exploted in his face yet is a damn wonder.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg54h6u", "score_hidden": false, "stickied": false, "created": 1491982705.0, "created_utc": 1491953905.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg5mquw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Isauricus", "parent_id": "t1_dg4v11b", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I would not lump Quentyn and Arianne together; besides his stupid final acts, he was mostly unfortunate (both in the genetic lottery and in circumstances), whatever good things, talents and flaws he had, he owned them mostly to his time with the Yronwoods. Then, we have Arianne the real result of Doran's idea of raising a child: an egoistical lady woefully unprepared to the sh*tstorm that may be approaching; as I see it, Quentyn was not a screw-up or if he was, it wasn't because of Doran, but whatever blame Doran dodges in that case he more than compensates it with Arianne. I don't hate Dorne and its characters (like I do hate pretty much anything related to the Iron Islands, and boy, we have a lot of those things) but a lot of the things they do are beyond dumb and they have yet to pay the price.          ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would not lump Quentyn and Arianne together; besides his stupid final acts, he was mostly unfortunate (both in the genetic lottery and in circumstances), whatever good things, talents and flaws he had, he owned them mostly to his time with the Yronwoods. Then, we have Arianne the real result of Doran&amp;#39;s idea of raising a child: an egoistical lady woefully unprepared to the sh*tstorm that may be approaching; as I see it, Quentyn was not a screw-up or if he was, it wasn&amp;#39;t because of Doran, but whatever blame Doran dodges in that case he more than compensates it with Arianne. I don&amp;#39;t hate Dorne and its characters (like I do hate pretty much anything related to the Iron Islands, and boy, we have a lot of those things) but a lot of the things they do are beyond dumb and they have yet to pay the price.          &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5mquw", "score_hidden": false, "stickied": false, "created": 1492013631.0, "created_utc": 1491984831.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4v11b", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "FreeParking42", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Who can blame Quentyn and Arianne for being screw-ups? The blood orange doesn't fall far from the tree.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Who can blame Quentyn and Arianne for being screw-ups? The blood orange doesn&amp;#39;t fall far from the tree.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4v11b", "score_hidden": false, "stickied": false, "created": 1491971002.0, "created_utc": 1491942202.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg51zju", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "CrannogCzar", "parent_id": "t1_dg4y1n2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Very much agree with the \"Doran is in a strong position now because he conserved Dorne's military strength\" bit. People overlook this. \n\nSupposedly the chess master Tartakower once looked at a newly set-up chessboard and said, \"The mistakes are all there, just waiting to be made.\" Doran has avoided losing men and materiel because his conservative approach has avoided making any costly mistakes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very much agree with the &amp;quot;Doran is in a strong position now because he conserved Dorne&amp;#39;s military strength&amp;quot; bit. People overlook this. &lt;/p&gt;\n\n&lt;p&gt;Supposedly the chess master Tartakower once looked at a newly set-up chessboard and said, &amp;quot;The mistakes are all there, just waiting to be made.&amp;quot; Doran has avoided losing men and materiel because his conservative approach has avoided making any costly mistakes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg51zju", "score_hidden": false, "stickied": false, "created": 1491979375.0, "created_utc": 1491950575.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg6b8k7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thetinmaster", "parent_id": "t1_dg4yfxj", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I don't get it, your whole point relies upon Littlefinger being majorly disliked, but the problem is, that's not true. That's just a show thing that doesn't make sense, book LF is considered a witty young lord with some sexual debauchery and good borrowing skills behind semi-closed doors. That's all he is to them, even the pretty clever ones, like Tywin, Catelyn (before Baelor), and Sansa (before AFFC). The only ones who know what he really is are Varys (the spy god), Olenna (whose first transaction with him is a highest of all high profile assasination, kind of a clue), and Sansa (really, he's spoon-feeding her on how bad he is), and some pawns he absolutely *owns*.\n\nThere are a lot of nobles who view as an upjumped common merchant, true, but there were, like, none who outright disliked or were averse to any deals with him, other than some morons.\n\nQuite different from the Dornish, who have been *despised* by all for several thousands of years, and, unlike Littlefinger, who as far as most know is an entitled merchant, they actually do have a reason to hate. \n\nBaelish is a Vale lord, Vale men are extremely respected in the South (they're practically poster boys for the concept of a knight) and now are very, very much owed by the North (RR). He was fostered by Riverrun along with the Tully heir and, to those interested, extremely friendly with the ruling ladies of two ancient kingdoms and families. He was essentially Tywin's public right hand man, but and probably has connections up in Braavos.\n\nDoran is the fat diseased man with a keen mind slowly going down who is descendant of a family built on treachery, whose brother is a bisexual loose canon with a bastard as a lover who kills old men in duels wherein he is the rightfully accused, then walks around insulting that family, and BTW, is his brother's right hand man. Who has a daughter reputed for seduction. With a wife seperate from him, who left her own kids to go away, (pretty reasonable to us, but an outsider? To the outside world, he was essentially so bad that his wife, who isn't supposed to have any power, left him, and left her own kids with him, pretty much unheard of.) whose nieces are all manly/seductive/poisonous bastard women.\n\nWhile we, the readers, know different, to a neutral character from the books, Littlefinger sounds a lot better than Doran Martell, IMO.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t get it, your whole point relies upon Littlefinger being majorly disliked, but the problem is, that&amp;#39;s not true. That&amp;#39;s just a show thing that doesn&amp;#39;t make sense, book LF is considered a witty young lord with some sexual debauchery and good borrowing skills behind semi-closed doors. That&amp;#39;s all he is to them, even the pretty clever ones, like Tywin, Catelyn (before Baelor), and Sansa (before AFFC). The only ones who know what he really is are Varys (the spy god), Olenna (whose first transaction with him is a highest of all high profile assasination, kind of a clue), and Sansa (really, he&amp;#39;s spoon-feeding her on how bad he is), and some pawns he absolutely &lt;em&gt;owns&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;There are a lot of nobles who view as an upjumped common merchant, true, but there were, like, none who outright disliked or were averse to any deals with him, other than some morons.&lt;/p&gt;\n\n&lt;p&gt;Quite different from the Dornish, who have been &lt;em&gt;despised&lt;/em&gt; by all for several thousands of years, and, unlike Littlefinger, who as far as most know is an entitled merchant, they actually do have a reason to hate. &lt;/p&gt;\n\n&lt;p&gt;Baelish is a Vale lord, Vale men are extremely respected in the South (they&amp;#39;re practically poster boys for the concept of a knight) and now are very, very much owed by the North (RR). He was fostered by Riverrun along with the Tully heir and, to those interested, extremely friendly with the ruling ladies of two ancient kingdoms and families. He was essentially Tywin&amp;#39;s public right hand man, but and probably has connections up in Braavos.&lt;/p&gt;\n\n&lt;p&gt;Doran is the fat diseased man with a keen mind slowly going down who is descendant of a family built on treachery, whose brother is a bisexual loose canon with a bastard as a lover who kills old men in duels wherein he is the rightfully accused, then walks around insulting that family, and BTW, is his brother&amp;#39;s right hand man. Who has a daughter reputed for seduction. With a wife seperate from him, who left her own kids to go away, (pretty reasonable to us, but an outsider? To the outside world, he was essentially so bad that his wife, who isn&amp;#39;t supposed to have any power, left him, and left her own kids with him, pretty much unheard of.) whose nieces are all manly/seductive/poisonous bastard women.&lt;/p&gt;\n\n&lt;p&gt;While we, the readers, know different, to a neutral character from the books, Littlefinger sounds a lot better than Doran Martell, IMO.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6b8k7", "score_hidden": false, "stickied": false, "created": 1492050608.0, "created_utc": 1492021808.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg5nzuj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Yatagurusu", "parent_id": "t1_dg4yfxj", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "But the thing is they didn't NEED to tear the houses apart. When there are 5 people who are all independent and unallied it's not as if only one of those will be ripped to pieces. You could tell from the moment Renly and Stannis declared themselves that the kingdom will do some serious bleeding. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But the thing is they didn&amp;#39;t NEED to tear the houses apart. When there are 5 people who are all independent and unallied it&amp;#39;s not as if only one of those will be ripped to pieces. You could tell from the moment Renly and Stannis declared themselves that the kingdom will do some serious bleeding. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5nzuj", "score_hidden": false, "stickied": false, "created": 1492017579.0, "created_utc": 1491988779.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4yfxj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TeoKajLibroj", "parent_id": "t1_dg4y1n2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; In theory only. Most of the realm doesn't have a very favourable opinion of the Dornish\n\nBut they don't have to like the Dornish, just squabble among themselves. Call it the Littlefinger strategy, not many like him yet he can still manipulate them. Doran got massively lucky that the Houses tore each other part, it contributed nothing to that. If he had, then he would deserve his reputation as a strategist.\n\n&gt; After Renly died, the Tyrells still had plenty of manpower and resources, more than enough to outmatch the Martells. Whichever side they chose, they'd be fine.\n\nNot if they have to fight Stannis, Robb and Dorne. They'd be alone and would quit the fight.\n\n&gt; He plans to gain revenge through power, making sure that his grandchild is a future King or Queen is a power move no matter what.\n\nWhy not marry Quentyn to Shireen? Arianne to Robb (if he's fast enough) or Rickon? Or at least try and make an alliance instead of just ignoring the outside world.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In theory only. Most of the realm doesn&amp;#39;t have a very favourable opinion of the Dornish&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But they don&amp;#39;t have to like the Dornish, just squabble among themselves. Call it the Littlefinger strategy, not many like him yet he can still manipulate them. Doran got massively lucky that the Houses tore each other part, it contributed nothing to that. If he had, then he would deserve his reputation as a strategist.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;After Renly died, the Tyrells still had plenty of manpower and resources, more than enough to outmatch the Martells. Whichever side they chose, they&amp;#39;d be fine.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not if they have to fight Stannis, Robb and Dorne. They&amp;#39;d be alone and would quit the fight.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;He plans to gain revenge through power, making sure that his grandchild is a future King or Queen is a power move no matter what.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Why not marry Quentyn to Shireen? Arianne to Robb (if he&amp;#39;s fast enough) or Rickon? Or at least try and make an alliance instead of just ignoring the outside world.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4yfxj", "score_hidden": false, "stickied": false, "created": 1491974950.0, "created_utc": 1491946150.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4y1n2", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "UsernameSnatcher", "parent_id": "t1_dg4wxgf", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;It would be easy to team up with one House against another\n\nIn theory only. Most of the realm doesn't have a very favourable opinion of the Dornish - they're regarded only above the Freys and the Ironborn most of the time. Gaining support of lords who commonly stereotype the Dornish as lying backstabbers is going to be extremely hard, no matter how respected Doran is. As of the first book, and for most of the 15 years before that, everyone was weary of war, enjoying a long summer, and was generally scared of the money and power of the Lannister-Tully-Stark-Baratheon-Arryn alliance. Who's to say one of those lords Doran tried to win over won't blab to King Robert or Littlefinger or Varys?\n\n&gt;I don't understand your point? I suggested they help Stannis\n\nAfter Renly died, the Tyrells still had plenty of manpower and resources, more than enough to outmatch the Martells. Whichever side they chose, they'd be fine. The Martells cannot afford to switch sides this easily, no matter who they backed. \nIf the Dornish had gone over to Stannis first, they would still lose against the massive Lannister-Tyrell alliance. And Tywin would have no problem in making Dorne bleed for supporting a traitor. \nThey weren't even explicitly loyal to Joffrey; all Doran did was move men into the passes near the Marches. A small move, but it seemed to have worked as we don't hear of the marcher lords causing much trouble for the Reachmen or the stony Dornish in the Red Mountains. \n\n&gt;At the moment she's nowhere near becoming a queen so she wouldn't be any worse off. His main plan is revenge not power. \n\nHe plans to gain revenge through power, making sure that his grandchild is a future King or Queen is a power move no matter what. It's what the Lannisters did during Robert's Rebellion and what the Tyrells are doing now - a queen at court means a lot of men and women of her region also at court. How else do you think Robert found himself surrounded by Lannisters?\n\n&gt;True but it hasn't advanced his plans either\n\nWell as of ADWD he has a fresh, unblooded army, and only now would it be big enough to challenge any kingdom or be an asset to anyone wanting support (pretender or not) after the whole realm has been torn apart by years of war. Even then it's not like the Lannisters and Tyrells are hurting for money to hire more men. Dorne's army only looks strong in comparison *now*, and that's thanks to Doran being cautious and not wasting men to aid either side. ", "edited": 1491946346.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It would be easy to team up with one House against another&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In theory only. Most of the realm doesn&amp;#39;t have a very favourable opinion of the Dornish - they&amp;#39;re regarded only above the Freys and the Ironborn most of the time. Gaining support of lords who commonly stereotype the Dornish as lying backstabbers is going to be extremely hard, no matter how respected Doran is. As of the first book, and for most of the 15 years before that, everyone was weary of war, enjoying a long summer, and was generally scared of the money and power of the Lannister-Tully-Stark-Baratheon-Arryn alliance. Who&amp;#39;s to say one of those lords Doran tried to win over won&amp;#39;t blab to King Robert or Littlefinger or Varys?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t understand your point? I suggested they help Stannis&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;After Renly died, the Tyrells still had plenty of manpower and resources, more than enough to outmatch the Martells. Whichever side they chose, they&amp;#39;d be fine. The Martells cannot afford to switch sides this easily, no matter who they backed. \nIf the Dornish had gone over to Stannis first, they would still lose against the massive Lannister-Tyrell alliance. And Tywin would have no problem in making Dorne bleed for supporting a traitor. \nThey weren&amp;#39;t even explicitly loyal to Joffrey; all Doran did was move men into the passes near the Marches. A small move, but it seemed to have worked as we don&amp;#39;t hear of the marcher lords causing much trouble for the Reachmen or the stony Dornish in the Red Mountains. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;At the moment she&amp;#39;s nowhere near becoming a queen so she wouldn&amp;#39;t be any worse off. His main plan is revenge not power. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He plans to gain revenge through power, making sure that his grandchild is a future King or Queen is a power move no matter what. It&amp;#39;s what the Lannisters did during Robert&amp;#39;s Rebellion and what the Tyrells are doing now - a queen at court means a lot of men and women of her region also at court. How else do you think Robert found himself surrounded by Lannisters?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;True but it hasn&amp;#39;t advanced his plans either&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well as of ADWD he has a fresh, unblooded army, and only now would it be big enough to challenge any kingdom or be an asset to anyone wanting support (pretender or not) after the whole realm has been torn apart by years of war. Even then it&amp;#39;s not like the Lannisters and Tyrells are hurting for money to hire more men. Dorne&amp;#39;s army only looks strong in comparison &lt;em&gt;now&lt;/em&gt;, and that&amp;#39;s thanks to Doran being cautious and not wasting men to aid either side. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4y1n2", "score_hidden": false, "stickied": false, "created": 1491974474.0, "created_utc": 1491945674.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg5p1wp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Yatagurusu", "parent_id": "t1_dg5o2a4", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "They were on the same side and they never spoke against the murders. And Tywin I dead but that doesn't sate his vengeance. Everyone involved in Elias murder is dead. Yet I'm pretty sure he wants to extinguish them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They were on the same side and they never spoke against the murders. And Tywin I dead but that doesn&amp;#39;t sate his vengeance. Everyone involved in Elias murder is dead. Yet I&amp;#39;m pretty sure he wants to extinguish them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5p1wp", "score_hidden": false, "stickied": false, "created": 1492020866.0, "created_utc": 1491992066.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5o2a4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TeoKajLibroj", "parent_id": "t1_dg5nx74", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Not really. The Starks, Tully and Arryn weren't involved with the murder of Elia and Doran doesn't seem to blame them. He focuses his hatred on the Lannisters, so he could work with them as a means to an end. \n\nEven if he did blame them, the old generation has mostly died off and a new generation unconnected with the sack of King's Landing is in control. Why blame Robb Stark for the death of Elia? (Especially when he never moved against Ned while he was alive)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not really. The Starks, Tully and Arryn weren&amp;#39;t involved with the murder of Elia and Doran doesn&amp;#39;t seem to blame them. He focuses his hatred on the Lannisters, so he could work with them as a means to an end. &lt;/p&gt;\n\n&lt;p&gt;Even if he did blame them, the old generation has mostly died off and a new generation unconnected with the sack of King&amp;#39;s Landing is in control. Why blame Robb Stark for the death of Elia? (Especially when he never moved against Ned while he was alive)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5o2a4", "score_hidden": false, "stickied": false, "created": 1492017790.0, "created_utc": 1491988990.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5nx74", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Yatagurusu", "parent_id": "t1_dg4wxgf", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "And why would that side with Stark, Tully and Arryn. This whole plot is about vengeance for Elia yet they would be siding with those (in their eyes) who killed Elia and her children ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And why would that side with Stark, Tully and Arryn. This whole plot is about vengeance for Elia yet they would be siding with those (in their eyes) who killed Elia and her children &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5nx74", "score_hidden": false, "stickied": false, "created": 1492017343.0, "created_utc": 1491988543.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4wxgf", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "TeoKajLibroj", "parent_id": "t1_dg4uqev", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; Why would they try to reach out to one of the Houses which supported the enemy side?\n\nDivide and conquer. ASOIAF is all about how the lords squabble and struggle for power among themselves. They are not a united block. It would be easy to team up with one House against another. Stark v Lannister is one example, but there's dozens of potentials.\n\n&gt; If Doran had backed Renly for sure, the Tyrells could still run to the Lannisters without grave losses after Renly's death, but the Martells cannot afford to do that.\n\nI don't understand your point? I suggested they help Stannis. Either way it's bizarre that they claimed to be plotting the downfall of the Lannisters, but are the only province that remained loyal during the war.\n\n&gt; Besides, Doran wants to make his own daughter a queen too - why would he agree to supporting a side where a queen has already been chosen?\n\nAt the moment she's nowhere near becoming a queen so she wouldn't be any worse off. His main plan is revenge not power. Doing nothing gives him neither.\n\n&gt; But so far, even his inaction hasn't really harmed his realm in any way.\n\nTrue but it hasn't advanced his plans either", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Why would they try to reach out to one of the Houses which supported the enemy side?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Divide and conquer. ASOIAF is all about how the lords squabble and struggle for power among themselves. They are not a united block. It would be easy to team up with one House against another. Stark v Lannister is one example, but there&amp;#39;s dozens of potentials.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If Doran had backed Renly for sure, the Tyrells could still run to the Lannisters without grave losses after Renly&amp;#39;s death, but the Martells cannot afford to do that.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t understand your point? I suggested they help Stannis. Either way it&amp;#39;s bizarre that they claimed to be plotting the downfall of the Lannisters, but are the only province that remained loyal during the war.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Besides, Doran wants to make his own daughter a queen too - why would he agree to supporting a side where a queen has already been chosen?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;At the moment she&amp;#39;s nowhere near becoming a queen so she wouldn&amp;#39;t be any worse off. His main plan is revenge not power. Doing nothing gives him neither.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But so far, even his inaction hasn&amp;#39;t really harmed his realm in any way.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;True but it hasn&amp;#39;t advanced his plans either&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4wxgf", "score_hidden": false, "stickied": false, "created": 1491973143.0, "created_utc": 1491944343.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4uqev", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "UsernameSnatcher", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;The Starks have a rivalry with the Lannisters, why not build a friendship? \n\nBecause before 298 AC, the Lord of Winterfell was the best friend of the King - the Lannisters were everywhere, but Robert was still boss. Why would they try to reach out to one of the Houses which supported the enemy side? And King Robert likely had almost the entire realm backing his reign then - the North-Riverlands-Vale-Stormlands-West power bloc is impossible to combat. He would likely never get the support he wanted as most lords were content under Robert's reign.\n\n&gt;Doran did nothing during the War of Five Kings. This is my biggest gripe on the list. For this reason alone the Fire and Blood speech was empty words to me. There couldn't have been a better opportunity for revenge. You couldn't dream up a better chance. The kingdom had collapsed, almost every major lord was going their own way such that not rebelling was more unusual than rebellion. The Lannisters were isolated and he could strike at the them with little risk to himself.\n\n\"Little risk\" remained to be seen. The Tyrells have more than enough money and food and men to throw at whatever side they backed for the Throne, the Martells do not. If Doran had backed Renly for sure, the Tyrells could still run to the Lannisters without grave losses after Renly's death, but the Martells cannot afford to do that. Besides, Doran wants to make his own daughter a queen too - why would he agree to supporting a side where a queen has already been chosen? And why would the Tyrells welcome them?\n\n\nHonestly so far his course of action might be slow as all hell, but Dorne is the better off for it. Could he have done more? Of course. But so far, even his inaction hasn't really harmed his realm in any way. \nIt might not end well for House Martell but I still think they'll get a taste of some glory before that happens.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The Starks have a rivalry with the Lannisters, why not build a friendship? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Because before 298 AC, the Lord of Winterfell was the best friend of the King - the Lannisters were everywhere, but Robert was still boss. Why would they try to reach out to one of the Houses which supported the enemy side? And King Robert likely had almost the entire realm backing his reign then - the North-Riverlands-Vale-Stormlands-West power bloc is impossible to combat. He would likely never get the support he wanted as most lords were content under Robert&amp;#39;s reign.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Doran did nothing during the War of Five Kings. This is my biggest gripe on the list. For this reason alone the Fire and Blood speech was empty words to me. There couldn&amp;#39;t have been a better opportunity for revenge. You couldn&amp;#39;t dream up a better chance. The kingdom had collapsed, almost every major lord was going their own way such that not rebelling was more unusual than rebellion. The Lannisters were isolated and he could strike at the them with little risk to himself.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;quot;Little risk&amp;quot; remained to be seen. The Tyrells have more than enough money and food and men to throw at whatever side they backed for the Throne, the Martells do not. If Doran had backed Renly for sure, the Tyrells could still run to the Lannisters without grave losses after Renly&amp;#39;s death, but the Martells cannot afford to do that. Besides, Doran wants to make his own daughter a queen too - why would he agree to supporting a side where a queen has already been chosen? And why would the Tyrells welcome them?&lt;/p&gt;\n\n&lt;p&gt;Honestly so far his course of action might be slow as all hell, but Dorne is the better off for it. Could he have done more? Of course. But so far, even his inaction hasn&amp;#39;t really harmed his realm in any way. \nIt might not end well for House Martell but I still think they&amp;#39;ll get a taste of some glory before that happens.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4uqev", "score_hidden": false, "stickied": false, "created": 1491970669.0, "created_utc": 1491941869.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg5ka2t", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BCBuff", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Excellent post, and I strongly agree. \n\nA point though. On the Greyjoy rebellion, Robert showed just how much he loved war and how quickly and effectively he smashed a rebellion. I think this gives Doran good reason not to rebel during this period, it served as a warning to others too.\n\nAlso, there was some blame on Robert for the deaths of the dragonspawn. Dany blames Ned for some of this, it wouldn't surprise me if the Dornish do as well as this limited a Stark alliance.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Excellent post, and I strongly agree. &lt;/p&gt;\n\n&lt;p&gt;A point though. On the Greyjoy rebellion, Robert showed just how much he loved war and how quickly and effectively he smashed a rebellion. I think this gives Doran good reason not to rebel during this period, it served as a warning to others too.&lt;/p&gt;\n\n&lt;p&gt;Also, there was some blame on Robert for the deaths of the dragonspawn. Dany blames Ned for some of this, it wouldn&amp;#39;t surprise me if the Dornish do as well as this limited a Stark alliance.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5ka2t", "score_hidden": false, "stickied": false, "created": 1492006904.0, "created_utc": 1491978104.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg54ph7", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "LawyerCowboy", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think it would've been a better or more intriguing narrative decision to have Young Griff/fAegon be hidden in Dorne and be the surprise card Doran has in his back pocket. It doesn't make much sense that fAegon currently doesn't have the support of Dorne nor are they even aware of his existence until recently.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it would&amp;#39;ve been a better or more intriguing narrative decision to have Young Griff/fAegon be hidden in Dorne and be the surprise card Doran has in his back pocket. It doesn&amp;#39;t make much sense that fAegon currently doesn&amp;#39;t have the support of Dorne nor are they even aware of his existence until recently.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg54ph7", "score_hidden": false, "stickied": false, "created": 1491983023.0, "created_utc": 1491954223.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg5ntbw", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "DarkFirePho3nix", "parent_id": "t1_dg5ne89", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I don't think so because when Oberyn came to King's Landing, Tyrion tried his best to keep their relations cordial. Weak or not A Great Lord wields some power !", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think so because when Oberyn came to King&amp;#39;s Landing, Tyrion tried his best to keep their relations cordial. Weak or not A Great Lord wields some power !&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5ntbw", "score_hidden": false, "stickied": false, "created": 1492016999.0, "created_utc": 1491988199.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ne89", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "TeoKajLibroj", "parent_id": "t1_dg5l7lk", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "But I think Doran could do something similar. Dorne is the smallest and weakest of the seven kingdoms, so none of the other houses see it as a threat. He could play off this to make them underestimate him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But I think Doran could do something similar. Dorne is the smallest and weakest of the seven kingdoms, so none of the other houses see it as a threat. He could play off this to make them underestimate him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5ne89", "score_hidden": false, "stickied": false, "created": 1492015645.0, "created_utc": 1491986845.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5l7lk", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "DarkFirePho3nix", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I disagree about playing a La Littefinger like game. Littlefinger thrives because the other players undermine him because he is not a Lord or doesn't command his own army as against a Great Lord. So the way Doran plays has to be different.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I disagree about playing a La Littefinger like game. Littlefinger thrives because the other players undermine him because he is not a Lord or doesn&amp;#39;t command his own army as against a Great Lord. So the way Doran plays has to be different.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5l7lk", "score_hidden": false, "stickied": false, "created": 1492009272.0, "created_utc": 1491980472.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg533ly", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PauloRodrigo94", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I've recently read an wonderful essay by our dear maester Bryndenbfish about the plans of Doran. It's included in a series about (f)Aegon and it's very interessing! \n\nHere's the link:\nhttps://warsandpoliticsoficeandfire.wordpress.com/2016/07/19/blood-of-the-conqueror-part-8-to-the-spears/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve recently read an wonderful essay by our dear maester Bryndenbfish about the plans of Doran. It&amp;#39;s included in a series about (f)Aegon and it&amp;#39;s very interessing! &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s the link:\n&lt;a href=\"https://warsandpoliticsoficeandfire.wordpress.com/2016/07/19/blood-of-the-conqueror-part-8-to-the-spears/\"&gt;https://warsandpoliticsoficeandfire.wordpress.com/2016/07/19/blood-of-the-conqueror-part-8-to-the-spears/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg533ly", "score_hidden": false, "stickied": false, "created": 1491980839.0, "created_utc": 1491952039.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg5kqhw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mithras_Stoneborn", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "All talk and no strategy makes Doran a mud boy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All talk and no strategy makes Doran a mud boy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5kqhw", "score_hidden": false, "stickied": false, "created": 1492008035.0, "created_utc": 1491979235.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg656jr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "erikb85", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Convincing arguments. That can be part of a setup for the reader though, showing that good things may come to those who wait, but only what's left by those who hustle.\n\nFor some reason that fits perfectly in my mind to a Order of Green Hand video I just watched on Youtube yesterday, explaining how much further Littlefinger's tricks go beyond what I assumed myself after reading the books. If he's somehow pitted against someone waiting just that little bit too much, he may crush them by pure (smart) hustling.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Convincing arguments. That can be part of a setup for the reader though, showing that good things may come to those who wait, but only what&amp;#39;s left by those who hustle.&lt;/p&gt;\n\n&lt;p&gt;For some reason that fits perfectly in my mind to a Order of Green Hand video I just watched on Youtube yesterday, explaining how much further Littlefinger&amp;#39;s tricks go beyond what I assumed myself after reading the books. If he&amp;#39;s somehow pitted against someone waiting just that little bit too much, he may crush them by pure (smart) hustling.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg656jr", "score_hidden": false, "stickied": false, "created": 1492044456.0, "created_utc": 1492015656.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg5x68l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MightyIsobel", "parent_id": "t1_dg5rrqr", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; Quentyn Martell is dead as a doornail.\n\nI don't mean to say that I know, of my own knowledge, what there is particularly dead about a door-nail. I might have been inclined, myself, to regard a coffin-nail as the deadest piece of ironmongery in the trade. But the wisdom of our ancestors is in the simile; and my unhallowed hands shall not disturb it, or the Country's done for.\n\n~~ some dead author", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Quentyn Martell is dead as a doornail.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t mean to say that I know, of my own knowledge, what there is particularly dead about a door-nail. I might have been inclined, myself, to regard a coffin-nail as the deadest piece of ironmongery in the trade. But the wisdom of our ancestors is in the simile; and my unhallowed hands shall not disturb it, or the Country&amp;#39;s done for.&lt;/p&gt;\n\n&lt;p&gt;~~ some dead author&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5x68l", "score_hidden": false, "stickied": false, "created": 1492035649.0, "created_utc": 1492006849.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg7gc52", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pikkdogs", "parent_id": "t1_dg7820b", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": " \n\nBut, he's not dead. Not that we know of anyway. \n\n\nBut he doesn't have pus for eyes. As far as we know, we know that his clothes caught on fire. That's it. I bet he at least does have some moderate burns on him,  but we just don't know. We can assume that Arch tackled him shortly after the chapter cuts off. As we said before, his story arc probably demands him to be fairly pretty burned and scarred. But, burns aren't always fatal, there's no reason to think that he died. In fact, since we have no body it's probably the opposite. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But, he&amp;#39;s not dead. Not that we know of anyway. &lt;/p&gt;\n\n&lt;p&gt;But he doesn&amp;#39;t have pus for eyes. As far as we know, we know that his clothes caught on fire. That&amp;#39;s it. I bet he at least does have some moderate burns on him,  but we just don&amp;#39;t know. We can assume that Arch tackled him shortly after the chapter cuts off. As we said before, his story arc probably demands him to be fairly pretty burned and scarred. But, burns aren&amp;#39;t always fatal, there&amp;#39;s no reason to think that he died. In fact, since we have no body it&amp;#39;s probably the opposite. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7gc52", "score_hidden": false, "stickied": false, "created": 1492114165.0, "created_utc": 1492085365.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7820b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DaneFairchild", "parent_id": "t1_dg6149f", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; Now what is the young hero gonna do?\n\nNothing because he's dead.  \n\nThere's nothing left for him to do, he's served his purpose.  \n\n&gt;the reason they have burn wards in hospitals is because all burns aren't fatal.\n\nEssos isn't 21st century Canada or Europe with advanced health care, it's a medieval world at best.  Full-body burns with pus balls for eyes and chunks of flesh sloughing off the bones = death.  Something that severe is very often death in the modern world.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Now what is the young hero gonna do?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Nothing because he&amp;#39;s dead.  &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s nothing left for him to do, he&amp;#39;s served his purpose.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;the reason they have burn wards in hospitals is because all burns aren&amp;#39;t fatal.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Essos isn&amp;#39;t 21st century Canada or Europe with advanced health care, it&amp;#39;s a medieval world at best.  Full-body burns with pus balls for eyes and chunks of flesh sloughing off the bones = death.  Something that severe is very often death in the modern world.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7820b", "score_hidden": false, "stickied": false, "created": 1492091944.0, "created_utc": 1492063144.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6149f", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "pikkdogs", "parent_id": "t1_dg5vwu2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Protecting Quentyn from who? There was nobody else there. \n\n No, many people have been burned and still survived. Burning is not death, the reason they have burn wards in hospitals is because all burns aren't fatal. \n\nThe story makes even more sense with a burned Quentyn.  Not only did he fail and not accomplish his goal, but he got horribly disfigured and burned. Now what is the young hero gonna do? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Protecting Quentyn from who? There was nobody else there. &lt;/p&gt;\n\n&lt;p&gt;No, many people have been burned and still survived. Burning is not death, the reason they have burn wards in hospitals is because all burns aren&amp;#39;t fatal. &lt;/p&gt;\n\n&lt;p&gt;The story makes even more sense with a burned Quentyn.  Not only did he fail and not accomplish his goal, but he got horribly disfigured and burned. Now what is the young hero gonna do? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6149f", "score_hidden": false, "stickied": false, "created": 1492040118.0, "created_utc": 1492011318.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5vwu2", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "BaelBard", "parent_id": "t1_dg5v769", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Umm, maybe because they were protecting Quentyn? They killed Queen's man so they would see any of them approaching as potentional enemy.\n\nAlso, here is Quentyn's death scene:\n\n&gt;Quentyn turned and threw his left arm across his face to shield his eyes from the furnace wind. Rhaegal, he reminded himself, the green one is Rhaegal.\n\n&gt;When he raised his whip, he saw that the lash was burning. His hand as well. All of him, all of him was burning.\n \n&gt;Oh, he thought. Then he began to scream.\n\nHe covered his eyes, then he looked and saw that he was burning. And then he burned. So did his eyes. Because that's what happens to your eyes when the rest of your body burns.\n \n**All of him, all of him was burning** is a definitive death proof. Quentyn burned. \n\nAnd his whole story led to this. He is a hidden prince on a grand adventure to get the princess and tame the dragon. But adventure stank, he lost his friends, he wintnesed the horrors of war and even had to take part in some, he didn't get the princess' kiss and remained the Frog. And when he came to claim his dragons it killed him. Quentyn's story is a deconstrucion of a fantasy trope. And the final punchline is horrific death. Not a dumb plot twist.", "edited": 1492006907.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Umm, maybe because they were protecting Quentyn? They killed Queen&amp;#39;s man so they would see any of them approaching as potentional enemy.&lt;/p&gt;\n\n&lt;p&gt;Also, here is Quentyn&amp;#39;s death scene:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Quentyn turned and threw his left arm across his face to shield his eyes from the furnace wind. Rhaegal, he reminded himself, the green one is Rhaegal.&lt;/p&gt;\n\n&lt;p&gt;When he raised his whip, he saw that the lash was burning. His hand as well. All of him, all of him was burning.&lt;/p&gt;\n\n&lt;p&gt;Oh, he thought. Then he began to scream.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He covered his eyes, then he looked and saw that he was burning. And then he burned. So did his eyes. Because that&amp;#39;s what happens to your eyes when the rest of your body burns.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;All of him, all of him was burning&lt;/strong&gt; is a definitive death proof. Quentyn burned. &lt;/p&gt;\n\n&lt;p&gt;And his whole story led to this. He is a hidden prince on a grand adventure to get the princess and tame the dragon. But adventure stank, he lost his friends, he wintnesed the horrors of war and even had to take part in some, he didn&amp;#39;t get the princess&amp;#39; kiss and remained the Frog. And when he came to claim his dragons it killed him. Quentyn&amp;#39;s story is a deconstrucion of a fantasy trope. And the final punchline is horrific death. Not a dumb plot twist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5vwu2", "score_hidden": false, "stickied": false, "created": 1492034066.0, "created_utc": 1492005266.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v769", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "pikkdogs", "parent_id": "t1_dg5rrqr", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "A burned and ticked off Quentyn is just as good a illlustration of Doran's failure as A dead Quentyn is. In fact, it's better. \n\nIt's obvious that the body Arch and Drink claim is Quentyn is not. Quentyn covered his eyes, the corpse has exploded eyes. No character that saw the body could ID it. And if it is Quentyn why would Arch and Drink be found standing over him with a sword? Why would they be protecting themselves from a dying Quentyn? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A burned and ticked off Quentyn is just as good a illlustration of Doran&amp;#39;s failure as A dead Quentyn is. In fact, it&amp;#39;s better. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s obvious that the body Arch and Drink claim is Quentyn is not. Quentyn covered his eyes, the corpse has exploded eyes. No character that saw the body could ID it. And if it is Quentyn why would Arch and Drink be found standing over him with a sword? Why would they be protecting themselves from a dying Quentyn? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5v769", "score_hidden": false, "stickied": false, "created": 1492033117.0, "created_utc": 1492004317.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5rrqr", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "BaelBard", "parent_id": "t1_dg5qu17", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "The question of Quentyn's death pops out from time to time so I'll just quote an old comment to Preston's video about Quentyn's fate by u/Bookshelfstud\n\n&gt;As usual with anyone who claims Quentyn is alive: no. \n\n&gt;Quentyn is dead. Utterly, totally dead. He's dead for the same reason Syrio, Ned, Tywin, and Robb are dead: because it's important, not only to the plot, but to the ideas that GRRM is trying to impart.\n\n&gt;Quentyn *has* to be dead because his death is the cost of Doran's piss-poor plotting. Doran doesn't have a master plan. When we see him in ADWD, he's desperate, sad; he knows the truth already, and the truth is that he sent his son to die in a strange place across the sea, alone, terrified. Quentyn is dead because his death is the cost of Doran's slow revenge plot; Quentyn is dead because GRRM wants us to see that by pressing his old grievances, Doran can't help but hurt innocent people. \n\n&gt;That's setting aside all the plot reasons (Q is dead to force Doran's hand in backing Aegon, for example). It might be tempting to look at all this circumstantial evidence and say \"well, he could be alive.\" It's one thing to take a quote like \"burned bones mean nothing\" and say \"Well, how do we know that burned-up freak body really is Quentyn?\" but you can't stop the analysis there! When Hazzea dies to the dragons, Dany tries to deny that it's possible, but deep down she knows that it was Drogon, and that Drogon murdered a child. THAT is what GRRM is telling us there; he's foreshadowing that the dragons hurt innocent people, and that we can't deny that as much as we might want to. Yeah, that quote is about Quentyn; it's about how the truth is that dragons kill the innocents, and Quentyn is the consummate (lol) innocent.\n\n&gt;Never mind the fact that Quentyn is literally burning at the end of his chapter, never mind that we have multiple character all corroborating his death, never mind that Barristan's relevant chapter opens with the line \"The Dornish prince was three days dying\" - never mind all the plot evidence that Quentyn is dead. Quentyn Martell is dead because GRRM needs him dead. It's the final punchline to a story that systematically takes down adventure stories. It's the natural conclusion to a story about someone who isn't a hero. \n\n&gt;Quentyn Martell is dead. I honestly can't believe how disingenuous this video is. I know this channel has been called the Ancient Aliens of ASOIAF, and it's true. It's true because Ancient Aliens deliberately misrepresents real evidence to create an entire bullshit narrative out of whole cloth. Almost every sentence in this video has something misleading in it (\"Didn't Dany walk into the flames only to end up alive?\" Well, given that GRRM has said that was a **one-time** magical event, I wouldn't exactly use that as evidence that Q is alive). Someone else can do a point-by-point breakdown of how this is wrong if they want. \n\n&gt;Sorry to break it to you, folks, but Quentyn Martell is dead as a doornail.\n\n&gt;Further reading:\nIn Defense of Mud: https://www.reddit.com/r/asoiaf/comments/2texff/spoilers_all_in_defense_of_mud_why_prince_frogs/\nQuentyn's Duty and Destiny: https://meereeneseblot.wordpress.com/2014/03/11/water-gardens-and-blood-oranges-part-iii-quentyns-duty-and-destiny/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The question of Quentyn&amp;#39;s death pops out from time to time so I&amp;#39;ll just quote an old comment to Preston&amp;#39;s video about Quentyn&amp;#39;s fate by &lt;a href=\"/u/Bookshelfstud\"&gt;u/Bookshelfstud&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As usual with anyone who claims Quentyn is alive: no. &lt;/p&gt;\n\n&lt;p&gt;Quentyn is dead. Utterly, totally dead. He&amp;#39;s dead for the same reason Syrio, Ned, Tywin, and Robb are dead: because it&amp;#39;s important, not only to the plot, but to the ideas that GRRM is trying to impart.&lt;/p&gt;\n\n&lt;p&gt;Quentyn &lt;em&gt;has&lt;/em&gt; to be dead because his death is the cost of Doran&amp;#39;s piss-poor plotting. Doran doesn&amp;#39;t have a master plan. When we see him in ADWD, he&amp;#39;s desperate, sad; he knows the truth already, and the truth is that he sent his son to die in a strange place across the sea, alone, terrified. Quentyn is dead because his death is the cost of Doran&amp;#39;s slow revenge plot; Quentyn is dead because GRRM wants us to see that by pressing his old grievances, Doran can&amp;#39;t help but hurt innocent people. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s setting aside all the plot reasons (Q is dead to force Doran&amp;#39;s hand in backing Aegon, for example). It might be tempting to look at all this circumstantial evidence and say &amp;quot;well, he could be alive.&amp;quot; It&amp;#39;s one thing to take a quote like &amp;quot;burned bones mean nothing&amp;quot; and say &amp;quot;Well, how do we know that burned-up freak body really is Quentyn?&amp;quot; but you can&amp;#39;t stop the analysis there! When Hazzea dies to the dragons, Dany tries to deny that it&amp;#39;s possible, but deep down she knows that it was Drogon, and that Drogon murdered a child. THAT is what GRRM is telling us there; he&amp;#39;s foreshadowing that the dragons hurt innocent people, and that we can&amp;#39;t deny that as much as we might want to. Yeah, that quote is about Quentyn; it&amp;#39;s about how the truth is that dragons kill the innocents, and Quentyn is the consummate (lol) innocent.&lt;/p&gt;\n\n&lt;p&gt;Never mind the fact that Quentyn is literally burning at the end of his chapter, never mind that we have multiple character all corroborating his death, never mind that Barristan&amp;#39;s relevant chapter opens with the line &amp;quot;The Dornish prince was three days dying&amp;quot; - never mind all the plot evidence that Quentyn is dead. Quentyn Martell is dead because GRRM needs him dead. It&amp;#39;s the final punchline to a story that systematically takes down adventure stories. It&amp;#39;s the natural conclusion to a story about someone who isn&amp;#39;t a hero. &lt;/p&gt;\n\n&lt;p&gt;Quentyn Martell is dead. I honestly can&amp;#39;t believe how disingenuous this video is. I know this channel has been called the Ancient Aliens of ASOIAF, and it&amp;#39;s true. It&amp;#39;s true because Ancient Aliens deliberately misrepresents real evidence to create an entire bullshit narrative out of whole cloth. Almost every sentence in this video has something misleading in it (&amp;quot;Didn&amp;#39;t Dany walk into the flames only to end up alive?&amp;quot; Well, given that GRRM has said that was a &lt;strong&gt;one-time&lt;/strong&gt; magical event, I wouldn&amp;#39;t exactly use that as evidence that Q is alive). Someone else can do a point-by-point breakdown of how this is wrong if they want. &lt;/p&gt;\n\n&lt;p&gt;Sorry to break it to you, folks, but Quentyn Martell is dead as a doornail.&lt;/p&gt;\n\n&lt;p&gt;Further reading:\nIn Defense of Mud: &lt;a href=\"https://www.reddit.com/r/asoiaf/comments/2texff/spoilers_all_in_defense_of_mud_why_prince_frogs/\"&gt;https://www.reddit.com/r/asoiaf/comments/2texff/spoilers_all_in_defense_of_mud_why_prince_frogs/&lt;/a&gt;\nQuentyn&amp;#39;s Duty and Destiny: &lt;a href=\"https://meereeneseblot.wordpress.com/2014/03/11/water-gardens-and-blood-oranges-part-iii-quentyns-duty-and-destiny/\"&gt;https://meereeneseblot.wordpress.com/2014/03/11/water-gardens-and-blood-oranges-part-iii-quentyns-duty-and-destiny/&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5rrqr", "score_hidden": false, "stickied": false, "created": 1492027590.0, "created_utc": 1491998790.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg5wnc9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TeoKajLibroj", "parent_id": "t1_dg5w988", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "It says a dragon snuck up on him, he felt fire and then screamed. Then later Barristan says he's dead. I don't think it can get much clearer than that. If he survived, where is he, why didn't his friends escape with him, why did they think he got burnt if he didn't. It raises far too many unaswered questions and ignores the fact that Quentyn had fulfilled his arc and purpose in the story (a cynical version of a hero's story)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It says a dragon snuck up on him, he felt fire and then screamed. Then later Barristan says he&amp;#39;s dead. I don&amp;#39;t think it can get much clearer than that. If he survived, where is he, why didn&amp;#39;t his friends escape with him, why did they think he got burnt if he didn&amp;#39;t. It raises far too many unaswered questions and ignores the fact that Quentyn had fulfilled his arc and purpose in the story (a cynical version of a hero&amp;#39;s story)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5wnc9", "score_hidden": false, "stickied": false, "created": 1492035009.0, "created_utc": 1492006209.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5w988", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "smoothisfast22", "parent_id": "t1_dg5rxqb", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "The text said he began to scream. Then we're told he's dead By his knights. And the body was burned beyond recognition. \n\nI think he's dead too, but there's an argument to be made. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The text said he began to scream. Then we&amp;#39;re told he&amp;#39;s dead By his knights. And the body was burned beyond recognition. &lt;/p&gt;\n\n&lt;p&gt;I think he&amp;#39;s dead too, but there&amp;#39;s an argument to be made. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5w988", "score_hidden": false, "stickied": false, "created": 1492034512.0, "created_utc": 1492005712.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dol1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TeoKajLibroj", "parent_id": "t1_dg67qak", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; Seriously? You are asking who has been on fire and hasn't died? Me. I set my hair on fire once, I didn't die.\n&gt; \n\nI meant in the book.\n\n&gt; If he was hit by dragonfire he wouldn't say that it went from his whip to his clothes, he would say that an F'ing dragon blew this cyclone of fire at him and it burned him to a crisp right away.\n\nGRRM was being literary. The book would be very dull if everything is bluntly stated. Instead Martin uses some narrative flourishes and elements of unreliable narrative, like calling it \"furnace wind\" instead of just blandly stating it was fire from a dragon.\n\n&gt; there's no way that the dragon could have set Quentyn on fire. It came from behind him, the text clearly states that.\n\nI'm not sure what the source of your confusion is. The quote in my comment above shows Gerris telling Quentyn to look behind him, he turns, sees the dragon and is burnt. It doesn't directly say which direction it came from as there is a delay before he notices he is burning (either due to shock or because all the thoughts take place over a split second).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Seriously? You are asking who has been on fire and hasn&amp;#39;t died? Me. I set my hair on fire once, I didn&amp;#39;t die.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I meant in the book.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If he was hit by dragonfire he wouldn&amp;#39;t say that it went from his whip to his clothes, he would say that an F&amp;#39;ing dragon blew this cyclone of fire at him and it burned him to a crisp right away.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;GRRM was being literary. The book would be very dull if everything is bluntly stated. Instead Martin uses some narrative flourishes and elements of unreliable narrative, like calling it &amp;quot;furnace wind&amp;quot; instead of just blandly stating it was fire from a dragon.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;there&amp;#39;s no way that the dragon could have set Quentyn on fire. It came from behind him, the text clearly states that.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m not sure what the source of your confusion is. The quote in my comment above shows Gerris telling Quentyn to look behind him, he turns, sees the dragon and is burnt. It doesn&amp;#39;t directly say which direction it came from as there is a delay before he notices he is burning (either due to shock or because all the thoughts take place over a split second).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6dol1", "score_hidden": false, "stickied": false, "created": 1492053135.0, "created_utc": 1492024335.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67qak", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "pikkdogs", "parent_id": "t1_dg63pvk", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Seriously? You are asking who has been on fire and hasn't died? Me. I set my hair on fire once, I didn't die.  \n\nEven if the moment is slowed down, that still doesn't explain why the fire comes from behind him.  He brings his whip forward and he notices its on fire and it spreads to his clothes.  If he was hit by dragonfire he wouldn't say that it went from his whip to his clothes, he would say that an F'ing dragon blew this cyclone of fire at him and it burned him to a crisp right away.  Unless the dragon shrunk itself and landed on his whip, there's no way that the dragon could have set Quentyn on fire.  It came from behind him, the text clearly states that.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seriously? You are asking who has been on fire and hasn&amp;#39;t died? Me. I set my hair on fire once, I didn&amp;#39;t die.  &lt;/p&gt;\n\n&lt;p&gt;Even if the moment is slowed down, that still doesn&amp;#39;t explain why the fire comes from behind him.  He brings his whip forward and he notices its on fire and it spreads to his clothes.  If he was hit by dragonfire he wouldn&amp;#39;t say that it went from his whip to his clothes, he would say that an F&amp;#39;ing dragon blew this cyclone of fire at him and it burned him to a crisp right away.  Unless the dragon shrunk itself and landed on his whip, there&amp;#39;s no way that the dragon could have set Quentyn on fire.  It came from behind him, the text clearly states that.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg67qak", "score_hidden": false, "stickied": false, "created": 1492047045.0, "created_utc": 1492018245.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg63pvk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TeoKajLibroj", "parent_id": "t1_dg60vw0", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; Many people have been on fire and haven't died.\n\nWho other than Dany?\n\n&gt; He faces the dragon, brings his whip up and the fire spreads from the whip to his clothes.\n\nA lot of people misread this part. The fire isn't slowly spreading from the whip to his arm. It doesn't happen over several seconds, it's instantaneous. The final paragragh occurs in a split second, it's a common narrative technique to slow down a characters death so that they observe several things in their last second. \n\nSo the fire has engulfed all of Quentyn, he just notices the whip first, then his hand etc. All of him is burning, GRRM just made a narrative decision to describe it piece by piece. That's the same reason the chapter ends where it does, it's more dramatic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Many people have been on fire and haven&amp;#39;t died.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Who other than Dany?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;He faces the dragon, brings his whip up and the fire spreads from the whip to his clothes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A lot of people misread this part. The fire isn&amp;#39;t slowly spreading from the whip to his arm. It doesn&amp;#39;t happen over several seconds, it&amp;#39;s instantaneous. The final paragragh occurs in a split second, it&amp;#39;s a common narrative technique to slow down a characters death so that they observe several things in their last second. &lt;/p&gt;\n\n&lt;p&gt;So the fire has engulfed all of Quentyn, he just notices the whip first, then his hand etc. All of him is burning, GRRM just made a narrative decision to describe it piece by piece. That&amp;#39;s the same reason the chapter ends where it does, it&amp;#39;s more dramatic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg63pvk", "score_hidden": false, "stickied": false, "created": 1492042934.0, "created_utc": 1492014134.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg60vw0", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "pikkdogs", "parent_id": "t1_dg5wyux", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "We are not firsthand witnesses of his death. The chapter cuts off when he gets set on fire. Many people have been on fire and haven't died. \n\nIt's right there in the text you quoted. He faces the dragon, brings his whip up and the fire spreads from the whip to his clothes. If it was from the dragon it would come from in front of him, not behind. The whip would not have been the first thing to catch fire if the fire came from in front of him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We are not firsthand witnesses of his death. The chapter cuts off when he gets set on fire. Many people have been on fire and haven&amp;#39;t died. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s right there in the text you quoted. He faces the dragon, brings his whip up and the fire spreads from the whip to his clothes. If it was from the dragon it would come from in front of him, not behind. The whip would not have been the first thing to catch fire if the fire came from in front of him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg60vw0", "score_hidden": false, "stickied": false, "created": 1492039862.0, "created_utc": 1492011062.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wyux", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TeoKajLibroj", "parent_id": "t1_dg5v2q4", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "What we hear about the Hound is second hand information, but we are first hand witnesses to the death of Quentyn. Are you suggesting that he somehow walked into a torch and that's what made him catch on fire?\n\nI reread the passage and it's super clear that it was dragon fire, not torch fire. \n\n&gt; And then a hot wind buffeted him and he heard the sound of leathern wings and the air was full of ash and cinders and a monstrous roar went echoing off the scorched and blackened bricks and he could hear his friends shouting wildly. Gerris was calling out his name, over and over, and the big man was bellowing, “Behind you, behind you, behind you!”\n\n&gt; Quentyn turned and threw his left arm across his face to shield his eyes from the furnace wind. Rhaegal, he reminded himself, the green one is Rhaegal. When he raised his whip, he saw that the lash was burning. His hand as well. All of him, all of him was burning. Oh, he thought. Then he began to scream.\n\nHe turns around and sees a dragon, feels \"the furnace wind\" (dragonfire) and realises he is completely on fire. He's clearly been burnt by a dragon.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What we hear about the Hound is second hand information, but we are first hand witnesses to the death of Quentyn. Are you suggesting that he somehow walked into a torch and that&amp;#39;s what made him catch on fire?&lt;/p&gt;\n\n&lt;p&gt;I reread the passage and it&amp;#39;s super clear that it was dragon fire, not torch fire. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And then a hot wind buffeted him and he heard the sound of leathern wings and the air was full of ash and cinders and a monstrous roar went echoing off the scorched and blackened bricks and he could hear his friends shouting wildly. Gerris was calling out his name, over and over, and the big man was bellowing, “Behind you, behind you, behind you!”&lt;/p&gt;\n\n&lt;p&gt;Quentyn turned and threw his left arm across his face to shield his eyes from the furnace wind. Rhaegal, he reminded himself, the green one is Rhaegal. When he raised his whip, he saw that the lash was burning. His hand as well. All of him, all of him was burning. Oh, he thought. Then he began to scream.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He turns around and sees a dragon, feels &amp;quot;the furnace wind&amp;quot; (dragonfire) and realises he is completely on fire. He&amp;#39;s clearly been burnt by a dragon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5wyux", "score_hidden": false, "stickied": false, "created": 1492035403.0, "created_utc": 1492006603.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v2q4", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "pikkdogs", "parent_id": "t1_dg5rxqb", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Sure. We are also told that the Hound raised the Saltpans. But nobody believes that either. \n\nWhat the text shows is that he never hit any dragon flame. It was torch flame. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure. We are also told that the Hound raised the Saltpans. But nobody believes that either. &lt;/p&gt;\n\n&lt;p&gt;What the text shows is that he never hit any dragon flame. It was torch flame. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5v2q4", "score_hidden": false, "stickied": false, "created": 1492032947.0, "created_utc": 1492004147.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5rxqb", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "TeoKajLibroj", "parent_id": "t1_dg5qu17", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "The text directly says that Quentyn was burnt by a dragon and is dead. There's no ambiguity or hints, we are told he died.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The text directly says that Quentyn was burnt by a dragon and is dead. There&amp;#39;s no ambiguity or hints, we are told he died.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5rxqb", "score_hidden": false, "stickied": false, "created": 1492027913.0, "created_utc": 1491999113.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qu17", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "pikkdogs", "parent_id": "t1_dg5fl21", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I doubt it. The text doesn't support that. The chapter cuts off with him being set on fire from a torch (the fire comes from behind him and the only fire behind him were from torches), and when it comes back Arch has his sword out standing over the body (why would you need a sword when you are caring for your friend?). And the body's damage is not consistent with Quentyn's damage. Quentyn covered his eyes, the body has exploded eyes. \n\nI can't tell you that he's alive, but the text sure makes it sounds like there was a body switch. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I doubt it. The text doesn&amp;#39;t support that. The chapter cuts off with him being set on fire from a torch (the fire comes from behind him and the only fire behind him were from torches), and when it comes back Arch has his sword out standing over the body (why would you need a sword when you are caring for your friend?). And the body&amp;#39;s damage is not consistent with Quentyn&amp;#39;s damage. Quentyn covered his eyes, the body has exploded eyes. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t tell you that he&amp;#39;s alive, but the text sure makes it sounds like there was a body switch. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5qu17", "score_hidden": false, "stickied": false, "created": 1492025622.0, "created_utc": 1491996822.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5fl21", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "BaelBard", "parent_id": "t1_dg52izo", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Quentyn is dead\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Quentyn is dead&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5fl21", "score_hidden": false, "stickied": false, "created": 1491997892.0, "created_utc": 1491969092.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg7gdpe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pikkdogs", "parent_id": "t1_dg77ppy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "True, however, I don't think Doran knew that. Doran's been planning this for a long time, and Quentyn has been living with the Yronwoods for most of his life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;True, however, I don&amp;#39;t think Doran knew that. Doran&amp;#39;s been planning this for a long time, and Quentyn has been living with the Yronwoods for most of his life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7gdpe", "score_hidden": false, "stickied": false, "created": 1492114248.0, "created_utc": 1492085448.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg77ppy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DaneFairchild", "parent_id": "t1_dg52izo", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "That doesn't make sense, Doran didn't need to teach Quentyn the lesson that adventure stank.  Quentyn wasn't an Oberyn wanna-be, he would have been happy to stay home and marry the Yronwood girl and live a quiet life.  He got pushed into an adventure he never wanted but felt obligated to complete lest he be branded a failure.  Boiling foreign political hotbeds and war zones are not places for a \"safe\" failure.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That doesn&amp;#39;t make sense, Doran didn&amp;#39;t need to teach Quentyn the lesson that adventure stank.  Quentyn wasn&amp;#39;t an Oberyn wanna-be, he would have been happy to stay home and marry the Yronwood girl and live a quiet life.  He got pushed into an adventure he never wanted but felt obligated to complete lest he be branded a failure.  Boiling foreign political hotbeds and war zones are not places for a &amp;quot;safe&amp;quot; failure.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg77ppy", "score_hidden": false, "stickied": false, "created": 1492091192.0, "created_utc": 1492062392.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52izo", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "pikkdogs", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 1, "body": "You mostly got it, he is playing the long game. \n\nBut, you misunderstand the Quentyn quest.  The goal of the Quentyn quest was to have Quentyn safely fail.  Why else would Doran send Quentyn out with Doran's greatest enemies and withhold the sizeable amount of hope he could have given him?  The point of the Quentyn quest is the first sentence of the first chapter, \"adventure stank.\" He is trying to teach his son a lesson that grand adventures do not make someone great, they get them killed.  Quentyn just didn't want to accept that and decided to tame a dragon, which we don't know if he did that or not.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You mostly got it, he is playing the long game. &lt;/p&gt;\n\n&lt;p&gt;But, you misunderstand the Quentyn quest.  The goal of the Quentyn quest was to have Quentyn safely fail.  Why else would Doran send Quentyn out with Doran&amp;#39;s greatest enemies and withhold the sizeable amount of hope he could have given him?  The point of the Quentyn quest is the first sentence of the first chapter, &amp;quot;adventure stank.&amp;quot; He is trying to teach his son a lesson that grand adventures do not make someone great, they get them killed.  Quentyn just didn&amp;#39;t want to accept that and decided to tame a dragon, which we don&amp;#39;t know if he did that or not.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg52izo", "score_hidden": false, "stickied": false, "created": 1491980078.0, "created_utc": 1491951278.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg4w1u0", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "TeoKajLibroj", "parent_id": "t1_dg4s8wy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Thanks for the link it's an interesting channel. Unfortunately, he doesn't seem to have much evidence for his claims and just states wild theories as if they are facts. It's like he decided the Martells are geniuses and then gives them praise for everything. If he lost his keys, he could probably explain about how this was all part of the master plan.\n\n* For example, he takes it as given that Oberyn is connected with the Brave Companions, even though it's an extremely weak link. \n* He says they are obsessed with religion and the only evidence is a former septon, a single member who is called \"Faithful\" and a dying man calling to the Mother. That's very weak.\n* He says the Brave Companions changed sides for no reason, does he not remember that Harrenhal was captured, therefore they jumped over to the winning side?\n* They killed Lorch to prove their loyalty (and because they're a debauched bunch of murderers)\n* Is it more likely that they raised churches as part of a master plan or because they're greedy for gold? Also, there's no way they could have created the sparrow movement alone.\n* Was Tywin poisoned, or is it more likely that old men's bodies don't work perfectly? How could Oberyn even get close enough to poison Tywin?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the link it&amp;#39;s an interesting channel. Unfortunately, he doesn&amp;#39;t seem to have much evidence for his claims and just states wild theories as if they are facts. It&amp;#39;s like he decided the Martells are geniuses and then gives them praise for everything. If he lost his keys, he could probably explain about how this was all part of the master plan.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;For example, he takes it as given that Oberyn is connected with the Brave Companions, even though it&amp;#39;s an extremely weak link. &lt;/li&gt;\n&lt;li&gt;He says they are obsessed with religion and the only evidence is a former septon, a single member who is called &amp;quot;Faithful&amp;quot; and a dying man calling to the Mother. That&amp;#39;s very weak.&lt;/li&gt;\n&lt;li&gt;He says the Brave Companions changed sides for no reason, does he not remember that Harrenhal was captured, therefore they jumped over to the winning side?&lt;/li&gt;\n&lt;li&gt;They killed Lorch to prove their loyalty (and because they&amp;#39;re a debauched bunch of murderers)&lt;/li&gt;\n&lt;li&gt;Is it more likely that they raised churches as part of a master plan or because they&amp;#39;re greedy for gold? Also, there&amp;#39;s no way they could have created the sparrow movement alone.&lt;/li&gt;\n&lt;li&gt;Was Tywin poisoned, or is it more likely that old men&amp;#39;s bodies don&amp;#39;t work perfectly? How could Oberyn even get close enough to poison Tywin?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4w1u0", "score_hidden": false, "stickied": false, "created": 1491972146.0, "created_utc": 1491943346.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg4xklb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "universe_throb", "parent_id": "t1_dg4s8wy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Probably my favorite Preston Jacobs video series, right up there with the Tower of Joy and Littlefinger Debt Scheme.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Probably my favorite Preston Jacobs video series, right up there with the Tower of Joy and Littlefinger Debt Scheme.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4xklb", "score_hidden": false, "stickied": false, "created": 1491973901.0, "created_utc": 1491945101.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg4z4dq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "EmmEnnEff", "parent_id": "t1_dg4yb96", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "She's a much kinder person, is not batshit crazy, and wants the best for her family - but will probably bring about its downfall.\n\nTywin Lannister's shitty parenting is widely derided for bringing down House Lannister - Doran's track record as head of the family isn't looking too great. He is also a much better, less cruel man then Tywin, but I can't see things turning out well for him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s a much kinder person, is not batshit crazy, and wants the best for her family - but will probably bring about its downfall.&lt;/p&gt;\n\n&lt;p&gt;Tywin Lannister&amp;#39;s shitty parenting is widely derided for bringing down House Lannister - Doran&amp;#39;s track record as head of the family isn&amp;#39;t looking too great. He is also a much better, less cruel man then Tywin, but I can&amp;#39;t see things turning out well for him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4z4dq", "score_hidden": false, "stickied": false, "created": 1491975768.0, "created_utc": 1491946968.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4yb96", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "UsernameSnatcher", "parent_id": "t1_dg4xl1g", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Yes, that's true. It wasn't going to end well in Arianne's hands. \n\nHowever, as of her TWOW chapters she does seem to want to work with her father instead of against him, so I'm hopeful. For all Arianne's faults she will never be as terrible as Cersei - she is essentially a kinder person and never hated Quentyn near as much as Cersei hated Tyrion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, that&amp;#39;s true. It wasn&amp;#39;t going to end well in Arianne&amp;#39;s hands. &lt;/p&gt;\n\n&lt;p&gt;However, as of her TWOW chapters she does seem to want to work with her father instead of against him, so I&amp;#39;m hopeful. For all Arianne&amp;#39;s faults she will never be as terrible as Cersei - she is essentially a kinder person and never hated Quentyn near as much as Cersei hated Tyrion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4yb96", "score_hidden": false, "stickied": false, "created": 1491974794.0, "created_utc": 1491945994.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4xl1g", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "EmmEnnEff", "parent_id": "t1_dg4vudi", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "If Doran was telling her the truth (About Dorne's military position), it was hare-brained, because Dorne could never stand alone against the Iron Throne - not without dragons.\n\nEven if the execution carried out without a hitch (No betrayals to Doran, no betrayals by Darkstar), it would have spelled the end of Dorne, and House Martell.\n\nThis is Cersei, or Ramsey-level impulse control, here. From the princess of Dorne - who has harboured a decade of resentment against her father, for being kept completely in the dark. Doran's worst enemies are all in his family. (Even if they mean well.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If Doran was telling her the truth (About Dorne&amp;#39;s military position), it was hare-brained, because Dorne could never stand alone against the Iron Throne - not without dragons.&lt;/p&gt;\n\n&lt;p&gt;Even if the execution carried out without a hitch (No betrayals to Doran, no betrayals by Darkstar), it would have spelled the end of Dorne, and House Martell.&lt;/p&gt;\n\n&lt;p&gt;This is Cersei, or Ramsey-level impulse control, here. From the princess of Dorne - who has harboured a decade of resentment against her father, for being kept completely in the dark. Doran&amp;#39;s worst enemies are all in his family. (Even if they mean well.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4xl1g", "score_hidden": false, "stickied": false, "created": 1491973917.0, "created_utc": 1491945117.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4vudi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "UsernameSnatcher", "parent_id": "t1_dg4vg1v", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;leading her to hatch a hare-brained plot to Queen Myrcella.\n\nNot totally harebrained if Oberyn had given Tyrion hints about it first. The execution was shoddy and badly planned, but I think that was borne out of a need for her to act fast once news of Oberyn dying reached Dorne.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;leading her to hatch a hare-brained plot to Queen Myrcella.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not totally harebrained if Oberyn had given Tyrion hints about it first. The execution was shoddy and badly planned, but I think that was borne out of a need for her to act fast once news of Oberyn dying reached Dorne.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4vudi", "score_hidden": false, "stickied": false, "created": 1491971917.0, "created_utc": 1491943117.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4vg1v", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "EmmEnnEff", "parent_id": "t1_dg4t9hb", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Doran sending the Sand Snakes to King's landing, with orders not to do anything rash is incredibly stupid. He knows his family. He knows how willful they are. He keeps them completely in the dark from his schemes, which leads them to undermine all his carefully laid plans.\n\nFor the Seventh's sake, he completely keeps his daughter and heir - a grown woman - in the dark - leading her to hatch a hare-brained plot to Queen Myrcella.\n\nHe may have a lot of plots going, but they all turn to ashes (Viserys, Quentyn), or are sabotaged by the family he can't keep in check. (Oberyn, Arienne.)\n\nYou know which other lords couldn't keep scheming in their families in check? Tywin Lannister, Walder Frey, and Roose Bolton. The latter two are currently in neck-and-neck competition for 'Least likely noble in Westeros to get a happy ending.'", "edited": 1491943157.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Doran sending the Sand Snakes to King&amp;#39;s landing, with orders not to do anything rash is incredibly stupid. He knows his family. He knows how willful they are. He keeps them completely in the dark from his schemes, which leads them to undermine all his carefully laid plans.&lt;/p&gt;\n\n&lt;p&gt;For the Seventh&amp;#39;s sake, he completely keeps his daughter and heir - a grown woman - in the dark - leading her to hatch a hare-brained plot to Queen Myrcella.&lt;/p&gt;\n\n&lt;p&gt;He may have a lot of plots going, but they all turn to ashes (Viserys, Quentyn), or are sabotaged by the family he can&amp;#39;t keep in check. (Oberyn, Arienne.)&lt;/p&gt;\n\n&lt;p&gt;You know which other lords couldn&amp;#39;t keep scheming in their families in check? Tywin Lannister, Walder Frey, and Roose Bolton. The latter two are currently in neck-and-neck competition for &amp;#39;Least likely noble in Westeros to get a happy ending.&amp;#39;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4vg1v", "score_hidden": false, "stickied": false, "created": 1491971470.0, "created_utc": 1491942670.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64sxpv", "likes": null, "replies": "", "user_reports": [], "id": "dg60eg9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Daverade", "parent_id": "t1_dg4yx2j", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;Tywin is very careful and would have known of Oberyn's reputation for poison and his hatred of Lannisters.\n\nI've seen people argue that this was Oberyn's plan from the beginning. He wanted to poison and kill Tywin, get arrested, and then challenge the Mountain in a trial by combat. Joffery's death and Tyrion's trial was a lucky coincidence. It seems plausible considering Oberyn declared he came for vengeance yet seemingly took no steps to achieve it until one was giftwrapped for him. As for why he had to steal the poison, perhaps it is part of his plan of getting caught.\n\nGetting close to Tywin probably wouldn't be impossible. They sat on the same trial together, attended a wedding together, and IIRC Oberyn sat in on a council meeting or two. Certainly not easy, but not impossible.\n\nOf course, this is all speculative considering he got his head smashed, and ultimately it doesn't matter. The Red Viper of Dorne became the Red Puddle of Dorne either way.\n\nBut I like your point about powerful figures and their feet of clay. Melisandre is a good example of that. She's half magic, half smoke and mirrors. Reputation and optics are crucial for these characters.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Tywin is very careful and would have known of Oberyn&amp;#39;s reputation for poison and his hatred of Lannisters.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;ve seen people argue that this was Oberyn&amp;#39;s plan from the beginning. He wanted to poison and kill Tywin, get arrested, and then challenge the Mountain in a trial by combat. Joffery&amp;#39;s death and Tyrion&amp;#39;s trial was a lucky coincidence. It seems plausible considering Oberyn declared he came for vengeance yet seemingly took no steps to achieve it until one was giftwrapped for him. As for why he had to steal the poison, perhaps it is part of his plan of getting caught.&lt;/p&gt;\n\n&lt;p&gt;Getting close to Tywin probably wouldn&amp;#39;t be impossible. They sat on the same trial together, attended a wedding together, and IIRC Oberyn sat in on a council meeting or two. Certainly not easy, but not impossible.&lt;/p&gt;\n\n&lt;p&gt;Of course, this is all speculative considering he got his head smashed, and ultimately it doesn&amp;#39;t matter. The Red Viper of Dorne became the Red Puddle of Dorne either way.&lt;/p&gt;\n\n&lt;p&gt;But I like your point about powerful figures and their feet of clay. Melisandre is a good example of that. She&amp;#39;s half magic, half smoke and mirrors. Reputation and optics are crucial for these characters.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg60eg9", "score_hidden": false, "stickied": false, "created": 1492039334.0, "created_utc": 1492010534.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4yx2j", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "TeoKajLibroj", "parent_id": "t1_dg4y6ux", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; Doran has got to have a better plan than what is presented to us, which Preston Jacobs makes early on in his series. The incredibly detailed plan that took 17 years to carefully arrange consists of two shoddy marriage pacts with debased Targaryens. Why? That's like the worst plan ever. Most importantly, that is FAR riskier than any of the alternatives you have presented.\n\nI couldn't agree more. So far, I've seen nothing impressive about his plan, so maybe there will be a big surprise in TWOW.\n\n&gt; The fact that Shae was asleep on the bed implies Tywin has been on the toilet for a bit of time, and the fact that his bowels didn't release until his death implies constipation, and Tyrion even says that Tywin looks ill, and his corpse smells particularly bad. Combin that with Pycelle calling out the effects of a poison missing from his stores that did the exact same thing that appears to be happening to Tywin.\n\nMaybe, maybe not. Old people get sick and GRRM loves pointing out how powerful people have feet of clay, so the idea of one of the most powerful men being unable to take a dump and being killed on the toilet is keeping with his tone. Plus it allows him to make a joke about Tywin shitting gold.\n\nWhy would Oberyn need to steal poison? Surely he would have his own stock and a raid would be really dangerous and possibly raise an alarm. Also how could he get close enough to give Tywin the posion? Tywin is very careful and would have known of Oberyn's reputation for poison and his hatred of Lannisters.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Doran has got to have a better plan than what is presented to us, which Preston Jacobs makes early on in his series. The incredibly detailed plan that took 17 years to carefully arrange consists of two shoddy marriage pacts with debased Targaryens. Why? That&amp;#39;s like the worst plan ever. Most importantly, that is FAR riskier than any of the alternatives you have presented.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I couldn&amp;#39;t agree more. So far, I&amp;#39;ve seen nothing impressive about his plan, so maybe there will be a big surprise in TWOW.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The fact that Shae was asleep on the bed implies Tywin has been on the toilet for a bit of time, and the fact that his bowels didn&amp;#39;t release until his death implies constipation, and Tyrion even says that Tywin looks ill, and his corpse smells particularly bad. Combin that with Pycelle calling out the effects of a poison missing from his stores that did the exact same thing that appears to be happening to Tywin.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Maybe, maybe not. Old people get sick and GRRM loves pointing out how powerful people have feet of clay, so the idea of one of the most powerful men being unable to take a dump and being killed on the toilet is keeping with his tone. Plus it allows him to make a joke about Tywin shitting gold.&lt;/p&gt;\n\n&lt;p&gt;Why would Oberyn need to steal poison? Surely he would have his own stock and a raid would be really dangerous and possibly raise an alarm. Also how could he get close enough to give Tywin the posion? Tywin is very careful and would have known of Oberyn&amp;#39;s reputation for poison and his hatred of Lannisters.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4yx2j", "score_hidden": false, "stickied": false, "created": 1491975522.0, "created_utc": 1491946722.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4y6ux", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Daverade", "parent_id": "t1_dg4wl38", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Yeah man, I agree with a lot of what you have to say. There are certainly faster ways to get vengeance, and maybe there were opportunities that could have been successful, but ultimately they all incur a level of risk that is inconsistent with the character, and that's the point.\n\nI'll even concede that maybe the Dornish Master Plan is all crap except for one bit. Doran has got to have a better plan than what is presented to us, which Preston Jacobs makes early on in his series. The incredibly detailed plan that took 17 years to carefully arrange consists of two shoddy marriage pacts with debased Targaryens. Why? That's like the worst plan ever. Most importantly, that is FAR riskier than any of the alternatives you have presented. He's supposed to be the most cautious man in Westeros, and his plan boils down to waiting 17 years only to bet the house on whichever Targ says yes. It's all so weird, flimsy, and out of character. For a supposed master schemer, the guy has virtually no plan at all. \n\nSo, either Doran is an utter fool, or perhaps we as readers are lead to believe the same thing as the rest of the realm. I sincerely hope it's the latter and Doran has something up his sleeve that has yet to be revealed. \n\n\nAs a side note, look into some of the theories as to why Tywin may have already been poisoned. I think this one holds water. The fact that Shae was asleep on the bed implies Tywin has been on the toilet for a bit of time, and the fact that his bowels didn't release until his death implies constipation, and Tyrion even says that Tywin looks ill, and his corpse smells particularly bad. Combin that with Pycelle calling out the effects of a poison missing from his stores that did the exact same thing that appears to be happening to Tywin. It's enough for me to believe that he was also poisoned. Oberyn has the motive, the knowledge of poisons, and says he's there for vengeance.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah man, I agree with a lot of what you have to say. There are certainly faster ways to get vengeance, and maybe there were opportunities that could have been successful, but ultimately they all incur a level of risk that is inconsistent with the character, and that&amp;#39;s the point.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll even concede that maybe the Dornish Master Plan is all crap except for one bit. Doran has got to have a better plan than what is presented to us, which Preston Jacobs makes early on in his series. The incredibly detailed plan that took 17 years to carefully arrange consists of two shoddy marriage pacts with debased Targaryens. Why? That&amp;#39;s like the worst plan ever. Most importantly, that is FAR riskier than any of the alternatives you have presented. He&amp;#39;s supposed to be the most cautious man in Westeros, and his plan boils down to waiting 17 years only to bet the house on whichever Targ says yes. It&amp;#39;s all so weird, flimsy, and out of character. For a supposed master schemer, the guy has virtually no plan at all. &lt;/p&gt;\n\n&lt;p&gt;So, either Doran is an utter fool, or perhaps we as readers are lead to believe the same thing as the rest of the realm. I sincerely hope it&amp;#39;s the latter and Doran has something up his sleeve that has yet to be revealed. &lt;/p&gt;\n\n&lt;p&gt;As a side note, look into some of the theories as to why Tywin may have already been poisoned. I think this one holds water. The fact that Shae was asleep on the bed implies Tywin has been on the toilet for a bit of time, and the fact that his bowels didn&amp;#39;t release until his death implies constipation, and Tyrion even says that Tywin looks ill, and his corpse smells particularly bad. Combin that with Pycelle calling out the effects of a poison missing from his stores that did the exact same thing that appears to be happening to Tywin. It&amp;#39;s enough for me to believe that he was also poisoned. Oberyn has the motive, the knowledge of poisons, and says he&amp;#39;s there for vengeance.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4y6ux", "score_hidden": false, "stickied": false, "created": 1491974647.0, "created_utc": 1491945847.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4wl38", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "TeoKajLibroj", "parent_id": "t1_dg4t9hb", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; Robert is not his enemy.\n\nOf course he is. Doran is a Targaryan loyalist, so he wanted Robert removed so that the Targaryans could return. Even though Robert didn't order Elia's murder, he condoned it and didn't punish the killers. That would earn Doran's wrath.\n\n&gt; He and Oberyn had to breed their own conspirators.\n\nThat's a terrible plan. Imagine if Robb Stark tried to avenge his fathers death by breeding assassins? That would just be stupid. It requires waiting decades with no guarantee that the children are any good at fighting. Far easier to hire someone.\n\n&gt; If Qyburn and the Brave Companions are indeed working for Doran, that's a pretty covert way to kill Ser Amory Lorch and main Jaime.\n\nIt's incredibly convoluted and requires waiting 16 years. There's also no way he could have known in advance that Lorch and Jamie would be caught by them so how could he give them orders in advance?\n\n&gt; Perhaps he doesn't actually care about them.\n\nWell then his fire and blood speech was a lie.\n\n&gt; It's still too risky. Dorne will lose in any one on one fight against any other Kingdom and no side is fighting alone.\n\nThen ally with another. Join the Starks or Greyjoys against the Lannisters. It's far less convoluted and actually involves getting revenge.\n\n&gt; Better to let the realm exhaust itself for a few years and pounce on whoever is King of the ashes.\n\nExcept that gives the battered Lannisters breathing space and time to rebuild. Instead of having their back against the wall, they now have most of the realm behind them so it would be far worse to challenge them now.\n\n&gt; Doran would have found himself in league with Renly in the Stormlands and the Tyrells in the Reach only for Renly to die and the Reach to switch to his enemy's side. \n\nBut they would have ensured Stannis won the battle of the Blackwater, so the Lannisters would have been wiped out, fulfilling the revenge plan. The Stormlands would be isolated against the Starks, Stannis and Dorne.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Robert is not his enemy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Of course he is. Doran is a Targaryan loyalist, so he wanted Robert removed so that the Targaryans could return. Even though Robert didn&amp;#39;t order Elia&amp;#39;s murder, he condoned it and didn&amp;#39;t punish the killers. That would earn Doran&amp;#39;s wrath.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;He and Oberyn had to breed their own conspirators.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s a terrible plan. Imagine if Robb Stark tried to avenge his fathers death by breeding assassins? That would just be stupid. It requires waiting decades with no guarantee that the children are any good at fighting. Far easier to hire someone.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If Qyburn and the Brave Companions are indeed working for Doran, that&amp;#39;s a pretty covert way to kill Ser Amory Lorch and main Jaime.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s incredibly convoluted and requires waiting 16 years. There&amp;#39;s also no way he could have known in advance that Lorch and Jamie would be caught by them so how could he give them orders in advance?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Perhaps he doesn&amp;#39;t actually care about them.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well then his fire and blood speech was a lie.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s still too risky. Dorne will lose in any one on one fight against any other Kingdom and no side is fighting alone.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Then ally with another. Join the Starks or Greyjoys against the Lannisters. It&amp;#39;s far less convoluted and actually involves getting revenge.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Better to let the realm exhaust itself for a few years and pounce on whoever is King of the ashes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Except that gives the battered Lannisters breathing space and time to rebuild. Instead of having their back against the wall, they now have most of the realm behind them so it would be far worse to challenge them now.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Doran would have found himself in league with Renly in the Stormlands and the Tyrells in the Reach only for Renly to die and the Reach to switch to his enemy&amp;#39;s side. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But they would have ensured Stannis won the battle of the Blackwater, so the Lannisters would have been wiped out, fulfilling the revenge plan. The Stormlands would be isolated against the Starks, Stannis and Dorne.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4wl38", "score_hidden": false, "stickied": false, "created": 1491972747.0, "created_utc": 1491943947.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4t9hb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Daverade", "parent_id": "t1_dg4s8wy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "To further corroborate my point that Doran may be up to more than it appears, I'll try to give a reasoning as to why he didn't rebel during the moments you list above.\n\n&gt;Elia was murdered. \n\nAs you say, Dorne couldn't fight the might of four kingdoms by themselves, so they must wait.\n\n&gt;However, Doran doesn't actually do anything over the next couple of years to get revenge. He made no attempt to undermine Robert's regime, \n\nRobert is not his enemy. Tywin and the Lannisters are, and they are the target of his vengeance.\n\n&gt;He made no alliances and never tried to get friends into influential places (or make friends out of those already there). \n\nHere is where the Sand Snakes come in. I'd argue that Doran is SO careful, that he cannot even trust the Lords around him. He and Oberyn had to breed their own conspirators. Now, they have Sarella Sand in position with the Maesters, Lady Nym about to join the council, and Tyene in with the Faith. Furthermore, The Dornish Master Plan argues that Oberyn founded the Brave Companions and as such, Qyburn may be a Dornish agent as well.\n\n\n&gt;The Starks have a rivalry with the Lannisters, why not build a friendship? Open rebellion is out of the question, but what about covert assassination (of say, the Mountain) or sabotage?\n\nIf Qyburn and the Brave Companions are indeed working for Doran, that's a pretty covert way to kill Ser Amory Lorch and main Jaime.\n\n\n&gt;When the Greyjoys rebelled and attacked the Lannisters, Doran again did nothing. If he was plotting revenge, this was an opportunity. His foe was being attacked and the loyalty of the other lords was in doubt (that was what sparked the rebellion). The rebellion was probably doomed to failure, but that might not have been clear at the time. At the time Doran didn't know if he would ever get a better chance at revenge, yet he let he let the opportunity slip through his grasp.\n\nToo risky. I'd have passed on the opportunity too. The smallest kingdom decides they want to take on everybody all at once? Absolutely insane. Plus, Doran may have done some things behind the scenes during that war that we are unaware of.\n\n&gt;Doran never helped Dany and Viserys while they were homeless and hunted by assassins. That was when they truly needed major support, yet Doran did nothing. The marriage pact didn't help them at all, in fact they didn't even know it existed. Why make the pact and then ignore it for years? It's sheer luck that Dany is still alive and that's no thanks to Doran.\n\nPerhaps he doesn't actually care about them.\n\n&gt;Doran did nothing during the War of Five Kings. This is my biggest gripe on the list. For this reason alone the Fire and Blood speech was empty words to me. There couldn't have been a better opportunity for revenge. You couldn't dream up a better chance. The kingdom had collapsed, almost every major lord was going their own way such that not rebelling was more unusual than rebellion. The Lannisters were isolated and he could strike at the them with little risk to himself.\n\nIt's still too risky. Dorne will lose in any one on one fight against any other Kingdom and no side is fighting alone. Plus, the battlefield is almost safer than intrigue. Look what happened to Renly and Robb. Better to let the realm exhaust itself for a few years and pounce on whoever is King of the ashes.\n\n&gt;Had Doran intervened, he would have changed the tide of the war. He could have directly shifted the balance at the Battle of the Blackwater, or at least prevented the Tyrells from coming to the rescue. He never even tried to make contact with the Starks, the people attacking his sworn enemies. There was fire and blood and he had nothing to do with it.\n\nHe probably could have turned the tide, but there's a lot that happened leading up to this battle that no one could have accounted for, and none of it turned out as anyone expected. Doran would have found himself in league with Renly in the Stormlands and the Tyrells in the Reach only for Renly to die and the Reach to switch to his enemy's side. Suddenly the most populous kingdom and your neighbor has cause to march their flowery butts down to Sunspear and put you in your grave.\n\n&gt;Quentyn had no idea what to do. Doran sent him without anything to win Dany over and he basically had to wing it. They don't even meet until she has already built and independent power base and much less need for Dorne. The attempted wooing was pathetic, which is mostly Doran's fault.\n\nThe Dornish Master Plan argues that Doran wants Quentyn to fail...safely.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To further corroborate my point that Doran may be up to more than it appears, I&amp;#39;ll try to give a reasoning as to why he didn&amp;#39;t rebel during the moments you list above.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Elia was murdered. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As you say, Dorne couldn&amp;#39;t fight the might of four kingdoms by themselves, so they must wait.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;However, Doran doesn&amp;#39;t actually do anything over the next couple of years to get revenge. He made no attempt to undermine Robert&amp;#39;s regime, &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Robert is not his enemy. Tywin and the Lannisters are, and they are the target of his vengeance.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;He made no alliances and never tried to get friends into influential places (or make friends out of those already there). &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Here is where the Sand Snakes come in. I&amp;#39;d argue that Doran is SO careful, that he cannot even trust the Lords around him. He and Oberyn had to breed their own conspirators. Now, they have Sarella Sand in position with the Maesters, Lady Nym about to join the council, and Tyene in with the Faith. Furthermore, The Dornish Master Plan argues that Oberyn founded the Brave Companions and as such, Qyburn may be a Dornish agent as well.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The Starks have a rivalry with the Lannisters, why not build a friendship? Open rebellion is out of the question, but what about covert assassination (of say, the Mountain) or sabotage?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If Qyburn and the Brave Companions are indeed working for Doran, that&amp;#39;s a pretty covert way to kill Ser Amory Lorch and main Jaime.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;When the Greyjoys rebelled and attacked the Lannisters, Doran again did nothing. If he was plotting revenge, this was an opportunity. His foe was being attacked and the loyalty of the other lords was in doubt (that was what sparked the rebellion). The rebellion was probably doomed to failure, but that might not have been clear at the time. At the time Doran didn&amp;#39;t know if he would ever get a better chance at revenge, yet he let he let the opportunity slip through his grasp.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Too risky. I&amp;#39;d have passed on the opportunity too. The smallest kingdom decides they want to take on everybody all at once? Absolutely insane. Plus, Doran may have done some things behind the scenes during that war that we are unaware of.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Doran never helped Dany and Viserys while they were homeless and hunted by assassins. That was when they truly needed major support, yet Doran did nothing. The marriage pact didn&amp;#39;t help them at all, in fact they didn&amp;#39;t even know it existed. Why make the pact and then ignore it for years? It&amp;#39;s sheer luck that Dany is still alive and that&amp;#39;s no thanks to Doran.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Perhaps he doesn&amp;#39;t actually care about them.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Doran did nothing during the War of Five Kings. This is my biggest gripe on the list. For this reason alone the Fire and Blood speech was empty words to me. There couldn&amp;#39;t have been a better opportunity for revenge. You couldn&amp;#39;t dream up a better chance. The kingdom had collapsed, almost every major lord was going their own way such that not rebelling was more unusual than rebellion. The Lannisters were isolated and he could strike at the them with little risk to himself.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s still too risky. Dorne will lose in any one on one fight against any other Kingdom and no side is fighting alone. Plus, the battlefield is almost safer than intrigue. Look what happened to Renly and Robb. Better to let the realm exhaust itself for a few years and pounce on whoever is King of the ashes.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Had Doran intervened, he would have changed the tide of the war. He could have directly shifted the balance at the Battle of the Blackwater, or at least prevented the Tyrells from coming to the rescue. He never even tried to make contact with the Starks, the people attacking his sworn enemies. There was fire and blood and he had nothing to do with it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He probably could have turned the tide, but there&amp;#39;s a lot that happened leading up to this battle that no one could have accounted for, and none of it turned out as anyone expected. Doran would have found himself in league with Renly in the Stormlands and the Tyrells in the Reach only for Renly to die and the Reach to switch to his enemy&amp;#39;s side. Suddenly the most populous kingdom and your neighbor has cause to march their flowery butts down to Sunspear and put you in your grave.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Quentyn had no idea what to do. Doran sent him without anything to win Dany over and he basically had to wing it. They don&amp;#39;t even meet until she has already built and independent power base and much less need for Dorne. The attempted wooing was pathetic, which is mostly Doran&amp;#39;s fault.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The Dornish Master Plan argues that Doran wants Quentyn to fail...safely.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4t9hb", "score_hidden": false, "stickied": false, "created": 1491969044.0, "created_utc": 1491940244.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4s8wy", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Daverade", "parent_id": "t3_64sxpv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "https://www.youtube.com/watch?v=6TBfdd_xNVo&amp;t=4s\n\nIt's a long YouTube series (you should also watch the Deeper Dorne which fleshes out a lot of these ideas) but this posits an answer to all of your questions.\n\nIn summary, Doran may have not done much on the surface, but behind the scenes with his brother he has already made some influential moves including but not limited to:\n\nThe rise of the sparrow movement\nJaime losing his hand\nThe death of Tywin (kinda)\nThe death of the Mountain (kinda)\nThe death of Ser Amory Lorch\n\nand soon to be Cersi's downfall.\n\nI may be missing something else that Doran has accomplished (maybe) but that's the broad strokes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=6TBfdd_xNVo&amp;amp;t=4s\"&gt;https://www.youtube.com/watch?v=6TBfdd_xNVo&amp;amp;t=4s&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a long YouTube series (you should also watch the Deeper Dorne which fleshes out a lot of these ideas) but this posits an answer to all of your questions.&lt;/p&gt;\n\n&lt;p&gt;In summary, Doran may have not done much on the surface, but behind the scenes with his brother he has already made some influential moves including but not limited to:&lt;/p&gt;\n\n&lt;p&gt;The rise of the sparrow movement\nJaime losing his hand\nThe death of Tywin (kinda)\nThe death of the Mountain (kinda)\nThe death of Ser Amory Lorch&lt;/p&gt;\n\n&lt;p&gt;and soon to be Cersi&amp;#39;s downfall.&lt;/p&gt;\n\n&lt;p&gt;I may be missing something else that Doran has accomplished (maybe) but that&amp;#39;s the broad strokes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4s8wy", "score_hidden": false, "stickied": false, "created": 1491967958.0, "created_utc": 1491939158.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]