[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "asoiaf", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To understand how much can happen in GRRM-sized book, and how all of the existing plots and mysteries could be paid off without rushing, we need to look not at page counts, writing speed, age, et al, but rather, we need to look a A Storm of Swords and get a more realistic sense of how much can transpire in a few pages of text when GRRM has a mind to make it do so. It&amp;#39;s easy to forget how far back ASoS really begins, and as you peruse the following bullets, consider not only how much happens, but how detailed and leisurely it feels - &lt;em&gt;massive&lt;/em&gt; amounts of plot points occur, but it doesn&amp;#39;t feel rushed in the least. Martin can give us a huge amount of forward movement, in a leisurely, poetic way, in just a few pages. Think of Arya&amp;#39;s journey from Harrenhal to Saltpans, of Jaime&amp;#39;s journey from Riverrun to King&amp;#39;s Landing, of Bran&amp;#39;s journey from just north of Winterfell to the Nightfort, of Jon&amp;#39;s journey from joining the Wildlings all the way to becoming Lord Commander, of Dany&amp;#39;s journey from Qarth to Meereen ... and so on. All of that happens in a book which was many pages shorter than TWoW is expected to be.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Here is a quick synopsis of what transpires &lt;strong&gt;in a single book&lt;/strong&gt; (ASoS):&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;The &lt;strong&gt;Night&amp;#39;s Watch&lt;/strong&gt; ranging party is attacked by the Others, with Sam killing one, and Jon &amp;amp; Mance surveying the aftermath at the Fist of the First Men.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Jaime&lt;/strong&gt; and Brienne take a long and eventful journey from Riverrun to King&amp;#39;s Landing with many episodes, dreams, fights and adventures along the way.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Catelyn&lt;/strong&gt; spends lots of time in her thoughts at Riverrun as her father dies, news of various battles comes in, Robb&amp;#39;s marriage to Jeyne is revealed, Lord Karstark is beheaded, much strategizing is done, and the party sets out on a visit to the Twins that&amp;#39;s described in great detail, culminating in the Red Wedding, which is foreshadowed luxuriously in not only Cat&amp;#39;s, but Arya&amp;#39;s and Tyrion&amp;#39;s chapters.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Arya&lt;/strong&gt; begins a very long journey after her escape from Harrenhal, meeting the BwB for the first time, witnessing the Hound&amp;#39;s trial, hearing all sorts of cryptic prophecies, and is eventually kidnapped by The Hound, with whom she begins another very long journey, including various fights and adventures, passing by the Red Wedding in progress, and ultimately leading to the Hound&amp;#39;s apparent demise and Arya&amp;#39;s departure for Braavos&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Sansa&lt;/strong&gt; conspires with the Tyrells to escape King&amp;#39;s Landing, only to be betrayed by Littlefinger and forced to marry Tyrion, meeting many times with Dontos, witnessing the Purple Wedding, escaping with Littlefinger to the Vale, having various adventures on her way to the Eyrie, and witnessing Lysa&amp;#39;s &lt;del&gt;moondog&lt;/del&gt; moondoor mea culpa during which a long list of denouements spill out.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Tyrion&lt;/strong&gt; has various trysts with Shae and confrontations with Tywin and Cersei before marrying Sansa, witnessing the Purple Wedding, having a long and painful trial and imprisonment, a devastating trial by combat, a shocking conversation with his brother, and commits two at least semi-justified homicides en route to escape with Varys.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Davos&lt;/strong&gt; finds himself on a desert island, nearly dies, is rescued, tries to kill Melisandre, is imprisoned, has various dealings with various Florents, becomes Hand of the King, learns to read, conspires to save Edric Storm, is nearly executed, and conveys to Stannis his true purpose at the Wall&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Stannis&lt;/strong&gt; barely survives the Blackwater, grinds his teeth a lot, and saves the Night&amp;#39;s Watch from the Wildlings, takes up residence at Castle Black and tries to convince Jon to become the lord of Winterfell.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Jon&lt;/strong&gt;, having just killed Qhorin on the orders of the latter, undergoes a long period of deep cover with the Wildlings, falls in love, loses his virginity, learns massive amounts of history and backstory, climbs the Wall, is saved by Summer, returns to Castle Black, undergoes a long recuperation, commands two large battles against the Wildlings, is imprisoned, is sent on a suicide mission, witnesses Stannis&amp;#39;s attack, and is elected the 998th Lord Commander of the Night&amp;#39;s Watch.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Sam&lt;/strong&gt; witnesses the deaths of Craster and the Old Bear, sets out on a long and perilous journey with Gilly, meets Bran and Coldhands and returns to Castle Black where he engineers the afore-mentioned electoral coup.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Bran&lt;/strong&gt; goes on a long and richly-described quest to find the 3-Eyed Crow, getting all the way from the Tumbledown Tower to the Nightfort, where he meets Sam and Gilly&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Jaime&lt;/strong&gt; spends much time in King&amp;#39;s Landing with Tywin, Loras, Cersei and Brienne, musing on his identity as a Kingsguard, becoming emotionally estranged from Cersei and sending Brienne and Oathkeeper off to fulfill their oath to Lady Catelyn&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Daenerys&lt;/strong&gt; meets Barristan and Belwas and is given 3 ships to return to Illyrio, but instead she conquers Astapor and Yunkai, acquires an army of Unsullied and various sellsword companies, discovers Jorah&amp;#39;s deception, banishes him, conquers Meereen and begins to see how much more difficult it is to govern than to conquer.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Merrett Frey&lt;/strong&gt; stumbles into the unsettling realization that a massive plot is underway in the Riverlands, now led by the undead Catelyn Stark.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "To understand how much can happen in GRRM-sized book, and how all of the existing plots and mysteries could be paid off without rushing, we need to look not at page counts, writing speed, age, et al, but rather, we need to look a A Storm of Swords and get a more realistic sense of how much can transpire in a few pages of text when GRRM has a mind to make it do so. It's easy to forget how far back ASoS really begins, and as you peruse the following bullets, consider not only how much happens, but how detailed and leisurely it feels - _massive_ amounts of plot points occur, but it doesn't feel rushed in the least. Martin can give us a huge amount of forward movement, in a leisurely, poetic way, in just a few pages. Think of Arya's journey from Harrenhal to Saltpans, of Jaime's journey from Riverrun to King's Landing, of Bran's journey from just north of Winterfell to the Nightfort, of Jon's journey from joining the Wildlings all the way to becoming Lord Commander, of Dany's journey from Qarth to Meereen ... and so on. All of that happens in a book which was many pages shorter than TWoW is expected to be.\n___\n\nHere is a quick synopsis of what transpires **in a single book** (ASoS):\n\n- The **Night's Watch** ranging party is attacked by the Others, with Sam killing one, and Jon &amp; Mance surveying the aftermath at the Fist of the First Men.\n\n- **Jaime** and Brienne take a long and eventful journey from Riverrun to King's Landing with many episodes, dreams, fights and adventures along the way.\n\n- **Catelyn** spends lots of time in her thoughts at Riverrun as her father dies, news of various battles comes in, Robb's marriage to Jeyne is revealed, Lord Karstark is beheaded, much strategizing is done, and the party sets out on a visit to the Twins that's described in great detail, culminating in the Red Wedding, which is foreshadowed luxuriously in not only Cat's, but Arya's and Tyrion's chapters.\n\n-  **Arya** begins a very long journey after her escape from Harrenhal, meeting the BwB for the first time, witnessing the Hound's trial, hearing all sorts of cryptic prophecies, and is eventually kidnapped by The Hound, with whom she begins another very long journey, including various fights and adventures, passing by the Red Wedding in progress, and ultimately leading to the Hound's apparent demise and Arya's departure for Braavos\n\n- **Sansa** conspires with the Tyrells to escape King's Landing, only to be betrayed by Littlefinger and forced to marry Tyrion, meeting many times with Dontos, witnessing the Purple Wedding, escaping with Littlefinger to the Vale, having various adventures on her way to the Eyrie, and witnessing Lysa's ~~moondog~~ moondoor mea culpa during which a long list of denouements spill out.\n\n- **Tyrion** has various trysts with Shae and confrontations with Tywin and Cersei before marrying Sansa, witnessing the Purple Wedding, having a long and painful trial and imprisonment, a devastating trial by combat, a shocking conversation with his brother, and commits two at least semi-justified homicides en route to escape with Varys.\n\n- **Davos** finds himself on a desert island, nearly dies, is rescued, tries to kill Melisandre, is imprisoned, has various dealings with various Florents, becomes Hand of the King, learns to read, conspires to save Edric Storm, is nearly executed, and conveys to Stannis his true purpose at the Wall\n\n- **Stannis** barely survives the Blackwater, grinds his teeth a lot, and saves the Night's Watch from the Wildlings, takes up residence at Castle Black and tries to convince Jon to become the lord of Winterfell.\n\n- **Jon**, having just killed Qhorin on the orders of the latter, undergoes a long period of deep cover with the Wildlings, falls in love, loses his virginity, learns massive amounts of history and backstory, climbs the Wall, is saved by Summer, returns to Castle Black, undergoes a long recuperation, commands two large battles against the Wildlings, is imprisoned, is sent on a suicide mission, witnesses Stannis's attack, and is elected the 998th Lord Commander of the Night's Watch.\n\n- **Sam** witnesses the deaths of Craster and the Old Bear, sets out on a long and perilous journey with Gilly, meets Bran and Coldhands and returns to Castle Black where he engineers the afore-mentioned electoral coup.\n\n- **Bran** goes on a long and richly-described quest to find the 3-Eyed Crow, getting all the way from the Tumbledown Tower to the Nightfort, where he meets Sam and Gilly\n\n- **Jaime** spends much time in King's Landing with Tywin, Loras, Cersei and Brienne, musing on his identity as a Kingsguard, becoming emotionally estranged from Cersei and sending Brienne and Oathkeeper off to fulfill their oath to Lady Catelyn\n\n- **Daenerys** meets Barristan and Belwas and is given 3 ships to return to Illyrio, but instead she conquers Astapor and Yunkai, acquires an army of Unsullied and various sellsword companies, discovers Jorah's deception, banishes him, conquers Meereen and begins to see how much more difficult it is to govern than to conquer.\n\n- **Merrett Frey** stumbles into the unsettling realization that a massive plot is underway in the Riverlands, now led by the undead Catelyn Stark.\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "EXTENDED", "id": "64tr68", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 73, "report_reasons": null, "author": "tmobsessed", "saved": false, "mod_reports": [], "name": "t3_64tr68", "subreddit_name_prefixed": "r/asoiaf", "approved_by": null, "over_18": false, "domain": "self.asoiaf", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2r2o9", "edited": 1491950850.0, "link_flair_css_class": "extended", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/asoiaf/comments/64tr68/spoilers_extended_tying_the_knots_in_a_bow_why/", "num_reports": null, "locked": false, "stickied": false, "created": 1491973838.0, "url": "https://www.reddit.com/r/asoiaf/comments/64tr68/spoilers_extended_tying_the_knots_in_a_bow_why/", "author_flair_text": null, "quarantine": false, "title": "(Spoilers Extended) Tying the Knots in a Bow: Why ASOIAF Can End Strongly in 7 Books", "created_utc": 1491945038.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 37, "visited": false, "subreddit_type": "public", "ups": 73}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": "", "user_reports": [], "id": "dg5f9zs", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "DieHard_33", "parent_id": "t1_dg55d6p", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I'm hoping for nothing close to a poetic ending involving Jamie or Tyrion for Cersei. While she drives herself mad in Kings Landing, all the while fantasizing about killing one brother and screwing another, I would like to see Jamie and Tyrion continue their own arcs without much thought of Cersei until they hear of her death. \n\nI'm also hoping she is crazy enough to will the prophecy into existence.  Valonqar is Valaryian for little brother = Valaryian little brother = Aegon. Whether she dies when Aegon takes the city, kills herself, or becomes a prisioner I expect her inner monologue to be seeking a resolution to the prophecy and therefore find it. Mad Queen all the way. I know she is already doing this with Tyrion, but when he's not around and Aegon comes knocking she's gonna blame the prophecy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m hoping for nothing close to a poetic ending involving Jamie or Tyrion for Cersei. While she drives herself mad in Kings Landing, all the while fantasizing about killing one brother and screwing another, I would like to see Jamie and Tyrion continue their own arcs without much thought of Cersei until they hear of her death. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also hoping she is crazy enough to will the prophecy into existence.  Valonqar is Valaryian for little brother = Valaryian little brother = Aegon. Whether she dies when Aegon takes the city, kills herself, or becomes a prisioner I expect her inner monologue to be seeking a resolution to the prophecy and therefore find it. Mad Queen all the way. I know she is already doing this with Tyrion, but when he&amp;#39;s not around and Aegon comes knocking she&amp;#39;s gonna blame the prophecy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5f9zs", "score_hidden": false, "stickied": false, "created": 1491997402.0, "created_utc": 1491968602.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": "", "user_reports": [], "id": "dg5pyky", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "HouseHitchens", "parent_id": "t1_dg55d6p", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Nice catch. I haven't read the chapters myself yet, I want to read the book from end to end in the order that George wants.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice catch. I haven&amp;#39;t read the chapters myself yet, I want to read the book from end to end in the order that George wants.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5pyky", "score_hidden": false, "stickied": false, "created": 1492023477.0, "created_utc": 1491994677.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg55d6p", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "tmobsessed", "parent_id": "t1_dg5555z", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "So, in Mercy, here are some Lannister guardsmen talking about Ser Harys Swift's mission in Braavos:\n\n&gt;\"How long do you think we'll be here?\"\n\"Longer than you'd like,\" the old man replied. \"If he goes back without the gold the queen will have his head.\" \n\nIn the epilogue of ADwD, Ser Harys is still in King's Landing:\n\n&gt;\"I put no faith in these Myrish bankers,\" Ser Kevan told his good-father. \"You had best prepare to go to Braavos.\" Ser Harys did not look happy at the prospect. \"If I must. But I say again, this trouble is not of my doing.\"\n\nAnd at that point Cersei was out of power, so it's unlikely they'd say she'd \"have his head\" unless she returned to power before Harys &amp; Co. set sail for Braavos.\n\nFinally, the highly topical nature of the play Mercy is acting in. If Cersei were still imprisoned, or had lost and fallen from power, that probably would have been included. Had she been found guilty, the sensationalist nature of the incest and regicide \"convictions\" would have been too juicy not to include in the play, overshadowing much of the other gossip that was included (But to play devil's advocate, it's pretty like they'd also have referenced Ser Robert Strong if that's how she gets off the hook). \n\nMoving from verse and chapter to tinfoil blathering: having Cersei be executed or permanently de-clawed by the High Sparrow at this point seems very counter-productive to the momentum of the story. I'm assuming Aegon VI is going to (however temporarily) take King's Landing and be crowned and it would be a lot more satisfying for Cersei to have by then regained power, so she can lose it again. I still think there's even a small chance that she'll also survive Aegon's conquest, fleeing back to Casterly Rock. If that happens I expect Tyrion to be the eventual valonqar very late in TWoW or early in ADoS, but if she makes her last stand in King's Landing (and likely with wildfire) then, as Tyrion would, I'm betting on Jaime.\n\n", "edited": 1491958318.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, in Mercy, here are some Lannister guardsmen talking about Ser Harys Swift&amp;#39;s mission in Braavos:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;How long do you think we&amp;#39;ll be here?&amp;quot;\n&amp;quot;Longer than you&amp;#39;d like,&amp;quot; the old man replied. &amp;quot;If he goes back without the gold the queen will have his head.&amp;quot; &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In the epilogue of ADwD, Ser Harys is still in King&amp;#39;s Landing:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;I put no faith in these Myrish bankers,&amp;quot; Ser Kevan told his good-father. &amp;quot;You had best prepare to go to Braavos.&amp;quot; Ser Harys did not look happy at the prospect. &amp;quot;If I must. But I say again, this trouble is not of my doing.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And at that point Cersei was out of power, so it&amp;#39;s unlikely they&amp;#39;d say she&amp;#39;d &amp;quot;have his head&amp;quot; unless she returned to power before Harys &amp;amp; Co. set sail for Braavos.&lt;/p&gt;\n\n&lt;p&gt;Finally, the highly topical nature of the play Mercy is acting in. If Cersei were still imprisoned, or had lost and fallen from power, that probably would have been included. Had she been found guilty, the sensationalist nature of the incest and regicide &amp;quot;convictions&amp;quot; would have been too juicy not to include in the play, overshadowing much of the other gossip that was included (But to play devil&amp;#39;s advocate, it&amp;#39;s pretty like they&amp;#39;d also have referenced Ser Robert Strong if that&amp;#39;s how she gets off the hook). &lt;/p&gt;\n\n&lt;p&gt;Moving from verse and chapter to tinfoil blathering: having Cersei be executed or permanently de-clawed by the High Sparrow at this point seems very counter-productive to the momentum of the story. I&amp;#39;m assuming Aegon VI is going to (however temporarily) take King&amp;#39;s Landing and be crowned and it would be a lot more satisfying for Cersei to have by then regained power, so she can lose it again. I still think there&amp;#39;s even a small chance that she&amp;#39;ll also survive Aegon&amp;#39;s conquest, fleeing back to Casterly Rock. If that happens I expect Tyrion to be the eventual valonqar very late in TWoW or early in ADoS, but if she makes her last stand in King&amp;#39;s Landing (and likely with wildfire) then, as Tyrion would, I&amp;#39;m betting on Jaime.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg55d6p", "score_hidden": false, "stickied": false, "created": 1491983923.0, "created_utc": 1491955123.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5555z", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "MrToddWilkins", "parent_id": "t1_dg52lok", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Cersei won her trial or escaped punishment? Please explain. Cite verse and chapter.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cersei won her trial or escaped punishment? Please explain. Cite verse and chapter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5555z", "score_hidden": false, "stickied": false, "created": 1491983615.0, "created_utc": 1491954815.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": "", "user_reports": [], "id": "dg5pvvh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HouseHitchens", "parent_id": "t1_dg52lok", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Exactly, why would George dish out the mindblowing, cliffhanger answering chapters before the book is released?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly, why would George dish out the mindblowing, cliffhanger answering chapters before the book is released?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5pvvh", "score_hidden": false, "stickied": false, "created": 1492023274.0, "created_utc": 1491994474.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52lok", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "tmobsessed", "parent_id": "t1_dg50pkk", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "True, but: \n\n1. it's in keeping with ASoS-level build-up to action - lot of significant events happen in ASoS but with massive amounts of build-up\n\n2. GRRM likely chose the least spoilery chapters to release\n\n3. Concerning the anticipated change in pacing, these are chapters that were originally meant to be part of ADwD.\n\nBig stuff in TWoW sample chapters:\n\n- Theon: many aspects of Stannis's strategy revealed - battle imminent\n\n- Barristan/Tyrion/Victarion: battle is raging\n\n- Arianne: Storm's End has fallen\n\n- Mercy: Cersei won her trial or otherwise escaped further punishment\n\n- Alayne: Sansa's whereabouts are likely no longer secret\n\n- Aeron: no Iron Islands uprising; Euron on the verge of something big and horrible\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;True, but: &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;it&amp;#39;s in keeping with ASoS-level build-up to action - lot of significant events happen in ASoS but with massive amounts of build-up&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;GRRM likely chose the least spoilery chapters to release&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Concerning the anticipated change in pacing, these are chapters that were originally meant to be part of ADwD.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Big stuff in TWoW sample chapters:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Theon: many aspects of Stannis&amp;#39;s strategy revealed - battle imminent&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Barristan/Tyrion/Victarion: battle is raging&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Arianne: Storm&amp;#39;s End has fallen&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Mercy: Cersei won her trial or otherwise escaped further punishment&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Alayne: Sansa&amp;#39;s whereabouts are likely no longer secret&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Aeron: no Iron Islands uprising; Euron on the verge of something big and horrible&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg52lok", "score_hidden": false, "stickied": false, "created": 1491980175.0, "created_utc": 1491951375.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": "", "user_reports": [], "id": "dg69rbg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Smack8001", "parent_id": "t1_dg5q0so", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "As physicists like to say, \"Eventually\" we are all dead.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As physicists like to say, &amp;quot;Eventually&amp;quot; we are all dead.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg69rbg", "score_hidden": false, "stickied": false, "created": 1492049092.0, "created_utc": 1492020292.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5q0so", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HouseHitchens", "parent_id": "t1_dg54dxv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Eventually at some point I think the pace will pick up, whether that's in Winds or not we can only speculate, but as the stories come back together there should be less 'farting around' as it were. Maybe I'm just deluding myself again that A Dream of Spring will take less time to write because it's the final book where everything will tie together.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eventually at some point I think the pace will pick up, whether that&amp;#39;s in Winds or not we can only speculate, but as the stories come back together there should be less &amp;#39;farting around&amp;#39; as it were. Maybe I&amp;#39;m just deluding myself again that A Dream of Spring will take less time to write because it&amp;#39;s the final book where everything will tie together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5q0so", "score_hidden": false, "stickied": false, "created": 1492023650.0, "created_utc": 1491994850.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg54dxv", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Mikekekeke", "parent_id": "t1_dg50pkk", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I don't believe that GRRM will pick it up and get a little hustle all of a sudden. I also don't have a ton of doubt about TWOW coming out before the show ends. Hell, the goofy twitter shenanigans could be George trying to make it seem like he's okay with the publishers wrestling the manuscript from him like [Jimmy trying to get his money from Morrie in Goodfellas](https://youtu.be/JKDgjLf_rk4?t=20s). \n\nBut I don't believe that it will be a barn burner unless he has drastically rewritten the sample chapters for a start. I'll believe it when/if I see it, but what we have currently is a lot of space in this upcoming book dedicated to spillover from the previous book. That's besides the fact that the pace for the past book (AFFC/ADWD) has been really slow and that's just been the pace of the series for twelve years.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t believe that GRRM will pick it up and get a little hustle all of a sudden. I also don&amp;#39;t have a ton of doubt about TWOW coming out before the show ends. Hell, the goofy twitter shenanigans could be George trying to make it seem like he&amp;#39;s okay with the publishers wrestling the manuscript from him like &lt;a href=\"https://youtu.be/JKDgjLf_rk4?t=20s\"&gt;Jimmy trying to get his money from Morrie in Goodfellas&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;But I don&amp;#39;t believe that it will be a barn burner unless he has drastically rewritten the sample chapters for a start. I&amp;#39;ll believe it when/if I see it, but what we have currently is a lot of space in this upcoming book dedicated to spillover from the previous book. That&amp;#39;s besides the fact that the pace for the past book (AFFC/ADWD) has been really slow and that&amp;#39;s just been the pace of the series for twelve years.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg54dxv", "score_hidden": false, "stickied": false, "created": 1491982582.0, "created_utc": 1491953782.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg50pkk", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "jackattack729", "parent_id": "t1_dg4y8zt", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Counter point to your addendum:\n\nWe have sample chapters from Winds that continue at this slow pace. Now granted these should be the start of the book but we have:\n\nAriane leaving Dorne and wandering around a jungle, traveling without much plot development (and this is 2 chapters in the book).\n\nTyrion's second chapter and the fighting has barely started in Mereen.\n\nBarristan's first chapter before the fighting in Mereen going over tactics. Second chapter is starting the fighting.\n\nTheon being held captive, not doing much.\n\nMercy going through a meta play and killing a dude, haven't dealt with the fall out with the Faceless Men yet.\n\nAeron having dreams and flashbacks.\n\nAlayne expanding on the politics of the Vale and tourneys.\n\nSo we're 10 chapters in and very few significant events have happened.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Counter point to your addendum:&lt;/p&gt;\n\n&lt;p&gt;We have sample chapters from Winds that continue at this slow pace. Now granted these should be the start of the book but we have:&lt;/p&gt;\n\n&lt;p&gt;Ariane leaving Dorne and wandering around a jungle, traveling without much plot development (and this is 2 chapters in the book).&lt;/p&gt;\n\n&lt;p&gt;Tyrion&amp;#39;s second chapter and the fighting has barely started in Mereen.&lt;/p&gt;\n\n&lt;p&gt;Barristan&amp;#39;s first chapter before the fighting in Mereen going over tactics. Second chapter is starting the fighting.&lt;/p&gt;\n\n&lt;p&gt;Theon being held captive, not doing much.&lt;/p&gt;\n\n&lt;p&gt;Mercy going through a meta play and killing a dude, haven&amp;#39;t dealt with the fall out with the Faceless Men yet.&lt;/p&gt;\n\n&lt;p&gt;Aeron having dreams and flashbacks.&lt;/p&gt;\n\n&lt;p&gt;Alayne expanding on the politics of the Vale and tourneys.&lt;/p&gt;\n\n&lt;p&gt;So we&amp;#39;re 10 chapters in and very few significant events have happened.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg50pkk", "score_hidden": false, "stickied": false, "created": 1491977746.0, "created_utc": 1491948946.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": "", "user_reports": [], "id": "dg6gbqa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SerPoopybutthole", "parent_id": "t1_dg6bqwy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "That doesn't make sense to me, but whatever. For me it fits with the shit he has been doing the whole time. Ned was an honorable hero, but he was executed for \"treason\". Robb wanted revenge and won every battle, but died at a wedding. Sansa wants a sweet prince to marry or a noble knight to rescue her, but she gets abused and then rescued by a skeevy guy who wants her to sit on his face. Jon wants the wildlings to help protect the Wall and the realms of man and the Night's Watch (who are supposed to be protecting the Wall and the realms of man and admittedly need the help) kill Jon for trying to help. Dany gets dragons, but can't control them. The series is filled with irony and tragedy. It seems to me that the failed \"knight\" fits in perfectly with the stories we've heard so far, but everybody has their own opinions. \n\nThe series is more than just ice zombies attacking. Very little of the story thus ft has been about that. It's been about people fighting each other instead of working together against the real threat. Which is exactly what's happening in Brienne's chapters. Her story may be on a smaller scale than Jon's, but her story isn't over yet. The consequences of her story aren't clear yet. Maybe you don't care about Brienne fighting Rorge and Biter. Meh. I loved that scene. It was a great sword fight. It lead to Brienne's face being savaged. She's not gonna be the same after this. I want to know what the failed \"knight\" does next. It seems like she still has a part to play. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That doesn&amp;#39;t make sense to me, but whatever. For me it fits with the shit he has been doing the whole time. Ned was an honorable hero, but he was executed for &amp;quot;treason&amp;quot;. Robb wanted revenge and won every battle, but died at a wedding. Sansa wants a sweet prince to marry or a noble knight to rescue her, but she gets abused and then rescued by a skeevy guy who wants her to sit on his face. Jon wants the wildlings to help protect the Wall and the realms of man and the Night&amp;#39;s Watch (who are supposed to be protecting the Wall and the realms of man and admittedly need the help) kill Jon for trying to help. Dany gets dragons, but can&amp;#39;t control them. The series is filled with irony and tragedy. It seems to me that the failed &amp;quot;knight&amp;quot; fits in perfectly with the stories we&amp;#39;ve heard so far, but everybody has their own opinions. &lt;/p&gt;\n\n&lt;p&gt;The series is more than just ice zombies attacking. Very little of the story thus ft has been about that. It&amp;#39;s been about people fighting each other instead of working together against the real threat. Which is exactly what&amp;#39;s happening in Brienne&amp;#39;s chapters. Her story may be on a smaller scale than Jon&amp;#39;s, but her story isn&amp;#39;t over yet. The consequences of her story aren&amp;#39;t clear yet. Maybe you don&amp;#39;t care about Brienne fighting Rorge and Biter. Meh. I loved that scene. It was a great sword fight. It lead to Brienne&amp;#39;s face being savaged. She&amp;#39;s not gonna be the same after this. I want to know what the failed &amp;quot;knight&amp;quot; does next. It seems like she still has a part to play. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6gbqa", "score_hidden": false, "stickied": false, "created": 1492055840.0, "created_utc": 1492027040.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6bqwy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Smack8001", "parent_id": "t1_dg6ajol", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Sounds like a great plot for a companion novella, not 10 chapters of a main novel that took 5 years to wait for. If George wants to publish \"The Failed Knight\" as a standalone Brienne story that is something I'd buy. But as an entry into ASOIAF main series, it was kind of a big waste of time. It was a digression. Septon Meribald could have given his speech to Jaime or someone else.\n\nFanbois gotta keep fanboiying. Meanwhile a good writer knows that if a sentence doesn't serve a scene, it should be cut. If a scene doesn't serve a chapter, it should be cut. If a chapter doesn't serve a novel, it should be cut. Most of the Brienne chapters in AFFC do not serve the novel. Who really cares what Hyle Hunt and Clarence Crabb thinks about anything? Who cares how Rorge and Biter die? The story of the world being saved from ice zombies by the power of love (or destroyed for bittersweet lack thereof) isn't served by knowing how much the random brigands of the Riverlands enjoy rape. If Rorge and Biter's death hadn't been onscreen, would you go to your grave with a burning unmet desire to know how the gurgled when they died? I wouldn't have.\n\nIt's an amazing story, but telling it in 9 or 10 chatpers wasn't necessary to advance the plot of the series.\n\nWhat rational reason, based on the pace of the sample chapters, do we have to believe the next novels will be any different?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like a great plot for a companion novella, not 10 chapters of a main novel that took 5 years to wait for. If George wants to publish &amp;quot;The Failed Knight&amp;quot; as a standalone Brienne story that is something I&amp;#39;d buy. But as an entry into ASOIAF main series, it was kind of a big waste of time. It was a digression. Septon Meribald could have given his speech to Jaime or someone else.&lt;/p&gt;\n\n&lt;p&gt;Fanbois gotta keep fanboiying. Meanwhile a good writer knows that if a sentence doesn&amp;#39;t serve a scene, it should be cut. If a scene doesn&amp;#39;t serve a chapter, it should be cut. If a chapter doesn&amp;#39;t serve a novel, it should be cut. Most of the Brienne chapters in AFFC do not serve the novel. Who really cares what Hyle Hunt and Clarence Crabb thinks about anything? Who cares how Rorge and Biter die? The story of the world being saved from ice zombies by the power of love (or destroyed for bittersweet lack thereof) isn&amp;#39;t served by knowing how much the random brigands of the Riverlands enjoy rape. If Rorge and Biter&amp;#39;s death hadn&amp;#39;t been onscreen, would you go to your grave with a burning unmet desire to know how the gurgled when they died? I wouldn&amp;#39;t have.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s an amazing story, but telling it in 9 or 10 chatpers wasn&amp;#39;t necessary to advance the plot of the series.&lt;/p&gt;\n\n&lt;p&gt;What rational reason, based on the pace of the sample chapters, do we have to believe the next novels will be any different?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6bqwy", "score_hidden": false, "stickied": false, "created": 1492051128.0, "created_utc": 1492022328.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ajol", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SerPoopybutthole", "parent_id": "t1_dg69xf3", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I just said the exact chapter where her story moves quickly. And her going the wrong way is what makes her story so interesting. We know she's going the wrong way. It's a tragedy. She fulfills many of the requirements of the typical hero, but her quest seems doomed. She goes through all this bullshit and fights and kills the bad guys. She tries her best to fulfill the quest. Then the irony sets in that even though she tried when she meets up with the Cat again instead of being rewarded for her efforts she is punished because Oathkeeper is taken out of context. It's a fucking amazing and tragic story. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just said the exact chapter where her story moves quickly. And her going the wrong way is what makes her story so interesting. We know she&amp;#39;s going the wrong way. It&amp;#39;s a tragedy. She fulfills many of the requirements of the typical hero, but her quest seems doomed. She goes through all this bullshit and fights and kills the bad guys. She tries her best to fulfill the quest. Then the irony sets in that even though she tried when she meets up with the Cat again instead of being rewarded for her efforts she is punished because Oathkeeper is taken out of context. It&amp;#39;s a fucking amazing and tragic story. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6ajol", "score_hidden": false, "stickied": false, "created": 1492049911.0, "created_utc": 1492021111.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg69xf3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Smack8001", "parent_id": "t1_dg50cgw", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Brienne's story goes quickly? When? She is on a quest to find the Stark girls and protect them, and at the end of the AFFC she is neither going to the Vale nor to Braavos. She shows up in ADWD at the Western part of the Riverlands, lying to Jaime. She is farther away from her goal than when she started. \n\nIt doesn't matter how fast you are going if you're going the wrong way.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Brienne&amp;#39;s story goes quickly? When? She is on a quest to find the Stark girls and protect them, and at the end of the AFFC she is neither going to the Vale nor to Braavos. She shows up in ADWD at the Western part of the Riverlands, lying to Jaime. She is farther away from her goal than when she started. &lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t matter how fast you are going if you&amp;#39;re going the wrong way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg69xf3", "score_hidden": false, "stickied": false, "created": 1492049270.0, "created_utc": 1492020470.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg50cgw", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "SerPoopybutthole", "parent_id": "t1_dg4y8zt", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Especially after the story lines converge. That should make things go faster. Also even in AFFC things can go quickly sometimes. Look at the Brienne chapters. 3 &amp; 4 are slower paced. Brienne gets to Maidenpool and goes to Crackclaw Point in these two. But in Brienne 5 she returns from Crackclaw and deals with Tarly and stays the night and meets Septon Meribald and heads out and meets a bunch of the smallfolk and Meribald gives a big long speech all in one chapter. That being said 3 &amp; 4 really set up 5 which allows it to move so quickly and be so much more impactful. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Especially after the story lines converge. That should make things go faster. Also even in AFFC things can go quickly sometimes. Look at the Brienne chapters. 3 &amp;amp; 4 are slower paced. Brienne gets to Maidenpool and goes to Crackclaw Point in these two. But in Brienne 5 she returns from Crackclaw and deals with Tarly and stays the night and meets Septon Meribald and heads out and meets a bunch of the smallfolk and Meribald gives a big long speech all in one chapter. That being said 3 &amp;amp; 4 really set up 5 which allows it to move so quickly and be so much more impactful. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg50cgw", "score_hidden": false, "stickied": false, "created": 1491977278.0, "created_utc": 1491948478.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": "", "user_reports": [], "id": "dg5scnd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "gangreen424", "parent_id": "t1_dg4y8zt", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Interesting idea that the the books could/may revert in style back to the earlier books. I personally love AFFC &amp; ADWD as well, and I've always taken the change in structure and writing style more as development of GRRM's writing style. Yes, he's been a well established author for some time, but as the popularity of ASOIAF grew, the more time he spent honing and self-editing. He knew he was under a microscope now, and he put extra effort into the books to make them the absolute best he could. Thus, the chapters each evolve into their own individual novellas of a sort, giving us rich and full arcs in most chapters. Hell, probably every chapter. There's very few instances of just moving the plot along.\n\nBased on the time GRRM is taking to finish TWOW, and looking at the smaple chapters he's given us so far (especially *Mercy*), I would be surprised if this trend in his writing style ended.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting idea that the the books could/may revert in style back to the earlier books. I personally love AFFC &amp;amp; ADWD as well, and I&amp;#39;ve always taken the change in structure and writing style more as development of GRRM&amp;#39;s writing style. Yes, he&amp;#39;s been a well established author for some time, but as the popularity of ASOIAF grew, the more time he spent honing and self-editing. He knew he was under a microscope now, and he put extra effort into the books to make them the absolute best he could. Thus, the chapters each evolve into their own individual novellas of a sort, giving us rich and full arcs in most chapters. Hell, probably every chapter. There&amp;#39;s very few instances of just moving the plot along.&lt;/p&gt;\n\n&lt;p&gt;Based on the time GRRM is taking to finish TWOW, and looking at the smaple chapters he&amp;#39;s given us so far (especially &lt;em&gt;Mercy&lt;/em&gt;), I would be surprised if this trend in his writing style ended.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5scnd", "score_hidden": false, "stickied": false, "created": 1492028689.0, "created_utc": 1491999889.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4y8zt", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "tmobsessed", "parent_id": "t3_64tr68", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Addendum: If you leaf through ASoS, you'll see how shockingly short many of the chapters are. In AFFC and ADWD, Martin chose to make each chapter more of a self-contained short story, to slow the pace, and to pursue all sorts of complex meta-themes about war, governance, honor, identity and the human heart in conflict with itself. This was a choice. Many here dislike it - for me, it elevates the series immeasurably. We can (and have, and will) argue about this until the end of time, but at the end of the day, it was a _choice_ - and there's nothing stopping Martin from going back to the faster-paced style he used in ASoS, possibly creating an ideal flow and balance for the 7-book series.\n\nI'd also point out that when you re-read ASoS you can see that he's already developing the themes that will come to the forefront in AFFC and ADWD. Making TWoW/ADoS barn-burners like ASoS would, in my opinion anyway, balance the saga beautifully with the transitions from book to book working naturally (i.e., without stylistic whiplash) when all is said and done. ", "edited": 1491946746.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Addendum: If you leaf through ASoS, you&amp;#39;ll see how shockingly short many of the chapters are. In AFFC and ADWD, Martin chose to make each chapter more of a self-contained short story, to slow the pace, and to pursue all sorts of complex meta-themes about war, governance, honor, identity and the human heart in conflict with itself. This was a choice. Many here dislike it - for me, it elevates the series immeasurably. We can (and have, and will) argue about this until the end of time, but at the end of the day, it was a &lt;em&gt;choice&lt;/em&gt; - and there&amp;#39;s nothing stopping Martin from going back to the faster-paced style he used in ASoS, possibly creating an ideal flow and balance for the 7-book series.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d also point out that when you re-read ASoS you can see that he&amp;#39;s already developing the themes that will come to the forefront in AFFC and ADWD. Making TWoW/ADoS barn-burners like ASoS would, in my opinion anyway, balance the saga beautifully with the transitions from book to book working naturally (i.e., without stylistic whiplash) when all is said and done. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg4y8zt", "score_hidden": false, "stickied": false, "created": 1491974718.0, "created_utc": 1491945918.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 35}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": "", "user_reports": [], "id": "dg5q16x", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "HouseHitchens", "parent_id": "t1_dg52pyl", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "10/10", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;10/10&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5q16x", "score_hidden": false, "stickied": false, "created": 1492023679.0, "created_utc": 1491994879.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52pyl", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "elpadrinonegro", "parent_id": "t1_dg526iy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "They are like prunes those Freudian snips. They always hits you when you least expect it, and normally from behind.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They are like prunes those Freudian snips. They always hits you when you least expect it, and normally from behind.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg52pyl", "score_hidden": false, "stickied": false, "created": 1491980331.0, "created_utc": 1491951531.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg526iy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "tmobsessed", "parent_id": "t1_dg5020c", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;moondog\n\nFreudian slip?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;moondog&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Freudian slip?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg526iy", "score_hidden": false, "stickied": false, "created": 1491979627.0, "created_utc": 1491950827.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5020c", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "elpadrinonegro", "parent_id": "t3_64tr68", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;witnessing Lysa's moondog mea culpa\n\nAnd, Moondog for all I know... Don't think even GRRM have thought of this yet:)\n\nWhen I get antsy about this, only two books left, how will he ever do it. I think hells, the whole of TLotR including The Hobbit only ran 1500 pages... GRRM got this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;witnessing Lysa&amp;#39;s moondog mea culpa&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And, Moondog for all I know... Don&amp;#39;t think even GRRM have thought of this yet:)&lt;/p&gt;\n\n&lt;p&gt;When I get antsy about this, only two books left, how will he ever do it. I think hells, the whole of TLotR including The Hobbit only ran 1500 pages... GRRM got this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5020c", "score_hidden": false, "stickied": false, "created": 1491976912.0, "created_utc": 1491948112.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": "", "user_reports": [], "id": "dg528jc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "z336", "parent_id": "t3_64tr68", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Yeah, I think people might assume that the rest of the series will behave just like AFFC/ADWD. Those were world building books. They really dug in to the deeper complexities of the whole thing and expanded the cast of characters. But when the pace has to move it really moves. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I think people might assume that the rest of the series will behave just like AFFC/ADWD. Those were world building books. They really dug in to the deeper complexities of the whole thing and expanded the cast of characters. But when the pace has to move it really moves. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg528jc", "score_hidden": false, "stickied": false, "created": 1491979700.0, "created_utc": 1491950900.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": "", "user_reports": [], "id": "dg73pnd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BastardBrave", "parent_id": "t1_dg6a6y9", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I agree and disagree. I still believe he can pace the story well enough but as you said, he's older and his style has changed. ADWD had a lot more pop culture references and odd spelling choices than previous books. Nuncle, sarjent, etc. \n\nAnother reason I think he can do it is because he was still writing fine scripts for the show. Cersei's story to Tommen was something I could see taking place in the books and that was well after ADWD. \n\nWhile I think he can, it's up to him if he will. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree and disagree. I still believe he can pace the story well enough but as you said, he&amp;#39;s older and his style has changed. ADWD had a lot more pop culture references and odd spelling choices than previous books. Nuncle, sarjent, etc. &lt;/p&gt;\n\n&lt;p&gt;Another reason I think he can do it is because he was still writing fine scripts for the show. Cersei&amp;#39;s story to Tommen was something I could see taking place in the books and that was well after ADWD. &lt;/p&gt;\n\n&lt;p&gt;While I think he can, it&amp;#39;s up to him if he will. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg73pnd", "score_hidden": false, "stickied": false, "created": 1492084313.0, "created_utc": 1492055513.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6a6y9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Smack8001", "parent_id": "t1_dg5g53n", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "As of summer 2014 he was still working on Asha's perspective as the Frey army marched on Stannis... 72 hours after the end of ADWD. He is not capable of doing it before he dies or becomes to feeble to finish.\n\nHe's done it before... in his 50s. A man in his 70s cannot produce work the same level as a man in his 50s. They just can't. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As of summer 2014 he was still working on Asha&amp;#39;s perspective as the Frey army marched on Stannis... 72 hours after the end of ADWD. He is not capable of doing it before he dies or becomes to feeble to finish.&lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s done it before... in his 50s. A man in his 70s cannot produce work the same level as a man in his 50s. They just can&amp;#39;t. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6a6y9", "score_hidden": false, "stickied": false, "created": 1492049543.0, "created_utc": 1492020743.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5g53n", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "BastardBrave", "parent_id": "t3_64tr68", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Martin is capable of doing it. He is in total control of the story. I know that sounds painfully obvious but he loves to quote Tolkien and say the tale grows in the telling. That's just one of his generic interview responses he has. He knows how to craft each and every chapter to suit his desires. \n\nI believe he approached AFFC/ADWD with the intention of being indulgent. He's writing a fantasy series after all and what long-running series doesn't have entries where \"nothing happens\"? He knows what the audience wants and enjoys denying the audience that satisfaction. \n\nHe can bring it all together in two books. As the OP outlined, he's done it before. It's possible that he could extend the series but I think he's had his fun toying with the audience in that way.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Martin is capable of doing it. He is in total control of the story. I know that sounds painfully obvious but he loves to quote Tolkien and say the tale grows in the telling. That&amp;#39;s just one of his generic interview responses he has. He knows how to craft each and every chapter to suit his desires. &lt;/p&gt;\n\n&lt;p&gt;I believe he approached AFFC/ADWD with the intention of being indulgent. He&amp;#39;s writing a fantasy series after all and what long-running series doesn&amp;#39;t have entries where &amp;quot;nothing happens&amp;quot;? He knows what the audience wants and enjoys denying the audience that satisfaction. &lt;/p&gt;\n\n&lt;p&gt;He can bring it all together in two books. As the OP outlined, he&amp;#39;s done it before. It&amp;#39;s possible that he could extend the series but I think he&amp;#39;s had his fun toying with the audience in that way.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5g53n", "score_hidden": false, "stickied": false, "created": 1491998793.0, "created_utc": 1491969993.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": "", "user_reports": [], "id": "dg6ee1r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tmobsessed", "parent_id": "t1_dg5q2v2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I'm afraid that while Barristan and many if not most of the Unsullied are out saving Meereen, the Shavepate will do something rash - anything from killing Hizdahr and the other nobles he hates to refusing to let the victorious forces back through the gates. Alternatively, the nobles might overpower the Shavepate's forces. It depends on lot on who poisoned the honeyed locusts and why. The Green Grace is also a big wildcard in the situation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m afraid that while Barristan and many if not most of the Unsullied are out saving Meereen, the Shavepate will do something rash - anything from killing Hizdahr and the other nobles he hates to refusing to let the victorious forces back through the gates. Alternatively, the nobles might overpower the Shavepate&amp;#39;s forces. It depends on lot on who poisoned the honeyed locusts and why. The Green Grace is also a big wildcard in the situation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6ee1r", "score_hidden": false, "stickied": false, "created": 1492053864.0, "created_utc": 1492025064.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5q2v2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HouseHitchens", "parent_id": "t1_dg5g7k2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;The biggest danger to Team Barristan may be what awaits them when they return victoriously to Meereen.\n\nInteresting. Care to share your thoughts? Are you just talking about the Pale Mare?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The biggest danger to Team Barristan may be what awaits them when they return victoriously to Meereen.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Interesting. Care to share your thoughts? Are you just talking about the Pale Mare?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5q2v2", "score_hidden": false, "stickied": false, "created": 1492023799.0, "created_utc": 1491994999.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5g7k2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "tmobsessed", "parent_id": "t1_dg5ec6d", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;we've got five chapters from Slaver's Bay already without an end to the battle in sight.\n\n- The Ironborn are the hammer.\n\n- The two turncloak sellsword companies and/or the Unsullied spear wall and/or the walls of Meereen are the anvil.\n\n- The command and control structure of the Yunkish is in shambles.\n\n- The Unsullied have formed their nearly unassailable spear wall.\n\n- Ser Barristan has disabled several trebuchets and the dragons are gobbling up anything the remaining ones launch.\n\n- Tatters, Pretty Merys and the two Dornishmen are well on their way to freeing Daario.\n\nI'd say the end of the battle proper is well in sight. The biggest danger to Team Barristan may be what awaits them when they return victoriously to Meereen.", "edited": 1491985059.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;we&amp;#39;ve got five chapters from Slaver&amp;#39;s Bay already without an end to the battle in sight.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;The Ironborn are the hammer.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The two turncloak sellsword companies and/or the Unsullied spear wall and/or the walls of Meereen are the anvil.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The command and control structure of the Yunkish is in shambles.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The Unsullied have formed their nearly unassailable spear wall.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Ser Barristan has disabled several trebuchets and the dragons are gobbling up anything the remaining ones launch.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Tatters, Pretty Merys and the two Dornishmen are well on their way to freeing Daario.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I&amp;#39;d say the end of the battle proper is well in sight. The biggest danger to Team Barristan may be what awaits them when they return victoriously to Meereen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5g7k2", "score_hidden": false, "stickied": false, "created": 1491998909.0, "created_utc": 1491970109.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ec6d", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "twbrn", "parent_id": "t3_64tr68", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "It COULD end in two books, sure, if it's paced like ASOS. But some of the released chapters, like Arianne 1 and 2, and Alayne, are more like AFFC pacing, plus we've got five chapters from Slaver's Bay already without an end to the battle in sight. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It COULD end in two books, sure, if it&amp;#39;s paced like ASOS. But some of the released chapters, like Arianne 1 and 2, and Alayne, are more like AFFC pacing, plus we&amp;#39;ve got five chapters from Slaver&amp;#39;s Bay already without an end to the battle in sight. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5ec6d", "score_hidden": false, "stickied": false, "created": 1491995966.0, "created_utc": 1491967166.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": "", "user_reports": [], "id": "dg5yrsy", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "FreeParking42", "parent_id": "t1_dg5objr", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "ASOIAF is not nearly as unconventional as some people seem to think.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ASOIAF is not nearly as unconventional as some people seem to think.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5yrsy", "score_hidden": false, "stickied": false, "created": 1492037507.0, "created_utc": 1492008707.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5objr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Lugonn", "parent_id": "t1_dg5nki3", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "You can keep telling yourself that ASOIAF is some groundbreaking revolution of storytelling, but I'm warning you you'll end up disappointed. The main characters are Jon, Dany, Tyrion, Arya, Sansa, Bran. They all follow the standard act 1 story progression to a T. Everyone else is a side character of various levels of significance.\n\n&gt; the first 3 books are the first act, books 4 &amp; 5 are between them as long as the first 3 and could thus be considered the second act\n\nNo... that's not the way this works. These books were never supposed to be written, they're just the background context for the second act. If you release three filler movies between Star Wars episode 4 and 5, that doesn't suddenly make ESB part of the third act.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can keep telling yourself that ASOIAF is some groundbreaking revolution of storytelling, but I&amp;#39;m warning you you&amp;#39;ll end up disappointed. The main characters are Jon, Dany, Tyrion, Arya, Sansa, Bran. They all follow the standard act 1 story progression to a T. Everyone else is a side character of various levels of significance.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;the first 3 books are the first act, books 4 &amp;amp; 5 are between them as long as the first 3 and could thus be considered the second act&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No... that&amp;#39;s not the way this works. These books were never supposed to be written, they&amp;#39;re just the background context for the second act. If you release three filler movies between Star Wars episode 4 and 5, that doesn&amp;#39;t suddenly make ESB part of the third act.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5objr", "score_hidden": false, "stickied": false, "created": 1492018596.0, "created_utc": 1491989796.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5nki3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "tmobsessed", "parent_id": "t1_dg5juyd", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;It's a trilogy with a standard trilogy plot progression.\n\nIs it? Or is the standard trilogy plot progression described one of the many genres that are being merged and/or riffed on?\n\n&gt;Act 1: The main characters get pulled out of their comfortable lives [...] Act 2: Main characters are ready to start making waves [...] Act 3: Main characters get their shit together. \n\nThis is a great description of a very familiar and oft-used format that _appears_ on its face to be the basis for the PoV chapters of Arya, Bran, Sansa, Dany and Jon, but not of Ned, Robb, Cat, Tyrion, Davos, Jaime, etc. But ASOIAF isn't the story of any one of those in the same way that LotR is the story of Frodo, for example. It's more like the story of Grrth, in the sense that The Wire is the story of Baltimore. There's no \"hero\" of ASOIAF - it's an ensemble cast and even the most familiar-looking characters (like Bran and Jon) may turn out to be very different than the apparent genre being followed would lead us to believe.\n\nSo rather than pigeon hole the work into the \"comfortable life ... mentor dies ... student surpasses master\" cliché, perhaps the first act is about war and vengeance - the second act the results of war and vengeance - and the third act some sort of catharsis that none of us has yet imagined. Even with the more standard character arcs, the beauty of the thing is that the story of each PoV is like a novel unto itself with its own pacing. Or maybe it's two trilogies spread over seven volumes, with ASoS being the climax of the first. Or maybe it's two trilogies and an expansive epilogue. What it's _not_ - imo - is a \"standard trilogy plot progession\".^2\n\nAnd it always has to be pointed out that while we call this \"fantasy\", it's just as much \"mystery\", and \"historical fiction\", each of which uses extremely different standard plot progressions.\n\n&gt;Martin decided to take three books for his first act, if he rushes the second and third act through in a single book each the story will feel ridiculously lopsided. Why would you spend 20+ years on the setup of your story only to end with such a whimper?\n\nObviously you wouldn't want it to be lopsided or end with a whimper, but I'm not quite following your breakdown. If - as you say - the first 3 books are the first act, books 4 &amp; 5 are between them as long as the first 3 and could thus be considered the second act, leaving two even longer books for the final act. **But I agree in principle.** With a work this long and this integrated, success or failure rests more than anything else on the balance of the overall form.^1 However, it's a form that hasn't been tried before and which, by its nature, is far less linear than any other series that could be considered a multi-book epic fantasy. We all agree, and I'm sure no one more than Martin himself, that it has to not \"end with a whimper\". Obviously he should, and almost certainly will, make any and all decisions based on legacy - based on how history judges the finished work. He has no incentive to rush (as we know only too well!). The earlier post today argued that he will need more than 7 books to do the best possible job. I'm arguing that seven books could work perfectly, and that A Storm of Swords shows just how much can happen - without feeling rushed - in 1100 paperback pages (with TWoW and presumably ADoS predicted to be at least 1500 each). \n\n___\n^1 It's been so long since ADwD that I think the trap reddit critics are falling into is considering the 5 books to be a complete work. If they were, it would most certainly be ridiculously lopsided, ending on a whimper and essentially a huge failure with profound amounts of wasted potential. But if we're almost to the end of Act II, with almost three times the length of ASoS in pages yet to come - obviously we can't begin to judge the success or failure of the overall large form.\n\n^2 Critics panned Beethoven's Eroica Symphony. It was twice as long as anything by Mozart or Haydn and it seemed ridiculously long, ridiculously lopsided, badly misproportioned, went out with a whimper and was generally despised. Today, the Eroica routinely receives descriptions such as \"the watershed work, not only in terms of his oeuvre, but also in terms of our whole musical tradition, considered as broadly as we please\" (Joseph Kerman). To say what he wanted to say, Beethoven had to utterly change the form and balance of the symphony as it existed at the time. I'm not saying that GRRM is Beethoven, but if this massive work is going to succeed, **its form will have to serve his vision rather than him forcing his vision into a pre-existing form**.\n", "edited": 1491988560.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s a trilogy with a standard trilogy plot progression.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Is it? Or is the standard trilogy plot progression described one of the many genres that are being merged and/or riffed on?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Act 1: The main characters get pulled out of their comfortable lives [...] Act 2: Main characters are ready to start making waves [...] Act 3: Main characters get their shit together. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is a great description of a very familiar and oft-used format that &lt;em&gt;appears&lt;/em&gt; on its face to be the basis for the PoV chapters of Arya, Bran, Sansa, Dany and Jon, but not of Ned, Robb, Cat, Tyrion, Davos, Jaime, etc. But ASOIAF isn&amp;#39;t the story of any one of those in the same way that LotR is the story of Frodo, for example. It&amp;#39;s more like the story of Grrth, in the sense that The Wire is the story of Baltimore. There&amp;#39;s no &amp;quot;hero&amp;quot; of ASOIAF - it&amp;#39;s an ensemble cast and even the most familiar-looking characters (like Bran and Jon) may turn out to be very different than the apparent genre being followed would lead us to believe.&lt;/p&gt;\n\n&lt;p&gt;So rather than pigeon hole the work into the &amp;quot;comfortable life ... mentor dies ... student surpasses master&amp;quot; cliché, perhaps the first act is about war and vengeance - the second act the results of war and vengeance - and the third act some sort of catharsis that none of us has yet imagined. Even with the more standard character arcs, the beauty of the thing is that the story of each PoV is like a novel unto itself with its own pacing. Or maybe it&amp;#39;s two trilogies spread over seven volumes, with ASoS being the climax of the first. Or maybe it&amp;#39;s two trilogies and an expansive epilogue. What it&amp;#39;s &lt;em&gt;not&lt;/em&gt; - imo - is a &amp;quot;standard trilogy plot progession&amp;quot;.&lt;sup&gt;2&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;And it always has to be pointed out that while we call this &amp;quot;fantasy&amp;quot;, it&amp;#39;s just as much &amp;quot;mystery&amp;quot;, and &amp;quot;historical fiction&amp;quot;, each of which uses extremely different standard plot progressions.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Martin decided to take three books for his first act, if he rushes the second and third act through in a single book each the story will feel ridiculously lopsided. Why would you spend 20+ years on the setup of your story only to end with such a whimper?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Obviously you wouldn&amp;#39;t want it to be lopsided or end with a whimper, but I&amp;#39;m not quite following your breakdown. If - as you say - the first 3 books are the first act, books 4 &amp;amp; 5 are between them as long as the first 3 and could thus be considered the second act, leaving two even longer books for the final act. &lt;strong&gt;But I agree in principle.&lt;/strong&gt; With a work this long and this integrated, success or failure rests more than anything else on the balance of the overall form.&lt;sup&gt;1&lt;/sup&gt; However, it&amp;#39;s a form that hasn&amp;#39;t been tried before and which, by its nature, is far less linear than any other series that could be considered a multi-book epic fantasy. We all agree, and I&amp;#39;m sure no one more than Martin himself, that it has to not &amp;quot;end with a whimper&amp;quot;. Obviously he should, and almost certainly will, make any and all decisions based on legacy - based on how history judges the finished work. He has no incentive to rush (as we know only too well!). The earlier post today argued that he will need more than 7 books to do the best possible job. I&amp;#39;m arguing that seven books could work perfectly, and that A Storm of Swords shows just how much can happen - without feeling rushed - in 1100 paperback pages (with TWoW and presumably ADoS predicted to be at least 1500 each). &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;sup&gt;1&lt;/sup&gt; It&amp;#39;s been so long since ADwD that I think the trap reddit critics are falling into is considering the 5 books to be a complete work. If they were, it would most certainly be ridiculously lopsided, ending on a whimper and essentially a huge failure with profound amounts of wasted potential. But if we&amp;#39;re almost to the end of Act II, with almost three times the length of ASoS in pages yet to come - obviously we can&amp;#39;t begin to judge the success or failure of the overall large form.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;2&lt;/sup&gt; Critics panned Beethoven&amp;#39;s Eroica Symphony. It was twice as long as anything by Mozart or Haydn and it seemed ridiculously long, ridiculously lopsided, badly misproportioned, went out with a whimper and was generally despised. Today, the Eroica routinely receives descriptions such as &amp;quot;the watershed work, not only in terms of his oeuvre, but also in terms of our whole musical tradition, considered as broadly as we please&amp;quot; (Joseph Kerman). To say what he wanted to say, Beethoven had to utterly change the form and balance of the symphony as it existed at the time. I&amp;#39;m not saying that GRRM is Beethoven, but if this massive work is going to succeed, &lt;strong&gt;its form will have to serve his vision rather than him forcing his vision into a pre-existing form&lt;/strong&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5nki3", "score_hidden": false, "stickied": false, "created": 1492016210.0, "created_utc": 1491987410.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5juyd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Lugonn", "parent_id": "t3_64tr68", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "You could, but you shouldn't. It's a trilogy with a standard trilogy plot progression.\n\nAct 1: The main characters get pulled out of their comfortable lives and get jostled around. Their mentor dies, they have to start standing on their own. Eventually they settle down where there is room for them to grow.\n\nAct 2: Main characters are ready to start making waves now. They jump into politics, and war and leadership, magic and assassination. But they're not ready yet, things start going wrong. You get your ass kicked by Darth Vader, you let the evil god escape, the Wall comes down.\n\nAct 3: Main characters get their shit together. They've learned from their mistakes and are trying to make it better. They learn the value of friendship, or confidence, or cooperation, or trust, or faith, or hope, or whatever their character arc was focused on. They band together and with tremendous effort the world is saved.\n\nYou could tell this in as many books as you want, three, five, nine, fifteen. But it should be balanced. Martin decided to take three books for his first act, if he rushes the second and third act through in a single book each the story will feel ridiculously lopsided. Why would you spend 20+ years on the setup of your story only to end with such a whimper?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could, but you shouldn&amp;#39;t. It&amp;#39;s a trilogy with a standard trilogy plot progression.&lt;/p&gt;\n\n&lt;p&gt;Act 1: The main characters get pulled out of their comfortable lives and get jostled around. Their mentor dies, they have to start standing on their own. Eventually they settle down where there is room for them to grow.&lt;/p&gt;\n\n&lt;p&gt;Act 2: Main characters are ready to start making waves now. They jump into politics, and war and leadership, magic and assassination. But they&amp;#39;re not ready yet, things start going wrong. You get your ass kicked by Darth Vader, you let the evil god escape, the Wall comes down.&lt;/p&gt;\n\n&lt;p&gt;Act 3: Main characters get their shit together. They&amp;#39;ve learned from their mistakes and are trying to make it better. They learn the value of friendship, or confidence, or cooperation, or trust, or faith, or hope, or whatever their character arc was focused on. They band together and with tremendous effort the world is saved.&lt;/p&gt;\n\n&lt;p&gt;You could tell this in as many books as you want, three, five, nine, fifteen. But it should be balanced. Martin decided to take three books for his first act, if he rushes the second and third act through in a single book each the story will feel ridiculously lopsided. Why would you spend 20+ years on the setup of your story only to end with such a whimper?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5juyd", "score_hidden": false, "stickied": false, "created": 1492005911.0, "created_utc": 1491977111.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": "", "user_reports": [], "id": "dg5g0b7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tmobsessed", "parent_id": "t1_dg59osu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;the Hound's apparent demise\n\nAnd then we have a Hound's parent's demise:\n\n&gt;Ned seldom put much stock in gossip, but the things said of Ser Gregor were more than ominous. He was soon to be married for the third time, and one heard dark whisperings about the deaths of his first two wives. It was said that his keep was a grim place where servants disappeared unaccountably and even the dogs were afraid to enter the hall. And there had been a sister who had died young under queer circumstances, and the fire that had disfigured his brother, **and the hunting accident that had killed their father**. Gregor had inherited the keep, the gold, and the family estates. \n\n*\"They say I shot a man named Grey, and took his wife to Italy. She inherited a million bucks, and when she died, it came to me. I can't help it if I'm lucky.\"* (Bob Dylan, 1975)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;the Hound&amp;#39;s apparent demise&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And then we have a Hound&amp;#39;s parent&amp;#39;s demise:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Ned seldom put much stock in gossip, but the things said of Ser Gregor were more than ominous. He was soon to be married for the third time, and one heard dark whisperings about the deaths of his first two wives. It was said that his keep was a grim place where servants disappeared unaccountably and even the dogs were afraid to enter the hall. And there had been a sister who had died young under queer circumstances, and the fire that had disfigured his brother, &lt;strong&gt;and the hunting accident that had killed their father&lt;/strong&gt;. Gregor had inherited the keep, the gold, and the family estates. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;They say I shot a man named Grey, and took his wife to Italy. She inherited a million bucks, and when she died, it came to me. I can&amp;#39;t help it if I&amp;#39;m lucky.&amp;quot;&lt;/em&gt; (Bob Dylan, 1975)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg5g0b7", "score_hidden": false, "stickied": false, "created": 1491998573.0, "created_utc": 1491969773.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg59osu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Righteous_Legion", "parent_id": "t3_64tr68", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;passing by the Red Wedding in progress, and ultimately leading to the Hound's apparent demise and Arya's departure for Braavos\n\n&gt;ultimately leading to the Hound's apparent demise\n\n&gt;Hound's apparent demise\n\n&gt;apparent\n\n*CLEGANEBOWL GET HYPE*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;passing by the Red Wedding in progress, and ultimately leading to the Hound&amp;#39;s apparent demise and Arya&amp;#39;s departure for Braavos&lt;/p&gt;\n\n&lt;p&gt;ultimately leading to the Hound&amp;#39;s apparent demise&lt;/p&gt;\n\n&lt;p&gt;Hound&amp;#39;s apparent demise&lt;/p&gt;\n\n&lt;p&gt;apparent&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;em&gt;CLEGANEBOWL GET HYPE&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg59osu", "score_hidden": false, "stickied": false, "created": 1491989566.0, "created_utc": 1491960766.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": "", "user_reports": [], "id": "dg65jvn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "palindrome_emordnila", "parent_id": "t3_64tr68", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;when GRRM has a mind to make it do so.\n  \nHe clearly doesn't.  For the last book, he's writing all of the chapters as sonnets from the PoV of animals.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;when GRRM has a mind to make it do so.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He clearly doesn&amp;#39;t.  For the last book, he&amp;#39;s writing all of the chapters as sonnets from the PoV of animals.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg65jvn", "score_hidden": false, "stickied": false, "created": 1492044842.0, "created_utc": 1492016042.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64tr68", "likes": null, "replies": "", "user_reports": [], "id": "dg6a6k3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "InfernoBA", "parent_id": "t3_64tr68", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "It's possible, but my bet is that doing just that (tying up the plot and getting everyone in position for ADOS) is exactly why he's taking so long to finish the book. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s possible, but my bet is that doing just that (tying up the plot and getting everyone in position for ADOS) is exactly why he&amp;#39;s taking so long to finish the book. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6a6k3", "score_hidden": false, "stickied": false, "created": 1492049532.0, "created_utc": 1492020732.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]