[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "asoiaf", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What really happened at Hardhome? And I don&amp;#39;t mean last month, when Mother Mole led the Free Folk there to await ships she dreamed would carry them to safety. I mean 600 years ago, when Hardhome was a prosperous little town, well on its way to becoming the first permanant settlement beyond the Wall.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;sup&gt;Jon knew the tale. &lt;strong&gt;Hardhome had been halfway toward becoming a town, the only true town north of the Wall, until the night six hundred years ago when hell had swallowed it. Its people had been carried off into slavery or slaughtered for meat, depending on which version of the tale you believed, their homes and halls consumed in a conflagration that burned so hot that watchers on the Wall far to the south had thought the sun was rising in the north. Afterward ashes rained down on haunted forest and Shivering Sea alike for almost half a year.&lt;/strong&gt; Traders reported finding only nightmarish devastation where Hardhome had stood, a landscape of charred trees and burned bones, waters choked with swollen corpses, blood-chilling shrieks echoing from the cave mouths that pocked the great cliff that loomed above the settlement.&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;strong&gt;Six centuries had come and gone since that night, but Hardhome was still shunned.&lt;/strong&gt; The wild had reclaimed the site, Jon had been told, but &lt;strong&gt;rangers claimed that the overgrown ruins were haunted by ghouls and demons and burning ghosts with an unhealthy taste for blood.&lt;/strong&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s quite a mystery, but the style and format of the narrative (and most importantly, the &lt;em&gt;date&lt;/em&gt;) provides all the clues necessary to figure out what exactly happened to the place, and why exactly it&amp;#39;s still shunned, even six centuries later. But before we jump into that, there&amp;#39;s an overwhelming, obvious allusion being made here.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;...hell had swallowed it.&lt;/p&gt;\n\n&lt;p&gt;...watchers on the Wall far to the south had thought the sun was rising in the north.&lt;/p&gt;\n\n&lt;p&gt;...ashes rained down on haunted forest and Shivering Sea alike for almost half a year.&lt;/p&gt;\n\n&lt;p&gt;Traders reported finding only nightmarish devastation where Hardhome had stood, a landscape of charred trees and burned bones...&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A second sun rising in the north - the blast was so large it seemed as bright as the sun. Ashes raining down for half a year. Nightmarish devastation. Wildlife that takes decades to recover, and even now is strange. &lt;strong&gt;GRRM has written the legends of Hardhome to evoke a nuclear detonation, complete with the nuclear fallout (raining ashes) and catastrophic enviornmental devestation (nightmarish landscape).&lt;/strong&gt; The stories of demon hauntings and ghouls and burning ghosts could easily be garbled accounts of radiation poisoning or deformed people and animals.&lt;/p&gt;\n\n&lt;p&gt;Note that I&amp;#39;m not saying it &lt;em&gt;was&lt;/em&gt; a nuclear bomb - it almost certainly was not - but GRRM is &lt;em&gt;intentionally evoking&lt;/em&gt; the image of one. Particularly the image of a second sun rising in the north, which is often how witnesses of a nuclear blast describe them. Here is a description of the Trinity test.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;After about a millisecond, the fireball from a 1 megaton nuclear weapon would appear to an observer 50 miles away to be many times more brilliant than the sun at noon... bursts in the megaton range have been seen directly as far a 700 miles away.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But why? What reason would GRRM have to imply that Hardhome was the site of some sort of spontaneous nuclear explosion? I think the answer is that it wasn&amp;#39;t spontaneous. It was very, very controlled, in point of fact. I think it was a sort of... weapons test, if you will. A dry run for the big kaboom.&lt;/p&gt;\n\n&lt;h2&gt;&lt;strong&gt;The Destroyer of Worlds&lt;/strong&gt;&lt;/h2&gt;\n\n&lt;p&gt;The Trinity test site in New Mexico was the site of the first nuclear detonation in history. Hundreds of top Allied scientists, under the direction of Robert Oppenheimer, worked in secret for years, building on Einstein&amp;#39;s work and eventually succeeding in splitting the atom. The nuclear bomb would become America&amp;#39;s coup in World War II, providing a means to quickly and categorically put an end the ambitions of the brutal, conquest-hungry Japanese Empire with the least amount of human death possible.&lt;/p&gt;\n\n&lt;p&gt;Upon seeing the nuclear bomb detonate for the first time, Oppenheimer famously quoted the &lt;em&gt;Bhagavad Gita&lt;/em&gt;, saying &lt;strong&gt;&amp;quot;Now I am become Death, the destroyer of worlds.&amp;quot;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I believe Hardhome was the Trinity test of ASOIAF. And I believe the evocation of the Trinity test is done intentionally - this time, the responsible party &lt;em&gt;was&lt;/em&gt; death - the destroyer of worlds.&lt;/p&gt;\n\n&lt;p&gt;Here is the releveant timeline:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;800 Years Ago:&lt;/strong&gt; The Faceless Men come forth, inciting a slave rebellion on a fleet of Valyrian ships. The ships flee the wrath of the dragonlords and found the Free City of Braavos.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;700 Years Ago:&lt;/strong&gt; Braavos reveals itself to the world. The Faceless Men begin to work for hire outside of Braavos, giving the gift, becoming infamous, and collecting their first century of &amp;quot;payments&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;600 Years Ago:&lt;/strong&gt; Hardhome destroyed.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;400 Years Ago:&lt;/strong&gt; The Doom of Valyria - as in, Hardhome, but an entire continent.&lt;/p&gt;\n\n&lt;p&gt;We know that from the first moment of the Faceless Men, a very long, very intricate &lt;em&gt;cyvasse&lt;/em&gt; game began between the Faceless Men and the Valyrian Freehold - though the Valyrians never got a chance to figure this out. And we know that although the Faceless Men don&amp;#39;t mind extreme collateral damage, they brought &amp;quot;the gift&amp;quot; to the Valyrians as well.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;That very night he chose the most wretched of the slaves, the one who had prayed most earnestly for release, and freed him from his bondage. The first gift had been given.”&lt;/p&gt;\n\n&lt;p&gt;Arya drew back from him. “He killed the slave?” That did not sound right. &lt;strong&gt;“He should have killed the masters!”&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;“He would bring the gift to them as well... but that is a tale for another day, one best shared with no one.&amp;quot;&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It should be noted that the Kindly Man is claiming responsibility for the Doom of Valyria. Whether it was done directly or indirectly remains to be made explicit - hopefully we&amp;#39;ll hear more details by the time Arya is done with her training - but one thing that is certain is that the Faceless Men spent the three-hundred-eighty-odd years between the founding of Braavos and the Doom of Valyria &lt;em&gt;engineering the downfall of the Valyrians.&lt;/em&gt; And Hardhome is smack dab in the middle of that time period, behaving just like a little Doom of Valyria. And even though we already had the story from Jon, guess which two characters go out of their way to exposit it for us?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The next morning, when the kindly man asked her what three things she knew that she had not known before, she was ready.&lt;/p&gt;\n\n&lt;p&gt;“I know why the Sealord seized the Goodheart. She was carrying slaves. Hundreds of slaves, women and children, roped together in her hold.” Braavos had been founded by escaped slaves, and the slave trade was forbidden here. &lt;strong&gt;&amp;quot;I know where the slaves came from. They were wildlings from Westeros, from a place called Hardhome. An old ruined place, accursed.” Old Nan had told her tales of Hardhome, back at Winterfell when she had still been Arya Stark.&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s right, the Free Folk from Hardhome end up in Braavos of all places - and Tycho Nestoris&amp;#39;s fleet was weirdly given to the Night&amp;#39;s Watch to rescue many more. Arya even specifically mentions the Doom of Hardhome to the Kindly Man - who, probably, is trying really hard not to give away spoilers.&lt;/p&gt;\n\n&lt;h2&gt;&lt;strong&gt;Fire, made Flesh, made Fire Again&lt;/strong&gt;&lt;/h2&gt;\n\n&lt;p&gt;But what could be the source of the blast? One thing is certain: it was much less intense than the Doom of Valyria, where hell swallowed an entire fucking continent. Here are the prevailing theories on the Doom, with the answers we can safely eliminate crossed out.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;sup&gt;To this day, no one knows what caused the Doom. &lt;del&gt;Most say that it was a natural cataclysm&lt;/del&gt;—a catastrophic explosion caused by the eruption of all Fourteen Flames together. &lt;del&gt;Some septons, less wise, claim that the Valyrians brought the disaster on themselves for their promiscuous belief in a hundred gods and more, and in their godlessness they delved too deep and unleashed the fires of the Seven hells on the Freehold.&lt;/del&gt; A handful of maesters, influenced by fragments of the work of Septon Barth, hold that Valyria had used spells to tame the Fourteen Flames for thousands of years, that their ceaseless hunger for slaves and wealth was as much to sustain these spells as to expand their power, and that when at last those spells faltered, the cataclysm became inevitable.&lt;/sup&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So we see that the Fourteen Flames exploded. And we know those volcanos are not &amp;quot;natural&amp;quot; - the fires beneath the earth are not just natural occurences, as in our world, but the domain of fire wyrms.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;“Fire wyrms. Some say they are akin to dragons, for wyrms breathe fire too. Instead of soaring through the sky, they bore through stone and soil. If the old tales can be believed, there were wyrms amongst the Fourteen Flames even before the dragons came.&lt;/strong&gt; The young ones are no larger than that skinny arm of yours, but they can grow to monstrous size and have no love for men.”&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And dragons heating the &amp;quot;furnaces of the world&amp;quot; would make sense - a common saying among the more magically knowledgable in ASOIAF is:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;&amp;quot;Dragons are fire made flesh, and fire is power.”&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And of course there were dragons in Westeros too, long ago. Dragonglass is plentiful north of the Wall, and the story of Florian the Fool contains a dragon. But a dragon makes no sense. &lt;em&gt;Valyria&lt;/em&gt; had thousands of dragons - and like Hardhome, the Doom occured in the space of a single day, consuming them all in an inferno so hot that &amp;quot;even dragons burned.&amp;quot; So now let&amp;#39;s return to the idea of nuclear weapons. Dragons are, of course, a very heavy-handed metaphor for nuclear weapons - GRRM has said this over and over again in interviews, and the many different allusions to nuclear war in the account of the Dance of the Dragons do a fine job of illustrating the concept of mutually assured destruction. But what if the metaphor were more literal? What if dragons, fire made flesh, &lt;em&gt;could be made into fire again?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Though we have only fragments (thanks, GRRM) TWOIAF gives us a hint that something like this may have happened at Summerhall.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;...the blood of the dragon gathered in one...&lt;/em&gt; &lt;strong&gt;&lt;em&gt;...seven eggs, to honor the seven gods,&lt;/em&gt;&lt;/strong&gt; &lt;em&gt;though the king&amp;#39;s own septon had warned... ...pyromancers... ...wild fire... ...flames grew out of control...towering...&lt;/em&gt; &lt;strong&gt;&lt;em&gt;burned so hot that...&lt;/em&gt;&lt;/strong&gt; &lt;em&gt;...died, but for the valor of the Lord Comman...&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;I believe that given sufficient stimulation, a dragon egg can be detonated instead of hatched, releasing the concentrated &amp;quot;fire power&amp;quot; of the egg in one catastrophic blast, on par with a nuclear bomb.&lt;/strong&gt; Although Aegon wasn&amp;#39;t trying to detonate anything, I believe the involvement of the pyromancers (whose arts are tied to the existence of dragons, and who beg Cersei to be allowed to hatch any newly discovered dragon eggs) destabilized the eggs, causing a partial detonation that, while not on the scale of Hardhome, was more than sufficient to wipe out Summerhall and kill Dunk, Egg, and most of the last Valyrian family tree (And who knows, maybe the Faceless interfered with Summerhall as well).&lt;/p&gt;\n\n&lt;p&gt;I believe that the Faceless Men tested their dragon egg &amp;quot;suitcase nuke&amp;quot; at Hardhome (their &amp;quot;Trinity&amp;quot; site) to see how much destruction exactly one egg could cause. Once they knew that, they poured all their efforts into weakening the Valyrians and stockpiling dragon eggs. And one fine day, they detonated dozens of eggs across the Valyrian peninsula, causing a chain reaction with the eggs of the fire wyrms in the Fourteen Flames, and consuming the continent in an apocolypse of sorcery, fire, and blood - the ultimate commupance. &lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;Oh, and if you&amp;#39;re wondering how the Faceless could be monstrous, remember that Hardhome was a few thousand people at most - if the Faceless Men caused the Doom, they incinerated millions of innocent slaves along with their masters. And the story of the revolt is begun by the Faceless killing a slave - a precursor to a story with lots of innocent death. But that&amp;#39;s all right. &lt;em&gt;Valar Morghulis.&lt;/em&gt;&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;Oh, and one last thought: if a certain godless man paid for a certain assassination with a certain egg, the Faceless Men may have one more nuclear bombshell to drop. And a certain godless man has sailed the Smoking Sea, and seen Valyria.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR: Hardhome was a weapons test, the Faceless Men&amp;#39;s dry run for the Doom of Valyria. Both events are described with the same post-nuclear verbiage (as bright as the sun, raining ash, devastated wastelands, haunted and accursed, demons and ghouls and monsters) and the story of Hardhome and the fall of Valyria are both very prominent in Arya&amp;#39;s storyline and in the House of Black and White.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "What really happened at Hardhome? And I don't mean last month, when Mother Mole led the Free Folk there to await ships she dreamed would carry them to safety. I mean 600 years ago, when Hardhome was a prosperous little town, well on its way to becoming the first permanant settlement beyond the Wall.\n\n&gt; ^(Jon knew the tale. **Hardhome had been halfway toward becoming a town, the only true town north of the Wall, until the night six hundred years ago when hell had swallowed it. Its people had been carried off into slavery or slaughtered for meat, depending on which version of the tale you believed, their homes and halls consumed in a conflagration that burned so hot that watchers on the Wall far to the south had thought the sun was rising in the north. Afterward ashes rained down on haunted forest and Shivering Sea alike for almost half a year.** Traders reported finding only nightmarish devastation where Hardhome had stood, a landscape of charred trees and burned bones, waters choked with swollen corpses, blood-chilling shrieks echoing from the cave mouths that pocked the great cliff that loomed above the settlement.)\n\n&gt; ^(**Six centuries had come and gone since that night, but Hardhome was still shunned.** The wild had reclaimed the site, Jon had been told, but **rangers claimed that the overgrown ruins were haunted by ghouls and demons and burning ghosts with an unhealthy taste for blood.**)\n\nIt's quite a mystery, but the style and format of the narrative (and most importantly, the *date*) provides all the clues necessary to figure out what exactly happened to the place, and why exactly it's still shunned, even six centuries later. But before we jump into that, there's an overwhelming, obvious allusion being made here.\n\n&gt;  ...hell had swallowed it.\n\n&gt; ...watchers on the Wall far to the south had thought the sun was rising in the north.\n\n&gt; ...ashes rained down on haunted forest and Shivering Sea alike for almost half a year.\n\n&gt; Traders reported finding only nightmarish devastation where Hardhome had stood, a landscape of charred trees and burned bones...\n\nA second sun rising in the north - the blast was so large it seemed as bright as the sun. Ashes raining down for half a year. Nightmarish devastation. Wildlife that takes decades to recover, and even now is strange. **GRRM has written the legends of Hardhome to evoke a nuclear detonation, complete with the nuclear fallout (raining ashes) and catastrophic enviornmental devestation (nightmarish landscape).** The stories of demon hauntings and ghouls and burning ghosts could easily be garbled accounts of radiation poisoning or deformed people and animals.\n\nNote that I'm not saying it *was* a nuclear bomb - it almost certainly was not - but GRRM is *intentionally evoking* the image of one. Particularly the image of a second sun rising in the north, which is often how witnesses of a nuclear blast describe them. Here is a description of the Trinity test.\n\n&gt; After about a millisecond, the fireball from a 1 megaton nuclear weapon would appear to an observer 50 miles away to be many times more brilliant than the sun at noon... bursts in the megaton range have been seen directly as far a 700 miles away.\n\nBut why? What reason would GRRM have to imply that Hardhome was the site of some sort of spontaneous nuclear explosion? I think the answer is that it wasn't spontaneous. It was very, very controlled, in point of fact. I think it was a sort of... weapons test, if you will. A dry run for the big kaboom.\n\n##**The Destroyer of Worlds**\n\nThe Trinity test site in New Mexico was the site of the first nuclear detonation in history. Hundreds of top Allied scientists, under the direction of Robert Oppenheimer, worked in secret for years, building on Einstein's work and eventually succeeding in splitting the atom. The nuclear bomb would become America's coup in World War II, providing a means to quickly and categorically put an end the ambitions of the brutal, conquest-hungry Japanese Empire with the least amount of human death possible.\n\nUpon seeing the nuclear bomb detonate for the first time, Oppenheimer famously quoted the *Bhagavad Gita*, saying **\"Now I am become Death, the destroyer of worlds.\"**\n\nI believe Hardhome was the Trinity test of ASOIAF. And I believe the evocation of the Trinity test is done intentionally - this time, the responsible party *was* death - the destroyer of worlds.\n\nHere is the releveant timeline:\n\n**800 Years Ago:** The Faceless Men come forth, inciting a slave rebellion on a fleet of Valyrian ships. The ships flee the wrath of the dragonlords and found the Free City of Braavos.\n\n**700 Years Ago:** Braavos reveals itself to the world. The Faceless Men begin to work for hire outside of Braavos, giving the gift, becoming infamous, and collecting their first century of \"payments\".\n\n**600 Years Ago:** Hardhome destroyed.\n\n**400 Years Ago:** The Doom of Valyria - as in, Hardhome, but an entire continent.\n\nWe know that from the first moment of the Faceless Men, a very long, very intricate *cyvasse* game began between the Faceless Men and the Valyrian Freehold - though the Valyrians never got a chance to figure this out. And we know that although the Faceless Men don't mind extreme collateral damage, they brought \"the gift\" to the Valyrians as well.\n\n&gt; \"That very night he chose the most wretched of the slaves, the one who had prayed most earnestly for release, and freed him from his bondage. The first gift had been given.”\n\n&gt; Arya drew back from him. “He killed the slave?” That did not sound right. **“He should have killed the masters!”**\n\n&gt; **“He would bring the gift to them as well... but that is a tale for another day, one best shared with no one.\"**\n\nIt should be noted that the Kindly Man is claiming responsibility for the Doom of Valyria. Whether it was done directly or indirectly remains to be made explicit - hopefully we'll hear more details by the time Arya is done with her training - but one thing that is certain is that the Faceless Men spent the three-hundred-eighty-odd years between the founding of Braavos and the Doom of Valyria *engineering the downfall of the Valyrians.* And Hardhome is smack dab in the middle of that time period, behaving just like a little Doom of Valyria. And even though we already had the story from Jon, guess which two characters go out of their way to exposit it for us?\n\n&gt; The next morning, when the kindly man asked her what three things she knew that she had not known before, she was ready.\n\n&gt; “I know why the Sealord seized the Goodheart. She was carrying slaves. Hundreds of slaves, women and children, roped together in her hold.” Braavos had been founded by escaped slaves, and the slave trade was forbidden here. **\"I know where the slaves came from. They were wildlings from Westeros, from a place called Hardhome. An old ruined place, accursed.” Old Nan had told her tales of Hardhome, back at Winterfell when she had still been Arya Stark.**\n\nThat's right, the Free Folk from Hardhome end up in Braavos of all places - and Tycho Nestoris's fleet was weirdly given to the Night's Watch to rescue many more. Arya even specifically mentions the Doom of Hardhome to the Kindly Man - who, probably, is trying really hard not to give away spoilers.\n\n##**Fire, made Flesh, made Fire Again**\n\nBut what could be the source of the blast? One thing is certain: it was much less intense than the Doom of Valyria, where hell swallowed an entire fucking continent. Here are the prevailing theories on the Doom, with the answers we can safely eliminate crossed out.\n\n&gt; ^(To this day, no one knows what caused the Doom. ~~Most say that it was a natural cataclysm~~—a catastrophic explosion caused by the eruption of all Fourteen Flames together. ~~Some septons, less wise, claim that the Valyrians brought the disaster on themselves for their promiscuous belief in a hundred gods and more, and in their godlessness they delved too deep and unleashed the fires of the Seven hells on the Freehold.~~ A handful of maesters, influenced by fragments of the work of Septon Barth, hold that Valyria had used spells to tame the Fourteen Flames for thousands of years, that their ceaseless hunger for slaves and wealth was as much to sustain these spells as to expand their power, and that when at last those spells faltered, the cataclysm became inevitable.)\n\nSo we see that the Fourteen Flames exploded. And we know those volcanos are not \"natural\" - the fires beneath the earth are not just natural occurences, as in our world, but the domain of fire wyrms.\n\n&gt; **“Fire wyrms. Some say they are akin to dragons, for wyrms breathe fire too. Instead of soaring through the sky, they bore through stone and soil. If the old tales can be believed, there were wyrms amongst the Fourteen Flames even before the dragons came.** The young ones are no larger than that skinny arm of yours, but they can grow to monstrous size and have no love for men.”\n\nAnd dragons heating the \"furnaces of the world\" would make sense - a common saying among the more magically knowledgable in ASOIAF is:\n\n&gt; **\"Dragons are fire made flesh, and fire is power.”**\n\nAnd of course there were dragons in Westeros too, long ago. Dragonglass is plentiful north of the Wall, and the story of Florian the Fool contains a dragon. But a dragon makes no sense. *Valyria* had thousands of dragons - and like Hardhome, the Doom occured in the space of a single day, consuming them all in an inferno so hot that \"even dragons burned.\" So now let's return to the idea of nuclear weapons. Dragons are, of course, a very heavy-handed metaphor for nuclear weapons - GRRM has said this over and over again in interviews, and the many different allusions to nuclear war in the account of the Dance of the Dragons do a fine job of illustrating the concept of mutually assured destruction. But what if the metaphor were more literal? What if dragons, fire made flesh, *could be made into fire again?*\n\nThough we have only fragments (thanks, GRRM) TWOIAF gives us a hint that something like this may have happened at Summerhall.\n\n&gt; *...the blood of the dragon gathered in one...* ***...seven eggs, to honor the seven gods,*** *though the king's own septon had warned... ...pyromancers... ...wild fire... ...flames grew out of control...towering...* ***burned so hot that...*** *...died, but for the valor of the Lord Comman...*\n\n**I believe that given sufficient stimulation, a dragon egg can be detonated instead of hatched, releasing the concentrated \"fire power\" of the egg in one catastrophic blast, on par with a nuclear bomb.** Although Aegon wasn't trying to detonate anything, I believe the involvement of the pyromancers (whose arts are tied to the existence of dragons, and who beg Cersei to be allowed to hatch any newly discovered dragon eggs) destabilized the eggs, causing a partial detonation that, while not on the scale of Hardhome, was more than sufficient to wipe out Summerhall and kill Dunk, Egg, and most of the last Valyrian family tree (And who knows, maybe the Faceless interfered with Summerhall as well).\n\nI believe that the Faceless Men tested their dragon egg \"suitcase nuke\" at Hardhome (their \"Trinity\" site) to see how much destruction exactly one egg could cause. Once they knew that, they poured all their efforts into weakening the Valyrians and stockpiling dragon eggs. And one fine day, they detonated dozens of eggs across the Valyrian peninsula, causing a chain reaction with the eggs of the fire wyrms in the Fourteen Flames, and consuming the continent in an apocolypse of sorcery, fire, and blood - the ultimate commupance. \n\n^(Oh, and if you're wondering how the Faceless could be monstrous, remember that Hardhome was a few thousand people at most - if the Faceless Men caused the Doom, they incinerated millions of innocent slaves along with their masters. And the story of the revolt is begun by the Faceless killing a slave - a precursor to a story with lots of innocent death. But that's all right. *Valar Morghulis.*)\n\nOh, and one last thought: if a certain godless man paid for a certain assassination with a certain egg, the Faceless Men may have one more nuclear bombshell to drop. And a certain godless man has sailed the Smoking Sea, and seen Valyria.\n\n**TL;DR: Hardhome was a weapons test, the Faceless Men's dry run for the Doom of Valyria. Both events are described with the same post-nuclear verbiage (as bright as the sun, raining ash, devastated wastelands, haunted and accursed, demons and ghouls and monsters) and the story of Hardhome and the fall of Valyria are both very prominent in Arya's storyline and in the House of Black and White.**", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "EXTENDED", "id": "64ypnu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 548, "report_reasons": null, "author": "hollowaydivision", "saved": false, "mod_reports": [], "name": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "approved_by": null, "over_18": false, "domain": "self.asoiaf", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2r2o9", "edited": false, "link_flair_css_class": "extended", "author_flair_css_class": "BestOf2016", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/asoiaf/comments/64ypnu/spoilers_extended_now_i_am_become_death_the_doom/", "num_reports": null, "locked": false, "stickied": false, "created": 1492038398.0, "url": "https://www.reddit.com/r/asoiaf/comments/64ypnu/spoilers_extended_now_i_am_become_death_the_doom/", "author_flair_text": "2016 Funniest Post Winner", "quarantine": false, "title": "(Spoilers Extended) Now I Am Become Death, the Doom of Valyria", "created_utc": 1492009598.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 109, "visited": false, "subreddit_type": "public", "ups": 548}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg7k1vn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "teplightyear", "parent_id": "t1_dg7fpui", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Interesting question.  I have no idea.\n\nBut I do believe the fire wyrm - empire explosion thing is an allegory for capitalism.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting question.  I have no idea.&lt;/p&gt;\n\n&lt;p&gt;But I do believe the fire wyrm - empire explosion thing is an allegory for capitalism.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7k1vn", "score_hidden": false, "stickied": false, "created": 1492119847.0, "created_utc": 1492091047.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7fpui", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "RockyRockington", "parent_id": "t1_dg6wq7b", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think that you're on to something here. \n\nLet's ask ourselves \"are there any other examples of a similar situation happening that *couldnt* have been caused by the FM?\" \n\nThe doom of Asshai is a third example of an entire civilisation being destroyed and the whole area being turned to ash and shadow to become the home of demons. \n\nThe Shadow-lands beyond Asshai are also volcanic and contain fire-wyrms. It is also the supposed origin of the magic needed to create dragons. \n\nI had never realised that the dragons being a cross of wyrms and wyverns was canon (I thought it was just theory) does the WOIAF explain the creation of ice dragons? Are there ice wyrms? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that you&amp;#39;re on to something here. &lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s ask ourselves &amp;quot;are there any other examples of a similar situation happening that &lt;em&gt;couldnt&lt;/em&gt; have been caused by the FM?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;The doom of Asshai is a third example of an entire civilisation being destroyed and the whole area being turned to ash and shadow to become the home of demons. &lt;/p&gt;\n\n&lt;p&gt;The Shadow-lands beyond Asshai are also volcanic and contain fire-wyrms. It is also the supposed origin of the magic needed to create dragons. &lt;/p&gt;\n\n&lt;p&gt;I had never realised that the dragons being a cross of wyrms and wyverns was canon (I thought it was just theory) does the WOIAF explain the creation of ice dragons? Are there ice wyrms? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7fpui", "score_hidden": false, "stickied": false, "created": 1492112933.0, "created_utc": 1492084133.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg7q6q5", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Skagosislut", "parent_id": "t1_dg7cudy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Its not true at all that dragons are cross breeds, its just one theory the world book offers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its not true at all that dragons are cross breeds, its just one theory the world book offers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7q6q5", "score_hidden": false, "stickied": false, "created": 1492126931.0, "created_utc": 1492098131.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7cudy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Merlord", "parent_id": "t1_dg6wq7b", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I completely agree. I have WOIAF, but I still haven't read the whole thing. I had no idea dragons were a hybrid species, it perfectly explains why they died out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I completely agree. I have WOIAF, but I still haven&amp;#39;t read the whole thing. I had no idea dragons were a hybrid species, it perfectly explains why they died out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7cudy", "score_hidden": false, "stickied": false, "created": 1492105300.0, "created_utc": 1492076500.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6wq7b", "gilded": 0, "archived": false, "score": 46, "report_reasons": null, "author": "teplightyear", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Neat theory but i think you're missing an important fact: the caves above Hardhome that were making the awful shrieking sound.  Those were wyrm-holes.  Hardhome wasn't a FM job and GRRM wasn't evoking nukes.  He was intentionally evoking volcanism, as these are all descriptions that make their way into the news every time there's a major volcanic eruption.  AND in this case, volcanism is the red herring designed to make it so you don't realize Hardhome was a wyrm attack.  \n\nThe Valyrians got into the 14 flames because they had learned how to breed Dragons.  You see, dragons are a hybrid species, the cross between a fire wyrm and a wyvern. It's in the WOIAF book.  That's why breeding dragons with dragons continues to weaken the line. \n\n So after fleeing the downfall of the GEOTD, some geo-dawnian refugees brought their breeding knowledge to Valyria and got into the 14 flames.  But they had to use blood magic to keep the wytms in their holes because theyre basically living pyroclasm, possessing of massive destructive force.  The Doom was for sure a FM job, but I'm certain they just mucked up the protective spells keeping the wyrms at bay.  A massive breeding colony of wyrms came forth simultaneously, destroying Valyria.\n\nI think that old story about Hardhome is GRRM's chance to show what a single firewyrm can do.  Those holes are its entrance and exit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Neat theory but i think you&amp;#39;re missing an important fact: the caves above Hardhome that were making the awful shrieking sound.  Those were wyrm-holes.  Hardhome wasn&amp;#39;t a FM job and GRRM wasn&amp;#39;t evoking nukes.  He was intentionally evoking volcanism, as these are all descriptions that make their way into the news every time there&amp;#39;s a major volcanic eruption.  AND in this case, volcanism is the red herring designed to make it so you don&amp;#39;t realize Hardhome was a wyrm attack.  &lt;/p&gt;\n\n&lt;p&gt;The Valyrians got into the 14 flames because they had learned how to breed Dragons.  You see, dragons are a hybrid species, the cross between a fire wyrm and a wyvern. It&amp;#39;s in the WOIAF book.  That&amp;#39;s why breeding dragons with dragons continues to weaken the line. &lt;/p&gt;\n\n&lt;p&gt;So after fleeing the downfall of the GEOTD, some geo-dawnian refugees brought their breeding knowledge to Valyria and got into the 14 flames.  But they had to use blood magic to keep the wytms in their holes because theyre basically living pyroclasm, possessing of massive destructive force.  The Doom was for sure a FM job, but I&amp;#39;m certain they just mucked up the protective spells keeping the wyrms at bay.  A massive breeding colony of wyrms came forth simultaneously, destroying Valyria.&lt;/p&gt;\n\n&lt;p&gt;I think that old story about Hardhome is GRRM&amp;#39;s chance to show what a single firewyrm can do.  Those holes are its entrance and exit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6wq7b", "score_hidden": false, "stickied": false, "created": 1492075178.0, "created_utc": 1492046378.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 46}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg61i35", "gilded": 0, "archived": false, "score": 74, "report_reasons": null, "author": "hollowaydivision", "parent_id": "t1_dg615n3", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "This was my thinking as well.\n\nAnother thing that I didn't include in the post is that it's very odd that stories of slavers, a very mundane terror, are mixed in among ghouls and demons and burning ghosts.\n\nWe see the slave industry fixate on the North in ADWD as an alternate source of slaves - and slavery has always been forbidden in Westeros. It's possible that slavers began to trade at Hardhome, which wouldn't be subject to any Westerosi regulations (think any historical [pirate haven](https://en.wikipedia.org/wiki/Pirate_haven)), and the Faceless wanted to stop the slave industry in its tracks before it could establish itself north of the Wall.", "edited": 1492013942.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was my thinking as well.&lt;/p&gt;\n\n&lt;p&gt;Another thing that I didn&amp;#39;t include in the post is that it&amp;#39;s very odd that stories of slavers, a very mundane terror, are mixed in among ghouls and demons and burning ghosts.&lt;/p&gt;\n\n&lt;p&gt;We see the slave industry fixate on the North in ADWD as an alternate source of slaves - and slavery has always been forbidden in Westeros. It&amp;#39;s possible that slavers began to trade at Hardhome, which wouldn&amp;#39;t be subject to any Westerosi regulations (think any historical &lt;a href=\"https://en.wikipedia.org/wiki/Pirate_haven\"&gt;pirate haven&lt;/a&gt;), and the Faceless wanted to stop the slave industry in its tracks before it could establish itself north of the Wall.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg61i35", "score_hidden": false, "stickied": false, "created": 1492040543.0, "created_utc": 1492011743.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 74}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg66d8j", "gilded": 0, "archived": false, "score": 57, "report_reasons": null, "author": "rawbface", "parent_id": "t1_dg615n3", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "You hit the nail on the head.  Think about it - why would the Free Folk suddenly form a town, after 8000+ years of living in clans and cheifdoms beyond the wall? Why in 600 BAC and only again in the main series?\n\nThey were fleeing for their lives, then as now.  Whether it was from a devastating Winter that left them all starving, or from the dead literally rising from the grave, remains to be seen.  \n\nI have at least 2 more theories as to why, but I'd put money down that the first Hardhome \"town\" was out of desperation and not prosperity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You hit the nail on the head.  Think about it - why would the Free Folk suddenly form a town, after 8000+ years of living in clans and cheifdoms beyond the wall? Why in 600 BAC and only again in the main series?&lt;/p&gt;\n\n&lt;p&gt;They were fleeing for their lives, then as now.  Whether it was from a devastating Winter that left them all starving, or from the dead literally rising from the grave, remains to be seen.  &lt;/p&gt;\n\n&lt;p&gt;I have at least 2 more theories as to why, but I&amp;#39;d put money down that the first Hardhome &amp;quot;town&amp;quot; was out of desperation and not prosperity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg66d8j", "score_hidden": false, "stickied": false, "created": 1492045675.0, "created_utc": 1492016875.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 57}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6jr7m", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "M_Tootles", "parent_id": "t1_dg615n3", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "That's the cheap and easy reading of the Faceless Men GRRM wants people to buy at this point: they're crazies, a death cult justifying all sorts of crap because of theology/ideology. But given I think /u/JoeMagician's theory about the nature of the gift and of Valyrian bondage (i.e. endlessly resurrected, broken, hollowed out zombie slaves a la Beric but worse) shows that that's not so at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the cheap and easy reading of the Faceless Men GRRM wants people to buy at this point: they&amp;#39;re crazies, a death cult justifying all sorts of crap because of theology/ideology. But given I think &lt;a href=\"/u/JoeMagician\"&gt;/u/JoeMagician&lt;/a&gt;&amp;#39;s theory about the nature of the gift and of Valyrian bondage (i.e. endlessly resurrected, broken, hollowed out zombie slaves a la Beric but worse) shows that that&amp;#39;s not so at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6jr7m", "score_hidden": false, "stickied": false, "created": 1492059414.0, "created_utc": 1492030614.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg8dmru", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lokigodofchaos", "parent_id": "t1_dg8aly4", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Not if everyone got blown up except a Faceless Man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not if everyone got blown up except a Faceless Man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8dmru", "score_hidden": false, "stickied": false, "created": 1492153329.0, "created_utc": 1492124529.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8aly4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ValeriaSimone", "parent_id": "t1_dg7hhcb", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "But  Hardhome is too close to the Wall. The news of an Other/zombie invasion would have got south, even if it was only as a rumor. I mean, we have a witness since book one, from a very isolated incident, wouldn't a larger confrontation leave more traces? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But  Hardhome is too close to the Wall. The news of an Other/zombie invasion would have got south, even if it was only as a rumor. I mean, we have a witness since book one, from a very isolated incident, wouldn&amp;#39;t a larger confrontation leave more traces? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8aly4", "score_hidden": false, "stickied": false, "created": 1492149364.0, "created_utc": 1492120564.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg8lu9e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Meehl", "parent_id": "t1_dg7hhcb", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "the big problem is lack of context. that would be a random thing. there's so much long game in his plot. so much symbolism. so much parallel between pov characters and with historical figures. I'm not sure how this apparently major event fits if it's a faceless man bomb to kill others.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the big problem is lack of context. that would be a random thing. there&amp;#39;s so much long game in his plot. so much symbolism. so much parallel between pov characters and with historical figures. I&amp;#39;m not sure how this apparently major event fits if it&amp;#39;s a faceless man bomb to kill others.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8lu9e", "score_hidden": false, "stickied": false, "created": 1492164551.0, "created_utc": 1492135751.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7hhcb", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "lokigodofchaos", "parent_id": "t1_dg78ju9", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Pure speculation, but what if the detonation of Hardhome wasn't to kill a bunch of wildlings, but to take out one of the Others and it's army?\n\nFaceless men lands in Hardhome intending to test a detonation in the largely  abandoned north, far away from where  anyone from Valeria could see. While they are preparing for the journey town gets attacked by wights. Wights are an affront to the god of death, so change of plans and they blow up the settlement. Only one needed to survive and say \"Yeah it worked.\"\n\n\nActually  that would make a pretty awesome short story or RPG one shot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pure speculation, but what if the detonation of Hardhome wasn&amp;#39;t to kill a bunch of wildlings, but to take out one of the Others and it&amp;#39;s army?&lt;/p&gt;\n\n&lt;p&gt;Faceless men lands in Hardhome intending to test a detonation in the largely  abandoned north, far away from where  anyone from Valeria could see. While they are preparing for the journey town gets attacked by wights. Wights are an affront to the god of death, so change of plans and they blow up the settlement. Only one needed to survive and say &amp;quot;Yeah it worked.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Actually  that would make a pretty awesome short story or RPG one shot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7hhcb", "score_hidden": false, "stickied": false, "created": 1492116145.0, "created_utc": 1492087345.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg78ju9", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Meehl", "parent_id": "t1_dg615n3", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "jaqan doesn't seem to support indiscriminate killing, and he's what we have to represent the whole faceless man religion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;jaqan doesn&amp;#39;t seem to support indiscriminate killing, and he&amp;#39;s what we have to represent the whole faceless man religion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg78ju9", "score_hidden": false, "stickied": false, "created": 1492093086.0, "created_utc": 1492064286.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6kbtj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "hummus5989", "parent_id": "t1_dg615n3", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Seems unlikely. They tend to be pretty anti-collateral damage (see the Kindly Man telling Arya not to kill the merchant's guards in AFFC) on the grounds that death is the will of the Many-Faced God, not something to be given whenever convenient.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seems unlikely. They tend to be pretty anti-collateral damage (see the Kindly Man telling Arya not to kill the merchant&amp;#39;s guards in AFFC) on the grounds that death is the will of the Many-Faced God, not something to be given whenever convenient.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6kbtj", "score_hidden": false, "stickied": false, "created": 1492060060.0, "created_utc": 1492031260.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg8lzlc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NearSightedGiraffe", "parent_id": "t1_dg7dz9v", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "If I understand the theory correctly, the argument is that the Hardhomers were likely in a miserable existence- willing don't suddenly make towns except out of desperation. Perhaps the FM offered those who didn't want the gift a chance to flee to Bravos, or as in Valeria, it was decided that the lives were all desperate for an out anyway and thus were deserving of the gift.\n\nI am not completely on board, but I think that is the direction OP is arguing ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I understand the theory correctly, the argument is that the Hardhomers were likely in a miserable existence- willing don&amp;#39;t suddenly make towns except out of desperation. Perhaps the FM offered those who didn&amp;#39;t want the gift a chance to flee to Bravos, or as in Valeria, it was decided that the lives were all desperate for an out anyway and thus were deserving of the gift.&lt;/p&gt;\n\n&lt;p&gt;I am not completely on board, but I think that is the direction OP is arguing &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8lzlc", "score_hidden": false, "stickied": false, "created": 1492164760.0, "created_utc": 1492135960.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7dz9v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "onetimeuser99", "parent_id": "t1_dg615n3", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "But that doesnt really fit in with the FM's attitude towards the \"gift\", as we see it the house of Black and White in Braavos. The gift is given to those that directly ask for it, or when a 3rd party \"buys\" the gift, usually at a high price.\n\nWe never see the FM award the gift to anyone just to further their own agenda. Actually, the kindly man clearly states that this is not their call.\n\nFor Valyria, there certainly were sufficient slaves around that would have asked the FM to nuke the entire freehold, but why would anyone ask the FM to kill the Hardhomers?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But that doesnt really fit in with the FM&amp;#39;s attitude towards the &amp;quot;gift&amp;quot;, as we see it the house of Black and White in Braavos. The gift is given to those that directly ask for it, or when a 3rd party &amp;quot;buys&amp;quot; the gift, usually at a high price.&lt;/p&gt;\n\n&lt;p&gt;We never see the FM award the gift to anyone just to further their own agenda. Actually, the kindly man clearly states that this is not their call.&lt;/p&gt;\n\n&lt;p&gt;For Valyria, there certainly were sufficient slaves around that would have asked the FM to nuke the entire freehold, but why would anyone ask the FM to kill the Hardhomers?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7dz9v", "score_hidden": false, "stickied": false, "created": 1492108680.0, "created_utc": 1492079880.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6fnm6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "M_Tootles", "parent_id": "t1_dg6e9ys", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "see my reply to the post https://www.reddit.com/r/asoiaf/comments/64ypnu/spoilers_extended_now_i_am_become_death_the_doom/dg6buls/\n\nI completely agree, but think holloway's within sniffing distance of the truth.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;see my reply to the post &lt;a href=\"https://www.reddit.com/r/asoiaf/comments/64ypnu/spoilers_extended_now_i_am_become_death_the_doom/dg6buls/\"&gt;https://www.reddit.com/r/asoiaf/comments/64ypnu/spoilers_extended_now_i_am_become_death_the_doom/dg6buls/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I completely agree, but think holloway&amp;#39;s within sniffing distance of the truth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6fnm6", "score_hidden": false, "stickied": false, "created": 1492055163.0, "created_utc": 1492026363.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6e9ys", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "JoeMagician", "parent_id": "t1_dg64o48", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I mean you're proposing they were a small scale operation of the big machine. Easy to kick over with a handful of kills if you wanted to. Mayor, merchants who sell them, heads of the crews that catch slaves. For such a small place that's an easy supply chain to disrupt. They try to avoid innocent death when they can generally, it just feels out of character to detonate a town that isn't central to the slave trade. Like if they did this to lys or slavers Bay I'd understand that. \n\nNot genocide right, but total destruction more accurately? If you find another example of the faceless men doing something similar in addition to Valyria I'd withdraw that criticism as my misunderstanding the faceless men. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean you&amp;#39;re proposing they were a small scale operation of the big machine. Easy to kick over with a handful of kills if you wanted to. Mayor, merchants who sell them, heads of the crews that catch slaves. For such a small place that&amp;#39;s an easy supply chain to disrupt. They try to avoid innocent death when they can generally, it just feels out of character to detonate a town that isn&amp;#39;t central to the slave trade. Like if they did this to lys or slavers Bay I&amp;#39;d understand that. &lt;/p&gt;\n\n&lt;p&gt;Not genocide right, but total destruction more accurately? If you find another example of the faceless men doing something similar in addition to Valyria I&amp;#39;d withdraw that criticism as my misunderstanding the faceless men. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6e9ys", "score_hidden": false, "stickied": false, "created": 1492053746.0, "created_utc": 1492024946.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg64o48", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "hollowaydivision", "parent_id": "t1_dg644u6", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; If hardhome was a slave port in the making, the faceless men could just kill those in charge and not have to kill everyone else at the same time.\n\nWell, \"those in charge\" would be the slavers in Volantis and Astapor and Meereen and the three daughters and Pentos and whatnot. The slave industry. We see how they dial in on the wildlings as a slave source in the modern day. The wildling mayor of the day doesn't matter much, but the total destruction of Hardhome cut off any possibility of that happening, and likely throttled trade between the lands beyond the Wall and the Free Cities for years - though it has resumed to some degree by the modern day. Again, I'm not too sure of this, but it's one idea.\n\n&gt; Maybe if there was a third data point that when faced with slave cultures the faceless men are willing to commit genocide?\n\nWell, I think it can be understood that the Faceless Men's mission was to stop the Valyrians at all costs, while making sure to avoid any possibility of detection by the \"sorcerers of the Freehold\", who could see across the world with glass candles. I think the Valyrians would pay *much* more attention to Essos than North of the Wall - no one really gave a fuck about Westeros until the Targaryens. And again, it's not genocide, it's just killing a few thousand people. *Valar Morghulis* - if you wanna make an omlette you gotta break some eggs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If hardhome was a slave port in the making, the faceless men could just kill those in charge and not have to kill everyone else at the same time.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, &amp;quot;those in charge&amp;quot; would be the slavers in Volantis and Astapor and Meereen and the three daughters and Pentos and whatnot. The slave industry. We see how they dial in on the wildlings as a slave source in the modern day. The wildling mayor of the day doesn&amp;#39;t matter much, but the total destruction of Hardhome cut off any possibility of that happening, and likely throttled trade between the lands beyond the Wall and the Free Cities for years - though it has resumed to some degree by the modern day. Again, I&amp;#39;m not too sure of this, but it&amp;#39;s one idea.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Maybe if there was a third data point that when faced with slave cultures the faceless men are willing to commit genocide?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, I think it can be understood that the Faceless Men&amp;#39;s mission was to stop the Valyrians at all costs, while making sure to avoid any possibility of detection by the &amp;quot;sorcerers of the Freehold&amp;quot;, who could see across the world with glass candles. I think the Valyrians would pay &lt;em&gt;much&lt;/em&gt; more attention to Essos than North of the Wall - no one really gave a fuck about Westeros until the Targaryens. And again, it&amp;#39;s not genocide, it&amp;#39;s just killing a few thousand people. &lt;em&gt;Valar Morghulis&lt;/em&gt; - if you wanna make an omlette you gotta break some eggs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg64o48", "score_hidden": false, "stickied": false, "created": 1492043930.0, "created_utc": 1492015130.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg644u6", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "JoeMagician", "parent_id": "t1_dg633ad", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Not belabor the point though, they don't need to test it on people. Once you see the explosion's strength you know no one is surviving. There's a lot of sparsely populated areas all around Braavos where they could stage this and the Valyrians would never find out. \n\nThe stories of the slavers seems to point to slavers exploiting the disaster not being there already. In the aftermath they swoop in and take everyone they can with no one to stop them, but who really knows. The point you're making is that the Valyrians are so powerful and evil that the innocents dying is an acceptable cost if it means the end of the civilization. If hardhome was a slave port in the making, the faceless men could just kill those in charge and not have to kill everyone else at the same time. Maybe if there was a third data point that when faced with slave cultures the faceless men are willing to commit genocide? \n\nI honestly think summerhall is just wildfire that they lost control of. There doesn't seem to be any kind of explosion or evidence of a crater there, just an enormous fire. It's in the name, wildfire. Staging a dragon hatching ritual indoors with wildfire is just not a safe idea. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not belabor the point though, they don&amp;#39;t need to test it on people. Once you see the explosion&amp;#39;s strength you know no one is surviving. There&amp;#39;s a lot of sparsely populated areas all around Braavos where they could stage this and the Valyrians would never find out. &lt;/p&gt;\n\n&lt;p&gt;The stories of the slavers seems to point to slavers exploiting the disaster not being there already. In the aftermath they swoop in and take everyone they can with no one to stop them, but who really knows. The point you&amp;#39;re making is that the Valyrians are so powerful and evil that the innocents dying is an acceptable cost if it means the end of the civilization. If hardhome was a slave port in the making, the faceless men could just kill those in charge and not have to kill everyone else at the same time. Maybe if there was a third data point that when faced with slave cultures the faceless men are willing to commit genocide? &lt;/p&gt;\n\n&lt;p&gt;I honestly think summerhall is just wildfire that they lost control of. There doesn&amp;#39;t seem to be any kind of explosion or evidence of a crater there, just an enormous fire. It&amp;#39;s in the name, wildfire. Staging a dragon hatching ritual indoors with wildfire is just not a safe idea. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg644u6", "score_hidden": false, "stickied": false, "created": 1492043367.0, "created_utc": 1492014567.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg633ad", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "hollowaydivision", "parent_id": "t1_dg6261z", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think one of the important things was Hardhome's remoteness. Testing it in a populated area, especially one that was of interest to the Valyrians, might have tipped their hand. By targeting Hardhome, they get a very remote, desolate location that is of no interest to the Valyrians (or anyone else for that matter) and even if the tales do survive, they will just be written off as \"grumpkins and snarks\" like everything else north of the Wall.\n\nAlso, in re: killing innocent people - one thing I said in the post is the Doom of Valyria had *massive* innocent casualties, far more than the measly couple thousand at Hardhome. And one thing I mentioned above is the stories of \"slavers\" at Hardhome may indicate that as Hardhome began to trade with the Free Cities, the slave industry was gaining a foothold in Westeros - and the old gods, the new gods, and the Braavosi all consider slavery an abomination.\n\n&gt; As well we know the Targaryens stored dragon eggs on Dragonstone, and the place wasn't exploding despite active volcanic activity. Perhaps they knew enough to protect them though from dangerous levels of heat?\n\nI think it probably takes a lot of work, or some truly monumental fuckup, to turn an egg volatile. It may have to do with the requisite conditions to hatch the egg not being present, but \"irritating\" the egg with spells anyway. That seems to be what happened at Summerhall.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think one of the important things was Hardhome&amp;#39;s remoteness. Testing it in a populated area, especially one that was of interest to the Valyrians, might have tipped their hand. By targeting Hardhome, they get a very remote, desolate location that is of no interest to the Valyrians (or anyone else for that matter) and even if the tales do survive, they will just be written off as &amp;quot;grumpkins and snarks&amp;quot; like everything else north of the Wall.&lt;/p&gt;\n\n&lt;p&gt;Also, in re: killing innocent people - one thing I said in the post is the Doom of Valyria had &lt;em&gt;massive&lt;/em&gt; innocent casualties, far more than the measly couple thousand at Hardhome. And one thing I mentioned above is the stories of &amp;quot;slavers&amp;quot; at Hardhome may indicate that as Hardhome began to trade with the Free Cities, the slave industry was gaining a foothold in Westeros - and the old gods, the new gods, and the Braavosi all consider slavery an abomination.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As well we know the Targaryens stored dragon eggs on Dragonstone, and the place wasn&amp;#39;t exploding despite active volcanic activity. Perhaps they knew enough to protect them though from dangerous levels of heat?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think it probably takes a lot of work, or some truly monumental fuckup, to turn an egg volatile. It may have to do with the requisite conditions to hatch the egg not being present, but &amp;quot;irritating&amp;quot; the egg with spells anyway. That seems to be what happened at Summerhall.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg633ad", "score_hidden": false, "stickied": false, "created": 1492042267.0, "created_utc": 1492013467.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6261z", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "JoeMagician", "parent_id": "t1_dg615n3", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I suppose but there's better targets for that. A Valyrian colony like Lys would have more people and Valyrians, a double whammy. If a volcano is necessary to ignite it for some reason, I think hardhome was dormant? And if the theory is correct and wildfire is hot enough then they don't need a volcano either. It seems like there's something missing on why Hardhome would've been chosen. \n\nAs well we know the Targaryens stored dragon eggs on Dragonstone, and the place wasn't exploding despite active volcanic activity. Perhaps they knew enough to protect them though from dangerous levels of heat? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I suppose but there&amp;#39;s better targets for that. A Valyrian colony like Lys would have more people and Valyrians, a double whammy. If a volcano is necessary to ignite it for some reason, I think hardhome was dormant? And if the theory is correct and wildfire is hot enough then they don&amp;#39;t need a volcano either. It seems like there&amp;#39;s something missing on why Hardhome would&amp;#39;ve been chosen. &lt;/p&gt;\n\n&lt;p&gt;As well we know the Targaryens stored dragon eggs on Dragonstone, and the place wasn&amp;#39;t exploding despite active volcanic activity. Perhaps they knew enough to protect them though from dangerous levels of heat? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6261z", "score_hidden": false, "stickied": false, "created": 1492041272.0, "created_utc": 1492012472.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg615n3", "gilded": 0, "archived": false, "score": 114, "report_reasons": null, "author": "BryndenBFish", "parent_id": "t1_dg60ozv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Just thinking out-loud, because Faceless Men theorizing isn't my thing, but given that the order is essentially a death cult that believes in death as a gift...\n\n&gt; \"Death is not the worst thing,\" the kindly man replied. \"It is His gift to us, an end to want and pain. On the day that we are born the Many-Faced God sends each of us a dark angel to walk through life beside us. When our sins and our sufferings grow too great to be borne, the angel takes us by the hand to lead us to the nightlands, where the stars burn ever bright. Those who come to drink from the black cup are looking for their angels. If they are afraid, the candles soothe them.\" (AFFC, Arya II)\n\n... maybe in their twisted ideology, the FM thought the bringing the \"gift\" to thousands of Wildlings living squalid lives was a good and merciful thing to do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just thinking out-loud, because Faceless Men theorizing isn&amp;#39;t my thing, but given that the order is essentially a death cult that believes in death as a gift...&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Death is not the worst thing,&amp;quot; the kindly man replied. &amp;quot;It is His gift to us, an end to want and pain. On the day that we are born the Many-Faced God sends each of us a dark angel to walk through life beside us. When our sins and our sufferings grow too great to be borne, the angel takes us by the hand to lead us to the nightlands, where the stars burn ever bright. Those who come to drink from the black cup are looking for their angels. If they are afraid, the candles soothe them.&amp;quot; (AFFC, Arya II)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;... maybe in their twisted ideology, the FM thought the bringing the &amp;quot;gift&amp;quot; to thousands of Wildlings living squalid lives was a good and merciful thing to do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg615n3", "score_hidden": false, "stickied": false, "created": 1492040161.0, "created_utc": 1492011361.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 114}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg7exuc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mrmrwinter", "parent_id": "t1_dg7014w", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "What could the price have been though?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What could the price have been though?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7exuc", "score_hidden": false, "stickied": false, "created": 1492111197.0, "created_utc": 1492082397.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7014w", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "NSNick", "parent_id": "t1_dg60ozv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;Why would the faceless men destroy an entire town when they could test it anywhere?\n\nThe obvious answer is that someone contracted them to. Maybe an overzealous Lord Commander of the Night's Watch?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Why would the faceless men destroy an entire town when they could test it anywhere?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The obvious answer is that someone contracted them to. Maybe an overzealous Lord Commander of the Night&amp;#39;s Watch?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7014w", "score_hidden": false, "stickied": false, "created": 1492079282.0, "created_utc": 1492050482.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6hcnm", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "House_Badger", "parent_id": "t1_dg60ozv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Speaking of nuclear weapons, someone wrote a theory that it was destroyed by the Valyrians with dragons.  \nThey hypothesized that the Valyrians thought these were the escaped slaves that formed Bravos. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Speaking of nuclear weapons, someone wrote a theory that it was destroyed by the Valyrians with dragons.&lt;br/&gt;\nThey hypothesized that the Valyrians thought these were the escaped slaves that formed Bravos. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6hcnm", "score_hidden": false, "stickied": false, "created": 1492056899.0, "created_utc": 1492028099.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg78irp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Meehl", "parent_id": "t1_dg60ozv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Perhaps someone didn't want hardhome growing. Did it compete economically or politically with westeros for trade, for slavers, etc? Might the Lord commander of the nights watch or starks need to pay a dragon egg to destroy a growing  threat? hmmmm", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Perhaps someone didn&amp;#39;t want hardhome growing. Did it compete economically or politically with westeros for trade, for slavers, etc? Might the Lord commander of the nights watch or starks need to pay a dragon egg to destroy a growing  threat? hmmmm&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg78irp", "score_hidden": false, "stickied": false, "created": 1492093016.0, "created_utc": 1492064216.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg60ozv", "gilded": 0, "archived": false, "score": 101, "report_reasons": null, "author": "JoeMagician", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "The government tested nuclear\nWeapons in unpopulated areas. Why would the faceless men destroy an entire town when they could test it anywhere? And particularly hardhome. It's a lot of innocent people to kill pointlessly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The government tested nuclear\nWeapons in unpopulated areas. Why would the faceless men destroy an entire town when they could test it anywhere? And particularly hardhome. It&amp;#39;s a lot of innocent people to kill pointlessly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg60ozv", "score_hidden": false, "stickied": false, "created": 1492039654.0, "created_utc": 1492010854.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 101}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg86hng", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "M_Tootles", "parent_id": "t1_dg6yctr", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "IMO all magic is the same at root. Check out the gemstone essay. I think it's all got to do with collective consciousness and/or elevated consciousness, but that there's a genetic component that allows access to this shit.\n\nThat said, the \"sabotage their nuclear stockpile\" thing feels pretty good.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;IMO all magic is the same at root. Check out the gemstone essay. I think it&amp;#39;s all got to do with collective consciousness and/or elevated consciousness, but that there&amp;#39;s a genetic component that allows access to this shit.&lt;/p&gt;\n\n&lt;p&gt;That said, the &amp;quot;sabotage their nuclear stockpile&amp;quot; thing feels pretty good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg86hng", "score_hidden": false, "stickied": false, "created": 1492144447.0, "created_utc": 1492115647.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6yctr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hellknightx", "parent_id": "t1_dg6jgiu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I mean, obviously what the FM do is magical and they have aptitude for that, but my theory is that their magic is derived from a powerful entity (the Faceless God, so to speak). Therefore, their magic only extends to certain domains. In this case, I think it would be limited to illusion and subterfuge magic.\n\nCreating the equivalent of a magical dragon-based weapon of mass destruction falls far outside that magical domain, and squarely within the bounds of Valyrian magic. That's my point, essentially. I don't think there's any way that the FM could have devised a weapon capable of wiping out a civilization in an instant.\n\nI'm sure they'd be glad to get their hands on it, but architecting a weapon of that magnitude is far-fetched. I doubt they even fully understood how it worked, or there would probably be more uses of it post-Valyria. No, I think that sort of magical technology was created by and ironically used on Valyria.\n\nMost likely, Valyria built up a \"nuclear stockpile\" over 200 years or so, and some FM set it all off at once.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean, obviously what the FM do is magical and they have aptitude for that, but my theory is that their magic is derived from a powerful entity (the Faceless God, so to speak). Therefore, their magic only extends to certain domains. In this case, I think it would be limited to illusion and subterfuge magic.&lt;/p&gt;\n\n&lt;p&gt;Creating the equivalent of a magical dragon-based weapon of mass destruction falls far outside that magical domain, and squarely within the bounds of Valyrian magic. That&amp;#39;s my point, essentially. I don&amp;#39;t think there&amp;#39;s any way that the FM could have devised a weapon capable of wiping out a civilization in an instant.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure they&amp;#39;d be glad to get their hands on it, but architecting a weapon of that magnitude is far-fetched. I doubt they even fully understood how it worked, or there would probably be more uses of it post-Valyria. No, I think that sort of magical technology was created by and ironically used on Valyria.&lt;/p&gt;\n\n&lt;p&gt;Most likely, Valyria built up a &amp;quot;nuclear stockpile&amp;quot; over 200 years or so, and some FM set it all off at once.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6yctr", "score_hidden": false, "stickied": false, "created": 1492077194.0, "created_utc": 1492048394.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dgbsff0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IllyrioMoParties", "parent_id": "t1_dg87z41", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Missing an opportunity then, rather than missing the point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Missing an opportunity then, rather than missing the point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgbsff0", "score_hidden": false, "stickied": false, "created": 1492353768.0, "created_utc": 1492324968.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87z41", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "M_Tootles", "parent_id": "t1_dg7w9vn", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Two things. First, how does the US talk about Vietnam today? It's a \"loss\". It was NOT even talked about for a long time. This despite the fact that leftists view it as a strategic victory for the US, inasmuch as the \"thou shalt not set off on an independent course\" lesson was patent. But the nature of that victory—setting back the development of a country decades, millions dead/wounded/displaced/etc.—isn't something that looks good. Same would apply to \"the Freehold\".\n\nBut I thnk that's taking the analogy too far. \"Just as the US wanted...\" wasn't intended to mean that the Valyrians had identical motives to the US, i.e. making an example out of Hardhome. The Valyrians were more like \"fuck you we're killing you because we can and you hate slavery and we wanna test this shit\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Two things. First, how does the US talk about Vietnam today? It&amp;#39;s a &amp;quot;loss&amp;quot;. It was NOT even talked about for a long time. This despite the fact that leftists view it as a strategic victory for the US, inasmuch as the &amp;quot;thou shalt not set off on an independent course&amp;quot; lesson was patent. But the nature of that victory—setting back the development of a country decades, millions dead/wounded/displaced/etc.—isn&amp;#39;t something that looks good. Same would apply to &amp;quot;the Freehold&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;But I thnk that&amp;#39;s taking the analogy too far. &amp;quot;Just as the US wanted...&amp;quot; wasn&amp;#39;t intended to mean that the Valyrians had identical motives to the US, i.e. making an example out of Hardhome. The Valyrians were more like &amp;quot;fuck you we&amp;#39;re killing you because we can and you hate slavery and we wanna test this shit&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg87z41", "score_hidden": false, "stickied": false, "created": 1492146137.0, "created_utc": 1492117337.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7w9vn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gubbanubnubdoorahka", "parent_id": "t1_dg6jgiu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I really like this idea (do the post), but if it's true, the Valyrians were kinda missing point if they didn't take credit for it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really like this idea (do the post), but if it&amp;#39;s true, the Valyrians were kinda missing point if they didn&amp;#39;t take credit for it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7w9vn", "score_hidden": false, "stickied": false, "created": 1492133411.0, "created_utc": 1492104611.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jgiu", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "M_Tootles", "parent_id": "t1_dg6i13q", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Thanks. I do too, obvs. Might turn it into a post. But there are great ideas in the OP.\n\nWell, it would be more like if the Americans had nuke-\"tested\" Grenada in 83 instead of \"just\" invading, or nuked Vietnam in the 60s/70s, given that the Valyrians seemingly had an interest in wiping out Freefolk Civilization-building, just as the US wanted to prevent any examples of independent development opposed sui generis to capitalist imperialism.\n\nFWIW I think the FM have plenty of magical aptitude, I think. Magical aptitude is basically the same thing as skinchanging aptitude, and they recruit for that. (See https://asongoficeandtootles.wordpress.com/2016/03/02/how-the-faceless-men-do-their-faceless-thing/ and https://asongoficeandtootles.wordpress.com/2016/02/29/the-gemstone-emperors-of-the-dawn-a-complete-taxonomy/)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. I do too, obvs. Might turn it into a post. But there are great ideas in the OP.&lt;/p&gt;\n\n&lt;p&gt;Well, it would be more like if the Americans had nuke-&amp;quot;tested&amp;quot; Grenada in 83 instead of &amp;quot;just&amp;quot; invading, or nuked Vietnam in the 60s/70s, given that the Valyrians seemingly had an interest in wiping out Freefolk Civilization-building, just as the US wanted to prevent any examples of independent development opposed sui generis to capitalist imperialism.&lt;/p&gt;\n\n&lt;p&gt;FWIW I think the FM have plenty of magical aptitude, I think. Magical aptitude is basically the same thing as skinchanging aptitude, and they recruit for that. (See &lt;a href=\"https://asongoficeandtootles.wordpress.com/2016/03/02/how-the-faceless-men-do-their-faceless-thing/\"&gt;https://asongoficeandtootles.wordpress.com/2016/03/02/how-the-faceless-men-do-their-faceless-thing/&lt;/a&gt; and &lt;a href=\"https://asongoficeandtootles.wordpress.com/2016/02/29/the-gemstone-emperors-of-the-dawn-a-complete-taxonomy/\"&gt;https://asongoficeandtootles.wordpress.com/2016/02/29/the-gemstone-emperors-of-the-dawn-a-complete-taxonomy/&lt;/a&gt;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6jgiu", "score_hidden": false, "stickied": false, "created": 1492059090.0, "created_utc": 1492030290.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6xu2w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Hellknightx", "parent_id": "t1_dg6me2b", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think that Hardhome would have been the first practical usage, and then for the next 200 years, Valyria would have been \"stockpiling nukes\" so to speak. Faceless Men merely would have had to infiltrate their arsenal and set them all off at once, sort of like Cersei setting off Aerys' caches of wildfire.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that Hardhome would have been the first practical usage, and then for the next 200 years, Valyria would have been &amp;quot;stockpiling nukes&amp;quot; so to speak. Faceless Men merely would have had to infiltrate their arsenal and set them all off at once, sort of like Cersei setting off Aerys&amp;#39; caches of wildfire.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6xu2w", "score_hidden": false, "stickied": false, "created": 1492076548.0, "created_utc": 1492047748.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6me2b", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "jahmakinmecrazy", "parent_id": "t1_dg6i13q", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I agree. The \"nuke \" option has obviously been how we see the fall of valyria.  I thibk it is likely their technology, as in asoiaf valyria is the Atlantis culture. The hardhome explosion could have even been an accident, as the ,\"technology\" wasn't seen again until the doom. However, are the areas in the wastes that Dany see possible test/drop sights? They aren't typically mentioned in the hardhome theories, but I don't think they should be overlooked. \n Stupid grrm building such an immense world. Stupid,  awesome grrm.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree. The &amp;quot;nuke &amp;quot; option has obviously been how we see the fall of valyria.  I thibk it is likely their technology, as in asoiaf valyria is the Atlantis culture. The hardhome explosion could have even been an accident, as the ,&amp;quot;technology&amp;quot; wasn&amp;#39;t seen again until the doom. However, are the areas in the wastes that Dany see possible test/drop sights? They aren&amp;#39;t typically mentioned in the hardhome theories, but I don&amp;#39;t think they should be overlooked. \n Stupid grrm building such an immense world. Stupid,  awesome grrm.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6me2b", "score_hidden": false, "stickied": false, "created": 1492062482.0, "created_utc": 1492033682.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dgbsdjo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IllyrioMoParties", "parent_id": "t1_dg6i13q", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; Faceless Men would have been like the Rosenbergs, who discovered the weapon of mass destruction that Valyria had created and leaked the secrets back to Braavos.\n\nI don't doubt that a commie pinko hippie like GRRM thinks otherwise, but the Rosenberg analogy would be better if the Faceless Men were providing intelligence to the Valyrians.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Faceless Men would have been like the Rosenbergs, who discovered the weapon of mass destruction that Valyria had created and leaked the secrets back to Braavos.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t doubt that a commie pinko hippie like GRRM thinks otherwise, but the Rosenberg analogy would be better if the Faceless Men were providing intelligence to the Valyrians.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgbsdjo", "score_hidden": false, "stickied": false, "created": 1492353639.0, "created_utc": 1492324839.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6i13q", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "Hellknightx", "parent_id": "t1_dg6buls", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think your version fits better. Valyria were the ones \"playing with fire\" and fashioning themselves into Icarian gods flying too close to the sun.\n\nIt only makes sense that *they* were the ones that discovered they could convert matter into energy, a nuclear blast, turning dragons into raw fire. Hardhome was the antithesis to Valyria, and very third-world by comparison. If the nuclear weapons testing analogy holds true, it would be like America testing its nuclear weapons in Bikini Atoll, except Valyria didn't bother relocating the native people first.\n\nFaceless Men would have been like the Rosenbergs, who discovered the weapon of mass destruction that Valyria had created and leaked the secrets back to Braavos. Better yet, they could have infiltrated Valyria and simply sabotaged the program - after all, infiltration is their specialty.\n\nI find it highly unlikely that the Faceless Men would have the means or magical aptitude to create a magical nuke. That absolutely would have been Valyria's magnum opus. Faceless Men, however, would definitely have the motivation to turn the weapon back on its creators - as it would be further infringing on the realm of the Gods. \n\nHaving the power to wipe out an entire civilization overnight probably offended the god of death. So it's only fitting that he would use their own weapon against them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think your version fits better. Valyria were the ones &amp;quot;playing with fire&amp;quot; and fashioning themselves into Icarian gods flying too close to the sun.&lt;/p&gt;\n\n&lt;p&gt;It only makes sense that &lt;em&gt;they&lt;/em&gt; were the ones that discovered they could convert matter into energy, a nuclear blast, turning dragons into raw fire. Hardhome was the antithesis to Valyria, and very third-world by comparison. If the nuclear weapons testing analogy holds true, it would be like America testing its nuclear weapons in Bikini Atoll, except Valyria didn&amp;#39;t bother relocating the native people first.&lt;/p&gt;\n\n&lt;p&gt;Faceless Men would have been like the Rosenbergs, who discovered the weapon of mass destruction that Valyria had created and leaked the secrets back to Braavos. Better yet, they could have infiltrated Valyria and simply sabotaged the program - after all, infiltration is their specialty.&lt;/p&gt;\n\n&lt;p&gt;I find it highly unlikely that the Faceless Men would have the means or magical aptitude to create a magical nuke. That absolutely would have been Valyria&amp;#39;s magnum opus. Faceless Men, however, would definitely have the motivation to turn the weapon back on its creators - as it would be further infringing on the realm of the Gods. &lt;/p&gt;\n\n&lt;p&gt;Having the power to wipe out an entire civilization overnight probably offended the god of death. So it&amp;#39;s only fitting that he would use their own weapon against them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6i13q", "score_hidden": false, "stickied": false, "created": 1492057587.0, "created_utc": 1492028787.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg81e3i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "M_Tootles", "parent_id": "t1_dg6vjph", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Spies, for sure, but the ability to essentially commune with the dead is huge. And to commune with the living, esp. if they're willing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Spies, for sure, but the ability to essentially commune with the dead is huge. And to commune with the living, esp. if they&amp;#39;re willing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg81e3i", "score_hidden": false, "stickied": false, "created": 1492138862.0, "created_utc": 1492110062.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6vjph", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rayraymaybeso", "parent_id": "t1_dg6buls", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I like this notion... the idea that the Freehold was learning how to weapon use eggs and tested them.. the FM probably had spies amongst the Drangonlords and thus learned the same thing about the eggs and took this event as the inspiration for what they would use as their weapon against the Valyrians...  On a side note- maybe this is why they accepted a dragon egg as payment from Euron to kill Balon.. it always bothered me because they use payment that is not necessarily most valuable in currency but most valuable to you as in you have to give up something important to you or go full broke paying for a faceless man... they accept the egg tho instead because they know of it's power as a bomb.... maybe I'm crazy and wrong but just speculating ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like this notion... the idea that the Freehold was learning how to weapon use eggs and tested them.. the FM probably had spies amongst the Drangonlords and thus learned the same thing about the eggs and took this event as the inspiration for what they would use as their weapon against the Valyrians...  On a side note- maybe this is why they accepted a dragon egg as payment from Euron to kill Balon.. it always bothered me because they use payment that is not necessarily most valuable in currency but most valuable to you as in you have to give up something important to you or go full broke paying for a faceless man... they accept the egg tho instead because they know of it&amp;#39;s power as a bomb.... maybe I&amp;#39;m crazy and wrong but just speculating &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6vjph", "score_hidden": false, "stickied": false, "created": 1492073718.0, "created_utc": 1492044918.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg87csb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "M_Tootles", "parent_id": "t1_dg78xbt", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I did consider this, but when I went and read the passages it just doesn't feel like where GRRM's going:\n&gt;Hardhome sits on a sheltered bay and has a natural harbor deep enough for the biggest ships afloat. Wood and stone are plentiful near there. The waters teem with fish, and there are colonies of seals and sea cows close at hand. (DwD J VIII)\n***\n&gt;Hardhome had been halfway toward becoming a town, the only true town north of the Wall (ibid.)\n\nThat just sounds \"nice\". If it were a slaver town, why would that become a rallying point?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did consider this, but when I went and read the passages it just doesn&amp;#39;t feel like where GRRM&amp;#39;s going:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Hardhome sits on a sheltered bay and has a natural harbor deep enough for the biggest ships afloat. Wood and stone are plentiful near there. The waters teem with fish, and there are colonies of seals and sea cows close at hand. (DwD J VIII)&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Hardhome had been halfway toward becoming a town, the only true town north of the Wall (ibid.)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That just sounds &amp;quot;nice&amp;quot;. If it were a slaver town, why would that become a rallying point?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg87csb", "score_hidden": false, "stickied": false, "created": 1492145436.0, "created_utc": 1492116636.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg78xbt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Pro_Quote_Maker", "parent_id": "t1_dg6buls", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "What if Hardhome was a slavers town set up to export wildlings?  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What if Hardhome was a slavers town set up to export wildlings?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg78xbt", "score_hidden": false, "stickied": false, "created": 1492094006.0, "created_utc": 1492065206.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg7c88m", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "lordbatholith", "parent_id": "t1_dg6vzcs", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I read a few years back that in private correspondence among the Japanese brass what really freaked them out more than the atom bombs was Stalin's invasion of Manchuria.\n\nI'd be more afraid of Stalin than nukes, too.\n\nBut I certainly ain't an expert on the subject.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read a few years back that in private correspondence among the Japanese brass what really freaked them out more than the atom bombs was Stalin&amp;#39;s invasion of Manchuria.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d be more afraid of Stalin than nukes, too.&lt;/p&gt;\n\n&lt;p&gt;But I certainly ain&amp;#39;t an expert on the subject.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7c88m", "score_hidden": false, "stickied": false, "created": 1492103410.0, "created_utc": 1492074610.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg86cwk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "M_Tootles", "parent_id": "t1_dg6vzcs", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;you're so obnoxiously smug I can't resist.\n\nNice to meet you too. ;p\n\n&gt;It's not nearly as unanimous in the field of history as you're claiming.\n\nI didn't say anything was 100% agreed upon or unanimous or close. And I'm not certain what you mean by \"it\". Are you disputing that revisionist historiography \"gained credence in academia\" in the 60s or that it's \"academically popular\"? [see below]\n\nOr are you assuming my comment re: my history profs was about anything other than them (with the implication that they're unlikely to be wholesale outliers) and anything other than what I said it was about, i.e. a very specific popular [i.e. general population-popular] narrative, namely \"that the bomb was dropped *to save lives* [full stop, implicitly] or because it was *the only way* to end the war\" (a rejection of which by the way doesn't exclude \"justified\" arguments by any means)?\n\n&gt;nor is 100% agreed upon as \"academically-popular revisionist historiography\" whatever the fuck that means. \n\nOK, perhaps this is just a misunderstanding. Sorry if that was opaque. I meant that revisionist (and in-between accounts, which hardly toe the popular-myth narrative line) accounts are relatively well known and relatively widely accepted in the academy *versus the general public.* They're \"academically popular\". Which isn't to say they're universal in the academy, either. Just popular, known, possessed of some currency, etc. Thus any academics doing work vaguely touching on the issue likely have at minimum a much different sense of the potential issues in play than 99% of the american public, thanks to revisionist histories, and a significant number of those folks actively buy into a VERY different narrative, one that most of the general public doesn't even known *exists*.\n\n(FWIW I actually think the a-bomb field as a specialty now attracts disproportionate numbers of reactionaries dedicated to shoring up the immediate post-war official narrative because of the profound paradigm shift that began in the 60s. My sense is that *non-a-bomb-specialists* who do US foreign policy stuff and are merely familiar with the specialist literature lean as a whole toward revisionist positions , but if you only care about the specialists, you do you.) \n\nEven among the increasing numbers of the general public that don't believe the bombings were justified, there's not a lot of knowledge about revisionist narratives, right? Just a general moral sense that shit smells funny.\n\n&gt;A significant portion of the Japanese leadership had been leaning towards surrender since the blockade and firebombings of late 1944 early 1945 took their full effect on the Japanese economy/ food supply. If it weren't for the military hardliners, who still tried to orchestrate a coup even after Hirohito decided to surrender, the V-J day would have been long before the summer of '45. The bombs were the final straw to give those looking for a way to surrender the upper hand.\n\nRight. I agree with all of this until the final line. It's (part of) what I meant by \"a tapestry of other factors.\" But your final line *seems* to ignore other equally proximate political and military developments—but it's short and it's an internet post so maybe you're using shorthand to say \"no the bomb mattered\" rather than \"it was ultimately the bomb, period\"—specifically Russia entering the war AND ACTUALLY ATTACKING was at least as big a factor.\n\nIIRC there was an academically popular ( :D ) book about 10 years ago that had a whole bunch of new evidence for logical positivist types who can't conceive of anything but a *conscious* motive being considered as a motive for anything. Hang on now I wanna find it... ok : Tsuyoshi Hasegawa - *Racing the Enemy: Stalin, Truman, and the Surrender of Japan.* He's the dude who did Japanese archival work showing them shitting their pants more over Russia than the bombs. \n\nI suspect military history departments have a different bias/worldview (not just in terms of politics as generally understood, but in terms of method and scope) when evaluating political decisions like this, but that's admittedly based on the bad taste left by discussions with undergrads who had a miiltary focus.\n\nAnyway THE POINT OF THE POST is not even to debate the fucking bomb, it's to point out that as a fucking nerd and a left-liberal GRRM is undoubtedly familiar with the revisionist historiography that was academically hip and popular in the 60s and 70s when he was coming of age. Disagreement with the decision to drop the bomb on a moral basis was already \"popular\" in the 60's and 70's (by which I  mean millions of americans held this view, not that it had anything near majoritarian support). Couple that with his probable familiarity with a historiography that greatly complicates the official narrative, I highly doubt he agrees that the decision to drop the A-Bomb was justified.\n\nCheers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;you&amp;#39;re so obnoxiously smug I can&amp;#39;t resist.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Nice to meet you too. ;p&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s not nearly as unanimous in the field of history as you&amp;#39;re claiming.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I didn&amp;#39;t say anything was 100% agreed upon or unanimous or close. And I&amp;#39;m not certain what you mean by &amp;quot;it&amp;quot;. Are you disputing that revisionist historiography &amp;quot;gained credence in academia&amp;quot; in the 60s or that it&amp;#39;s &amp;quot;academically popular&amp;quot;? [see below]&lt;/p&gt;\n\n&lt;p&gt;Or are you assuming my comment re: my history profs was about anything other than them (with the implication that they&amp;#39;re unlikely to be wholesale outliers) and anything other than what I said it was about, i.e. a very specific popular [i.e. general population-popular] narrative, namely &amp;quot;that the bomb was dropped &lt;em&gt;to save lives&lt;/em&gt; [full stop, implicitly] or because it was &lt;em&gt;the only way&lt;/em&gt; to end the war&amp;quot; (a rejection of which by the way doesn&amp;#39;t exclude &amp;quot;justified&amp;quot; arguments by any means)?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;nor is 100% agreed upon as &amp;quot;academically-popular revisionist historiography&amp;quot; whatever the fuck that means. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;OK, perhaps this is just a misunderstanding. Sorry if that was opaque. I meant that revisionist (and in-between accounts, which hardly toe the popular-myth narrative line) accounts are relatively well known and relatively widely accepted in the academy &lt;em&gt;versus the general public.&lt;/em&gt; They&amp;#39;re &amp;quot;academically popular&amp;quot;. Which isn&amp;#39;t to say they&amp;#39;re universal in the academy, either. Just popular, known, possessed of some currency, etc. Thus any academics doing work vaguely touching on the issue likely have at minimum a much different sense of the potential issues in play than 99% of the american public, thanks to revisionist histories, and a significant number of those folks actively buy into a VERY different narrative, one that most of the general public doesn&amp;#39;t even known &lt;em&gt;exists&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;(FWIW I actually think the a-bomb field as a specialty now attracts disproportionate numbers of reactionaries dedicated to shoring up the immediate post-war official narrative because of the profound paradigm shift that began in the 60s. My sense is that &lt;em&gt;non-a-bomb-specialists&lt;/em&gt; who do US foreign policy stuff and are merely familiar with the specialist literature lean as a whole toward revisionist positions , but if you only care about the specialists, you do you.) &lt;/p&gt;\n\n&lt;p&gt;Even among the increasing numbers of the general public that don&amp;#39;t believe the bombings were justified, there&amp;#39;s not a lot of knowledge about revisionist narratives, right? Just a general moral sense that shit smells funny.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A significant portion of the Japanese leadership had been leaning towards surrender since the blockade and firebombings of late 1944 early 1945 took their full effect on the Japanese economy/ food supply. If it weren&amp;#39;t for the military hardliners, who still tried to orchestrate a coup even after Hirohito decided to surrender, the V-J day would have been long before the summer of &amp;#39;45. The bombs were the final straw to give those looking for a way to surrender the upper hand.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Right. I agree with all of this until the final line. It&amp;#39;s (part of) what I meant by &amp;quot;a tapestry of other factors.&amp;quot; But your final line &lt;em&gt;seems&lt;/em&gt; to ignore other equally proximate political and military developments—but it&amp;#39;s short and it&amp;#39;s an internet post so maybe you&amp;#39;re using shorthand to say &amp;quot;no the bomb mattered&amp;quot; rather than &amp;quot;it was ultimately the bomb, period&amp;quot;—specifically Russia entering the war AND ACTUALLY ATTACKING was at least as big a factor.&lt;/p&gt;\n\n&lt;p&gt;IIRC there was an academically popular ( :D ) book about 10 years ago that had a whole bunch of new evidence for logical positivist types who can&amp;#39;t conceive of anything but a &lt;em&gt;conscious&lt;/em&gt; motive being considered as a motive for anything. Hang on now I wanna find it... ok : Tsuyoshi Hasegawa - &lt;em&gt;Racing the Enemy: Stalin, Truman, and the Surrender of Japan.&lt;/em&gt; He&amp;#39;s the dude who did Japanese archival work showing them shitting their pants more over Russia than the bombs. &lt;/p&gt;\n\n&lt;p&gt;I suspect military history departments have a different bias/worldview (not just in terms of politics as generally understood, but in terms of method and scope) when evaluating political decisions like this, but that&amp;#39;s admittedly based on the bad taste left by discussions with undergrads who had a miiltary focus.&lt;/p&gt;\n\n&lt;p&gt;Anyway THE POINT OF THE POST is not even to debate the fucking bomb, it&amp;#39;s to point out that as a fucking nerd and a left-liberal GRRM is undoubtedly familiar with the revisionist historiography that was academically hip and popular in the 60s and 70s when he was coming of age. Disagreement with the decision to drop the bomb on a moral basis was already &amp;quot;popular&amp;quot; in the 60&amp;#39;s and 70&amp;#39;s (by which I  mean millions of americans held this view, not that it had anything near majoritarian support). Couple that with his probable familiarity with a historiography that greatly complicates the official narrative, I highly doubt he agrees that the decision to drop the A-Bomb was justified.&lt;/p&gt;\n\n&lt;p&gt;Cheers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg86cwk", "score_hidden": false, "stickied": false, "created": 1492144295.0, "created_utc": 1492115495.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6vzcs", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Edelmaniac", "parent_id": "t1_dg6sdc0", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Jesus Christ. I hate to further the derail the topic, but you're so obnoxiously smug I can't resist. It's not nearly as unanimous in the field of history as you're claiming. It's certainly not agreed that it was justified, but nor is 100% agreed upon as \"academically-popular revisionist historiography\" whatever the fuck that means.  To pretend otherwise is just plain ignorant. \n\nA significant portion of the Japanese leadership had been leaning towards surrender since the blockade and firebombings of late 1944 early 1945 took their full effect on the Japanese economy/ food supply. If it weren't for the military hardliners, who still tried to orchestrate a coup even after Hirohito decided to surrender, the V-J day would have been long before the summer of '45. The bombs were the final straw to give those looking for a way to surrender the upper hand.\n\nWhen did you graduate? I was getting my degree in American military history from 2007-10 and what you are presenting as fact was not even close to the consensus. I'll admit that I haven't kept up with current historiography, but This sounds much more like the superficial arguments I heard in my AP US history class in high school.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jesus Christ. I hate to further the derail the topic, but you&amp;#39;re so obnoxiously smug I can&amp;#39;t resist. It&amp;#39;s not nearly as unanimous in the field of history as you&amp;#39;re claiming. It&amp;#39;s certainly not agreed that it was justified, but nor is 100% agreed upon as &amp;quot;academically-popular revisionist historiography&amp;quot; whatever the fuck that means.  To pretend otherwise is just plain ignorant. &lt;/p&gt;\n\n&lt;p&gt;A significant portion of the Japanese leadership had been leaning towards surrender since the blockade and firebombings of late 1944 early 1945 took their full effect on the Japanese economy/ food supply. If it weren&amp;#39;t for the military hardliners, who still tried to orchestrate a coup even after Hirohito decided to surrender, the V-J day would have been long before the summer of &amp;#39;45. The bombs were the final straw to give those looking for a way to surrender the upper hand.&lt;/p&gt;\n\n&lt;p&gt;When did you graduate? I was getting my degree in American military history from 2007-10 and what you are presenting as fact was not even close to the consensus. I&amp;#39;ll admit that I haven&amp;#39;t kept up with current historiography, but This sounds much more like the superficial arguments I heard in my AP US history class in high school.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6vzcs", "score_hidden": false, "stickied": false, "created": 1492074256.0, "created_utc": 1492045456.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg8742t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "M_Tootles", "parent_id": "t1_dg6ynzw", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "\"Bias\"... Hmmm... well, I see ideology as a more constitutive, constructive force than you, I suspect. My profs were left-liberal to commie, fo' sho'. But they were also prof. historians familiar with the historiography who had an opinion, one that I sense (given that this is a mainstream, major research university, hence unlikely to be populated by a wholly unrepresentative sample) is held by a not insignificant percentage of non-a-bomb specialist US historians. (My sense is that there are actual more traditionalists as a percentage among A-bomb specialists, because it attracts people trying to rehabilitate that narrative.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Bias&amp;quot;... Hmmm... well, I see ideology as a more constitutive, constructive force than you, I suspect. My profs were left-liberal to commie, fo&amp;#39; sho&amp;#39;. But they were also prof. historians familiar with the historiography who had an opinion, one that I sense (given that this is a mainstream, major research university, hence unlikely to be populated by a wholly unrepresentative sample) is held by a not insignificant percentage of non-a-bomb specialist US historians. (My sense is that there are actual more traditionalists as a percentage among A-bomb specialists, because it attracts people trying to rehabilitate that narrative.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8742t", "score_hidden": false, "stickied": false, "created": 1492145159.0, "created_utc": 1492116359.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ynzw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "getbustered", "parent_id": "t1_dg6sdc0", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I won't debate things we can't know for sure (like intent), and i don't disagree with everything you posted, but i have a question.\n\nHow are you able to do easily see and assign bias to other \"history departments\" without taking a step back to examine possible bias, motivations, or idealogy in your own history department, of which you seem to have taken the opinions shared as gospel?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I won&amp;#39;t debate things we can&amp;#39;t know for sure (like intent), and i don&amp;#39;t disagree with everything you posted, but i have a question.&lt;/p&gt;\n\n&lt;p&gt;How are you able to do easily see and assign bias to other &amp;quot;history departments&amp;quot; without taking a step back to examine possible bias, motivations, or idealogy in your own history department, of which you seem to have taken the opinions shared as gospel?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6ynzw", "score_hidden": false, "stickied": false, "created": 1492077584.0, "created_utc": 1492048784.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dgd64cj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "IllyrioMoParties", "parent_id": "t1_dgcz0dr", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "\"Let's not.\" - Lloyd George, 1918\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Let&amp;#39;s not.&amp;quot; - Lloyd George, 1918&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgd64cj", "score_hidden": false, "stickied": false, "created": 1492436381.0, "created_utc": 1492407581.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcz0dr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "M_Tootles", "parent_id": "t1_dgcuagk", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;And let's stipulate that you want nothing less than unconditional surrender.\n\nLet's not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;And let&amp;#39;s stipulate that you want nothing less than unconditional surrender.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Let&amp;#39;s not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgcz0dr", "score_hidden": false, "stickied": false, "created": 1492424776.0, "created_utc": 1492395976.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcuagk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IllyrioMoParties", "parent_id": "t1_dgch678", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; You're not talking to someone who thinks the saturation bombing of civilian centers carried out by the Allies in Europe or by the US over Japan was justified, so that argument doesn't really make sense for me. I think in general most people opposed to the dropping of that bomb would probably not be on board with much of the conventional bombing program were they aware of it.\n\nWell, in my view, they are aware of it, they just prefer not to think it through. But maybe I'm overestimating people.\n\nFor my part, while I think it's hard to declare the bombardment of cities justified unequivocally, I equally would struggle to call them unjustified. Let's bring it back to the A-bomb for clarity, and suppose that you're commander-in-chief. And let's stipulate that you want nothing less than unconditional surrender. Now, you could invade the Japanese islands, at what tremendous cost to your own troops you can scarcely contemplate - or you could *try* nuking a couple of Japanese cities. (Military industrial centres, let's not forget.) Would you not drop the bomb?\n\nMatter of fact, let's stipulate something else: for the sake of argument, it's going to work, and you know it: you can trade 100-200k Japanese lives, mostly civilians, for a similar or greater number of your own troops, and still achieve your war aims. Would you do it? I would.\n\nNow let's remove your certainty. It might not work. Would you roll the dice? I would.\n\nNow let's bring it back to the European theatre, and conventional bombing. Saturation bombing might bring the Nazis to the table early, obviating the need to fight for every inch of ground from Normandy to Berlin. Or, it might degrade their fighting capabilities such that the fight is less burdensome.\n\nOr, it might not.\n\nI'd still do it.\n\nThinking about it, you've probably already been through all these hypotheticals in your history class, but I suppose it elucidates my feelings on the matter. I agree with Sherman: war is hell, and the sooner it's over with, the better.\n\n&gt; ...that's why \"understood to be unnecessary at the time\".\n\nI take it you think it was more a threat levied at the Soviet Union?\n\n&gt; Fascist. ;D\n\nPinko", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You&amp;#39;re not talking to someone who thinks the saturation bombing of civilian centers carried out by the Allies in Europe or by the US over Japan was justified, so that argument doesn&amp;#39;t really make sense for me. I think in general most people opposed to the dropping of that bomb would probably not be on board with much of the conventional bombing program were they aware of it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, in my view, they are aware of it, they just prefer not to think it through. But maybe I&amp;#39;m overestimating people.&lt;/p&gt;\n\n&lt;p&gt;For my part, while I think it&amp;#39;s hard to declare the bombardment of cities justified unequivocally, I equally would struggle to call them unjustified. Let&amp;#39;s bring it back to the A-bomb for clarity, and suppose that you&amp;#39;re commander-in-chief. And let&amp;#39;s stipulate that you want nothing less than unconditional surrender. Now, you could invade the Japanese islands, at what tremendous cost to your own troops you can scarcely contemplate - or you could &lt;em&gt;try&lt;/em&gt; nuking a couple of Japanese cities. (Military industrial centres, let&amp;#39;s not forget.) Would you not drop the bomb?&lt;/p&gt;\n\n&lt;p&gt;Matter of fact, let&amp;#39;s stipulate something else: for the sake of argument, it&amp;#39;s going to work, and you know it: you can trade 100-200k Japanese lives, mostly civilians, for a similar or greater number of your own troops, and still achieve your war aims. Would you do it? I would.&lt;/p&gt;\n\n&lt;p&gt;Now let&amp;#39;s remove your certainty. It might not work. Would you roll the dice? I would.&lt;/p&gt;\n\n&lt;p&gt;Now let&amp;#39;s bring it back to the European theatre, and conventional bombing. Saturation bombing might bring the Nazis to the table early, obviating the need to fight for every inch of ground from Normandy to Berlin. Or, it might degrade their fighting capabilities such that the fight is less burdensome.&lt;/p&gt;\n\n&lt;p&gt;Or, it might not.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d still do it.&lt;/p&gt;\n\n&lt;p&gt;Thinking about it, you&amp;#39;ve probably already been through all these hypotheticals in your history class, but I suppose it elucidates my feelings on the matter. I agree with Sherman: war is hell, and the sooner it&amp;#39;s over with, the better.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;...that&amp;#39;s why &amp;quot;understood to be unnecessary at the time&amp;quot;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I take it you think it was more a threat levied at the Soviet Union?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Fascist. ;D&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Pinko&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgcuagk", "score_hidden": false, "stickied": false, "created": 1492418444.0, "created_utc": 1492389644.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgch678", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "M_Tootles", "parent_id": "t1_dgbsqr1", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "You're not talking to someone who thinks the saturation bombing of civilian centers carried out by the Allies in Europe or by the US over Japan was justified, so that argument doesn't really make sense for me. I think in general most people opposed to the dropping of that bomb would probably not be on board with much of the conventional bombing program were they aware of it.\n\nRe: the question, beliefs are important, but so is what could/should have reasonably been believed. But yeah, that's why \"understood to be unnecessary at the time\". Fascist. ;D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re not talking to someone who thinks the saturation bombing of civilian centers carried out by the Allies in Europe or by the US over Japan was justified, so that argument doesn&amp;#39;t really make sense for me. I think in general most people opposed to the dropping of that bomb would probably not be on board with much of the conventional bombing program were they aware of it.&lt;/p&gt;\n\n&lt;p&gt;Re: the question, beliefs are important, but so is what could/should have reasonably been believed. But yeah, that&amp;#39;s why &amp;quot;understood to be unnecessary at the time&amp;quot;. Fascist. ;D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgch678", "score_hidden": false, "stickied": false, "created": 1492400954.0, "created_utc": 1492372154.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbsqr1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IllyrioMoParties", "parent_id": "t1_dg6sdc0", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; But GRRM is surely most familiar with the history that came out of the 60s, which ~~argued that the bombing was unnecessary and understood to be unnecessary at the time~~ was KGB propaganda parroted by useful idiots in academe\n\nFIFY ;)\n\nAt the risk of totally derailing this weeks-old, long-dead discussion: when it comes to the A-bomb, isn't the important question \"What did the Americans know would happen, or think would happen, or hope to achieve, when they dropped it?\"\n\nOr better yet: \"What were their other options?\"\n\nFor the record: I agree that the Japanese were more perturbed by the Soviet invasion than the A-bombs, but I still think the bombing was justified. And also, frankly, not as big a deal as everybody makes out. Why is it horrible to kill 50,000 people in one day with one bomb, but it's totally unremarkable to kill 100,000 in one night with thousands of bombs? Why is it a problem to kill tens of thousands at once, but it's unremarkable to kill hundreds of thousands, even millions, over a period of a few short years?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But GRRM is surely most familiar with the history that came out of the 60s, which &lt;del&gt;argued that the bombing was unnecessary and understood to be unnecessary at the time&lt;/del&gt; was KGB propaganda parroted by useful idiots in academe&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;FIFY ;)&lt;/p&gt;\n\n&lt;p&gt;At the risk of totally derailing this weeks-old, long-dead discussion: when it comes to the A-bomb, isn&amp;#39;t the important question &amp;quot;What did the Americans know would happen, or think would happen, or hope to achieve, when they dropped it?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Or better yet: &amp;quot;What were their other options?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;For the record: I agree that the Japanese were more perturbed by the Soviet invasion than the A-bombs, but I still think the bombing was justified. And also, frankly, not as big a deal as everybody makes out. Why is it horrible to kill 50,000 people in one day with one bomb, but it&amp;#39;s totally unremarkable to kill 100,000 in one night with thousands of bombs? Why is it a problem to kill tens of thousands at once, but it&amp;#39;s unremarkable to kill hundreds of thousands, even millions, over a period of a few short years?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgbsqr1", "score_hidden": false, "stickied": false, "created": 1492354571.0, "created_utc": 1492325771.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6sdc0", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "M_Tootles", "parent_id": "t1_dg6lfel", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "IMO the historical record on the US dropping the atomic bomb on Japan doesn't support what you're saying.\n\nEven if these statements—\n&gt;the atom bomb ended the war\n***\n&gt;The bomb was absolutely what caused the Japanese to surrender\n\n—were true, which I don't think they are, they would be true only in the narrowest, most meaningless sense (something the professional shill historians espousing these views don't seem to understand), as a proximate cause that ignores a tapestry of other factors.\n\nThe bombs were dropped on August 6 and 9. Surrender came 6 days later on Aug 15, which looks (kinda sorta) like cause and effect, sure. But something else happened on August 9: the Soviet Union, whom Japan was using as a 3rd party to negotiate surrender, declared war and invaded the fuck out Japanese positions in Manchuria. Internal reactions were FAR graver than those caused by the loss of lives in Hiroshiima and Nagasaki. (Indeed, the bombing of Tokyo was probably just as bad in terms of civilian casualties and destruction, and nobody posits that as the cause of surrender.)\n\nThe notion that the bomb was dropped to save lives or because it was the only way to end the war wasn't taken seriously in the history department I got my degree from. It's viewed as a popular narrative/propaganda myth, not history. And even most traditionalist historians (who are conservatives, NOT the kind of people GRRM likes, and who know what sells books) now tend to argue only that it was a GOOD WAY to hopefully end the war with the happy benefit of saving lives, not some kind of unique vehicle to peace that was undertaken out of an explicit desire to preserve human life, etc.\n\nBut GRRM is surely most familiar with the history that came out of the 60s, which argued that the bombing was unnecessary and understood to be unnecessary at the time, and which adduced all kinds of evidence that Japan was on the cusp of surrender and was simply trying to avoid wholesale defeat completely on American terms. The arguments that gained credence in academia when GRRM was coming of age hold that dropping the atomic bomb had a great deal to do with establishing American hegemony vis-a-vis the Soviet Union and keeping the Soviets from negotiating a peace deal with Japan not to US liking (and sometimes see the bomb as causing the Soviets to say FUCK IT and jump in to grab a piece of the action).\n\nSince then the research has come out showing the huge effect of the Soviet entry into the war on the thinking of Japanese decision makers, so if GRRM's keeping up on these things it's not like he would have somehow ended up back in the camp of the VFW, which needs to believe the war was moral and the bomb justified, etc.\n\n**Anyway, big point is, there's no way someone like GRRM believes the standard American mythology about Hiroshima and Nagasaki being necessary evils, given the academically-popular revisionist (and in-between) historiography that's been in place since he was in college.**\n\nAs for dragons being used against slavery, I see that whole plotline being a continuation of a main theme in ASOIAF: good intentions that cause people to do/use \"bad things\" tend to bite people in the ass. The FM's idea—get rid of dragons, period—is the right one.\n\nWhat's the innocent life you're talkin' 'bout in AFFC? Pate? (1) We don't know he's dead. (2) We don't know Jaqen's orthodox FM.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;IMO the historical record on the US dropping the atomic bomb on Japan doesn&amp;#39;t support what you&amp;#39;re saying.&lt;/p&gt;\n\n&lt;p&gt;Even if these statements—&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;the atom bomb ended the war&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The bomb was absolutely what caused the Japanese to surrender&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;—were true, which I don&amp;#39;t think they are, they would be true only in the narrowest, most meaningless sense (something the professional shill historians espousing these views don&amp;#39;t seem to understand), as a proximate cause that ignores a tapestry of other factors.&lt;/p&gt;\n\n&lt;p&gt;The bombs were dropped on August 6 and 9. Surrender came 6 days later on Aug 15, which looks (kinda sorta) like cause and effect, sure. But something else happened on August 9: the Soviet Union, whom Japan was using as a 3rd party to negotiate surrender, declared war and invaded the fuck out Japanese positions in Manchuria. Internal reactions were FAR graver than those caused by the loss of lives in Hiroshiima and Nagasaki. (Indeed, the bombing of Tokyo was probably just as bad in terms of civilian casualties and destruction, and nobody posits that as the cause of surrender.)&lt;/p&gt;\n\n&lt;p&gt;The notion that the bomb was dropped to save lives or because it was the only way to end the war wasn&amp;#39;t taken seriously in the history department I got my degree from. It&amp;#39;s viewed as a popular narrative/propaganda myth, not history. And even most traditionalist historians (who are conservatives, NOT the kind of people GRRM likes, and who know what sells books) now tend to argue only that it was a GOOD WAY to hopefully end the war with the happy benefit of saving lives, not some kind of unique vehicle to peace that was undertaken out of an explicit desire to preserve human life, etc.&lt;/p&gt;\n\n&lt;p&gt;But GRRM is surely most familiar with the history that came out of the 60s, which argued that the bombing was unnecessary and understood to be unnecessary at the time, and which adduced all kinds of evidence that Japan was on the cusp of surrender and was simply trying to avoid wholesale defeat completely on American terms. The arguments that gained credence in academia when GRRM was coming of age hold that dropping the atomic bomb had a great deal to do with establishing American hegemony vis-a-vis the Soviet Union and keeping the Soviets from negotiating a peace deal with Japan not to US liking (and sometimes see the bomb as causing the Soviets to say FUCK IT and jump in to grab a piece of the action).&lt;/p&gt;\n\n&lt;p&gt;Since then the research has come out showing the huge effect of the Soviet entry into the war on the thinking of Japanese decision makers, so if GRRM&amp;#39;s keeping up on these things it&amp;#39;s not like he would have somehow ended up back in the camp of the VFW, which needs to believe the war was moral and the bomb justified, etc.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Anyway, big point is, there&amp;#39;s no way someone like GRRM believes the standard American mythology about Hiroshima and Nagasaki being necessary evils, given the academically-popular revisionist (and in-between) historiography that&amp;#39;s been in place since he was in college.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As for dragons being used against slavery, I see that whole plotline being a continuation of a main theme in ASOIAF: good intentions that cause people to do/use &amp;quot;bad things&amp;quot; tend to bite people in the ass. The FM&amp;#39;s idea—get rid of dragons, period—is the right one.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s the innocent life you&amp;#39;re talkin&amp;#39; &amp;#39;bout in AFFC? Pate? (1) We don&amp;#39;t know he&amp;#39;s dead. (2) We don&amp;#39;t know Jaqen&amp;#39;s orthodox FM.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6sdc0", "score_hidden": false, "stickied": false, "created": 1492069868.0, "created_utc": 1492041068.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6lfel", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hollowaydivision", "parent_id": "t1_dg6buls", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; Dropping atomic bombs on Japan was a wholly unnecessary atrocity. Even if you don't agree, I guarantee that's GRRM's position, given his views on war, conscientious objector status, and the fact that this view is widely held by academic/professional historians, 'merican popular historiography notwithstanding.\n\nGeorge was a conscientious objector from Vietnam. There is a huuuge gap between that and World War II. He has even stated in interviews \"The Nazis were the closest humanity has come to orcs.\"\n\n&gt;  I was born three years after the end of World War II. You want to be the hero... the American saving the world from the Nazis. It's sad to say, but I do think there are things worth fighting for.\n\nAnd yes, I get that the Nazis aren't the Japanese, but it was not a coincidence that they buddied up. HOWEVER - I do not think that the recognition that the atom bomb ended the war and the recognition that the bombing of Hiroshima and Nagasaki was an absolutely abhorrent human atrocity are mutually exclusive. The bomb was absolutely what caused the Japanese to surrender, and it was not-that-arguably the most horrific violation of human life by a single individual in history. I think GRRM would agree with both.\n\nFurthermore, just because the Faceless Men believed nuking Valyria was the way to end slavery doesn't mean it was *really* the way to end slavery. Importantly, the Targaryens got visions to bail on the Valyrian continent 12 years before the Doom - and now, whaddya know, we have \"dragons freeing slaves\", when only three short centuries ago dragons were the alpha and the omega of the slave trade.\n\n&gt;  an organization that I believe he's setting up to be ultimately \"good\" (but which he has deliberately tried to represent as suspect and ambiguous, chiefly by holding out the real nature of the gift vis-a-vis slave-ZOMBIES)\n\nI agree completely with this - I too have seen GRRM as ultimately \"approving\" of the FM. But most of all I think \"the gift\" and the HoBaWis a criticism of end-of-life care in the Western world - we focus too much on the horrific consequence of \"death\" that we forget to allow ourselves and our loved ones to live our lives. See the healer of Aemon in Braavos:\n\n&gt; \"No potion will make him young again. Give him this [dreamwine] and let him die.\" \n\nWhat's more, we saw in AFFC that the Faceless are willing to take innocent life to achieve their goals. What's the qualitative difference between one innocent to to three thousand innocents? It's not out of the question for several thousand \"Pates\" to be sacrificed to bring down the Valyrian empire.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Dropping atomic bombs on Japan was a wholly unnecessary atrocity. Even if you don&amp;#39;t agree, I guarantee that&amp;#39;s GRRM&amp;#39;s position, given his views on war, conscientious objector status, and the fact that this view is widely held by academic/professional historians, &amp;#39;merican popular historiography notwithstanding.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;George was a conscientious objector from Vietnam. There is a huuuge gap between that and World War II. He has even stated in interviews &amp;quot;The Nazis were the closest humanity has come to orcs.&amp;quot;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I was born three years after the end of World War II. You want to be the hero... the American saving the world from the Nazis. It&amp;#39;s sad to say, but I do think there are things worth fighting for.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And yes, I get that the Nazis aren&amp;#39;t the Japanese, but it was not a coincidence that they buddied up. HOWEVER - I do not think that the recognition that the atom bomb ended the war and the recognition that the bombing of Hiroshima and Nagasaki was an absolutely abhorrent human atrocity are mutually exclusive. The bomb was absolutely what caused the Japanese to surrender, and it was not-that-arguably the most horrific violation of human life by a single individual in history. I think GRRM would agree with both.&lt;/p&gt;\n\n&lt;p&gt;Furthermore, just because the Faceless Men believed nuking Valyria was the way to end slavery doesn&amp;#39;t mean it was &lt;em&gt;really&lt;/em&gt; the way to end slavery. Importantly, the Targaryens got visions to bail on the Valyrian continent 12 years before the Doom - and now, whaddya know, we have &amp;quot;dragons freeing slaves&amp;quot;, when only three short centuries ago dragons were the alpha and the omega of the slave trade.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;an organization that I believe he&amp;#39;s setting up to be ultimately &amp;quot;good&amp;quot; (but which he has deliberately tried to represent as suspect and ambiguous, chiefly by holding out the real nature of the gift vis-a-vis slave-ZOMBIES)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I agree completely with this - I too have seen GRRM as ultimately &amp;quot;approving&amp;quot; of the FM. But most of all I think &amp;quot;the gift&amp;quot; and the HoBaWis a criticism of end-of-life care in the Western world - we focus too much on the horrific consequence of &amp;quot;death&amp;quot; that we forget to allow ourselves and our loved ones to live our lives. See the healer of Aemon in Braavos:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;No potion will make him young again. Give him this [dreamwine] and let him die.&amp;quot; &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What&amp;#39;s more, we saw in AFFC that the Faceless are willing to take innocent life to achieve their goals. What&amp;#39;s the qualitative difference between one innocent to to three thousand innocents? It&amp;#39;s not out of the question for several thousand &amp;quot;Pates&amp;quot; to be sacrificed to bring down the Valyrian empire.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6lfel", "score_hidden": false, "stickied": false, "created": 1492061333.0, "created_utc": 1492032533.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6buls", "gilded": 0, "archived": false, "score": 49, "report_reasons": null, "author": "M_Tootles", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "The basic idea that there's a relationship between Hardhome and the Doom and that these events have some kind of dramatic motivation rather than just being \"stuff that happened\" seems noncontroversial. As you say, the Kindly Man pretty much spells out what that \"stuff\" was by saying \"He would bring the gift to them as well... but that is a tale for another day, one best shared with no one,\" so it's tough to see how anyone can object to the general notion that Valyria was the Faceless Men's doing.\n\nAnd I don't see how anyone can doubt or miss the nuclear metaphor.\n\nHowever, the idea that Hardhome must have been a \"nuclear\" *test* run by the Faceless Men is troubling precisely because of the location involved.\n\nOn paper, given what we know, Hardhome seems like an ANTI-Valyria. It was a nascent civilization among THE FREE FOLK, people who view even kneeling and feudal hierarcy as anathema. These are the sorts of people who would be beloved by the Braavosi/FM, not slaughtered by them to see if they have the right formula to detonate a dragon egg.\n\nTake a look at what we're told about the incident:\n&gt;He did. Hardhome had been halfway toward becoming a town, the only true town north of the Wall, until the night six hundred years ago when hell had swallowed it. **Its people had been carried off into slavery or slaughtered for meat**, depending on which version of the tale you believed, their homes and halls consumed in a conflagration that burned so hot that watchers on the Wall far to the south had thought the sun was rising in the north. \n\n&amp;nbsp;\n\nWho does that sound like perpetrated it? The Valyrians (slavery) and Dragons/wyrms (meat), right?\n\nIndeed, the Free Folk coalescing and organizing as a people would hardly be something the slave-dependent Valyrians would be relishing in their \"Freehold\". (Notice how those names echo one another yet tell different stories: Free FOLKS sounds like a statement of simple, humble fact; Free HOLD sounds like something dreamt up in a propaganda office or corporate PR firm to cover up what's really going while still kinda sort acknowledging it because no one's gonna buy the Valyrians as \"just a bunch of free folks.)\n\nSo I think there's a good possibility that your basic premise here is in some senses correct, but that the quote-unquote \"test\" (a) wasn't necessarily an intentional event and (b) wasn't carried out by the people who *learned* the most from it—i.e. the Faceless Men—but by Valyria and/or Firewyrms/Eggs.\n\nThat is, it's possible the Valyrians were weaponizing dragon eggs, and the Faceless Men figured out what happened ([assuming they can skinchange](https://asongoficeandtootles.wordpress.com/2016/03/02/how-the-faceless-men-do-their-faceless-thing/) and that doing so provides access to memories, they certainly had the tools necessary to gain) and turned the tables after gathering enough eggs to pay Valyria back 1000-fold for Hardhome.\n\nOr it could have been a \"semi-natural\" disaster caused by eggs in the tunnels that was studied to the same effect, although this doesn't have nearly the dramatic oomph.\n\nOf course, it's possible GRRM's point is to show that the Faceless Men \"did what they had to do to stop a greater evil\", making a \"tough choice\" to kill some so that the science could advance to end the Freehold for good.\n\nBut I don't think so, simply because I AGREE COMPLETELY with the nuclear weapons metaphor and I don't think GRRM buys the version of (real) world history you're telling here:\n\n&gt;The nuclear bomb would become America's coup in World War II, providing a means to quickly and categorically put an end the ambitions of the brutal, conquest-hungry Japanese Empire with the least amount of human death possible.\n\nThis is historical fantasy, something that was printed in newspapers at the time but has not withstood the release of the internal record. Dropping atomic bombs on Japan was a wholly unnecessary atrocity. *Even if you don't agree,* I guarantee that's GRRM's position, given his views on war, conscientious objector status, and the fact that this view is widely held by academic/professional historians, 'merican *popular* historiography notwithstanding.\n\nGiven that, it's tough for me to believe GRRM would have an organization that I believe he's setting up to be ultimately \"good\" (but which he has deliberately tried to represent as suspect and ambiguous, chiefly by holding out the real nature of the gift vis-a-vis slave-ZOMBIES) do something (test bomb on humans) that not even the US did prior to committing an act that I guarantee he thinks was a terrible atrocity.", "edited": 1492041374.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The basic idea that there&amp;#39;s a relationship between Hardhome and the Doom and that these events have some kind of dramatic motivation rather than just being &amp;quot;stuff that happened&amp;quot; seems noncontroversial. As you say, the Kindly Man pretty much spells out what that &amp;quot;stuff&amp;quot; was by saying &amp;quot;He would bring the gift to them as well... but that is a tale for another day, one best shared with no one,&amp;quot; so it&amp;#39;s tough to see how anyone can object to the general notion that Valyria was the Faceless Men&amp;#39;s doing.&lt;/p&gt;\n\n&lt;p&gt;And I don&amp;#39;t see how anyone can doubt or miss the nuclear metaphor.&lt;/p&gt;\n\n&lt;p&gt;However, the idea that Hardhome must have been a &amp;quot;nuclear&amp;quot; &lt;em&gt;test&lt;/em&gt; run by the Faceless Men is troubling precisely because of the location involved.&lt;/p&gt;\n\n&lt;p&gt;On paper, given what we know, Hardhome seems like an ANTI-Valyria. It was a nascent civilization among THE FREE FOLK, people who view even kneeling and feudal hierarcy as anathema. These are the sorts of people who would be beloved by the Braavosi/FM, not slaughtered by them to see if they have the right formula to detonate a dragon egg.&lt;/p&gt;\n\n&lt;p&gt;Take a look at what we&amp;#39;re told about the incident:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;He did. Hardhome had been halfway toward becoming a town, the only true town north of the Wall, until the night six hundred years ago when hell had swallowed it. &lt;strong&gt;Its people had been carried off into slavery or slaughtered for meat&lt;/strong&gt;, depending on which version of the tale you believed, their homes and halls consumed in a conflagration that burned so hot that watchers on the Wall far to the south had thought the sun was rising in the north. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Who does that sound like perpetrated it? The Valyrians (slavery) and Dragons/wyrms (meat), right?&lt;/p&gt;\n\n&lt;p&gt;Indeed, the Free Folk coalescing and organizing as a people would hardly be something the slave-dependent Valyrians would be relishing in their &amp;quot;Freehold&amp;quot;. (Notice how those names echo one another yet tell different stories: Free FOLKS sounds like a statement of simple, humble fact; Free HOLD sounds like something dreamt up in a propaganda office or corporate PR firm to cover up what&amp;#39;s really going while still kinda sort acknowledging it because no one&amp;#39;s gonna buy the Valyrians as &amp;quot;just a bunch of free folks.)&lt;/p&gt;\n\n&lt;p&gt;So I think there&amp;#39;s a good possibility that your basic premise here is in some senses correct, but that the quote-unquote &amp;quot;test&amp;quot; (a) wasn&amp;#39;t necessarily an intentional event and (b) wasn&amp;#39;t carried out by the people who &lt;em&gt;learned&lt;/em&gt; the most from it—i.e. the Faceless Men—but by Valyria and/or Firewyrms/Eggs.&lt;/p&gt;\n\n&lt;p&gt;That is, it&amp;#39;s possible the Valyrians were weaponizing dragon eggs, and the Faceless Men figured out what happened (&lt;a href=\"https://asongoficeandtootles.wordpress.com/2016/03/02/how-the-faceless-men-do-their-faceless-thing/\"&gt;assuming they can skinchange&lt;/a&gt; and that doing so provides access to memories, they certainly had the tools necessary to gain) and turned the tables after gathering enough eggs to pay Valyria back 1000-fold for Hardhome.&lt;/p&gt;\n\n&lt;p&gt;Or it could have been a &amp;quot;semi-natural&amp;quot; disaster caused by eggs in the tunnels that was studied to the same effect, although this doesn&amp;#39;t have nearly the dramatic oomph.&lt;/p&gt;\n\n&lt;p&gt;Of course, it&amp;#39;s possible GRRM&amp;#39;s point is to show that the Faceless Men &amp;quot;did what they had to do to stop a greater evil&amp;quot;, making a &amp;quot;tough choice&amp;quot; to kill some so that the science could advance to end the Freehold for good.&lt;/p&gt;\n\n&lt;p&gt;But I don&amp;#39;t think so, simply because I AGREE COMPLETELY with the nuclear weapons metaphor and I don&amp;#39;t think GRRM buys the version of (real) world history you&amp;#39;re telling here:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The nuclear bomb would become America&amp;#39;s coup in World War II, providing a means to quickly and categorically put an end the ambitions of the brutal, conquest-hungry Japanese Empire with the least amount of human death possible.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is historical fantasy, something that was printed in newspapers at the time but has not withstood the release of the internal record. Dropping atomic bombs on Japan was a wholly unnecessary atrocity. &lt;em&gt;Even if you don&amp;#39;t agree,&lt;/em&gt; I guarantee that&amp;#39;s GRRM&amp;#39;s position, given his views on war, conscientious objector status, and the fact that this view is widely held by academic/professional historians, &amp;#39;merican &lt;em&gt;popular&lt;/em&gt; historiography notwithstanding.&lt;/p&gt;\n\n&lt;p&gt;Given that, it&amp;#39;s tough for me to believe GRRM would have an organization that I believe he&amp;#39;s setting up to be ultimately &amp;quot;good&amp;quot; (but which he has deliberately tried to represent as suspect and ambiguous, chiefly by holding out the real nature of the gift vis-a-vis slave-ZOMBIES) do something (test bomb on humans) that not even the US did prior to committing an act that I guarantee he thinks was a terrible atrocity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6buls", "score_hidden": false, "stickied": false, "created": 1492051235.0, "created_utc": 1492022435.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 49}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg7zgyl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hollowaydivision", "parent_id": "t1_dg77dkv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I imagine they're watching Daenerys very, very, VERY closely.\n\nOn the one hand, she controls dragons, which will continue to be a part of the world after she dies. I'm sure they don't want them getting into the wrong hands, as it was dragons that enslaved the entire world.\n\nOn the other hand, she is using them for a worldwide war of emancipation - which the Faceless would be pleased about.\n\nAnd finally, with the arrival of the wildlings from Hardhome to Braavos, we can no longer doubt that the Faceless know about the Others. How they plan for Dany to fit into that puzzle should be a part of their strategy too.\n\nThis is why I'm convinced by theories about Faceless (Missandei? Daario?) being near to Dany. They must be keeping close tabs on her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I imagine they&amp;#39;re watching Daenerys very, very, VERY closely.&lt;/p&gt;\n\n&lt;p&gt;On the one hand, she controls dragons, which will continue to be a part of the world after she dies. I&amp;#39;m sure they don&amp;#39;t want them getting into the wrong hands, as it was dragons that enslaved the entire world.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, she is using them for a worldwide war of emancipation - which the Faceless would be pleased about.&lt;/p&gt;\n\n&lt;p&gt;And finally, with the arrival of the wildlings from Hardhome to Braavos, we can no longer doubt that the Faceless know about the Others. How they plan for Dany to fit into that puzzle should be a part of their strategy too.&lt;/p&gt;\n\n&lt;p&gt;This is why I&amp;#39;m convinced by theories about Faceless (Missandei? Daario?) being near to Dany. They must be keeping close tabs on her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7zgyl", "score_hidden": false, "stickied": false, "created": 1492136801.0, "created_utc": 1492108001.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg77dkv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nivekious", "parent_id": "t1_dg6ei8l", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Why would the FM want to kill Targaryens?  Sure they were descended of Valyrian nobility but any Targaryen slaveholders were dead centuries before Summerhall.  Slavery remained outlawed in Westeros under the Targaryens.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why would the FM want to kill Targaryens?  Sure they were descended of Valyrian nobility but any Targaryen slaveholders were dead centuries before Summerhall.  Slavery remained outlawed in Westeros under the Targaryens.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg77dkv", "score_hidden": false, "stickied": false, "created": 1492090466.0, "created_utc": 1492061666.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ei8l", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "cantuse", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I've heard this theory before. I wish I could remember who posted it years ago. I certainly give you credit for perhaps the best written version of it I've seen.\n\nIt's always stood out to me that Summerhall was a prime opportunity to take out huge swath (if not all) of the Targaryens, which is one of the reasons I always wondered if it might have involved the FM in some fashion like this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve heard this theory before. I wish I could remember who posted it years ago. I certainly give you credit for perhaps the best written version of it I&amp;#39;ve seen.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s always stood out to me that Summerhall was a prime opportunity to take out huge swath (if not all) of the Targaryens, which is one of the reasons I always wondered if it might have involved the FM in some fashion like this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6ei8l", "score_hidden": false, "stickied": false, "created": 1492053987.0, "created_utc": 1492025187.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6llu0", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "hollowaydivision", "parent_id": "t1_dg6hv5p", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Red Wastes are on my list of \"irradiated\" zones, especially since there's a monstrous dragon skeleton in the middle of the desert and Doreah dies of something very *very* similar to radiation poisioning. I have a thesis on how that fits in with this (essentially, Qarth is the castle from the Masque of the Red Death, but with slaves) but I thought it would distract from the post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Red Wastes are on my list of &amp;quot;irradiated&amp;quot; zones, especially since there&amp;#39;s a monstrous dragon skeleton in the middle of the desert and Doreah dies of something very &lt;em&gt;very&lt;/em&gt; similar to radiation poisioning. I have a thesis on how that fits in with this (essentially, Qarth is the castle from the Masque of the Red Death, but with slaves) but I thought it would distract from the post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6llu0", "score_hidden": false, "stickied": false, "created": 1492061544.0, "created_utc": 1492032744.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6hv5p", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ChazoftheWasteland", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "You're mostly right, except for the origin of the nuke.  Everyone knows that Qarth has nukes.  The Red Waste is what resulted from the last time someone tried to conquer Qarth.  So Qarth nuked Hardhome as a test and a warning to Valyria, and then Valyria forgot about the nukes and was later nuked by Qarth when those silver haired idiots pushed their luck.\n\n/Preston Jacobs ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re mostly right, except for the origin of the nuke.  Everyone knows that Qarth has nukes.  The Red Waste is what resulted from the last time someone tried to conquer Qarth.  So Qarth nuked Hardhome as a test and a warning to Valyria, and then Valyria forgot about the nukes and was later nuked by Qarth when those silver haired idiots pushed their luck.&lt;/p&gt;\n\n&lt;p&gt;/Preston Jacobs &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6hv5p", "score_hidden": false, "stickied": false, "created": 1492057420.0, "created_utc": 1492028620.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg62njp", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "byanygreensnecessary", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "This is a great theory, well done!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a great theory, well done!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg62njp", "score_hidden": false, "stickied": false, "created": 1492041792.0, "created_utc": 1492012992.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg792ja", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Meehl", "parent_id": "t1_dg64yhg", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "dying is not the health of the horse, but the job of the rider. like a delivery van. arya will be delivering the dying. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;dying is not the health of the horse, but the job of the rider. like a delivery van. arya will be delivering the dying. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg792ja", "score_hidden": false, "stickied": false, "created": 1492094377.0, "created_utc": 1492065577.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg64yhg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "DutchArya", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Excellent theory!\n\nIt fits into the blank I had while writing up this thread:\n\nhttps://www.reddit.com/r/asoiaf/comments/4ypums/spoilers_everything_bloodraven_the_kindly_man/\n\nWhat is the FM agenda? If your theory is correct, I think the FM have a cause that is actually inline with the Old Gods of the North (CoTF/Bloodraven).\n\nThis is something long in the making... Jaqen is the one that goes after the book on the **Death of Dragons** and he may be in the possession of a dragon egg. He has the coloring of a weirdwood tree and it can be argued that all these Gods (which don't really exist) in asoiaf are just facets (Faces) of the CoTF. The idea that \"all men must die\" is something the children spent a a long time trying to achieve and failing nonetheless. Then settling on peace with the Pact on the **Isle of Faces**. A place linked to Arya and Bran who talks of the Green Men who were created after the Pact was made. The First Men took the religion of the Old Gods which included worship of the weirwoods... *all men must serve.*\n\nThe First FM that gave the first slave the ability to give the gift and change their faces... The Kindly Man doesn't know who that was? No one really does. \n\nI think the vision Mel has in her flames about the **grey girl on a dying horse** is actually Arya travelling not North, but South along the western shore of the Gods Eye lake where the Isle of Faces is located. I think Bran is the one guiding her there. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Excellent theory!&lt;/p&gt;\n\n&lt;p&gt;It fits into the blank I had while writing up this thread:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/asoiaf/comments/4ypums/spoilers_everything_bloodraven_the_kindly_man/\"&gt;https://www.reddit.com/r/asoiaf/comments/4ypums/spoilers_everything_bloodraven_the_kindly_man/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;What is the FM agenda? If your theory is correct, I think the FM have a cause that is actually inline with the Old Gods of the North (CoTF/Bloodraven).&lt;/p&gt;\n\n&lt;p&gt;This is something long in the making... Jaqen is the one that goes after the book on the &lt;strong&gt;Death of Dragons&lt;/strong&gt; and he may be in the possession of a dragon egg. He has the coloring of a weirdwood tree and it can be argued that all these Gods (which don&amp;#39;t really exist) in asoiaf are just facets (Faces) of the CoTF. The idea that &amp;quot;all men must die&amp;quot; is something the children spent a a long time trying to achieve and failing nonetheless. Then settling on peace with the Pact on the &lt;strong&gt;Isle of Faces&lt;/strong&gt;. A place linked to Arya and Bran who talks of the Green Men who were created after the Pact was made. The First Men took the religion of the Old Gods which included worship of the weirwoods... &lt;em&gt;all men must serve.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The First FM that gave the first slave the ability to give the gift and change their faces... The Kindly Man doesn&amp;#39;t know who that was? No one really does. &lt;/p&gt;\n\n&lt;p&gt;I think the vision Mel has in her flames about the &lt;strong&gt;grey girl on a dying horse&lt;/strong&gt; is actually Arya travelling not North, but South along the western shore of the Gods Eye lake where the Isle of Faces is located. I think Bran is the one guiding her there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg64yhg", "score_hidden": false, "stickied": false, "created": 1492044222.0, "created_utc": 1492015422.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg790dx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Meehl", "parent_id": "t1_dg69ach", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "the Valyrians were battle tested for hundreds of years, including endless war with the river cities. they knew how explosions work. the fm were of these people. they were battle tested, too. so everyone knew how explosions work. No one needs to blow up a city to test a thing. Besides that, Valeria was advanced architecture. large impressive structures with solid rock or stone or marble or whatever materials.  hardhome wouldn't have been much compared to that...thatch, mud, wood? and that's suppose to give a proof in principle of how Valeria would blow up? that doesn't make sense and isn't even essential to your theory. \n\nI could say the magic needed to explode a dragon egg in your theory is a death sacrifice requiring tens of thousands of victims. That would require the fm to identify for testing the only massing group of sacrifices that wouldn't be guarded by organized government/militia, whose death wouldn't terribly upset the world economic or social order, and who wouldn't be terribly missed. I'm sure we can order a pizza and debate for 20 minutes and come up with better explanations than that, any of which would be better than \"they didn't know if massive explosions were deadly\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the Valyrians were battle tested for hundreds of years, including endless war with the river cities. they knew how explosions work. the fm were of these people. they were battle tested, too. so everyone knew how explosions work. No one needs to blow up a city to test a thing. Besides that, Valeria was advanced architecture. large impressive structures with solid rock or stone or marble or whatever materials.  hardhome wouldn&amp;#39;t have been much compared to that...thatch, mud, wood? and that&amp;#39;s suppose to give a proof in principle of how Valeria would blow up? that doesn&amp;#39;t make sense and isn&amp;#39;t even essential to your theory. &lt;/p&gt;\n\n&lt;p&gt;I could say the magic needed to explode a dragon egg in your theory is a death sacrifice requiring tens of thousands of victims. That would require the fm to identify for testing the only massing group of sacrifices that wouldn&amp;#39;t be guarded by organized government/militia, whose death wouldn&amp;#39;t terribly upset the world economic or social order, and who wouldn&amp;#39;t be terribly missed. I&amp;#39;m sure we can order a pizza and debate for 20 minutes and come up with better explanations than that, any of which would be better than &amp;quot;they didn&amp;#39;t know if massive explosions were deadly&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg790dx", "score_hidden": false, "stickied": false, "created": 1492094224.0, "created_utc": 1492065424.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg69ach", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "hollowaydivision", "parent_id": "t1_dg65a0n", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Same reason the US built fake cities in the middle of nowhere to test their weapons. They had to test the effect on a populated area. But since in Ice and Fire you can't exactly erect an entire fake town complete with mannequins, they had to find somewhere in the world. Beyond the Wall is the best choice for evading Valyrian detection - it's not in Essos, so not in glass candle territory, and the stories that survive are attributed to beyond-the-Wall superstition.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same reason the US built fake cities in the middle of nowhere to test their weapons. They had to test the effect on a populated area. But since in Ice and Fire you can&amp;#39;t exactly erect an entire fake town complete with mannequins, they had to find somewhere in the world. Beyond the Wall is the best choice for evading Valyrian detection - it&amp;#39;s not in Essos, so not in glass candle territory, and the stories that survive are attributed to beyond-the-Wall superstition.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg69ach", "score_hidden": false, "stickied": false, "created": 1492048610.0, "created_utc": 1492019810.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6lbv0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "canonymous", "parent_id": "t1_dg65a0n", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Maybe someone at Hardhome hired them for something, and that was their price. For a truly accurate trial run, they would need to test it on people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe someone at Hardhome hired them for something, and that was their price. For a truly accurate trial run, they would need to test it on people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6lbv0", "score_hidden": false, "stickied": false, "created": 1492061215.0, "created_utc": 1492032415.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6o6h3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nreetz", "parent_id": "t1_dg65a0n", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "If you subscribe to the theory that the FM are connected with the Great Other (in opposition to R'hollr, who would be connected with the Valyrians), wouldn't it make sense that they are killing people near the Others? And if it was a test site for some weapon, they might have underestimated the devastation their weapon would cause.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you subscribe to the theory that the FM are connected with the Great Other (in opposition to R&amp;#39;hollr, who would be connected with the Valyrians), wouldn&amp;#39;t it make sense that they are killing people near the Others? And if it was a test site for some weapon, they might have underestimated the devastation their weapon would cause.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6o6h3", "score_hidden": false, "stickied": false, "created": 1492064694.0, "created_utc": 1492035894.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg65a0n", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Jazz567", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Wow, great theory, it makes a lot of sense. One question, why would the faceless men choose hardhome and not a deserted area?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, great theory, it makes a lot of sense. One question, why would the faceless men choose hardhome and not a deserted area?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg65a0n", "score_hidden": false, "stickied": false, "created": 1492044556.0, "created_utc": 1492015756.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg8nx6v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EnochHereEnochThere", "parent_id": "t1_dg73ca0", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "My favourite theory tbh", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My favourite theory tbh&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8nx6v", "score_hidden": false, "stickied": false, "created": 1492167540.0, "created_utc": 1492138740.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg73ca0", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Strobe_Synapse", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Wasn't this theory made a few years back?\n\nhttps://www.reddit.com/r/asoiaf/comments/1k80pg/spoilers_all_the_endgame_of_the_faceless_men/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wasn&amp;#39;t this theory made a few years back?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/asoiaf/comments/1k80pg/spoilers_all_the_endgame_of_the_faceless_men/\"&gt;https://www.reddit.com/r/asoiaf/comments/1k80pg/spoilers_all_the_endgame_of_the_faceless_men/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg73ca0", "score_hidden": false, "stickied": false, "created": 1492083759.0, "created_utc": 1492054959.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg7b3fe", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Failroko", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Dragon eggs used as bombs... MIND=BLOWN wow that's a badass theory. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dragon eggs used as bombs... MIND=BLOWN wow that&amp;#39;s a badass theory. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7b3fe", "score_hidden": false, "stickied": false, "created": 1492099959.0, "created_utc": 1492071159.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6bdiq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "DaneFairchild", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Westeros and Essos are volcanically active, but I doubt there was a conscious act that linked the two. Possibly the Faceless Men assassinated the sorcerers that were keeping the 14 fires of Valyria under control and that caused the Doom, but I don't see any connection to Hardhome. \n\nWhy would the FM pick Hardhome which is populated with innocent wildlings? The FM have no reason to \"practice\" on wildlings that have nothing to do with them when they could have instead practiced in an unpopulated area.  If they wanted to give the \"gift\" to people living in squalor there were better targets in Essos.  The events between Hardhome and the Doom happened 200 years apart so what were they trying to perfect in all that time and why where there no other so-called experiments? \n\nHardhome was a natural event, or at least brought about by something besides the FM.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Westeros and Essos are volcanically active, but I doubt there was a conscious act that linked the two. Possibly the Faceless Men assassinated the sorcerers that were keeping the 14 fires of Valyria under control and that caused the Doom, but I don&amp;#39;t see any connection to Hardhome. &lt;/p&gt;\n\n&lt;p&gt;Why would the FM pick Hardhome which is populated with innocent wildlings? The FM have no reason to &amp;quot;practice&amp;quot; on wildlings that have nothing to do with them when they could have instead practiced in an unpopulated area.  If they wanted to give the &amp;quot;gift&amp;quot; to people living in squalor there were better targets in Essos.  The events between Hardhome and the Doom happened 200 years apart so what were they trying to perfect in all that time and why where there no other so-called experiments? &lt;/p&gt;\n\n&lt;p&gt;Hardhome was a natural event, or at least brought about by something besides the FM.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6bdiq", "score_hidden": false, "stickied": false, "created": 1492050749.0, "created_utc": 1492021949.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg686xb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pikkdogs", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I could see it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I could see it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg686xb", "score_hidden": false, "stickied": false, "created": 1492047509.0, "created_utc": 1492018709.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6h9ph", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bikesbabesbeer", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "The tinfoil is strong with this one...great job OP!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The tinfoil is strong with this one...great job OP!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6h9ph", "score_hidden": false, "stickied": false, "created": 1492056812.0, "created_utc": 1492028012.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg7nwer", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "humanjumprope", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Have you been listening to JRE recently? Rogan will not shut up about that quote of late.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you been listening to JRE recently? Rogan will not shut up about that quote of late.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7nwer", "score_hidden": false, "stickied": false, "created": 1492124458.0, "created_utc": 1492095658.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg66int", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "FrankZappasNose", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "FUn REaD! Just like my case usage! FUN! Read it! Weeeeeeeeee!\n\nAnyway partway through when you mentioned firewyrms I was like \"Well shit, ain't that the simplest explanation? I bet those little fuckers bored all them caves and tunnels and can cover some serious distance and once in a while make a fucking mess.\" (dooms and such)\n\nAnd THen you made the connection between those being killed at Hardhome first before the real target, to that slave getting killed before the jerkass masters, and well? I just really appreciated that connection. Whether you're right on, or way out in left field, that part did sound Georgeish to me.\n\nBut as long as we're on the subject of eggbombs.\n\nIf I were a dragon heading into battle with some purple eyed yuppie on my back, I'd certainly forgo my morning egg dump so I could have one in the chamber ready to fire at some dweebs and lame-os. [Like this](https://youtu.be/VZIfUXbK-L4?t=10s) except I wouldn't be spitting it. I'd be blasting it out of my dirty disgusting cloaca with all my might.\n\nONe last thought since you've made it this far:\nIf you're up against an army with dragons, hire a reptile expert. They could tell you exactly where to shoot a giant flaming arrow and explode the egg inside the dragon.\n\n...Confound the cocksucker", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;FUn REaD! Just like my case usage! FUN! Read it! Weeeeeeeeee!&lt;/p&gt;\n\n&lt;p&gt;Anyway partway through when you mentioned firewyrms I was like &amp;quot;Well shit, ain&amp;#39;t that the simplest explanation? I bet those little fuckers bored all them caves and tunnels and can cover some serious distance and once in a while make a fucking mess.&amp;quot; (dooms and such)&lt;/p&gt;\n\n&lt;p&gt;And THen you made the connection between those being killed at Hardhome first before the real target, to that slave getting killed before the jerkass masters, and well? I just really appreciated that connection. Whether you&amp;#39;re right on, or way out in left field, that part did sound Georgeish to me.&lt;/p&gt;\n\n&lt;p&gt;But as long as we&amp;#39;re on the subject of eggbombs.&lt;/p&gt;\n\n&lt;p&gt;If I were a dragon heading into battle with some purple eyed yuppie on my back, I&amp;#39;d certainly forgo my morning egg dump so I could have one in the chamber ready to fire at some dweebs and lame-os. &lt;a href=\"https://youtu.be/VZIfUXbK-L4?t=10s\"&gt;Like this&lt;/a&gt; except I wouldn&amp;#39;t be spitting it. I&amp;#39;d be blasting it out of my dirty disgusting cloaca with all my might.&lt;/p&gt;\n\n&lt;p&gt;ONe last thought since you&amp;#39;ve made it this far:\nIf you&amp;#39;re up against an army with dragons, hire a reptile expert. They could tell you exactly where to shoot a giant flaming arrow and explode the egg inside the dragon.&lt;/p&gt;\n\n&lt;p&gt;...Confound the cocksucker&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg66int", "score_hidden": false, "stickied": false, "created": 1492045830.0, "created_utc": 1492017030.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg796le", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Meehl", "parent_id": "t1_dg6wrgp", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "the nights watch rangers would note massive changes to landscape in a highly visible place. a lot of things get lost to time, but the wall is boring and missing mountains would come up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the nights watch rangers would note massive changes to landscape in a highly visible place. a lot of things get lost to time, but the wall is boring and missing mountains would come up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg796le", "score_hidden": false, "stickied": false, "created": 1492094659.0, "created_utc": 1492065859.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6wrgp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SerPoopybutthole", "parent_id": "t1_dg6w0c7", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "We haven't heard the insights of any traders that had been there 600 years ago so we don't know. After the occurrence the place was shunned. I'm sure somewhere out there someone might have recalled something about something, but if Grrm told us about it then it would lend too much evidence on the subject and would make the red herringness of it obvious. There is much of this world we don't know about, but that doesn't make everything we don't know about an important magical detail that will be important to the future story. That would defeat the importance of world building. We don't know who built the mazes in Lorath, but that doesn't mean those maze builders will be important in the story. It doesn't mean magic was used to make the mazes. Maybe magic made those mazes. Maybe magic didn't. Who knows? It was the biggest port north of the wall, but that doesn't mean it was a note worthy port for a lot of traders. And of those traders who would go back to a place that is accursed?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We haven&amp;#39;t heard the insights of any traders that had been there 600 years ago so we don&amp;#39;t know. After the occurrence the place was shunned. I&amp;#39;m sure somewhere out there someone might have recalled something about something, but if Grrm told us about it then it would lend too much evidence on the subject and would make the red herringness of it obvious. There is much of this world we don&amp;#39;t know about, but that doesn&amp;#39;t make everything we don&amp;#39;t know about an important magical detail that will be important to the future story. That would defeat the importance of world building. We don&amp;#39;t know who built the mazes in Lorath, but that doesn&amp;#39;t mean those maze builders will be important in the story. It doesn&amp;#39;t mean magic was used to make the mazes. Maybe magic made those mazes. Maybe magic didn&amp;#39;t. Who knows? It was the biggest port north of the wall, but that doesn&amp;#39;t mean it was a note worthy port for a lot of traders. And of those traders who would go back to a place that is accursed?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6wrgp", "score_hidden": false, "stickied": false, "created": 1492075222.0, "created_utc": 1492046422.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6w0c7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jymhtysy", "parent_id": "t1_dg6k7lb", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "But wouldn't traders who've been there before notice the absence of an entire mountain? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But wouldn&amp;#39;t traders who&amp;#39;ve been there before notice the absence of an entire mountain? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6w0c7", "score_hidden": false, "stickied": false, "created": 1492074290.0, "created_utc": 1492045490.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6k7lb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SerPoopybutthole", "parent_id": "t1_dg6do3j", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "There's no volcano there presently in our story. Presently there is a great cliff around it with several caves. Volcanos aren't exclusive to mountainous regions. And sometimes after large eruptions volcanos collapse on themselves. It's not too difficult to imagine it collapsing into the sea and leaving a great cliff around where it broke off. If this were to happen it would make sense that said cliff would have lava caves left in it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s no volcano there presently in our story. Presently there is a great cliff around it with several caves. Volcanos aren&amp;#39;t exclusive to mountainous regions. And sometimes after large eruptions volcanos collapse on themselves. It&amp;#39;s not too difficult to imagine it collapsing into the sea and leaving a great cliff around where it broke off. If this were to happen it would make sense that said cliff would have lava caves left in it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6k7lb", "score_hidden": false, "stickied": false, "created": 1492059926.0, "created_utc": 1492031126.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6do3j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hollowaydivision", "parent_id": "t1_dg6b3bp", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "There's no volcano at Hardhome though. It's a sheltered bay, not a mountain.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s no volcano at Hardhome though. It&amp;#39;s a sheltered bay, not a mountain.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6do3j", "score_hidden": false, "stickied": false, "created": 1492053123.0, "created_utc": 1492024323.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6b3bp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SerPoopybutthole", "parent_id": "t1_dg6aarp", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "It resembles a volcanic eruption. That happens all the time. The Doom is different because it was ginormous and large amounts of land sunk into the sea and 400 hundred years later the area is still uninhabitable. Sounds to me like Hardhome is closer to a natural disaster than the Doom. Besides stuff being burned the Tragedy at Summerhall is completely different. It was a fire (possibly/probably caused by failed fire magic rituals), but it wasn't so intense that nothing was left. The ruins are supposed to still be there. Growing up Rhaegar went and hung out there. Doesnt  really seem like the same thing to me. \n\nEdit: Volcanoes erupt all the time. Doesn't mean it's an enemy action no matter how many times it happens. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It resembles a volcanic eruption. That happens all the time. The Doom is different because it was ginormous and large amounts of land sunk into the sea and 400 hundred years later the area is still uninhabitable. Sounds to me like Hardhome is closer to a natural disaster than the Doom. Besides stuff being burned the Tragedy at Summerhall is completely different. It was a fire (possibly/probably caused by failed fire magic rituals), but it wasn&amp;#39;t so intense that nothing was left. The ruins are supposed to still be there. Growing up Rhaegar went and hung out there. Doesnt  really seem like the same thing to me. &lt;/p&gt;\n\n&lt;p&gt;Edit: Volcanoes erupt all the time. Doesn&amp;#39;t mean it&amp;#39;s an enemy action no matter how many times it happens. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6b3bp", "score_hidden": false, "stickied": false, "created": 1492050464.0, "created_utc": 1492021664.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6aarp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TBB51", "parent_id": "t1_dg64v06", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;but a natural disaster 600 years ago could easily cause superstitious wildlings to think the place haunted\n\nBut the problem is, as OP has pointed out, you've got a disaster that very closely resembles the Doom of Valyria and, less closely but still pretty close, the Tragedy of Summerhall.\n\nOld rule for intel types and journalists: Once is an anomaly, twice is coincidence, three times is enemy action / a pattern.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;but a natural disaster 600 years ago could easily cause superstitious wildlings to think the place haunted&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But the problem is, as OP has pointed out, you&amp;#39;ve got a disaster that very closely resembles the Doom of Valyria and, less closely but still pretty close, the Tragedy of Summerhall.&lt;/p&gt;\n\n&lt;p&gt;Old rule for intel types and journalists: Once is an anomaly, twice is coincidence, three times is enemy action / a pattern.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6aarp", "score_hidden": false, "stickied": false, "created": 1492049651.0, "created_utc": 1492020851.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg64v06", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "SerPoopybutthole", "parent_id": "t1_dg62mgt", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Yeah at the present I'm sure there's White Walkers and wights all over the place there, but a natural disaster 600 years ago could easily cause superstitious wildlings to think the place haunted. Following a so called prophet somewhere doesn't mean something magical happened in a place. I'm not saying it's not possible, but it seems more like a red herring to me. Probably just a place where a bunch of wildlings on the run gathered making it the perfect place for the WWs to attack and building their ranks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah at the present I&amp;#39;m sure there&amp;#39;s White Walkers and wights all over the place there, but a natural disaster 600 years ago could easily cause superstitious wildlings to think the place haunted. Following a so called prophet somewhere doesn&amp;#39;t mean something magical happened in a place. I&amp;#39;m not saying it&amp;#39;s not possible, but it seems more like a red herring to me. Probably just a place where a bunch of wildlings on the run gathered making it the perfect place for the WWs to attack and building their ranks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg64v06", "score_hidden": false, "stickied": false, "created": 1492044121.0, "created_utc": 1492015321.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg62mgt", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "hollowaydivision", "parent_id": "t1_dg610a8", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I don't know. Hardhome is a very important location in both books and show.\n\n* The Free Folk followed a prophet there, and are currently awaiting rescue, just like in the show. Jon has about four chapters where he and Tormund try to figure out how to send them aid.\n\n* Cotter Pyke is currently stranded there, with the remnants of his fleet, hounded by \"dead things in the wood, dead things in the water.\"\n\n* The entirity of Jon's last chapter, up until the Pink Letter, involves Jon's very detailed plans for a rescue mission to Hardhome.\n\n* The Hardhome wildings end up in Braavos, and play a role in Arya's storyline. At minimum, we know they bring the news of the Others to the Faceless Men - and this is backed up by the Kindly Man telling her the Hardhome info is important and good to know.\n\n* And the demon-haunted past of Hardhome is mentioned multiple times in the main text, not just the worldbook.\n\nThis much foreshadowing means we're going to see Hardhome - a ressurected Jon (or someone else) will carry out the Hardhome ranging at some point in the novels, and probably come face to face with some very spooky stuff. They can't just leave Cotter Pyke hanging like that! And the past is prologue to the present, so I think the many Braavosi connections to Hardhome (Arya, Kindly Man, Tycho, Sealord) in the current timeline is not a coincidence.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know. Hardhome is a very important location in both books and show.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;The Free Folk followed a prophet there, and are currently awaiting rescue, just like in the show. Jon has about four chapters where he and Tormund try to figure out how to send them aid.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Cotter Pyke is currently stranded there, with the remnants of his fleet, hounded by &amp;quot;dead things in the wood, dead things in the water.&amp;quot;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The entirity of Jon&amp;#39;s last chapter, up until the Pink Letter, involves Jon&amp;#39;s very detailed plans for a rescue mission to Hardhome.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The Hardhome wildings end up in Braavos, and play a role in Arya&amp;#39;s storyline. At minimum, we know they bring the news of the Others to the Faceless Men - and this is backed up by the Kindly Man telling her the Hardhome info is important and good to know.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;And the demon-haunted past of Hardhome is mentioned multiple times in the main text, not just the worldbook.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;This much foreshadowing means we&amp;#39;re going to see Hardhome - a ressurected Jon (or someone else) will carry out the Hardhome ranging at some point in the novels, and probably come face to face with some very spooky stuff. They can&amp;#39;t just leave Cotter Pyke hanging like that! And the past is prologue to the present, so I think the many Braavosi connections to Hardhome (Arya, Kindly Man, Tycho, Sealord) in the current timeline is not a coincidence.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg62mgt", "score_hidden": false, "stickied": false, "created": 1492041760.0, "created_utc": 1492012960.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg610a8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SerPoopybutthole", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 1, "body": "If I had to guess I'd say it's probably just a red herring. Natural disasters happen. Some might have magical causes, but not all of them have to be magical. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I had to guess I&amp;#39;d say it&amp;#39;s probably just a red herring. Natural disasters happen. Some might have magical causes, but not all of them have to be magical. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg610a8", "score_hidden": false, "stickied": false, "created": 1492039997.0, "created_utc": 1492011197.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg7cvrg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "the-freshest-nino", "parent_id": "t1_dg6oizu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Drogos one unburnt eye is going to suddenly open in the middle of the red wastes like at the end of a horror movie to let you know that there's going to be a sequel ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Drogos one unburnt eye is going to suddenly open in the middle of the red wastes like at the end of a horror movie to let you know that there&amp;#39;s going to be a sequel &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7cvrg", "score_hidden": false, "stickied": false, "created": 1492105417.0, "created_utc": 1492076617.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg7zizh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hollowaydivision", "parent_id": "t1_dg6oizu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "o shit", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;o shit&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7zizh", "score_hidden": false, "stickied": false, "created": 1492136861.0, "created_utc": 1492108061.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6oizu", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "nreetz", "parent_id": "t1_dg6ci4x", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "When the sun rises in the west...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When the sun rises in the west...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6oizu", "score_hidden": false, "stickied": false, "created": 1492065128.0, "created_utc": 1492036328.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ci4x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Fatter_Tom", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Hey Great analysis. I think you are on to something here and it got me thinking: Could this be a set up for some event that may happen in KL later? If something similar to Cercei's actions to avoid her trial in the show happens in the books, then could some remaining hidden stash of dragon eggs in KL be triggered by some out of control wildfire and completely destroy the city in the same way as Hardholme and Valyria?\n\nThe focus of the books may at some point close completely on the politics of Westeros and focus almost entirely on the fight for the dawn, or against the Others - at least it seems like that is a very possible direction for the story. The total destruction of the symbol of the regency in Westeros, and all its players would be a great symbolic way of signifying this turn in the narrative.\n\nKL seems like it has been on the edge of stability for a while now, and while I've been waiting for the situation to figuratively blow up, based on your theory it seems like it might literally blow up! Thoughts?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey Great analysis. I think you are on to something here and it got me thinking: Could this be a set up for some event that may happen in KL later? If something similar to Cercei&amp;#39;s actions to avoid her trial in the show happens in the books, then could some remaining hidden stash of dragon eggs in KL be triggered by some out of control wildfire and completely destroy the city in the same way as Hardholme and Valyria?&lt;/p&gt;\n\n&lt;p&gt;The focus of the books may at some point close completely on the politics of Westeros and focus almost entirely on the fight for the dawn, or against the Others - at least it seems like that is a very possible direction for the story. The total destruction of the symbol of the regency in Westeros, and all its players would be a great symbolic way of signifying this turn in the narrative.&lt;/p&gt;\n\n&lt;p&gt;KL seems like it has been on the edge of stability for a while now, and while I&amp;#39;ve been waiting for the situation to figuratively blow up, based on your theory it seems like it might literally blow up! Thoughts?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6ci4x", "score_hidden": false, "stickied": false, "created": 1492051906.0, "created_utc": 1492023106.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6d0i3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "darkconfidantislife", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think that the Valyrians attacked Hardhome but met the Others there. What followed was a bloody battle that convinced the Valyrians to stay out of Westeros as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that the Valyrians attacked Hardhome but met the Others there. What followed was a bloody battle that convinced the Valyrians to stay out of Westeros as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6d0i3", "score_hidden": false, "stickied": false, "created": 1492052436.0, "created_utc": 1492023636.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6fccu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PinkFluffyRock", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I agree that the event at Hardhome definitely conjours up images and thoughts of nuclear detonation and like you say, the fall out, the deformaties and mutations caused by radiation etc. And I do like your idea.. it's very original I think!\n\nFor some reason (I think having the red comet at the back of my mind probably had something to do with it) I thought that it was caused by some kind of asteroid to be honest.. And although this could also be bright like a sun, cause devestation ash clouds etc, I don't think it would give off so much radiation as to cause malformation.. .", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that the event at Hardhome definitely conjours up images and thoughts of nuclear detonation and like you say, the fall out, the deformaties and mutations caused by radiation etc. And I do like your idea.. it&amp;#39;s very original I think!&lt;/p&gt;\n\n&lt;p&gt;For some reason (I think having the red comet at the back of my mind probably had something to do with it) I thought that it was caused by some kind of asteroid to be honest.. And although this could also be bright like a sun, cause devestation ash clouds etc, I don&amp;#39;t think it would give off so much radiation as to cause malformation.. .&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6fccu", "score_hidden": false, "stickied": false, "created": 1492054842.0, "created_utc": 1492026042.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6h2zi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LordMaxentius", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Really enjoyed your theory, sounds highly probable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Really enjoyed your theory, sounds highly probable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6h2zi", "score_hidden": false, "stickied": false, "created": 1492056619.0, "created_utc": 1492027819.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6jmlg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "redditATworkBC", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I like the theory alot.\n\nOnly thing I have to comment on is the term \"Wyrm\" which is what the \"european dragons\" in folklore go by.\n\nIf this follows the normal Wyrm trope. Then these are dragons with arms\\4 legs, as well as wings, and live underground.  Where as dragons just have two legs, and wings instead of arms, and live outside. These aren't \"worm\" like creatures like ones we have on earth.\n\n\n\nhttps://en.wikipedia.org/wiki/Wyrm\n\nwill lead you to\n\nhttps://en.wikipedia.org/wiki/European_dragon\n\n", "edited": 1492030983.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like the theory alot.&lt;/p&gt;\n\n&lt;p&gt;Only thing I have to comment on is the term &amp;quot;Wyrm&amp;quot; which is what the &amp;quot;european dragons&amp;quot; in folklore go by.&lt;/p&gt;\n\n&lt;p&gt;If this follows the normal Wyrm trope. Then these are dragons with arms\\4 legs, as well as wings, and live underground.  Where as dragons just have two legs, and wings instead of arms, and live outside. These aren&amp;#39;t &amp;quot;worm&amp;quot; like creatures like ones we have on earth.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Wyrm\"&gt;https://en.wikipedia.org/wiki/Wyrm&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;will lead you to&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/European_dragon\"&gt;https://en.wikipedia.org/wiki/European_dragon&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6jmlg", "score_hidden": false, "stickied": false, "created": 1492059274.0, "created_utc": 1492030474.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6m8dt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MommysBigBoii", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "One of the best theories in a while! Have an upvote, good ser", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One of the best theories in a while! Have an upvote, good ser&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6m8dt", "score_hidden": false, "stickied": false, "created": 1492062294.0, "created_utc": 1492033494.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6nkp2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "The_Iron_Zeppelin", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think it was a meteor impact.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it was a meteor impact.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6nkp2", "score_hidden": false, "stickied": false, "created": 1492063936.0, "created_utc": 1492035136.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6s9vl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TeamPangloss", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "A great read, thank you. I'm not sure I'm convinced however that GRRM wrote it deliberately to evoke nuclear weapon imagery though. The things you have quoted sound more like he's trying to make the reader think of a meteor impact, in my opinion. There's definitely *something* to it though and the link between Hardhome, The Doom and the FM is compelling.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A great read, thank you. I&amp;#39;m not sure I&amp;#39;m convinced however that GRRM wrote it deliberately to evoke nuclear weapon imagery though. The things you have quoted sound more like he&amp;#39;s trying to make the reader think of a meteor impact, in my opinion. There&amp;#39;s definitely &lt;em&gt;something&lt;/em&gt; to it though and the link between Hardhome, The Doom and the FM is compelling.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6s9vl", "score_hidden": false, "stickied": false, "created": 1492069749.0, "created_utc": 1492040949.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6vkfe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "orosedobheathabhaile", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "HOLY SHIT", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;HOLY SHIT&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6vkfe", "score_hidden": false, "stickied": false, "created": 1492073742.0, "created_utc": 1492044942.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6zmqx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Edwin_Chalmers", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "This perhaps ties in with the supposed faceless man at the Citadel who stole the archmaesters key. Maybe he's looking for information into how to denonate an egg?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This perhaps ties in with the supposed faceless man at the Citadel who stole the archmaesters key. Maybe he&amp;#39;s looking for information into how to denonate an egg?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6zmqx", "score_hidden": false, "stickied": false, "created": 1492078785.0, "created_utc": 1492049985.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg730zw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Zine-Rex", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I could believe Hardhome was touched by ration, but the connection to the FM doesn't resonate to me. While the Doom seems strongly implied to be a nuclear cesspit, again the direct will of the FM doesn't seem like the clearest answer to \"why\" per say. \n\nThe FM origins are connected to Old Valyria, certainly. However... nuclear devistation doesn't nessesarily jive with their philosophy. Life needs to exist in the first place in order to receive \"the gift\" of death. Heavily irradiated life is a life of only suffering for generations or possibly, to extinction/extropation. The effects of heavy fallout and radiation prevents life from existing at all, which is not nessesarily what the FM desire, nor what the God of Death would even make sense in the context of. Valyria would be an expection, possibly, so as to go down in history as epic assholes who got the violence they doled out thrown back in their faces.\n\nI also believe the Doom had a geologic execution, though possibly a supernatural trigger. Clearly, Valyria rested on geologically active area. It would be interesting to examine the geomorphology of the Known World. If the area of Hardhome were corrilated to the rough area that Westeros is to its real world counter parts in Europe, then that's actually a very tectonically stable area. But then again, that wouldn't explain the activity around Dragonstone, as I think that it's pretty isolated in in terms of volcanic activity? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I could believe Hardhome was touched by ration, but the connection to the FM doesn&amp;#39;t resonate to me. While the Doom seems strongly implied to be a nuclear cesspit, again the direct will of the FM doesn&amp;#39;t seem like the clearest answer to &amp;quot;why&amp;quot; per say. &lt;/p&gt;\n\n&lt;p&gt;The FM origins are connected to Old Valyria, certainly. However... nuclear devistation doesn&amp;#39;t nessesarily jive with their philosophy. Life needs to exist in the first place in order to receive &amp;quot;the gift&amp;quot; of death. Heavily irradiated life is a life of only suffering for generations or possibly, to extinction/extropation. The effects of heavy fallout and radiation prevents life from existing at all, which is not nessesarily what the FM desire, nor what the God of Death would even make sense in the context of. Valyria would be an expection, possibly, so as to go down in history as epic assholes who got the violence they doled out thrown back in their faces.&lt;/p&gt;\n\n&lt;p&gt;I also believe the Doom had a geologic execution, though possibly a supernatural trigger. Clearly, Valyria rested on geologically active area. It would be interesting to examine the geomorphology of the Known World. If the area of Hardhome were corrilated to the rough area that Westeros is to its real world counter parts in Europe, then that&amp;#39;s actually a very tectonically stable area. But then again, that wouldn&amp;#39;t explain the activity around Dragonstone, as I think that it&amp;#39;s pretty isolated in in terms of volcanic activity? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg730zw", "score_hidden": false, "stickied": false, "created": 1492083298.0, "created_utc": 1492054498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg79fyv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Meehl", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "That dragon eggs might be latent bombs also provides an in-world mechanism for how the arm of dorne was broken. the \"magic\" of the cotf was the magic to pop the eggs. otherwise, the cotf did it but \"you know, the magic of the magical beings. don't worry about it, it's magic.\" that meteors cause these explosions is an out world deux ex machina. \n\n\nA few months ago there was a post here about why the sky cells were designed so strangely for a jail. Really impractical.  I joked that the sky cells were for dragon nests so that the eggs would roll out and fall from a great height, thus charging them with massive energy. suppose that works, and then you carry egg the hardhome, or arm of dorne, or whatever. then, trigger it. \n\nI wonder what was going on with the vale 600 years earlier. who was in charge and what motives did they have?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That dragon eggs might be latent bombs also provides an in-world mechanism for how the arm of dorne was broken. the &amp;quot;magic&amp;quot; of the cotf was the magic to pop the eggs. otherwise, the cotf did it but &amp;quot;you know, the magic of the magical beings. don&amp;#39;t worry about it, it&amp;#39;s magic.&amp;quot; that meteors cause these explosions is an out world deux ex machina. &lt;/p&gt;\n\n&lt;p&gt;A few months ago there was a post here about why the sky cells were designed so strangely for a jail. Really impractical.  I joked that the sky cells were for dragon nests so that the eggs would roll out and fall from a great height, thus charging them with massive energy. suppose that works, and then you carry egg the hardhome, or arm of dorne, or whatever. then, trigger it. &lt;/p&gt;\n\n&lt;p&gt;I wonder what was going on with the vale 600 years earlier. who was in charge and what motives did they have?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg79fyv", "score_hidden": false, "stickied": false, "created": 1492095327.0, "created_utc": 1492066527.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg7j756", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LoraxPopularFront", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "The fact that fire wyrms lived among volcanoes does not even a little bit suggest that this volcanism isn't natural. You have no basis whatsoever for eliminating \"natural cataclysm\" from the possible causes, certainly not on the grounds that there were some wyrms hanging around.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The fact that fire wyrms lived among volcanoes does not even a little bit suggest that this volcanism isn&amp;#39;t natural. You have no basis whatsoever for eliminating &amp;quot;natural cataclysm&amp;quot; from the possible causes, certainly not on the grounds that there were some wyrms hanging around.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7j756", "score_hidden": false, "stickied": false, "created": 1492118707.0, "created_utc": 1492089907.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg7o4wy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sixfeetunder", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Great theory OP, very well put together.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great theory OP, very well put together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7o4wy", "score_hidden": false, "stickied": false, "created": 1492124720.0, "created_utc": 1492095920.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg946kr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "flossandbrush", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I always figured hardhome and the doom were massive volcanic events. \n\nFor a real life example check out the 1783 eruption of the Icelandic volcano laki. Some 15 cubic kilometers of lava. Acid rain that killed 60% of the livestock on the entire island and left the landscape charred. Weather effects on a global scale and famine as far away as Egypt. Inuit traditions even specifically speak of a \"summer that did not come\"\n\nhttps://www.wired.com/2013/06/local-and-global-impacts-1793-laki-eruption-iceland/\n\nThe screaming caves could be steam from lava mixing with water. The cannibalism would likely be a result of famine driven desperation. \n\nI believe GRRM has already stated that there is a magical component to Planetos weather. I'm not convinced that egg-nukes are the answer... but if it holds true that dragons are the \"furnaces of the world\". Then surely they have some role to play in keeping the natural balance. Messing with that balance, like for instance killing a bunch of dragons, would have unforeseen consequences. \n\nOn the other hand I wouldn't be surprised if the Valyrians had tapped into geothermal heating, botched the install, and their furnace exploded.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always figured hardhome and the doom were massive volcanic events. &lt;/p&gt;\n\n&lt;p&gt;For a real life example check out the 1783 eruption of the Icelandic volcano laki. Some 15 cubic kilometers of lava. Acid rain that killed 60% of the livestock on the entire island and left the landscape charred. Weather effects on a global scale and famine as far away as Egypt. Inuit traditions even specifically speak of a &amp;quot;summer that did not come&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.wired.com/2013/06/local-and-global-impacts-1793-laki-eruption-iceland/\"&gt;https://www.wired.com/2013/06/local-and-global-impacts-1793-laki-eruption-iceland/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The screaming caves could be steam from lava mixing with water. The cannibalism would likely be a result of famine driven desperation. &lt;/p&gt;\n\n&lt;p&gt;I believe GRRM has already stated that there is a magical component to Planetos weather. I&amp;#39;m not convinced that egg-nukes are the answer... but if it holds true that dragons are the &amp;quot;furnaces of the world&amp;quot;. Then surely they have some role to play in keeping the natural balance. Messing with that balance, like for instance killing a bunch of dragons, would have unforeseen consequences. &lt;/p&gt;\n\n&lt;p&gt;On the other hand I wouldn&amp;#39;t be surprised if the Valyrians had tapped into geothermal heating, botched the install, and their furnace exploded.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg946kr", "score_hidden": false, "stickied": false, "created": 1492204831.0, "created_utc": 1492176031.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dga8nyy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Saratje", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I'm more inclined to believe it's something more simple, if only because of occam's razor.\n\nEither:\n\n* There's volcanic activity beyond the wall. Dragonglass has been found beyond the wall and dragonglass is obsidian. Obsidian is better known to us layfolk as volcanic glass. Volcanic activity could also be what brings an end to each winter. Volcanic activity may also heat up underground water sources and the generic temperature in the area, making Hardhome's location a logical choice for a settlement because of having favorable conditions. Thus Hardhome being destroyed by a volcano isn't dumb luck, the area was favorable until that volcano erupted.\n\nor\n\n* Someone burned Hardhome down on purpose. There'd be plenty of opponents to a place like Hardhome, in particular freefolk tribes who live off raiding and cannibalism. Once Hardhome would be a proper town with strong walls, constantly growing, these tribes would be able to do little against such a settlement. Thus, they may have burned it down during the night while it was still possibly to do so.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m more inclined to believe it&amp;#39;s something more simple, if only because of occam&amp;#39;s razor.&lt;/p&gt;\n\n&lt;p&gt;Either:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;There&amp;#39;s volcanic activity beyond the wall. Dragonglass has been found beyond the wall and dragonglass is obsidian. Obsidian is better known to us layfolk as volcanic glass. Volcanic activity could also be what brings an end to each winter. Volcanic activity may also heat up underground water sources and the generic temperature in the area, making Hardhome&amp;#39;s location a logical choice for a settlement because of having favorable conditions. Thus Hardhome being destroyed by a volcano isn&amp;#39;t dumb luck, the area was favorable until that volcano erupted.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;or&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Someone burned Hardhome down on purpose. There&amp;#39;d be plenty of opponents to a place like Hardhome, in particular freefolk tribes who live off raiding and cannibalism. Once Hardhome would be a proper town with strong walls, constantly growing, these tribes would be able to do little against such a settlement. Thus, they may have burned it down during the night while it was still possibly to do so.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dga8nyy", "score_hidden": false, "stickied": false, "created": 1492256827.0, "created_utc": 1492228027.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_64ypnu", "likes": null, "replies": "", "user_reports": [], "id": "dg6m96v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Black_Sin", "parent_id": "t1_dg66vn9", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "The strength in this theory is that it links back Euron and Oldtown. \n\nAnd it make sense. \n\n\"Fire made flesh.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The strength in this theory is that it links back Euron and Oldtown. &lt;/p&gt;\n\n&lt;p&gt;And it make sense. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Fire made flesh.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg6m96v", "score_hidden": false, "stickied": false, "created": 1492062320.0, "created_utc": 1492033520.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66vn9", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Mithras_Stoneborn", "parent_id": "t3_64ypnu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I disagree. The Doom of Valyria was a volcanic event of biblical proportions. The Valyrian sorcerers were using their magic to keep the Fourteen Flames tame so that their slaves could mine the great riches of the earth. I also think that the gold and other precious material cannot be the only reason why the Valyrians might go through so much magical effort to meddle with volcanoes. I believe they were mainly doing this to breed dragons. Maybe those firewyrms were necessary to create dragons. Whatever the true reasons are, the Valyrians mages that were regularly renewing the magic rituals to keep the Fourteen Flames from explosion were killed as a result of inner Valyrian political machinations. I do not doubt that the Faceless Men were used to assasinate these mages. I also would not be surprised if some Valyrian Families created the Faceless Men as the magic of the Faceless Men is strong. Targaryens seemed to be the only winners of the Doom and they get along with Braavos very well.\n\nAs for Hardhome, maybe someone wanted to create dragons and to do that they needed to get access to fyrewyrms coming from the mantle of the earth. Maybe they managed to create a dragon or maybe not. Maybe the Faceless Men tried to create their own dragon to break the monopoly of the Valyrians. Maybe this trial broke the supposed pact between the Others and humans because this was done North of the Wall. In the end, this trial ended with an explosion. ", "edited": 1492024304.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I disagree. The Doom of Valyria was a volcanic event of biblical proportions. The Valyrian sorcerers were using their magic to keep the Fourteen Flames tame so that their slaves could mine the great riches of the earth. I also think that the gold and other precious material cannot be the only reason why the Valyrians might go through so much magical effort to meddle with volcanoes. I believe they were mainly doing this to breed dragons. Maybe those firewyrms were necessary to create dragons. Whatever the true reasons are, the Valyrians mages that were regularly renewing the magic rituals to keep the Fourteen Flames from explosion were killed as a result of inner Valyrian political machinations. I do not doubt that the Faceless Men were used to assasinate these mages. I also would not be surprised if some Valyrian Families created the Faceless Men as the magic of the Faceless Men is strong. Targaryens seemed to be the only winners of the Doom and they get along with Braavos very well.&lt;/p&gt;\n\n&lt;p&gt;As for Hardhome, maybe someone wanted to create dragons and to do that they needed to get access to fyrewyrms coming from the mantle of the earth. Maybe they managed to create a dragon or maybe not. Maybe the Faceless Men tried to create their own dragon to break the monopoly of the Valyrians. Maybe this trial broke the supposed pact between the Others and humans because this was done North of the Wall. In the end, this trial ended with an explosion. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg66vn9", "score_hidden": false, "stickied": false, "created": 1492046197.0, "created_utc": 1492017397.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]