[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "asoiaf", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;&amp;quot;Plot Gravity Wells&amp;quot; comes from &lt;a href=\"/u/bookshelfstud\"&gt;/u/bookshelfstud&lt;/a&gt;&amp;#39;s excellent piece &lt;a href=\"https://offmichaelsbookshelf.wordpress.com/2016/02/24/return-of-the-white-wolf-jon-is-coming-back/\"&gt;&amp;quot;The Return of the White Wolf.&amp;quot;&lt;/a&gt; That essay is #RealGood. Take and read.&lt;/em&gt;&lt;/p&gt;\n\n&lt;h2&gt;Intro&lt;/h2&gt;\n\n&lt;p&gt;Starting in &lt;em&gt;A Feast for Crows&lt;/em&gt; and &lt;em&gt;A Dance with Dragons&lt;/em&gt;, GRRM has started to bring the disparate threads of his storyline together. Where Martin has talked about how he intended for the first book to resemble &lt;em&gt;The Lord of the Rings&lt;/em&gt; in having most of his characters begin at Winterfell and then spread out across the world, the 4th and 5th books of the series have begun the process of bringing the threads back together.&lt;/p&gt;\n\n&lt;p&gt;In &lt;em&gt;The Winds of Winter&lt;/em&gt;, Martin further intends to start bringing the threads back together. In a 2012 interview, GRRM stated:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;All of the POVs will be returning: “All the characters [are in the book],” he promised. “I’m going to start pulling the threads back together in this one, I hope.” – &lt;a href=\"http://www.mtv.com/news/articles/1694594/game-of-thrones-season-three-george-rr-martin-richard-madden.jhtml\"&gt;MTV interview, 10/2/2012&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What this means precisely has yet to be seen, however, we can make estimated guesses on how Martin will bring the threads back together and how he’ll weave the characters, their plots and their struggles into a narrative that will likely center everything in several geographical plot gravity wells in 4 major locations:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Meereen&lt;/li&gt;\n&lt;li&gt;Winterfell&lt;/li&gt;\n&lt;li&gt;King’s Landing&lt;/li&gt;\n&lt;li&gt;Volantis&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;In this analysis, I’d like to explore the intersections at these geographic areas, how they likely impact the writing speed and processes that GRRM experiences in writing TWOW and the myriad plots that are, will or might occur in these places.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;h2&gt;The Meereense Knot, Part 2&lt;/h2&gt;\n\n&lt;p&gt;George RR Martin stated numerous times that the biggest hurdle in writing &lt;em&gt;A Dance with Dragons&lt;/em&gt; was something he termed the &amp;quot;Meereenese Knot.&amp;quot; Essentially, this was a writing problem derived from numerous characters and events revolving around Daenerys Targaryen and Meereen. For the longest time, GRRM was vague about what exactly the Meereenese Knot was, but in 2012, he opened up about it:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Now that we know how the &amp;quot;Meereenese knot&amp;quot; played out, what was the problem with this? For example, was it the order in which Dany met various characters, or who, when, and how someone would try to take the dragons?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;GRRM:&lt;/strong&gt; Now I can explain things. It was a confluence of many, many factors: lets start with the offer from Xaro to give Dany ships, the refusal of which then leads to Qarth&amp;#39;s declaration of war. Then there&amp;#39;s the marriage of Daenerys to pacify the city. Then there&amp;#39;s the arrival of the Yunkish army at the gates of Meereen, there&amp;#39;s the order of arrival of various people going her way (Tyrion, Quentyn, Victarion, Aegon, Marwyn, etc.), and then there&amp;#39;s Daario, this dangerous sellsword and the question of whether Dany really wants him or not, there&amp;#39;s hte plague, there&amp;#39;s Drogon&amp;#39;s return to Meereen...&lt;/p&gt;\n\n&lt;p&gt;All of these things were balls I had thrown up into the air, and they&amp;#39;re all linked and chronologically entwined. The return of Drogon to the city was something I explored as happening at different times. For example, I wrote three different versions of Quentyn&amp;#39;s arrival at Meereen: one where he arrived long before Dany&amp;#39;s marriage, one where he arrived much later, and one where he arrived just the day before the marriage (which is how it ended up being in the novel). And I had to write all three versions to be able to compare and see how these different arrival points affected the stories of the other characters. Including the story of a character who actually hasn&amp;#39;t arrived yet. - &lt;a href=\"https://www.westeros.org/Citadel/SSM/Entry/Asshai.com_Interview_in_Barcelona/\"&gt;So Spake Martin, 7/22/2012&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;GRRM &amp;quot;solved&amp;quot; the Meereenese Knot by &lt;a href=\"http://www.mtv.com/news/2622896/george-rr-martin-on-pov-and-the-meereenese-knot/\"&gt;adding Barristan Selmy as a POV character late in ADWD&lt;/a&gt;, but the reality is that the knot was not entirely cut by the end of ADWD. There are several characters who have not arrived in Meereen by the end of ADWD. Namely, Victarion Greyjoy and Marwyn the Mage haven’t quite made it to Meereen. Victarion &lt;em&gt;does&lt;/em&gt; arrive in Meereen at the start of TWOW, but Marwyn is still absent.&lt;/p&gt;\n\n&lt;p&gt;Above all that, Daenerys Targaryen, the woman that everyone was seeking, is now gone from Meereen and is up in the Dothraki Sea somewhere. If TWOW parallels the plot from GoT, S06, it&amp;#39;s likely that her journey will take her to Vaes Dothrak before she returns to Meereen.&lt;/p&gt;\n\n&lt;p&gt;From my vantage point, the major plot points GRRM will or might address in the Meereenese Knot Part 2 are as follows:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Major plot-points&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;The Battle of Fire&lt;/strong&gt;: Meereen and Yunkai &amp;amp; her allies at war, the Volantene Fleet on its way with Tyrion, Barristan and Victarion on 3 sides of the conflict and their lives at stake.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Fallout from the Battle of Fire&lt;/strong&gt;: the situation inside Meereen, Sons of the Harpy, the internal politics of Meereen, the post-battle relationship between Yunkai and Meereen&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The Return of Daenerys to Meereen&lt;/strong&gt;: Will the Dragon Queen make it back to Meereen? What will be her reaction to Yunkai (and Barristan/Shavepate) breaking the peace? Who will Daenerys be when she returns?&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Middling to Minor Plot-Points&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;The Arrival of Marwyn in Meereen&lt;/strong&gt;: What will the Archmaester&amp;#39;s relationship be to the characters in Meereen? Will he come into conflict with someone like Moqorro?&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The Fates of the Sellswords&lt;/strong&gt;: Daario, the Tattered Prince and Brown Ben Plumm look to have some role in post-battle Meereen. What will it be?&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Penny and Jorah&lt;/strong&gt;: Will both survive the battle? Will Dany take Jorah back into her service?&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The Dornish Knights&lt;/strong&gt;: Will they survive the Battle of Fire? If they do, will they return to Dorne? What type of message will they bring back to Doran regarding the death of Quentyn? &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;As you can see above, the convergence of characters and storylines looks like another Meereenese Knot. But here, the ramifications of events in Meereen will blossom out from Slaver&amp;#39;s Bay to impact many other areas besides Meereen. Dorne, Pentos, Yunkai and Volantis will be impacted. &lt;/p&gt;\n\n&lt;p&gt;How do you see the plot unfolding for these plot-lines? How will he resolve them? Will he resolve them?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;h2&gt;The Winterfell Knot&lt;/h2&gt;\n\n&lt;p&gt;In the North, multiple POV characters are converging or possibly converge on Winterfell. The largest event set to occur in the North is a battle between Stannis Baratheon and Roose Bolton that looks to kick off at the Crofter&amp;#39;s Village and possibly spill over to Winterfell. At the Crofter&amp;#39;s Village, Asha and Theon Greyjoy look to be our primary POVs for the battles themselves.&lt;/p&gt;\n\n&lt;p&gt;However, there&amp;#39;s more occurring than the simple battle at Winterfell. Multiple characters and storylines are or are pointing to Winterfell:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Major Plot-Points&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;The Battle of Ice/Winterfell:&lt;/strong&gt; The clash between Stannis and Roose with Theon, Asha and possibly Bran as our POVs&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Aftermath of the Battle of Winterfell:&lt;/strong&gt; Does Stannis or Roose come out triumphant? What will their relationship be with the other northmen in and around Winterfell?&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Davos&amp;#39; search for Rickon:&lt;/strong&gt; Davos is searching for Rickon in Skagos and intending to bring him back to the mainland. Will he find him? What will Rickon be like? &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Jon Snow&amp;#39;s Death, Resurrection and March to Winterfell:&lt;/strong&gt; Jon&amp;#39;s last moments are filled with a desire to march on Winterfell to kill Ramsay and rescue his &amp;quot;sister.&amp;quot; His death and coming resurrection will likely solidify this desire on Jon&amp;#39;s part. And what will become of Robb&amp;#39;s will naming Jon as heir? Will the North abandon Stannis or Roose if this becomes widely-known?&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Sansa and Littlefinger:&lt;/strong&gt; At the end of AFFC, Littlefinger dramatically reveals his plan to wed Sansa Stark to Harry the Heir and invade the North with the swords of the Vale. They will likely come to Winterfell barring a GRRM curveball.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The Others are coming&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Middling to Minor Plot-Points&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;The Fate of Jeyne Poole:&lt;/strong&gt; Stannis dispatches Alysanne Mormont and Jeyne Poole to Castle Black just prior to the Battle of Ice. What becomes of Jeyne?&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Ironborn at Torrhen&amp;#39;s Square:&lt;/strong&gt; Dagmer Cleftjaw retook Torrhen&amp;#39;s Square. It&amp;#39;s the last Ironborn hold-out in the North. Will it play any role in any of the storylines in and around Winterfell?&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Justin Massey sent to Braavos:&lt;/strong&gt; Stannis dispatches Massey to Braavos to hire sellswords. Will he be successful? Will he encounter Arya in Braavos?&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Again, numerous POVs and storylines converging or departing from Winterfell. How do you see the action unfolding?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;h2&gt;The King&amp;#39;s Landing Conflagration&lt;/h2&gt;\n\n&lt;p&gt;Our third knot centers on King&amp;#39;s Landing. There, the storylines of Cersei, Aegon, Jon Connington and Arianne seem to be moving there. Though a lot of action is set to occur in the Stormlands early in TWOW, King&amp;#39;s Landing will likely be the final setpiece for these POVs/storylines. The importance, then, in King&amp;#39;s Landing relies on it being the seat of power, the center of gravity for the politics of the realm. Controlling King&amp;#39;s Landing and sitting the Iron Throne means we&amp;#39;ll go beyond just two POVs (Counting Kevan&amp;#39;s ADWD Epilogue) in the city to several more.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Major Plot-Points&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Aegon&amp;#39;s crusade for the Iron Throne:&lt;/strong&gt; Young Griff and the Golden Company have landed in Westeros and taken several castles along the coast. They&amp;#39;ve even taken Storm&amp;#39;s End. The ultimate goal is King&amp;#39;s Landing and the Iron Throne. Will they succeed? Fail?&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Cersei&amp;#39;s Shenanigans:&lt;/strong&gt; Cersei&amp;#39;s Trial by Battle, her conflict with the Tyrells, Faith Militant, everyone. &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Fallout from Kevan and Pycelle&amp;#39;s deaths&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The Faith Militant:&lt;/strong&gt; The High Sparrow is growing powerful, Tyene Sand is sent to infiltrate the Faith Militant, do they back Aegon?&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Jon Connington and the Greyscale:&lt;/strong&gt; Does JonCon cause a greyscale outbreak? What impact will greyscale have on JonCon?&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Arianne and Aegon:&lt;/strong&gt; Does the Dornish Princess seduce and win over Aegon? Do they marry? Does Arianne bring Dorne into war with the Iron Throne&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Middling to Minor Plot-Points&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Nymeria Sand on the Small Council:&lt;/strong&gt; Lady Nym is coming to take the Dornish Seat on the small council. What will her role be in the small council?&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;What happened to Loras?&lt;/strong&gt; Loras is reportedly badly wounded on Dragonstone. Will he survive? Will he return to TWOW?&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The Rosby Inheritance:&lt;/strong&gt; Who&amp;#39;s putting forward claims to Rosby?&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Give me your best &amp;quot;Here&amp;#39;s how this event will go down&amp;quot; or &amp;quot;Here&amp;#39;s how GRRM will resolve this plot!&amp;quot;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;h2&gt;The Volantene Revolution&lt;/h2&gt;\n\n&lt;p&gt;In ADWD, Volantis becomes a major setpiece in the narrative. POV Characters as far afield as Tyrion, Quentyn, Jon Connington and Victarion visit the city and bring their unique perspectives into the city. What comes out of this is a fascinating picture of a city about to embark on a foreign war while an internal revolution by slaves and freedmen looms large. Eventually, I might have a more substantive piece on Volants in TWOW, but for now, let&amp;#39;s talk bullet points, because the people love bullet-points:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Major Plot-Points&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Volantis sent a fleet of ships crewed by slaves to Meereen:&lt;/strong&gt; Yeah, that&amp;#39;s going to be interesting. Will the slaves rebel? Fight for Daenerys? Throw off their chains and give Dany the ships she needs to invade Westeros? (Yes)&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The Volantene Revolution:&lt;/strong&gt; 4 of 5 people in Volantis are slaves. Meanwhile, the high priest of R&amp;#39;hllor in Volantis (Benerro) believes that Dany is Azor Ahai Reborn. Shit&amp;#39;s going down.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dany will likely come to Volantis&lt;/strong&gt;: Given the Widow on the Waterfront&amp;#39;s conversation with Tyrion and Moqorro&amp;#39;s entry into Dany&amp;#39;s storyline, Dany will come to Volantis? Will she burnidate the city? Part of the city?&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The Dany/Tyrion intersection:&lt;/strong&gt; Martin said that Dany and Tyrion would be apart for much of TWOW, but they would &amp;quot;intersect&amp;quot; later in TWOW. I think this will go down in Volantis. How will it unfold? Will Aegon come up?&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Will Arya come to Volantis?&lt;/strong&gt; One theory I&amp;#39;ve seen batted around is that Arya will make her way to Volantis and join up with Dany&amp;#39;s crew.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Middling to Minor Plot-Points&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Who won the election in Volantis?&lt;/strong&gt; Did the Tigers take two of the three triarch positions?&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Obviously, much of the above is speculative given that we&amp;#39;ve seen no sample chapters set in Volantis, but given the emphasis Martin placed in the city, it&amp;#39;s likely this will be a major setpiece in TWOW. How will events go down? What happens in Volantis?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;h2&gt;Conclusion&lt;/h2&gt;\n\n&lt;p&gt;Unsettling as it is, Martin has written himself into about 4 major knots that potentially rival the difficulty and complexity of the Meereenese Knot from ADWD. Additionally, though not included in this piece, Samwell and Aeron might be converging in and around Oldtown. &lt;/p&gt;\n\n&lt;p&gt;So, how does Martin writes his way out of these knots? How will these major geographic centers of gravity impact the plot? Which storylines are you looking forward to? Let me know in the comments below!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "*\"Plot Gravity Wells\" comes from /u/bookshelfstud's excellent piece [\"The Return of the White Wolf.\"](https://offmichaelsbookshelf.wordpress.com/2016/02/24/return-of-the-white-wolf-jon-is-coming-back/) That essay is #RealGood. Take and read.*\n\n##Intro\n\nStarting in *A Feast for Crows* and *A Dance with Dragons*, GRRM has started to bring the disparate threads of his storyline together. Where Martin has talked about how he intended for the first book to resemble *The Lord of the Rings* in having most of his characters begin at Winterfell and then spread out across the world, the 4th and 5th books of the series have begun the process of bringing the threads back together.\n\nIn *The Winds of Winter*, Martin further intends to start bringing the threads back together. In a 2012 interview, GRRM stated:\n\n&gt; All of the POVs will be returning: “All the characters [are in the book],” he promised. “I’m going to start pulling the threads back together in this one, I hope.” – [MTV interview, 10/2/2012]( http://www.mtv.com/news/articles/1694594/game-of-thrones-season-three-george-rr-martin-richard-madden.jhtml)\n\nWhat this means precisely has yet to be seen, however, we can make estimated guesses on how Martin will bring the threads back together and how he’ll weave the characters, their plots and their struggles into a narrative that will likely center everything in several geographical plot gravity wells in 4 major locations:\n\n- Meereen\n- Winterfell\n- King’s Landing\n- Volantis\n\nIn this analysis, I’d like to explore the intersections at these geographic areas, how they likely impact the writing speed and processes that GRRM experiences in writing TWOW and the myriad plots that are, will or might occur in these places.\n***\n##The Meereense Knot, Part 2\n\nGeorge RR Martin stated numerous times that the biggest hurdle in writing *A Dance with Dragons* was something he termed the \"Meereenese Knot.\" Essentially, this was a writing problem derived from numerous characters and events revolving around Daenerys Targaryen and Meereen. For the longest time, GRRM was vague about what exactly the Meereenese Knot was, but in 2012, he opened up about it:\n\n&gt; Now that we know how the \"Meereenese knot\" played out, what was the problem with this? For example, was it the order in which Dany met various characters, or who, when, and how someone would try to take the dragons?\n\n&gt; **GRRM:** Now I can explain things. It was a confluence of many, many factors: lets start with the offer from Xaro to give Dany ships, the refusal of which then leads to Qarth's declaration of war. Then there's the marriage of Daenerys to pacify the city. Then there's the arrival of the Yunkish army at the gates of Meereen, there's the order of arrival of various people going her way (Tyrion, Quentyn, Victarion, Aegon, Marwyn, etc.), and then there's Daario, this dangerous sellsword and the question of whether Dany really wants him or not, there's hte plague, there's Drogon's return to Meereen...\n\n&gt; All of these things were balls I had thrown up into the air, and they're all linked and chronologically entwined. The return of Drogon to the city was something I explored as happening at different times. For example, I wrote three different versions of Quentyn's arrival at Meereen: one where he arrived long before Dany's marriage, one where he arrived much later, and one where he arrived just the day before the marriage (which is how it ended up being in the novel). And I had to write all three versions to be able to compare and see how these different arrival points affected the stories of the other characters. Including the story of a character who actually hasn't arrived yet. - [So Spake Martin, 7/22/2012](https://www.westeros.org/Citadel/SSM/Entry/Asshai.com_Interview_in_Barcelona/)\n\nGRRM \"solved\" the Meereenese Knot by [adding Barristan Selmy as a POV character late in ADWD](http://www.mtv.com/news/2622896/george-rr-martin-on-pov-and-the-meereenese-knot/), but the reality is that the knot was not entirely cut by the end of ADWD. There are several characters who have not arrived in Meereen by the end of ADWD. Namely, Victarion Greyjoy and Marwyn the Mage haven’t quite made it to Meereen. Victarion *does* arrive in Meereen at the start of TWOW, but Marwyn is still absent.\n\nAbove all that, Daenerys Targaryen, the woman that everyone was seeking, is now gone from Meereen and is up in the Dothraki Sea somewhere. If TWOW parallels the plot from GoT, S06, it's likely that her journey will take her to Vaes Dothrak before she returns to Meereen.\n\nFrom my vantage point, the major plot points GRRM will or might address in the Meereenese Knot Part 2 are as follows:\n\n**Major plot-points**\n\n- **The Battle of Fire**: Meereen and Yunkai &amp; her allies at war, the Volantene Fleet on its way with Tyrion, Barristan and Victarion on 3 sides of the conflict and their lives at stake.\n- **Fallout from the Battle of Fire**: the situation inside Meereen, Sons of the Harpy, the internal politics of Meereen, the post-battle relationship between Yunkai and Meereen\n- **The Return of Daenerys to Meereen**: Will the Dragon Queen make it back to Meereen? What will be her reaction to Yunkai (and Barristan/Shavepate) breaking the peace? Who will Daenerys be when she returns?\n\n**Middling to Minor Plot-Points**\n\n- **The Arrival of Marwyn in Meereen**: What will the Archmaester's relationship be to the characters in Meereen? Will he come into conflict with someone like Moqorro?\n- **The Fates of the Sellswords**: Daario, the Tattered Prince and Brown Ben Plumm look to have some role in post-battle Meereen. What will it be?\n- **Penny and Jorah**: Will both survive the battle? Will Dany take Jorah back into her service?\n- **The Dornish Knights**: Will they survive the Battle of Fire? If they do, will they return to Dorne? What type of message will they bring back to Doran regarding the death of Quentyn? \n\nAs you can see above, the convergence of characters and storylines looks like another Meereenese Knot. But here, the ramifications of events in Meereen will blossom out from Slaver's Bay to impact many other areas besides Meereen. Dorne, Pentos, Yunkai and Volantis will be impacted. \n\nHow do you see the plot unfolding for these plot-lines? How will he resolve them? Will he resolve them?\n***\n##The Winterfell Knot\n\nIn the North, multiple POV characters are converging or possibly converge on Winterfell. The largest event set to occur in the North is a battle between Stannis Baratheon and Roose Bolton that looks to kick off at the Crofter's Village and possibly spill over to Winterfell. At the Crofter's Village, Asha and Theon Greyjoy look to be our primary POVs for the battles themselves.\n\nHowever, there's more occurring than the simple battle at Winterfell. Multiple characters and storylines are or are pointing to Winterfell:\n\n**Major Plot-Points**\n\n- **The Battle of Ice/Winterfell:** The clash between Stannis and Roose with Theon, Asha and possibly Bran as our POVs\n- **Aftermath of the Battle of Winterfell:** Does Stannis or Roose come out triumphant? What will their relationship be with the other northmen in and around Winterfell?\n- **Davos' search for Rickon:** Davos is searching for Rickon in Skagos and intending to bring him back to the mainland. Will he find him? What will Rickon be like? \n- **Jon Snow's Death, Resurrection and March to Winterfell:** Jon's last moments are filled with a desire to march on Winterfell to kill Ramsay and rescue his \"sister.\" His death and coming resurrection will likely solidify this desire on Jon's part. And what will become of Robb's will naming Jon as heir? Will the North abandon Stannis or Roose if this becomes widely-known?\n- **Sansa and Littlefinger:** At the end of AFFC, Littlefinger dramatically reveals his plan to wed Sansa Stark to Harry the Heir and invade the North with the swords of the Vale. They will likely come to Winterfell barring a GRRM curveball.\n- **The Others are coming**\n\n**Middling to Minor Plot-Points**\n\n- **The Fate of Jeyne Poole:** Stannis dispatches Alysanne Mormont and Jeyne Poole to Castle Black just prior to the Battle of Ice. What becomes of Jeyne?\n- **Ironborn at Torrhen's Square:** Dagmer Cleftjaw retook Torrhen's Square. It's the last Ironborn hold-out in the North. Will it play any role in any of the storylines in and around Winterfell?\n- **Justin Massey sent to Braavos:** Stannis dispatches Massey to Braavos to hire sellswords. Will he be successful? Will he encounter Arya in Braavos?\n\nAgain, numerous POVs and storylines converging or departing from Winterfell. How do you see the action unfolding?\n***\n##The King's Landing Conflagration\n\nOur third knot centers on King's Landing. There, the storylines of Cersei, Aegon, Jon Connington and Arianne seem to be moving there. Though a lot of action is set to occur in the Stormlands early in TWOW, King's Landing will likely be the final setpiece for these POVs/storylines. The importance, then, in King's Landing relies on it being the seat of power, the center of gravity for the politics of the realm. Controlling King's Landing and sitting the Iron Throne means we'll go beyond just two POVs (Counting Kevan's ADWD Epilogue) in the city to several more.\n\n**Major Plot-Points**\n\n- **Aegon's crusade for the Iron Throne:** Young Griff and the Golden Company have landed in Westeros and taken several castles along the coast. They've even taken Storm's End. The ultimate goal is King's Landing and the Iron Throne. Will they succeed? Fail?\n- **Cersei's Shenanigans:** Cersei's Trial by Battle, her conflict with the Tyrells, Faith Militant, everyone. \n- **Fallout from Kevan and Pycelle's deaths**\n- **The Faith Militant:** The High Sparrow is growing powerful, Tyene Sand is sent to infiltrate the Faith Militant, do they back Aegon?\n- **Jon Connington and the Greyscale:** Does JonCon cause a greyscale outbreak? What impact will greyscale have on JonCon?\n- **Arianne and Aegon:** Does the Dornish Princess seduce and win over Aegon? Do they marry? Does Arianne bring Dorne into war with the Iron Throne\n\n**Middling to Minor Plot-Points**\n\n- **Nymeria Sand on the Small Council:** Lady Nym is coming to take the Dornish Seat on the small council. What will her role be in the small council?\n- **What happened to Loras?** Loras is reportedly badly wounded on Dragonstone. Will he survive? Will he return to TWOW?\n- **The Rosby Inheritance:** Who's putting forward claims to Rosby?\n\nGive me your best \"Here's how this event will go down\" or \"Here's how GRRM will resolve this plot!\"\n***\n##The Volantene Revolution\n\nIn ADWD, Volantis becomes a major setpiece in the narrative. POV Characters as far afield as Tyrion, Quentyn, Jon Connington and Victarion visit the city and bring their unique perspectives into the city. What comes out of this is a fascinating picture of a city about to embark on a foreign war while an internal revolution by slaves and freedmen looms large. Eventually, I might have a more substantive piece on Volants in TWOW, but for now, let's talk bullet points, because the people love bullet-points:\n\n**Major Plot-Points**\n\n- **Volantis sent a fleet of ships crewed by slaves to Meereen:** Yeah, that's going to be interesting. Will the slaves rebel? Fight for Daenerys? Throw off their chains and give Dany the ships she needs to invade Westeros? (Yes)\n- **The Volantene Revolution:** 4 of 5 people in Volantis are slaves. Meanwhile, the high priest of R'hllor in Volantis (Benerro) believes that Dany is Azor Ahai Reborn. Shit's going down.\n- **Dany will likely come to Volantis**: Given the Widow on the Waterfront's conversation with Tyrion and Moqorro's entry into Dany's storyline, Dany will come to Volantis? Will she burnidate the city? Part of the city?\n- **The Dany/Tyrion intersection:** Martin said that Dany and Tyrion would be apart for much of TWOW, but they would \"intersect\" later in TWOW. I think this will go down in Volantis. How will it unfold? Will Aegon come up?\n- **Will Arya come to Volantis?** One theory I've seen batted around is that Arya will make her way to Volantis and join up with Dany's crew.\n\n**Middling to Minor Plot-Points**\n\n- **Who won the election in Volantis?** Did the Tigers take two of the three triarch positions?\n\nObviously, much of the above is speculative given that we've seen no sample chapters set in Volantis, but given the emphasis Martin placed in the city, it's likely this will be a major setpiece in TWOW. How will events go down? What happens in Volantis?\n***\n##Conclusion\n\nUnsettling as it is, Martin has written himself into about 4 major knots that potentially rival the difficulty and complexity of the Meereenese Knot from ADWD. Additionally, though not included in this piece, Samwell and Aeron might be converging in and around Oldtown. \n\nSo, how does Martin writes his way out of these knots? How will these major geographic centers of gravity impact the plot? Which storylines are you looking forward to? Let me know in the comments below!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "TWOW", "id": "655xmy", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 507, "report_reasons": null, "author": "BryndenBFish", "saved": false, "mod_reports": [], "name": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "approved_by": null, "over_18": false, "domain": "self.asoiaf", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/Ln6VJF8m_SSFw8pX1K1exlZsWHW-SBPlJJf_qSM0LCY.jpg?s=f81a40971c5d7502ed06a613c6ae8a42", "width": 800, "height": 479}, "resolutions": [{"url": "https://i.redditmedia.com/Ln6VJF8m_SSFw8pX1K1exlZsWHW-SBPlJJf_qSM0LCY.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=6709784aea0e8deb0e4760feae27b0cd", "width": 108, "height": 64}, {"url": "https://i.redditmedia.com/Ln6VJF8m_SSFw8pX1K1exlZsWHW-SBPlJJf_qSM0LCY.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=0b9cbc89c26b05b4d0a707221911873f", "width": 216, "height": 129}, {"url": "https://i.redditmedia.com/Ln6VJF8m_SSFw8pX1K1exlZsWHW-SBPlJJf_qSM0LCY.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=f7ac68c72e471878e697c97de69fa76a", "width": 320, "height": 191}, {"url": "https://i.redditmedia.com/Ln6VJF8m_SSFw8pX1K1exlZsWHW-SBPlJJf_qSM0LCY.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=4bde79dd543718509b976859ae670c14", "width": 640, "height": 383}], "variants": {}, "id": "o_uMVkhSbrFKH09VG8xdfaMpdG8P-n-fmZmCYP6mpjU"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2r2o9", "edited": false, "link_flair_css_class": "twow", "author_flair_css_class": "TheBlackfish", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/asoiaf/comments/655xmy/spoilers_twow_plot_gravity_wells_converging_povs/", "num_reports": null, "locked": false, "stickied": false, "created": 1492123830.0, "url": "https://www.reddit.com/r/asoiaf/comments/655xmy/spoilers_twow_plot_gravity_wells_converging_povs/", "author_flair_text": "#Hypeslayer", "quarantine": false, "title": "(Spoilers TWOW) Plot Gravity Wells: Converging POVs and Storylines in THE WINDS OF WINTER", "created_utc": 1492095030.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 133, "visited": false, "subreddit_type": "public", "ups": 507}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg9cvtg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "JacksSmirknRevenge", "parent_id": "t1_dg8mzl6", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Mark Sanchez is decent, but he's no Tim Tebow. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mark Sanchez is decent, but he&amp;#39;s no Tim Tebow. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9cvtg", "score_hidden": false, "stickied": false, "created": 1492215910.0, "created_utc": 1492187110.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mzl6", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "MyAntiAlterEgo", "parent_id": "t1_dg8e2pc", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Carson Wentz is pretty good but he's no Mark Sanchez.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Carson Wentz is pretty good but he&amp;#39;s no Mark Sanchez.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8mzl6", "score_hidden": false, "stickied": false, "created": 1492166179.0, "created_utc": 1492137379.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg988b2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NTavares", "parent_id": "t1_dg8e2pc", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I actually like Wentz but he will never reach RG3s level", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually like Wentz but he will never reach RG3s level&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg988b2", "score_hidden": false, "stickied": false, "created": 1492210492.0, "created_utc": 1492181692.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8e2pc", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "gingerbeardy", "parent_id": "t1_dg8a6ix", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I mean, he's good but he's no Carson Wentz.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean, he&amp;#39;s good but he&amp;#39;s no Carson Wentz.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8e2pc", "score_hidden": false, "stickied": false, "created": 1492153925.0, "created_utc": 1492125125.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8a6ix", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "NTavares", "parent_id": "t1_dg81a6v", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "How is everyone ignoring the fact you called Joe Flacco elite.....", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How is everyone ignoring the fact you called Joe Flacco elite.....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8a6ix", "score_hidden": false, "stickied": false, "created": 1492148828.0, "created_utc": 1492120028.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg81hgf", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "LucyRoessler", "parent_id": "t1_dg81a6v", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Wow George is really going to great lengths to hide his reddit identity. Even hired someone to pose as BryndenBFish on Twitter... and even roped that guy's daughter into it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow George is really going to great lengths to hide his reddit identity. Even hired someone to pose as BryndenBFish on Twitter... and even roped that guy&amp;#39;s daughter into it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg81hgf", "score_hidden": false, "stickied": false, "created": 1492138965.0, "created_utc": 1492110165.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8gh4d", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Sanrade", "parent_id": "t1_dg82put", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "CHIEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEFFFFFFFS", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;CHIEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEFFFFFFFS&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8gh4d", "score_hidden": false, "stickied": false, "created": 1492157150.0, "created_utc": 1492128350.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dgbeu1z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NuclearFist", "parent_id": "t1_dg82put", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I'll say this about the AFC NORTH, our games are brutal and close, but worth the watch. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll say this about the AFC NORTH, our games are brutal and close, but worth the watch. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgbeu1z", "score_hidden": false, "stickied": false, "created": 1492331223.0, "created_utc": 1492302423.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82put", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BryndenBFish", "parent_id": "t1_dg82coy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I tend to root for the Bengals when they're not playing the Ravens. I rather like the Red Rocket, and I think your receiving corps is far and away the best in the AFC North (Come at me Antonio Brown fans). tbh, my animosity for the Steelers has faded in recent years too, though I felt the old grievance stir at the last Steelers/Ravens game as about 1 inch separated the Ravens from a playoff run.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I tend to root for the Bengals when they&amp;#39;re not playing the Ravens. I rather like the Red Rocket, and I think your receiving corps is far and away the best in the AFC North (Come at me Antonio Brown fans). tbh, my animosity for the Steelers has faded in recent years too, though I felt the old grievance stir at the last Steelers/Ravens game as about 1 inch separated the Ravens from a playoff run.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg82put", "score_hidden": false, "stickied": false, "created": 1492140311.0, "created_utc": 1492111511.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82coy", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "NuclearFist", "parent_id": "t1_dg81a6v", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Damn......you're a Ravens fan, aren't you?\n\nAh well, at least you're not a Steelers fan. Here's to hoping either my Bengals or your Ravens clinch the AFC North.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn......you&amp;#39;re a Ravens fan, aren&amp;#39;t you?&lt;/p&gt;\n\n&lt;p&gt;Ah well, at least you&amp;#39;re not a Steelers fan. Here&amp;#39;s to hoping either my Bengals or your Ravens clinch the AFC North.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg82coy", "score_hidden": false, "stickied": false, "created": 1492139911.0, "created_utc": 1492111111.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81a6v", "gilded": 0, "archived": false, "score": 56, "report_reasons": null, "author": "BryndenBFish", "parent_id": "t1_dg80hh2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Sorry to disappoint, but not only am I not GRRM, but I don't have a beard, own a pair of suspenders or even wear a Greek sailor's cap. Now, George and I both write fiction, but he doesn't write shit -- or *a lot* of shit. We also despise the New England Patriots, though I'll admit my hatred comes with a grudging respect for Tom Brady as a great quarterback -- though certainly not as elite as Joe Flacco.\n\nFinally to cap it off, as far as I know, George doesn't have a daughter. I have one. We make fun faces like [this.](https://twitter.com/BryndenBFish/status/844007119124946945)", "edited": 1492110125.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry to disappoint, but not only am I not GRRM, but I don&amp;#39;t have a beard, own a pair of suspenders or even wear a Greek sailor&amp;#39;s cap. Now, George and I both write fiction, but he doesn&amp;#39;t write shit -- or &lt;em&gt;a lot&lt;/em&gt; of shit. We also despise the New England Patriots, though I&amp;#39;ll admit my hatred comes with a grudging respect for Tom Brady as a great quarterback -- though certainly not as elite as Joe Flacco.&lt;/p&gt;\n\n&lt;p&gt;Finally to cap it off, as far as I know, George doesn&amp;#39;t have a daughter. I have one. We make fun faces like &lt;a href=\"https://twitter.com/BryndenBFish/status/844007119124946945\"&gt;this.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg81a6v", "score_hidden": false, "stickied": false, "created": 1492138745.0, "created_utc": 1492109945.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 56}}], "after": null, "before": null}}, "user_reports": [], "id": "dg80hh2", "gilded": 0, "archived": false, "score": 47, "report_reasons": null, "author": "LucyRoessler", "parent_id": "t1_dg7noj5", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Of all the Reddit conspiracies, if this one ended up being true, it would probably make me the happiest. Would people just turn on him, and bitch about why he put so much shit out there when he should've been writing? Or would Reddit just be stoked that GRRM was one of them all the time, speculating and mining and trying to figure out how to dig himself out. I'd like to think the latter, Reddit would rally and forever be grateful to GRRM, the BFish, one of us.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of all the Reddit conspiracies, if this one ended up being true, it would probably make me the happiest. Would people just turn on him, and bitch about why he put so much shit out there when he should&amp;#39;ve been writing? Or would Reddit just be stoked that GRRM was one of them all the time, speculating and mining and trying to figure out how to dig himself out. I&amp;#39;d like to think the latter, Reddit would rally and forever be grateful to GRRM, the BFish, one of us.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg80hh2", "score_hidden": false, "stickied": false, "created": 1492137889.0, "created_utc": 1492109089.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 47}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg7sxz6", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "tvkkk", "parent_id": "t1_dg7sk65", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "No big deal, my lord! I'm watching every social account of yours. Now, go finish a chapter.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No big deal, my lord! I&amp;#39;m watching every social account of yours. Now, go finish a chapter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7sxz6", "score_hidden": false, "stickied": false, "created": 1492129861.0, "created_utc": 1492101061.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7sk65", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "BryndenBFish", "parent_id": "t1_dg7s7yy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Oooo great find my friend! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oooo great find my friend! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7sk65", "score_hidden": false, "stickied": false, "created": 1492129453.0, "created_utc": 1492100653.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7s7yy", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "tvkkk", "parent_id": "t1_dg7oxdq", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "[He recently confirmed that here too.](http://grrm.livejournal.com/531864.html?thread=26000280#t26000280)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://grrm.livejournal.com/531864.html?thread=26000280#t26000280\"&gt;He recently confirmed that here too.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7s7yy", "score_hidden": false, "stickied": false, "created": 1492129097.0, "created_utc": 1492100297.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8os4f", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Brian_Baratheon", "parent_id": "t1_dg8opoy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Does that mean the book is complete or that you're still grappling with the Marylandese knot?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does that mean the book is complete or that you&amp;#39;re still grappling with the Marylandese knot?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8os4f", "score_hidden": false, "stickied": false, "created": 1492168833.0, "created_utc": 1492140033.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8opoy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BryndenBFish", "parent_id": "t1_dg8ogi9", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Chapter 3 *does* exist. I think there's like a dozen chapters in total for a total of 244 manuscript pages. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Chapter 3 &lt;em&gt;does&lt;/em&gt; exist. I think there&amp;#39;s like a dozen chapters in total for a total of 244 manuscript pages. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8opoy", "score_hidden": false, "stickied": false, "created": 1492168732.0, "created_utc": 1492139932.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ogi9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Brian_Baratheon", "parent_id": "t1_dg8obq6", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "By the time I get to chapter 3 I expect it to exist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;By the time I get to chapter 3 I expect it to exist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8ogi9", "score_hidden": false, "stickied": false, "created": 1492168348.0, "created_utc": 1492139548.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8obq6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BryndenBFish", "parent_id": "t1_dg8o8hd", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "It makes me tingle with joy that you've read through the first sub-chapter heading. :jeff_frog:", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It makes me tingle with joy that you&amp;#39;ve read through the first sub-chapter heading. :jeff_frog:&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8obq6", "score_hidden": false, "stickied": false, "created": 1492168148.0, "created_utc": 1492139348.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8o8hd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Brian_Baratheon", "parent_id": "t1_dg8o40i", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "/u/BryndenBFish if you end up writing a sequel and you want people to like it better than the original you should call the first chapter of that book *Ronald Reagan Washington National Airport*.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/BryndenBFish\"&gt;/u/BryndenBFish&lt;/a&gt; if you end up writing a sequel and you want people to like it better than the original you should call the first chapter of that book &lt;em&gt;Ronald Reagan Washington National Airport&lt;/em&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8o8hd", "score_hidden": false, "stickied": false, "created": 1492168008.0, "created_utc": 1492139208.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8o40i", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Brian_Baratheon", "parent_id": "t1_dg8nv09", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I was expecting Ser Weymar Royce.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was expecting Ser Weymar Royce.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8o40i", "score_hidden": false, "stickied": false, "created": 1492167823.0, "created_utc": 1492139023.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8nzpv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ZaHiro86", "parent_id": "t1_dg8nv09", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8nzpv", "score_hidden": false, "stickied": false, "created": 1492167648.0, "created_utc": 1492138848.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8nv09", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "BryndenBFish", "parent_id": "t1_dg8nduz", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; You're really an author right?\n\n If push came to shove, I guess I vaguely fit the definition.\n\n&gt; If I like asoiaf, will I like your work?\n\n lol, probably not. Here check out chapters [one](https://cautionerstale.wordpress.com/2017/03/18/chapter-1-june-2007/) and [two](https://cautionerstale.wordpress.com/2017/04/05/the-cautioners-tale-chapter-2-august-2007/) anyways!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You&amp;#39;re really an author right?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If push came to shove, I guess I vaguely fit the definition.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If I like asoiaf, will I like your work?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;lol, probably not. Here check out chapters &lt;a href=\"https://cautionerstale.wordpress.com/2017/03/18/chapter-1-june-2007/\"&gt;one&lt;/a&gt; and &lt;a href=\"https://cautionerstale.wordpress.com/2017/04/05/the-cautioners-tale-chapter-2-august-2007/\"&gt;two&lt;/a&gt; anyways!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8nv09", "score_hidden": false, "stickied": false, "created": 1492167451.0, "created_utc": 1492138651.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8nduz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ZaHiro86", "parent_id": "t1_dg7oxdq", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "You're really an author right? If I like asoiaf, will I like your work?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re really an author right? If I like asoiaf, will I like your work?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8nduz", "score_hidden": false, "stickied": false, "created": 1492166753.0, "created_utc": 1492137953.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7oxdq", "gilded": 0, "archived": false, "score": 146, "report_reasons": null, "author": "BryndenBFish", "parent_id": "t1_dg7noj5", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "No, no. I finished the book -- two drafts of it. Last night I was working on a third draft until later into the night. I think some of the rewrites will work well to make for a more well-rounded, enriching story, but I'll leave my readers to judge that. Sometimes later notions that come into my head force me to rewrite earlier portions of the story, and this ends up having a cascading effect on the narrative as further rewrites have to be integrated.\n\nAnyhow, I know it's been a long time coming, but I think you'll really like *The Cautioner's Tale* when it's published. And good news! I have a sequel half-written a present. It shouldn't take me more than a year to get the sequel out after *The Cautioner's Tale* is published.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, no. I finished the book -- two drafts of it. Last night I was working on a third draft until later into the night. I think some of the rewrites will work well to make for a more well-rounded, enriching story, but I&amp;#39;ll leave my readers to judge that. Sometimes later notions that come into my head force me to rewrite earlier portions of the story, and this ends up having a cascading effect on the narrative as further rewrites have to be integrated.&lt;/p&gt;\n\n&lt;p&gt;Anyhow, I know it&amp;#39;s been a long time coming, but I think you&amp;#39;ll really like &lt;em&gt;The Cautioner&amp;#39;s Tale&lt;/em&gt; when it&amp;#39;s published. And good news! I have a sequel half-written a present. It shouldn&amp;#39;t take me more than a year to get the sequel out after &lt;em&gt;The Cautioner&amp;#39;s Tale&lt;/em&gt; is published.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7oxdq", "score_hidden": false, "stickied": false, "created": 1492125589.0, "created_utc": 1492096789.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 146}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg869ca", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "threep03k64", "parent_id": "t1_dg7noj5", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "If it was GRRM  the length of the post would probably mean delay of another two months.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it was GRRM  the length of the post would probably mean delay of another two months.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg869ca", "score_hidden": false, "stickied": false, "created": 1492144185.0, "created_utc": 1492115385.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7noj5", "gilded": 0, "archived": false, "score": 181, "report_reasons": null, "author": "DownInDemerara", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Is that you explaining why it's taking so long, GRRM?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is that you explaining why it&amp;#39;s taking so long, GRRM?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7noj5", "score_hidden": false, "stickied": false, "created": 1492124219.0, "created_utc": 1492095419.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 181}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg7zqyt", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "Raknel", "parent_id": "t1_dg7z4gx", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I'm sure it is, George. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sure it is, George. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7zqyt", "score_hidden": false, "stickied": false, "created": 1492137096.0, "created_utc": 1492108296.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7z4gx", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "BryndenBFish", "parent_id": "t1_dg7yjgb", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "It *is* the correct way to spell formal titles in a professional setting. Plus on twitter, there's no italics system like there is here on Reddit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It &lt;em&gt;is&lt;/em&gt; the correct way to spell formal titles in a professional setting. Plus on twitter, there&amp;#39;s no italics system like there is here on Reddit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7z4gx", "score_hidden": false, "stickied": false, "created": 1492136441.0, "created_utc": 1492107641.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7yjgb", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "Raknel", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I only know of 2 people who write asoiaf book titles in all caps: GRRM and BryndenBFish. Each day I'm getting closer to confirm my suspicions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I only know of 2 people who write asoiaf book titles in all caps: GRRM and BryndenBFish. Each day I&amp;#39;m getting closer to confirm my suspicions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7yjgb", "score_hidden": false, "stickied": false, "created": 1492135818.0, "created_utc": 1492107018.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8j0el", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "AdmiralKird", "parent_id": "t1_dg82ve0", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Dany takes the city, her and Tyrion distribute the wealth from within the Black Walls, empty the ancient treasures held within their ancient Valyrian vault, and lock Malaquo Mhoan Maxos inside.", "edited": 1492140271.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dany takes the city, her and Tyrion distribute the wealth from within the Black Walls, empty the ancient treasures held within their ancient Valyrian vault, and lock Malaquo Mhoan Maxos inside.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8j0el", "score_hidden": false, "stickied": false, "created": 1492160622.0, "created_utc": 1492131822.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82ve0", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "BryndenBFish", "parent_id": "t1_dg7pekw", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "So, I'm digging this a lot. One thing though: even if Pono's khalasar went HAM against the red temple, they can't kill their way towards a peaceful land, quiet people. 4/5 of the population would still be slave in Volantis. So when Dany of the breaker of chains mold comes to the gates of Volantis, the slaves might rebel regardless of whether they have the backing of the fiery fingers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, I&amp;#39;m digging this a lot. One thing though: even if Pono&amp;#39;s khalasar went HAM against the red temple, they can&amp;#39;t kill their way towards a peaceful land, quiet people. 4/5 of the population would still be slave in Volantis. So when Dany of the breaker of chains mold comes to the gates of Volantis, the slaves might rebel regardless of whether they have the backing of the fiery fingers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg82ve0", "score_hidden": false, "stickied": false, "created": 1492140478.0, "created_utc": 1492111678.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg88lpi", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "skullofthegreatjon", "parent_id": "t1_dg7pekw", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "This is fascinating.  I had assumed the red priests of Volantis would accompany Daenerys to Westeros, but you make a good case they could be slaughtered.  Now: Would they stay slaughtered?  Benerro says pretty clearly that those who serve Daenerys will be reborn.  It would be pretty elegant for GRRM to send Moqorro away to fetch Dany *and* to relight, Thoros-style, the candles the tigers blow out.      ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is fascinating.  I had assumed the red priests of Volantis would accompany Daenerys to Westeros, but you make a good case they could be slaughtered.  Now: Would they stay slaughtered?  Benerro says pretty clearly that those who serve Daenerys will be reborn.  It would be pretty elegant for GRRM to send Moqorro away to fetch Dany &lt;em&gt;and&lt;/em&gt; to relight, Thoros-style, the candles the tigers blow out.      &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg88lpi", "score_hidden": false, "stickied": false, "created": 1492146888.0, "created_utc": 1492118088.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8h7g6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ACriticalGeek", "parent_id": "t1_dg7pekw", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Dothraki aren't known for their adhering to the plan. If they get let in to sack a temple, who is to say they won't sack the rest of the town as well?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dothraki aren&amp;#39;t known for their adhering to the plan. If they get let in to sack a temple, who is to say they won&amp;#39;t sack the rest of the town as well?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8h7g6", "score_hidden": false, "stickied": false, "created": 1492158161.0, "created_utc": 1492129361.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7pekw", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "AdmiralKird", "parent_id": "t1_dg7pefe", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;\"Why should I fear Pono?\" Dany objected. \"He was Drogo's ko, and always spoke me gently.\"\n\n&gt;\"Ko Pono spoke you gently,\" Ser Jorah Mormont said. \"Khal Pono will kill you. He was the first to abandon Drogo. Ten thousand warriors went with him. You have a hundred.\"\n\n&gt;*Daenerys I, ACOK*\n\nIf he were to take out the triarchs, then Daenerys would not have to face the might of Volantis. With Benerro dead, and the 1,000 soldiers of the \"Fiery Hand,\" the Red Temple's soldiers, put to the sword, this would explain why our final look at Volantis from Victarion contrasts all of the previous views with Tyrion. Vic doesn't mention *any* talk about the Red God, *any* talk about discontent, *even in the poor district of the city*. It is the exact opposite:\n\n&gt;In Volantis he had seen the galleys taking on provisions. The whole city had seemed drunk. Sailors and soldiers and tinkers had been observed dancing in the streets with nobles and fat merchants, and in every inn and winesink cups were being raised to the new triarchs. All the talk had been of the gold and gems and slaves that would flood into Volantis once the dragon queen was dead. \n\n&gt;*The Iron Suitor, ADWD*\n\nI think Benerro saw his death coming, all the talk about being \"reborn,\" but he knew it was unavoidable for his message to get out. Despite his preaching, R'hllor didn't intervene to save him. To the Volantene population, he was wrong, and the triarchs proved it. The Lord of Light is not with them and the new triarchs go ahead with their war on Daenerys. \n", "edited": 1492097783.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Why should I fear Pono?&amp;quot; Dany objected. &amp;quot;He was Drogo&amp;#39;s ko, and always spoke me gently.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ko Pono spoke you gently,&amp;quot; Ser Jorah Mormont said. &amp;quot;Khal Pono will kill you. He was the first to abandon Drogo. Ten thousand warriors went with him. You have a hundred.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Daenerys I, ACOK&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If he were to take out the triarchs, then Daenerys would not have to face the might of Volantis. With Benerro dead, and the 1,000 soldiers of the &amp;quot;Fiery Hand,&amp;quot; the Red Temple&amp;#39;s soldiers, put to the sword, this would explain why our final look at Volantis from Victarion contrasts all of the previous views with Tyrion. Vic doesn&amp;#39;t mention &lt;em&gt;any&lt;/em&gt; talk about the Red God, &lt;em&gt;any&lt;/em&gt; talk about discontent, &lt;em&gt;even in the poor district of the city&lt;/em&gt;. It is the exact opposite:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In Volantis he had seen the galleys taking on provisions. The whole city had seemed drunk. Sailors and soldiers and tinkers had been observed dancing in the streets with nobles and fat merchants, and in every inn and winesink cups were being raised to the new triarchs. All the talk had been of the gold and gems and slaves that would flood into Volantis once the dragon queen was dead. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;The Iron Suitor, ADWD&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think Benerro saw his death coming, all the talk about being &amp;quot;reborn,&amp;quot; but he knew it was unavoidable for his message to get out. Despite his preaching, R&amp;#39;hllor didn&amp;#39;t intervene to save him. To the Volantene population, he was wrong, and the triarchs proved it. The Lord of Light is not with them and the new triarchs go ahead with their war on Daenerys. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7pekw", "score_hidden": false, "stickied": false, "created": 1492126101.0, "created_utc": 1492097301.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 28}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7pefe", "gilded": 0, "archived": false, "score": 44, "report_reasons": null, "author": "AdmiralKird", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "# The Political and Religious Situation in Volantis\n\n&gt;“The priest is calling on the Volantenes to go to war,” the Halfmaester told him, “but on the side of right, as soldiers of the Lord of Light, R’hllor who made the sun and stars and fights eternally against the darkness. Nyessos and Malaquo have turned away from the light, he says, their hearts darkened by the yellow harpies from the east. He says …”\n\n&gt;“Dragons. I understood that word. He said dragons.”\n\n&gt;“Aye. The dragons have come to carry her to glory.”\n\n&gt;“Her. Daenerys?”\n\n&gt;Haldon nodded. “Benerro has sent forth the word from Volantis. Her coming is the fulfillment of an ancient prophecy. From smoke and salt was she born to make the world anew. She is Azor Ahai returned … and her triumph over darkness will bring a summer that will never end … death itself will bend its knee, and all those who die fighting in her cause shall be reborn …”\n\n&gt;*Tyrion VI, ADWD*\n\n Benerro is clearly on Daenery's side. He believes she has been sent by R'hllor to deliver them from evil. (Note also in the first paragraph, Tyrion cuts Haldon off before he can translate any more.) Benerro also leaves an omen for Volantis if it strikes against Daenerys. We hear this through Qavo Nogarys, a Selhorys customs officer who plays cyvasse against Tyrion:\n\n&gt;“The red priests would be wise to hold their tongues,” said Qavo Nogarys. “Already there has been fighting between their followers and those who worship other gods. Benerro’s rantings will only serve to bring a savage wrath down upon his head.”\n\n&gt;“What rantings?” the dwarf asked, toying with his rabble\n\n&gt;The Volantene waved a hand. “In Volantis, thousands of slaves and freedmen crowd the temple plaza every night to hear Benerro shriek of bleeding stars and a sword of fire that will cleanse the world. **He has been preaching that Volantis will surely burn if the triarchs take up arms against the silver queen**.”\n\n&gt;*Tyrion VI, ADWD*\n\nAnd later, word arrives in Meereen that Volantis \"has\" launched it's fleet. \n\n&gt;\"And there is more. Worse. Volantis has launched its fleet against us.” [Skahaz]\n\n&gt;“Volantis.” Selmy’s sword hand tingled. We made a peace with Yunkai. Not with Volantis. “You are certain?”\n\n&gt;“Certain. The Wise Masters know. So do their friends. The Harpy, Reznak, Hizdahr. This king will open the city gates to the Volantenes when they arrive. All those Daenerys freed will be enslaved again. Even some who were never slaves will be fitted for chains. You may end your days in a fighting pit, old man. Khrazz will eat your heart.\"\n\nHow this news arrives ahead of the fleet, given there are no ravens, is a micro mystery in ADWD. Perhaps riders from the Demon Road by Mantarys reached Tolos and the news was carried via ship to Yunkai. Perhaps a faster ship not coupled to a fleet arrived first. With the Volantene fleet delayed, either reason could explain why a physically shorter half-land, half-sea route arrived first. Or perhaps this claim is an anticipated rumor rather than something exact. Regardless, Victarion witnessed the Volantenes before their departure, and clearly expects the fleet to be tailing him to Meereen:\n\n&gt;He took care not to mention the green galleys of Old Volantis that surely must be sailing up through the Gulf of Grief even as he spoke.\n\n&gt;*Victarion, ADWD*\n\n...and Moqorro also backs this claim up:\n\n&gt;“What do you see?” the captain asked his black priest that night, as Moqorro stood before his nightfire. “What awaits us on the morrow? More rain?” It smelled like rain to him.\n\n&gt;“Grey skies and strong winds,” Moqorro said. “No rain. Behind come the tigers. Ahead awaits your dragon.”\n\n&gt;*Victarion, ADWD*\n\nAlthough we're not sure to what degree Moqorro is messing with Victarion:\n\n&gt;The black priest bowed his head. “There is no need. The Lord of Light has shown me your worth, lord Captain. Every night in my fires I glimpse the glory that awaits you.”\n\n&gt;*Victarion, ADWD*\n\nI recently reread [Brynden's essay on the Battle of Fire](https://bryndenbfish.wordpress.com/2014/06/03/a-dragon-dawn-a-complete-analysis-of-the-upcoming-battle-of-fire-conclusion-fire-and-blood/), which lays out a theory that the Volantene slaves will rebel when they reach Slaver's Bay and go over to Daenerys. This is certainly a probable outcome, but I feel like there is more going on in Volantis than a simple voyage to Meereen and rebellion. We have reason already to doubt this will occur, given Tyrion's musings on the Tiger Cloaks - *slave soldiers.*\n\n&gt;A squad of Volantene spearmen stood guard at the river gate. Torchlight gleamed off the steel claws that jutted from their gauntlets. Their helms were tiger’s masks, the faces beneath marked by green stripes tattooed across both cheeks. **The slave soldiers of Volantis were fiercely proud of their tiger stripes, Tyrion knew.** *Do they yearn for freedom?* he wondered. *What would they do if this child queen bestowed it on them? What are they, if not tigers? What am I, if not a lion?*\n\n&gt;*Tyrion VI, ADWD*\n\nIt could be Tyrion's understanding is flawed - we don't know how he acquired this knowledge, hell, perhaps it was a copy of \"Lonely Planetos: Volantis\" written by the Volantene nobles. Then again, if you're going to have a massive slave population, you'd probably want adequate protection against any revolts. You definitely wouldn't want to be arming slaves whose loyalty might be in doubt. And we do know roughly half off the Tiger Cloaks aren't worshipers of R'hllor - which would possibly mean substantial resistance to a religious uprising:\n\n&gt;“Benerro can see the morrow in his flames,” the widow said. “Triarch Malaquo tried to hire the Golden Company, did you know? He meant to clean out the red temple and put Benerro to the sword. **He dare not use tiger cloaks. Half of them worship the Lord of Light as well.**\"\n\n&gt;*Tyrion VII, ADWD*\n\nAnd to requote Qavo Nogarys earlier:\n\n&gt;“The red priests would be wise to hold their tongues,” said Qavo Nogarys. “**Already there has been fighting between their followers and those who worship other gods.** Benerro’s rantings will only serve to bring a savage wrath down upon his head.”\n\n&gt;*Tyrion VI, ADWD*\n\nAnd we also have reason to believe it's not just the Tiger faction willing to go to war from the barge sailing up the Rhoyne that Tyrion and the Griffs pass:\n\n&gt;“**Nyessos and Malaquo go hand in hand, and the elephants show stripes.**” The voice faded as the other boat moved away from them. They watched its light dwindle and disappear.\n\n&gt;*Tyrion V, ADWD*\n\nSo it looks like things aren't perfectly clean for Benerro and the slaves to start an uprising. The old families appear to be unified. The followers of other gods are fighting with Benerro, and we have reason to believe the armed slaves might be more loyal than not. Plus we have Grezdan mo Eraz from Yunkai and other envoys over in Volantis spreading terrible rumors about Daenerys. The slaves have a huge population advantage, but they don't appear to be unified, and Benerro seems to be their center of support. If he should fall, the fire would be squelched rather quickly.\n\nSo who is going to come out on top, the slaves? the Red Priests? the Triarchs? \n\nBy the time the Volantene fleet is ready to launch, I think the situation has resolved itself. How? Well, there is another faction present in the vicinity, whose purpose remains cloudy to all of our characters, but we receive several pieces of information from different sources that can illuminate a gap in our story:\n\n&gt;“You have Dothraki outside your own gates,” Haldon said.\n\n&gt;“Khal Pono.” Qavo waved a pale hand in dismissal. “The horselords come, we give them gifts, the horselords go.” He moved his catapult again, closed his hand around Tyrion’s alabaster dragon, removed it from the board.\n\n&gt;*Tyrion VI, ADWD*\n\nNobody seems very concerned with Khal Pono, yet he has brought the largest khalasar of the Dothraki all the way to Old Volantis:\n\n&gt;The last reports had Pono near the headwaters of the Selhoru with a *khalasar* of thirty thousand.\n\n&gt;*Tyrion III, ADWD*\n\nWhy are they there? I think we receive the reason from the Widow of the Waterfront:\n\n&gt;“Benerro can see the morrow in his flames,” the widow said. “**Triarch Malaquo tried to hire the Golden Company, did you know? He meant to clean out the red temple and put Benerro to the sword.** He dare not use tiger cloaks. Half of them worship the Lord of Light as well.\"\n\n&gt;*Tyrion VI, ADWD*\n\nThe Golden Company is unavailable *but Khal Pono is.* I don't think the Khal is there to collect tribute, I think he's been called in to sack the Red Temple. The Golden Company also works to Triarch Malaquo's advantage. When the Golden Company approaches the city, he sends out 5,000 foot and 1,000 horse out of the city on a very reasonable mission:\n\n&gt;A ferocious southern sun beat down upon the crowded riverfront of Volon Therys, but heat was the last and least of Griff’s concerns. The Golden Company was encamped three miles south of town, well north of where he had expected them, and Triarch Malaquo had come north with five thousand foot and a thousand horse to cut them off from the delta road.\n\n&gt;*The Lost Lord, ADWD*\n\nA lot of the armed tigers cloaks that might side with Benerro are out of the city. It also sounds like there is a bit of creative wording from GRRM here in our Qavo quote:\n\n&gt;“The red priests would be wise to hold their tongues,” said Qavo Nogarys. “Already there has been fighting between their followers and those who worship other gods. **Benerro’s rantings will only serve to bring a savage wrath down upon his head.**”\n\n&gt;*Tyrion VI, ADWD*\n\nNote the use of the word \"savage,\" a word which has been primarily used throughout the series to describe the Dothraki. But what is stopping Pono from going after all of Volantis? Well, Pono would probably want to make sure the Volantenes launch against her:\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;h1&gt;The Political and Religious Situation in Volantis&lt;/h1&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“The priest is calling on the Volantenes to go to war,” the Halfmaester told him, “but on the side of right, as soldiers of the Lord of Light, R’hllor who made the sun and stars and fights eternally against the darkness. Nyessos and Malaquo have turned away from the light, he says, their hearts darkened by the yellow harpies from the east. He says …”&lt;/p&gt;\n\n&lt;p&gt;“Dragons. I understood that word. He said dragons.”&lt;/p&gt;\n\n&lt;p&gt;“Aye. The dragons have come to carry her to glory.”&lt;/p&gt;\n\n&lt;p&gt;“Her. Daenerys?”&lt;/p&gt;\n\n&lt;p&gt;Haldon nodded. “Benerro has sent forth the word from Volantis. Her coming is the fulfillment of an ancient prophecy. From smoke and salt was she born to make the world anew. She is Azor Ahai returned … and her triumph over darkness will bring a summer that will never end … death itself will bend its knee, and all those who die fighting in her cause shall be reborn …”&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Tyrion VI, ADWD&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Benerro is clearly on Daenery&amp;#39;s side. He believes she has been sent by R&amp;#39;hllor to deliver them from evil. (Note also in the first paragraph, Tyrion cuts Haldon off before he can translate any more.) Benerro also leaves an omen for Volantis if it strikes against Daenerys. We hear this through Qavo Nogarys, a Selhorys customs officer who plays cyvasse against Tyrion:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“The red priests would be wise to hold their tongues,” said Qavo Nogarys. “Already there has been fighting between their followers and those who worship other gods. Benerro’s rantings will only serve to bring a savage wrath down upon his head.”&lt;/p&gt;\n\n&lt;p&gt;“What rantings?” the dwarf asked, toying with his rabble&lt;/p&gt;\n\n&lt;p&gt;The Volantene waved a hand. “In Volantis, thousands of slaves and freedmen crowd the temple plaza every night to hear Benerro shriek of bleeding stars and a sword of fire that will cleanse the world. &lt;strong&gt;He has been preaching that Volantis will surely burn if the triarchs take up arms against the silver queen&lt;/strong&gt;.”&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Tyrion VI, ADWD&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And later, word arrives in Meereen that Volantis &amp;quot;has&amp;quot; launched it&amp;#39;s fleet. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;And there is more. Worse. Volantis has launched its fleet against us.” [Skahaz]&lt;/p&gt;\n\n&lt;p&gt;“Volantis.” Selmy’s sword hand tingled. We made a peace with Yunkai. Not with Volantis. “You are certain?”&lt;/p&gt;\n\n&lt;p&gt;“Certain. The Wise Masters know. So do their friends. The Harpy, Reznak, Hizdahr. This king will open the city gates to the Volantenes when they arrive. All those Daenerys freed will be enslaved again. Even some who were never slaves will be fitted for chains. You may end your days in a fighting pit, old man. Khrazz will eat your heart.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How this news arrives ahead of the fleet, given there are no ravens, is a micro mystery in ADWD. Perhaps riders from the Demon Road by Mantarys reached Tolos and the news was carried via ship to Yunkai. Perhaps a faster ship not coupled to a fleet arrived first. With the Volantene fleet delayed, either reason could explain why a physically shorter half-land, half-sea route arrived first. Or perhaps this claim is an anticipated rumor rather than something exact. Regardless, Victarion witnessed the Volantenes before their departure, and clearly expects the fleet to be tailing him to Meereen:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;He took care not to mention the green galleys of Old Volantis that surely must be sailing up through the Gulf of Grief even as he spoke.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Victarion, ADWD&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;...and Moqorro also backs this claim up:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“What do you see?” the captain asked his black priest that night, as Moqorro stood before his nightfire. “What awaits us on the morrow? More rain?” It smelled like rain to him.&lt;/p&gt;\n\n&lt;p&gt;“Grey skies and strong winds,” Moqorro said. “No rain. Behind come the tigers. Ahead awaits your dragon.”&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Victarion, ADWD&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Although we&amp;#39;re not sure to what degree Moqorro is messing with Victarion:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The black priest bowed his head. “There is no need. The Lord of Light has shown me your worth, lord Captain. Every night in my fires I glimpse the glory that awaits you.”&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Victarion, ADWD&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I recently reread &lt;a href=\"https://bryndenbfish.wordpress.com/2014/06/03/a-dragon-dawn-a-complete-analysis-of-the-upcoming-battle-of-fire-conclusion-fire-and-blood/\"&gt;Brynden&amp;#39;s essay on the Battle of Fire&lt;/a&gt;, which lays out a theory that the Volantene slaves will rebel when they reach Slaver&amp;#39;s Bay and go over to Daenerys. This is certainly a probable outcome, but I feel like there is more going on in Volantis than a simple voyage to Meereen and rebellion. We have reason already to doubt this will occur, given Tyrion&amp;#39;s musings on the Tiger Cloaks - &lt;em&gt;slave soldiers.&lt;/em&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A squad of Volantene spearmen stood guard at the river gate. Torchlight gleamed off the steel claws that jutted from their gauntlets. Their helms were tiger’s masks, the faces beneath marked by green stripes tattooed across both cheeks. &lt;strong&gt;The slave soldiers of Volantis were fiercely proud of their tiger stripes, Tyrion knew.&lt;/strong&gt; &lt;em&gt;Do they yearn for freedom?&lt;/em&gt; he wondered. &lt;em&gt;What would they do if this child queen bestowed it on them? What are they, if not tigers? What am I, if not a lion?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Tyrion VI, ADWD&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It could be Tyrion&amp;#39;s understanding is flawed - we don&amp;#39;t know how he acquired this knowledge, hell, perhaps it was a copy of &amp;quot;Lonely Planetos: Volantis&amp;quot; written by the Volantene nobles. Then again, if you&amp;#39;re going to have a massive slave population, you&amp;#39;d probably want adequate protection against any revolts. You definitely wouldn&amp;#39;t want to be arming slaves whose loyalty might be in doubt. And we do know roughly half off the Tiger Cloaks aren&amp;#39;t worshipers of R&amp;#39;hllor - which would possibly mean substantial resistance to a religious uprising:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“Benerro can see the morrow in his flames,” the widow said. “Triarch Malaquo tried to hire the Golden Company, did you know? He meant to clean out the red temple and put Benerro to the sword. &lt;strong&gt;He dare not use tiger cloaks. Half of them worship the Lord of Light as well.&lt;/strong&gt;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Tyrion VII, ADWD&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And to requote Qavo Nogarys earlier:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“The red priests would be wise to hold their tongues,” said Qavo Nogarys. “&lt;strong&gt;Already there has been fighting between their followers and those who worship other gods.&lt;/strong&gt; Benerro’s rantings will only serve to bring a savage wrath down upon his head.”&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Tyrion VI, ADWD&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And we also have reason to believe it&amp;#39;s not just the Tiger faction willing to go to war from the barge sailing up the Rhoyne that Tyrion and the Griffs pass:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“&lt;strong&gt;Nyessos and Malaquo go hand in hand, and the elephants show stripes.&lt;/strong&gt;” The voice faded as the other boat moved away from them. They watched its light dwindle and disappear.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Tyrion V, ADWD&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So it looks like things aren&amp;#39;t perfectly clean for Benerro and the slaves to start an uprising. The old families appear to be unified. The followers of other gods are fighting with Benerro, and we have reason to believe the armed slaves might be more loyal than not. Plus we have Grezdan mo Eraz from Yunkai and other envoys over in Volantis spreading terrible rumors about Daenerys. The slaves have a huge population advantage, but they don&amp;#39;t appear to be unified, and Benerro seems to be their center of support. If he should fall, the fire would be squelched rather quickly.&lt;/p&gt;\n\n&lt;p&gt;So who is going to come out on top, the slaves? the Red Priests? the Triarchs? &lt;/p&gt;\n\n&lt;p&gt;By the time the Volantene fleet is ready to launch, I think the situation has resolved itself. How? Well, there is another faction present in the vicinity, whose purpose remains cloudy to all of our characters, but we receive several pieces of information from different sources that can illuminate a gap in our story:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“You have Dothraki outside your own gates,” Haldon said.&lt;/p&gt;\n\n&lt;p&gt;“Khal Pono.” Qavo waved a pale hand in dismissal. “The horselords come, we give them gifts, the horselords go.” He moved his catapult again, closed his hand around Tyrion’s alabaster dragon, removed it from the board.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Tyrion VI, ADWD&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Nobody seems very concerned with Khal Pono, yet he has brought the largest khalasar of the Dothraki all the way to Old Volantis:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The last reports had Pono near the headwaters of the Selhoru with a &lt;em&gt;khalasar&lt;/em&gt; of thirty thousand.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Tyrion III, ADWD&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Why are they there? I think we receive the reason from the Widow of the Waterfront:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“Benerro can see the morrow in his flames,” the widow said. “&lt;strong&gt;Triarch Malaquo tried to hire the Golden Company, did you know? He meant to clean out the red temple and put Benerro to the sword.&lt;/strong&gt; He dare not use tiger cloaks. Half of them worship the Lord of Light as well.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Tyrion VI, ADWD&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The Golden Company is unavailable &lt;em&gt;but Khal Pono is.&lt;/em&gt; I don&amp;#39;t think the Khal is there to collect tribute, I think he&amp;#39;s been called in to sack the Red Temple. The Golden Company also works to Triarch Malaquo&amp;#39;s advantage. When the Golden Company approaches the city, he sends out 5,000 foot and 1,000 horse out of the city on a very reasonable mission:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A ferocious southern sun beat down upon the crowded riverfront of Volon Therys, but heat was the last and least of Griff’s concerns. The Golden Company was encamped three miles south of town, well north of where he had expected them, and Triarch Malaquo had come north with five thousand foot and a thousand horse to cut them off from the delta road.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;The Lost Lord, ADWD&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A lot of the armed tigers cloaks that might side with Benerro are out of the city. It also sounds like there is a bit of creative wording from GRRM here in our Qavo quote:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“The red priests would be wise to hold their tongues,” said Qavo Nogarys. “Already there has been fighting between their followers and those who worship other gods. &lt;strong&gt;Benerro’s rantings will only serve to bring a savage wrath down upon his head.&lt;/strong&gt;”&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Tyrion VI, ADWD&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Note the use of the word &amp;quot;savage,&amp;quot; a word which has been primarily used throughout the series to describe the Dothraki. But what is stopping Pono from going after all of Volantis? Well, Pono would probably want to make sure the Volantenes launch against her:&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7pefe", "score_hidden": false, "stickied": false, "created": 1492126097.0, "created_utc": 1492097297.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 44}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg80hz8", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "guileandsubterfuge", "parent_id": "t1_dg7q1ty", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think the Riverlands are, at the*very*  least, the 5th big location in Winds. GRRM has littered them with agents of prophecy and supernatural communications - which may very well be critical if the North falls. In terms of characters - yes, you've got Jaime &amp; Brienne, but there's certainly reason to believe that Arya might reunite with Nymeria and her wolfpack. But then also, there's the Quiet Isle, the Hound and the potential of someone like Ser Shadrich dragging Sansa back through the area. \n\nIn summary: Volantis Schmolantis.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the Riverlands are, at the&lt;em&gt;very&lt;/em&gt;  least, the 5th big location in Winds. GRRM has littered them with agents of prophecy and supernatural communications - which may very well be critical if the North falls. In terms of characters - yes, you&amp;#39;ve got Jaime &amp;amp; Brienne, but there&amp;#39;s certainly reason to believe that Arya might reunite with Nymeria and her wolfpack. But then also, there&amp;#39;s the Quiet Isle, the Hound and the potential of someone like Ser Shadrich dragging Sansa back through the area. &lt;/p&gt;\n\n&lt;p&gt;In summary: Volantis Schmolantis.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg80hz8", "score_hidden": false, "stickied": false, "created": 1492137904.0, "created_utc": 1492109104.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8ilry", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "lazysoldier", "parent_id": "t1_dg87sec", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "https://www.reddit.com/r/asoiaf/comments/27vdh9/spoilers_adwd_a_momentous_event_that_went/  \nStoneheart meeting Reed is an older theory, based on the Brotherhood being seen headed north into the swamps, and the Freys stating that they wouldn't put it beyond the crannogmen to host outlaws, so those swamps are Reed territory.  \n  \n“His hounds picked up their scent again north of Hag’s Mire,” the older woman [Lady Mariya] told him. “He swears that he was no more than half a day behind them when they vanished into the Neck.”  \n“Let them [The Brotherhood] rot there,” declared Ser Kennos cheerfully. “If the gods are good, they’ll be swallowed up in quicksand or gobbled down by lizard-lions.”\n“Or taken in by frogeaters,” said Ser Danwell Frey. “I would not put it past the crannogmen to shelter outlaws.” \n  \nThe full explanation is behind the link. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/asoiaf/comments/27vdh9/spoilers_adwd_a_momentous_event_that_went/\"&gt;https://www.reddit.com/r/asoiaf/comments/27vdh9/spoilers_adwd_a_momentous_event_that_went/&lt;/a&gt;&lt;br/&gt;\nStoneheart meeting Reed is an older theory, based on the Brotherhood being seen headed north into the swamps, and the Freys stating that they wouldn&amp;#39;t put it beyond the crannogmen to host outlaws, so those swamps are Reed territory.  &lt;/p&gt;\n\n&lt;p&gt;“His hounds picked up their scent again north of Hag’s Mire,” the older woman [Lady Mariya] told him. “He swears that he was no more than half a day behind them when they vanished into the Neck.”&lt;br/&gt;\n“Let them [The Brotherhood] rot there,” declared Ser Kennos cheerfully. “If the gods are good, they’ll be swallowed up in quicksand or gobbled down by lizard-lions.”\n“Or taken in by frogeaters,” said Ser Danwell Frey. “I would not put it past the crannogmen to shelter outlaws.” &lt;/p&gt;\n\n&lt;p&gt;The full explanation is behind the link. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8ilry", "score_hidden": false, "stickied": false, "created": 1492160071.0, "created_utc": 1492131271.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87sec", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "detective_dinky", "parent_id": "t1_dg7q1ty", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I'm missing something here .. how do we know the BWB is already in contact with Howland Reed?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m missing something here .. how do we know the BWB is already in contact with Howland Reed?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg87sec", "score_hidden": false, "stickied": false, "created": 1492145924.0, "created_utc": 1492117124.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8ezen", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "theLiteral_Opposite", "parent_id": "t1_dg7q1ty", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Wait how are the bwb in contact with Reade?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait how are the bwb in contact with Reade?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8ezen", "score_hidden": false, "stickied": false, "created": 1492155129.0, "created_utc": 1492126329.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7q1ty", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "BryndenBFish", "parent_id": "t1_dg7pfb0", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Yeah, that's a great point -- you have Jaime and Brienne in the Riverlands and Jeyne Westerling making an appearance in TWOW Prologue. It will have an impact on King's Landing definitely. Cersei asks after Jaime in ADWD at several junctures and Kevan wonders what became of him. \n\nI can also see the BWB going north too. They're already in contact with Howland Reed. If they enter the chaos of the North, that's going to be very interesting indeed.\n\nI'm never sure what to think about Arya's return. I can see her coming back to Westeros with Massey or heading to Volantis. The only thing for certain is that she's coming back to Westeros. Don't think she'll go to the Twins though.\n\nI think Massey will be unsuccessful. In part, I think most of the sellsword companies are either in Meereen or Westeros, but also in part, because the narrative demands it. Ultimately, Stannis will become a failed messiah and a a failed king. \n\nGreat comment!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, that&amp;#39;s a great point -- you have Jaime and Brienne in the Riverlands and Jeyne Westerling making an appearance in TWOW Prologue. It will have an impact on King&amp;#39;s Landing definitely. Cersei asks after Jaime in ADWD at several junctures and Kevan wonders what became of him. &lt;/p&gt;\n\n&lt;p&gt;I can also see the BWB going north too. They&amp;#39;re already in contact with Howland Reed. If they enter the chaos of the North, that&amp;#39;s going to be very interesting indeed.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m never sure what to think about Arya&amp;#39;s return. I can see her coming back to Westeros with Massey or heading to Volantis. The only thing for certain is that she&amp;#39;s coming back to Westeros. Don&amp;#39;t think she&amp;#39;ll go to the Twins though.&lt;/p&gt;\n\n&lt;p&gt;I think Massey will be unsuccessful. In part, I think most of the sellsword companies are either in Meereen or Westeros, but also in part, because the narrative demands it. Ultimately, Stannis will become a failed messiah and a a failed king. &lt;/p&gt;\n\n&lt;p&gt;Great comment!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7q1ty", "score_hidden": false, "stickied": false, "created": 1492126788.0, "created_utc": 1492097988.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 29}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7pfb0", "gilded": 0, "archived": false, "score": 41, "report_reasons": null, "author": "housemollohan", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Great summary of the myriad threads that GRRM must weave together in TWOW and beyond. One plot point that wasn't mentioned is the Riverlands (Jaime-Brienne-Lady Stoneheart). I expect it will likely impact King's Landing the most. What do you think?\n\nAlso, I wonder if Arya is like to go north (through Justin Massey) or south (to Volantis) or chart her own path west toward the Twins like Season 6.\n\nAdditionally, do you think Massey secures sellswords for Stannis, and if so, which company will it be? If not, what does Massey and the Iron Bank do?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great summary of the myriad threads that GRRM must weave together in TWOW and beyond. One plot point that wasn&amp;#39;t mentioned is the Riverlands (Jaime-Brienne-Lady Stoneheart). I expect it will likely impact King&amp;#39;s Landing the most. What do you think?&lt;/p&gt;\n\n&lt;p&gt;Also, I wonder if Arya is like to go north (through Justin Massey) or south (to Volantis) or chart her own path west toward the Twins like Season 6.&lt;/p&gt;\n\n&lt;p&gt;Additionally, do you think Massey secures sellswords for Stannis, and if so, which company will it be? If not, what does Massey and the Iron Bank do?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7pfb0", "score_hidden": false, "stickied": false, "created": 1492126121.0, "created_utc": 1492097321.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 41}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg9b6d2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Caos2", "parent_id": "t1_dg85ozp", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Even the killing won't fit in two books. George needs at least 3.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even the killing won&amp;#39;t fit in two books. George needs at least 3.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9b6d2", "score_hidden": false, "stickied": false, "created": 1492214019.0, "created_utc": 1492185219.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg85ozp", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "babrooks213", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; So, how does Martin writes his way out of these knots?\n\nHonestly, I think it's going to require a lot of killing/culling. Plot threads are going to have to be lopped off and sacrificed in the interest of the greater story. For instance, just to pick two random examples, the Rosby inheritance or Volantis election (probably) won't have any bearing on the ultimate story ending, so those threads are going to have to be destroyed or left behind as the bigger plot muscles its way in.\n\nJeyne Poole means jack shit if the Others have torn down the Wall and overrun the North. The Faith Militant/High Sparrow can be wiped off the table if the books follow the show. etc.\n\nTL;DR: GRRM's got a lot of killin' to do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;So, how does Martin writes his way out of these knots?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Honestly, I think it&amp;#39;s going to require a lot of killing/culling. Plot threads are going to have to be lopped off and sacrificed in the interest of the greater story. For instance, just to pick two random examples, the Rosby inheritance or Volantis election (probably) won&amp;#39;t have any bearing on the ultimate story ending, so those threads are going to have to be destroyed or left behind as the bigger plot muscles its way in.&lt;/p&gt;\n\n&lt;p&gt;Jeyne Poole means jack shit if the Others have torn down the Wall and overrun the North. The Faith Militant/High Sparrow can be wiped off the table if the books follow the show. etc.&lt;/p&gt;\n\n&lt;p&gt;TL;DR: GRRM&amp;#39;s got a lot of killin&amp;#39; to do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg85ozp", "score_hidden": false, "stickied": false, "created": 1492143562.0, "created_utc": 1492114762.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg93bd4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FreeParking42", "parent_id": "t1_dg8f9wq", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Heh, that is why I am trying to make sure that is what he is suggesting, because such an assertion is absurd to me. One would struggle much more to remove chapters from AGOT than AFFF/ADWD.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Heh, that is why I am trying to make sure that is what he is suggesting, because such an assertion is absurd to me. One would struggle much more to remove chapters from AGOT than AFFF/ADWD.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg93bd4", "score_hidden": false, "stickied": false, "created": 1492203342.0, "created_utc": 1492174542.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8f9wq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "GeneralSuvorov", "parent_id": "t1_dg8ce5c", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Oh, yes. Every chapter in AFFC and ADWD is absolutely essential. It is known.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, yes. Every chapter in AFFC and ADWD is absolutely essential. It is known.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8f9wq", "score_hidden": false, "stickied": false, "created": 1492155504.0, "created_utc": 1492126704.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ce5c", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "FreeParking42", "parent_id": "t1_dg85uux", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I want to make sure I am getting your argument correct here. You are saying that because there are more POVs now, GRRM has less room in each book to devote to each story. As a result, he must make sure that each chapter is absolutely essential to the book, and that is, at least partially, why things like Meereen are so knotty for him. Did I get that right?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to make sure I am getting your argument correct here. You are saying that because there are more POVs now, GRRM has less room in each book to devote to each story. As a result, he must make sure that each chapter is absolutely essential to the book, and that is, at least partially, why things like Meereen are so knotty for him. Did I get that right?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8ce5c", "score_hidden": false, "stickied": false, "created": 1492151690.0, "created_utc": 1492122890.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg85uux", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Black_Sin", "parent_id": "t1_dg84w0y", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "And only 8 POVS:", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And only 8 POVS:&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg85uux", "score_hidden": false, "stickied": false, "created": 1492143738.0, "created_utc": 1492114938.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84w0y", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "FreeParking42", "parent_id": "t1_dg81v4s", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Winterfell and King's Landing both had four POVs each.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Winterfell and King&amp;#39;s Landing both had four POVs each.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg84w0y", "score_hidden": false, "stickied": false, "created": 1492142674.0, "created_utc": 1492113874.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81v4s", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Black_Sin", "parent_id": "t1_dg7xjyl", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Small numbers of POVS and the story being fairly linear. He had a lot more breathing space to do whatever he wanted.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Small numbers of POVS and the story being fairly linear. He had a lot more breathing space to do whatever he wanted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg81v4s", "score_hidden": false, "stickied": false, "created": 1492139388.0, "created_utc": 1492110588.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7xjyl", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "FreeParking42", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "One wonders how GRRM was ever able to finish AGOT what with the Winterfell knot, King's Landing knot, and Eyrie knot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One wonders how GRRM was ever able to finish AGOT what with the Winterfell knot, King&amp;#39;s Landing knot, and Eyrie knot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7xjyl", "score_hidden": false, "stickied": false, "created": 1492134771.0, "created_utc": 1492105971.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg7rb4e", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "notmyrealnom", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "All this does is remind me that I really need to re-read the books. I'd forgotten half of what happened. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All this does is remind me that I really need to re-read the books. I&amp;#39;d forgotten half of what happened. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7rb4e", "score_hidden": false, "stickied": false, "created": 1492128124.0, "created_utc": 1492099324.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8sn0g", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "ViktorVonn", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; “I’m going to start pulling the threads back together in this one, I hope.” \n&gt;– MTV interview, 10/2/2012\n\nThat was five years ago. Take that in for a moment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;“I’m going to start pulling the threads back together in this one, I hope.” \n– MTV interview, 10/2/2012&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That was five years ago. Take that in for a moment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8sn0g", "score_hidden": false, "stickied": false, "created": 1492175373.0, "created_utc": 1492146573.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dga61zv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fyodor_mikhailovich", "parent_id": "t1_dg860m2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Considering Samwell had 5 chapters in 3&amp; 4 and none in 5, he is one of grrm's most sympathetic charaters, Oldtown is one of the most important cities in Westeros, and the intrigue of the Maesters has been ratcheted up with Marwen, I expect there to be some solid Samwell chapters.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Considering Samwell had 5 chapters in 3&amp;amp; 4 and none in 5, he is one of grrm&amp;#39;s most sympathetic charaters, Oldtown is one of the most important cities in Westeros, and the intrigue of the Maesters has been ratcheted up with Marwen, I expect there to be some solid Samwell chapters.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dga61zv", "score_hidden": false, "stickied": false, "created": 1492252835.0, "created_utc": 1492224035.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg860m2", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "EuronTargaryen", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "How about Oldtown with Euron, Sam, the Hightowers, the Citadel?  I feel like that's a pretty chunk of built up action that's already been hinted at in The Forsaken (TWOW).  One that I'm personally pretty excited for.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How about Oldtown with Euron, Sam, the Hightowers, the Citadel?  I feel like that&amp;#39;s a pretty chunk of built up action that&amp;#39;s already been hinted at in The Forsaken (TWOW).  One that I&amp;#39;m personally pretty excited for.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg860m2", "score_hidden": false, "stickied": false, "created": 1492143916.0, "created_utc": 1492115116.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8idfq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "myjellyknowshowtojam", "parent_id": "t1_dg87n0q", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I read that Jeyne asks for The Gift for Ramsey, and that Arya would mercy kill LS.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read that Jeyne asks for The Gift for Ramsey, and that Arya would mercy kill LS.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8idfq", "score_hidden": false, "stickied": false, "created": 1492159756.0, "created_utc": 1492130956.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8mly2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sean_psc", "parent_id": "t1_dg8mexo", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "No, since that would involve Massey relinquishing control over her, which isn't something a self-interested fellow would do when the decision is solely his.\n\nAlso, assuming he hears Stannis is dead, the Mormonts and the Mountain Clans would be presumed to have been crushed along with him, so that probably wouldn't make much sense anyway.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, since that would involve Massey relinquishing control over her, which isn&amp;#39;t something a self-interested fellow would do when the decision is solely his.&lt;/p&gt;\n\n&lt;p&gt;Also, assuming he hears Stannis is dead, the Mormonts and the Mountain Clans would be presumed to have been crushed along with him, so that probably wouldn&amp;#39;t make much sense anyway.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8mly2", "score_hidden": false, "stickied": false, "created": 1492165625.0, "created_utc": 1492136825.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mexo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "beastMaster95", "parent_id": "t1_dg87n0q", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Wouldn't it be more plausible to send Jeyne to a Stark Loyalist like the Mormonts or the Mountain clans after finding Jon dead in the Wall than Braavos ?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wouldn&amp;#39;t it be more plausible to send Jeyne to a Stark Loyalist like the Mormonts or the Mountain clans after finding Jon dead in the Wall than Braavos ?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8mexo", "score_hidden": false, "stickied": false, "created": 1492165345.0, "created_utc": 1492136545.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87n0q", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "sean_psc", "parent_id": "t1_dg7v38c", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;   Considering Jon wanted to send 'Arya' to Braavos, but he's dead now. So if he's not there alive then why would anyone send her to Braavos. Wouldn't it be more plausible to send her to a Stark loyalist as for everyone she's Arya Stark, daughter of Lord Eddard Stark. Stannis must possibly know her value and he wanted to send her to Jon 'cos as far as he knows Jon's her only living family left. Also why would Jeyne even want to go with Tycho into an unseen region. She's not like Arya who wanted to see the world.\n\nStannis gave orders for Justin Massey to go to Braavos; the theory generally assumes that, arriving at the Wall and finding Jon dead, he'll take Jeyne with him.  There's nowhere else obvious to send her, and Jeyne is a psychological wreck who'll go wherever the person with custody of her wants.\n\nHowever, I don't much care for the theories that Jeyne is going to end up being mercy-killed by Arya in Braavos.  What exactly was the point of Theon's big redemptive moment in helping to save Jeyne if she's just going to die immediately afterward?  If what she wanted most was to commit suicide, she could have done that in Winterfell.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Considering Jon wanted to send &amp;#39;Arya&amp;#39; to Braavos, but he&amp;#39;s dead now. So if he&amp;#39;s not there alive then why would anyone send her to Braavos. Wouldn&amp;#39;t it be more plausible to send her to a Stark loyalist as for everyone she&amp;#39;s Arya Stark, daughter of Lord Eddard Stark. Stannis must possibly know her value and he wanted to send her to Jon &amp;#39;cos as far as he knows Jon&amp;#39;s her only living family left. Also why would Jeyne even want to go with Tycho into an unseen region. She&amp;#39;s not like Arya who wanted to see the world.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Stannis gave orders for Justin Massey to go to Braavos; the theory generally assumes that, arriving at the Wall and finding Jon dead, he&amp;#39;ll take Jeyne with him.  There&amp;#39;s nowhere else obvious to send her, and Jeyne is a psychological wreck who&amp;#39;ll go wherever the person with custody of her wants.&lt;/p&gt;\n\n&lt;p&gt;However, I don&amp;#39;t much care for the theories that Jeyne is going to end up being mercy-killed by Arya in Braavos.  What exactly was the point of Theon&amp;#39;s big redemptive moment in helping to save Jeyne if she&amp;#39;s just going to die immediately afterward?  If what she wanted most was to commit suicide, she could have done that in Winterfell.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg87n0q", "score_hidden": false, "stickied": false, "created": 1492145757.0, "created_utc": 1492116957.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg9vawp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DutchArya", "parent_id": "t1_dg97pmx", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Actually Catelyn thought Arya was alive, just lost somewhere. It's Robb that corrects her and tells her there is no way Arya has survived this long. So what is very curious.... is Robb leaving Arya out of the list of dead siblings. Why would George do that? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually Catelyn thought Arya was alive, just lost somewhere. It&amp;#39;s Robb that corrects her and tells her there is no way Arya has survived this long. So what is very curious.... is Robb leaving Arya out of the list of dead siblings. Why would George do that? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9vawp", "score_hidden": false, "stickied": false, "created": 1492238193.0, "created_utc": 1492209393.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dga3unb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "beastMaster95", "parent_id": "t1_dg97pmx", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Exactly. LSH is not as mad as we make her out to be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly. LSH is not as mad as we make her out to be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dga3unb", "score_hidden": false, "stickied": false, "created": 1492249673.0, "created_utc": 1492220873.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97pmx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JustNedsGirl", "parent_id": "t1_dg91dca", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; What ever happened to Sansa, does LS not care? \n\nIf ser Shadrich, Mad Mouse is Howland, and LS is working with him, George will not say it ...yet. I think she sent someone to Winterfell, too, to find out what is going on there. And George didn't reveal it yet.\n\n&gt; and makes no mention of Arya\n\nIn the moment when Robb made Jon his heir, Catelyn thought Arya is dead. Later on when she is with BWB, she knows Arya survived KL, and was alive until she left them, and was seen with Hound ... and LS is actively searching for her. Also, LS organized orphanage, and has loyalty and support of Gendry, tavern girls ... if she is all about revenge, why bother with some orphanage?\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What ever happened to Sansa, does LS not care? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If ser Shadrich, Mad Mouse is Howland, and LS is working with him, George will not say it ...yet. I think she sent someone to Winterfell, too, to find out what is going on there. And George didn&amp;#39;t reveal it yet.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;and makes no mention of Arya&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In the moment when Robb made Jon his heir, Catelyn thought Arya is dead. Later on when she is with BWB, she knows Arya survived KL, and was alive until she left them, and was seen with Hound ... and LS is actively searching for her. Also, LS organized orphanage, and has loyalty and support of Gendry, tavern girls ... if she is all about revenge, why bother with some orphanage?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg97pmx", "score_hidden": false, "stickied": false, "created": 1492209829.0, "created_utc": 1492181029.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg91dca", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DutchArya", "parent_id": "t1_dg7v38c", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;The fandom always takes this two for granted as you mentioned, so please explain to me why??\n\nDo you mean Arya &amp; Jeyne? I don't know why they aren't discussed more as their plotline and eventual meeting will be very impactful.\n\n\n&gt;Considering Jon wanted to send 'Arya' to Braavos, but he's dead now. So if he's not there alive then why would anyone send her to Braavos. \n\nThe fact that Jon is dead and the manner of his death will be the reason getting \"Arya\" somewhere safe and away from the Wall is important. George added that random thought in Jon's chapter pointing out how unsafe it would be for her at the Wall and hiding her away in Braavos was an option. Then Jeyne is suddenly in the hands of a Braavosi Iron Banker? Very convenient. You see where George is going with this. Sending Massey to Braavos is another link to Arya as well as the Iron Bank's involvement with both Stannis/Jon.\n\n&gt;Stannis must possibly know her value and he wanted to send her to Jon 'cos as far as he knows Jon's her only living family left. \n\nStannis let fArya travel to the Wall in a very dangerous time with not much protection. How much does he really value her? He never addresses fArya by her name and seems rather dismissive. What are the chances he knows Jeyne is a fake? Pretty high. \n\n&gt;looking for Arya.\n\nThat is key. Why is she looking for Arya? She makes zero effort to go to the Vale after news of her sister's death. What ever happened to Sansa, does LS not care? Brienne is trying to find Sansa and the whole time she is actually on Arya's trail. LS was at Robb's sealing of his Will and George does something very odd. Robb makes Jon his heir, and lists his dead siblings: Bran, Rickon... and makes no mention of Arya. Sansa is disinherited and Catalyn agrees with him. LS is weeping over Robb's KiTN bronze crown and George makes a point of mentioning that... I wonder why? \n\nI think LS's purpose in the story is a lesson to Arya about where vengeance will lead her. LS is a cautionary tale.  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The fandom always takes this two for granted as you mentioned, so please explain to me why??&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Do you mean Arya &amp;amp; Jeyne? I don&amp;#39;t know why they aren&amp;#39;t discussed more as their plotline and eventual meeting will be very impactful.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Considering Jon wanted to send &amp;#39;Arya&amp;#39; to Braavos, but he&amp;#39;s dead now. So if he&amp;#39;s not there alive then why would anyone send her to Braavos. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The fact that Jon is dead and the manner of his death will be the reason getting &amp;quot;Arya&amp;quot; somewhere safe and away from the Wall is important. George added that random thought in Jon&amp;#39;s chapter pointing out how unsafe it would be for her at the Wall and hiding her away in Braavos was an option. Then Jeyne is suddenly in the hands of a Braavosi Iron Banker? Very convenient. You see where George is going with this. Sending Massey to Braavos is another link to Arya as well as the Iron Bank&amp;#39;s involvement with both Stannis/Jon.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Stannis must possibly know her value and he wanted to send her to Jon &amp;#39;cos as far as he knows Jon&amp;#39;s her only living family left. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Stannis let fArya travel to the Wall in a very dangerous time with not much protection. How much does he really value her? He never addresses fArya by her name and seems rather dismissive. What are the chances he knows Jeyne is a fake? Pretty high. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;looking for Arya.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That is key. Why is she looking for Arya? She makes zero effort to go to the Vale after news of her sister&amp;#39;s death. What ever happened to Sansa, does LS not care? Brienne is trying to find Sansa and the whole time she is actually on Arya&amp;#39;s trail. LS was at Robb&amp;#39;s sealing of his Will and George does something very odd. Robb makes Jon his heir, and lists his dead siblings: Bran, Rickon... and makes no mention of Arya. Sansa is disinherited and Catalyn agrees with him. LS is weeping over Robb&amp;#39;s KiTN bronze crown and George makes a point of mentioning that... I wonder why? &lt;/p&gt;\n\n&lt;p&gt;I think LS&amp;#39;s purpose in the story is a lesson to Arya about where vengeance will lead her. LS is a cautionary tale.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg91dca", "score_hidden": false, "stickied": false, "created": 1492199339.0, "created_utc": 1492170539.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7v38c", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "beastMaster95", "parent_id": "t1_dg7tfhw", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "The fandom always takes this two for granted as you mentioned, so please explain to me why??\n\n&gt;Jon already hints at Jeyne's likely fate in Winds. Hide her in Braavos. That's where he planned to send Arya. Jeyne is currently in the company of an Iron Banker after all.\nArya meets her Imposter in Jeyne and learns what being Arya Stark is truly like in Winterfell\n\n&amp;nbsp;\nConsidering Jon wanted to send 'Arya' to Braavos, but he's dead now. So if he's not there alive then why would anyone send her to Braavos. Wouldn't it be more plausible to send her to a Stark loyalist as for everyone she's Arya Stark, daughter of Lord Eddard Stark. Stannis must possibly know her value and he wanted to send her to Jon 'cos as far as he knows Jon's her only living family left. Also why would Jeyne even want to go with Tycho into an unseen region. She's not like Arya who wanted to see the world.\n\n&gt;Lady Stoneheart and Arya will cross paths in the Riverlands once she returns from Braavos. After giving Mother Merciless the gift of mercy - Robb's Crown might enter Arya's possession.\n\n&amp;nbsp;\n*If they even meet and Arya will give mercy to her mother on seeing what happened to her.* This comes from considering LSH is a wacko. But reading between the lines it doesn't seem like it. LSH is mad as Catelyn went mad before her death and was resurrected as such. But her extreme initial bloodlust was satiated and she's planning something big, possibly the hinted RW2.0.  She doesn't appear utterly crazy now as she's been helping out the smallfolk, she had some rapers hanged, is running an orphanage, looking for Arya. Yes she's killing all the Freys but why she wouldn't after the RW. The BWB under LSH do protect the common people more extensively than ever. Beric never established orphanages and only to a very limited extent punished criminals. Our impression as readers is skewed here as Cat as Zombie= Mad and nothing else. Brienne's situation was justified from LSH's pov as everything of Brienne seemed Lannister'd from sword, coins, armor, letter, uttering Jaime constantly no wonder LSH thought she was betrayed by her and Brienne now works for the Lannisters. Sorry for the rant but i was thinking why won't Arya and LSH work together instead?? \n\n", "edited": 1492111508.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The fandom always takes this two for granted as you mentioned, so please explain to me why??&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Jon already hints at Jeyne&amp;#39;s likely fate in Winds. Hide her in Braavos. That&amp;#39;s where he planned to send Arya. Jeyne is currently in the company of an Iron Banker after all.\nArya meets her Imposter in Jeyne and learns what being Arya Stark is truly like in Winterfell&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;nbsp;\nConsidering Jon wanted to send &amp;#39;Arya&amp;#39; to Braavos, but he&amp;#39;s dead now. So if he&amp;#39;s not there alive then why would anyone send her to Braavos. Wouldn&amp;#39;t it be more plausible to send her to a Stark loyalist as for everyone she&amp;#39;s Arya Stark, daughter of Lord Eddard Stark. Stannis must possibly know her value and he wanted to send her to Jon &amp;#39;cos as far as he knows Jon&amp;#39;s her only living family left. Also why would Jeyne even want to go with Tycho into an unseen region. She&amp;#39;s not like Arya who wanted to see the world.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Lady Stoneheart and Arya will cross paths in the Riverlands once she returns from Braavos. After giving Mother Merciless the gift of mercy - Robb&amp;#39;s Crown might enter Arya&amp;#39;s possession.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;nbsp;\n&lt;em&gt;If they even meet and Arya will give mercy to her mother on seeing what happened to her.&lt;/em&gt; This comes from considering LSH is a wacko. But reading between the lines it doesn&amp;#39;t seem like it. LSH is mad as Catelyn went mad before her death and was resurrected as such. But her extreme initial bloodlust was satiated and she&amp;#39;s planning something big, possibly the hinted RW2.0.  She doesn&amp;#39;t appear utterly crazy now as she&amp;#39;s been helping out the smallfolk, she had some rapers hanged, is running an orphanage, looking for Arya. Yes she&amp;#39;s killing all the Freys but why she wouldn&amp;#39;t after the RW. The BWB under LSH do protect the common people more extensively than ever. Beric never established orphanages and only to a very limited extent punished criminals. Our impression as readers is skewed here as Cat as Zombie= Mad and nothing else. Brienne&amp;#39;s situation was justified from LSH&amp;#39;s pov as everything of Brienne seemed Lannister&amp;#39;d from sword, coins, armor, letter, uttering Jaime constantly no wonder LSH thought she was betrayed by her and Brienne now works for the Lannisters. Sorry for the rant but i was thinking why won&amp;#39;t Arya and LSH work together instead?? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7v38c", "score_hidden": false, "stickied": false, "created": 1492132147.0, "created_utc": 1492103347.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7tfhw", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "DutchArya", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Jon already hints at Jeyne's likely fate in Winds. Hide her in Braavos. That's where he planned to send Arya. Jeyne is currently in the company of an Iron Banker after all. \n\nArya meets her Imposter in Jeyne and learns what being Arya Stark is truly like in Winterfell. Perhaps Arya's list grows with Ramsay's name added to it. I think Jeyne prays for this and asks for the Gift or pledges to serve the HoBW for the rest of her life. \n\nLearning of Jon's death will send Arya back to Westeros to kill the people who took his life. \n\nLady Stoneheart and Arya will cross paths in the Riverlands once she returns from Braavos. After giving Mother Merciless the gift of mercy - Robb's Crown might enter Arya's possession. (LS has had it all along). Slipping into Winterfell and meeting Ramsay would fit both Arya's skills and narrative.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jon already hints at Jeyne&amp;#39;s likely fate in Winds. Hide her in Braavos. That&amp;#39;s where he planned to send Arya. Jeyne is currently in the company of an Iron Banker after all. &lt;/p&gt;\n\n&lt;p&gt;Arya meets her Imposter in Jeyne and learns what being Arya Stark is truly like in Winterfell. Perhaps Arya&amp;#39;s list grows with Ramsay&amp;#39;s name added to it. I think Jeyne prays for this and asks for the Gift or pledges to serve the HoBW for the rest of her life. &lt;/p&gt;\n\n&lt;p&gt;Learning of Jon&amp;#39;s death will send Arya back to Westeros to kill the people who took his life. &lt;/p&gt;\n\n&lt;p&gt;Lady Stoneheart and Arya will cross paths in the Riverlands once she returns from Braavos. After giving Mother Merciless the gift of mercy - Robb&amp;#39;s Crown might enter Arya&amp;#39;s possession. (LS has had it all along). Slipping into Winterfell and meeting Ramsay would fit both Arya&amp;#39;s skills and narrative.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7tfhw", "score_hidden": false, "stickied": false, "created": 1492130392.0, "created_utc": 1492101592.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg93jb5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FreeParking42", "parent_id": "t1_dg90ju0", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Get hype?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get hype?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg93jb5", "score_hidden": false, "stickied": false, "created": 1492203741.0, "created_utc": 1492174941.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg90ju0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cruciaremors", "parent_id": "t1_dg872zu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Ain't BBF but I can answer that: 115% confirmed", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ain&amp;#39;t BBF but I can answer that: 115% confirmed&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg90ju0", "score_hidden": false, "stickied": false, "created": 1492197246.0, "created_utc": 1492168446.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg872zu", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "euronforpresident", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Hey Brynden can you confirm how realistic it could be that you've written more about the series in the past six years than GrrM has written of the sixth book?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey Brynden can you confirm how realistic it could be that you&amp;#39;ve written more about the series in the past six years than GrrM has written of the sixth book?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg872zu", "score_hidden": false, "stickied": false, "created": 1492145122.0, "created_utc": 1492116322.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg7tvc8", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "SprayBacon", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "The only way he's finishing all this up in seven books is if a ton of characters die in each of these \"knots,\" thereby tying up (or chopping off) a lot of loose ends. I don't have a clear idea of how I think Winterfell, King's Landing and Volantis will go, but I'm fairly certain that Meereen will be reduced to ashes, Barristan and many of her companions will die, and the only things Dany will have left afterward are her dragons (at least Drogon), a shiny new khalasar, and an all-consuming thirst for fire and blood. She will realize that for all of her good intentions, she brought only famine and death to Slaver's Bay and trying to change things there was a naive, futile dream. And then hopefully, finally, she will head to Westeros to reclaim what she views as her rightful throne.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only way he&amp;#39;s finishing all this up in seven books is if a ton of characters die in each of these &amp;quot;knots,&amp;quot; thereby tying up (or chopping off) a lot of loose ends. I don&amp;#39;t have a clear idea of how I think Winterfell, King&amp;#39;s Landing and Volantis will go, but I&amp;#39;m fairly certain that Meereen will be reduced to ashes, Barristan and many of her companions will die, and the only things Dany will have left afterward are her dragons (at least Drogon), a shiny new khalasar, and an all-consuming thirst for fire and blood. She will realize that for all of her good intentions, she brought only famine and death to Slaver&amp;#39;s Bay and trying to change things there was a naive, futile dream. And then hopefully, finally, she will head to Westeros to reclaim what she views as her rightful throne.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7tvc8", "score_hidden": false, "stickied": false, "created": 1492130862.0, "created_utc": 1492102062.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg943t4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "deej363", "parent_id": "t1_dg7zlvx", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I feel like cersei might be higher on that list than a boy king. Edit: granted Nym may hit whatever she can.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like cersei might be higher on that list than a boy king. Edit: granted Nym may hit whatever she can.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg943t4", "score_hidden": false, "stickied": false, "created": 1492204704.0, "created_utc": 1492175904.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7zlvx", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Snusmumrikin", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;Lady Nym is coming to take the Dornish Seat on the small council. What will her role be in the small council?\n\nmurdering Tommen of course", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Lady Nym is coming to take the Dornish Seat on the small council. What will her role be in the small council?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;murdering Tommen of course&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7zlvx", "score_hidden": false, "stickied": false, "created": 1492136945.0, "created_utc": 1492108145.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg7yfoi", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Toastasaurus", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "My personal read on Dany and Volantis was actually going to be Dany being forced to abandon the city to pursue her agenda in Westeros, to effectively commit to not doing the same thing in Volantis that she tried in Mereen.\n\nOf course, that's mostly a gut-feeling guess I had awhile back that wasn't seriously challenged at the time, because I thought it'd be super interesting with Volantines telling Tyrion that the slaves were waiting for her, if Dany were forced to simply abandon them.\n\nEh, I have a lot less evidence, I just thought it'd be the most expedient way to get Dany's sorry ass in Westeros while actually putting some of that foreshadowing to use in an important character moment.", "edited": 1492107643.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My personal read on Dany and Volantis was actually going to be Dany being forced to abandon the city to pursue her agenda in Westeros, to effectively commit to not doing the same thing in Volantis that she tried in Mereen.&lt;/p&gt;\n\n&lt;p&gt;Of course, that&amp;#39;s mostly a gut-feeling guess I had awhile back that wasn&amp;#39;t seriously challenged at the time, because I thought it&amp;#39;d be super interesting with Volantines telling Tyrion that the slaves were waiting for her, if Dany were forced to simply abandon them.&lt;/p&gt;\n\n&lt;p&gt;Eh, I have a lot less evidence, I just thought it&amp;#39;d be the most expedient way to get Dany&amp;#39;s sorry ass in Westeros while actually putting some of that foreshadowing to use in an important character moment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7yfoi", "score_hidden": false, "stickied": false, "created": 1492135705.0, "created_utc": 1492106905.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg9ljn5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "deej363", "parent_id": "t1_dg9hges", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I agree. Also I think it would make a lot of narrative sense for Rhaegar to have named him Aemon, and then for Jon to be a protector, with all his kingsguard foreshadowing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree. Also I think it would make a lot of narrative sense for Rhaegar to have named him Aemon, and then for Jon to be a protector, with all his kingsguard foreshadowing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9ljn5", "score_hidden": false, "stickied": false, "created": 1492226021.0, "created_utc": 1492197221.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9hges", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JLake4", "parent_id": "t1_dg952bq", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think you're right, it never sat well that he was crowned KITN in the show so quickly and with multiple trueborn Starks still around (as well as sitting next to him). The show likelu collapsed some plot points together to make that happen when it did, and with Davos out hunting for Rickon I assume he still has a role to play in the North.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re right, it never sat well that he was crowned KITN in the show so quickly and with multiple trueborn Starks still around (as well as sitting next to him). The show likelu collapsed some plot points together to make that happen when it did, and with Davos out hunting for Rickon I assume he still has a role to play in the North.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9hges", "score_hidden": false, "stickied": false, "created": 1492221139.0, "created_utc": 1492192339.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg952bq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "deej363", "parent_id": "t1_dg89bw0", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Also whether or not Jon would actually want to be KITN while Rickon was still alive. I could definitely see Jon just saying \"No thanks\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also whether or not Jon would actually want to be KITN while Rickon was still alive. I could definitely see Jon just saying &amp;quot;No thanks&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg952bq", "score_hidden": false, "stickied": false, "created": 1492206189.0, "created_utc": 1492177389.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg89bw0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "JLake4", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "According to the quote regarding the Meereenese Knot, Martin wrote three versions of the Quentyn Martell arrival to see which fit best. Does it follow that he could be working through these knots in the same fashion? If he's essentially writing three books, that would help explain the delay. \n\nAs for resolutions... I have no idea. I know what *I* want, but that's not a fantastic framework to go on from (unless you, too, have bent the knee to King Stannis Baratheon). I would expect Stannis to defeat Roose Bolton, but I agree that while he may liberate Winterfell and free the North the return of Jon Snow and the revelation that he is Robb Stark's chosen heir will likely bleed Stannis of support before he reaches Moat Cailin. Rickon is a trueborn Stark, though, which could complicate things for Jon Snow too, no? \n\nIt's a lot to think on. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;According to the quote regarding the Meereenese Knot, Martin wrote three versions of the Quentyn Martell arrival to see which fit best. Does it follow that he could be working through these knots in the same fashion? If he&amp;#39;s essentially writing three books, that would help explain the delay. &lt;/p&gt;\n\n&lt;p&gt;As for resolutions... I have no idea. I know what &lt;em&gt;I&lt;/em&gt; want, but that&amp;#39;s not a fantastic framework to go on from (unless you, too, have bent the knee to King Stannis Baratheon). I would expect Stannis to defeat Roose Bolton, but I agree that while he may liberate Winterfell and free the North the return of Jon Snow and the revelation that he is Robb Stark&amp;#39;s chosen heir will likely bleed Stannis of support before he reaches Moat Cailin. Rickon is a trueborn Stark, though, which could complicate things for Jon Snow too, no? &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a lot to think on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg89bw0", "score_hidden": false, "stickied": false, "created": 1492147768.0, "created_utc": 1492118968.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg7ttt9", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "jonestony710", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;Meereen\n\nI personally think we're about to see a pretty interesting quasi sitcom go down after the Battle of Fire. I really don't see any of our POVs or mains going down, considering the Yunkai'i are really about to get slaughtered. Yes, I've seen the theories that the Shavepate will close the doors on Barristan at some point, but who would he be running from? The Yunkai'i are about to lose their sellswords, their slave soldiers aren't the best (chaining them together doesn't help), Victarion is about to pound their rear (*heh*), and I think the Volantis slaves will revolt.\n\nThe Victarion/Dragonbinder debacle is really what's got me in a loop, but I think Victarion is Dany's second \"bride of fire\" husband, the \"corpse on the prow of a ship, grey lips smiling sadly\". I don't think Victarion is already dead and Moqorro resurrected him, he just did some magic fire arm shit, but this doesn't mean Moqorro won't resurrect Victarion in the near future, especially if Vic decides to blow dragonbinder (but I don't think he will, he knows what happens to those who do).\n\nI feel that Tyrion, Barristan, and Victarion will join up and have to deal with the Shavepate's killing of the hostages, and probably Hizdahr, and try to keep the city in order. I don't like to use the show as reference, but I think they swapped Varys for Barristan as the Tyrion councillor in this time. None of the three will trust the other fully, so it should be interesting.\n\nRegarding the Dornish, I think Drink and Arch both make it out alive, and decide to stick on with Dany. Eventually word will reach Doran that Quentyn was roasted, and I think he'll also find out that Drink and Arch are with Dany (Doran himself already claiming for Aegon), and start to get suspicious that the Yronwoods secretly murdered Quentyn, and this will cause further problems in Dorne. GRRM is definitely setting up a Martell/Yronwood conflict. Quentyn was the only hope for that relationship to ever be a good one, and well, *Oh.*\n\nMy question here is, where exactly is Marwyn at this point in time? Is there any good guesses to that? I've seen it tossed around before that he meets Dany in Volantis, but the Swan Ships are famously very fast, so he could make it to Meereen in good time, especially if they got some of that good Euron wind that Vic got.\n\n&gt;Winterfell\n\nTotally buy into the night lamp, Stannis faked his death, etc, will take Winterfell through trickery, maybe sorcery/glamors.\n\nTheon's role is a huge wild card for me, I'm starting to lean towards Bran skinchanging Theon when at the Heart tree, but that's kind of a stretch. What's more likely is that once they bring Theon out to the tree, a murder of ravens is going to descend shouting his name, and gods know what else, live? Bran? And this will totally spook the northerners and probably prevent Stannis from killing him as well. Either that or Arnolf Karstark gets murdered in Theon's place, maybe glamored as the latter.\n\nOnce Jon is resurrected, I think he heads to Hardhome. I also think Mel takes him north of the wall to do the resurrection, and no one really witnesses it, maybe Val or Tormund, some other NW members tag along. But this line in Mel's POV really sticks out to me:\n\n&gt;\"Lord Snow has need of me, beyond the Wall.\" ***He does not know it yet, but soon...***\n\nSelyse and co most likely flee Castle Black in the confusion, maybe heading to the Nightfort, could also go to Deepwood Motte knowing Stannis had taken it, and it's not far. Eventually they make it to Winterfell upon learning Stannis still lives.\n\nJon makes it to Hardhome only to find it pretty desolate, grabs the remaining Wildlings, and when they make it back to the wall, they gather the rest to march on Winterfell, only to find Stannis had taken it.\n\nThe inside Winterfell post-Stannis capture must be an insane knot. When does he burn Shireen, and who is there? You'd have to assume it's post wall falling, and I can't imagine Jon or Davos being there, so where are they? If Rickon is back, does Stannis marry him to Shireen? How will our new Wild Wolf take it when his betrothed gets crisped?\n\nJustin Massey will take Jeyne to Braavos. I think he marries her, thinking she's Arya, only to find out from the real Arya that she's not, when they inevitably run into one another. Justin gets the bride he's looking for, but it's not a Lord Paramount's daughter like he was hoping. No idea where he and Jeyne go from there.\n\n&gt;Arya\n\nI don't think the FM punish/kick out Arya yet for killing Raff, she probably still has to go learn from the Black Pearl, but she'll want to leave on her own. Who knows how they'll take this? Are they cool with a rogue protege just leaving, or do they actually send someone after her? The waif/Arya confrontation could turn out to be real, just not as cheesy as the show made it out to be, and it won't be personal for the Waif. There will definitely be no \"now you are truly no one\" moment, because Arya never will be in the eyes of the FM.\n\n&gt;The Rest\n\nThere's so much going on elsewhere, it would take days to write all about or speculate, but I think we can get a pretty good idea. Sam finds out some good info in Oldtown before Euron invades and blows the Horn of Winter. Cersei wins her trial, starts building up some power, and unleashes some sort of wrath before Aegon invades. Myrcella and Tommen will probably be dead before Aegon gets there, or will die in the confusion. It's possible Tommen dies first, and Cersei crowns Myrcella, which would be fitting considering it's been stated by so many in the story that crowning Myrcella will kill Myrcella. This also can set a precedent for any future Queens: Dany, Sansa, etc. There's got to be some sort of grey scale outbreak, but it won't be significant enough to have a major impact on the rest of the story. I think it's mainly a plot device for Jon Con to make rash decisions. Sansa will rally the Vale, unmask LF for who he really is, and I thinks he invades the Riverlands first, which will probably already be in open rebellion after RW2.0, and unites them, coming with the full force of the Riverlands and Vale to the North. Her and Edmure leading the army.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Meereen&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I personally think we&amp;#39;re about to see a pretty interesting quasi sitcom go down after the Battle of Fire. I really don&amp;#39;t see any of our POVs or mains going down, considering the Yunkai&amp;#39;i are really about to get slaughtered. Yes, I&amp;#39;ve seen the theories that the Shavepate will close the doors on Barristan at some point, but who would he be running from? The Yunkai&amp;#39;i are about to lose their sellswords, their slave soldiers aren&amp;#39;t the best (chaining them together doesn&amp;#39;t help), Victarion is about to pound their rear (&lt;em&gt;heh&lt;/em&gt;), and I think the Volantis slaves will revolt.&lt;/p&gt;\n\n&lt;p&gt;The Victarion/Dragonbinder debacle is really what&amp;#39;s got me in a loop, but I think Victarion is Dany&amp;#39;s second &amp;quot;bride of fire&amp;quot; husband, the &amp;quot;corpse on the prow of a ship, grey lips smiling sadly&amp;quot;. I don&amp;#39;t think Victarion is already dead and Moqorro resurrected him, he just did some magic fire arm shit, but this doesn&amp;#39;t mean Moqorro won&amp;#39;t resurrect Victarion in the near future, especially if Vic decides to blow dragonbinder (but I don&amp;#39;t think he will, he knows what happens to those who do).&lt;/p&gt;\n\n&lt;p&gt;I feel that Tyrion, Barristan, and Victarion will join up and have to deal with the Shavepate&amp;#39;s killing of the hostages, and probably Hizdahr, and try to keep the city in order. I don&amp;#39;t like to use the show as reference, but I think they swapped Varys for Barristan as the Tyrion councillor in this time. None of the three will trust the other fully, so it should be interesting.&lt;/p&gt;\n\n&lt;p&gt;Regarding the Dornish, I think Drink and Arch both make it out alive, and decide to stick on with Dany. Eventually word will reach Doran that Quentyn was roasted, and I think he&amp;#39;ll also find out that Drink and Arch are with Dany (Doran himself already claiming for Aegon), and start to get suspicious that the Yronwoods secretly murdered Quentyn, and this will cause further problems in Dorne. GRRM is definitely setting up a Martell/Yronwood conflict. Quentyn was the only hope for that relationship to ever be a good one, and well, &lt;em&gt;Oh.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;My question here is, where exactly is Marwyn at this point in time? Is there any good guesses to that? I&amp;#39;ve seen it tossed around before that he meets Dany in Volantis, but the Swan Ships are famously very fast, so he could make it to Meereen in good time, especially if they got some of that good Euron wind that Vic got.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Winterfell&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Totally buy into the night lamp, Stannis faked his death, etc, will take Winterfell through trickery, maybe sorcery/glamors.&lt;/p&gt;\n\n&lt;p&gt;Theon&amp;#39;s role is a huge wild card for me, I&amp;#39;m starting to lean towards Bran skinchanging Theon when at the Heart tree, but that&amp;#39;s kind of a stretch. What&amp;#39;s more likely is that once they bring Theon out to the tree, a murder of ravens is going to descend shouting his name, and gods know what else, live? Bran? And this will totally spook the northerners and probably prevent Stannis from killing him as well. Either that or Arnolf Karstark gets murdered in Theon&amp;#39;s place, maybe glamored as the latter.&lt;/p&gt;\n\n&lt;p&gt;Once Jon is resurrected, I think he heads to Hardhome. I also think Mel takes him north of the wall to do the resurrection, and no one really witnesses it, maybe Val or Tormund, some other NW members tag along. But this line in Mel&amp;#39;s POV really sticks out to me:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Lord Snow has need of me, beyond the Wall.&amp;quot; &lt;strong&gt;&lt;em&gt;He does not know it yet, but soon...&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Selyse and co most likely flee Castle Black in the confusion, maybe heading to the Nightfort, could also go to Deepwood Motte knowing Stannis had taken it, and it&amp;#39;s not far. Eventually they make it to Winterfell upon learning Stannis still lives.&lt;/p&gt;\n\n&lt;p&gt;Jon makes it to Hardhome only to find it pretty desolate, grabs the remaining Wildlings, and when they make it back to the wall, they gather the rest to march on Winterfell, only to find Stannis had taken it.&lt;/p&gt;\n\n&lt;p&gt;The inside Winterfell post-Stannis capture must be an insane knot. When does he burn Shireen, and who is there? You&amp;#39;d have to assume it&amp;#39;s post wall falling, and I can&amp;#39;t imagine Jon or Davos being there, so where are they? If Rickon is back, does Stannis marry him to Shireen? How will our new Wild Wolf take it when his betrothed gets crisped?&lt;/p&gt;\n\n&lt;p&gt;Justin Massey will take Jeyne to Braavos. I think he marries her, thinking she&amp;#39;s Arya, only to find out from the real Arya that she&amp;#39;s not, when they inevitably run into one another. Justin gets the bride he&amp;#39;s looking for, but it&amp;#39;s not a Lord Paramount&amp;#39;s daughter like he was hoping. No idea where he and Jeyne go from there.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Arya&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think the FM punish/kick out Arya yet for killing Raff, she probably still has to go learn from the Black Pearl, but she&amp;#39;ll want to leave on her own. Who knows how they&amp;#39;ll take this? Are they cool with a rogue protege just leaving, or do they actually send someone after her? The waif/Arya confrontation could turn out to be real, just not as cheesy as the show made it out to be, and it won&amp;#39;t be personal for the Waif. There will definitely be no &amp;quot;now you are truly no one&amp;quot; moment, because Arya never will be in the eyes of the FM.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The Rest&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There&amp;#39;s so much going on elsewhere, it would take days to write all about or speculate, but I think we can get a pretty good idea. Sam finds out some good info in Oldtown before Euron invades and blows the Horn of Winter. Cersei wins her trial, starts building up some power, and unleashes some sort of wrath before Aegon invades. Myrcella and Tommen will probably be dead before Aegon gets there, or will die in the confusion. It&amp;#39;s possible Tommen dies first, and Cersei crowns Myrcella, which would be fitting considering it&amp;#39;s been stated by so many in the story that crowning Myrcella will kill Myrcella. This also can set a precedent for any future Queens: Dany, Sansa, etc. There&amp;#39;s got to be some sort of grey scale outbreak, but it won&amp;#39;t be significant enough to have a major impact on the rest of the story. I think it&amp;#39;s mainly a plot device for Jon Con to make rash decisions. Sansa will rally the Vale, unmask LF for who he really is, and I thinks he invades the Riverlands first, which will probably already be in open rebellion after RW2.0, and unites them, coming with the full force of the Riverlands and Vale to the North. Her and Edmure leading the army.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7ttt9", "score_hidden": false, "stickied": false, "created": 1492130816.0, "created_utc": 1492102016.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8hhhw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "qwertzinator", "parent_id": "t1_dg7pjmt", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; I wonder if originally Tyrion was going to end up being our POV for the Golden Company corral and there encounter Jorah. That would have made a bit more sense given that Jorah would likely have to resort to selling his sword (again) and perhaps Jorah might have heard that the Golden Company was considering going to Meereen. \n\nThat would make a lot of sense. Jorah, hearing that the GC is heading west instead of east, grabs Tyrion and makes for Volantis.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I wonder if originally Tyrion was going to end up being our POV for the Golden Company corral and there encounter Jorah. That would have made a bit more sense given that Jorah would likely have to resort to selling his sword (again) and perhaps Jorah might have heard that the Golden Company was considering going to Meereen. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That would make a lot of sense. Jorah, hearing that the GC is heading west instead of east, grabs Tyrion and makes for Volantis.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8hhhw", "score_hidden": false, "stickied": false, "created": 1492158549.0, "created_utc": 1492129749.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg7uldt", "gilded": 0, "archived": false, "score": -10, "report_reasons": null, "author": "palindrome_emordnila", "parent_id": "t1_dg7r899", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;Can't you just accept that in the ASOIAF universe (and every other fictional universe) things happen this way?\n  \nSure.  Because it's a soap opera and is written like a soap opera.  \n  \nI'm not the one who needs to come to grips with that.  I can enjoy a soap opera without it having to be high art.  \n   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Can&amp;#39;t you just accept that in the ASOIAF universe (and every other fictional universe) things happen this way?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sure.  Because it&amp;#39;s a soap opera and is written like a soap opera.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not the one who needs to come to grips with that.  I can enjoy a soap opera without it having to be high art.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7uldt", "score_hidden": false, "stickied": false, "created": 1492131622.0, "created_utc": 1492102822.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7r899", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Not_Done_Here", "parent_id": "t1_dg7pwix", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Can't you just accept that in the ASOIAF universe (and every other fictional universe) things happen this way? You can call it fate, you can call it luck or you can call it divine intervention. But you can't find a single fictional universe where something like this hasn't happened.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can&amp;#39;t you just accept that in the ASOIAF universe (and every other fictional universe) things happen this way? You can call it fate, you can call it luck or you can call it divine intervention. But you can&amp;#39;t find a single fictional universe where something like this hasn&amp;#39;t happened.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7r899", "score_hidden": false, "stickied": false, "created": 1492128038.0, "created_utc": 1492099238.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8dxqd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Black_Sin", "parent_id": "t1_dg88tk7", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;Every character Jon interacts with loses 80 IQ points anytime the \"I'm the HERO!\" plot line requires it.\n\nWell you'll have to come up with examples. I think the most frequently cited one is Mance but that's explainable. \n\n&gt;That's just the easiest example. Rob randomly marries a barely fleshed out cartoon character solely to set up RW. Marin might as well have just not mentioned him prior.\n\nThat's not really inconsistent characterization. In fact, Robb marrying Jeyne is consistent with his character for the reasons that have been restated over and over again on this subforum.\n\nJeyne isn't fleshed out because she's not important. \n\nI don't think complaining that she's there to serve a function is a legitimate complaint. That's how most ancillary characters work. \n\nAnd she still has a role to play in TWOW so who knows, maybe there'll be more to her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Every character Jon interacts with loses 80 IQ points anytime the &amp;quot;I&amp;#39;m the HERO!&amp;quot; plot line requires it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well you&amp;#39;ll have to come up with examples. I think the most frequently cited one is Mance but that&amp;#39;s explainable. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;That&amp;#39;s just the easiest example. Rob randomly marries a barely fleshed out cartoon character solely to set up RW. Marin might as well have just not mentioned him prior.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s not really inconsistent characterization. In fact, Robb marrying Jeyne is consistent with his character for the reasons that have been restated over and over again on this subforum.&lt;/p&gt;\n\n&lt;p&gt;Jeyne isn&amp;#39;t fleshed out because she&amp;#39;s not important. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think complaining that she&amp;#39;s there to serve a function is a legitimate complaint. That&amp;#39;s how most ancillary characters work. &lt;/p&gt;\n\n&lt;p&gt;And she still has a role to play in TWOW so who knows, maybe there&amp;#39;ll be more to her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8dxqd", "score_hidden": false, "stickied": false, "created": 1492153738.0, "created_utc": 1492124938.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg88tk7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "palindrome_emordnila", "parent_id": "t1_dg88fbw", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; Well that's the same with GRRM. I can't really remember a time his characters act completely inconsistent with what we know about them.\n\nEvery character Jon interacts with loses 80 IQ points anytime the \"I'm the HERO!\" plot line requires it.  \n  \nThat's just the easiest example.  Rob randomly marries a barely fleshed out cartoon character solely to set up RW.  Marin might as well have just not mentioned him prior.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Well that&amp;#39;s the same with GRRM. I can&amp;#39;t really remember a time his characters act completely inconsistent with what we know about them.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Every character Jon interacts with loses 80 IQ points anytime the &amp;quot;I&amp;#39;m the HERO!&amp;quot; plot line requires it.  &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s just the easiest example.  Rob randomly marries a barely fleshed out cartoon character solely to set up RW.  Marin might as well have just not mentioned him prior.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg88tk7", "score_hidden": false, "stickied": false, "created": 1492147152.0, "created_utc": 1492118352.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg88fbw", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Black_Sin", "parent_id": "t1_dg87mdo", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;Sure, but generally not in a way where pulp genre stuff is later seen as being of better quality than more 'serious' work of the same era.\n\nWell what would be a 'serious' work? Are we going to compare Dracula and The Picture of Dorian Gray to Thus Spoke Zarathustra? Now these are apples and oranges. That to me is actually incomparable because they're meant to do different things.\n\nAnd quality is such a nebulous concept once you're comparing different genres of similar levels of quality. It really boils down preference at a point. And I don't think one can actually distance themselves enough from their own biases. \n\n&gt;Except it doesn't, always. There's no shitty Nabokov book where he phoned it in. \n\nI've never read Nabokov. Lolita isn't my bag of tea. I can't say.\n\n&gt;Pynchon sometimes misses, he doesn't really write books where characters do things completely inconsistent with what you know about them.\n\nWell that's the same with GRRM. I can't really remember a time his characters act completely inconsistent with what we know about them. Characterization is one of his strong points. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Sure, but generally not in a way where pulp genre stuff is later seen as being of better quality than more &amp;#39;serious&amp;#39; work of the same era.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well what would be a &amp;#39;serious&amp;#39; work? Are we going to compare Dracula and The Picture of Dorian Gray to Thus Spoke Zarathustra? Now these are apples and oranges. That to me is actually incomparable because they&amp;#39;re meant to do different things.&lt;/p&gt;\n\n&lt;p&gt;And quality is such a nebulous concept once you&amp;#39;re comparing different genres of similar levels of quality. It really boils down preference at a point. And I don&amp;#39;t think one can actually distance themselves enough from their own biases. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Except it doesn&amp;#39;t, always. There&amp;#39;s no shitty Nabokov book where he phoned it in. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;ve never read Nabokov. Lolita isn&amp;#39;t my bag of tea. I can&amp;#39;t say.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Pynchon sometimes misses, he doesn&amp;#39;t really write books where characters do things completely inconsistent with what you know about them.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well that&amp;#39;s the same with GRRM. I can&amp;#39;t really remember a time his characters act completely inconsistent with what we know about them. Characterization is one of his strong points. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg88fbw", "score_hidden": false, "stickied": false, "created": 1492146676.0, "created_utc": 1492117876.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87mdo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "palindrome_emordnila", "parent_id": "t1_dg85r5v", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;Well I mean today's definition of what literature is which changes from period to period.\n   \nSure, but generally not in a way where pulp genre stuff is later seen as being of better quality than more 'serious' work of the same era. \n  \n&gt;I mean sure, techniques have changed but you put any body of work under the microscope and it starts to dissolve because you're writing from an imperfect being's imagination. \n  \nExcept it doesn't, always.  There's no shitty Nabokov book where he phoned it in.  Pynchon sometimes misses, he doesn't really write books where characters do things completely inconsistent with what you know about them.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Well I mean today&amp;#39;s definition of what literature is which changes from period to period.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sure, but generally not in a way where pulp genre stuff is later seen as being of better quality than more &amp;#39;serious&amp;#39; work of the same era. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I mean sure, techniques have changed but you put any body of work under the microscope and it starts to dissolve because you&amp;#39;re writing from an imperfect being&amp;#39;s imagination. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Except it doesn&amp;#39;t, always.  There&amp;#39;s no shitty Nabokov book where he phoned it in.  Pynchon sometimes misses, he doesn&amp;#39;t really write books where characters do things completely inconsistent with what you know about them.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg87mdo", "score_hidden": false, "stickied": false, "created": 1492145736.0, "created_utc": 1492116936.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg85r5v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Black_Sin", "parent_id": "t1_dg851yk", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Well I mean today's definition of what literature is which changes from period to period. \n\nI mean sure, techniques have changed but you put any body of work under the microscope and it starts to dissolve because you're writing from an imperfect being's imagination .\n\nAnd that's okay. It's a story first and foremost. The small details aren't important which is something this fandom needs to learn.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I mean today&amp;#39;s definition of what literature is which changes from period to period. &lt;/p&gt;\n\n&lt;p&gt;I mean sure, techniques have changed but you put any body of work under the microscope and it starts to dissolve because you&amp;#39;re writing from an imperfect being&amp;#39;s imagination .&lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s okay. It&amp;#39;s a story first and foremost. The small details aren&amp;#39;t important which is something this fandom needs to learn.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg85r5v", "score_hidden": false, "stickied": false, "created": 1492143630.0, "created_utc": 1492114830.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg851yk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "palindrome_emordnila", "parent_id": "t1_dg81zg7", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "It does happen in Dickens all the time.  No one considered Dickens 'fine literature'.  Probably not even Dickens, honestly.  It happens in Shakespeare, though.  Probably a better example.  In the intervening 500 years or whatever, though, technique has changed somewhat.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It does happen in Dickens all the time.  No one considered Dickens &amp;#39;fine literature&amp;#39;.  Probably not even Dickens, honestly.  It happens in Shakespeare, though.  Probably a better example.  In the intervening 500 years or whatever, though, technique has changed somewhat.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg851yk", "score_hidden": false, "stickied": false, "created": 1492142857.0, "created_utc": 1492114057.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81zg7", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Black_Sin", "parent_id": "t1_dg7pwix", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I mean even in Tolstoy's books, crap happened because it needed to.\n\nIn Charles Dickens' books which is widely considered to be fine literature, it happens all the time.\n\nSame thing with LOTR, one of the greatest fantasy novels of all time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean even in Tolstoy&amp;#39;s books, crap happened because it needed to.&lt;/p&gt;\n\n&lt;p&gt;In Charles Dickens&amp;#39; books which is widely considered to be fine literature, it happens all the time.&lt;/p&gt;\n\n&lt;p&gt;Same thing with LOTR, one of the greatest fantasy novels of all time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg81zg7", "score_hidden": false, "stickied": false, "created": 1492139518.0, "created_utc": 1492110718.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg7qm75", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "BryndenBFish", "parent_id": "t1_dg7qewd", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Guys, enough slapfighting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Guys, enough slapfighting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7qm75", "score_hidden": false, "stickied": false, "created": 1492127388.0, "created_utc": 1492098588.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7qewd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg7qax7", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7qewd", "score_hidden": false, "stickied": false, "created": 1492127173.0, "created_utc": 1492098373.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7qax7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg7q65d", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7qax7", "score_hidden": false, "stickied": false, "created": 1492127055.0, "created_utc": 1492098255.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7q65d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg7pwix", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7q65d", "score_hidden": false, "stickied": false, "created": 1492126913.0, "created_utc": 1492098113.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7pwix", "gilded": 0, "archived": false, "score": -12, "report_reasons": null, "author": "palindrome_emordnila", "parent_id": "t1_dg7pjmt", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; FWIW, it's likely that Tyrion encountering Jorah at the Sellhorys whorehouse wasn't originally how GRRM intended to write that scene.\n\nYet he did.  It's not the first time.  The books are rife with 'this happened because the plot needs it to and no other reason that makes any sense'.\n  \nWriting is either carefully plotted and tight or it isn't.  In these books: it isn't.  Making excuses for this is pointless.  It's a soap opera intentionally written to an 8th grade reading level.  Trying to make it Tolstoy isn't worthwhile.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;FWIW, it&amp;#39;s likely that Tyrion encountering Jorah at the Sellhorys whorehouse wasn&amp;#39;t originally how GRRM intended to write that scene.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yet he did.  It&amp;#39;s not the first time.  The books are rife with &amp;#39;this happened because the plot needs it to and no other reason that makes any sense&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;Writing is either carefully plotted and tight or it isn&amp;#39;t.  In these books: it isn&amp;#39;t.  Making excuses for this is pointless.  It&amp;#39;s a soap opera intentionally written to an 8th grade reading level.  Trying to make it Tolstoy isn&amp;#39;t worthwhile.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7pwix", "score_hidden": false, "stickied": false, "created": 1492126633.0, "created_utc": 1492097833.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7pjmt", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "BryndenBFish", "parent_id": "t1_dg7p0e0", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I was more thinking POV characters -- like Tyrion now being positioned outside of the walls of Meereen with Barristan within and Victarion a day away at sea, Theon being brought to Stannis' camp outside of Winterfell and encountering Asha. \n\nFWIW, it's likely that Tyrion encountering Jorah at the Sellhorys whorehouse wasn't originally how GRRM intended to write that scene. In 2007, GRRM indicated that he was rewriting a Tyrion chapter to take Tyrion out of the chapter altogether:\n\n&gt; Finished a Tyrion chapter yesterday, one I’ve been struggling with for months. Made a major change to the end of the chapter, one I think works much better than what I had before.Also tackled another Tyrion chapter that had been giving me trouble, mainly by ripping Tyrion out of the scene entirely and rewriting the whole damn thing from another point of view. Not quite done with that one yet, but I think it will work better as well. However, I am keeping the old Tyrion POV version of the same events on my computer, just in case I change my mind later and decide to go back. – [This, That, and t’Other Thing, 12/12/2007](http://grrm.livejournal.com/26709.html)\n\nTo me, this is likely the chapter that became \"The Lost Lord\" from ADWD. I wonder if originally Tyrion was going to end up being our POV for the Golden Company corral and there encounter Jorah. That would have made a bit more sense given that Jorah would likely have to resort to selling his sword (again) and perhaps Jorah might have heard that the Golden Company was considering going to Meereen. \n\nI wonder if that might have worked better than Tyrion's chance encounter with Jorah in a brothel -- though I deeply love that Jon Connington likely became a POV as a result of GRRM's rewrite.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was more thinking POV characters -- like Tyrion now being positioned outside of the walls of Meereen with Barristan within and Victarion a day away at sea, Theon being brought to Stannis&amp;#39; camp outside of Winterfell and encountering Asha. &lt;/p&gt;\n\n&lt;p&gt;FWIW, it&amp;#39;s likely that Tyrion encountering Jorah at the Sellhorys whorehouse wasn&amp;#39;t originally how GRRM intended to write that scene. In 2007, GRRM indicated that he was rewriting a Tyrion chapter to take Tyrion out of the chapter altogether:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Finished a Tyrion chapter yesterday, one I’ve been struggling with for months. Made a major change to the end of the chapter, one I think works much better than what I had before.Also tackled another Tyrion chapter that had been giving me trouble, mainly by ripping Tyrion out of the scene entirely and rewriting the whole damn thing from another point of view. Not quite done with that one yet, but I think it will work better as well. However, I am keeping the old Tyrion POV version of the same events on my computer, just in case I change my mind later and decide to go back. – &lt;a href=\"http://grrm.livejournal.com/26709.html\"&gt;This, That, and t’Other Thing, 12/12/2007&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To me, this is likely the chapter that became &amp;quot;The Lost Lord&amp;quot; from ADWD. I wonder if originally Tyrion was going to end up being our POV for the Golden Company corral and there encounter Jorah. That would have made a bit more sense given that Jorah would likely have to resort to selling his sword (again) and perhaps Jorah might have heard that the Golden Company was considering going to Meereen. &lt;/p&gt;\n\n&lt;p&gt;I wonder if that might have worked better than Tyrion&amp;#39;s chance encounter with Jorah in a brothel -- though I deeply love that Jon Connington likely became a POV as a result of GRRM&amp;#39;s rewrite.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7pjmt", "score_hidden": false, "stickied": false, "created": 1492126249.0, "created_utc": 1492097449.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8ewx8", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SerBiffyClegane", "parent_id": "t1_dg7p0e0", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "To be fair to the books, at least Brienne goes on a long and fruitless quest, (as opposed to the show, where pretty much every time she steps outside she trips over a Stark girl.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To be fair to the books, at least Brienne goes on a long and fruitless quest, (as opposed to the show, where pretty much every time she steps outside she trips over a Stark girl.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8ewx8", "score_hidden": false, "stickied": false, "created": 1492155045.0, "created_utc": 1492126245.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8frz0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "GeneralSuvorov", "parent_id": "t1_dg833wn", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;&gt; history is rife with examples of battles...\n\nReally ? Could you give me several examples of such battles ? When both sides do not know about these reinforcements ?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;history is rife with examples of battles...&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Really ? Could you give me several examples of such battles ? When both sides do not know about these reinforcements ?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8frz0", "score_hidden": false, "stickied": false, "created": 1492156186.0, "created_utc": 1492127386.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg87fcq", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "palindrome_emordnila", "parent_id": "t1_dg86o3p", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; Tolkien isn't the end all be all.\n  \nSure, just wildly more important than Martin and a better writer.\n  \n&gt; Why can't you compare them? \n  \nYou can, I guess, you just won't be taken seriously.  It's like bringing Hitler up in a political debate.  \n  \n&gt;Is it about quality? Because that's vaguely defined. What makes Tolkien's works so much better than Martin's that you can't even compare them?\n  \nBetter?  Better is subjective, obviously.  Not comparable?  Tolkien was a professor with a deep interest in philology and linguistics.  He has a surprise success with The Hobbit which let him indulge in LoTR in attempting an homage to historic folk tales of the western tradtion.  Beowolf, mostly, as well as a place to play with language and myth.  \n  \nMartin is writing Memory, Sorrow, and Thorn with more dick chopping.  \n  \n&gt;Drogo isn't anymore of a redshirt than Robert Baratheon.\n  \nOr Ned.  All three obvious 'going to die' red shirts about nine lines of dialogue in.  All the same fucking character, really.  Deeply flawed powerful men brought down by their obvious flaws.  Spinning a wheel to see what the flaw is going to be doesn't really make them unique in character arc terms.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Tolkien isn&amp;#39;t the end all be all.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sure, just wildly more important than Martin and a better writer.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Why can&amp;#39;t you compare them? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You can, I guess, you just won&amp;#39;t be taken seriously.  It&amp;#39;s like bringing Hitler up in a political debate.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Is it about quality? Because that&amp;#39;s vaguely defined. What makes Tolkien&amp;#39;s works so much better than Martin&amp;#39;s that you can&amp;#39;t even compare them?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Better?  Better is subjective, obviously.  Not comparable?  Tolkien was a professor with a deep interest in philology and linguistics.  He has a surprise success with The Hobbit which let him indulge in LoTR in attempting an homage to historic folk tales of the western tradtion.  Beowolf, mostly, as well as a place to play with language and myth.  &lt;/p&gt;\n\n&lt;p&gt;Martin is writing Memory, Sorrow, and Thorn with more dick chopping.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Drogo isn&amp;#39;t anymore of a redshirt than Robert Baratheon.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Or Ned.  All three obvious &amp;#39;going to die&amp;#39; red shirts about nine lines of dialogue in.  All the same fucking character, really.  Deeply flawed powerful men brought down by their obvious flaws.  Spinning a wheel to see what the flaw is going to be doesn&amp;#39;t really make them unique in character arc terms.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg87fcq", "score_hidden": false, "stickied": false, "created": 1492145517.0, "created_utc": 1492116717.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86o3p", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Black_Sin", "parent_id": "t1_dg84oer", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;Don't ever compare Martin to Tolkien again if you want to be taken remotely seriously.\n\nTolkien isn't the end all be all. \n\nWhy can't you compare them? Is it about quality? Because that's vaguely defined. What makes Tolkien's works so much better than Martin's that you can't even compare them?\n\nIs it dialogue? \n\nIs it world-building?\n\nIs it characterization? \n\nIs it structure? \n\nIs it prose?\n\nIs it entertainment value? \n\nIs it the themes? \n\n\n\n&gt;Sorry, luckiest place around except for redshirts. I thought it was implied.\n\nWell none of them are actually red shirts. A redshirt is a good guy character that dies as soon as they're introduced usually to establish some threat.\n\nQuentyn's character has been built up since AFFC and he is the protagonist of his own story. That he does in the end die is immaterial. It's a tragedy. Would you call Ned Stark a red shirt? \n\nPyat Pree isn't a mook. He's one of the antagonists to Dany's story in ACOK. In fact, he still isn't dead. So he can't even qualify\n\nDrogo isn't anymore of a redshirt than Robert Baratheon.", "edited": 1492116041.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Don&amp;#39;t ever compare Martin to Tolkien again if you want to be taken remotely seriously.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Tolkien isn&amp;#39;t the end all be all. &lt;/p&gt;\n\n&lt;p&gt;Why can&amp;#39;t you compare them? Is it about quality? Because that&amp;#39;s vaguely defined. What makes Tolkien&amp;#39;s works so much better than Martin&amp;#39;s that you can&amp;#39;t even compare them?&lt;/p&gt;\n\n&lt;p&gt;Is it dialogue? &lt;/p&gt;\n\n&lt;p&gt;Is it world-building?&lt;/p&gt;\n\n&lt;p&gt;Is it characterization? &lt;/p&gt;\n\n&lt;p&gt;Is it structure? &lt;/p&gt;\n\n&lt;p&gt;Is it prose?&lt;/p&gt;\n\n&lt;p&gt;Is it entertainment value? &lt;/p&gt;\n\n&lt;p&gt;Is it the themes? &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Sorry, luckiest place around except for redshirts. I thought it was implied.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well none of them are actually red shirts. A redshirt is a good guy character that dies as soon as they&amp;#39;re introduced usually to establish some threat.&lt;/p&gt;\n\n&lt;p&gt;Quentyn&amp;#39;s character has been built up since AFFC and he is the protagonist of his own story. That he does in the end die is immaterial. It&amp;#39;s a tragedy. Would you call Ned Stark a red shirt? &lt;/p&gt;\n\n&lt;p&gt;Pyat Pree isn&amp;#39;t a mook. He&amp;#39;s one of the antagonists to Dany&amp;#39;s story in ACOK. In fact, he still isn&amp;#39;t dead. So he can&amp;#39;t even qualify&lt;/p&gt;\n\n&lt;p&gt;Drogo isn&amp;#39;t anymore of a redshirt than Robert Baratheon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg86o3p", "score_hidden": false, "stickied": false, "created": 1492144651.0, "created_utc": 1492115851.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84oer", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "palindrome_emordnila", "parent_id": "t1_dg833wn", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; Like you could say it was luck that the ring was destroyed at the end of LOTR but you'd miss the wider implications.\n\nDon't ever compare Martin to Tolkien again if you want to be taken remotely seriously.  \n  \nNo offense, I don't take your repeated 'this happens all the time' as evidence that's it not a weakness here.  It is.  We disagree, I guess.\n  \n&gt;Tell that to Quentyn and MMD and Drogo and Pyat Pree etc.\n  \nSorry, luckiest place around *except* for redshirts.  I thought it was implied.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Like you could say it was luck that the ring was destroyed at the end of LOTR but you&amp;#39;d miss the wider implications.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Don&amp;#39;t ever compare Martin to Tolkien again if you want to be taken remotely seriously.  &lt;/p&gt;\n\n&lt;p&gt;No offense, I don&amp;#39;t take your repeated &amp;#39;this happens all the time&amp;#39; as evidence that&amp;#39;s it not a weakness here.  It is.  We disagree, I guess.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Tell that to Quentyn and MMD and Drogo and Pyat Pree etc.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sorry, luckiest place around &lt;em&gt;except&lt;/em&gt; for redshirts.  I thought it was implied.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg84oer", "score_hidden": false, "stickied": false, "created": 1492142437.0, "created_utc": 1492113637.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg833wn", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Black_Sin", "parent_id": "t1_dg7ubnx", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;Barry got lucky no one recognized literally the most famous Knight\n\nWhy would they? They don't have TV or even photographs. \n\nThe only people that would recognize him are the people who have seen him and even seeing a person once doesn't mean you'll recognize them decades later especially when they grow out a beard. \n\n&gt;Dany got lucky when her eggs hatched.\n\nNot luck. Magic. This was her intention.\n\n\n&gt;Tyrion got lucky Bronn was hanging around waiting for someone to save.\n\nIf not him, it would've been Chiggen. This isn't really evidence of bad writing though. Like you could say it was luck that the ring was destroyed at the end of LOTR but you'd miss the wider implications.\n\nIn ASOIAF, sometimes good stuff happens and sometimes bad stuff happens for no discernible reason. You can have good luck and you can have bad luck.\n\nBronn coming to Tyrion's rescue- good luck \n\nTyrion having his nose cut off- bad luck\n\n&gt;Jon got lucky that someone was hanging around waiting to give him a magic sword, kill themselves to save him when was captured, hand him command of the NW, the cavalry literally shows up at the last second when he's losing a battle, and when he has money trouble, a bank appears.\n\nYou have a \"god\" that can see the future watching over Jon. It's not luck. It's destiny.\n\nQhorin knew he was going to die. And Jon was the last man left alive with him. No one would trust him to go rogue so he made it seem Jon did to give him a chance. That's logical.\n\nBeing handed command also makes sense. GRRM had most of the NW that went on Great Ranging killed. That was most of the experienced men of the NW. Not only that but he wasn't actually in command of the Wall. He was in command of Castle Black because no one was in command of it. Bowen Marsh along with his forces were also incapacitated due to an earlier battle. And Cottor Pyke with his men didn't join in until Stannis got there.\n\nAlso some of this is well nonsensical. \n\n&gt;the cavalry literally shows up at the last second when he's losing a battle\n\nLike this for example. The NW sent him a letter to help them. Not only that but Melisandre sacrificed a person for the wind to push their ships along faster. \n\nYou know history is rife with examples of battles that were won in the nick of time by just arriving reinforcements.\n\n&gt; and when he has money trouble, a bank a\n\nThe bank didn't just save Jon's ass from the fire. It'll likely not have any effect because he just died, the Watch is about to go into a civil war and the NW will most likely be destroyed. \n\n\n&gt;Everyone's really lucky all the time in Essos. Luckiest place around, I guess.\n\nTell that to Quentyn and MMD and Drogo and Pyat Pree etc.\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Barry got lucky no one recognized literally the most famous Knight&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Why would they? They don&amp;#39;t have TV or even photographs. &lt;/p&gt;\n\n&lt;p&gt;The only people that would recognize him are the people who have seen him and even seeing a person once doesn&amp;#39;t mean you&amp;#39;ll recognize them decades later especially when they grow out a beard. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Dany got lucky when her eggs hatched.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not luck. Magic. This was her intention.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Tyrion got lucky Bronn was hanging around waiting for someone to save.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If not him, it would&amp;#39;ve been Chiggen. This isn&amp;#39;t really evidence of bad writing though. Like you could say it was luck that the ring was destroyed at the end of LOTR but you&amp;#39;d miss the wider implications.&lt;/p&gt;\n\n&lt;p&gt;In ASOIAF, sometimes good stuff happens and sometimes bad stuff happens for no discernible reason. You can have good luck and you can have bad luck.&lt;/p&gt;\n\n&lt;p&gt;Bronn coming to Tyrion&amp;#39;s rescue- good luck &lt;/p&gt;\n\n&lt;p&gt;Tyrion having his nose cut off- bad luck&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Jon got lucky that someone was hanging around waiting to give him a magic sword, kill themselves to save him when was captured, hand him command of the NW, the cavalry literally shows up at the last second when he&amp;#39;s losing a battle, and when he has money trouble, a bank appears.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You have a &amp;quot;god&amp;quot; that can see the future watching over Jon. It&amp;#39;s not luck. It&amp;#39;s destiny.&lt;/p&gt;\n\n&lt;p&gt;Qhorin knew he was going to die. And Jon was the last man left alive with him. No one would trust him to go rogue so he made it seem Jon did to give him a chance. That&amp;#39;s logical.&lt;/p&gt;\n\n&lt;p&gt;Being handed command also makes sense. GRRM had most of the NW that went on Great Ranging killed. That was most of the experienced men of the NW. Not only that but he wasn&amp;#39;t actually in command of the Wall. He was in command of Castle Black because no one was in command of it. Bowen Marsh along with his forces were also incapacitated due to an earlier battle. And Cottor Pyke with his men didn&amp;#39;t join in until Stannis got there.&lt;/p&gt;\n\n&lt;p&gt;Also some of this is well nonsensical. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;the cavalry literally shows up at the last second when he&amp;#39;s losing a battle&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Like this for example. The NW sent him a letter to help them. Not only that but Melisandre sacrificed a person for the wind to push their ships along faster. &lt;/p&gt;\n\n&lt;p&gt;You know history is rife with examples of battles that were won in the nick of time by just arriving reinforcements.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;and when he has money trouble, a bank a&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The bank didn&amp;#39;t just save Jon&amp;#39;s ass from the fire. It&amp;#39;ll likely not have any effect because he just died, the Watch is about to go into a civil war and the NW will most likely be destroyed. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Everyone&amp;#39;s really lucky all the time in Essos. Luckiest place around, I guess.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Tell that to Quentyn and MMD and Drogo and Pyat Pree etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg833wn", "score_hidden": false, "stickied": false, "created": 1492140734.0, "created_utc": 1492111934.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ehwv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg8cdnz", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8ehwv", "score_hidden": false, "stickied": false, "created": 1492154488.0, "created_utc": 1492125688.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8cdnz", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg8bm99", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8cdnz", "score_hidden": false, "stickied": false, "created": 1492151674.0, "created_utc": 1492122874.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8bm99", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg84z5l", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8bm99", "score_hidden": false, "stickied": false, "created": 1492150663.0, "created_utc": 1492121863.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8cvfz", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg84z5l", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8cvfz", "score_hidden": false, "stickied": false, "created": 1492152321.0, "created_utc": 1492123521.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84z5l", "gilded": 0, "archived": false, "score": -7, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg829oy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg84z5l", "score_hidden": false, "stickied": false, "created": 1492142771.0, "created_utc": 1492113971.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": -7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg829oy", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg7v80t", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg829oy", "score_hidden": false, "stickied": false, "created": 1492139821.0, "created_utc": 1492111021.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7v80t", "gilded": 0, "archived": false, "score": -13, "report_reasons": null, "author": "palindrome_emordnila", "parent_id": "t1_dg7uzo3", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I like the books.  I just think the writing is a soap opera written at an 8th grade reading level to make it as marketable as possible.  \n  \nWhy?  Because the writing is a soap opera written at an 8th grade reading level to make it as marketable as possible.  \n  \nWhy does me liking the books mean I have to pretend the writing is amazing and they plot always makes sense.  It isn't and it doesn't.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like the books.  I just think the writing is a soap opera written at an 8th grade reading level to make it as marketable as possible.  &lt;/p&gt;\n\n&lt;p&gt;Why?  Because the writing is a soap opera written at an 8th grade reading level to make it as marketable as possible.  &lt;/p&gt;\n\n&lt;p&gt;Why does me liking the books mean I have to pretend the writing is amazing and they plot always makes sense.  It isn&amp;#39;t and it doesn&amp;#39;t.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7v80t", "score_hidden": false, "stickied": false, "created": 1492132289.0, "created_utc": 1492103489.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7uzo3", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "deej363", "parent_id": "t1_dg7ubnx", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Man why are you even here if you hate these books so much?\n\nEdit: And most famous knight in westeros? If you wore a suit every day for 10 years, and then one day let your beard grow out to massive lengths, which previously you'd kept clean shaven, and then wore shitty clothes and changed your posture completely, no one would recognize you. That's a well documented occurrence. It's pretty easy to disguise yourself. Tyrion is a rich mofo. Bronn saw opportunity. Bronn made money. Sellswords do that. Magic sword that no one had used in over 10 years, and that you give to your literal successor. Can't believe that? Never given anyone something that was important to you? Qhorin, the stalwart nights watch member. Killer of a ridiculous amount of wildlings. How well would it have gone over if he'd tried to go over to their side as a double agent. The only reason it worked for Jon is because he was an unknown. Mance knew lots of people in the nights watch. It literally could have only been Jon. And as if cavalry hasn't showed up at the opportune time in history before. And the iron bank going to see the only other claimant in the war for the iron throne, who happens to owe them a shit ton of money, as they are explicitly shown to do in the history of Planetos. But no. Everything that happens is obviously, 100% only luck. r/nothingeverhappens ", "edited": 1492103830.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man why are you even here if you hate these books so much?&lt;/p&gt;\n\n&lt;p&gt;Edit: And most famous knight in westeros? If you wore a suit every day for 10 years, and then one day let your beard grow out to massive lengths, which previously you&amp;#39;d kept clean shaven, and then wore shitty clothes and changed your posture completely, no one would recognize you. That&amp;#39;s a well documented occurrence. It&amp;#39;s pretty easy to disguise yourself. Tyrion is a rich mofo. Bronn saw opportunity. Bronn made money. Sellswords do that. Magic sword that no one had used in over 10 years, and that you give to your literal successor. Can&amp;#39;t believe that? Never given anyone something that was important to you? Qhorin, the stalwart nights watch member. Killer of a ridiculous amount of wildlings. How well would it have gone over if he&amp;#39;d tried to go over to their side as a double agent. The only reason it worked for Jon is because he was an unknown. Mance knew lots of people in the nights watch. It literally could have only been Jon. And as if cavalry hasn&amp;#39;t showed up at the opportune time in history before. And the iron bank going to see the only other claimant in the war for the iron throne, who happens to owe them a shit ton of money, as they are explicitly shown to do in the history of Planetos. But no. Everything that happens is obviously, 100% only luck. &lt;a href=\"/r/nothingeverhappens\"&gt;r/nothingeverhappens&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7uzo3", "score_hidden": false, "stickied": false, "created": 1492132042.0, "created_utc": 1492103242.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ubnx", "gilded": 0, "archived": false, "score": -12, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg7trb6", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7ubnx", "score_hidden": false, "stickied": false, "created": 1492131340.0, "created_utc": 1492102540.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7trb6", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "deej363", "parent_id": "t1_dg7p0e0", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "In a whorehouse. Not a pub. And have you never had a random \"what are the odds?\" kind of meeting. Jorah got lucky. For once in his life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In a whorehouse. Not a pub. And have you never had a random &amp;quot;what are the odds?&amp;quot; kind of meeting. Jorah got lucky. For once in his life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7trb6", "score_hidden": false, "stickied": false, "created": 1492130740.0, "created_utc": 1492101940.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7p0e0", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "palindrome_emordnila", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;the 4th and 5th books of the series have begun the process of bringing the threads back together.\n  \nThrough random unexplained meetings, like Jorrah just finding Tyrion in a fucking pub.  \n  \nThere's no grand unifying writing requirement.  90% of the books are 'what a happy coincidence!'", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;the 4th and 5th books of the series have begun the process of bringing the threads back together.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Through random unexplained meetings, like Jorrah just finding Tyrion in a fucking pub.  &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s no grand unifying writing requirement.  90% of the books are &amp;#39;what a happy coincidence!&amp;#39;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7p0e0", "score_hidden": false, "stickied": false, "created": 1492125682.0, "created_utc": 1492096882.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dga3xwc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bker50", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Very interesting post! Very good points made but I really dont think he has written his way into corner...in fact i think he has left himself many many options on wich direction to go next on almost all of these knots", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very interesting post! Very good points made but I really dont think he has written his way into corner...in fact i think he has left himself many many options on wich direction to go next on almost all of these knots&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dga3xwc", "score_hidden": false, "stickied": false, "created": 1492249798.0, "created_utc": 1492220998.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg948dk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "deej363", "parent_id": "t1_dg8zar6", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Read your whole thing, and I like everything, except for one little tidbit. I really, really, really do not want Garlan to die. Garlan is awesome. Let him live. Please.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Read your whole thing, and I like everything, except for one little tidbit. I really, really, really do not want Garlan to die. Garlan is awesome. Let him live. Please.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg948dk", "score_hidden": false, "stickied": false, "created": 1492204912.0, "created_utc": 1492176112.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg9lqv9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Lord-Too-Fat", "parent_id": "t1_dg8zar6", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Nicely done.\nI think we see similar plotlines moving forward, aside from some minor differences.\nI like the Darkstar-Vulture king thing.\nI think Obara will join him after she kills hotah...  as well as the remaining bloody mummers that were going to oldtown. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nicely done.\nI think we see similar plotlines moving forward, aside from some minor differences.\nI like the Darkstar-Vulture king thing.\nI think Obara will join him after she kills hotah...  as well as the remaining bloody mummers that were going to oldtown. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9lqv9", "score_hidden": false, "stickied": false, "created": 1492226264.0, "created_utc": 1492197464.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zar6", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Mithras_Stoneborn", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "This is very interesting because I have been thinking about the exact same thing in the last weeks. How many chapters can we expect in TWoW and how will they correlate? I think there will be around 74 chapters and the volume will be greater than ADwD. I divide TWoW into three major parts: Team Dany (22 chapters), The North (22 chapters) and the rest (30 chapters). So far, I am pretty much convinced about the outline of the 30 chapters. The rest is I am still struggling with. Below is my outline for TWoW excluding Dany and the North.\n\n**Stark Sisters (8 chapters)**\n\n* **Sansa I:** Preps for the tourney (We already have this).\n\n* **Sansa II:** The tourney. Death of Harry. Chaos.\n\n* **Sansa III:** LF tries to persuade Sansa to get pregnant ASAP and claim that the baby is from late Harry so that when Sweetrobin dies, this baby will be legitimized as the Lord of the Vale by any of the contenders for the IT who wishes the Vale and the North at their side. Long story short, LF tries to have his way with Sansa. Sansa is not moved by the idea. LF tries to rape her and she slays the savage giant.\n\n* **Sansa IV:** Shadrich approaches Sansa who has just slain LF and convinces her that he can take her to the North. Sansa does not have any other option. They secretly run away and eventually find a ship. But Shadrich betrays her and the ship comes to the KL where he will turn her over to Cersei.\n\n* **Arya I:** Mercy (We already have this).\n\n* **Arya II – III:** Raff’s death and Mercy’s disappearance cause a great scandal. Harys Swyft is forced to return to KL empty handed. Arya is sent to a courtesan to study advanced spying. Deeper and darker history of the Faceless Men is revealed to her. Bran tries to contact Arya in her wolf dreams. Eventually, Theon comes to Braavos under Bran’s guidance and briefs Arya about many things happened to the Stark family in Westeros.\n\n* **Arya IV:** Arya makes up her mind. She and Theon find a ship sailing back to Westeros. Arya’s purpose is to reunite with Nymeria and then bring the gift to Lady Stoneheart.\n\n**Riverlands (5 chapters)**\n\t\n* **Jaime &amp; Brienne:** Brienne brings Jaime to LSH who throws accusations to him. Brienne persuades Jaime to demand trial by combat. Brienne becomes Jaime’s champion and saves him. Possible confirmation of Lem Lemoncloak = Richard Lonmouth theory. If that is the case, some missing details about Robert’s Rebellion can be revealed by him. Jaime is set free but Brienne’s oath to LSH still holds. Jaime and Brienne have sex before Jaime leaves. The Second Red Wedding through Brienne’s eyes. In the end, Brienne demands to be set free in order to avenge Renly from Stannis in the North. LSH has to let her go because this term was included in Brienne’s oath back in ACoK. In the end, we have Brienne heading North with Podrick and Jaime heading to KL.\n\n**King’s Landing (4 chapters)**\n\n* **Cersei I – IV:** Cersei wins her trial and becomes Tommen’s regent. Tommen is poisoned by Tyene who is disguising as a novice attending to Cersei. Myrcella is to be crowned the queen. Lannister-Tyrell alliance is at the brink of total collapse. Tyrells lose their hold on to power by the death of Tommen. Cersei now has the upper hand. Marg’s trial is postponed. The Tyrell army leaves for Storm’s End. All of this takes place in short time with great momentum. The Tyrell army is defeated, Mace is killed and Tarly bends the knee to fAegon. Olenna comes to the KL with refugees from Highgarden. Euron proves to be a real menace in the Reach, sacking Highgarden and killing Garlan in battle. The trial of Marg takes place. She is found guilty and executed. Tyrells seem almost “done”. fAegon is ever expanding by marrying Arianne and engulfing large swaths of Stormlands, Dorne and the Reach. Cersei is the de facto queen in the KL but Myrcella, being a strong character, keeps contesting her decisions. They have serious quarrels. Myrcella will eventually jump to her death from Maegor’s Holdfast but not in this book.\n\n**Team fAegon (8 chapters)**\n\n* **Arianne I – II:** On the way to the dragon’s gullet. (We already have them). \n\n* **Arianne III:** Arianne and fAegon fall in love at first sight and decide to marry. Dorne goes black and now they can never go back.\n\n* **JonCon I – IV:** The Battle of Storm’s End. By “guile”, JonCon conquers Storm’s End for the first time in history.  Then, JonCon makes his plans to confront the incoming Tyrell army. With a good combination of leadership and the choice of battleground, JonCon manages to defeat the Tyrells. Elephants are game changer in this battle. Mace is killed in battle but Tarly is taken prisoner. He and some other surviving Reach Lords swear fealty to fAegon. The news of Euron’s exploits in the Reach comes to them. They decide to go to the Reach and put an end to the threat of the ironborn, which will win other important Reach Lords to their cause, while the Tyrell rose keeps fading. \n\n* **Hotah I:** They learn that Darkstar has stolen the Dawn. Tracking Darkstar. They catch his scent. A fight breaks out. Balon Swann learns the truth about who really killed Oakheart and change sides. He and Darkstar easily slay Obara and Hotah. Darkstar is to become an outlaw at the Red Mountains, like the Vulture Kings of old.\n\n**The Reach (5 chapters)**\n\n* **Sam I:** Sam forging his chains, learning ancient history and arcane stuff.\n\n* **Aeron I:** Forsaken (We already have this).\n\n* **Aeron II:** Euron evades the Redwyne Fleet and starts raiding up the Mander in greater strength. He eventually finds a way to sack Highgarden and kills Garlan in battle. The combined Redwyne-Hightower Fleet retakes the Shields, blockades the mouth of Mander and sends a massive host up the river, both from the land and the waters. Euron and all of his forces are seemingly trapped upstream. Euron commands his men to get rid of unnecessary loads. The ironborn are to carry their longboats over the land to the Honeywine.  From there, they come down the river directly to Oldtown with speed. The city’s defenses are elsewhere and they do not expect an attack from the rear.\n \n* **Sam II – III:** Sam is our POV in Euron’s raid to Oldtown. The ironborn attack comes as a shock. The city is in chaos. When the ironborn tide reaches its greatest extent, Sam succeeds in killing Euron thanks to his archery practices. This changes the tide of the battle. The ironborn attack gets bogged down. As Euron is dying, the van of fAegon’s army (led by Sam’s father) arrives and the ironborn are soundly defeated between the hammer and the anvil. Aeron is still alive and taken as a prisoner along with many ironborn. The Hightowers and Redwynes bend knee to fAegon along with their bannermen. Aeron is interrogated. He reveals Euron’s pets (like the Codds) and makes sure to have them executed. The other ironborn Lords (like Goodbrothers) are spared with their men after they all swear fealty to fAegon. In the end, Aeron and the remaining ironborn are sent to the Iron Islands to restore order and obey the king’s peace. JonCon’s greyscale is finally revealed and fAegon, now having so many Lords at his side, sends him away. Sam claims Euron’s Valyrian Steel Armor for the NW by right of personally slaying him. He plans to repurpose it to create new VS swords to fight the Others. In the end, Sam gets on the way back to the Wall. JonCon, feeling abandoned and depressed, goes with him. They will eventually team up with Gendry and take him to the Wall as well, possibly with more members of the BwB. JonCon will see the young Robert, the man he hates most, in Gendry but will grow to like the boy and be a father figure to him. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is very interesting because I have been thinking about the exact same thing in the last weeks. How many chapters can we expect in TWoW and how will they correlate? I think there will be around 74 chapters and the volume will be greater than ADwD. I divide TWoW into three major parts: Team Dany (22 chapters), The North (22 chapters) and the rest (30 chapters). So far, I am pretty much convinced about the outline of the 30 chapters. The rest is I am still struggling with. Below is my outline for TWoW excluding Dany and the North.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Stark Sisters (8 chapters)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Sansa I:&lt;/strong&gt; Preps for the tourney (We already have this).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Sansa II:&lt;/strong&gt; The tourney. Death of Harry. Chaos.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Sansa III:&lt;/strong&gt; LF tries to persuade Sansa to get pregnant ASAP and claim that the baby is from late Harry so that when Sweetrobin dies, this baby will be legitimized as the Lord of the Vale by any of the contenders for the IT who wishes the Vale and the North at their side. Long story short, LF tries to have his way with Sansa. Sansa is not moved by the idea. LF tries to rape her and she slays the savage giant.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Sansa IV:&lt;/strong&gt; Shadrich approaches Sansa who has just slain LF and convinces her that he can take her to the North. Sansa does not have any other option. They secretly run away and eventually find a ship. But Shadrich betrays her and the ship comes to the KL where he will turn her over to Cersei.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Arya I:&lt;/strong&gt; Mercy (We already have this).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Arya II – III:&lt;/strong&gt; Raff’s death and Mercy’s disappearance cause a great scandal. Harys Swyft is forced to return to KL empty handed. Arya is sent to a courtesan to study advanced spying. Deeper and darker history of the Faceless Men is revealed to her. Bran tries to contact Arya in her wolf dreams. Eventually, Theon comes to Braavos under Bran’s guidance and briefs Arya about many things happened to the Stark family in Westeros.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Arya IV:&lt;/strong&gt; Arya makes up her mind. She and Theon find a ship sailing back to Westeros. Arya’s purpose is to reunite with Nymeria and then bring the gift to Lady Stoneheart.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Riverlands (5 chapters)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Jaime &amp;amp; Brienne:&lt;/strong&gt; Brienne brings Jaime to LSH who throws accusations to him. Brienne persuades Jaime to demand trial by combat. Brienne becomes Jaime’s champion and saves him. Possible confirmation of Lem Lemoncloak = Richard Lonmouth theory. If that is the case, some missing details about Robert’s Rebellion can be revealed by him. Jaime is set free but Brienne’s oath to LSH still holds. Jaime and Brienne have sex before Jaime leaves. The Second Red Wedding through Brienne’s eyes. In the end, Brienne demands to be set free in order to avenge Renly from Stannis in the North. LSH has to let her go because this term was included in Brienne’s oath back in ACoK. In the end, we have Brienne heading North with Podrick and Jaime heading to KL.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;King’s Landing (4 chapters)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Cersei I – IV:&lt;/strong&gt; Cersei wins her trial and becomes Tommen’s regent. Tommen is poisoned by Tyene who is disguising as a novice attending to Cersei. Myrcella is to be crowned the queen. Lannister-Tyrell alliance is at the brink of total collapse. Tyrells lose their hold on to power by the death of Tommen. Cersei now has the upper hand. Marg’s trial is postponed. The Tyrell army leaves for Storm’s End. All of this takes place in short time with great momentum. The Tyrell army is defeated, Mace is killed and Tarly bends the knee to fAegon. Olenna comes to the KL with refugees from Highgarden. Euron proves to be a real menace in the Reach, sacking Highgarden and killing Garlan in battle. The trial of Marg takes place. She is found guilty and executed. Tyrells seem almost “done”. fAegon is ever expanding by marrying Arianne and engulfing large swaths of Stormlands, Dorne and the Reach. Cersei is the de facto queen in the KL but Myrcella, being a strong character, keeps contesting her decisions. They have serious quarrels. Myrcella will eventually jump to her death from Maegor’s Holdfast but not in this book.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Team fAegon (8 chapters)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Arianne I – II:&lt;/strong&gt; On the way to the dragon’s gullet. (We already have them). &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Arianne III:&lt;/strong&gt; Arianne and fAegon fall in love at first sight and decide to marry. Dorne goes black and now they can never go back.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;JonCon I – IV:&lt;/strong&gt; The Battle of Storm’s End. By “guile”, JonCon conquers Storm’s End for the first time in history.  Then, JonCon makes his plans to confront the incoming Tyrell army. With a good combination of leadership and the choice of battleground, JonCon manages to defeat the Tyrells. Elephants are game changer in this battle. Mace is killed in battle but Tarly is taken prisoner. He and some other surviving Reach Lords swear fealty to fAegon. The news of Euron’s exploits in the Reach comes to them. They decide to go to the Reach and put an end to the threat of the ironborn, which will win other important Reach Lords to their cause, while the Tyrell rose keeps fading. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Hotah I:&lt;/strong&gt; They learn that Darkstar has stolen the Dawn. Tracking Darkstar. They catch his scent. A fight breaks out. Balon Swann learns the truth about who really killed Oakheart and change sides. He and Darkstar easily slay Obara and Hotah. Darkstar is to become an outlaw at the Red Mountains, like the Vulture Kings of old.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;The Reach (5 chapters)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Sam I:&lt;/strong&gt; Sam forging his chains, learning ancient history and arcane stuff.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Aeron I:&lt;/strong&gt; Forsaken (We already have this).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Aeron II:&lt;/strong&gt; Euron evades the Redwyne Fleet and starts raiding up the Mander in greater strength. He eventually finds a way to sack Highgarden and kills Garlan in battle. The combined Redwyne-Hightower Fleet retakes the Shields, blockades the mouth of Mander and sends a massive host up the river, both from the land and the waters. Euron and all of his forces are seemingly trapped upstream. Euron commands his men to get rid of unnecessary loads. The ironborn are to carry their longboats over the land to the Honeywine.  From there, they come down the river directly to Oldtown with speed. The city’s defenses are elsewhere and they do not expect an attack from the rear.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Sam II – III:&lt;/strong&gt; Sam is our POV in Euron’s raid to Oldtown. The ironborn attack comes as a shock. The city is in chaos. When the ironborn tide reaches its greatest extent, Sam succeeds in killing Euron thanks to his archery practices. This changes the tide of the battle. The ironborn attack gets bogged down. As Euron is dying, the van of fAegon’s army (led by Sam’s father) arrives and the ironborn are soundly defeated between the hammer and the anvil. Aeron is still alive and taken as a prisoner along with many ironborn. The Hightowers and Redwynes bend knee to fAegon along with their bannermen. Aeron is interrogated. He reveals Euron’s pets (like the Codds) and makes sure to have them executed. The other ironborn Lords (like Goodbrothers) are spared with their men after they all swear fealty to fAegon. In the end, Aeron and the remaining ironborn are sent to the Iron Islands to restore order and obey the king’s peace. JonCon’s greyscale is finally revealed and fAegon, now having so many Lords at his side, sends him away. Sam claims Euron’s Valyrian Steel Armor for the NW by right of personally slaying him. He plans to repurpose it to create new VS swords to fight the Others. In the end, Sam gets on the way back to the Wall. JonCon, feeling abandoned and depressed, goes with him. They will eventually team up with Gendry and take him to the Wall as well, possibly with more members of the BwB. JonCon will see the young Robert, the man he hates most, in Gendry but will grow to like the boy and be a father figure to him. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8zar6", "score_hidden": false, "stickied": false, "created": 1492193411.0, "created_utc": 1492164611.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg7z00v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DrHalibutMD", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think the only logical answer to your detailed post is obvious.  Four more books, 32 new point of view characters, Game of Thrones on Broadway and of course 16 more Wild Cards Anthologies.  Dont worry, I'm pretty sure George is immortal and has all the time in the world. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the only logical answer to your detailed post is obvious.  Four more books, 32 new point of view characters, Game of Thrones on Broadway and of course 16 more Wild Cards Anthologies.  Dont worry, I&amp;#39;m pretty sure George is immortal and has all the time in the world. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg7z00v", "score_hidden": false, "stickied": false, "created": 1492136308.0, "created_utc": 1492107508.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8qqso", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BaelBard", "parent_id": "t1_dg8f08p", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Of course she will. The second dance of dragons is coming. And Dany's conflict with Aegon is bad news for Illyrio and Pentos.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of course she will. The second dance of dragons is coming. And Dany&amp;#39;s conflict with Aegon is bad news for Illyrio and Pentos.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8qqso", "score_hidden": false, "stickied": false, "created": 1492171981.0, "created_utc": 1492143181.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8f08p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SerBiffyClegane", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I'm pretty curious about Pentos. I don't feel like Dani is going to pay that one off, but I don't know whether she'll do it by repudiating Barristan or something drastic.", "edited": 1492127081.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pretty curious about Pentos. I don&amp;#39;t feel like Dani is going to pay that one off, but I don&amp;#39;t know whether she&amp;#39;ll do it by repudiating Barristan or something drastic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8f08p", "score_hidden": false, "stickied": false, "created": 1492155157.0, "created_utc": 1492126357.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8diyi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LaughingWithMe", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Edit:\nI'd like to thank OP for writing such a great post that adds so much for this community.\n\nI really like this post, but one realization I've had out of the entire ordeal is that as the author, you cannot have any emotion towards any particular character..And if you do, the writing will be so much much more harder to write for the benefit of the overall story if your character is \"in the way\" of a good ending..\n\nI think, linearly, you could devise a plot with just lines representing characters...You have a goal (the iron throne) and only one line (maybe two..? depending on how you'd like to play it) that reaches the goal, and if each line represents each character, you probably have 100 different lines, but maybe only 8 \"main\" lines that represent main characters.\n\n((SPOILERS))\n\nObviously, Eddard was a HUGE line that was snuffed out, which I think was brilliant in the sense that it gave me a reason to enjoy this book and series moreso than others. You have a favorite character? Good. He's fucking dead and he was the biggest shining beacon of hope and justice in the series. -- All of this is shadowed by the Iron throne because good guys do not win. Robb is the same way, and I feel that in the future, many many others will as well.\n\nGoing back to \"not have any emotion towards any character\" I understand that it's, by the author's standpoint, impossible to not have an emotion. You literally conceived the characters, but GRRM is ruthless in the sense that he understands the brilliant structre that is the lack of \"happily ever after\" storylines and that is why I absolutely love this story. Every fight and battle is not guaranteed for the main character. Although there is \"plot armor\" in a sense, it is not as durable or versatile as it is in other books.\n", "edited": 1492127954.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Edit:\nI&amp;#39;d like to thank OP for writing such a great post that adds so much for this community.&lt;/p&gt;\n\n&lt;p&gt;I really like this post, but one realization I&amp;#39;ve had out of the entire ordeal is that as the author, you cannot have any emotion towards any particular character..And if you do, the writing will be so much much more harder to write for the benefit of the overall story if your character is &amp;quot;in the way&amp;quot; of a good ending..&lt;/p&gt;\n\n&lt;p&gt;I think, linearly, you could devise a plot with just lines representing characters...You have a goal (the iron throne) and only one line (maybe two..? depending on how you&amp;#39;d like to play it) that reaches the goal, and if each line represents each character, you probably have 100 different lines, but maybe only 8 &amp;quot;main&amp;quot; lines that represent main characters.&lt;/p&gt;\n\n&lt;p&gt;((SPOILERS))&lt;/p&gt;\n\n&lt;p&gt;Obviously, Eddard was a HUGE line that was snuffed out, which I think was brilliant in the sense that it gave me a reason to enjoy this book and series moreso than others. You have a favorite character? Good. He&amp;#39;s fucking dead and he was the biggest shining beacon of hope and justice in the series. -- All of this is shadowed by the Iron throne because good guys do not win. Robb is the same way, and I feel that in the future, many many others will as well.&lt;/p&gt;\n\n&lt;p&gt;Going back to &amp;quot;not have any emotion towards any character&amp;quot; I understand that it&amp;#39;s, by the author&amp;#39;s standpoint, impossible to not have an emotion. You literally conceived the characters, but GRRM is ruthless in the sense that he understands the brilliant structre that is the lack of &amp;quot;happily ever after&amp;quot; storylines and that is why I absolutely love this story. Every fight and battle is not guaranteed for the main character. Although there is &amp;quot;plot armor&amp;quot; in a sense, it is not as durable or versatile as it is in other books.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8diyi", "score_hidden": false, "stickied": false, "created": 1492153192.0, "created_utc": 1492124392.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg9kt3w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Qoburn", "parent_id": "t1_dg91f54", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; \"And what of me?\" asked Tyene.\n\n&gt; \"Your mother was a septa. Oberyn once told me that she read to you in the cradle from the Seven-Pointed Star. I want you in King's Landing too, but on the other hill. The Swords and the Stars have been re-formed, and **this new High Septon is not the puppet that the others were. Try and get close to him.**\" -*Areo I*, ADWD", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;And what of me?&amp;quot; asked Tyene.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Your mother was a septa. Oberyn once told me that she read to you in the cradle from the Seven-Pointed Star. I want you in King&amp;#39;s Landing too, but on the other hill. The Swords and the Stars have been re-formed, and &lt;strong&gt;this new High Septon is not the puppet that the others were. Try and get close to him.&lt;/strong&gt;&amp;quot; -&lt;em&gt;Areo I&lt;/em&gt;, ADWD&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9kt3w", "score_hidden": false, "stickied": false, "created": 1492225132.0, "created_utc": 1492196332.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg91f54", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Foxy-cD", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Where does it say that tyene is infiltrating the faith militant??", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where does it say that tyene is infiltrating the faith militant??&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg91f54", "score_hidden": false, "stickied": false, "created": 1492199459.0, "created_utc": 1492170659.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_655xmy", "likes": null, "replies": "", "user_reports": [], "id": "dg8fm6y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IllyrioMoParties", "parent_id": "t3_655xmy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; So, how does Martin writes his way out of these knots?\n\nYet more evidence that Bfish is really GRRM", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;So, how does Martin writes his way out of these knots?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yet more evidence that Bfish is really GRRM&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8fm6y", "score_hidden": false, "stickied": false, "created": 1492155961.0, "created_utc": 1492127161.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]