[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "asoiaf", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a theory I&amp;#39;ve been pondering for a while now. It occurred to me that Tyrion has been and will be responsible for the deaths of all of Cersei&amp;#39;s children. He doesn&amp;#39;t know it and he truly didn&amp;#39;t intend for them to die due to his machinations. But unfortunately, he has doomed them all. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Joffrey:&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;Tyrion is the one that organizes the Lannister/Tyrell alliance: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Bribes might sway some of the lesser lords,&amp;quot; Tyrion said, &amp;quot;but never Highgarden.&amp;quot; &amp;quot;True,&amp;quot; Littlefinger admitted. &amp;quot;The Knight of Flowers is the key there. Mace Tyrell has two older sons, but Loras has always been his favorite. Win him, and Highgarden will be yours.&amp;quot; &lt;em&gt;Yes&lt;/em&gt;, Tyrion thought. &amp;quot;It seems to me we should take a lesson from the late Lord Renly. We can win the Tyrell alliance as he did. With a marriage. Varys understood the quickest. &amp;quot;You think to wed King Joffrey to Margaery Tyrell.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;We know how this ends. &lt;/p&gt;\n\n&lt;p&gt;Littlefinger cleverly spreads information about Joffrey&amp;#39;s true nature through the Tyrell camp. Lady Olenna and Margaery confirm the truth from Sansa.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Sansa felt as though her heart had lodged in her throat. The Queen of Thorns was so close she could smell the old woman&amp;#39;s sour breath. Her gaunt thin fingers were pinching her wrist. To her other side, Margaery was listening as well. A shiver went through her. &amp;quot;A monster,&amp;quot; she whispered, so tremulously she could scarcely hear her own voice. &amp;quot;Joffrey is a monster. He lied about the butcher&amp;#39;s boy and made Father kill my wolf. When I displease him, he has the Kingsguard beat me. He&amp;#39;s evil and cruel, my lady, it&amp;#39;s so. And the queen as well.&amp;quot; Lady Olenna Tyrell and her granddaughter exchanged a look. &amp;quot;Ah,&amp;quot; said the old woman, &lt;em&gt;&amp;quot;that&amp;#39;s a pity.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Long before this conversation, Olenna and Littlefinger conspired to have Joffrey killed with the strangler. Ser Dontos gives Sansa the hairnet with the poison in Clash. It seems this conversation with Sansa was simply Olenna attempting to confirm the rumors she heard before following through with regicide. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Now Myrcella:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;What a disgusting little worm you are. Myrcella is my only daughter. Did you truly imagine that I would allow you to sell her like a bag of oats? &amp;quot; &lt;em&gt;Myrcella&lt;/em&gt;, he thought. &lt;em&gt;Well, that egg has hatched. Let&amp;#39;s see what color the chick is.&lt;/em&gt; &amp;quot;Hardly a bag of oats. Myrcella is a princess. Some would say this is what she was born for. Or did you plan to marry her to Tommen?&amp;quot; Her hand lashed out, knocking the wine cup from his hand to spill on the floor. &amp;quot;Brother or no, I should have your tongue out for that. I am Joffrey&amp;#39;s regent, not you, and I say that Myrcella will not be shipped off to this Dornishman the way I was shipped to Robert Baratheon.&amp;quot; Tyrion shook wine off his fingers and sighed. &lt;strong&gt;&amp;quot;Why not? She&amp;#39;d be a deal safer in Dorne than she is here.&amp;quot;&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;quot;Safer in Dorne.&amp;quot; Surely not and Martin knew that when he wrote that bit of foreshadowing. &lt;/p&gt;\n\n&lt;p&gt;Arianne conspires to crown Myrcella for her own selfish reasons. The plot fails and Myrcella is horribly disfigured at the hands of Ser Gerold Dayne. Now, it&amp;#39;s only fan speculation that Myrcella has died or will die from her wounds. But this quote from ADWD is enough to seal it for me that she won&amp;#39;t survive the attack: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Even a kinslayer is not required to slay all his kin,&amp;quot; said Tyrion, wounded. &amp;quot;Queen her, I said. Not kill her.&amp;quot;\nThe cheesemonger spooned up cherries. &amp;quot;In Volantis they use a coin with a crown on one face and a death&amp;#39;s-head on the other. Yet it is the same coin. &lt;strong&gt;To queen her is to kill her. Dorne might rise for Myrcella, but Dorne alone is not enough.&lt;/strong&gt; If you are as clever as our friend insists, you know this.&amp;quot;\nTyrion looked at the fat man with new interest. &lt;em&gt;He is right on both counts. To queen her is to kill her. And I knew that.&lt;/em&gt; &amp;quot;Futile gestures are all that remain to me. This one would make my sister weep bitter tears, at least.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;quot;To queen her is to kill her&amp;quot; -- and that&amp;#39;s exactly what Arianne did. She crowned her and in doing so, she killed her. An actual coronation was not necessary for Myrcella to be considered queen. By Dornish law, Myrcella was Joffrey&amp;#39;s rightful heir. This technicality (while not observed by all of Westeros) was enough to make Myrcella a queen and to doom her. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Finally we come to Tommen:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is quite possibly Tyrion&amp;#39;s worst offense towards his family. He didn&amp;#39;t intend for Joffrey and Myrcella to be harmed when he arranged their marriages. But he deliberately sends a dragon to King&amp;#39;s Landing all because of his hatred of Cersei.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The dwarf shrugged. “Do you want to wager your throne upon a woman’s whim? Go to Westeros, though … ah, then you are a rebel, not a beggar. Bold, reckless, a true scion of House Targaryen, walking in the footsteps of Aegon the Conqueror. A dragon.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Tyrion messes with Aegon&amp;#39;s head and implants the idea that he should skip going to Daenerys and head straight for Westeros. Because he was simply being cruel as he loves to be considering he is a powerless, stunted dwarf, he doesn&amp;#39;t expect Aegon to follow through with his plan. But Aegon does: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The map was beautiful, painted by a master&amp;#39;s hand on a sheet of the finest vellum, so large it covered the table. &amp;quot;Here.&amp;quot; Pycelle pointed with a spotted hand. Where the sleeve of his robe rode up, a flap of pale flesh could be seen dangling beneath his forearm. &amp;quot;Here and here. All along the coast, and on the islands. Tarth, the Stepstones, even Estermont. And now we have reports that Connington is moving on Storm&amp;#39;s End.&amp;quot; &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And now Aegon and his army are marching towards King&amp;#39;s Landing.&lt;/p&gt;\n\n&lt;p&gt;EDIT: I forgot to mention that when Tyrion hears Aegon and his army has turned to Westeros, he completely forgets that his last remaining nephew is in danger. It never occurs to him. &lt;/p&gt;\n\n&lt;p&gt;I theorize that Aegon and his army will be successful and dispose of the last Lannister pretender. That Tyrion  has inadvertently killed his last remaining nephew due to his scheming.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is a theory I've been pondering for a while now. It occurred to me that Tyrion has been and will be responsible for the deaths of all of Cersei's children. He doesn't know it and he truly didn't intend for them to die due to his machinations. But unfortunately, he has doomed them all. \n\n**Joffrey:** \n\nTyrion is the one that organizes the Lannister/Tyrell alliance: \n\n&gt;\"Bribes might sway some of the lesser lords,\" Tyrion said, \"but never Highgarden.\" \"True,\" Littlefinger admitted. \"The Knight of Flowers is the key there. Mace Tyrell has two older sons, but Loras has always been his favorite. Win him, and Highgarden will be yours.\" *Yes*, Tyrion thought. \"It seems to me we should take a lesson from the late Lord Renly. We can win the Tyrell alliance as he did. With a marriage. Varys understood the quickest. \"You think to wed King Joffrey to Margaery Tyrell.\"\n\nWe know how this ends. \n\nLittlefinger cleverly spreads information about Joffrey's true nature through the Tyrell camp. Lady Olenna and Margaery confirm the truth from Sansa.\n\n&gt; Sansa felt as though her heart had lodged in her throat. The Queen of Thorns was so close she could smell the old woman's sour breath. Her gaunt thin fingers were pinching her wrist. To her other side, Margaery was listening as well. A shiver went through her. \"A monster,\" she whispered, so tremulously she could scarcely hear her own voice. \"Joffrey is a monster. He lied about the butcher's boy and made Father kill my wolf. When I displease him, he has the Kingsguard beat me. He's evil and cruel, my lady, it's so. And the queen as well.\" Lady Olenna Tyrell and her granddaughter exchanged a look. \"Ah,\" said the old woman, *\"that's a pity.\"*\n\nLong before this conversation, Olenna and Littlefinger conspired to have Joffrey killed with the strangler. Ser Dontos gives Sansa the hairnet with the poison in Clash. It seems this conversation with Sansa was simply Olenna attempting to confirm the rumors she heard before following through with regicide. \n\n**Now Myrcella:**\n&gt;\"What a disgusting little worm you are. Myrcella is my only daughter. Did you truly imagine that I would allow you to sell her like a bag of oats? \" *Myrcella*, he thought. *Well, that egg has hatched. Let's see what color the chick is.* \"Hardly a bag of oats. Myrcella is a princess. Some would say this is what she was born for. Or did you plan to marry her to Tommen?\" Her hand lashed out, knocking the wine cup from his hand to spill on the floor. \"Brother or no, I should have your tongue out for that. I am Joffrey's regent, not you, and I say that Myrcella will not be shipped off to this Dornishman the way I was shipped to Robert Baratheon.\" Tyrion shook wine off his fingers and sighed. **\"Why not? She'd be a deal safer in Dorne than she is here.\"**\n\n\"Safer in Dorne.\" Surely not and Martin knew that when he wrote that bit of foreshadowing. \n\nArianne conspires to crown Myrcella for her own selfish reasons. The plot fails and Myrcella is horribly disfigured at the hands of Ser Gerold Dayne. Now, it's only fan speculation that Myrcella has died or will die from her wounds. But this quote from ADWD is enough to seal it for me that she won't survive the attack: \n\n&gt;\"Even a kinslayer is not required to slay all his kin,\" said Tyrion, wounded. \"Queen her, I said. Not kill her.\"\nThe cheesemonger spooned up cherries. \"In Volantis they use a coin with a crown on one face and a death's-head on the other. Yet it is the same coin. **To queen her is to kill her. Dorne might rise for Myrcella, but Dorne alone is not enough.** If you are as clever as our friend insists, you know this.\"\nTyrion looked at the fat man with new interest. *He is right on both counts. To queen her is to kill her. And I knew that.* \"Futile gestures are all that remain to me. This one would make my sister weep bitter tears, at least.\"\n\n\"To queen her is to kill her\" -- and that's exactly what Arianne did. She crowned her and in doing so, she killed her. An actual coronation was not necessary for Myrcella to be considered queen. By Dornish law, Myrcella was Joffrey's rightful heir. This technicality (while not observed by all of Westeros) was enough to make Myrcella a queen and to doom her. \n\n**Finally we come to Tommen:**\n\nThis is quite possibly Tyrion's worst offense towards his family. He didn't intend for Joffrey and Myrcella to be harmed when he arranged their marriages. But he deliberately sends a dragon to King's Landing all because of his hatred of Cersei.\n\n&gt; The dwarf shrugged. “Do you want to wager your throne upon a woman’s whim? Go to Westeros, though … ah, then you are a rebel, not a beggar. Bold, reckless, a true scion of House Targaryen, walking in the footsteps of Aegon the Conqueror. A dragon.\"\n\nTyrion messes with Aegon's head and implants the idea that he should skip going to Daenerys and head straight for Westeros. Because he was simply being cruel as he loves to be considering he is a powerless, stunted dwarf, he doesn't expect Aegon to follow through with his plan. But Aegon does: \n\n&gt;The map was beautiful, painted by a master's hand on a sheet of the finest vellum, so large it covered the table. \"Here.\" Pycelle pointed with a spotted hand. Where the sleeve of his robe rode up, a flap of pale flesh could be seen dangling beneath his forearm. \"Here and here. All along the coast, and on the islands. Tarth, the Stepstones, even Estermont. And now we have reports that Connington is moving on Storm's End.\" \n\nAnd now Aegon and his army are marching towards King's Landing.\n\nEDIT: I forgot to mention that when Tyrion hears Aegon and his army has turned to Westeros, he completely forgets that his last remaining nephew is in danger. It never occurs to him. \n\nI theorize that Aegon and his army will be successful and dispose of the last Lannister pretender. That Tyrion  has inadvertently killed his last remaining nephew due to his scheming.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "EXTENDED", "id": "659dt2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 368, "report_reasons": null, "author": "BastardBrave", "saved": false, "mod_reports": [], "name": "t3_659dt2", "subreddit_name_prefixed": "r/asoiaf", "approved_by": null, "over_18": false, "domain": "self.asoiaf", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2r2o9", "edited": 1492130726.0, "link_flair_css_class": "extended", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/asoiaf/comments/659dt2/spoilers_extended_tyrion_has_doomed_tommen/", "num_reports": null, "locked": false, "stickied": false, "created": 1492158048.0, "url": "https://www.reddit.com/r/asoiaf/comments/659dt2/spoilers_extended_tyrion_has_doomed_tommen/", "author_flair_text": null, "quarantine": false, "title": "(Spoilers Extended) Tyrion has doomed Tommen", "created_utc": 1492129248.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 67, "visited": false, "subreddit_type": "public", "ups": 368}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg8m4vk", "gilded": 0, "archived": false, "score": 88, "report_reasons": null, "author": "KnightOfTheMind", "parent_id": "t1_dg8j42p", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;\"\"This one would make my sister weep bitter tears, at least.\"\"\n\nI know GRRM identifies a lot with Sam, but he kind of identifies a lot with Tyrion, too, and it's funny to think of GRRM talking through Tyrion as that line was written.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;&amp;quot;This one would make my sister weep bitter tears, at least.&amp;quot;&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I know GRRM identifies a lot with Sam, but he kind of identifies a lot with Tyrion, too, and it&amp;#39;s funny to think of GRRM talking through Tyrion as that line was written.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8m4vk", "score_hidden": false, "stickied": false, "created": 1492164958.0, "created_utc": 1492136158.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 88}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg8upb6", "gilded": 0, "archived": false, "score": 77, "report_reasons": null, "author": "sebastianwillows", "parent_id": "t1_dg8m3il", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Yeah, Tyrion in DANCE is far from a reliable narrator in terms of emotional stability...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, Tyrion in DANCE is far from a reliable narrator in terms of emotional stability...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8upb6", "score_hidden": false, "stickied": false, "created": 1492179742.0, "created_utc": 1492150942.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 77}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg95wz4", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Cael_of_House_Howell", "parent_id": "t1_dg953wm", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Truer words there are not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Truer words there are not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg95wz4", "score_hidden": false, "stickied": false, "created": 1492207416.0, "created_utc": 1492178616.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dgapoet", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GyantSpyder", "parent_id": "t1_dg9s3wl", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Roughly, yeah. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Roughly, yeah. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgapoet", "score_hidden": false, "stickied": false, "created": 1492296182.0, "created_utc": 1492267382.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9s3wl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "smn111", "parent_id": "t1_dg953wm", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Is it also the same when you spent the last few days in a wooden box, had to shit/piss yourself and no one told you where you're going?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is it also the same when you spent the last few days in a wooden box, had to shit/piss yourself and no one told you where you&amp;#39;re going?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9s3wl", "score_hidden": false, "stickied": false, "created": 1492234010.0, "created_utc": 1492205210.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg953wm", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "GyantSpyder", "parent_id": "t1_dg8m3il", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "When you're drunk often enough, the way you are when you're drunk is the way you are.\n\nIt's the same with depression.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you&amp;#39;re drunk often enough, the way you are when you&amp;#39;re drunk is the way you are.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s the same with depression.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg953wm", "score_hidden": false, "stickied": false, "created": 1492206254.0, "created_utc": 1492177454.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg93rwx", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Tim-TheEnchanter", "parent_id": "t1_dg91f44", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Maybe I'm taking things too literally (the whole unreliable narrator thing gets me every time), but I think that, at least for most of ADWD, he really doesn't give two shits about his family, even after being reminded.  \n\nHis father hated and resented him, he's convinced his sister was actively attempting to have him killed and he recently found out that Jaime, the one family member he thought he could trust, was complicit in what happened to his wife. Saving family isn't a real big motivator for him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe I&amp;#39;m taking things too literally (the whole unreliable narrator thing gets me every time), but I think that, at least for most of ADWD, he really doesn&amp;#39;t give two shits about his family, even after being reminded.  &lt;/p&gt;\n\n&lt;p&gt;His father hated and resented him, he&amp;#39;s convinced his sister was actively attempting to have him killed and he recently found out that Jaime, the one family member he thought he could trust, was complicit in what happened to his wife. Saving family isn&amp;#39;t a real big motivator for him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg93rwx", "score_hidden": false, "stickied": false, "created": 1492204153.0, "created_utc": 1492175353.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg91f44", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "BastardBrave", "parent_id": "t1_dg8m3il", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "He never intended to harm her. The problem is that he doesn't think of the consequences of his vile scheming. Illyrio has to point out the flaw to his plan before he even sees it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He never intended to harm her. The problem is that he doesn&amp;#39;t think of the consequences of his vile scheming. Illyrio has to point out the flaw to his plan before he even sees it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg91f44", "score_hidden": false, "stickied": false, "created": 1492199457.0, "created_utc": 1492170657.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8m3il", "gilded": 0, "archived": false, "score": 51, "report_reasons": null, "author": "Notorioussea", "parent_id": "t1_dg8j42p", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Does he really want to kill Myrcella?\n\nHe said this when he was depressed drunk and was trying to be bold to the IIyrio.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does he really want to kill Myrcella?&lt;/p&gt;\n\n&lt;p&gt;He said this when he was depressed drunk and was trying to be bold to the IIyrio.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8m3il", "score_hidden": false, "stickied": false, "created": 1492164907.0, "created_utc": 1492136107.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 51}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8j42p", "gilded": 0, "archived": false, "score": 161, "report_reasons": null, "author": "Tim-TheEnchanter", "parent_id": "t3_659dt2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; he completely forgets that his last remaining nephew is in danger. It never occurs to him.\n\nEven if it did, i'm not sure he'd really care all that much given his thoughts about myrcella:\n\n&gt;\"This one would make my sister weep bitter tears, at least.\"\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;he completely forgets that his last remaining nephew is in danger. It never occurs to him.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Even if it did, i&amp;#39;m not sure he&amp;#39;d really care all that much given his thoughts about myrcella:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;This one would make my sister weep bitter tears, at least.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8j42p", "score_hidden": false, "stickied": false, "created": 1492160763.0, "created_utc": 1492131963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 161}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dgbmvcx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FrenchToast1047", "parent_id": "t1_dg918s5", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Throw the possibility of Varys involvement into the mix and now we've got a party. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Throw the possibility of Varys involvement into the mix and now we&amp;#39;ve got a party. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgbmvcx", "score_hidden": false, "stickied": false, "created": 1492343008.0, "created_utc": 1492314208.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg918s5", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "J4k0b42", "parent_id": "t1_dg90l2z", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "And Oberyn poisoned Tywin before, so we've got some sort of a poison triangle going on here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And Oberyn poisoned Tywin before, so we&amp;#39;ve got some sort of a poison triangle going on here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg918s5", "score_hidden": false, "stickied": false, "created": 1492199036.0, "created_utc": 1492170236.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg90wv5", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Goomich", "parent_id": "t1_dg90l2z", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "He did bad job.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He did bad job.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg90wv5", "score_hidden": false, "stickied": false, "created": 1492198211.0, "created_utc": 1492169411.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg90l2z", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "arabicfarmer27", "parent_id": "t1_dg8yyib", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "What if Tywin poisoned the Mountain before Oberyn?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What if Tywin poisoned the Mountain before Oberyn?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg90l2z", "score_hidden": false, "stickied": false, "created": 1492197338.0, "created_utc": 1492168538.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg98dl6", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Syng420", "parent_id": "t1_dg8yyib", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "It would have been easy too. The Mountain is always taking milk of the poppy, all Tywin had to do was threaten or order his maester or Pycelle to put poison in the medicine. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It would have been easy too. The Mountain is always taking milk of the poppy, all Tywin had to do was threaten or order his maester or Pycelle to put poison in the medicine. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg98dl6", "score_hidden": false, "stickied": false, "created": 1492210674.0, "created_utc": 1492181874.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg9dlsx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MCPtz", "parent_id": "t1_dg8yyib", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Maybe Tywin wanted Tyrion dead more than the alternative.\n\nIf he poisoned The Mountain.\n\n[Wait, a moment's break for Clegane bowl hype](https://youtu.be/hka-lhU-EWs?t=460)\n\nAnyways...\n\n\nIf he did poison the Mountain, then Oberyn would most likely win, freeing Tyrion.\n\nTywin hated Tyrion. Not sure why. He was a competent commander. He even taught Tywin to relax and get laid before the end.\n\nCan you imagine that? Would rather risk killing his grand daughter for a good chance to kill his son.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe Tywin wanted Tyrion dead more than the alternative.&lt;/p&gt;\n\n&lt;p&gt;If he poisoned The Mountain.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://youtu.be/hka-lhU-EWs?t=460\"&gt;Wait, a moment&amp;#39;s break for Clegane bowl hype&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Anyways...&lt;/p&gt;\n\n&lt;p&gt;If he did poison the Mountain, then Oberyn would most likely win, freeing Tyrion.&lt;/p&gt;\n\n&lt;p&gt;Tywin hated Tyrion. Not sure why. He was a competent commander. He even taught Tywin to relax and get laid before the end.&lt;/p&gt;\n\n&lt;p&gt;Can you imagine that? Would rather risk killing his grand daughter for a good chance to kill his son.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9dlsx", "score_hidden": false, "stickied": false, "created": 1492216726.0, "created_utc": 1492187926.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg9nyvg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "taabr2", "parent_id": "t1_dg8yyib", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Honestly Tywin probably wouldn't give a shit. Having his grandson Tommen as king would be enough, what more could Myrcella add to his legacy there, in this hypothetical Myrcella is already a hostage and thus a liability. I firmly believe the theory that Tywin knew full well of Joffrey's poisoning beforehand.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly Tywin probably wouldn&amp;#39;t give a shit. Having his grandson Tommen as king would be enough, what more could Myrcella add to his legacy there, in this hypothetical Myrcella is already a hostage and thus a liability. I firmly believe the theory that Tywin knew full well of Joffrey&amp;#39;s poisoning beforehand.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9nyvg", "score_hidden": false, "stickied": false, "created": 1492228934.0, "created_utc": 1492200134.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg93vec", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "pazur13", "parent_id": "t1_dg91f42", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Not every character has to always do the most reasonable thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not every character has to always do the most reasonable thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg93vec", "score_hidden": false, "stickied": false, "created": 1492204319.0, "created_utc": 1492175519.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg91f42", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "throwmehomey", "parent_id": "t1_dg8yyib", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 1, "body": "Plothole?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Plothole?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg91f42", "score_hidden": false, "stickied": false, "created": 1492199457.0, "created_utc": 1492170657.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8yyib", "gilded": 0, "archived": false, "score": 73, "report_reasons": null, "author": "Emhyr_var_Emreis", "parent_id": "t1_dg8x4lq", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "No, but Tywin should have.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, but Tywin should have.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8yyib", "score_hidden": false, "stickied": false, "created": 1492192267.0, "created_utc": 1492163467.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 73}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8x4lq", "gilded": 0, "archived": false, "score": 55, "report_reasons": null, "author": "Mellor88", "parent_id": "t1_dg8ww7m", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "In her blind hatred for Tyrion at that point, did Cersei ever pause to consider Myrcella when Oberyn stepped forward?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In her blind hatred for Tyrion at that point, did Cersei ever pause to consider Myrcella when Oberyn stepped forward?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8x4lq", "score_hidden": false, "stickied": false, "created": 1492186336.0, "created_utc": 1492157536.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 55}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg9bjom", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Scheduler", "parent_id": "t1_dg8ww7m", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "\"Safer in Dorne\" is just Tyrion confirming to himself that Pycelle informed on him, not Littlefinger.\n\nIf it had been the other way around Cersei would have come in ranting about what a cunt Lysa Arryn is.\n\nIf all of the small council had been trustworthy then it all would have stayed as thought bubbles and the kids might have been sent to Casterly Rock.\n\nCersei confronting Tyrion is ultimately what led to Myrcella going to Dorne. It could just as easily have been Tommen, or maybe just Gregor Cleganes head.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Safer in Dorne&amp;quot; is just Tyrion confirming to himself that Pycelle informed on him, not Littlefinger.&lt;/p&gt;\n\n&lt;p&gt;If it had been the other way around Cersei would have come in ranting about what a cunt Lysa Arryn is.&lt;/p&gt;\n\n&lt;p&gt;If all of the small council had been trustworthy then it all would have stayed as thought bubbles and the kids might have been sent to Casterly Rock.&lt;/p&gt;\n\n&lt;p&gt;Cersei confronting Tyrion is ultimately what led to Myrcella going to Dorne. It could just as easily have been Tommen, or maybe just Gregor Cleganes head.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9bjom", "score_hidden": false, "stickied": false, "created": 1492214445.0, "created_utc": 1492185645.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg977yh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Theo-greking", "parent_id": "t1_dg8ww7m", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Yeah I feel they should have had the mountain killed the death of Oberon pretty much ended that relationship ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I feel they should have had the mountain killed the death of Oberon pretty much ended that relationship &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg977yh", "score_hidden": false, "stickied": false, "created": 1492209189.0, "created_utc": 1492180389.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dga4ylu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Scheduler", "parent_id": "t1_dg9oyub", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;The thing is that the Stormlands and Reach were never truly united because of the split between Renly and Stannis.\n\nThey didn't have united causes but they were both rebelling against the crown. \n\n&gt;It also assumes Dorne would ally with the Reach even though they are long time enemies.\n\nNo, it doesn't. As I said, this deal was being struck when Renly was alive. There's no chance of winning the Tyrells over while Renly and Margaery are married, therefore if Dorne were fighting for the Crown they would have been fighting the Tyrells and Baratheons. \n\nThe Tyrells allegiance was only able to be changed with Renly's death, which Tyrion wasn't anticipating. He notes that Renly was biding his time on the march, feasting at a new castle every night, this isn't exactly life threatening activity as far as wars go.\n\nThis was never a choice between having Dorne or having The Reach. I'm not sure if that's what you're suggesting with your last sentence.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The thing is that the Stormlands and Reach were never truly united because of the split between Renly and Stannis.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They didn&amp;#39;t have united causes but they were both rebelling against the crown. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It also assumes Dorne would ally with the Reach even though they are long time enemies.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, it doesn&amp;#39;t. As I said, this deal was being struck when Renly was alive. There&amp;#39;s no chance of winning the Tyrells over while Renly and Margaery are married, therefore if Dorne were fighting for the Crown they would have been fighting the Tyrells and Baratheons. &lt;/p&gt;\n\n&lt;p&gt;The Tyrells allegiance was only able to be changed with Renly&amp;#39;s death, which Tyrion wasn&amp;#39;t anticipating. He notes that Renly was biding his time on the march, feasting at a new castle every night, this isn&amp;#39;t exactly life threatening activity as far as wars go.&lt;/p&gt;\n\n&lt;p&gt;This was never a choice between having Dorne or having The Reach. I&amp;#39;m not sure if that&amp;#39;s what you&amp;#39;re suggesting with your last sentence.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dga4ylu", "score_hidden": false, "stickied": false, "created": 1492251260.0, "created_utc": 1492222460.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9oyub", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VaganSitsToPee", "parent_id": "t1_dg9b6ij", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "The thing is that the Stormlands and Reach were never truly united because of the split between Renly and Stannis.  It also assumes Dorne would ally with the Reach even though they are long time enemies.  \n\nPlus, a deal getting one side that probably wasn't going to fight anyway to not fight seems pretty useless compared to trying to get a deal where a former enemy actually fights for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing is that the Stormlands and Reach were never truly united because of the split between Renly and Stannis.  It also assumes Dorne would ally with the Reach even though they are long time enemies.  &lt;/p&gt;\n\n&lt;p&gt;Plus, a deal getting one side that probably wasn&amp;#39;t going to fight anyway to not fight seems pretty useless compared to trying to get a deal where a former enemy actually fights for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9oyub", "score_hidden": false, "stickied": false, "created": 1492230140.0, "created_utc": 1492201340.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9b6ij", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Scheduler", "parent_id": "t1_dg9ah5g", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "This deal was being struck when the Stormlands and the Reach were against the crown. Dorne joining the crown would have split Renly's force as the Tyrells and the Marcher lords would have to go south to protect their lands from the Dornishmen, rather than assault KL with Renly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This deal was being struck when the Stormlands and the Reach were against the crown. Dorne joining the crown would have split Renly&amp;#39;s force as the Tyrells and the Marcher lords would have to go south to protect their lands from the Dornishmen, rather than assault KL with Renly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9b6ij", "score_hidden": false, "stickied": false, "created": 1492214024.0, "created_utc": 1492185224.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ah5g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "VaganSitsToPee", "parent_id": "t1_dg94s74", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Sure, it's unknown whether or not he would have joined without Myrcella, but it's highly likely he'd still have avoided the war.\n\nDoran only picks fights he can win and is a careful planner.  This has been stated repeatedly by multiple other characters.  There was no side he could join and guarantee his troops were enough to give victory when Dorne fields the smallest army of the seven kingdoms unless he joined the crown.\n\nTyrion could have given nothing and Doran wouldn't have joined.  Besides, a hostage is what keeps the other side from fighting against you, not you from fighting against them.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure, it&amp;#39;s unknown whether or not he would have joined without Myrcella, but it&amp;#39;s highly likely he&amp;#39;d still have avoided the war.&lt;/p&gt;\n\n&lt;p&gt;Doran only picks fights he can win and is a careful planner.  This has been stated repeatedly by multiple other characters.  There was no side he could join and guarantee his troops were enough to give victory when Dorne fields the smallest army of the seven kingdoms unless he joined the crown.&lt;/p&gt;\n\n&lt;p&gt;Tyrion could have given nothing and Doran wouldn&amp;#39;t have joined.  Besides, a hostage is what keeps the other side from fighting against you, not you from fighting against them.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9ah5g", "score_hidden": false, "stickied": false, "created": 1492213210.0, "created_utc": 1492184410.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg94s74", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Shastada", "parent_id": "t1_dg92m3e", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "His plan was to keep them out of the War of Five Kings. Whether Doran would have gotten involved without Myrcella is unknown, but we know he did not get involved so Tyrion's plan 'worked' from that perspective. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;His plan was to keep them out of the War of Five Kings. Whether Doran would have gotten involved without Myrcella is unknown, but we know he did not get involved so Tyrion&amp;#39;s plan &amp;#39;worked&amp;#39; from that perspective. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg94s74", "score_hidden": false, "stickied": false, "created": 1492205771.0, "created_utc": 1492176971.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg92m3e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VaganSitsToPee", "parent_id": "t1_dg8ww7m", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 1, "body": "I disagree about Tyrion's plan being good.  He gave Doran an extremely valuable Lannister hostage for free.  If the goal was to win their allegiance it certainly massively failed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I disagree about Tyrion&amp;#39;s plan being good.  He gave Doran an extremely valuable Lannister hostage for free.  If the goal was to win their allegiance it certainly massively failed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg92m3e", "score_hidden": false, "stickied": false, "created": 1492202027.0, "created_utc": 1492173227.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ww7m", "gilded": 0, "archived": false, "score": 94, "report_reasons": null, "author": "JustNedsGirl", "parent_id": "t3_659dt2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; \"Safer in Dorne.\"\n\nMyrcella was supposed to be safe in Dorne. When Oberyn came to KL, it was also supposed that he is safe there, because Martells have Myrcella, almost as war hostage, although she was betrothed to Trystane. Oberyn's safety was Lannisters concern, if they wanted Myrcella to live. They knew he had big family and that he was loved in Dorne. It takes only one of his daughters to be hotheaded and Myrcella is doomed.\n\nOberyn came to KL to seek revenge for Elia's death and to kill Mountain and Tywin. When he volunteered to be Tyrion's champion against Mauntain, it was game over. Mountain should be dead man the moment Oberyn said a word. Cerse, Jaime, Tywin, any one of them 3 should have poisoned Mountain or something, some unfortunate accident should have happened ... if they wanted Myrcella to live, he should be dead that morning before fight. Instead, they gambled. They gambled with Myrcella's life and lost.\n\n\nI don't think it was Tyrion's fault at all. He had a good plan, to sent Myrcella to Dorne to not be killed if they lost battle with Stannis, but after that it was up to his family to keep her alive. Only requirement was to not fuck up relation with Dorne and that is exactly what they did. ", "edited": 1492176764.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Safer in Dorne.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Myrcella was supposed to be safe in Dorne. When Oberyn came to KL, it was also supposed that he is safe there, because Martells have Myrcella, almost as war hostage, although she was betrothed to Trystane. Oberyn&amp;#39;s safety was Lannisters concern, if they wanted Myrcella to live. They knew he had big family and that he was loved in Dorne. It takes only one of his daughters to be hotheaded and Myrcella is doomed.&lt;/p&gt;\n\n&lt;p&gt;Oberyn came to KL to seek revenge for Elia&amp;#39;s death and to kill Mountain and Tywin. When he volunteered to be Tyrion&amp;#39;s champion against Mauntain, it was game over. Mountain should be dead man the moment Oberyn said a word. Cerse, Jaime, Tywin, any one of them 3 should have poisoned Mountain or something, some unfortunate accident should have happened ... if they wanted Myrcella to live, he should be dead that morning before fight. Instead, they gambled. They gambled with Myrcella&amp;#39;s life and lost.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think it was Tyrion&amp;#39;s fault at all. He had a good plan, to sent Myrcella to Dorne to not be killed if they lost battle with Stannis, but after that it was up to his family to keep her alive. Only requirement was to not fuck up relation with Dorne and that is exactly what they did. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8ww7m", "score_hidden": false, "stickied": false, "created": 1492185624.0, "created_utc": 1492156824.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 94}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg9b5c3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Soranic", "parent_id": "t1_dg926ft", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Take the Black or lose your head. It's a choice lords and kings have had for thousands of years. Nymeria sent 7 dornish kings to the wall in golden chains. \n\n&gt; Once you're there you're there, it's much too late. Ican cry and scream it's just not fair to leave me here like you don't care.\n\n&gt; Now it's much too late, my time has passed away. All my plans and dreams have ended. Now it's much too late to try and plead my case.\n\nA volunteer gets training time before his vows. Someone sent doesn't get the same freedom. They get a cloak or their sentence. Even Thorne had an option, it just wasn't a good one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take the Black or lose your head. It&amp;#39;s a choice lords and kings have had for thousands of years. Nymeria sent 7 dornish kings to the wall in golden chains. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Once you&amp;#39;re there you&amp;#39;re there, it&amp;#39;s much too late. Ican cry and scream it&amp;#39;s just not fair to leave me here like you don&amp;#39;t care.&lt;/p&gt;\n\n&lt;p&gt;Now it&amp;#39;s much too late, my time has passed away. All my plans and dreams have ended. Now it&amp;#39;s much too late to try and plead my case.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A volunteer gets training time before his vows. Someone sent doesn&amp;#39;t get the same freedom. They get a cloak or their sentence. Even Thorne had an option, it just wasn&amp;#39;t a good one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9b5c3", "score_hidden": false, "stickied": false, "created": 1492213987.0, "created_utc": 1492185187.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg9cj0m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Soranic", "parent_id": "t1_dg9c5it", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Nah, I was agreeing with you, and clarifying for others.\n\nYou're right on Jon Snuh though, can't believe I forgot about Robb and Stannis trying to get him out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah, I was agreeing with you, and clarifying for others.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re right on Jon Snuh though, can&amp;#39;t believe I forgot about Robb and Stannis trying to get him out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9cj0m", "score_hidden": false, "stickied": false, "created": 1492215522.0, "created_utc": 1492186722.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9c5it", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GrantMK2", "parent_id": "t1_dg9b8iy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Responded to wrong one I'm afraid.\n\nAnd Robb *did* plan to have Jon freed of his vows by the bribe of men sent to replace him, but Robb was also very desperate at the time. Father dead, one sister captive of his enemies and the other missing (probably dead), brothers reportedly dead (killed by his practically-a-brother), much of his kingdom held by his enemies, much of his army damaged. You can understand why he was so dead set on trying to get Jon out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Responded to wrong one I&amp;#39;m afraid.&lt;/p&gt;\n\n&lt;p&gt;And Robb &lt;em&gt;did&lt;/em&gt; plan to have Jon freed of his vows by the bribe of men sent to replace him, but Robb was also very desperate at the time. Father dead, one sister captive of his enemies and the other missing (probably dead), brothers reportedly dead (killed by his practically-a-brother), much of his kingdom held by his enemies, much of his army damaged. You can understand why he was so dead set on trying to get Jon out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9c5it", "score_hidden": false, "stickied": false, "created": 1492215122.0, "created_utc": 1492186322.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9b8iy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Soranic", "parent_id": "t1_dg96khx", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Oaths under duress are still oaths. \n\nAlso no one wants to set a precedence where defeated enemies can come back. Only Cersei is dumb enough to think it's okay to break a lifelong vow. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oaths under duress are still oaths. &lt;/p&gt;\n\n&lt;p&gt;Also no one wants to set a precedence where defeated enemies can come back. Only Cersei is dumb enough to think it&amp;#39;s okay to break a lifelong vow. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9b8iy", "score_hidden": false, "stickied": false, "created": 1492214087.0, "created_utc": 1492185287.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg96khx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GrantMK2", "parent_id": "t1_dg926ft", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Plenty of others have been forced into the Faith and NW and weren't allowed to say they didn't want to afterwards.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Plenty of others have been forced into the Faith and NW and weren&amp;#39;t allowed to say they didn&amp;#39;t want to afterwards.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg96khx", "score_hidden": false, "stickied": false, "created": 1492208326.0, "created_utc": 1492179526.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg926ft", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "flameofanor2142", "parent_id": "t1_dg8svgd", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Difference might be that Aemon did so willingly, while a King forced into the Watch/Faith/Maesters would do so under duress and could always try to use that as a way to backpedal out of it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Difference might be that Aemon did so willingly, while a King forced into the Watch/Faith/Maesters would do so under duress and could always try to use that as a way to backpedal out of it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg926ft", "score_hidden": false, "stickied": false, "created": 1492201149.0, "created_utc": 1492172349.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg96j16", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GrantMK2", "parent_id": "t1_dg955n3", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Yet Jon has to swear loyalty to the realm in a letter to KL when he's made Lord Commander even as he affirms he's taking no part in the war, the NW was given land by a Targaryen queen, they primarily take in men from the people of the Seven Kingdoms and their job is to keep people from getting past the Wall.\n\nAutonomous or not, they're still part of the Seven Kingdoms.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yet Jon has to swear loyalty to the realm in a letter to KL when he&amp;#39;s made Lord Commander even as he affirms he&amp;#39;s taking no part in the war, the NW was given land by a Targaryen queen, they primarily take in men from the people of the Seven Kingdoms and their job is to keep people from getting past the Wall.&lt;/p&gt;\n\n&lt;p&gt;Autonomous or not, they&amp;#39;re still part of the Seven Kingdoms.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg96j16", "score_hidden": false, "stickied": false, "created": 1492208271.0, "created_utc": 1492179471.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg955n3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "masterfroo24", "parent_id": "t1_dg8svgd", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "The Wall is not part of the seven Kingdoms. The Seven Kingdoms end at the last hearth, the seat of the Umbers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Wall is not part of the seven Kingdoms. The Seven Kingdoms end at the last hearth, the seat of the Umbers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg955n3", "score_hidden": false, "stickied": false, "created": 1492206327.0, "created_utc": 1492177527.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg94d48", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MetalusVerne", "parent_id": "t1_dg8svgd", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "It wouldn't surprise me if it comes up, and then someone points out that Jon already left the Night's Watch, because he 'died and came back to life' (yeah right, and the Others are coming over the wall).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It wouldn&amp;#39;t surprise me if it comes up, and then someone points out that Jon already left the Night&amp;#39;s Watch, because he &amp;#39;died and came back to life&amp;#39; (yeah right, and the Others are coming over the wall).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg94d48", "score_hidden": false, "stickied": false, "created": 1492205124.0, "created_utc": 1492176324.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8svgd", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "GrantMK2", "parent_id": "t1_dg8siza", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "From an organization that's explicitly not allowed to get into the succession? And Aemon thought it would make sure, and he came from a time where the Targaryen hold on power had been seriously threatened twice before he took his vows (plus an abortive and poorly planned conspiracy). If under those circumstances he thought it would suffice to make sure no one used him to undermine Aegon V, I'd say it's worth considering.\n\nIn the Faith, that will give him a life of learning about prayer and none of learning about governance or politics, with a High Septon who's probably going to be pro-Aegon and a Faith Militant to enforce that.\n\nPlus there's geography and local politics to consider too. At the NW he's about as far from KL as you can go and still be in the Seven Kingdoms, or he could be sent to learn to be a septon at Sunspear under the Martels, in both cases putting him in very anti-Lannister territory.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From an organization that&amp;#39;s explicitly not allowed to get into the succession? And Aemon thought it would make sure, and he came from a time where the Targaryen hold on power had been seriously threatened twice before he took his vows (plus an abortive and poorly planned conspiracy). If under those circumstances he thought it would suffice to make sure no one used him to undermine Aegon V, I&amp;#39;d say it&amp;#39;s worth considering.&lt;/p&gt;\n\n&lt;p&gt;In the Faith, that will give him a life of learning about prayer and none of learning about governance or politics, with a High Septon who&amp;#39;s probably going to be pro-Aegon and a Faith Militant to enforce that.&lt;/p&gt;\n\n&lt;p&gt;Plus there&amp;#39;s geography and local politics to consider too. At the NW he&amp;#39;s about as far from KL as you can go and still be in the Seven Kingdoms, or he could be sent to learn to be a septon at Sunspear under the Martels, in both cases putting him in very anti-Lannister territory.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8svgd", "score_hidden": false, "stickied": false, "created": 1492175827.0, "created_utc": 1492147027.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg8te13", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GrantMK2", "parent_id": "t1_dg8siza", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I will admit he does have one cover, judging by how everyone reacts to how Robert would have handled hearing about Cersei, children of incest from a non-Targaryen line probably get viewed with enough distaste that you've got more religious and political coverage for execution.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I will admit he does have one cover, judging by how everyone reacts to how Robert would have handled hearing about Cersei, children of incest from a non-Targaryen line probably get viewed with enough distaste that you&amp;#39;ve got more religious and political coverage for execution.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8te13", "score_hidden": false, "stickied": false, "created": 1492176838.0, "created_utc": 1492148038.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8siza", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "murphykp", "parent_id": "t1_dg8owxi", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; Tommen can be forced into the Faith or the Night's Watch.\n\nI dunno man, I'm not sure that sort of 'out' works for kings. Lords great and small, men and women in the line of succession sure (ex: Aemon) but I doubt they'd let anyone who actually sit on the throne live and risk raising an army. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Tommen can be forced into the Faith or the Night&amp;#39;s Watch.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I dunno man, I&amp;#39;m not sure that sort of &amp;#39;out&amp;#39; works for kings. Lords great and small, men and women in the line of succession sure (ex: Aemon) but I doubt they&amp;#39;d let anyone who actually sit on the throne live and risk raising an army. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8siza", "score_hidden": false, "stickied": false, "created": 1492175155.0, "created_utc": 1492146355.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg99h8k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "wastelander", "parent_id": "t1_dg96dk2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;I believe she is already dead or will succumb to her wounds\n\nI'm betting that Dorkstar's sword was poisoned. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I believe she is already dead or will succumb to her wounds&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m betting that Dorkstar&amp;#39;s sword was poisoned. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg99h8k", "score_hidden": false, "stickied": false, "created": 1492212027.0, "created_utc": 1492183227.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg96u2l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GrantMK2", "parent_id": "t1_dg96dk2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;I believe she is already dead or will succumb to her wounds. We can agree to disagree on that. However, she was a valuable hostage until Arianne ruined that. Now she is on her way back to king's landing because the Martells broke good faith. \n\nArianne explicitly says she's going to have Myrcella tell the Lannisters' man that his predecessor was killed by Darkstar. Hard to do that if the kid's about to die.\n\n&gt;Aegon is supported by Varys and Illyrio. Both men don't give a damn about any of the Lannisters. I can't imagine anyone in the Golden Company giving a damn about one little boy king. \n\nExcept that both of them care very much about making this work, and not killing children (as I pointed out) sends a much better message than what the Lannisters did and helps make Aegon look that much better.\n\nAlso we see Varys not happy about the deaths his work is causing and try to save some, like Ned. If he saw a way to avoid killing a child and get the same end result, he'd probably take it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I believe she is already dead or will succumb to her wounds. We can agree to disagree on that. However, she was a valuable hostage until Arianne ruined that. Now she is on her way back to king&amp;#39;s landing because the Martells broke good faith. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Arianne explicitly says she&amp;#39;s going to have Myrcella tell the Lannisters&amp;#39; man that his predecessor was killed by Darkstar. Hard to do that if the kid&amp;#39;s about to die.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Aegon is supported by Varys and Illyrio. Both men don&amp;#39;t give a damn about any of the Lannisters. I can&amp;#39;t imagine anyone in the Golden Company giving a damn about one little boy king. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Except that both of them care very much about making this work, and not killing children (as I pointed out) sends a much better message than what the Lannisters did and helps make Aegon look that much better.&lt;/p&gt;\n\n&lt;p&gt;Also we see Varys not happy about the deaths his work is causing and try to save some, like Ned. If he saw a way to avoid killing a child and get the same end result, he&amp;#39;d probably take it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg96u2l", "score_hidden": false, "stickied": false, "created": 1492208681.0, "created_utc": 1492179881.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dgaxyhq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Megatron_McLargeHuge", "parent_id": "t1_dg96dk2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Gold will be their crowns, remember? Myrcella has to be a queen before she dies. My theory is Arianne's mission is to propose a marriage between Aegon and Myrcella. That alliance could explain the vision of the false dragon being greeted by cheering crowds.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gold will be their crowns, remember? Myrcella has to be a queen before she dies. My theory is Arianne&amp;#39;s mission is to propose a marriage between Aegon and Myrcella. That alliance could explain the vision of the false dragon being greeted by cheering crowds.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgaxyhq", "score_hidden": false, "stickied": false, "created": 1492307803.0, "created_utc": 1492279003.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg98leu", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Syng420", "parent_id": "t1_dg96dk2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Balon Swann talks to Myrcella and she tells him it was Darkstar that killed Arys and attacked her. Swann also wants to take her back to KL which would be hard to do if she was dead or at death's door.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Balon Swann talks to Myrcella and she tells him it was Darkstar that killed Arys and attacked her. Swann also wants to take her back to KL which would be hard to do if she was dead or at death&amp;#39;s door.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg98leu", "score_hidden": false, "stickied": false, "created": 1492210944.0, "created_utc": 1492182144.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg96dk2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BastardBrave", "parent_id": "t1_dg8owxi", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;Myrcella isn't dead, and the Martels certainly aren't going to kill her right now. They're going to be going to war anyway, and she's a valuable hostage.\n\nI believe she is already dead or will succumb to her wounds. We can agree to disagree on that. However, she *was* a valuable hostage until Arianne ruined that. Now she is on her way back to king's landing because the Martells broke good faith. \n\n&gt;Tommen can be forced into the Faith or the Night's Watch.\n\nI've seen this bit of diplomacy tossed around before. It's a very honorable way of dealing with inconvenient heirs. But it just wouldn't work under these circumstances. \n\nAegon is supported by Varys and Illyrio. Both men don't give a damn about any of the Lannisters. I can't imagine anyone in the Golden Company giving a damn about one little boy king. \n\nIf his council demands Tommen die, Aegon would acquiesce to the decision. Perhaps Aegon would call for Tommen's head himself. I mean, academically, that's what kings do to rivals. And all Aegon knows about ruling he's learned from books. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Myrcella isn&amp;#39;t dead, and the Martels certainly aren&amp;#39;t going to kill her right now. They&amp;#39;re going to be going to war anyway, and she&amp;#39;s a valuable hostage.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I believe she is already dead or will succumb to her wounds. We can agree to disagree on that. However, she &lt;em&gt;was&lt;/em&gt; a valuable hostage until Arianne ruined that. Now she is on her way back to king&amp;#39;s landing because the Martells broke good faith. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Tommen can be forced into the Faith or the Night&amp;#39;s Watch.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;ve seen this bit of diplomacy tossed around before. It&amp;#39;s a very honorable way of dealing with inconvenient heirs. But it just wouldn&amp;#39;t work under these circumstances. &lt;/p&gt;\n\n&lt;p&gt;Aegon is supported by Varys and Illyrio. Both men don&amp;#39;t give a damn about any of the Lannisters. I can&amp;#39;t imagine anyone in the Golden Company giving a damn about one little boy king. &lt;/p&gt;\n\n&lt;p&gt;If his council demands Tommen die, Aegon would acquiesce to the decision. Perhaps Aegon would call for Tommen&amp;#39;s head himself. I mean, academically, that&amp;#39;s what kings do to rivals. And all Aegon knows about ruling he&amp;#39;s learned from books. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg96dk2", "score_hidden": false, "stickied": false, "created": 1492208067.0, "created_utc": 1492179267.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg9v3cy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GrantMK2", "parent_id": "t1_dg9mtp2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Which is legally really difficult and politically impossible if he's been forced into one of two organizations that specifically forbid their members from being in the government and can be located in territory that is very anti-Tommen and a long trip away from KL.\n\nAnd law does matter. If Tommen can just get out of it, what's stopping that inconvenient wife you forced into the Silent Sisters? Or that dangerous lord who was on the wrong side of a war and you sent to the Wall? Unless you're hard-core Lannister, you're going to have doubts about backing the kid.\n\nStannis and Robb were both acting out of a desperate need for someone to be the next Stark when they looked into releasing Jon from his vows, and both could have their army force it. Tommen at Castle Black or Sunspear, unless the Lannisters can find a way to march thousands of men there against all of their enemies in strong defenses and before he's shipped off to somewhere else, he's staying there for life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Which is legally really difficult and politically impossible if he&amp;#39;s been forced into one of two organizations that specifically forbid their members from being in the government and can be located in territory that is very anti-Tommen and a long trip away from KL.&lt;/p&gt;\n\n&lt;p&gt;And law does matter. If Tommen can just get out of it, what&amp;#39;s stopping that inconvenient wife you forced into the Silent Sisters? Or that dangerous lord who was on the wrong side of a war and you sent to the Wall? Unless you&amp;#39;re hard-core Lannister, you&amp;#39;re going to have doubts about backing the kid.&lt;/p&gt;\n\n&lt;p&gt;Stannis and Robb were both acting out of a desperate need for someone to be the next Stark when they looked into releasing Jon from his vows, and both could have their army force it. Tommen at Castle Black or Sunspear, unless the Lannisters can find a way to march thousands of men there against all of their enemies in strong defenses and before he&amp;#39;s shipped off to somewhere else, he&amp;#39;s staying there for life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9v3cy", "score_hidden": false, "stickied": false, "created": 1492237908.0, "created_utc": 1492209108.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9mtp2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheLastOfYou", "parent_id": "t1_dg8owxi", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;And Aegon would probably want to avoid killing Tommen. Doing so helps differentiate himself from the infamous Lannisters, sets a much nicer image for the lords to see for the start of his regime and Tommen can be forced into the Faith or the Night's Watch.\n\nInstead of butchering Tommen, it's more likely that they will have an official execution. Exiling the previous King is a poor decision unless you don't care about the possibility that he could gather supporters and come back to fight you later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;And Aegon would probably want to avoid killing Tommen. Doing so helps differentiate himself from the infamous Lannisters, sets a much nicer image for the lords to see for the start of his regime and Tommen can be forced into the Faith or the Night&amp;#39;s Watch.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Instead of butchering Tommen, it&amp;#39;s more likely that they will have an official execution. Exiling the previous King is a poor decision unless you don&amp;#39;t care about the possibility that he could gather supporters and come back to fight you later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9mtp2", "score_hidden": false, "stickied": false, "created": 1492227563.0, "created_utc": 1492198763.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8owxi", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "GrantMK2", "parent_id": "t3_659dt2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Myrcella isn't dead, and the Martels certainly aren't going to kill her right now. They're going to be going to war anyway, and she's a valuable hostage.\n\nAnd Aegon would probably want to avoid killing Tommen. Doing so helps differentiate himself from the infamous Lannisters, sets a much nicer image for the lords to see for the start of his regime and Tommen can be forced into the Faith or the Night's Watch.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Myrcella isn&amp;#39;t dead, and the Martels certainly aren&amp;#39;t going to kill her right now. They&amp;#39;re going to be going to war anyway, and she&amp;#39;s a valuable hostage.&lt;/p&gt;\n\n&lt;p&gt;And Aegon would probably want to avoid killing Tommen. Doing so helps differentiate himself from the infamous Lannisters, sets a much nicer image for the lords to see for the start of his regime and Tommen can be forced into the Faith or the Night&amp;#39;s Watch.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8owxi", "score_hidden": false, "stickied": false, "created": 1492169048.0, "created_utc": 1492140248.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg8jcp9", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "WarOnPugs", "parent_id": "t3_659dt2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "It would be an interesting parallel to his plot to kidnap and threaten Tommenn with violence for Alayaya (even though he [arguably] wouldnt have hurt him) in ASOS.", "edited": 1492133364.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It would be an interesting parallel to his plot to kidnap and threaten Tommenn with violence for Alayaya (even though he [arguably] wouldnt have hurt him) in ASOS.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8jcp9", "score_hidden": false, "stickied": false, "created": 1492161091.0, "created_utc": 1492132291.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg8yanp", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "brneyedgrrl", "parent_id": "t1_dg8qkyy", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Tyrion loves his niece and nephew, as he states many times. I don't think he'd intentionally slaughter them, but he may not realize the far reaching consequences of his scheming and could have inadvertently caused their deaths. But he's not evil enough to kill children on purpose.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tyrion loves his niece and nephew, as he states many times. I don&amp;#39;t think he&amp;#39;d intentionally slaughter them, but he may not realize the far reaching consequences of his scheming and could have inadvertently caused their deaths. But he&amp;#39;s not evil enough to kill children on purpose.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8yanp", "score_hidden": false, "stickied": false, "created": 1492190122.0, "created_utc": 1492161322.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8qkyy", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "pivypiv", "parent_id": "t3_659dt2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "The way I see it, Tyrion now thinks of Myrcella and Tommen only as the products of Jaime and Cersei's incest. Jaime spent over a decade with the woman he loved (albeit secretly) and she bore him three children. Tyrion on the other hand, was betrayed by Jaime, and now blames him for the unfortunate end to his marriage to Tysha. Why should Jaime have the one he loves, but not Tyrion? So long story short Tyrion despises both of his siblings now, and Myrcella/Tommen are a symbol of that hatred.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The way I see it, Tyrion now thinks of Myrcella and Tommen only as the products of Jaime and Cersei&amp;#39;s incest. Jaime spent over a decade with the woman he loved (albeit secretly) and she bore him three children. Tyrion on the other hand, was betrayed by Jaime, and now blames him for the unfortunate end to his marriage to Tysha. Why should Jaime have the one he loves, but not Tyrion? So long story short Tyrion despises both of his siblings now, and Myrcella/Tommen are a symbol of that hatred.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8qkyy", "score_hidden": false, "stickied": false, "created": 1492171711.0, "created_utc": 1492142911.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg8nub7", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Th3Seconds1st", "parent_id": "t3_659dt2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I like this, the idea that Tyrion being so caught up in the hatred of his family that he could forget that some of them aren't to blame. That maybe after the death of his niece and nephew He might end up realizing that he still cares about some ( Jaime ) of what's left of them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like this, the idea that Tyrion being so caught up in the hatred of his family that he could forget that some of them aren&amp;#39;t to blame. That maybe after the death of his niece and nephew He might end up realizing that he still cares about some ( Jaime ) of what&amp;#39;s left of them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8nub7", "score_hidden": false, "stickied": false, "created": 1492167421.0, "created_utc": 1492138621.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dgarnat", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Idiotecka", "parent_id": "t3_659dt2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "wait, so, big twist, he was the valonqar all along? damn.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;wait, so, big twist, he was the valonqar all along? damn.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgarnat", "score_hidden": false, "stickied": false, "created": 1492299065.0, "created_utc": 1492270265.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg9vwsk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jmg83", "parent_id": "t1_dg9egq2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Ah, I see. I didn't get it until I searched for it.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah, I see. I didn&amp;#39;t get it until I searched for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9vwsk", "score_hidden": false, "stickied": false, "created": 1492239014.0, "created_utc": 1492210214.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9egq2", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "tabathafortis", "parent_id": "t1_dg9drvd", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I was definitely quoting a line from *Hamilton* but this is insightful all the same LOL.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was definitely quoting a line from &lt;em&gt;Hamilton&lt;/em&gt; but this is insightful all the same LOL.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9egq2", "score_hidden": false, "stickied": false, "created": 1492217692.0, "created_utc": 1492188892.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg9vr4h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jmg83", "parent_id": "t1_dg9o8yb", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I wonder if he knew, subconsciously.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wonder if he knew, subconsciously.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9vr4h", "score_hidden": false, "stickied": false, "created": 1492238804.0, "created_utc": 1492210004.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9o8yb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "taabr2", "parent_id": "t1_dg9drvd", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Oh, Robert most certainly would of been a better father. Robert is the guy who likes to be loved but even as babies Cersei's children was uncomfortable around Robert", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, Robert most certainly would of been a better father. Robert is the guy who likes to be loved but even as babies Cersei&amp;#39;s children was uncomfortable around Robert&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9o8yb", "score_hidden": false, "stickied": false, "created": 1492229276.0, "created_utc": 1492200476.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9drvd", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "jmg83", "parent_id": "t1_dg9d4ti", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Marry, and beget. Okay, that's two jobs, but you get the point. Cersei could have just given birth to a couple of Baratheons, and had as little to do with Robert as possible after. It's possible. She had to push it, though, and gave birth to *three* incest freaks, just to take the piss. Everything else being equal, if her three kids had been Robert's get, most of the shit that happened never would have happened. Robert might have even been a better father, because his own likenesses looking back at him might have appealed to his vanity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Marry, and beget. Okay, that&amp;#39;s two jobs, but you get the point. Cersei could have just given birth to a couple of Baratheons, and had as little to do with Robert as possible after. It&amp;#39;s possible. She had to push it, though, and gave birth to &lt;em&gt;three&lt;/em&gt; incest freaks, just to take the piss. Everything else being equal, if her three kids had been Robert&amp;#39;s get, most of the shit that happened never would have happened. Robert might have even been a better father, because his own likenesses looking back at him might have appealed to his vanity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9drvd", "score_hidden": false, "stickied": false, "created": 1492216916.0, "created_utc": 1492188116.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9d4ti", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "tabathafortis", "parent_id": "t1_dg96fjw", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "She's  a girl in a world in which her only job is to marry rich?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s  a girl in a world in which her only job is to marry rich?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9d4ti", "score_hidden": false, "stickied": false, "created": 1492216190.0, "created_utc": 1492187390.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg96fjw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jmg83", "parent_id": "t3_659dt2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Valid points, but ultimately, I blame Cersei (and of course, Jaime) for the death of her son. Cersei had just *one* job, and that was to let Robert knock her up. She has doomed her \"abominations\" herself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Valid points, but ultimately, I blame Cersei (and of course, Jaime) for the death of her son. Cersei had just &lt;em&gt;one&lt;/em&gt; job, and that was to let Robert knock her up. She has doomed her &amp;quot;abominations&amp;quot; herself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg96fjw", "score_hidden": false, "stickied": false, "created": 1492208141.0, "created_utc": 1492179341.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg943ja", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Zentaurion", "parent_id": "t3_659dt2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "This just reminds me of when\nTyrion made a dark joke to Cersei about him raping Tommen, and she's so paranoid and hateful towards him she's only outraged by it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This just reminds me of when\nTyrion made a dark joke to Cersei about him raping Tommen, and she&amp;#39;s so paranoid and hateful towards him she&amp;#39;s only outraged by it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg943ja", "score_hidden": false, "stickied": false, "created": 1492204693.0, "created_utc": 1492175893.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg9mqja", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheLastOfYou", "parent_id": "t3_659dt2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt; It occurred to me that Tyrion has been and will be responsible for the deaths of all of Cersei's children. \n\nI really don't consider Tyrion responsible for any of their deaths.\n\nThe Tyrells killed Joffrey because he was a monstrous cunt and LittleFinger is a conniving bastard, not because Tyrion plotted to have him killed.\n\nTyrion sent Myrcella to Dorne as part of his plot to undermine Cersei, but it isn't far-fetched to believe that she would be safe there, given that Dorne doesn't harm innocent children. His personal actions are entirely unrelated to the events that led to her death.\n\nEven if Tommen dies because of Aegon, that is only loosely Tyrion's fault. This may be the only example where Tyrion actually shares some blame, but honestly, Aegon intended to kill Tommen, the usurper, and reclaim his family's throne. Whether he went to Dany first and then killed Tommen or went to secure Westeros first is rather irrelevant.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It occurred to me that Tyrion has been and will be responsible for the deaths of all of Cersei&amp;#39;s children. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I really don&amp;#39;t consider Tyrion responsible for any of their deaths.&lt;/p&gt;\n\n&lt;p&gt;The Tyrells killed Joffrey because he was a monstrous cunt and LittleFinger is a conniving bastard, not because Tyrion plotted to have him killed.&lt;/p&gt;\n\n&lt;p&gt;Tyrion sent Myrcella to Dorne as part of his plot to undermine Cersei, but it isn&amp;#39;t far-fetched to believe that she would be safe there, given that Dorne doesn&amp;#39;t harm innocent children. His personal actions are entirely unrelated to the events that led to her death.&lt;/p&gt;\n\n&lt;p&gt;Even if Tommen dies because of Aegon, that is only loosely Tyrion&amp;#39;s fault. This may be the only example where Tyrion actually shares some blame, but honestly, Aegon intended to kill Tommen, the usurper, and reclaim his family&amp;#39;s throne. Whether he went to Dany first and then killed Tommen or went to secure Westeros first is rather irrelevant.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9mqja", "score_hidden": false, "stickied": false, "created": 1492227457.0, "created_utc": 1492198657.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg9979u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RPMadMSU", "parent_id": "t3_659dt2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "While you're right...I don't think Joff was long for that world regardless of Tyrion setting up the Tyrell/Lannister alliance.  Someone would have had witness to and a problem with his demeanor/behavior at some point to the point where they would take action to remove him from the game despite his status. \n\nRebellions and Coups  have been caused by monarchs with the weaknesses and demeanor of Joff.  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While you&amp;#39;re right...I don&amp;#39;t think Joff was long for that world regardless of Tyrion setting up the Tyrell/Lannister alliance.  Someone would have had witness to and a problem with his demeanor/behavior at some point to the point where they would take action to remove him from the game despite his status. &lt;/p&gt;\n\n&lt;p&gt;Rebellions and Coups  have been caused by monarchs with the weaknesses and demeanor of Joff.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9979u", "score_hidden": false, "stickied": false, "created": 1492211692.0, "created_utc": 1492182892.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_659dt2", "likes": null, "replies": "", "user_reports": [], "id": "dg95nva", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "BastardBrave", "parent_id": "t1_dg94pzv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;*Who is this lackwit lickspittle to dare question me? I am a lion of the rock, Lord Tywin's heir. The light of the west. Regent to the iron throne!* This redditor presumed too much. It would do well to have this one's tongue torn out with hot pincers. But that would have to wait -- \n\nWait, what? No. I am not Cersei. I don't blame Tyrion for what happened to Joff or Myrcella or the Lannister predicament. He had no idea what would happen to them. \n\nBut I do place some blame on him for encouraging Aegon to go to Westeros. He might have only been provoking the boy to anger but he seems to not care at all that Aegon followed his advice and are on their way to Westeros. His last nephew is in danger and he just laughs about the absurdity of it all. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;Who is this lackwit lickspittle to dare question me? I am a lion of the rock, Lord Tywin&amp;#39;s heir. The light of the west. Regent to the iron throne!&lt;/em&gt; This redditor presumed too much. It would do well to have this one&amp;#39;s tongue torn out with hot pincers. But that would have to wait -- &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Wait, what? No. I am not Cersei. I don&amp;#39;t blame Tyrion for what happened to Joff or Myrcella or the Lannister predicament. He had no idea what would happen to them. &lt;/p&gt;\n\n&lt;p&gt;But I do place some blame on him for encouraging Aegon to go to Westeros. He might have only been provoking the boy to anger but he seems to not care at all that Aegon followed his advice and are on their way to Westeros. His last nephew is in danger and he just laughs about the absurdity of it all. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg95nva", "score_hidden": false, "stickied": false, "created": 1492207054.0, "created_utc": 1492178254.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg94pzv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Shastada", "parent_id": "t3_659dt2", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 1, "body": "Who are you Cersei? Trying to blame Tyrion for the Lannister's predicament is pretty outlandish. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Who are you Cersei? Trying to blame Tyrion for the Lannister&amp;#39;s predicament is pretty outlandish. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg94pzv", "score_hidden": false, "stickied": false, "created": 1492205680.0, "created_utc": 1492176880.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]