[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "asoiaf", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Volcanism is GRRM&amp;#39;s red herring for Fire Wyrm activities.  We hear repeatedly that dragons are fire made flesh, but on a deeper look you come to realize that fire wyrms are truly fire made flesh, or more likely pyroclasm made flesh.  Some evidence of this can be seen in old Nan&amp;#39;s tales of the ancient destruction of Hardhome, where only two great holes making an awful noise were left.  Those were fire wyrm holes, an entrance and exit.&lt;/p&gt;\n\n&lt;p&gt;As for the two other volcanic hotspots, the Shadow and the ruins of Valyria, I believe those are the remains of breeding colonies of fire wyrms, let loose to destroy their captors in both scenarios. But why in the world would someone breed fire wyrms? To help make dragons.&lt;/p&gt;\n\n&lt;p&gt;Dragons are a hybrid species, fire wyrms plus wyverns.  You can&amp;#39;t breed dragons without fire wyrms, so both the ancient GEO-Dawnians and the valyrians, their progeny, kept breeding colonies of fire wyrms.  The world of Ice and Fire discusses the Valyrians using blood magic to keep the 14 flames in check, and I believe this same trick was used in the GEO-Dawn.  In both cases they were using that magic to hold the wyrms in check.  In both cases, their wards failed and the breeding colonies exploded, ending their empire.&lt;/p&gt;\n\n&lt;p&gt;This is going to be GRRM&amp;#39;s alleghory for industrial Capitalism.  That idea that we keep building up our industries until they get so big that they break the system.  It&amp;#39;s pretty clever, I think, but I digress.&lt;/p&gt;\n\n&lt;p&gt;I believe, like everyone, that the Faceless Men messed up the wards for the Valyrians quite on purpose.&lt;/p&gt;\n\n&lt;p&gt;They talk about the Bloodstone Emperor causing the first long night.  I believe somehow the murder of the Amethyst Empress to have caused the eruption of the volcano that became The Shadow, fallout from the ash cloud led to darkness.  &lt;/p&gt;\n\n&lt;p&gt;I believe the gemstone emperors were not individual emperors that lived for ages, but rather the most noble members of the ruling house.  I believe the titles passed in the same fashion as The Sword of the Morning (the Daynes are a GEO-Dawnian family after all), where the title of &amp;quot;Opal Emperor&amp;quot; could only be passed if there was a worthy member to pass to.  When one house faltered, there would be a vote among the other houses, like the triarchs of volantis with their elephants and tigers.&lt;/p&gt;\n\n&lt;p&gt;I believe &amp;quot;The Prince that was Promised&amp;quot; is a GEO-Dawnian prophecy; that their language, like Valyrian, did not distinguish gender, and that &amp;quot;The Princess that was Promised&amp;quot; was the silver-hair purple-eyed Amethyst Empress who was killed, and thus will be Danaerys.  I believe the Valyrians are almost all descended from GEO-Dawnian &amp;quot;House Amethysts&amp;quot; who escaped before the explosion due to the same foresight the Targaryens later again showed.  I believe Lann the Clever was a &amp;quot;House Emerald&amp;quot; that got away and the dark-haired First Men were &amp;quot;House Onyx&amp;quot; that got away and the Hightowers are probably one of the other gemstone houses (We&amp;#39;ll see what they look like).  &lt;/p&gt;\n\n&lt;p&gt;Sometimes, I believe the &amp;quot;Lion of Night&amp;quot; is the moon and the &amp;quot;Maiden Made of Light&amp;quot; is the Sun.  The Great Empire of the Dawn was born when they met (an eclipse...then the Dawn).  I think that&amp;#39;s as close to a religious pseudo-creation story as we&amp;#39;re gonna get.  Demons of the Lion of Night are things that like the dark, and who knows what kinda creepy things live in the Shadow, but they probably all like the dark. &lt;/p&gt;\n\n&lt;p&gt;Other times, I think R&amp;#39;Hllor is actually a girl and nobody told us yet and she&amp;#39;s the Maiden Made of Light.  It would make sense since there are women in such prominent roles in that faith.  That would make the Great Other the same as The Lion of Night, and we still don&amp;#39;t really know anything about him/it... except what if GRRM means &amp;quot;King&amp;quot; when he says &amp;quot;Lion&amp;quot; and the Lion of Night is the same as the Night King?  This makes sense if you apply the same logic to the Nissa Nissa story.  The second attempt at forging Lightbringer uses the blood of a Lion, which would now mean &amp;quot;King&amp;#39;s Blood,&amp;quot; something known to have power to R&amp;#39;hllorists.&lt;/p&gt;\n\n&lt;p&gt;Then other times I think about how there&amp;#39;s 2 different kinds of weird trees, &amp;quot;light&amp;quot; ones (Weirwoods) and &amp;quot;dark&amp;quot; ones (which we&amp;#39;ve kinda seen but don&amp;#39;t have a name for) and I wonder if the great consciousnesses that those root-neural-networks hold within are the Maiden Made of Light and the Lion of Night.  This would kinda make sense because their son, The God on Earth, seemingly resembles Garth Greenhands who is known as basically a fertility god and the first Greenseer (which is about connecting to those trees).&lt;/p&gt;\n\n&lt;p&gt;I think that&amp;#39;s all I got for now.  Don&amp;#39;t hate. I&amp;#39;ve avoided posting in this sub for a long time.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Volcanism is GRRM's red herring for Fire Wyrm activities.  We hear repeatedly that dragons are fire made flesh, but on a deeper look you come to realize that fire wyrms are truly fire made flesh, or more likely pyroclasm made flesh.  Some evidence of this can be seen in old Nan's tales of the ancient destruction of Hardhome, where only two great holes making an awful noise were left.  Those were fire wyrm holes, an entrance and exit.\n\nAs for the two other volcanic hotspots, the Shadow and the ruins of Valyria, I believe those are the remains of breeding colonies of fire wyrms, let loose to destroy their captors in both scenarios. But why in the world would someone breed fire wyrms? To help make dragons.\n\nDragons are a hybrid species, fire wyrms plus wyverns.  You can't breed dragons without fire wyrms, so both the ancient GEO-Dawnians and the valyrians, their progeny, kept breeding colonies of fire wyrms.  The world of Ice and Fire discusses the Valyrians using blood magic to keep the 14 flames in check, and I believe this same trick was used in the GEO-Dawn.  In both cases they were using that magic to hold the wyrms in check.  In both cases, their wards failed and the breeding colonies exploded, ending their empire.\n\nThis is going to be GRRM's alleghory for industrial Capitalism.  That idea that we keep building up our industries until they get so big that they break the system.  It's pretty clever, I think, but I digress.\n\nI believe, like everyone, that the Faceless Men messed up the wards for the Valyrians quite on purpose.\n\nThey talk about the Bloodstone Emperor causing the first long night.  I believe somehow the murder of the Amethyst Empress to have caused the eruption of the volcano that became The Shadow, fallout from the ash cloud led to darkness.  \n\nI believe the gemstone emperors were not individual emperors that lived for ages, but rather the most noble members of the ruling house.  I believe the titles passed in the same fashion as The Sword of the Morning (the Daynes are a GEO-Dawnian family after all), where the title of \"Opal Emperor\" could only be passed if there was a worthy member to pass to.  When one house faltered, there would be a vote among the other houses, like the triarchs of volantis with their elephants and tigers.\n\nI believe \"The Prince that was Promised\" is a GEO-Dawnian prophecy; that their language, like Valyrian, did not distinguish gender, and that \"The Princess that was Promised\" was the silver-hair purple-eyed Amethyst Empress who was killed, and thus will be Danaerys.  I believe the Valyrians are almost all descended from GEO-Dawnian \"House Amethysts\" who escaped before the explosion due to the same foresight the Targaryens later again showed.  I believe Lann the Clever was a \"House Emerald\" that got away and the dark-haired First Men were \"House Onyx\" that got away and the Hightowers are probably one of the other gemstone houses (We'll see what they look like).  \n\nSometimes, I believe the \"Lion of Night\" is the moon and the \"Maiden Made of Light\" is the Sun.  The Great Empire of the Dawn was born when they met (an eclipse...then the Dawn).  I think that's as close to a religious pseudo-creation story as we're gonna get.  Demons of the Lion of Night are things that like the dark, and who knows what kinda creepy things live in the Shadow, but they probably all like the dark. \n\nOther times, I think R'Hllor is actually a girl and nobody told us yet and she's the Maiden Made of Light.  It would make sense since there are women in such prominent roles in that faith.  That would make the Great Other the same as The Lion of Night, and we still don't really know anything about him/it... except what if GRRM means \"King\" when he says \"Lion\" and the Lion of Night is the same as the Night King?  This makes sense if you apply the same logic to the Nissa Nissa story.  The second attempt at forging Lightbringer uses the blood of a Lion, which would now mean \"King's Blood,\" something known to have power to R'hllorists.\n\nThen other times I think about how there's 2 different kinds of weird trees, \"light\" ones (Weirwoods) and \"dark\" ones (which we've kinda seen but don't have a name for) and I wonder if the great consciousnesses that those root-neural-networks hold within are the Maiden Made of Light and the Lion of Night.  This would kinda make sense because their son, The God on Earth, seemingly resembles Garth Greenhands who is known as basically a fertility god and the first Greenseer (which is about connecting to those trees).\n\nI think that's all I got for now.  Don't hate. I've avoided posting in this sub for a long time.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Published", "id": "65ba90", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "teplightyear", "saved": false, "mod_reports": [], "name": "t3_65ba90", "subreddit_name_prefixed": "r/asoiaf", "approved_by": null, "over_18": false, "domain": "self.asoiaf", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2r2o9", "edited": 1492157220.0, "link_flair_css_class": "published", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/asoiaf/comments/65ba90/my_thoughts_on_the_extended_history_of_planetos/", "num_reports": null, "locked": false, "stickied": false, "created": 1492184998.0, "url": "https://www.reddit.com/r/asoiaf/comments/65ba90/my_thoughts_on_the_extended_history_of_planetos/", "author_flair_text": null, "quarantine": false, "title": "My thoughts on the extended history of Planetos... [Spoilers Published]", "created_utc": 1492156198.0, "distinguished": null, "media": null, "upvote_ratio": 0.73, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65ba90", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65ba90", "likes": null, "replies": "", "user_reports": [], "id": "dgaea08", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "teplightyear", "parent_id": "t1_dg9enjm", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I love that one! I can't even begin to claim I came up with much of this all by myself.  This is patched together from loads of other peoples theories, including that one, Preston Jacobs, and of course everyone on this sub. \n\nAnother wacky theory I like is the one that posits that Lightbringer is the High Tower, fueled by the living fire of a Dragon, Nissa Nissa.  It's based on the fact that towers are sometimes called \"swords\" (i.e. the Palestone Sword, seemingly named after Dawn).  It'd be neat if the Hightowers are trying to figure out how to turn on a WMD.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love that one! I can&amp;#39;t even begin to claim I came up with much of this all by myself.  This is patched together from loads of other peoples theories, including that one, Preston Jacobs, and of course everyone on this sub. &lt;/p&gt;\n\n&lt;p&gt;Another wacky theory I like is the one that posits that Lightbringer is the High Tower, fueled by the living fire of a Dragon, Nissa Nissa.  It&amp;#39;s based on the fact that towers are sometimes called &amp;quot;swords&amp;quot; (i.e. the Palestone Sword, seemingly named after Dawn).  It&amp;#39;d be neat if the Hightowers are trying to figure out how to turn on a WMD.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgaea08", "score_hidden": false, "stickied": false, "created": 1492267732.0, "created_utc": 1492238932.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9enjm", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "diatonix", "parent_id": "t3_65ba90", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Oh my effing goodness. Have you not listened to / read the Mythical Astronomy of Ice and Fire by Lucifer Means Lightbringer? If not, you are going to have multiple orgasms the entire time you do. He came to many similar / related conclusions and takes it so much further (he doesn't really talk about literal dragons but you'll see how it's related, especially to the Amythyst Empress / Lion of Night stuff). You are going to absolutely love it. \n\nhttps://lucifermeanslightbringer.com/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh my effing goodness. Have you not listened to / read the Mythical Astronomy of Ice and Fire by Lucifer Means Lightbringer? If not, you are going to have multiple orgasms the entire time you do. He came to many similar / related conclusions and takes it so much further (he doesn&amp;#39;t really talk about literal dragons but you&amp;#39;ll see how it&amp;#39;s related, especially to the Amythyst Empress / Lion of Night stuff). You are going to absolutely love it. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://lucifermeanslightbringer.com/\"&gt;https://lucifermeanslightbringer.com/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg9enjm", "score_hidden": false, "stickied": false, "created": 1492217903.0, "created_utc": 1492189103.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65ba90", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65ba90", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65ba90", "likes": null, "replies": "", "user_reports": [], "id": "dg8xr4q", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "RagnarGreystark", "parent_id": "t1_dg8wyv3", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "The post conquest dragons were all relatively young when they died. Vermithor was near as big as Vhagar and he was in his 90s. Sunfyre was in his 20s and he was one of the toughest dragons (able to kill a dragon years older than him while he had one wing near ripped off). Plus the Maesters probably poisoned the last ones", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The post conquest dragons were all relatively young when they died. Vermithor was near as big as Vhagar and he was in his 90s. Sunfyre was in his 20s and he was one of the toughest dragons (able to kill a dragon years older than him while he had one wing near ripped off). Plus the Maesters probably poisoned the last ones&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8xr4q", "score_hidden": false, "stickied": false, "created": 1492188334.0, "created_utc": 1492159534.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8wyv3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "teplightyear", "parent_id": "t1_dg8wtik", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "It's also been shown that when bred dragon on dragon they get successively smaller and die out.  If you want a Balerion the Black Dread, you need a fire wyrm.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s also been shown that when bred dragon on dragon they get successively smaller and die out.  If you want a Balerion the Black Dread, you need a fire wyrm.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8wyv3", "score_hidden": false, "stickied": false, "created": 1492185847.0, "created_utc": 1492157047.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8wtik", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RagnarGreystark", "parent_id": "t3_65ba90", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I have one question, why would they need the wyrms after they have the dragons? It'd been shown that dragons can reproduce normally.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have one question, why would they need the wyrms after they have the dragons? It&amp;#39;d been shown that dragons can reproduce normally.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg8wtik", "score_hidden": false, "stickied": false, "created": 1492185405.0, "created_utc": 1492156605.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65ba90", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65ba90", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65ba90", "likes": null, "replies": "", "user_reports": [], "id": "dgakcki", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Saratje", "parent_id": "t1_dgae0d5", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I'm not saying there are no parallels, the human mind is fairly closed and derives most of its ideas through observation, but I just don't feel he's writing ASOIAF to make a statement about worldly affairs, such as Tolkien did. The scouring of the shire being Tolkiens fear that the young generation would destroy nature in favour of building more industry (ironically that young generation would end up creating nature preservation laws). Saruman's use of machines and industry as well as mass production of Uruks likely is a metaphore for his fear of the rise of technology and the industry attached to that. The battle of the Hornburg is likely direct allegory for WW1 trench wars and the futility of that particular form of warfare, and so on.\n\nWith GRRM I feel he's mostly just writing a story and he's inspired by both existing legends and historical events.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not saying there are no parallels, the human mind is fairly closed and derives most of its ideas through observation, but I just don&amp;#39;t feel he&amp;#39;s writing ASOIAF to make a statement about worldly affairs, such as Tolkien did. The scouring of the shire being Tolkiens fear that the young generation would destroy nature in favour of building more industry (ironically that young generation would end up creating nature preservation laws). Saruman&amp;#39;s use of machines and industry as well as mass production of Uruks likely is a metaphore for his fear of the rise of technology and the industry attached to that. The battle of the Hornburg is likely direct allegory for WW1 trench wars and the futility of that particular form of warfare, and so on.&lt;/p&gt;\n\n&lt;p&gt;With GRRM I feel he&amp;#39;s mostly just writing a story and he&amp;#39;s inspired by both existing legends and historical events.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgakcki", "score_hidden": false, "stickied": false, "created": 1492285676.0, "created_utc": 1492256876.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgae0d5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "teplightyear", "parent_id": "t1_dga96wj", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I don't know that he wanted to be as heavy-handed about it, which is why I'll bet we never really get most of this story told to us in the main story.  It's almost impossible, I'd say, to invent a whole history without creating some parallels, though", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know that he wanted to be as heavy-handed about it, which is why I&amp;#39;ll bet we never really get most of this story told to us in the main story.  It&amp;#39;s almost impossible, I&amp;#39;d say, to invent a whole history without creating some parallels, though&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgae0d5", "score_hidden": false, "stickied": false, "created": 1492267079.0, "created_utc": 1492238279.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga96wj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Saratje", "parent_id": "t3_65ba90", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I do not feel that GRRM is a writer who clings to alleghory, such as Tolkien in example did.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do not feel that GRRM is a writer who clings to alleghory, such as Tolkien in example did.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dga96wj", "score_hidden": false, "stickied": false, "created": 1492257689.0, "created_utc": 1492228889.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65ba90", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65ba90", "likes": null, "replies": "", "user_reports": [], "id": "dgadyj0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "teplightyear", "parent_id": "t1_dgaayvu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Thanks! I stayed up way too late writing all that so I really appreciate the kind words :-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks! I stayed up way too late writing all that so I really appreciate the kind words :-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgadyj0", "score_hidden": false, "stickied": false, "created": 1492266956.0, "created_utc": 1492238156.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaayvu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Stronk_Belwas", "parent_id": "t3_65ba90", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Absolutely beautiful", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Absolutely beautiful&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgaayvu", "score_hidden": false, "stickied": false, "created": 1492260754.0, "created_utc": 1492231954.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65ba90", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65ba90", "likes": null, "replies": "", "user_reports": [], "id": "dgaeaf4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "teplightyear", "parent_id": "t1_dg99wvj", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Heh they should start calling themselves no one", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Heh they should start calling themselves no one&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgaeaf4", "score_hidden": false, "stickied": false, "created": 1492267761.0, "created_utc": 1492238961.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg99wvj", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Cael_of_House_Howell", "parent_id": "t3_65ba90", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "In this scenario I totally see the faceless men as anti capitalist hackers, sort of like anonymous. And anonymous fits PERFECTLY for faceless men.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In this scenario I totally see the faceless men as anti capitalist hackers, sort of like anonymous. And anonymous fits PERFECTLY for faceless men.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dg99wvj", "score_hidden": false, "stickied": false, "created": 1492212542.0, "created_utc": 1492183742.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]