[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "asoiaf", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the year 2017, a mysterious portal opens up, linking the Earth with a distant planet, that just so happens to precisely resemble the fictional universe of George R. R. Martin’s ‘A Song of Ice and Fire’. The portal opens up just north of King’s Landing, during the reign of King Robert. Having been sent to Westeros to assess the land and its occupants, the Earth’s ambassador and his staff have drawn up the following development plan for the land, the executive summary reads:&lt;/p&gt;\n\n&lt;p&gt;Step One: Survey and Catalogue&lt;/p&gt;\n\n&lt;p&gt;Westeros is a very large and sparsely populated region. It covers an area of just over 5,000,000 km2, with a reported population of about 40 million, all fortunately unified (except some remote areas of the far north) under one monarchy. It has large areas of fertile agricultural land, untouched forests and abundant fisheries. Metals such as iron, copper and gold can be found, sometimes in great amounts. Other resources, yet to be harnessed by the current technology level, could include fossil fuels such as coal, oil and natural gas. Given its large areas of (by modern standards) untouched wilderness, Westeros could even encourage the creation of a number of tourist hotspots. &lt;/p&gt;\n\n&lt;p&gt;The first step then involves surveying the entire continent. These surveys should identify precious mineral deposits, the most fertile lands and potential tourism sites. An accurate census should be made, counting the population of all its constituent regions and major settlements. The number of farm animals, structures, tools and other key figures should also be ascertained as accurately as possible. Meteorological stations should be set up, perhaps one in every castle (which already serve as convenient centres of local government) to learn more about the Westerosi climate and identify which areas are most suitable for different crops. These can hopefully be maintained by local ‘Maesters’, after simple instruction, and regular reports sent out.&lt;/p&gt;\n\n&lt;p&gt;The Westerosi government should carefully enter into informed contracts with major mining companies from Earth to survey and exploit major mining deposits in a way that advantages both sides. Licenses will be sold for first surveying an area and, once the survey is complete, to enter into more detailed contracts for its exploitation. The vast bulk of the profits should go to a central government fund, allowing Westeros to attain reserves of hard currency, such as US Dollars. These can be used to make further investments into the economy. &lt;/p&gt;\n\n&lt;p&gt;The use of foreign companies, while carrying a risk of exploitation, is necessary as they are the only ones with the technical know-how to get the job done. A key factor in this should also be the transfer of knowledge so that indigenous Westerosi companies can learn such mining techniques for themselves and eventually take over the industry.&lt;/p&gt;\n\n&lt;p&gt;Potential ‘tourist hotspots’ should also be identified in this process. Possible examples of natural wonders include the Isle of Tarth (the ‘Sapphire’ Isle), the Rainwood in the Stormlands, the Honeywine River and the Mountains of the Moon. Foreign journalists should be encouraged to come to Westeros to photograph and film these wonders, serving as free advertising back on Earth. More detailed advertisements should also be prepared for the Earth media, though this will be of limited effectiveness before undertaking the next step.&lt;/p&gt;\n\n&lt;p&gt;Step Two: Improve Transportation and Communications Infrastructure&lt;/p&gt;\n\n&lt;p&gt;As a precursor to any further economic development, a modern transportation infrastructure must be introduced to Westeros. Aside from transferring people, the quicker transfer of goods can help alleviate famine. Historically, a lack of transportation infrastructure was just as great a cause of this as crop failures, as they would seldom occur in many regions at once.&lt;/p&gt;\n\n&lt;p&gt;A simple first step would be the construction of major roads (essentially highways) through all major trade routes in Westeros. The Kindsroad, the Goldroad, the Roseroad and so on must be paved, from one end of the continent to the other. Given the scale of development needed, this step is relatively straightforward. It should also benefit locals traversing the road with traditional horse and cart methods, thus giving an immediate impact.&lt;/p&gt;\n\n&lt;p&gt;As nobody in Westeros has ever imagined a car, let alone knows how to drive one, any vehicles driven on these roads will have to be imported. In the short term, all drivers will have to be foreigners, but driving schools should be set up in all major Westerosi cities to teach locals as best as possible. As part of gaining the favour of local lords (a vital step) they will inevitably be among the first to benefit from this new invention. Cars and free driving lessons may be given as gifts. &lt;/p&gt;\n\n&lt;p&gt;Until an indigenous source of fossil fuels is found, all petrol or LPG will have to be imported. If more economical, electric cars may prove more practical. This will require the setting up of solar power stations along major transport routes, but could be much cheaper than importing every drop of fuel, while requiring less maintenance. If this can be achieved, electric cars may be greatly preferable. Their main issue on Earth is range compared to fossil fuel powered vehicles. However, compared to a horse and cart, a car that needs to spend thirty minutes recharging every 300km or so is still a huge leap forward. We are fortunate this option is open to us, as it would not have been even ten years ago.&lt;/p&gt;\n\n&lt;p&gt;Rivers are already a major source of transportation in Westeros, albeit using ships powered by sail and oar. The transfer of goods (particularly crops and people) would be greatly speeded up by using modern vessels powered by coal, diesel or petrol engines. This is another step that can occur relatively quickly, so that a network of boats (possibly paddle steamers or something more modern) will be active on major rivers such as the Trident, White Knife, Blackwater Rush and Mander). For the time being, all these vessels will have to be imported as will be whatever fuel is used. If locally sourced wood can serve as a substitute, this will obviously prove cheaper. Larger ocean going vessels may eventually traverse the Westerosi coastline.&lt;/p&gt;\n\n&lt;p&gt;Beyond roads and river transport, another possibility is railways, though these would be significantly more difficult to construct. As with boats, steam trains could be run on wood, rather than imported coal or diesel, for the time being. The laying down of tracks and managing of a railway system could be far harder than merely paving over existing roads and importing vehicles and may have to wait a number of years. The same of course goes for air travel, as it would take years to build the airports necessary to support more than a token number of aircraft (though a few should be introduced immediately, using grass airstrips, for reconnaissance purposes).&lt;/p&gt;\n\n&lt;p&gt;As for communications, satellites cannot be launched in orbit around Westeros without bringing in (or manufacturing) rockets capable of launching them, making this impractical for many years. However, copper wires, as were laid down beginning in the 19th century, can quickly crisscross the continent, allowing the installation of telephone exchanges (or merely a telegraph if this is simpler) in major cities and castles. This could be achieved in just a few shorts years. Radio antennas could also be installed to allow wireless communication, though this may take longer.&lt;/p&gt;\n\n&lt;p&gt;With these first steps, within a short period (say five years) Westoros could be criss-crossed with paved highways, telegraph cables and river ferries. A message can be transported from one end of the continent to the other in moments, and a person in just a few days if near a major highway or river. All major castles and cities will possess instant communications with the outside world and have functioning meteorological stations allowing more accurate weather forecasts. Foreign experts will have made progress on identifying major mineral deposits and areas suitable to the introduction of new crops (such as potatoes, rice or corn) while the first tourists (bringing valuable foreign currency) will be trickling in. As Westeros lacks hard currency, but land and labor are cheap, the provision of servants, goods and housing to foreigners can serve as an alternative to monetary wages. There will be no shortage of guides for tourists and surveyors and food and lodging can be provided in return for hard currency.&lt;/p&gt;\n\n&lt;p&gt;Step Three: Reform Agriculture and Peasantry&lt;/p&gt;\n\n&lt;p&gt;The third major step will be the most dramatic yet. &lt;/p&gt;\n\n&lt;p&gt;Modern farming techniques must be introduced in Westeros. At present, the workforce is almost entirely devoted to agriculture. Literacy is rare and generally restricted to the upper classes. Eventually this will reduce the portion of the population needed for farming from over 90% to less than 10% (though this will take several decades at a minimum). &lt;/p&gt;\n\n&lt;p&gt;A careful balance will have to be maintained between the destruction of new jobs and the creation of new ones, so that people do not find themselves caught in the middle. Labor saving agricultural equipment, beginning with simple tools like rakes and wheelbarrows (if these are not already available) before progressing to larger examples like tractors and combine harvesters, should be provided to local lords free of charge. &lt;/p&gt;\n\n&lt;p&gt;Careful calculations should be made as to how many peasant workers will be displaced by each new piece of equipment. Starting with those most eager to leave, this number will then be taken off the lord (in return for the new equipment) and given new housing in the nearest large town or village. Here they can be put to work in other jobs, such as construction or in (as far as practical) local manufacturing and services jobs, while children in particular begin to receive an education (tests should be devised to identify bright children and allocate scarce educational resources to them first). As the number of already literate tutors will almost certainly be insufficient, foreign teachers will probably have to be imported in large numbers. Stressing a sense of adventure to foreign job applicants however, many may accept quite low wages as long as they have sufficient lodging, food and even servants as stated above (‘come live like a lord in Westeros!’)&lt;/p&gt;\n\n&lt;p&gt;For a continent of 40 million people, with tens of millions of hectares if arable land to farm, this process will obviously require a massive amount of capital to purchase the necessary tools and hire the necessary technical experts. Beyond mining licenses and royalties, tourist dollars and whatever else can be traded (such as existing gold and silver reserves – still valuable on modern Earth) large loans may have to be taken out. This again carries some risk, as Westeros will be indebted to foreign creditors for a long time, but progress is likely to be very slow otherwise. &lt;/p&gt;\n\n&lt;p&gt;Step Four: Develop an industrial economy and energy infrastructure&lt;/p&gt;\n\n&lt;p&gt;As farming jobs disappear, new areas in the industries and services sectors will have to develop. In a modern developed economy agriculture only makes up around 3% of GDP. This illustrates, to some extent, the massive difference in GDP between a medieval and an industrial economy, where the latter can be over $50,000 per capita, the former is only around 1-2% of this (or about $500-$1000 per capita in modern terms, as far as this figure is useful). As an example – take Australia (a large, sparsely populated continent quite newly settled) where mining makes up a further 7% of the economy and tourism 2.5%. Developing these two industries will grow the Westerosi economy considerably, but progress must be made in manufacturing (maybe 20-30% of a modern economy) and services (around 70-80%) for it to truly develop.&lt;/p&gt;\n\n&lt;p&gt;As jobs have been exported from the first world to the third world over the last fifty years, Westeros would hope to attract foreign investment the same way. If a large enough pool of relatively educated and hardworking individuals can be assembled, foreign companies may seek to set up factories and other businesses in Westeros to take advantage of lower labour costs (lets assume exporting these goods back to Earth is no obstacle). &lt;/p&gt;\n\n&lt;p&gt;Moving from an agricultural to an industrial economy, more modern infrastructure will have to be developed, funds permitting. Factories will require energy to run. On a small scale, solar and wind can perhaps be set up most quickly. With abundant rivers, there should be great opportunities for hydroelectricity. Once indigenous sources are identified, fossil fuels can follow, perhaps even nuclear (though no doubt requiring even greater outside assistance). Alongside schools, other services such as hospitals will need to be set up in every major town. Hopefully, better nutrition, medicine and hygienic habits (a simple first step would be the encouraging of hand washing and the distribution of simple tools like soap and bandaids to further prevent infection) will cause the infant mortality rate to plummet. Historical trends show that rapid population growth will follow until social norms change over a period of several generations. Africa’s population increased tenfold over the 20th century. Westeros could go from 40 million to 400 million in a similar timeframe. This is the best possible sign that everything is going well.&lt;/p&gt;\n\n&lt;p&gt;To make all this possible, every effort must be made to raise foreign capital and spend it wisely. Other sources of revenue could include the trading of rare animals (dragons in particular, but other examples could include Mammoths, Direwolves or possibly – human rights issues permitting, giants). Foreign zoos may pay great sums to acquire new animals, while biologists would wish to study them further, including the taking of DNA samples. Religion could be another source. No doubt missionaries from Earth’s major religions would wish to enter Westeros and seek new converts. Foreign organisations could fund the building of churches and mosques of their own accord, though this could be a dicey political issue in Westeros, the High Septon should be consulted first.&lt;/p&gt;\n\n&lt;p&gt;Another possibility is that of simple foreign aid. Worldwide foreign aid totalled more than $130 billion in 2014. Sympathetic with the plight of its people, the United Nations could be petitioned to grant some of this money to Westeros. An amount of $4 billion annually (similar to that received by large, poorer countries like Afghanistan or Ethiopia) would transform the Westerosi economy (calculating a current GDP of $500 per capita, this alone would increase that figure by 20% overnight).&lt;/p&gt;\n\n&lt;p&gt;Finally, potentially of huge value, there is the remittance of money by foreign Westerosi workers. In 2014 remittances worth $436 billion went back to developing countries, sent by some 250 million migrant workers (greatly exceeding foreign aid). In some economies remittances make up to a third of their GDP (for India and Chinese, for instance, they total over $60 billion each). Finding employment back on Earth will obviously be difficult at first (even ignoring potential language barriers…?) but many opportunities should present themselves in time. Their assets come in being hardy folk and from a totally different world and culture. Famous Westerosi knights could illustrate jousting in front of TV audiences, Maesters could tell Westerosi legends and Septons explains their religion (perhaps even seeking converts in turn). Ever hungry for new news and entertainment, millions of Earth’s inhabitants will no doubt take an interest. This further contributes to possibilities for tourism (‘Survivor: Westeros’).&lt;/p&gt;\n\n&lt;p&gt;History shows that centrally planned economies inevitably lag behind free markets, though with such rapid changes and the utter lack of education of the population at the beginning, a great degree of top-down planning may be inevitable. Once its economy has truly started to develop however, the big issues in Westeros will become more akin to a country in the 20th century – concerning taxation, political representation, social policy and other areas, rather than dynastic civil wars, plagues and famine.&lt;/p&gt;\n\n&lt;p&gt;Step Five: A consumer economy and emancipation&lt;/p&gt;\n\n&lt;p&gt;The above steps may take several decades to be truly underway. With millions of peasants moving to cities, issues regarding fresh water, waste and sanitation will become more pressing. Existing housing composed of wood and stone should gradually give way to brick and concrete, with access to electricity and plumbing. &lt;/p&gt;\n\n&lt;p&gt;Once literacy reaches a certain level (perhaps 20-30%) reform of the political system becomes likely. Even if there have been no great upheavals in this period (very unlikely given how the nobility will be gradually usurped by the growing working class) calls for emancipation will inevitably follow. It is easy to proclaim that all citizens of a certain age should receive voting rights immediately. However, historically an illiterate population hardly made an effective electorate. The initial franchise may be restricted to property owners (who are also likely to be primarily male). It may then be extended to all literate persons over 30 years of age, eventually to be lowered to 18. These new parliaments, in cooperation with the nobility, can begin to discuss issues such as stock markets, foreign trade and relations, infrastructure spending, the establishment of a welfare state and other typical 20th century issues. If this stage has been reached within 50-100 years, this will indicate great success with the Westerosi experiment. &lt;/p&gt;\n\n&lt;p&gt;A final note concerning political upheaval – as the primary link between Westeros and the outside world, the Iron Throne would retain a great deal of influence over this period. If the ruling dynasty is truly wise and seeks genuine development, they would be encouraged to assemble a small army of mercenaries in the early stages composed of foreign soldiers. These could even be UN troops.&lt;/p&gt;\n\n&lt;p&gt;Being equipped with guns and other modern weapons, this force would make short work of any revolts by wayward lords upset at their peasants being taught how to read. A delicate balance will ensue in incentivising lords to buy into the new order. Granting them with new, unique gifts (such as first access to cars, phones and other technologies – particularly medicine) serves as a carrot, while an unstoppable army equipped with firearms serves as a stick. Obviously, this may bring resentment from peasants who are still coming off second-best, but their own situation should be improving rapidly as well. &lt;/p&gt;\n\n&lt;p&gt;A compromise similar to the British parliament may eventually occur – consisting of a lower ‘house of commons’ of newly emancipated folk and an upper ‘house of lords’ consisting of just that. In time, the royal family (and the other great houses) will accede power to Westerosi parliaments and may (if they are lucky) attain a ceremonial status similar to today’s Queen of England or the Japanese Emperor. Those who adamantly resist the new order, even when offered all possible incentives, will be wiped out.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "In the year 2017, a mysterious portal opens up, linking the Earth with a distant planet, that just so happens to precisely resemble the fictional universe of George R. R. Martin’s ‘A Song of Ice and Fire’. The portal opens up just north of King’s Landing, during the reign of King Robert. Having been sent to Westeros to assess the land and its occupants, the Earth’s ambassador and his staff have drawn up the following development plan for the land, the executive summary reads:\n\n\nStep One: Survey and Catalogue\n\nWesteros is a very large and sparsely populated region. It covers an area of just over 5,000,000 km2, with a reported population of about 40 million, all fortunately unified (except some remote areas of the far north) under one monarchy. It has large areas of fertile agricultural land, untouched forests and abundant fisheries. Metals such as iron, copper and gold can be found, sometimes in great amounts. Other resources, yet to be harnessed by the current technology level, could include fossil fuels such as coal, oil and natural gas. Given its large areas of (by modern standards) untouched wilderness, Westeros could even encourage the creation of a number of tourist hotspots. \n\nThe first step then involves surveying the entire continent. These surveys should identify precious mineral deposits, the most fertile lands and potential tourism sites. An accurate census should be made, counting the population of all its constituent regions and major settlements. The number of farm animals, structures, tools and other key figures should also be ascertained as accurately as possible. Meteorological stations should be set up, perhaps one in every castle (which already serve as convenient centres of local government) to learn more about the Westerosi climate and identify which areas are most suitable for different crops. These can hopefully be maintained by local ‘Maesters’, after simple instruction, and regular reports sent out.\n\nThe Westerosi government should carefully enter into informed contracts with major mining companies from Earth to survey and exploit major mining deposits in a way that advantages both sides. Licenses will be sold for first surveying an area and, once the survey is complete, to enter into more detailed contracts for its exploitation. The vast bulk of the profits should go to a central government fund, allowing Westeros to attain reserves of hard currency, such as US Dollars. These can be used to make further investments into the economy. \n\nThe use of foreign companies, while carrying a risk of exploitation, is necessary as they are the only ones with the technical know-how to get the job done. A key factor in this should also be the transfer of knowledge so that indigenous Westerosi companies can learn such mining techniques for themselves and eventually take over the industry.\n\nPotential ‘tourist hotspots’ should also be identified in this process. Possible examples of natural wonders include the Isle of Tarth (the ‘Sapphire’ Isle), the Rainwood in the Stormlands, the Honeywine River and the Mountains of the Moon. Foreign journalists should be encouraged to come to Westeros to photograph and film these wonders, serving as free advertising back on Earth. More detailed advertisements should also be prepared for the Earth media, though this will be of limited effectiveness before undertaking the next step.\n\n\nStep Two: Improve Transportation and Communications Infrastructure\n\nAs a precursor to any further economic development, a modern transportation infrastructure must be introduced to Westeros. Aside from transferring people, the quicker transfer of goods can help alleviate famine. Historically, a lack of transportation infrastructure was just as great a cause of this as crop failures, as they would seldom occur in many regions at once.\n\nA simple first step would be the construction of major roads (essentially highways) through all major trade routes in Westeros. The Kindsroad, the Goldroad, the Roseroad and so on must be paved, from one end of the continent to the other. Given the scale of development needed, this step is relatively straightforward. It should also benefit locals traversing the road with traditional horse and cart methods, thus giving an immediate impact.\n\nAs nobody in Westeros has ever imagined a car, let alone knows how to drive one, any vehicles driven on these roads will have to be imported. In the short term, all drivers will have to be foreigners, but driving schools should be set up in all major Westerosi cities to teach locals as best as possible. As part of gaining the favour of local lords (a vital step) they will inevitably be among the first to benefit from this new invention. Cars and free driving lessons may be given as gifts. \n\nUntil an indigenous source of fossil fuels is found, all petrol or LPG will have to be imported. If more economical, electric cars may prove more practical. This will require the setting up of solar power stations along major transport routes, but could be much cheaper than importing every drop of fuel, while requiring less maintenance. If this can be achieved, electric cars may be greatly preferable. Their main issue on Earth is range compared to fossil fuel powered vehicles. However, compared to a horse and cart, a car that needs to spend thirty minutes recharging every 300km or so is still a huge leap forward. We are fortunate this option is open to us, as it would not have been even ten years ago.\n\nRivers are already a major source of transportation in Westeros, albeit using ships powered by sail and oar. The transfer of goods (particularly crops and people) would be greatly speeded up by using modern vessels powered by coal, diesel or petrol engines. This is another step that can occur relatively quickly, so that a network of boats (possibly paddle steamers or something more modern) will be active on major rivers such as the Trident, White Knife, Blackwater Rush and Mander). For the time being, all these vessels will have to be imported as will be whatever fuel is used. If locally sourced wood can serve as a substitute, this will obviously prove cheaper. Larger ocean going vessels may eventually traverse the Westerosi coastline.\n\nBeyond roads and river transport, another possibility is railways, though these would be significantly more difficult to construct. As with boats, steam trains could be run on wood, rather than imported coal or diesel, for the time being. The laying down of tracks and managing of a railway system could be far harder than merely paving over existing roads and importing vehicles and may have to wait a number of years. The same of course goes for air travel, as it would take years to build the airports necessary to support more than a token number of aircraft (though a few should be introduced immediately, using grass airstrips, for reconnaissance purposes).\n\n As for communications, satellites cannot be launched in orbit around Westeros without bringing in (or manufacturing) rockets capable of launching them, making this impractical for many years. However, copper wires, as were laid down beginning in the 19th century, can quickly crisscross the continent, allowing the installation of telephone exchanges (or merely a telegraph if this is simpler) in major cities and castles. This could be achieved in just a few shorts years. Radio antennas could also be installed to allow wireless communication, though this may take longer.\n\nWith these first steps, within a short period (say five years) Westoros could be criss-crossed with paved highways, telegraph cables and river ferries. A message can be transported from one end of the continent to the other in moments, and a person in just a few days if near a major highway or river. All major castles and cities will possess instant communications with the outside world and have functioning meteorological stations allowing more accurate weather forecasts. Foreign experts will have made progress on identifying major mineral deposits and areas suitable to the introduction of new crops (such as potatoes, rice or corn) while the first tourists (bringing valuable foreign currency) will be trickling in. As Westeros lacks hard currency, but land and labor are cheap, the provision of servants, goods and housing to foreigners can serve as an alternative to monetary wages. There will be no shortage of guides for tourists and surveyors and food and lodging can be provided in return for hard currency.\n\n\nStep Three: Reform Agriculture and Peasantry\n\nThe third major step will be the most dramatic yet. \n\nModern farming techniques must be introduced in Westeros. At present, the workforce is almost entirely devoted to agriculture. Literacy is rare and generally restricted to the upper classes. Eventually this will reduce the portion of the population needed for farming from over 90% to less than 10% (though this will take several decades at a minimum). \n\nA careful balance will have to be maintained between the destruction of new jobs and the creation of new ones, so that people do not find themselves caught in the middle. Labor saving agricultural equipment, beginning with simple tools like rakes and wheelbarrows (if these are not already available) before progressing to larger examples like tractors and combine harvesters, should be provided to local lords free of charge. \n\nCareful calculations should be made as to how many peasant workers will be displaced by each new piece of equipment. Starting with those most eager to leave, this number will then be taken off the lord (in return for the new equipment) and given new housing in the nearest large town or village. Here they can be put to work in other jobs, such as construction or in (as far as practical) local manufacturing and services jobs, while children in particular begin to receive an education (tests should be devised to identify bright children and allocate scarce educational resources to them first). As the number of already literate tutors will almost certainly be insufficient, foreign teachers will probably have to be imported in large numbers. Stressing a sense of adventure to foreign job applicants however, many may accept quite low wages as long as they have sufficient lodging, food and even servants as stated above (‘come live like a lord in Westeros!’)\n\nFor a continent of 40 million people, with tens of millions of hectares if arable land to farm, this process will obviously require a massive amount of capital to purchase the necessary tools and hire the necessary technical experts. Beyond mining licenses and royalties, tourist dollars and whatever else can be traded (such as existing gold and silver reserves – still valuable on modern Earth) large loans may have to be taken out. This again carries some risk, as Westeros will be indebted to foreign creditors for a long time, but progress is likely to be very slow otherwise. \n\n\nStep Four: Develop an industrial economy and energy infrastructure\n\nAs farming jobs disappear, new areas in the industries and services sectors will have to develop. In a modern developed economy agriculture only makes up around 3% of GDP. This illustrates, to some extent, the massive difference in GDP between a medieval and an industrial economy, where the latter can be over $50,000 per capita, the former is only around 1-2% of this (or about $500-$1000 per capita in modern terms, as far as this figure is useful). As an example – take Australia (a large, sparsely populated continent quite newly settled) where mining makes up a further 7% of the economy and tourism 2.5%. Developing these two industries will grow the Westerosi economy considerably, but progress must be made in manufacturing (maybe 20-30% of a modern economy) and services (around 70-80%) for it to truly develop.\n\nAs jobs have been exported from the first world to the third world over the last fifty years, Westeros would hope to attract foreign investment the same way. If a large enough pool of relatively educated and hardworking individuals can be assembled, foreign companies may seek to set up factories and other businesses in Westeros to take advantage of lower labour costs (lets assume exporting these goods back to Earth is no obstacle). \n\nMoving from an agricultural to an industrial economy, more modern infrastructure will have to be developed, funds permitting. Factories will require energy to run. On a small scale, solar and wind can perhaps be set up most quickly. With abundant rivers, there should be great opportunities for hydroelectricity. Once indigenous sources are identified, fossil fuels can follow, perhaps even nuclear (though no doubt requiring even greater outside assistance). Alongside schools, other services such as hospitals will need to be set up in every major town. Hopefully, better nutrition, medicine and hygienic habits (a simple first step would be the encouraging of hand washing and the distribution of simple tools like soap and bandaids to further prevent infection) will cause the infant mortality rate to plummet. Historical trends show that rapid population growth will follow until social norms change over a period of several generations. Africa’s population increased tenfold over the 20th century. Westeros could go from 40 million to 400 million in a similar timeframe. This is the best possible sign that everything is going well.\n\nTo make all this possible, every effort must be made to raise foreign capital and spend it wisely. Other sources of revenue could include the trading of rare animals (dragons in particular, but other examples could include Mammoths, Direwolves or possibly – human rights issues permitting, giants). Foreign zoos may pay great sums to acquire new animals, while biologists would wish to study them further, including the taking of DNA samples. Religion could be another source. No doubt missionaries from Earth’s major religions would wish to enter Westeros and seek new converts. Foreign organisations could fund the building of churches and mosques of their own accord, though this could be a dicey political issue in Westeros, the High Septon should be consulted first.\n\nAnother possibility is that of simple foreign aid. Worldwide foreign aid totalled more than $130 billion in 2014. Sympathetic with the plight of its people, the United Nations could be petitioned to grant some of this money to Westeros. An amount of $4 billion annually (similar to that received by large, poorer countries like Afghanistan or Ethiopia) would transform the Westerosi economy (calculating a current GDP of $500 per capita, this alone would increase that figure by 20% overnight).\n\nFinally, potentially of huge value, there is the remittance of money by foreign Westerosi workers. In 2014 remittances worth $436 billion went back to developing countries, sent by some 250 million migrant workers (greatly exceeding foreign aid). In some economies remittances make up to a third of their GDP (for India and Chinese, for instance, they total over $60 billion each). Finding employment back on Earth will obviously be difficult at first (even ignoring potential language barriers…?) but many opportunities should present themselves in time. Their assets come in being hardy folk and from a totally different world and culture. Famous Westerosi knights could illustrate jousting in front of TV audiences, Maesters could tell Westerosi legends and Septons explains their religion (perhaps even seeking converts in turn). Ever hungry for new news and entertainment, millions of Earth’s inhabitants will no doubt take an interest. This further contributes to possibilities for tourism (‘Survivor: Westeros’).\n\nHistory shows that centrally planned economies inevitably lag behind free markets, though with such rapid changes and the utter lack of education of the population at the beginning, a great degree of top-down planning may be inevitable. Once its economy has truly started to develop however, the big issues in Westeros will become more akin to a country in the 20th century – concerning taxation, political representation, social policy and other areas, rather than dynastic civil wars, plagues and famine.\n\n\nStep Five: A consumer economy and emancipation\n\nThe above steps may take several decades to be truly underway. With millions of peasants moving to cities, issues regarding fresh water, waste and sanitation will become more pressing. Existing housing composed of wood and stone should gradually give way to brick and concrete, with access to electricity and plumbing. \n\nOnce literacy reaches a certain level (perhaps 20-30%) reform of the political system becomes likely. Even if there have been no great upheavals in this period (very unlikely given how the nobility will be gradually usurped by the growing working class) calls for emancipation will inevitably follow. It is easy to proclaim that all citizens of a certain age should receive voting rights immediately. However, historically an illiterate population hardly made an effective electorate. The initial franchise may be restricted to property owners (who are also likely to be primarily male). It may then be extended to all literate persons over 30 years of age, eventually to be lowered to 18. These new parliaments, in cooperation with the nobility, can begin to discuss issues such as stock markets, foreign trade and relations, infrastructure spending, the establishment of a welfare state and other typical 20th century issues. If this stage has been reached within 50-100 years, this will indicate great success with the Westerosi experiment. \n\nA final note concerning political upheaval – as the primary link between Westeros and the outside world, the Iron Throne would retain a great deal of influence over this period. If the ruling dynasty is truly wise and seeks genuine development, they would be encouraged to assemble a small army of mercenaries in the early stages composed of foreign soldiers. These could even be UN troops.\n\nBeing equipped with guns and other modern weapons, this force would make short work of any revolts by wayward lords upset at their peasants being taught how to read. A delicate balance will ensue in incentivising lords to buy into the new order. Granting them with new, unique gifts (such as first access to cars, phones and other technologies – particularly medicine) serves as a carrot, while an unstoppable army equipped with firearms serves as a stick. Obviously, this may bring resentment from peasants who are still coming off second-best, but their own situation should be improving rapidly as well. \n\nA compromise similar to the British parliament may eventually occur – consisting of a lower ‘house of commons’ of newly emancipated folk and an upper ‘house of lords’ consisting of just that. In time, the royal family (and the other great houses) will accede power to Westerosi parliaments and may (if they are lucky) attain a ceremonial status similar to today’s Queen of England or the Japanese Emperor. Those who adamantly resist the new order, even when offered all possible incentives, will be wiped out.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "NONE", "id": "65nyhg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 15, "report_reasons": null, "author": "ThomasHobbesROK", "saved": false, "mod_reports": [], "name": "t3_65nyhg", "subreddit_name_prefixed": "r/asoiaf", "approved_by": null, "over_18": false, "domain": "self.asoiaf", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2r2o9", "edited": false, "link_flair_css_class": "none", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/asoiaf/comments/65nyhg/an_economic_development_plan_for_westeros_no/", "num_reports": null, "locked": false, "stickied": false, "created": 1492355146.0, "url": "https://www.reddit.com/r/asoiaf/comments/65nyhg/an_economic_development_plan_for_westeros_no/", "author_flair_text": null, "quarantine": false, "title": "An Economic Development Plan for Westeros (No Spoilers)", "created_utc": 1492326346.0, "distinguished": null, "media": null, "upvote_ratio": 0.73, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65nyhg", "likes": null, "replies": "", "user_reports": [], "id": "dgbsyjr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_65nyhg", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "\nReminder - The crow who posted this thread has made it a (No Spoilers) thread.  This scope covers NO story elements of ASOIAF or \"Game of Thrones\" per [Rule 3.3](https://www.reddit.com/r/asoiaf/about/rules).  Any discussion of the story of the books or the show must use [an appropriate spoiler tag](https://www.reddit.com/r/asoiaf/wiki/spoilertagsystem) such as (Spoilers Main) or (Spoilers Published).\n\nThreads about r/asoiaf (meta topics) will be removed at moderator discretion.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/asoiaf) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reminder - The crow who posted this thread has made it a (No Spoilers) thread.  This scope covers NO story elements of ASOIAF or &amp;quot;Game of Thrones&amp;quot; per &lt;a href=\"https://www.reddit.com/r/asoiaf/about/rules\"&gt;Rule 3.3&lt;/a&gt;.  Any discussion of the story of the books or the show must use &lt;a href=\"https://www.reddit.com/r/asoiaf/wiki/spoilertagsystem\"&gt;an appropriate spoiler tag&lt;/a&gt; such as (Spoilers Main) or (Spoilers Published).&lt;/p&gt;\n\n&lt;p&gt;Threads about &lt;a href=\"/r/asoiaf\"&gt;r/asoiaf&lt;/a&gt; (meta topics) will be removed at moderator discretion.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/asoiaf\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgbsyjr", "score_hidden": true, "stickied": true, "created": 1492355147.0, "created_utc": 1492326347.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65nyhg", "likes": null, "replies": "", "user_reports": [], "id": "dgcb6la", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RiverSnake412", "parent_id": "t3_65nyhg", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "You'd better sell the Maesters on this somehow, because you're making them obsolete with that copper wire.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;d better sell the Maesters on this somehow, because you&amp;#39;re making them obsolete with that copper wire.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgcb6la", "score_hidden": false, "stickied": false, "created": 1492393007.0, "created_utc": 1492364207.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65nyhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65nyhg", "likes": null, "replies": "", "user_reports": [], "id": "dgdlfic", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ThomasHobbesROK", "parent_id": "t1_dgcpv01", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Been thinking about it for a while, one night just sat down and spent 3-4 hours typing it all out. \n\nBelieve it or not - this is my idea of a fun night in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Been thinking about it for a while, one night just sat down and spent 3-4 hours typing it all out. &lt;/p&gt;\n\n&lt;p&gt;Believe it or not - this is my idea of a fun night in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdlfic", "score_hidden": false, "stickied": false, "created": 1492470547.0, "created_utc": 1492441747.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcpv01", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "grubbetatattle", "parent_id": "t3_65nyhg", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "What motivated you to write this?\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What motivated you to write this?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgcpv01", "score_hidden": false, "stickied": false, "created": 1492412412.0, "created_utc": 1492383612.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65nyhg", "likes": null, "replies": "", "user_reports": [], "id": "dgdi7gx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Caracaos", "parent_id": "t3_65nyhg", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "You should look up Race For The Iron Throne if you're interested in econdev fantasy surrounding Westeros. Tower of the Hand also has some essays that talk about the economic state of Westerosi regions, in the context of their military strength.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should look up Race For The Iron Throne if you&amp;#39;re interested in econdev fantasy surrounding Westeros. Tower of the Hand also has some essays that talk about the economic state of Westerosi regions, in the context of their military strength.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdi7gx", "score_hidden": false, "stickied": false, "created": 1492466257.0, "created_utc": 1492437457.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]