[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "asoiaf", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We know that on the show D&amp;amp;D put a lot of efforts in making Jon the next Ned, with all the flashbacks, and the visuals (Stark cloaks, the accent, same lines...). Maybe it&amp;#39;s meant  to etablish an emotional connection between the two and to tell the audience &amp;quot;No matter what, Ned will always be Jon&amp;#39;s father&amp;quot; - &lt;em&gt;cheesefest&lt;/em&gt;- since Ned is still a beloved character while Rhaegar is not someone the audience can feel emotionnaly connected to!&lt;/p&gt;\n\n&lt;p&gt;That may be an unpopular opinion but I find their relationship a bit romantized and think the feelings Ned had toward Jon was more dutiful than fatherly or affectionate. I&amp;#39;ve listed some points:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Ned NEVER refers to Jon as his son, always his blood&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Never ask me about Jon,&amp;quot; he said, cold as ice. &amp;quot;&lt;strong&gt;He is my blood&lt;/strong&gt;, and that is all you need to know.&amp;quot; (AGOT, Catelyn II).&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You may not have my name, but you have &lt;strong&gt;my blood&lt;/strong&gt;&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;While confronting Cersei, Ned makes a mental list of his children but excludes Jon &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When he&amp;#39;s in King&amp;#39;s Landing&amp;#39;s cells he refers to Jon as &amp;quot; the boy&amp;quot;  (which is not very affectionate imo) &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If only he could see &lt;strong&gt;the boy&lt;/strong&gt; again, sit and talk with him (AGOT, Eddard XV)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I know it&amp;#39;s put by the author to hint Jon&amp;#39;s parentage, to hint that Ned is not his father, but is that so hard for a parent to call the child he adopted and raised as his own &amp;quot;son&amp;quot;?&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Then we have Ned&amp;#39;s (non-)reaction to Jon going at the Wall&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Ned and Cat argued when Cat says she will kick Jon out of the house, but Ned completely chills out when Maester Luwyn put in his head the idea of Jon joining the Night&amp;#39;s Watch. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Very well,&amp;quot; he said to Maester Luwin. &amp;quot;I suppose it is for the best. I will speak to Ben.&amp;quot; (AGOT, Catelyn II)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Even Tyrion implied to Jon that Ned and Cat got ride of him by sending him to the Wall (can&amp;#39;t find the quote though!)&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Ned&amp;#39;s hella sad when he learns that Bran will never have children of his own but shruged when it was about Jon. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Ned never worries about the danger Jon may face at the Wall. That&amp;#39;s curious since he knows  the wildlings threatens the Night&amp;#39;s Watch (to the point he considered calling the banners to deal with Mance Ryder).&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;From what I&amp;#39;ve read Jeor was more a father figure to Jon than Ned. Jeor gave Jon his own family ancestral sword, which initially belonged to his son, Jorah, thus making him his surrogated son, his &amp;quot;heir&amp;quot;, which is true since Jon would suceed him as Lord Commander. &lt;/p&gt;\n\n&lt;p&gt;Maybe I&amp;#39;m reading to much between the lines, but the relationship between Jon and Ned doesn&amp;#39;t look like a strong father-son relationship. Ned is not emotionally connected to Jon the same way he is with his other kids. He clearly made a difference, not like Cat, but still. I think the promise he made was directed to Lyanna,  not Jon. He kept &lt;strong&gt;Jon&lt;/strong&gt; safe because it was his &lt;strong&gt;duty&lt;/strong&gt; to fulfill Lyanna&amp;#39;s promise, and he kept his promise to &lt;strong&gt;Lyanna&lt;/strong&gt; because he &lt;strong&gt;loves&lt;/strong&gt; her. Maybe Ned extended this love to Jon, but it&amp;#39;s not very noticeable to me. What do you think? &lt;/p&gt;\n\n&lt;p&gt;EDIT for typos because I&amp;#39;m a french frog!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "We know that on the show D&amp;D put a lot of efforts in making Jon the next Ned, with all the flashbacks, and the visuals (Stark cloaks, the accent, same lines...). Maybe it's meant  to etablish an emotional connection between the two and to tell the audience \"No matter what, Ned will always be Jon's father\" - *cheesefest*- since Ned is still a beloved character while Rhaegar is not someone the audience can feel emotionnaly connected to!\n\nThat may be an unpopular opinion but I find their relationship a bit romantized and think the feelings Ned had toward Jon was more dutiful than fatherly or affectionate. I've listed some points:\n\n* Ned NEVER refers to Jon as his son, always his blood\n\n&gt;\"Never ask me about Jon,\" he said, cold as ice. \"**He is my blood**, and that is all you need to know.\" (AGOT, Catelyn II).\n\n&gt;\"You may not have my name, but you have **my blood**\"\n\n- While confronting Cersei, Ned makes a mental list of his children but excludes Jon \n\n- When he's in King's Landing's cells he refers to Jon as \" the boy\"  (which is not very affectionate imo) \n\n&gt;If only he could see **the boy** again, sit and talk with him (AGOT, Eddard XV)\n\nI know it's put by the author to hint Jon's parentage, to hint that Ned is not his father, but is that so hard for a parent to call the child he adopted and raised as his own \"son\"?\n\n* Then we have Ned's (non-)reaction to Jon going at the Wall\n\n- Ned and Cat argued when Cat says she will kick Jon out of the house, but Ned completely chills out when Maester Luwyn put in his head the idea of Jon joining the Night's Watch. \n\n&gt; \"Very well,\" he said to Maester Luwin. \"I suppose it is for the best. I will speak to Ben.\" (AGOT, Catelyn II)\n\nEven Tyrion implied to Jon that Ned and Cat got ride of him by sending him to the Wall (can't find the quote though!)\n\n - Ned's hella sad when he learns that Bran will never have children of his own but shruged when it was about Jon. \n\n- Ned never worries about the danger Jon may face at the Wall. That's curious since he knows  the wildlings threatens the Night's Watch (to the point he considered calling the banners to deal with Mance Ryder).\n\nFrom what I've read Jeor was more a father figure to Jon than Ned. Jeor gave Jon his own family ancestral sword, which initially belonged to his son, Jorah, thus making him his surrogated son, his \"heir\", which is true since Jon would suceed him as Lord Commander. \n\nMaybe I'm reading to much between the lines, but the relationship between Jon and Ned doesn't look like a strong father-son relationship. Ned is not emotionally connected to Jon the same way he is with his other kids. He clearly made a difference, not like Cat, but still. I think the promise he made was directed to Lyanna,  not Jon. He kept **Jon** safe because it was his **duty** to fulfill Lyanna's promise, and he kept his promise to **Lyanna** because he **loves** her. Maybe Ned extended this love to Jon, but it's not very noticeable to me. What do you think? \n\nEDIT for typos because I'm a french frog!\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "EXTENDED", "id": "65vaca", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 15, "report_reasons": null, "author": "Tarakristewa", "saved": false, "mod_reports": [], "name": "t3_65vaca", "subreddit_name_prefixed": "r/asoiaf", "approved_by": null, "over_18": false, "domain": "self.asoiaf", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2r2o9", "edited": 1492439020.0, "link_flair_css_class": "extended", "author_flair_css_class": "Stark", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/asoiaf/comments/65vaca/spoiler_extended_ned_and_jons_relationship/", "num_reports": null, "locked": false, "stickied": false, "created": 1492461389.0, "url": "https://www.reddit.com/r/asoiaf/comments/65vaca/spoiler_extended_ned_and_jons_relationship/", "author_flair_text": "I choose violence", "quarantine": false, "title": "(Spoiler Extended) Ned and Jon's relationship", "created_utc": 1492432589.0, "distinguished": null, "media": null, "upvote_ratio": 0.69, "num_comments": 32, "visited": false, "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": "", "user_reports": [], "id": "dgdk2u2", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "John_Fisticuffs", "parent_id": "t1_dgdfsyu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "right, and it's a great in character reason for ned to never refer to jon as \"my son,\" either in public or internally. to do so is telling a lie and lies eat away at him. I think he finds as many ways to not call Jon his son or his bastard but only the true \"my blood\" because he has such a distaste for it. As much as possible, he lets others fill in the blanks of their relationship so that he doesn't have to lie.\n\nI wouldn't be surprised if he never said the words \"he's my song\" or \"he's my bastard,\" even to Cat, but just let her and everyone else assume. He's so cold and guarded that there were probably few people at Winterfell when he returned with Jon who would directly ask him or force him to say it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;right, and it&amp;#39;s a great in character reason for ned to never refer to jon as &amp;quot;my son,&amp;quot; either in public or internally. to do so is telling a lie and lies eat away at him. I think he finds as many ways to not call Jon his son or his bastard but only the true &amp;quot;my blood&amp;quot; because he has such a distaste for it. As much as possible, he lets others fill in the blanks of their relationship so that he doesn&amp;#39;t have to lie.&lt;/p&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t be surprised if he never said the words &amp;quot;he&amp;#39;s my song&amp;quot; or &amp;quot;he&amp;#39;s my bastard,&amp;quot; even to Cat, but just let her and everyone else assume. He&amp;#39;s so cold and guarded that there were probably few people at Winterfell when he returned with Jon who would directly ask him or force him to say it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdk2u2", "score_hidden": false, "stickied": false, "created": 1492468837.0, "created_utc": 1492440037.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfsyu", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "theMADdestScientist_", "parent_id": "t3_65vaca", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;That may be an unpopular opinion but I find their relationship a bit romantized and think the feelings Ned had toward Jon was more dutiful than fatherly or affectionate.\n\n\nYou are correct, there's a conversation between King Robert and Ned, where Ned alludes to him that he will take care of Robert Arryn if Lysa agrees to it. \n\nThe conversation also explains what Ned is doing for Jon\n\n\n&gt;“Six, and sickly, and Lord of the Eyrie, gods have mercy,” the king swore. “Lord Tywin had never taken a ward before. Lysa ought to have been honored. The Lannisters are a great and noble House. She refused to even hear of it. Then she left in the dead of night, without so much as a by-your-leave. Cersei was furious.” He sighed deeply. “The boy is my namesake, did you know that? Robert Arryn. I am sworn to protect him. How can I do that if his mother steals him away?” “I will take him as ward, if you wish,” Ned said. “Lysa should consent to that. She and Catelyn were close as girls, and she would be welcome here as well.” “A generous offer, my friend,” the king said, “but too late. Lord Tywin has already given his consent. Fostering the boy elsewhere would be a grievous affront to him.” **“I have more concern for my nephew’s welfare than I do for Lannister pride,” Ned declared.**\n\n\nI don't think Ned meant to be Jon's father at first, but it was the best way to keep his nephew safe, so there you have it, he had to tell an even bigger lie to keep the promise he made to his sister. \n\nThat's why Ned spent a lot of his time in AGOT thinking about his lies, this certainly haunts him more than people think.\n\n", "edited": 1492433782.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;That may be an unpopular opinion but I find their relationship a bit romantized and think the feelings Ned had toward Jon was more dutiful than fatherly or affectionate.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You are correct, there&amp;#39;s a conversation between King Robert and Ned, where Ned alludes to him that he will take care of Robert Arryn if Lysa agrees to it. &lt;/p&gt;\n\n&lt;p&gt;The conversation also explains what Ned is doing for Jon&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“Six, and sickly, and Lord of the Eyrie, gods have mercy,” the king swore. “Lord Tywin had never taken a ward before. Lysa ought to have been honored. The Lannisters are a great and noble House. She refused to even hear of it. Then she left in the dead of night, without so much as a by-your-leave. Cersei was furious.” He sighed deeply. “The boy is my namesake, did you know that? Robert Arryn. I am sworn to protect him. How can I do that if his mother steals him away?” “I will take him as ward, if you wish,” Ned said. “Lysa should consent to that. She and Catelyn were close as girls, and she would be welcome here as well.” “A generous offer, my friend,” the king said, “but too late. Lord Tywin has already given his consent. Fostering the boy elsewhere would be a grievous affront to him.” &lt;strong&gt;“I have more concern for my nephew’s welfare than I do for Lannister pride,” Ned declared.&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think Ned meant to be Jon&amp;#39;s father at first, but it was the best way to keep his nephew safe, so there you have it, he had to tell an even bigger lie to keep the promise he made to his sister. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s why Ned spent a lot of his time in AGOT thinking about his lies, this certainly haunts him more than people think.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdfsyu", "score_hidden": false, "stickied": false, "created": 1492462354.0, "created_utc": 1492433554.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": "", "user_reports": [], "id": "dgdmgw4", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "cra68", "parent_id": "t3_65vaca", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Ned loves Jon as an uncle would love a nephew. He loves and respect him. He raised him as one of his own, with warmth and  equal privileges. It is not detailed in the book but it is mentioned and strongly hinted. Here is one of few conversations we have between Jon and Ned: \n\n&gt; \"Lord Stark,\" Jon said. **It was strange to hear him call Father that, so formal.**....Bran saw his **father's face change, saw the other men exchange glances.** He loved Jon with all his heart at that moment. Even at seven, Bran understood what his brother had done. **The count had come right only because Jon had omitted himself.** He had included the girls, included even Rickon, the baby, but not the bastard who bore the surname Snow, the name that custom decreed be given to all those in the north unlucky enough to be born with no name of their own....**Their father understood as well. \"You want no pup for yourself, Jon?\" he asked softly.**\n\n\nWhy was it strange for Jon to speak to Ned that way. Why did the household men react with surprise? Because it was highly unusual. As Catlyn notes, Ned treats Jon as a son for all the North to see. Ned's question in turn is a plea for Jon Jon not exclude himself. \n\n\nIn Kingslanding, Ned's thoughts:\n\n&gt; He yearned for the comfort of Catelyn's arms, for the sounds of Robb and **Jon** crossing swords in the practice yard, for the cool days and cold nights of the north.\"\n\n\n\nAgain Ned's thoughts: \n\n&gt; \"The thought of **Jon** filled Ned with a sense of shame, and a sorrow too deep for words. If only he could see the boy again, sit and talk with him …\"\n\n\nNed cares deeply for Jon. Later, as there are dreams of Ned in the crypts, Bran claims Ned wants to speak of Jon:\n\n&gt; \"It was something to do about Jon, I think.\" \n\n\nNed loves Jon. ", "edited": 1492451814.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ned loves Jon as an uncle would love a nephew. He loves and respect him. He raised him as one of his own, with warmth and  equal privileges. It is not detailed in the book but it is mentioned and strongly hinted. Here is one of few conversations we have between Jon and Ned: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Lord Stark,&amp;quot; Jon said. &lt;strong&gt;It was strange to hear him call Father that, so formal.&lt;/strong&gt;....Bran saw his &lt;strong&gt;father&amp;#39;s face change, saw the other men exchange glances.&lt;/strong&gt; He loved Jon with all his heart at that moment. Even at seven, Bran understood what his brother had done. &lt;strong&gt;The count had come right only because Jon had omitted himself.&lt;/strong&gt; He had included the girls, included even Rickon, the baby, but not the bastard who bore the surname Snow, the name that custom decreed be given to all those in the north unlucky enough to be born with no name of their own....&lt;strong&gt;Their father understood as well. &amp;quot;You want no pup for yourself, Jon?&amp;quot; he asked softly.&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Why was it strange for Jon to speak to Ned that way. Why did the household men react with surprise? Because it was highly unusual. As Catlyn notes, Ned treats Jon as a son for all the North to see. Ned&amp;#39;s question in turn is a plea for Jon Jon not exclude himself. &lt;/p&gt;\n\n&lt;p&gt;In Kingslanding, Ned&amp;#39;s thoughts:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;He yearned for the comfort of Catelyn&amp;#39;s arms, for the sounds of Robb and &lt;strong&gt;Jon&lt;/strong&gt; crossing swords in the practice yard, for the cool days and cold nights of the north.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Again Ned&amp;#39;s thoughts: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;The thought of &lt;strong&gt;Jon&lt;/strong&gt; filled Ned with a sense of shame, and a sorrow too deep for words. If only he could see the boy again, sit and talk with him …&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ned cares deeply for Jon. Later, as there are dreams of Ned in the crypts, Bran claims Ned wants to speak of Jon:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;It was something to do about Jon, I think.&amp;quot; &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ned loves Jon. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdmgw4", "score_hidden": false, "stickied": false, "created": 1492471784.0, "created_utc": 1492442984.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": "", "user_reports": [], "id": "dgdmkog", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Tarakristewa", "parent_id": "t1_dgdkfrs", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I wrote  this post from Ned's POV with Ned's quotes. I'm convinced that Jon will always see Ned as his father, because he's the closest thing to a biological parent he'll ever have. My big questions are, did Ned feel the same about Jon, did he see him as a son or a nephew? Did he love him the same way he loved his own children? I don't think so. He clearly makes a difference between Jon and the rest of his children. The thought he has about Jon are always associated with Lyanna's promise, not with something more positive or more affectionate. He weakly protest when Jon goes at the Wall because he sees that as a win-win situation: Jon's vows will prevent him from claiming the throne. He doesn't have to worry about Cat mistreating him and he protects his family from the threat that represents Jon's parentage. That's cold but understandle. \n\nAnd I have to disagree with Mormont. He chose him as his steward, to instruct him and then he gave him his familly sword, the family's only valuable asset. He made him his heir, something Ned didn't do, and then Jon became the 998th commander, suceeding Jeor.  ", "edited": 1492443445.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wrote  this post from Ned&amp;#39;s POV with Ned&amp;#39;s quotes. I&amp;#39;m convinced that Jon will always see Ned as his father, because he&amp;#39;s the closest thing to a biological parent he&amp;#39;ll ever have. My big questions are, did Ned feel the same about Jon, did he see him as a son or a nephew? Did he love him the same way he loved his own children? I don&amp;#39;t think so. He clearly makes a difference between Jon and the rest of his children. The thought he has about Jon are always associated with Lyanna&amp;#39;s promise, not with something more positive or more affectionate. He weakly protest when Jon goes at the Wall because he sees that as a win-win situation: Jon&amp;#39;s vows will prevent him from claiming the throne. He doesn&amp;#39;t have to worry about Cat mistreating him and he protects his family from the threat that represents Jon&amp;#39;s parentage. That&amp;#39;s cold but understandle. &lt;/p&gt;\n\n&lt;p&gt;And I have to disagree with Mormont. He chose him as his steward, to instruct him and then he gave him his familly sword, the family&amp;#39;s only valuable asset. He made him his heir, something Ned didn&amp;#39;t do, and then Jon became the 998th commander, suceeding Jeor.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdmkog", "score_hidden": false, "stickied": false, "created": 1492471905.0, "created_utc": 1492443105.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkfrs", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "thefalcons5912", "parent_id": "t3_65vaca", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I don't have  whole lot to add to what has already been said, but I just don't think your evidence points to Ned not truly loving Jon or that Ned didn't greatly influence Jon as a father figure. You're going to take on traits when someone raises you from birth. Jon never knew Rhaegar. Jeor was another father figure but more in a professional sense than in a truly paternal one. Ned may truly be Jon's uncle, but even when/if Jon does discover the truth, I don't think he will just toss aside all of Ned's influence upon him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have  whole lot to add to what has already been said, but I just don&amp;#39;t think your evidence points to Ned not truly loving Jon or that Ned didn&amp;#39;t greatly influence Jon as a father figure. You&amp;#39;re going to take on traits when someone raises you from birth. Jon never knew Rhaegar. Jeor was another father figure but more in a professional sense than in a truly paternal one. Ned may truly be Jon&amp;#39;s uncle, but even when/if Jon does discover the truth, I don&amp;#39;t think he will just toss aside all of Ned&amp;#39;s influence upon him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdkfrs", "score_hidden": false, "stickied": false, "created": 1492469301.0, "created_utc": 1492440501.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": "", "user_reports": [], "id": "dgdkr9n", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Rosebunse", "parent_id": "t1_dgdk770", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Well, for one, I'm pretty sure you'd have to worry about the other Northern Houses, like the Bolton, trying to pull something. What would Ned do with the other kids? There would be nowhere to send them. It's not like there are any real Targ supporters left.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, for one, I&amp;#39;m pretty sure you&amp;#39;d have to worry about the other Northern Houses, like the Bolton, trying to pull something. What would Ned do with the other kids? There would be nowhere to send them. It&amp;#39;s not like there are any real Targ supporters left.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdkr9n", "score_hidden": false, "stickied": false, "created": 1492469706.0, "created_utc": 1492440906.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdk770", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Huckies", "parent_id": "t1_dgdjk2m", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Great point, anyone who knows about Jon's parentage is an enemy of the crown. Robert alone would probably believe Ned, that his family had nothing to do with it, but with so many other noble houses with northern ambitions around the king, who knows what the fallout would be for the Starks in general? I have no doubt that Ned knows this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great point, anyone who knows about Jon&amp;#39;s parentage is an enemy of the crown. Robert alone would probably believe Ned, that his family had nothing to do with it, but with so many other noble houses with northern ambitions around the king, who knows what the fallout would be for the Starks in general? I have no doubt that Ned knows this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdk770", "score_hidden": false, "stickied": false, "created": 1492468994.0, "created_utc": 1492440194.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": "", "user_reports": [], "id": "dgdthd3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "leladypayne", "parent_id": "t1_dgdjk2m", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Yes. Ned could not bring him to KL. It would put him in too much danger being close to Robert and others who knew Rhaegar, anyone from Starfall, or anyone interested in information, like Littlefinger or Varys. And Cat would kick him out. The Night's Watch would be a hard pill for most parents to swallow, but for Jon, it's actually the safest place, and his Uncle Benjen (who is one of the only people who *might* know his true identity) is there. Another Uncle to pass the torch to. Also, he can't have kids, so he can't mysteriously pass on some recessive purple eyes or silver hair.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. Ned could not bring him to KL. It would put him in too much danger being close to Robert and others who knew Rhaegar, anyone from Starfall, or anyone interested in information, like Littlefinger or Varys. And Cat would kick him out. The Night&amp;#39;s Watch would be a hard pill for most parents to swallow, but for Jon, it&amp;#39;s actually the safest place, and his Uncle Benjen (who is one of the only people who &lt;em&gt;might&lt;/em&gt; know his true identity) is there. Another Uncle to pass the torch to. Also, he can&amp;#39;t have kids, so he can&amp;#39;t mysteriously pass on some recessive purple eyes or silver hair.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdthd3", "score_hidden": false, "stickied": false, "created": 1492479656.0, "created_utc": 1492450856.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdjk2m", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Rosebunse", "parent_id": "t1_dgdiq15", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I would argue that the Wall was far, far safer than being a Targ in Westeros, especially if Jon tried to make a claim. Then he would be risking not just his own life, but would definitely ruin the Stark name.\n\nIt would look like Ned was planning against Robert. What would Ned say against that? It would be enough for his own people to go against him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would argue that the Wall was far, far safer than being a Targ in Westeros, especially if Jon tried to make a claim. Then he would be risking not just his own life, but would definitely ruin the Stark name.&lt;/p&gt;\n\n&lt;p&gt;It would look like Ned was planning against Robert. What would Ned say against that? It would be enough for his own people to go against him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdjk2m", "score_hidden": false, "stickied": false, "created": 1492468144.0, "created_utc": 1492439344.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": "", "user_reports": [], "id": "dgdnebb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EuclideanMan", "parent_id": "t1_dgdiq15", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "\nI was about to reply but yours have every point I wanted to say", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was about to reply but yours have every point I wanted to say&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdnebb", "score_hidden": false, "stickied": false, "created": 1492472855.0, "created_utc": 1492444055.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdiq15", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Huckies", "parent_id": "t3_65vaca", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think you're looking at it through the lens of modern society. In ASOIAF true parentage is a huge deal. Huge. It is the very foundation on which everyone bases their right to rule. As it was during medieval ages. Being too close with Jon would be actively hurt the position of Ned's children at the Winterfell court. And Cat would take notice, putting their personal relationship in danger. Ned is already doing something very taboo by just keeping Jon at Winterfell and acknowleging him as his son publicly. The threat is only bigger since Jon can be argued to be older than Robb. What if godforbid, something happened to Ned and Jon went rogue? And managed to get support for his claim based on his relationship with Ned? Or maybe a sworn house went rogue and used Jon as a puppet with a claim? No, it is absolutely necessary for Ned to act in a way, that makes it clear that Jon has no claim to Winterfell whatsoever.\n\nTherefore Jon's decision to go to the Wall is a godsend for Ned. Not only is it something he actively chose himself, it also unknowingly makes him give up his rights to the Iron Throne. It protects Jon from his true parentage and by extension from Robert Baratheon. Even if the rumor spread afterwards, Jon cannot be persecuted for being Targ as a member of the Nights Watch. This Ned sees as a win-win situation. I think that in Ned's mind, there's no universe in which Jon can ascend to the Iron Throne, and any attempt would only end by his death. And having no children is for the best, since having Targ blood, Jon's children would too be in danger.\n\nWall solves everything and doesn't really have a downside. Yes, it is dangerous. But not more dangerous than being a Targ in Westeros. And even then, Jon is more capable than his peers, having been brought up at a court. Furthermore Jeor wouldn't really risk a Stark boy's life. Not until Jon is old and experienced anyway. It's for the best that Jon learns about his parentage only as a member of the Watch.\n\nNed has duty to Jon AND Lyanna both, to protect him. He is trying to balance it with his duty to his family and to his people. That takes precedence over Jon being unhappy at the Wall. And the Wall is not that bad either, right? He'll have peeers there, he'll have Benjen there. He can become someone even as a member of the Watch - Lord Commander, First Ranger, Lord Steward... He can even travel south from time to time, as Benjen does.\n\nAll things considered, not a bad solution to everything.\nOr at least I think that this is roughly Ned's reasoning.", "edited": 1492439331.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re looking at it through the lens of modern society. In ASOIAF true parentage is a huge deal. Huge. It is the very foundation on which everyone bases their right to rule. As it was during medieval ages. Being too close with Jon would be actively hurt the position of Ned&amp;#39;s children at the Winterfell court. And Cat would take notice, putting their personal relationship in danger. Ned is already doing something very taboo by just keeping Jon at Winterfell and acknowleging him as his son publicly. The threat is only bigger since Jon can be argued to be older than Robb. What if godforbid, something happened to Ned and Jon went rogue? And managed to get support for his claim based on his relationship with Ned? Or maybe a sworn house went rogue and used Jon as a puppet with a claim? No, it is absolutely necessary for Ned to act in a way, that makes it clear that Jon has no claim to Winterfell whatsoever.&lt;/p&gt;\n\n&lt;p&gt;Therefore Jon&amp;#39;s decision to go to the Wall is a godsend for Ned. Not only is it something he actively chose himself, it also unknowingly makes him give up his rights to the Iron Throne. It protects Jon from his true parentage and by extension from Robert Baratheon. Even if the rumor spread afterwards, Jon cannot be persecuted for being Targ as a member of the Nights Watch. This Ned sees as a win-win situation. I think that in Ned&amp;#39;s mind, there&amp;#39;s no universe in which Jon can ascend to the Iron Throne, and any attempt would only end by his death. And having no children is for the best, since having Targ blood, Jon&amp;#39;s children would too be in danger.&lt;/p&gt;\n\n&lt;p&gt;Wall solves everything and doesn&amp;#39;t really have a downside. Yes, it is dangerous. But not more dangerous than being a Targ in Westeros. And even then, Jon is more capable than his peers, having been brought up at a court. Furthermore Jeor wouldn&amp;#39;t really risk a Stark boy&amp;#39;s life. Not until Jon is old and experienced anyway. It&amp;#39;s for the best that Jon learns about his parentage only as a member of the Watch.&lt;/p&gt;\n\n&lt;p&gt;Ned has duty to Jon AND Lyanna both, to protect him. He is trying to balance it with his duty to his family and to his people. That takes precedence over Jon being unhappy at the Wall. And the Wall is not that bad either, right? He&amp;#39;ll have peeers there, he&amp;#39;ll have Benjen there. He can become someone even as a member of the Watch - Lord Commander, First Ranger, Lord Steward... He can even travel south from time to time, as Benjen does.&lt;/p&gt;\n\n&lt;p&gt;All things considered, not a bad solution to everything.\nOr at least I think that this is roughly Ned&amp;#39;s reasoning.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdiq15", "score_hidden": false, "stickied": false, "created": 1492467000.0, "created_utc": 1492438200.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": "", "user_reports": [], "id": "dgdk4yv", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "John_Fisticuffs", "parent_id": "t1_dgdhktd", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Also there's different ramifications to if Bran had children, then the 2nd in line to inherit Winterfell, and Jon, who had a legitimate claim then and now to the iron throne (maybe, depending on all the legalities of his birth, etc).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also there&amp;#39;s different ramifications to if Bran had children, then the 2nd in line to inherit Winterfell, and Jon, who had a legitimate claim then and now to the iron throne (maybe, depending on all the legalities of his birth, etc).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdk4yv", "score_hidden": false, "stickied": false, "created": 1492468915.0, "created_utc": 1492440115.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdhktd", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "BCBuff", "parent_id": "t3_65vaca", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think a lot of this may just stem from Ned's language choices as he *knows* Jon isn't his son, and a lot of these come from his internal monologue. He doesn't have to convince himself when he knows the truth after all.\n\nAlso, on this point :\n&gt;Ned's hella sad when he learns that Bran will never have children of his own but shruged when it was about Jon. \n\nDifferent scenarios. Jon was volunteering, Bran forcibly had that ability taken from him painfully. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think a lot of this may just stem from Ned&amp;#39;s language choices as he &lt;em&gt;knows&lt;/em&gt; Jon isn&amp;#39;t his son, and a lot of these come from his internal monologue. He doesn&amp;#39;t have to convince himself when he knows the truth after all.&lt;/p&gt;\n\n&lt;p&gt;Also, on this point :&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Ned&amp;#39;s hella sad when he learns that Bran will never have children of his own but shruged when it was about Jon. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Different scenarios. Jon was volunteering, Bran forcibly had that ability taken from him painfully. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdhktd", "score_hidden": false, "stickied": false, "created": 1492465301.0, "created_utc": 1492436501.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": "", "user_reports": [], "id": "dgdh357", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Rosebunse", "parent_id": "t1_dgdg2qz", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "It doesn't help that we only really knew Ned for one book/one season. Of course we're going to get Jon's opinion and thoughts on it more. It only makes sense. Ned, by being dead, sort of loses his agency and we're left by his idealized imagine from not just Jon, but practically everyone else.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It doesn&amp;#39;t help that we only really knew Ned for one book/one season. Of course we&amp;#39;re going to get Jon&amp;#39;s opinion and thoughts on it more. It only makes sense. Ned, by being dead, sort of loses his agency and we&amp;#39;re left by his idealized imagine from not just Jon, but practically everyone else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdh357", "score_hidden": false, "stickied": false, "created": 1492464520.0, "created_utc": 1492435720.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": "", "user_reports": [], "id": "dgdkvci", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Rosebunse", "parent_id": "t1_dgdkjs0", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "At this point, Ned has a lot of shit to deal with. Not having to worry about Cat throwing Jon out probably did help things. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At this point, Ned has a lot of shit to deal with. Not having to worry about Cat throwing Jon out probably did help things. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdkvci", "score_hidden": false, "stickied": false, "created": 1492469847.0, "created_utc": 1492441047.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkjs0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tarakristewa", "parent_id": "t1_dgdk4xn", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": " I think at first Ned wanted to confront Cat and force her to accept Jon while he was in KL, but then Maester Luwyn showed up and put the idea of Jon taking the Black inside his head, and a few moment after Ned changed his mind and accepest Luwyn's offer since \"it's for the beest\", not only the best for Jon but also for his family to ease Cat's feelings also. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think at first Ned wanted to confront Cat and force her to accept Jon while he was in KL, but then Maester Luwyn showed up and put the idea of Jon taking the Black inside his head, and a few moment after Ned changed his mind and accepest Luwyn&amp;#39;s offer since &amp;quot;it&amp;#39;s for the beest&amp;quot;, not only the best for Jon but also for his family to ease Cat&amp;#39;s feelings also. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdkjs0", "score_hidden": false, "stickied": false, "created": 1492469442.0, "created_utc": 1492440642.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdk4xn", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "CitizenMeow", "parent_id": "t1_dgdihsv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Eh I think the Wall might've been the perfect solution for what to do with Jon in AGOT and the fact that he also wanted to go made it even easier. Bed couldn't bring him to court since having his bastard there would be seen in poor taste. He wouldn't be welcome at WF with Catelyn running things, the North doesn't do knighthood so the idea of him squiring for someone isn't super good. Besides at the time Ned's own brother (who Jon felt close to) was First Ranger so Ned had every reason to think Jon would be at least somewhat taken care of.  Yes the Wall is dangerous and the wildlings were massing up, but nowhere is particularly safe in Westeros. The Wall is still seen as honorable in the North (at least in Ned's eyes) and Ned knows Jon would have the ability to rise high in the organization, likely giving him a better life in the long run. Sure things didn't go to plan, but letting him go to the Wall is far from a bad decision. Hell the book opens with a young full blooded Royce on his first mission. This guy was unquestionably a highborn son of an ancient house and his both he and his family supported the idea of him going. I don't think it has anything to do with him loving Jon less, more a case of letting Jon make his own decision and allowing him to become a man of the Nights Watch instead of a bastard child of WF. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh I think the Wall might&amp;#39;ve been the perfect solution for what to do with Jon in AGOT and the fact that he also wanted to go made it even easier. Bed couldn&amp;#39;t bring him to court since having his bastard there would be seen in poor taste. He wouldn&amp;#39;t be welcome at WF with Catelyn running things, the North doesn&amp;#39;t do knighthood so the idea of him squiring for someone isn&amp;#39;t super good. Besides at the time Ned&amp;#39;s own brother (who Jon felt close to) was First Ranger so Ned had every reason to think Jon would be at least somewhat taken care of.  Yes the Wall is dangerous and the wildlings were massing up, but nowhere is particularly safe in Westeros. The Wall is still seen as honorable in the North (at least in Ned&amp;#39;s eyes) and Ned knows Jon would have the ability to rise high in the organization, likely giving him a better life in the long run. Sure things didn&amp;#39;t go to plan, but letting him go to the Wall is far from a bad decision. Hell the book opens with a young full blooded Royce on his first mission. This guy was unquestionably a highborn son of an ancient house and his both he and his family supported the idea of him going. I don&amp;#39;t think it has anything to do with him loving Jon less, more a case of letting Jon make his own decision and allowing him to become a man of the Nights Watch instead of a bastard child of WF. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdk4xn", "score_hidden": false, "stickied": false, "created": 1492468915.0, "created_utc": 1492440115.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": "", "user_reports": [], "id": "dgdjvju", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Rosebunse", "parent_id": "t1_dgdihsv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Well, to be fair, one of those Stark boys was going to Wall. Counting Jon, Ned had four living sons, which is a pretty big number by the standards of both the show and books. It's Northern tradition for a spare Stark son to go to the Wall so as to not create conflict with the main Stark branch.\n\nHad Bran been Jon's age and in good physical condition, then Ned probably would have had to let him go or look weak. I don't think he would have let Bran go until he was a few years older, anyways.\n\nHowever, this brings up another point that Bran was supposed to go and be squired in KL at some point so as to strengthen more Southern ties. So there's that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, to be fair, one of those Stark boys was going to Wall. Counting Jon, Ned had four living sons, which is a pretty big number by the standards of both the show and books. It&amp;#39;s Northern tradition for a spare Stark son to go to the Wall so as to not create conflict with the main Stark branch.&lt;/p&gt;\n\n&lt;p&gt;Had Bran been Jon&amp;#39;s age and in good physical condition, then Ned probably would have had to let him go or look weak. I don&amp;#39;t think he would have let Bran go until he was a few years older, anyways.&lt;/p&gt;\n\n&lt;p&gt;However, this brings up another point that Bran was supposed to go and be squired in KL at some point so as to strengthen more Southern ties. So there&amp;#39;s that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdjvju", "score_hidden": false, "stickied": false, "created": 1492468574.0, "created_utc": 1492439774.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdihsv", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Tarakristewa", "parent_id": "t1_dgdg2qz", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 1, "body": "The fact he let Jon going at the Wall while knowing the danger he had to face there baffles me a bit, because he was aware of the wildling threat. He sounds more like someone who doesn't want to argue with his woman and let things happen. On the other hand, I put myself in his shoes. It's normal to love your own kids more than your nephew. Besides he lies to his wife, humiliated her every single day, he lied to his bestfriend, put his family in danger. He sees the promise he made to Lyanna as a \"curse\" in his own words and in his cell he's bitter at the sacrifices he had to make to keep Lyanna's promise. I doubt he was angry against Lyanna or Jon but I get, he wanted to be free from something that killed him inside for 14 years. Would he have reacted the same way if Bran had decided to take the Wall? I don't think so", "edited": 1492441988.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The fact he let Jon going at the Wall while knowing the danger he had to face there baffles me a bit, because he was aware of the wildling threat. He sounds more like someone who doesn&amp;#39;t want to argue with his woman and let things happen. On the other hand, I put myself in his shoes. It&amp;#39;s normal to love your own kids more than your nephew. Besides he lies to his wife, humiliated her every single day, he lied to his bestfriend, put his family in danger. He sees the promise he made to Lyanna as a &amp;quot;curse&amp;quot; in his own words and in his cell he&amp;#39;s bitter at the sacrifices he had to make to keep Lyanna&amp;#39;s promise. I doubt he was angry against Lyanna or Jon but I get, he wanted to be free from something that killed him inside for 14 years. Would he have reacted the same way if Bran had decided to take the Wall? I don&amp;#39;t think so&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdihsv", "score_hidden": false, "stickied": false, "created": 1492466677.0, "created_utc": 1492437877.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdg2qz", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "aje12", "parent_id": "t3_65vaca", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think it's clear that Ned loves his own children more than Jon, particularly in AGOT when he specifically thinks whether he would hurt an innocent child he did not know to protect rickon, bran, arya Sansa and rickon (noticeably excluding Jon). This is understandable particularly in a society where bloodline is so emphasised, as well as the sacrifices Ned had to make for Jon. \n\nBut I still think Ned loves Jon, yes for Lyannas sake, but for Jons too. He did after all raise him from a baby. But yes I agree that people overemphasise their closeness, probably because Jon respects him so much/ their similarities ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s clear that Ned loves his own children more than Jon, particularly in AGOT when he specifically thinks whether he would hurt an innocent child he did not know to protect rickon, bran, arya Sansa and rickon (noticeably excluding Jon). This is understandable particularly in a society where bloodline is so emphasised, as well as the sacrifices Ned had to make for Jon. &lt;/p&gt;\n\n&lt;p&gt;But I still think Ned loves Jon, yes for Lyannas sake, but for Jons too. He did after all raise him from a baby. But yes I agree that people overemphasise their closeness, probably because Jon respects him so much/ their similarities &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdg2qz", "score_hidden": false, "stickied": false, "created": 1492462833.0, "created_utc": 1492434033.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": "", "user_reports": [], "id": "dgdfm7j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Tarakristewa", "parent_id": "t1_dgdfg9v", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Indeed, I didn't express myself correctly. I meant, indidually he never refers to Jon as his son. ", "edited": 1492433455.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Indeed, I didn&amp;#39;t express myself correctly. I meant, indidually he never refers to Jon as his son. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdfm7j", "score_hidden": false, "stickied": false, "created": 1492462006.0, "created_utc": 1492433206.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": "", "user_reports": [], "id": "dgdfvg6", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Rosebunse", "parent_id": "t1_dgdfg9v", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "To be fair, I think Ned, like most dads who have tons of kids, lumps them all together to save time, especially when they're in trouble or doing something stupid.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To be fair, I think Ned, like most dads who have tons of kids, lumps them all together to save time, especially when they&amp;#39;re in trouble or doing something stupid.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdfvg6", "score_hidden": false, "stickied": false, "created": 1492462477.0, "created_utc": 1492433677.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfg9v", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "GrichkaBogdanoff", "parent_id": "t3_65vaca", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "&gt;Ned NEVER refers to Jon as his son\n\nNot completely true\n\n&gt;\"Beyond a doubt,\" his lord father said. \"Come, let us see what mischief my sons have rooted out now.\"\n\nI feel like a lot of this can just be attributed to Ned not being a very emotionally expressive guy, but with the comparisons to the rest of his family you've made here I think you have a point. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Ned NEVER refers to Jon as his son&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not completely true&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Beyond a doubt,&amp;quot; his lord father said. &amp;quot;Come, let us see what mischief my sons have rooted out now.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I feel like a lot of this can just be attributed to Ned not being a very emotionally expressive guy, but with the comparisons to the rest of his family you&amp;#39;ve made here I think you have a point. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdfg9v", "score_hidden": false, "stickied": false, "created": 1492461689.0, "created_utc": 1492432889.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": "", "user_reports": [], "id": "dgdtx7w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Hatak459", "parent_id": "t1_dgdteuq", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I'm getting incredibly nitpicky here but just because there's a reminder of a bad day does not make that bad day his worst day.  In the same vein then, every day that he wakes up and remembers that he is the Lord of Winterfell is a reminder of the day when his father and brother were murdered and he went to war.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m getting incredibly nitpicky here but just because there&amp;#39;s a reminder of a bad day does not make that bad day his worst day.  In the same vein then, every day that he wakes up and remembers that he is the Lord of Winterfell is a reminder of the day when his father and brother were murdered and he went to war.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdtx7w", "score_hidden": false, "stickied": false, "created": 1492480143.0, "created_utc": 1492451343.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdteuq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jdix", "parent_id": "t1_dgdm5fu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "It's his worse day because it lives on through Jon. He is a product of that day, and a reminder.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s his worse day because it lives on through Jon. He is a product of that day, and a reminder.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdteuq", "score_hidden": false, "stickied": false, "created": 1492479580.0, "created_utc": 1492450780.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": "", "user_reports": [], "id": "dge71q9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rosebunse", "parent_id": "t1_dgdm5fu", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "And now he gets to raise Aerys's grandson! Fun!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And now he gets to raise Aerys&amp;#39;s grandson! Fun!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dge71q9", "score_hidden": true, "stickied": false, "created": 1492495152.0, "created_utc": 1492466352.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdm5fu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Hatak459", "parent_id": "t1_dgdkozt", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Are you sure that was the worst day of his life though?  Ned had plenty of really bad days.  I'd almost argue that the worst day of his life was the day that both his father and brother were murdered by the king in an especially brutal fashion and he had to start gathering his banners for war.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you sure that was the worst day of his life though?  Ned had plenty of really bad days.  I&amp;#39;d almost argue that the worst day of his life was the day that both his father and brother were murdered by the king in an especially brutal fashion and he had to start gathering his banners for war.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdm5fu", "score_hidden": false, "stickied": false, "created": 1492471412.0, "created_utc": 1492442612.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkozt", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Rosebunse", "parent_id": "t1_dgdkiip", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "And plus, again, Jon is a constant reminder of the worst day of Ned's life. Yet unlike many guys in the real world and in fiction, Ned never seems to let that get in the way. Jon is fed well, clothed well, educated, allowed to play with the other kids, is taken on certain important errands, and is generally a part of the household.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And plus, again, Jon is a constant reminder of the worst day of Ned&amp;#39;s life. Yet unlike many guys in the real world and in fiction, Ned never seems to let that get in the way. Jon is fed well, clothed well, educated, allowed to play with the other kids, is taken on certain important errands, and is generally a part of the household.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdkozt", "score_hidden": false, "stickied": false, "created": 1492469627.0, "created_utc": 1492440827.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkiip", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "thefalcons5912", "parent_id": "t1_dgdfsvv", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "\nExcellent comment. Agree almost completely. I still think Ned did hold love for Jon similar to that of a son. I try to imagine how I would feel raising an orphaned nephew of mine. Would it be the exact same as a son? Probably not. Would it be significant? Absolutely. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Excellent comment. Agree almost completely. I still think Ned did hold love for Jon similar to that of a son. I try to imagine how I would feel raising an orphaned nephew of mine. Would it be the exact same as a son? Probably not. Would it be significant? Absolutely. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdkiip", "score_hidden": false, "stickied": false, "created": 1492469399.0, "created_utc": 1492440599.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfsvv", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Rosebunse", "parent_id": "t3_65vaca", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "I think it only makes sense that Ned probably did have a more distant relationship with Jon than we like to admit. Jon would be a constant reminder of the worst day of his life. With that in mind, it sort if makes Ned a better man by seemingly at least trying to be a good parent to Jon.\n\nIt should also be noted that part of the problem here is that GRRM was working with a different set of tools for R+L=J. He was trying to place clues here and there. Ned never referring to Jon as his son was for many people one of the big major clues.\n\nAnother thing to point out is that it would appear that both GRRM and D&amp;D agree with you on Jeor. Jeor, Qhorin, Mance, Stannis and Aemon, to a lesser extent, are meant to be sort of \"father\" figures to Jon. They each reveal a different aspect of leadership and what being a \"man\" is to Jon. They don't sugarcoat the situation, or lie outright to Jon.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it only makes sense that Ned probably did have a more distant relationship with Jon than we like to admit. Jon would be a constant reminder of the worst day of his life. With that in mind, it sort if makes Ned a better man by seemingly at least trying to be a good parent to Jon.&lt;/p&gt;\n\n&lt;p&gt;It should also be noted that part of the problem here is that GRRM was working with a different set of tools for R+L=J. He was trying to place clues here and there. Ned never referring to Jon as his son was for many people one of the big major clues.&lt;/p&gt;\n\n&lt;p&gt;Another thing to point out is that it would appear that both GRRM and D&amp;amp;D agree with you on Jeor. Jeor, Qhorin, Mance, Stannis and Aemon, to a lesser extent, are meant to be sort of &amp;quot;father&amp;quot; figures to Jon. They each reveal a different aspect of leadership and what being a &amp;quot;man&amp;quot; is to Jon. They don&amp;#39;t sugarcoat the situation, or lie outright to Jon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dgdfsvv", "score_hidden": false, "stickied": false, "created": 1492462349.0, "created_utc": 1492433549.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r2o9", "removal_reason": null, "link_id": "t3_65vaca", "likes": null, "replies": "", "user_reports": [], "id": "dge83bh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rosebunse", "parent_id": "t1_dge5p3p", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "Ned has to lie about everything to everyone, his relationship to his wife is strained, his baby sister is dead and dead because she ran away with a guy who sorted of started a war over it...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ned has to lie about everything to everyone, his relationship to his wife is strained, his baby sister is dead and dead because she ran away with a guy who sorted of started a war over it...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dge83bh", "score_hidden": true, "stickied": false, "created": 1492496464.0, "created_utc": 1492467664.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge5p3p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dejota85", "parent_id": "t3_65vaca", "subreddit_name_prefixed": "r/asoiaf", "controversiality": 0, "body": "His general attitude and approach to Jon never sat well with me.  Specifically because if he's his Nephew his actions satisfy honor and morale requirements...he shouldn't feel guilty about Jon and how it impacted the Starks as honor always trumps perception.\n\nSo if R+L=J and that's the whole ToJ story I'll be dumbfounded.  Ned needs motivations to feel so uncomfortable about Jon but GRRM hasn't provided them yet in my opinion.  Maybe I just view honor differently fwiw.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;His general attitude and approach to Jon never sat well with me.  Specifically because if he&amp;#39;s his Nephew his actions satisfy honor and morale requirements...he shouldn&amp;#39;t feel guilty about Jon and how it impacted the Starks as honor always trumps perception.&lt;/p&gt;\n\n&lt;p&gt;So if R+L=J and that&amp;#39;s the whole ToJ story I&amp;#39;ll be dumbfounded.  Ned needs motivations to feel so uncomfortable about Jon but GRRM hasn&amp;#39;t provided them yet in my opinion.  Maybe I just view honor differently fwiw.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "asoiaf", "name": "t1_dge5p3p", "score_hidden": true, "stickied": false, "created": 1492493477.0, "created_utc": 1492464677.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]