[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The entirety of my life from 16-25 has been focused on business. Between many years of self-education on business and now having started one, it&amp;#39;s been pretty much all I&amp;#39;ve done with my time. &lt;/p&gt;\n\n&lt;p&gt;Lately I&amp;#39;ve been transitioning from on-site management to more long-term building, which allows me to have flexibility. With that I&amp;#39;ve started to get back into pursuing women - it has been a long time (years). Figured I would share some observations, since I used to be good at this and am now rebuilding.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;AB Testing: Observations and Improvement&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I mentioned to another redditor on here about AB Testing. It&amp;#39;s a term typically used in computer science for trying out two things (website designs) and figuring out which works better. The more iterations of this you do over time, you&amp;#39;ll end up with a more effective result than from where you started. And you learn through a combination of observations and failure.&lt;/p&gt;\n\n&lt;p&gt;As a process, it&amp;#39;s very good at eliminating any bias you might have. Rather than take outside influence/suggestion, you can sort of structure yourself toward more effective outcomes. As this relates to women, &amp;quot;you&amp;quot; and &amp;quot;your personality&amp;quot; are no longer set in concrete, but rather a fluid process that needs continual improvement.&lt;/p&gt;\n\n&lt;p&gt;AB Testing is how I got good with women the first time. I forced myself into uncomfortable settings/discussions with women and learned over time.  In high school you&amp;#39;re around girls your age constantly and so it&amp;#39;s an easier time to do it. But it just as easily works with Day Game.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Applied to Day Game&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I saw a TRP field report post today about someone coming back to Day Game after an extended absence. His post seemed to be lacking in a core process (although he had some observations on how he might improve on each approach), even if it more than made up for it with effort. 9 approach attempts in a day is an impressive outing, no matter what the end result.&lt;/p&gt;\n\n&lt;p&gt;My approach to Day Game is a lot simpler. It also requires very little incremental time commitment.&lt;/p&gt;\n\n&lt;p&gt;If you take a hard look at your daily lifestyle, chances are you drink a coffee and eat a meal away from home. Each and every one of these forced interactions is a chance for you to interact with other human beings. This is important for me, because again - business has consumed me for the entirety of my adult life.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Before you roll your eyes and assume you know where I&amp;#39;m going with this, know there is a lesson here for everyone.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Every single person you interact with is a chance to try something out. Bemoaning the lack of a classroom setting - or campus - to be around peers is a waste of breath. You can interact with adults, regardless of gender, and still accomplish daily goals (coffee, laundry, etc.). I will reiterate - it&amp;#39;s perfectly okay to try out meeting strangers who are guys, girls that aren&amp;#39;t your type, or people 1-2 generations different from your own.&lt;/p&gt;\n\n&lt;p&gt;Yes, these people are forced to talk to you - in that sense they have a barrier you must overcome to actually talk to &lt;em&gt;them&lt;/em&gt; rather than the employee they are supposed to represent (similar to the initial hurdle you have to overcome when meeting women). Equally important, you can get immediate, valuable feedback on various small approaches that succeed/fail. And even if you work 100 hours/week on something very closed off to the rest of the world, those coffee &amp;amp; food breaks can give you more AB Testing than someone on autopilot in a college town.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What I&amp;#39;ve Learned&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The easy approach would be to try talking to every employee in sight. As you progress into more of a comfort zone, you can start with AB Testing. And then when you&amp;#39;re getting positive reception from most strangers you interact with, start pushing boundaries. Talk to others in line, play with your volume (get louder), and start to have fun with it. If you didn&amp;#39;t start out looking forward to these small interactions, they will quickly grow on you. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Being interesting&lt;/strong&gt; is not something you turn on/off when women are around. That not only puts a lot of pressure on you when the game is on, but it makes for really choppy delivery of an otherwise high quality person. If you can make yourself interesting to a 35-year old miserable pizza maker at a local hole in the wall, you&amp;#39;re going to be able to impress girls. Maybe not universally, but you&amp;#39;ll be much further towards that goal. And if nothing else, extra effort put into enjoying every moment in your life can hardly be considered a waste of your time/energy.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Energy exchange&lt;/strong&gt; is perhaps the most important thing you can work on - this is why AB Testing matters. There is very little good literature that I know of, but I&amp;#39;ve been fortunate to learn from people in real life. It&amp;#39;s really hard to nail this down but if you can imagine people you&amp;#39;ve talked to who generally just &lt;em&gt;suck&lt;/em&gt; - negative, downbeat, low energy, non-responsive, self-absorbed in their own misery, etc - then you&amp;#39;ll know that the opposite of this is the beginning of your quest.&lt;/p&gt;\n\n&lt;p&gt;Everyone has some general level of energy in them and some are better when they get &amp;quot;woken up&amp;quot; by others. If you can feel your way around others&amp;#39; energy (yes I know this sounds strange but I promise it&amp;#39;s quite easy once it&amp;#39;s a focus), then you can tailor yourself accordingly. It&amp;#39;s a sort of real-time empathetic response that allows you to adjust to what you see in front of you. Applied properly, energy exchange leads to connections on a much deeper level more or less immediately.&lt;/p&gt;\n\n&lt;p&gt;Expanding on energy exchange a little more, I&amp;#39;ve met girls who started with &amp;#39;bitch shield&amp;#39; only to be fully disarmed within 30 seconds - to the point where they were leaning against the nearest fixture in the store/countertop/etc, and comfortably talking to me like I was a long lost friend/relative they hadn&amp;#39;t seen in years. And it&amp;#39;s not a familiarity that you&amp;#39;d get with the friend zone - you can maintain masculine polarity + sexual dominance throughout. The two aren&amp;#39;t necessarily connected.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;End Results&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;There are now 6 locations where nearly every employee knows me well. That&amp;#39;s close to 100 people- leading to a sort of social proof amongst strangers. And each location is the sum of 3 minute interactions where I was in and out. There really is no reason to be so closed off to the world.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Be Interesting - you have no excuse not to be, all the time. It&amp;#39;s not an on/off switch, women can tell.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Work on Energy Exchange - Yoga/meditation, empathy, and perception played a large part for me&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;You have no excuse - 5, maybe 10 minutes as part of your normal routine already; just be more awake&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;AB Testing is a great way to build yourself into something more&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The entirety of my life from 16-25 has been focused on business. Between many years of self-education on business and now having started one, it's been pretty much all I've done with my time. \n\nLately I've been transitioning from on-site management to more long-term building, which allows me to have flexibility. With that I've started to get back into pursuing women - it has been a long time (years). Figured I would share some observations, since I used to be good at this and am now rebuilding.\n\n**AB Testing: Observations and Improvement**\n\nI mentioned to another redditor on here about AB Testing. It's a term typically used in computer science for trying out two things (website designs) and figuring out which works better. The more iterations of this you do over time, you'll end up with a more effective result than from where you started. And you learn through a combination of observations and failure.\n\nAs a process, it's very good at eliminating any bias you might have. Rather than take outside influence/suggestion, you can sort of structure yourself toward more effective outcomes. As this relates to women, \"you\" and \"your personality\" are no longer set in concrete, but rather a fluid process that needs continual improvement.\n\nAB Testing is how I got good with women the first time. I forced myself into uncomfortable settings/discussions with women and learned over time.  In high school you're around girls your age constantly and so it's an easier time to do it. But it just as easily works with Day Game.\n\n**Applied to Day Game**\n\nI saw a TRP field report post today about someone coming back to Day Game after an extended absence. His post seemed to be lacking in a core process (although he had some observations on how he might improve on each approach), even if it more than made up for it with effort. 9 approach attempts in a day is an impressive outing, no matter what the end result.\n\nMy approach to Day Game is a lot simpler. It also requires very little incremental time commitment.\n\nIf you take a hard look at your daily lifestyle, chances are you drink a coffee and eat a meal away from home. Each and every one of these forced interactions is a chance for you to interact with other human beings. This is important for me, because again - business has consumed me for the entirety of my adult life.\n\n*Before you roll your eyes and assume you know where I'm going with this, know there is a lesson here for everyone.*\n\nEvery single person you interact with is a chance to try something out. Bemoaning the lack of a classroom setting - or campus - to be around peers is a waste of breath. You can interact with adults, regardless of gender, and still accomplish daily goals (coffee, laundry, etc.). I will reiterate - it's perfectly okay to try out meeting strangers who are guys, girls that aren't your type, or people 1-2 generations different from your own.\n\nYes, these people are forced to talk to you - in that sense they have a barrier you must overcome to actually talk to *them* rather than the employee they are supposed to represent (similar to the initial hurdle you have to overcome when meeting women). Equally important, you can get immediate, valuable feedback on various small approaches that succeed/fail. And even if you work 100 hours/week on something very closed off to the rest of the world, those coffee &amp; food breaks can give you more AB Testing than someone on autopilot in a college town.\n\n**What I've Learned**\n\nThe easy approach would be to try talking to every employee in sight. As you progress into more of a comfort zone, you can start with AB Testing. And then when you're getting positive reception from most strangers you interact with, start pushing boundaries. Talk to others in line, play with your volume (get louder), and start to have fun with it. If you didn't start out looking forward to these small interactions, they will quickly grow on you. \n\n**Being interesting** is not something you turn on/off when women are around. That not only puts a lot of pressure on you when the game is on, but it makes for really choppy delivery of an otherwise high quality person. If you can make yourself interesting to a 35-year old miserable pizza maker at a local hole in the wall, you're going to be able to impress girls. Maybe not universally, but you'll be much further towards that goal. And if nothing else, extra effort put into enjoying every moment in your life can hardly be considered a waste of your time/energy.\n\n**Energy exchange** is perhaps the most important thing you can work on - this is why AB Testing matters. There is very little good literature that I know of, but I've been fortunate to learn from people in real life. It's really hard to nail this down but if you can imagine people you've talked to who generally just *suck* - negative, downbeat, low energy, non-responsive, self-absorbed in their own misery, etc - then you'll know that the opposite of this is the beginning of your quest.\n\nEveryone has some general level of energy in them and some are better when they get \"woken up\" by others. If you can feel your way around others' energy (yes I know this sounds strange but I promise it's quite easy once it's a focus), then you can tailor yourself accordingly. It's a sort of real-time empathetic response that allows you to adjust to what you see in front of you. Applied properly, energy exchange leads to connections on a much deeper level more or less immediately.\n\nExpanding on energy exchange a little more, I've met girls who started with 'bitch shield' only to be fully disarmed within 30 seconds - to the point where they were leaning against the nearest fixture in the store/countertop/etc, and comfortably talking to me like I was a long lost friend/relative they hadn't seen in years. And it's not a familiarity that you'd get with the friend zone - you can maintain masculine polarity + sexual dominance throughout. The two aren't necessarily connected.\n\n**End Results**\n\nThere are now 6 locations where nearly every employee knows me well. That's close to 100 people- leading to a sort of social proof amongst strangers. And each location is the sum of 3 minute interactions where I was in and out. There really is no reason to be so closed off to the world.\n\n* Be Interesting - you have no excuse not to be, all the time. It's not an on/off switch, women can tell.\n\n* Work on Energy Exchange - Yoga/meditation, empathy, and perception played a large part for me\n\n* You have no excuse - 5, maybe 10 minutes as part of your normal routine already; just be more awake\n\n* AB Testing is a great way to build yourself into something more\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Red Pill Theory", "id": "64nj35", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 25, "report_reasons": null, "author": "F0rever_Fascinated", "saved": false, "mod_reports": [], "name": "t3_64nj35", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": 1491876715.0, "link_flair_css_class": "theory", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheRedPill/comments/64nj35/day_game_focusing_on_process/", "num_reports": null, "locked": false, "stickied": false, "created": 1491899327.0, "url": "https://www.reddit.com/r/TheRedPill/comments/64nj35/day_game_focusing_on_process/", "author_flair_text": null, "quarantine": false, "title": "Day Game: Focusing on Process", "created_utc": 1491870527.0, "distinguished": null, "media": null, "upvote_ratio": 0.79, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64nj35", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64nj35", "likes": null, "replies": "", "user_reports": [], "id": "dge5y80", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AskYouEverything", "parent_id": "t1_dg4gb8b", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I prefer to make other people try to come off as interesting to me. Putting on a 'performance' is a weak frame. The strong don't have to", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I prefer to make other people try to come off as interesting to me. Putting on a &amp;#39;performance&amp;#39; is a weak frame. The strong don&amp;#39;t have to&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dge5y80", "score_hidden": false, "stickied": false, "created": 1492493786.0, "created_utc": 1492464986.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4gb8b", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Tralph52", "parent_id": "t3_64nj35", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The point about being interesting all the time, to everyone, and not just specifically turning it on around women rang true for me. As well as taking the pressure of performance anxiety off, it will increase your SMV", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The point about being interesting all the time, to everyone, and not just specifically turning it on around women rang true for me. As well as taking the pressure of performance anxiety off, it will increase your SMV&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg4gb8b", "score_hidden": false, "stickied": false, "created": 1491954977.0, "created_utc": 1491926177.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64nj35", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64nj35", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64nj35", "likes": null, "replies": "", "user_reports": [], "id": "dg5fdbn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "yunhaila", "parent_id": "t1_dg5e0ft", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Most of this is better explored through practice. Although discussion does prompt new ideas to try. I want to try varying my energy levels first. I'm going to do a few where I'm really really low energy and a few where I'm way to hyper and gauge how it goes. Then I'll slowly tone it down to the middle ground. Sounds like a fun experiment. \n\nThe next thing is I want to try direct and engaged vs. direct but aloof vs. direct and out of the bat touching vs. indirect vs. indirect but obvious intent vs. indirect with jokes. \n\nAfter that I will try telling a story, just silence, telling her my intention and just letting her pursue, and more. There's so much to try. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most of this is better explored through practice. Although discussion does prompt new ideas to try. I want to try varying my energy levels first. I&amp;#39;m going to do a few where I&amp;#39;m really really low energy and a few where I&amp;#39;m way to hyper and gauge how it goes. Then I&amp;#39;ll slowly tone it down to the middle ground. Sounds like a fun experiment. &lt;/p&gt;\n\n&lt;p&gt;The next thing is I want to try direct and engaged vs. direct but aloof vs. direct and out of the bat touching vs. indirect vs. indirect but obvious intent vs. indirect with jokes. &lt;/p&gt;\n\n&lt;p&gt;After that I will try telling a story, just silence, telling her my intention and just letting her pursue, and more. There&amp;#39;s so much to try. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg5fdbn", "score_hidden": false, "stickied": false, "created": 1491997549.0, "created_utc": 1491968749.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64nj35", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64nj35", "likes": null, "replies": "", "user_reports": [], "id": "dg74au7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "F0rever_Fascinated", "parent_id": "t1_dg725aa", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "My library game is where I do really well - those types of settings where you might sit in a public place to get work done. Here are 2 examples:\n\n**Starbucks**: 2 tables available, both are taken. It's 830PM. I take my coffee and ask to sit at the other end of the table - which is somewhat close quarters but not overly aggressive. Make a stupid intentionally self deprecating joke about needing a lot of space, and if she could please keep the noise down. And then just get to work with headphones in. After 10-15 minutes (keep in mind I'm actually there to work regardless), ask her to watch your stuff and go to the bathroom. When you come to sit back down, casually start a conversation with her - sarcastically ask what's she wasting her time on today? Talked for 20-30 minutes, flirt, completely ignored my work and she did with hers. I invited her to come check out the healthcare clinic I started - told her I never get a chance to show someone what I do. She agreed and drove separately - just 1 mile away. Walked her through all the shit we've built, stuff I've worked on. It was probably 9-10pm at this point. And then leaned in and we started hooking up. Had met her 1 hour previously.\n\n**Actual Library**: Found a similarly large table that had a girl at it, went up and did pretty much the exact same thing I describe above. We talked on and off for maybe 1-1.5 hours, but I tried not to show a ton of interest. Then her friends started showing up. At some point, there's 3 girls - all very good looking - sitting at the same table as me. A fourth shows up and asks who I am - I haven't tried engaging with the group a ton until now, but this drew me into their conversation for a little while. I ended up getting the first girl's number and we got coffee a few days later for the first date.This story isn't about being perfect at day game (this was back in college when I started working on it a lot), but I was at least putting myself out there and not always in a hurry. Not saying it's the best approach, but I was outcome independent and more just focused on process.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My library game is where I do really well - those types of settings where you might sit in a public place to get work done. Here are 2 examples:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Starbucks&lt;/strong&gt;: 2 tables available, both are taken. It&amp;#39;s 830PM. I take my coffee and ask to sit at the other end of the table - which is somewhat close quarters but not overly aggressive. Make a stupid intentionally self deprecating joke about needing a lot of space, and if she could please keep the noise down. And then just get to work with headphones in. After 10-15 minutes (keep in mind I&amp;#39;m actually there to work regardless), ask her to watch your stuff and go to the bathroom. When you come to sit back down, casually start a conversation with her - sarcastically ask what&amp;#39;s she wasting her time on today? Talked for 20-30 minutes, flirt, completely ignored my work and she did with hers. I invited her to come check out the healthcare clinic I started - told her I never get a chance to show someone what I do. She agreed and drove separately - just 1 mile away. Walked her through all the shit we&amp;#39;ve built, stuff I&amp;#39;ve worked on. It was probably 9-10pm at this point. And then leaned in and we started hooking up. Had met her 1 hour previously.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Actual Library&lt;/strong&gt;: Found a similarly large table that had a girl at it, went up and did pretty much the exact same thing I describe above. We talked on and off for maybe 1-1.5 hours, but I tried not to show a ton of interest. Then her friends started showing up. At some point, there&amp;#39;s 3 girls - all very good looking - sitting at the same table as me. A fourth shows up and asks who I am - I haven&amp;#39;t tried engaging with the group a ton until now, but this drew me into their conversation for a little while. I ended up getting the first girl&amp;#39;s number and we got coffee a few days later for the first date.This story isn&amp;#39;t about being perfect at day game (this was back in college when I started working on it a lot), but I was at least putting myself out there and not always in a hurry. Not saying it&amp;#39;s the best approach, but I was outcome independent and more just focused on process.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg74au7", "score_hidden": false, "stickied": false, "created": 1492085193.0, "created_utc": 1492056393.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg725aa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yunhaila", "parent_id": "t1_dg5e0ft", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Also, if you could share real examples of one or two of your conversations that led to success, it would give your post much more weight. Assuming you did actually get some success with your strategy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, if you could share real examples of one or two of your conversations that led to success, it would give your post much more weight. Assuming you did actually get some success with your strategy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg725aa", "score_hidden": false, "stickied": false, "created": 1492082054.0, "created_utc": 1492053254.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5e0ft", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "F0rever_Fascinated", "parent_id": "t1_dg4oyjd", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This isn't the scientific method, as far as precision goes. You don't need 50 failures to know that some things aren't a good idea to do. **Example:** You open with 4 different employees at various cash registers by talking about the weather. 0 for 4? You don't need to keep digging - just stop talking about the damn weather. **Be interesting.** And you want to be interesting immediately. Nothing over the top but don't expect to engage only at the tail end of your conversation. You really just want to seem like someone who talks to everyone around them (even if this isn't true) for the hell of it, not that you want something from them.\n\nOpener topics make it easier to continue a conversation, but not as much as you might think. Noticing something odd/slightly subtle about a person and talking about that. Visible tattoos are good if you have a reason to comment, as are lame components to someone's uniform. Blurting out about a recent funny story in your life can work too - you just have to make it interesting to the listener and you'll get better at it over time. Maybe even jokingly ask if they stand by how hard they worked on making the coffee, or food, etc.\n\nIt also gets easier with time. If you're somewhat of a regular at a retail outlet of some kind (1x per week) then people will remember you and it's now easier to meet other employees.\n\nYou want to avoid conversations that feel *manufactured*, rather than authentic. If you want to know the feeling of a *manufactured* conversation, all you need to do is walk up to a girl and say one of those lame intro's -something to the effect of \"Hey can I bother you for a minute? I need help with something.\" She will immediately feel like she's being sold something she doesn't want to buy and shut you down. But the more you can navigate by feel, the more you're speaking her language. You just have to have a small amount of courage to break the ice. And a lot of conversations can just start by asking about something for sale/on the menu and starting to joke around from there.\n\nThere's literature on TRP discussing bringing others into your universe. Let them participate in a story or a joke. I've found that making fun of things, even without looking for a reaction, helps a lot. Humor/sarcasm helps when a girl is interested in talking to you again - since you've already talked to her in the past - but you joke with her coworkers loudly instead.\n\nCurious to experiment with your own energy (output)? Try throwing a lot more energy into your interactions. Vary the pitch in your voice, adjust volume, focus on your body posture, keep a healthy amount of eye contact, and try to be engaging. Each one of these should be part of your complete focus in the moment as you search for positive connection with the person across from you.\n\nAs for feeling out the energy in the other person? Focus on their output. The amount of energy in someone's voice is the most obvious way to tell - do they sound like they're forced to be there? Are they abnormally excited for someone this early in the morning? You want to play off of the energy of others, but still be a source of it yourself. Try waking them up to see what they might be like if they weren't otherwise forced to make you a burrito at chipotle. I'd argue this is more important than the conversation itself, although it's hard to explain through concise writing. Some of this is just better explored through practice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t the scientific method, as far as precision goes. You don&amp;#39;t need 50 failures to know that some things aren&amp;#39;t a good idea to do. &lt;strong&gt;Example:&lt;/strong&gt; You open with 4 different employees at various cash registers by talking about the weather. 0 for 4? You don&amp;#39;t need to keep digging - just stop talking about the damn weather. &lt;strong&gt;Be interesting.&lt;/strong&gt; And you want to be interesting immediately. Nothing over the top but don&amp;#39;t expect to engage only at the tail end of your conversation. You really just want to seem like someone who talks to everyone around them (even if this isn&amp;#39;t true) for the hell of it, not that you want something from them.&lt;/p&gt;\n\n&lt;p&gt;Opener topics make it easier to continue a conversation, but not as much as you might think. Noticing something odd/slightly subtle about a person and talking about that. Visible tattoos are good if you have a reason to comment, as are lame components to someone&amp;#39;s uniform. Blurting out about a recent funny story in your life can work too - you just have to make it interesting to the listener and you&amp;#39;ll get better at it over time. Maybe even jokingly ask if they stand by how hard they worked on making the coffee, or food, etc.&lt;/p&gt;\n\n&lt;p&gt;It also gets easier with time. If you&amp;#39;re somewhat of a regular at a retail outlet of some kind (1x per week) then people will remember you and it&amp;#39;s now easier to meet other employees.&lt;/p&gt;\n\n&lt;p&gt;You want to avoid conversations that feel &lt;em&gt;manufactured&lt;/em&gt;, rather than authentic. If you want to know the feeling of a &lt;em&gt;manufactured&lt;/em&gt; conversation, all you need to do is walk up to a girl and say one of those lame intro&amp;#39;s -something to the effect of &amp;quot;Hey can I bother you for a minute? I need help with something.&amp;quot; She will immediately feel like she&amp;#39;s being sold something she doesn&amp;#39;t want to buy and shut you down. But the more you can navigate by feel, the more you&amp;#39;re speaking her language. You just have to have a small amount of courage to break the ice. And a lot of conversations can just start by asking about something for sale/on the menu and starting to joke around from there.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s literature on TRP discussing bringing others into your universe. Let them participate in a story or a joke. I&amp;#39;ve found that making fun of things, even without looking for a reaction, helps a lot. Humor/sarcasm helps when a girl is interested in talking to you again - since you&amp;#39;ve already talked to her in the past - but you joke with her coworkers loudly instead.&lt;/p&gt;\n\n&lt;p&gt;Curious to experiment with your own energy (output)? Try throwing a lot more energy into your interactions. Vary the pitch in your voice, adjust volume, focus on your body posture, keep a healthy amount of eye contact, and try to be engaging. Each one of these should be part of your complete focus in the moment as you search for positive connection with the person across from you.&lt;/p&gt;\n\n&lt;p&gt;As for feeling out the energy in the other person? Focus on their output. The amount of energy in someone&amp;#39;s voice is the most obvious way to tell - do they sound like they&amp;#39;re forced to be there? Are they abnormally excited for someone this early in the morning? You want to play off of the energy of others, but still be a source of it yourself. Try waking them up to see what they might be like if they weren&amp;#39;t otherwise forced to make you a burrito at chipotle. I&amp;#39;d argue this is more important than the conversation itself, although it&amp;#39;s hard to explain through concise writing. Some of this is just better explored through practice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg5e0ft", "score_hidden": false, "stickied": false, "created": 1491995488.0, "created_utc": 1491966688.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64nj35", "likes": null, "replies": "", "user_reports": [], "id": "dg771p6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "epistemic_humility", "parent_id": "t1_dg4oyjd", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "If you lack that interesting element.\n\nRead more. If you don't dig reading then practice by reading until you do. \n\nPodcasts. Rogan, art of manliness, Bill burr, beige Phillip show and more. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you lack that interesting element.&lt;/p&gt;\n\n&lt;p&gt;Read more. If you don&amp;#39;t dig reading then practice by reading until you do. &lt;/p&gt;\n\n&lt;p&gt;Podcasts. Rogan, art of manliness, Bill burr, beige Phillip show and more. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg771p6", "score_hidden": false, "stickied": false, "created": 1492089794.0, "created_utc": 1492060994.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4oyjd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "yunhaila", "parent_id": "t3_64nj35", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Hi. I'm the guy who posted about getting back into daygame. I enjoyed your post. The stress on personal AB testing every theory, every interaction is a must for personal mastery. \n\nI would like you to expand on your post. You go in depth on the idea, but it seems like you cut it a little short on the more actionable part of the post. The problem with most posts regarding game is the lack of concrete action items. Sure, its easy to say be interesting, AB test, be more awake, feel the energy levels with focus. I want to take your advice, but its a little too abstract. All I can do is nod my head and keep doing what I do. I would find it tremendously helpful if you linked this to personal experience via an FR or examples. \n\nSome question include:\n\nHow do you AB test? Do you change one thing only? How many do you test on before you conclude and move onto the next thing (keeping in mind reliable scientific sampling is usually based on 50 or 100+ respondents)?\n\nFor some who live in a major city, it may be more efficient to take a couple hours from a rest day and AB test the heck out of any theories cold approaching. \n\nHow do you feel out energy levels? What do you do with it once you find out? Do you match their level and start getting more excited? How do you raise their levels using this info?\n\nPersonally, I just started working a job and I can relate to the position most employees are in. Standing there, 10+ hours a day greeting people and taking orders. I understand them and when I empathize, it breaks down their walls. If I roll in late, I comment, \"long day huh, I hope you get off soon :)\". Or if its just a regular day, I'll just be human and treat them like a human being- compliment something, make an unusual comment and break them out of their monotony. \"Do you know where to find a pet alligator around here?\" Serious face then joke around, these people are dying to have some fun and it doesn't take much. \n\nBe interesting. How do you be interesting straight off the bat? Most people are interesting, but due to nerves or lack of frame, they enter the girl's frame and 'run out of things to say'. How do you keep this from interfering? I would say keep going out and approaching girls until it doesn't phase you anymore that you are talking to a cute girl. Then you can relax and your interesting self will start to shine. Stuff like this takes time to develop. It takes a lot of rejection to trim the fat of anxiety and bring you back to your core. ", "edited": 1492053128.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi. I&amp;#39;m the guy who posted about getting back into daygame. I enjoyed your post. The stress on personal AB testing every theory, every interaction is a must for personal mastery. &lt;/p&gt;\n\n&lt;p&gt;I would like you to expand on your post. You go in depth on the idea, but it seems like you cut it a little short on the more actionable part of the post. The problem with most posts regarding game is the lack of concrete action items. Sure, its easy to say be interesting, AB test, be more awake, feel the energy levels with focus. I want to take your advice, but its a little too abstract. All I can do is nod my head and keep doing what I do. I would find it tremendously helpful if you linked this to personal experience via an FR or examples. &lt;/p&gt;\n\n&lt;p&gt;Some question include:&lt;/p&gt;\n\n&lt;p&gt;How do you AB test? Do you change one thing only? How many do you test on before you conclude and move onto the next thing (keeping in mind reliable scientific sampling is usually based on 50 or 100+ respondents)?&lt;/p&gt;\n\n&lt;p&gt;For some who live in a major city, it may be more efficient to take a couple hours from a rest day and AB test the heck out of any theories cold approaching. &lt;/p&gt;\n\n&lt;p&gt;How do you feel out energy levels? What do you do with it once you find out? Do you match their level and start getting more excited? How do you raise their levels using this info?&lt;/p&gt;\n\n&lt;p&gt;Personally, I just started working a job and I can relate to the position most employees are in. Standing there, 10+ hours a day greeting people and taking orders. I understand them and when I empathize, it breaks down their walls. If I roll in late, I comment, &amp;quot;long day huh, I hope you get off soon :)&amp;quot;. Or if its just a regular day, I&amp;#39;ll just be human and treat them like a human being- compliment something, make an unusual comment and break them out of their monotony. &amp;quot;Do you know where to find a pet alligator around here?&amp;quot; Serious face then joke around, these people are dying to have some fun and it doesn&amp;#39;t take much. &lt;/p&gt;\n\n&lt;p&gt;Be interesting. How do you be interesting straight off the bat? Most people are interesting, but due to nerves or lack of frame, they enter the girl&amp;#39;s frame and &amp;#39;run out of things to say&amp;#39;. How do you keep this from interfering? I would say keep going out and approaching girls until it doesn&amp;#39;t phase you anymore that you are talking to a cute girl. Then you can relax and your interesting self will start to shine. Stuff like this takes time to develop. It takes a lot of rejection to trim the fat of anxiety and bring you back to your core. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg4oyjd", "score_hidden": false, "stickied": false, "created": 1491964448.0, "created_utc": 1491935648.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64nj35", "likes": null, "replies": "", "user_reports": [], "id": "dg3tlwc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jrusselljones", "parent_id": "t3_64nj35", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I like it a lot I have always been really interested in improving my day game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like it a lot I have always been really interested in improving my day game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg3tlwc", "score_hidden": false, "stickied": false, "created": 1491911799.0, "created_utc": 1491882999.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]