[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello everyone,&lt;/p&gt;\n\n&lt;p&gt;-I previously posted about abundance mentality and would like to follow up with a post that explores it a bit further so here it goes.&lt;/p&gt;\n\n&lt;p&gt;-As someone who went through high school with severe confidence issues, and subsequently issues with women, abundance mentality has been the hardest aspect of TRP for me to master.  Issues with confidence infect every aspect of your life.  They stunt your growth.&lt;/p&gt;\n\n&lt;p&gt;-A man can never grow if he doesn&amp;#39;t have the will to do it.  You will go through life and it will try to cut your feet out from under you.  Try to reach for your goals and it will smash your hands to pieces.  You end up a crippled man who grows only in the direction your life lets you.  A man who never learns to fight, to bob  and weave out of these obstacles will always be a victim.  You become boxed and filed away to whatever you let life dictate.&lt;/p&gt;\n\n&lt;p&gt;-Life does its best to box you from the very start.  Your entire life from the moment you are born people will categorize you.  Your parents will, your friends will, your school will, your teachers will, your job will, YOU will. &lt;/p&gt;\n\n&lt;p&gt;-This isn&amp;#39;t inherently a bad thing.  However, the more you lack confidence and self esteem, the harder it is for you to break free from the box you are in.  &lt;/p&gt;\n\n&lt;p&gt;-Every man has the power to change himself.  Just take a look at all the fat guys on Reddit fitness who post their pictures where they transform from these morbidly obese guys into someone completely different.  You are not fixed in to the person you are.  Marilyn Manson didn&amp;#39;t always look the way he did, he made his image into what it is now, and so can you.  Rockstars weren&amp;#39;t born that way, Writers didn&amp;#39;t grow up geniuses.  They failed.  But they didn&amp;#39;t let failure stunt their growth, they didn&amp;#39;t see failure as a stopping point, as a limit. &lt;/p&gt;\n\n&lt;p&gt;-There are very few things that separate a man that drowns in women, or wealth, or success, from any other man.  The trap to never achieving success as they have is believing they have something you don&amp;#39;t.  That it came to them with no effort, or no work.  That they are players and you aren&amp;#39;t even in the game.&lt;/p&gt;\n\n&lt;p&gt;-Abundance mentality is actually pretty simple.  Just as Neo had to come to the realization there is no spoon, YOU have to come to the realization that there is no box.  You can grow or change into whoever or whatever you want to be.  This is the power of abundance mentality.&lt;/p&gt;\n\n&lt;p&gt;-This is why lifting is so successful.  Not only does it make you look better and healthier, but you also break out of the box you thought you were in just a bit.  When you are with enough women you realize that yeah, you really can get women just like chad did.&lt;/p&gt;\n\n&lt;p&gt;-For the guys struggling, you have to battle yourself.  Your mind will fight hard to stay within whatever self image you have of yourself.  Realize that this image is a mirage, a lie.  Its just the box you put yourself in, and guess what, its not even real.  &lt;/p&gt;\n\n&lt;p&gt;-People say fake it until you make it.  Don&amp;#39;t have confidence?  Well fake it until its real.  While this can give results, whats really going on is you keep telling yourself you are a confident guy(instead of the nerd you think you are).  It can be difficult to get to B from A with this if you are really far gone.  You have to realize that yes, you are a confident guy if you stop categorizing yourself as a nerdy loser.  Stop reinforcing the negative Image you have of yourself.  It isn&amp;#39;t real unless you believe in it.&lt;/p&gt;\n\n&lt;p&gt;-You are only limited by what you believe you are limited to.  Most things in your life CAN be overcome by simple life changes you can make.&lt;/p&gt;\n\n&lt;p&gt;-Good luck on your journeys to becoming the Men you want to be guys.    &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello everyone,\n\n-I previously posted about abundance mentality and would like to follow up with a post that explores it a bit further so here it goes.\n\n-As someone who went through high school with severe confidence issues, and subsequently issues with women, abundance mentality has been the hardest aspect of TRP for me to master.  Issues with confidence infect every aspect of your life.  They stunt your growth.\n\n-A man can never grow if he doesn't have the will to do it.  You will go through life and it will try to cut your feet out from under you.  Try to reach for your goals and it will smash your hands to pieces.  You end up a crippled man who grows only in the direction your life lets you.  A man who never learns to fight, to bob  and weave out of these obstacles will always be a victim.  You become boxed and filed away to whatever you let life dictate.\n\n-Life does its best to box you from the very start.  Your entire life from the moment you are born people will categorize you.  Your parents will, your friends will, your school will, your teachers will, your job will, YOU will. \n\n-This isn't inherently a bad thing.  However, the more you lack confidence and self esteem, the harder it is for you to break free from the box you are in.  \n\n-Every man has the power to change himself.  Just take a look at all the fat guys on Reddit fitness who post their pictures where they transform from these morbidly obese guys into someone completely different.  You are not fixed in to the person you are.  Marilyn Manson didn't always look the way he did, he made his image into what it is now, and so can you.  Rockstars weren't born that way, Writers didn't grow up geniuses.  They failed.  But they didn't let failure stunt their growth, they didn't see failure as a stopping point, as a limit. \n\n-There are very few things that separate a man that drowns in women, or wealth, or success, from any other man.  The trap to never achieving success as they have is believing they have something you don't.  That it came to them with no effort, or no work.  That they are players and you aren't even in the game.\n\n-Abundance mentality is actually pretty simple.  Just as Neo had to come to the realization there is no spoon, YOU have to come to the realization that there is no box.  You can grow or change into whoever or whatever you want to be.  This is the power of abundance mentality.\n\n-This is why lifting is so successful.  Not only does it make you look better and healthier, but you also break out of the box you thought you were in just a bit.  When you are with enough women you realize that yeah, you really can get women just like chad did.\n\n-For the guys struggling, you have to battle yourself.  Your mind will fight hard to stay within whatever self image you have of yourself.  Realize that this image is a mirage, a lie.  Its just the box you put yourself in, and guess what, its not even real.  \n\n-People say fake it until you make it.  Don't have confidence?  Well fake it until its real.  While this can give results, whats really going on is you keep telling yourself you are a confident guy(instead of the nerd you think you are).  It can be difficult to get to B from A with this if you are really far gone.  You have to realize that yes, you are a confident guy if you stop categorizing yourself as a nerdy loser.  Stop reinforcing the negative Image you have of yourself.  It isn't real unless you believe in it.\n\n-You are only limited by what you believe you are limited to.  Most things in your life CAN be overcome by simple life changes you can make.\n\n\n-Good luck on your journeys to becoming the Men you want to be guys.    \n                 ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Red Pill Theory", "id": "64o6tm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 91, "report_reasons": null, "author": "Aaronindhouse", "saved": false, "mod_reports": [], "name": "t3_64o6tm", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": false, "link_flair_css_class": "theory", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheRedPill/comments/64o6tm/the_secret_of_abundance_mentality_follow_up/", "num_reports": null, "locked": false, "stickied": false, "created": 1491906844.0, "url": "https://www.reddit.com/r/TheRedPill/comments/64o6tm/the_secret_of_abundance_mentality_follow_up/", "author_flair_text": null, "quarantine": false, "title": "The Secret of Abundance Mentality Follow Up", "created_utc": 1491878044.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 91}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64o6tm", "likes": null, "replies": "", "user_reports": [], "id": "dg46mn5", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "tsirolnik", "parent_id": "t3_64o6tm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Great post, thanks. Really needed", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post, thanks. Really needed&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg46mn5", "score_hidden": false, "stickied": false, "created": 1491942626.0, "created_utc": 1491913826.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64o6tm", "likes": null, "replies": "", "user_reports": [], "id": "dg5kr3h", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "investcapital", "parent_id": "t3_64o6tm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Law 25: Recreate yourself\n\n*Do not accept the roles that society foists on you. Re-create yourself by forging a new identity, one that commands attention and never bores the audience. Be the master of your own image rather than letting others define it for you. Incorporate dramatic devices into your public gestures and actions—your power will be enhanced and your character will seem larger than life.*\n\nGreat post OP\n\nEdit; expanding on this a bit... \n\nYou might not realize it but all of the people you associate with have molded you into the image you've become (assuming you haven't mastered Law 25 yet). \n\nDo you ever notice how you speak or act differently around certain people (if you've mastered the 48 laws, this can be a subtle power move but i'll assume you haven't mastered them yet)? You do this because you've let them help define your image and you're afraid to step out of that box when you are around them (read: when you are in their frame).\n\nFor those having trouble with this, here's what worked for me: I had to spend some time away from the people (family, friends) who helped define my old image. If I didn't spend enough time away from them, I would inevitably regress back to my old self around them because I was worried I might seem \"fake\" by acting like a totally different person, or that they might see through my new image and think I was putting on a big act.\n\nIf this is how it is for you, you probably need to spend more time in monk mode (read: more time away from these people) until you are confident and comfortable enough in your new skin. Once you reach that confidence level, you won't feel as pressured to regress to your old self around these people.\n\nAlso, in regards to women, ideally you should be able to achieve abundance mentality on your own (with or without women). You can fake it til you make it if you need to, it really only takes **one plate** to really achieve that mentality. \n\nIf you can just get 1 consistent plate that you **know you can fuck any time you want**, you will approach new women with a genuine abundance mentality. When talking/gaming her, you will actually not really care if you close her or not (read: you will be outcome independent) because in the back of your mind you're thinking \"I'm just gonna go bang plate1 later if this doesn't work out.\"\n\nThis is exactly where you want to be mentally in all situations. The hardest part is faking it in order to get your first plate. Getting from 0 to 1 is 1000 times harder than getting from 1 to 3. This is why a lot of people on here suggest hiring a prostitute if you aren't getting sex elsewhere.", "edited": 1491980785.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Law 25: Recreate yourself&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Do not accept the roles that society foists on you. Re-create yourself by forging a new identity, one that commands attention and never bores the audience. Be the master of your own image rather than letting others define it for you. Incorporate dramatic devices into your public gestures and actions—your power will be enhanced and your character will seem larger than life.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Great post OP&lt;/p&gt;\n\n&lt;p&gt;Edit; expanding on this a bit... &lt;/p&gt;\n\n&lt;p&gt;You might not realize it but all of the people you associate with have molded you into the image you&amp;#39;ve become (assuming you haven&amp;#39;t mastered Law 25 yet). &lt;/p&gt;\n\n&lt;p&gt;Do you ever notice how you speak or act differently around certain people (if you&amp;#39;ve mastered the 48 laws, this can be a subtle power move but i&amp;#39;ll assume you haven&amp;#39;t mastered them yet)? You do this because you&amp;#39;ve let them help define your image and you&amp;#39;re afraid to step out of that box when you are around them (read: when you are in their frame).&lt;/p&gt;\n\n&lt;p&gt;For those having trouble with this, here&amp;#39;s what worked for me: I had to spend some time away from the people (family, friends) who helped define my old image. If I didn&amp;#39;t spend enough time away from them, I would inevitably regress back to my old self around them because I was worried I might seem &amp;quot;fake&amp;quot; by acting like a totally different person, or that they might see through my new image and think I was putting on a big act.&lt;/p&gt;\n\n&lt;p&gt;If this is how it is for you, you probably need to spend more time in monk mode (read: more time away from these people) until you are confident and comfortable enough in your new skin. Once you reach that confidence level, you won&amp;#39;t feel as pressured to regress to your old self around these people.&lt;/p&gt;\n\n&lt;p&gt;Also, in regards to women, ideally you should be able to achieve abundance mentality on your own (with or without women). You can fake it til you make it if you need to, it really only takes &lt;strong&gt;one plate&lt;/strong&gt; to really achieve that mentality. &lt;/p&gt;\n\n&lt;p&gt;If you can just get 1 consistent plate that you &lt;strong&gt;know you can fuck any time you want&lt;/strong&gt;, you will approach new women with a genuine abundance mentality. When talking/gaming her, you will actually not really care if you close her or not (read: you will be outcome independent) because in the back of your mind you&amp;#39;re thinking &amp;quot;I&amp;#39;m just gonna go bang plate1 later if this doesn&amp;#39;t work out.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This is exactly where you want to be mentally in all situations. The hardest part is faking it in order to get your first plate. Getting from 0 to 1 is 1000 times harder than getting from 1 to 3. This is why a lot of people on here suggest hiring a prostitute if you aren&amp;#39;t getting sex elsewhere.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg5kr3h", "score_hidden": false, "stickied": false, "created": 1492008078.0, "created_utc": 1491979278.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64o6tm", "likes": null, "replies": "", "user_reports": [], "id": "dg3se3k", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "ShakaLeonidas", "parent_id": "t3_64o6tm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Good post.  Alot of folks miss the \"Spoon\". Their are limits. Even in the matrix hence neo could still bleed in the matrix when he stopped the blade(\" you are stil a human\") .Some things had to be cultivated in training programs (monk mode) . They still have to recieve nourishment via physical means and experience impulse stimulation(interaction with their physical enviroment). The spoon signified you have to expand your mind and differentiate between what is real, what is feasible for you to comprehend,  what you can manipulate/ control and what is irrelevant to the task at hand. You gotta let go and go forth. Holding onto a belief might be holding you back. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good post.  Alot of folks miss the &amp;quot;Spoon&amp;quot;. Their are limits. Even in the matrix hence neo could still bleed in the matrix when he stopped the blade(&amp;quot; you are stil a human&amp;quot;) .Some things had to be cultivated in training programs (monk mode) . They still have to recieve nourishment via physical means and experience impulse stimulation(interaction with their physical enviroment). The spoon signified you have to expand your mind and differentiate between what is real, what is feasible for you to comprehend,  what you can manipulate/ control and what is irrelevant to the task at hand. You gotta let go and go forth. Holding onto a belief might be holding you back. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg3se3k", "score_hidden": false, "stickied": false, "created": 1491909998.0, "created_utc": 1491881198.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64o6tm", "likes": null, "replies": "", "user_reports": [], "id": "dg4nypd", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "heelface", "parent_id": "t3_64o6tm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Just to chime in \"fake it until you make it\" really works.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just to chime in &amp;quot;fake it until you make it&amp;quot; really works.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg4nypd", "score_hidden": false, "stickied": false, "created": 1491963356.0, "created_utc": 1491934556.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64o6tm", "likes": null, "replies": "", "user_reports": [], "id": "dg5fqg4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "blackdoginside", "parent_id": "t3_64o6tm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Great post! I liked the Neo reference.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post! I liked the Neo reference.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg5fqg4", "score_hidden": false, "stickied": false, "created": 1491998133.0, "created_utc": 1491969333.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64o6tm", "likes": null, "replies": "", "user_reports": [], "id": "dg7a49m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TyrannicalWill", "parent_id": "t3_64o6tm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "If being a beta defined by the PUA community is an inferior strategy, why do so many betas exist? The reality is the beta has the superior sexual strategy than the PUA. The primitive, sex &amp; porn addicted PUA brain is merely looking for the next wet hole to stimulate dopamine. Now, this is primitive as it was conditioned in an environment with no birth control. The beta is the most evolved primate, conditioned by civilization. At the end of the day, the (typical) PUA never settles and raises a child, thinking that is \"muh beta culture\", and never reproduces. While the PUA attains more dopamine stimulation from novel females as illustrated by the Coolidge Effect, it statistically has far less reproductive success. While the beta attains far less dopamine stimulation, it induces families and communities.\n\nWhy do so few \"Chads\" exist in Caucasoid &amp; even less prominently Mongoloid communities yet many \"Chads\" exist in the African communities which can't maintain relevant civilizations? Simple, the PUA is the archaic human.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If being a beta defined by the PUA community is an inferior strategy, why do so many betas exist? The reality is the beta has the superior sexual strategy than the PUA. The primitive, sex &amp;amp; porn addicted PUA brain is merely looking for the next wet hole to stimulate dopamine. Now, this is primitive as it was conditioned in an environment with no birth control. The beta is the most evolved primate, conditioned by civilization. At the end of the day, the (typical) PUA never settles and raises a child, thinking that is &amp;quot;muh beta culture&amp;quot;, and never reproduces. While the PUA attains more dopamine stimulation from novel females as illustrated by the Coolidge Effect, it statistically has far less reproductive success. While the beta attains far less dopamine stimulation, it induces families and communities.&lt;/p&gt;\n\n&lt;p&gt;Why do so few &amp;quot;Chads&amp;quot; exist in Caucasoid &amp;amp; even less prominently Mongoloid communities yet many &amp;quot;Chads&amp;quot; exist in the African communities which can&amp;#39;t maintain relevant civilizations? Simple, the PUA is the archaic human.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7a49m", "score_hidden": false, "stickied": false, "created": 1492097163.0, "created_utc": 1492068363.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64o6tm", "likes": null, "replies": "", "user_reports": [], "id": "dg9tnom", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DM112090", "parent_id": "t3_64o6tm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I agree with OP's relentless optimism with a few cautionary remarks.\n\n- Abundance mentality doesn't mean being unrealistic with yourself. I used to go to a lousy church where the pastor insisted we \"speak truth into our lives\". He'd tell the congregation to say things like \"I'm rich\" in the mirror when you're massively in debt, \"I'm cured\" when you're terminally ill, etc. Abundance mentality is not lying about how dire your situation is. It is about being brutally honest in your estimate of what you have or don't have, and believing against all temporary obstacles and naysayers that your hard work and focus *will* pay off.\n\n- Stay away from positive energy mumbo jumbo stuff that bluepillers and women get into when they read books like *The Secret* or anything by Joel Osteen. Redpill abundance mentality is staunch positivity in view of backbreaking and focused hard work and study. \n\nNow, OP isn't saying the above, but I have good reason to believe some tubby would read what he wrote and twist it for his own lazy agenda. \n\nHint: I was once that tubby. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with OP&amp;#39;s relentless optimism with a few cautionary remarks.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Abundance mentality doesn&amp;#39;t mean being unrealistic with yourself. I used to go to a lousy church where the pastor insisted we &amp;quot;speak truth into our lives&amp;quot;. He&amp;#39;d tell the congregation to say things like &amp;quot;I&amp;#39;m rich&amp;quot; in the mirror when you&amp;#39;re massively in debt, &amp;quot;I&amp;#39;m cured&amp;quot; when you&amp;#39;re terminally ill, etc. Abundance mentality is not lying about how dire your situation is. It is about being brutally honest in your estimate of what you have or don&amp;#39;t have, and believing against all temporary obstacles and naysayers that your hard work and focus &lt;em&gt;will&lt;/em&gt; pay off.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Stay away from positive energy mumbo jumbo stuff that bluepillers and women get into when they read books like &lt;em&gt;The Secret&lt;/em&gt; or anything by Joel Osteen. Redpill abundance mentality is staunch positivity in view of backbreaking and focused hard work and study. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Now, OP isn&amp;#39;t saying the above, but I have good reason to believe some tubby would read what he wrote and twist it for his own lazy agenda. &lt;/p&gt;\n\n&lt;p&gt;Hint: I was once that tubby. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9tnom", "score_hidden": false, "stickied": false, "created": 1492236006.0, "created_utc": 1492207206.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64o6tm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64o6tm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64o6tm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64o6tm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64o6tm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64o6tm", "likes": null, "replies": "", "user_reports": [], "id": "dg5v8bu", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "maybethistimeyes1", "parent_id": "t1_dg584p1", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "If I make one person realize that red pill isn't a strategy, but a support group for men who either don't get laid or married a terrible woman, my work is a success. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I make one person realize that red pill isn&amp;#39;t a strategy, but a support group for men who either don&amp;#39;t get laid or married a terrible woman, my work is a success. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg5v8bu", "score_hidden": false, "stickied": false, "created": 1492033161.0, "created_utc": 1492004361.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg584p1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Aaronindhouse", "parent_id": "t1_dg4r29c", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This is general advice about changing yourself.  If you can't understand that I feel sorry for you.  If you can't see the value in that, I feel sorry for you.  \n\nYeah, I like video games, I'm also an artist, a photographer, I write, and make music, and do many other things outside of that.  I don't Reddit about my entire life.  It would also help you to think about the fact that not everyone visiting this place is at the same point in their life.  Not everyone is a Don Juan the Pussy Slayer overnight after taking the red pill.  This post is about helping you make changes mentally to help you get there.\n\nFRAME is about a strong mind.  Having a strong mind AND body is part of TRP.  Do you see me preaching pussifying shit here?  A freshly unplugged man has to change his mind, sharpen it and himself.  This post is about helping those struggling with changing themselves and their mindset to do so.\n\nIf you want to go and circle jerk about your n-count, make a field report about it.  I'm here to give a shit about myself, my n-count, and my improvement, and maybe help some others if I have something worth sharing.\n\nYour post history is full of comments that are wasteful and contribute nothing.  One of TRP's teachings is that saying less can be more.  I think you need to revisit this one.                    ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is general advice about changing yourself.  If you can&amp;#39;t understand that I feel sorry for you.  If you can&amp;#39;t see the value in that, I feel sorry for you.  &lt;/p&gt;\n\n&lt;p&gt;Yeah, I like video games, I&amp;#39;m also an artist, a photographer, I write, and make music, and do many other things outside of that.  I don&amp;#39;t Reddit about my entire life.  It would also help you to think about the fact that not everyone visiting this place is at the same point in their life.  Not everyone is a Don Juan the Pussy Slayer overnight after taking the red pill.  This post is about helping you make changes mentally to help you get there.&lt;/p&gt;\n\n&lt;p&gt;FRAME is about a strong mind.  Having a strong mind AND body is part of TRP.  Do you see me preaching pussifying shit here?  A freshly unplugged man has to change his mind, sharpen it and himself.  This post is about helping those struggling with changing themselves and their mindset to do so.&lt;/p&gt;\n\n&lt;p&gt;If you want to go and circle jerk about your n-count, make a field report about it.  I&amp;#39;m here to give a shit about myself, my n-count, and my improvement, and maybe help some others if I have something worth sharing.&lt;/p&gt;\n\n&lt;p&gt;Your post history is full of comments that are wasteful and contribute nothing.  One of TRP&amp;#39;s teachings is that saying less can be more.  I think you need to revisit this one.                    &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg584p1", "score_hidden": false, "stickied": false, "created": 1491987583.0, "created_utc": 1491958783.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4r29c", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg4qg5s", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg4r29c", "score_hidden": false, "stickied": false, "created": 1491966676.0, "created_utc": 1491937876.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4qg5s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "newName543456", "parent_id": "t1_dg4nndq", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Ignore him, he's a worthless troll that posts random insults under any RP post he sees.\n\nI already reported him, hope such useless remarks will be removed and author will not pollute this sub with his measly existence :0)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ignore him, he&amp;#39;s a worthless troll that posts random insults under any RP post he sees.&lt;/p&gt;\n\n&lt;p&gt;I already reported him, hope such useless remarks will be removed and author will not pollute this sub with his measly existence :0)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg4qg5s", "score_hidden": false, "stickied": false, "created": 1491966032.0, "created_utc": 1491937232.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4nndq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Aaronindhouse", "parent_id": "t1_dg4mqbf", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The whole purpose of this post is to help others overcome their mental battles and get out of their own way. \n\nLast I checked TRP is about self improvement AND sexual strategy.  This post is speaking to those who are having issues on their journey of self improvement.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The whole purpose of this post is to help others overcome their mental battles and get out of their own way. &lt;/p&gt;\n\n&lt;p&gt;Last I checked TRP is about self improvement AND sexual strategy.  This post is speaking to those who are having issues on their journey of self improvement.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg4nndq", "score_hidden": false, "stickied": false, "created": 1491963005.0, "created_utc": 1491934205.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4mqbf", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64o6tm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg4mqbf", "score_hidden": false, "stickied": false, "created": 1491961992.0, "created_utc": 1491933192.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -8}}], "after": null, "before": null}}]