[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello all! &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Edit&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;(Didn&amp;#39;t quite know what flair this should be tagged under... as it is not explicitly about sexual strategy so I flared it as Rant / Venting.)&lt;/p&gt;\n\n&lt;p&gt;A lot of improvement, and anti-improvement has been going on in my life over the past 6 months since discovering TheRedPill.&lt;/p&gt;\n\n&lt;p&gt;Much progress has been made. Many lessons learned.&lt;/p&gt;\n\n&lt;p&gt;Still am very new to this whole process, the mindset and the lifestyle. This is not, as I am clearly learning, a Take The Pill Once and All Shall Be Cured type of thing; I imagined this would be akin to Neo from the Matrix - Take the pill then WAPOW, you&amp;#39;re there, bud.&lt;/p&gt;\n\n&lt;p&gt;Enough about that. What I wanted to share is a lesson learned far too late, by my level of 23 in the game of life. The lesson?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR Edit&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;It is ok to fail. You have to. However, you must get back up after the fall, after the fail. Through failure you create experiences and through experiences you create the ingredients that create the success(es)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;A year ago, I graduated from one of the best music schools in the country; Berklee. (This is important to the lesson I learned. I promise.) A week prior to walking at graduation, my then first girlfriend / high school sweet heart of 4 years broke up with me. (&lt;em&gt;3 of which were Long Distance, yes I know, lesson learned, while I was at College and she was working management / supervisor positions @ retail.&lt;/em&gt;) Two to Three weeks prior to walking, my bike was stolen. &lt;/p&gt;\n\n&lt;p&gt;August of 2016, I was informed that a class was needed to be retaken for me to receive the degree&lt;/p&gt;\n\n&lt;p&gt;September through December 2016, many months spent half-assed intaking the concepts of the side bar, lifting, and continually losing frame with said ex girlfriend.&lt;/p&gt;\n\n&lt;p&gt;January 2017, back at college paying a ridiculous amount of rent for my income level and earning potential from both jobs.&lt;/p&gt;\n\n&lt;p&gt;February 2017, noticing a Lot of improving in my social interactions, noticing a lot of improvements in my work ethic. Noticing a lot of solid, good, improvements. &lt;/p&gt;\n\n&lt;p&gt;Mid-February 2017, ex calls to say she is headed to Air Force Bootcamp and felt like there was a missing link before leaving. Bit the bullet and provided comfort; although Red Pill would have my had for this. Proceeded to slowly go downhill from that point. In hindsight, learned another lesson here.&lt;/p&gt;\n\n&lt;p&gt;March 2017, I was informed that I would still not pass said class with high enough GPA for the degree.&lt;/p&gt;\n\n&lt;p&gt;Now, April 2017, looking back at everything I have learned from the top contributors here, as well as the side bar, looking at both the improvements and the failures, fully realize there is &lt;strong&gt;Time&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;The string tying together all the Red Pill truths I have been witnessing while back in Boston, from people watching and Straight From The Mouths Of Friends, and all the mini-lessons I&amp;#39;ve been learning trial by fire, is &lt;strong&gt;It Is Ok To Fail, So Long As You Get Back Up And Keep Going. Do Not Stop, Keep Going. If You Get Off Course, Realign, Readjust, Reconfirm Your Trajectory And Keep Going&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The group of mini lessons;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;You cannot start a new chapter of life while constantly re-reading an old one&lt;/strong&gt; -- This would translate into Oneitis as well as Could Ofs, Should Ofs and Would Ofs. It is imperative to keep on keeping on even if one must fake it for a little while.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;You must find enjoyment in something you do (Your Purpose / Your Mission)&lt;/strong&gt; - Well clearly, right? Ironically, or perhaps not ironically, I derived no joy, no fulfillment from music for the past 2 years. No joy, no fulfillment, from the thing I want to create a career from? Woah buddy. Recalibration needs to be done. Although studying music, making a career out of it, a huge road-block to success, or at the very least potential success, was deriving no joy from it. This has since been solved but I wanted to stress the importance of finding ways to enjoy what you do for your mission or hobby or something of value to you.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Know yourself. Sit down and take the time to get to the Root of your problems, be them self-created or otherwise.&lt;/strong&gt; -- Recently sat down with my cousin, bless his heart, and truly mapped out what actually was going on internally, how to solve it, and how to allow myself, as growing into a better man, the ability to be in Control and not in a constant state of Reactionary living; Having your emotions, your feelings, control you. Externally I&amp;#39;m Grade A at putting on a show in order to entertain people, make people happy, make people feel good, make people comfortable, smile, etc. I put on a damn good show, if I am acting. However, internally, there were many problems I &lt;strong&gt;thought&lt;/strong&gt; I had under control, but clearly didn&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;The problems? Addiction, Abandonment Issues, Procrastination, Self-Sabotage, Self Hate, Not Practicing (an instrument is the musician&amp;#39;s bread and butter, no matter what track they are on; Business Side, Production, Audio Visual, etc.) and Etc. Translating this into the stages of Red Pill, was definitely in the anger phase. &lt;/p&gt;\n\n&lt;p&gt;Although dropping the ball at many steps along the way, fully realizing that these lessons, probably, would not have been learned otherwise. This is a continual process. It is stressed many times but I am sure there are long people, or younger, out there that forget, ignore, or don&amp;#39;t realize that this is a Process of growth and not just something that you unplug from and boom; You&amp;#39;re Neo.&lt;/p&gt;\n\n&lt;p&gt;Wanted to make this post to, hopefully, extend a nod out to other guys like me, new to this whole mentality, life style, on here, struggling to have their own reality moreorless matchup with object reality - That is perhaps not the best way to put it but for lack of a better phase at the time of writing, I&amp;#39;ll go with that. Also, to hopefully provide some form of useful content to the community and contribute. Please forgive, or be as harsh and rude as humanly possible, if these objectives were not met.&lt;/p&gt;\n\n&lt;p&gt;Most users will be far more experienced and higher level in the game of life than I am currently at the ripe level of 23. However, I am certain someone can learn or take something from this, if not perhaps a comment will articulate this better than I can. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello all! \n\n*Edit*\n\n(Didn't quite know what flair this should be tagged under... as it is not explicitly about sexual strategy so I flared it as Rant / Venting.)\n\nA lot of improvement, and anti-improvement has been going on in my life over the past 6 months since discovering TheRedPill.\n\nMuch progress has been made. Many lessons learned.\n\n\nStill am very new to this whole process, the mindset and the lifestyle. This is not, as I am clearly learning, a Take The Pill Once and All Shall Be Cured type of thing; I imagined this would be akin to Neo from the Matrix - Take the pill then WAPOW, you're there, bud.\n\nEnough about that. What I wanted to share is a lesson learned far too late, by my level of 23 in the game of life. The lesson?\n\n**TL;DR Edit**\n\n**It is ok to fail. You have to. However, you must get back up after the fall, after the fail. Through failure you create experiences and through experiences you create the ingredients that create the success(es)**\n\n\nA year ago, I graduated from one of the best music schools in the country; Berklee. (This is important to the lesson I learned. I promise.) A week prior to walking at graduation, my then first girlfriend / high school sweet heart of 4 years broke up with me. (*3 of which were Long Distance, yes I know, lesson learned, while I was at College and she was working management / supervisor positions @ retail.*) Two to Three weeks prior to walking, my bike was stolen. \n\nAugust of 2016, I was informed that a class was needed to be retaken for me to receive the degree\n\nSeptember through December 2016, many months spent half-assed intaking the concepts of the side bar, lifting, and continually losing frame with said ex girlfriend.\n\nJanuary 2017, back at college paying a ridiculous amount of rent for my income level and earning potential from both jobs.\n\nFebruary 2017, noticing a Lot of improving in my social interactions, noticing a lot of improvements in my work ethic. Noticing a lot of solid, good, improvements. \n\nMid-February 2017, ex calls to say she is headed to Air Force Bootcamp and felt like there was a missing link before leaving. Bit the bullet and provided comfort; although Red Pill would have my had for this. Proceeded to slowly go downhill from that point. In hindsight, learned another lesson here.\n\nMarch 2017, I was informed that I would still not pass said class with high enough GPA for the degree.\n\nNow, April 2017, looking back at everything I have learned from the top contributors here, as well as the side bar, looking at both the improvements and the failures, fully realize there is **Time**. \n\nThe string tying together all the Red Pill truths I have been witnessing while back in Boston, from people watching and Straight From The Mouths Of Friends, and all the mini-lessons I've been learning trial by fire, is **It Is Ok To Fail, So Long As You Get Back Up And Keep Going. Do Not Stop, Keep Going. If You Get Off Course, Realign, Readjust, Reconfirm Your Trajectory And Keep Going**\n\nThe group of mini lessons;\n\n**You cannot start a new chapter of life while constantly re-reading an old one** -- This would translate into Oneitis as well as Could Ofs, Should Ofs and Would Ofs. It is imperative to keep on keeping on even if one must fake it for a little while.\n\n**You must find enjoyment in something you do (Your Purpose / Your Mission)** - Well clearly, right? Ironically, or perhaps not ironically, I derived no joy, no fulfillment from music for the past 2 years. No joy, no fulfillment, from the thing I want to create a career from? Woah buddy. Recalibration needs to be done. Although studying music, making a career out of it, a huge road-block to success, or at the very least potential success, was deriving no joy from it. This has since been solved but I wanted to stress the importance of finding ways to enjoy what you do for your mission or hobby or something of value to you.\n\n**Know yourself. Sit down and take the time to get to the Root of your problems, be them self-created or otherwise.** -- Recently sat down with my cousin, bless his heart, and truly mapped out what actually was going on internally, how to solve it, and how to allow myself, as growing into a better man, the ability to be in Control and not in a constant state of Reactionary living; Having your emotions, your feelings, control you. Externally I'm Grade A at putting on a show in order to entertain people, make people happy, make people feel good, make people comfortable, smile, etc. I put on a damn good show, if I am acting. However, internally, there were many problems I **thought** I had under control, but clearly didn't. \n\nThe problems? Addiction, Abandonment Issues, Procrastination, Self-Sabotage, Self Hate, Not Practicing (an instrument is the musician's bread and butter, no matter what track they are on; Business Side, Production, Audio Visual, etc.) and Etc. Translating this into the stages of Red Pill, was definitely in the anger phase. \n\nAlthough dropping the ball at many steps along the way, fully realizing that these lessons, probably, would not have been learned otherwise. This is a continual process. It is stressed many times but I am sure there are long people, or younger, out there that forget, ignore, or don't realize that this is a Process of growth and not just something that you unplug from and boom; You're Neo.\n\nWanted to make this post to, hopefully, extend a nod out to other guys like me, new to this whole mentality, life style, on here, struggling to have their own reality moreorless matchup with object reality - That is perhaps not the best way to put it but for lack of a better phase at the time of writing, I'll go with that. Also, to hopefully provide some form of useful content to the community and contribute. Please forgive, or be as harsh and rude as humanly possible, if these objectives were not met.\n\nMost users will be far more experienced and higher level in the game of life than I am currently at the ripe level of 23. However, I am certain someone can learn or take something from this, if not perhaps a comment will articulate this better than I can. \n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Rant/Venting", "id": "64ozy3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 27, "report_reasons": null, "author": "Wolffy93", "saved": false, "mod_reports": [], "name": "t3_64ozy3", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": 1491889453.0, "link_flair_css_class": "rant", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheRedPill/comments/64ozy3/if_you_fall_get_back_up/", "num_reports": null, "locked": false, "stickied": false, "created": 1491917681.0, "url": "https://www.reddit.com/r/TheRedPill/comments/64ozy3/if_you_fall_get_back_up/", "author_flair_text": null, "quarantine": false, "title": "If You Fall, Get Back Up!", "created_utc": 1491888881.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64ozy3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64ozy3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64ozy3", "likes": null, "replies": "", "user_reports": [], "id": "dg4ay86", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Acquin", "parent_id": "t1_dg48056", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; Published a music production website since then. First steps into business ownership.\n\nYou will need to just tank through the shit in music school. I'm not from your country but assuming it really is the best, putting down with credible proof that you graduated from that school is 50% of the business you'll need. We all have to do things we don't want to do to get somewhere. Realising that the school wasn't making you happy was a good start, but given you've still gone down the production path you HAVE to deal with it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Published a music production website since then. First steps into business ownership.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You will need to just tank through the shit in music school. I&amp;#39;m not from your country but assuming it really is the best, putting down with credible proof that you graduated from that school is 50% of the business you&amp;#39;ll need. We all have to do things we don&amp;#39;t want to do to get somewhere. Realising that the school wasn&amp;#39;t making you happy was a good start, but given you&amp;#39;ve still gone down the production path you HAVE to deal with it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg4ay86", "score_hidden": false, "stickied": false, "created": 1491948845.0, "created_utc": 1491920045.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg48056", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Wolffy93", "parent_id": "t1_dg45wq0", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "If it is, so be it then. That wasn't the intention though. However if it comes across that way, I shall own up to it; I am rationalizing my music school failures. \n\nHow I solved it personally was simple; remembering the *Why* in all of this. Getting back on course. Perhaps it would be different from someone else.\n\n\nMy Why become eroded into *\"Make money. The only thing that matters in a career, Music, Engineering, Computer Science, whatever, is money. If you aren't making money Immediately, regardless if you're a student or not, you are a Failure. You need to be making Money. \"* Needless to say, that was an incredibly toxic mindset. Incred-fucking-bly toxic... However I was 100% solidly sold and convinced on this idea that money **Is** the Be-All and End-All in everything in life. Realized that this was a huge part of the problem and absolutely seeping into other areas of life. \n\nWas putting *part* of the Result way ahead of the Process, if that makes sense. The process cannot be skipped. Lifting should be a clear as day indicator of this. Clearly it wasn't to me.\n\nNot sure of the universality of this, but since then have been allowing myself to enjoy the *Process* in all that is going on. Enjoy may not be the most accurate word here. Discipline would be a better word, perhaps. Prior to this,was completely apathetic to the result and the process as my Why did not correlate with what I wanted or what I was doing. \n\nIn the career-field, acknowledging that at least right now, or for the next few very short months, I am a student and as such the primary objective is to be learning as much as possible, continued work on craft, and continued pursuit of opportunity and creating opportunities. \n\nCreating the correct environment, mentally and physically, to allow X,Y,Z and A,B,C to get done. Regularly reminding myself to not get Too far off track. A little off track is ok. An enormous amount is also ok but becomes unnecessarily difficult to realign from there.\n\nPublished a music production website since then. First steps into business ownership. Compositionally, everything is sound in terms of music. On the technical side, Mixes need to be polished up some more, Masters need to be done, but this is all still an important step in the right direction. (Perhaps there is validity to No Action is sometimes more beneficial than Action. I don't personally see how but definitely open to that idea.)\n\nActively practicing meditation. \n\nPerhaps most importantly, have stopped comparing myself to others and simply compare myself to where I was, where I am and where I am going. Doing weekly check-ins to make sure what I am doing is still in-line with where I want to be. Got way off track and that should never happen again, so long as inventory is being done regularly. \n\nComparison is the thief of joy as they say.\n\nPerhaps this post would have added more value to the community had I waited until later. Thought that potentially someone could benefit from realizing that others, too, are going through their own individual process and that is acceptable. Too often I found myself looking at the Performance, comparing my Process to their Finished Product, and not acknowledging the hundred of hours dedicated to consistent practice, the Process, that goes into performing a 1 hour, 2 hour show. \n\n\n\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it is, so be it then. That wasn&amp;#39;t the intention though. However if it comes across that way, I shall own up to it; I am rationalizing my music school failures. &lt;/p&gt;\n\n&lt;p&gt;How I solved it personally was simple; remembering the &lt;em&gt;Why&lt;/em&gt; in all of this. Getting back on course. Perhaps it would be different from someone else.&lt;/p&gt;\n\n&lt;p&gt;My Why become eroded into &lt;em&gt;&amp;quot;Make money. The only thing that matters in a career, Music, Engineering, Computer Science, whatever, is money. If you aren&amp;#39;t making money Immediately, regardless if you&amp;#39;re a student or not, you are a Failure. You need to be making Money. &amp;quot;&lt;/em&gt; Needless to say, that was an incredibly toxic mindset. Incred-fucking-bly toxic... However I was 100% solidly sold and convinced on this idea that money &lt;strong&gt;Is&lt;/strong&gt; the Be-All and End-All in everything in life. Realized that this was a huge part of the problem and absolutely seeping into other areas of life. &lt;/p&gt;\n\n&lt;p&gt;Was putting &lt;em&gt;part&lt;/em&gt; of the Result way ahead of the Process, if that makes sense. The process cannot be skipped. Lifting should be a clear as day indicator of this. Clearly it wasn&amp;#39;t to me.&lt;/p&gt;\n\n&lt;p&gt;Not sure of the universality of this, but since then have been allowing myself to enjoy the &lt;em&gt;Process&lt;/em&gt; in all that is going on. Enjoy may not be the most accurate word here. Discipline would be a better word, perhaps. Prior to this,was completely apathetic to the result and the process as my Why did not correlate with what I wanted or what I was doing. &lt;/p&gt;\n\n&lt;p&gt;In the career-field, acknowledging that at least right now, or for the next few very short months, I am a student and as such the primary objective is to be learning as much as possible, continued work on craft, and continued pursuit of opportunity and creating opportunities. &lt;/p&gt;\n\n&lt;p&gt;Creating the correct environment, mentally and physically, to allow X,Y,Z and A,B,C to get done. Regularly reminding myself to not get Too far off track. A little off track is ok. An enormous amount is also ok but becomes unnecessarily difficult to realign from there.&lt;/p&gt;\n\n&lt;p&gt;Published a music production website since then. First steps into business ownership. Compositionally, everything is sound in terms of music. On the technical side, Mixes need to be polished up some more, Masters need to be done, but this is all still an important step in the right direction. (Perhaps there is validity to No Action is sometimes more beneficial than Action. I don&amp;#39;t personally see how but definitely open to that idea.)&lt;/p&gt;\n\n&lt;p&gt;Actively practicing meditation. &lt;/p&gt;\n\n&lt;p&gt;Perhaps most importantly, have stopped comparing myself to others and simply compare myself to where I was, where I am and where I am going. Doing weekly check-ins to make sure what I am doing is still in-line with where I want to be. Got way off track and that should never happen again, so long as inventory is being done regularly. &lt;/p&gt;\n\n&lt;p&gt;Comparison is the thief of joy as they say.&lt;/p&gt;\n\n&lt;p&gt;Perhaps this post would have added more value to the community had I waited until later. Thought that potentially someone could benefit from realizing that others, too, are going through their own individual process and that is acceptable. Too often I found myself looking at the Performance, comparing my Process to their Finished Product, and not acknowledging the hundred of hours dedicated to consistent practice, the Process, that goes into performing a 1 hour, 2 hour show. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg48056", "score_hidden": false, "stickied": false, "created": 1491944841.0, "created_utc": 1491916041.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg45wq0", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Acquin", "parent_id": "t3_64ozy3", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I honestly think a part of this article has been written to help you in rationalising your music school failures. I too, have wanted to write something like this as just before you went through what you just went through, I did too.\n\n&gt; Although studying music, making a career out of it, a huge road-block to success, or at the very least potential success, was deriving no joy from it. This has since been solved\n\nTell us how you solved it, and what you've now done since March. I don't intend to roast you but a part of the article really did trigger a BS mechanism in my head.\n\n&gt; However, I am certain someone can learn or take something from this, if not perhaps a comment will articulate this better than I can.\n\nThat's great that you made that statement. I hope to see a progress report in 6 months.", "edited": 1491912839.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I honestly think a part of this article has been written to help you in rationalising your music school failures. I too, have wanted to write something like this as just before you went through what you just went through, I did too.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Although studying music, making a career out of it, a huge road-block to success, or at the very least potential success, was deriving no joy from it. This has since been solved&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Tell us how you solved it, and what you&amp;#39;ve now done since March. I don&amp;#39;t intend to roast you but a part of the article really did trigger a BS mechanism in my head.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;However, I am certain someone can learn or take something from this, if not perhaps a comment will articulate this better than I can.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s great that you made that statement. I hope to see a progress report in 6 months.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg45wq0", "score_hidden": false, "stickied": false, "created": 1491941325.0, "created_utc": 1491912525.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64ozy3", "likes": null, "replies": "", "user_reports": [], "id": "dg56ssd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Koalasonfire", "parent_id": "t3_64ozy3", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I like the first mini-statement. I have a problem where I can't get past missed opportunities. I can get past a failure because I at least tried, but something I could have or should have done, I often have trouble moving on from those. It's best to take any lesson you can from it, and like you said, keep on, even if you are still deep down troubled for a while.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like the first mini-statement. I have a problem where I can&amp;#39;t get past missed opportunities. I can get past a failure because I at least tried, but something I could have or should have done, I often have trouble moving on from those. It&amp;#39;s best to take any lesson you can from it, and like you said, keep on, even if you are still deep down troubled for a while.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg56ssd", "score_hidden": false, "stickied": false, "created": 1491985820.0, "created_utc": 1491957020.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_64ozy3", "likes": null, "replies": "", "user_reports": [], "id": "dg4nzen", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "maybethistimeyes1", "parent_id": "t3_64ozy3", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Berklee accepts anyone who pays. You're a failure, and you will not succeed in music. Go get a welding certificate and stop trying to impress girls with non existent creative talent. Bro. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Berklee accepts anyone who pays. You&amp;#39;re a failure, and you will not succeed in music. Go get a welding certificate and stop trying to impress girls with non existent creative talent. Bro. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg4nzen", "score_hidden": false, "stickied": false, "created": 1491963377.0, "created_utc": 1491934577.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}]