[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Summary:&lt;/strong&gt; Remember to exploit the novelty effect. If you’re doing something new – do a lot of it. If you’re in a new place – approach like a crazy person.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Flow State (a.k.a. The Zone)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Flow&lt;/strong&gt; is a state of immersion, focus and enjoyment in the process of any given activity. If you&amp;#39;ve ever worked on something and lost the track of time but it was too enjoyable for you to stop or even worry about eating or drinking - you were &lt;strong&gt;in the zone&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;Daygame-wise you are in the zone when you get &lt;strong&gt;great reaction from every single girl&lt;/strong&gt;. These days happen for everyone and they are highly depended on your state and general happiness in your life. The better you are the higher the chance of hitting jackpot. And then even that bitchy girl with a scowl on her face stops, smiles and chats with you. You get a number from all the girls, you&amp;#39;re on the top.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;That state won&amp;#39;t last&lt;/strong&gt; but make a good use of it. Its value is mostly as the reference point of what&amp;#39;s possible. Treat it as a memory to hold onto when inevitably you hit the bottom. You have to realize that it&amp;#39;s not the skill that&amp;#39;s changing but your vibe. By definition, you cannot persist in flow state.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Novelty Effect&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;The &lt;strong&gt;novelty effect&lt;/strong&gt; is the observable tendency to get better results when something is changed (e.g. a new technology is rolled out at your work). It comes not from  increased skill or ability (or even the tech) but from increased interest in that particular activity.&lt;/p&gt;\n\n&lt;p&gt;Of course in daygame world the effect manifests itself when you&amp;#39;re excited by being in a new/foreign city and you approach more girls there.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s easy to confuse flow state with novelty effect. Or should I say that it&amp;#39;s easier to get into the zone when you&amp;#39;re doing new things? Whenever you&amp;#39;re doing something new (or in a new way) &lt;strong&gt;it is exciting. You cannot help that.&lt;/strong&gt; Emotions are always more intense when it&amp;#39;s not familiar. But that is not the same as flow state.&lt;/p&gt;\n\n&lt;p&gt;We all know that feeling - &lt;strong&gt;starting daygame&lt;/strong&gt;, saying your first compliments, watching how girls react for a stranger stopping them in broad daylight. Oh, those were the days. First 100-200 approaches are awesome. You don&amp;#39;t care about the results because you get good results. You feel great and it shows.&lt;/p&gt;\n\n&lt;p&gt;Then the grind starts, then you actually need to put work into all this. Novelty wears off and you&amp;#39;re back to raw, base level of your daygame skills. If you can&amp;#39;t handle your results toppling you might need a break or you&amp;#39;ll quit. You can also seek novelty elsewhere - change your usual daygame areas, star approaching two-sets or hired guns in the shopping mall. Do something new.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Daygaming While High&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;When you&amp;#39;re &lt;strong&gt;high on your successes or flow state&lt;/strong&gt; everything is easier. You seem to effortlessly get a number to almost every girl that you talk to. No matter that she&amp;#39;s engaged or even pregnant (ok, not that). The conversations are flowing nicely, the girls are really into you and you get a lot of numbers...&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;And they all flake.&lt;/strong&gt; Or most of them. You’re left with proverbial dick in your hand wondering what happened. It&amp;#39;s quite simple - you were creating a bubble of positivity around you and during the conversation girls were sucked into it. Now that you&amp;#39;re gone she&amp;#39;s left with a vague memory of a too-cool-to-be-real guy.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s why I said flow state is most useful &lt;strong&gt;as reference point&lt;/strong&gt;. It&amp;#39;s your personal &amp;quot;you can do it&amp;quot; memory. You can try to mitigate flakes by trying to remember to DHV really hard but let&amp;#39;s face it - you&amp;#39;re having too much fun. You don&amp;#39;t even realize you&amp;#39;re in the zone until it&amp;#39;s too late. But that&amp;#39;s fine.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Enjoy the flow state and &lt;strong&gt;have fun&lt;/strong&gt; with it. Moreover, remember to actually exploit the novelty effect. If you’re doing something new – do a lot of it. If you’re in a new place – approach like a crazy person. Especially if you’re on an eurojaunt.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Lessons (re)learned:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Approaching in the zone is fun but the numbers usually flake.&lt;/li&gt;\n&lt;li&gt;Novelty effect will help you but you can&amp;#39;t rely on it.&lt;/li&gt;\n&lt;li&gt;You can use it when traveling though.&lt;/li&gt;\n&lt;li&gt;Your base level of your pickup skills isn&amp;#39;t susceptible to fluctaionts. Your vibe is.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;You can find more daygame mental masturbation on my &lt;a href=\"https://tddaygame.com/blog/\"&gt;daygame blog&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**Summary:** Remember to exploit the novelty effect. If you’re doing something new – do a lot of it. If you’re in a new place – approach like a crazy person.\n\n&amp;nbsp;\n\n**Flow State (a.k.a. The Zone)**\n\n&amp;nbsp;\n\n**Flow** is a state of immersion, focus and enjoyment in the process of any given activity. If you've ever worked on something and lost the track of time but it was too enjoyable for you to stop or even worry about eating or drinking - you were **in the zone**.\n\nDaygame-wise you are in the zone when you get **great reaction from every single girl**. These days happen for everyone and they are highly depended on your state and general happiness in your life. The better you are the higher the chance of hitting jackpot. And then even that bitchy girl with a scowl on her face stops, smiles and chats with you. You get a number from all the girls, you're on the top.\n\n**That state won't last** but make a good use of it. Its value is mostly as the reference point of what's possible. Treat it as a memory to hold onto when inevitably you hit the bottom. You have to realize that it's not the skill that's changing but your vibe. By definition, you cannot persist in flow state.\n\n&amp;nbsp;\n\n**Novelty Effect**\n\n&amp;nbsp;\n\nThe **novelty effect** is the observable tendency to get better results when something is changed (e.g. a new technology is rolled out at your work). It comes not from  increased skill or ability (or even the tech) but from increased interest in that particular activity.\n\nOf course in daygame world the effect manifests itself when you're excited by being in a new/foreign city and you approach more girls there.\n\nIt's easy to confuse flow state with novelty effect. Or should I say that it's easier to get into the zone when you're doing new things? Whenever you're doing something new (or in a new way) **it is exciting. You cannot help that.** Emotions are always more intense when it's not familiar. But that is not the same as flow state.\n\nWe all know that feeling - **starting daygame**, saying your first compliments, watching how girls react for a stranger stopping them in broad daylight. Oh, those were the days. First 100-200 approaches are awesome. You don't care about the results because you get good results. You feel great and it shows.\n\nThen the grind starts, then you actually need to put work into all this. Novelty wears off and you're back to raw, base level of your daygame skills. If you can't handle your results toppling you might need a break or you'll quit. You can also seek novelty elsewhere - change your usual daygame areas, star approaching two-sets or hired guns in the shopping mall. Do something new.\n\n&amp;nbsp;\n\n**Daygaming While High**\n\n&amp;nbsp;\n\nWhen you're **high on your successes or flow state** everything is easier. You seem to effortlessly get a number to almost every girl that you talk to. No matter that she's engaged or even pregnant (ok, not that). The conversations are flowing nicely, the girls are really into you and you get a lot of numbers...\n\n**And they all flake.** Or most of them. You’re left with proverbial dick in your hand wondering what happened. It's quite simple - you were creating a bubble of positivity around you and during the conversation girls were sucked into it. Now that you're gone she's left with a vague memory of a too-cool-to-be-real guy.\n\nThat's why I said flow state is most useful **as reference point**. It's your personal \"you can do it\" memory. You can try to mitigate flakes by trying to remember to DHV really hard but let's face it - you're having too much fun. You don't even realize you're in the zone until it's too late. But that's fine.\n\n&amp;nbsp;\n\nEnjoy the flow state and **have fun** with it. Moreover, remember to actually exploit the novelty effect. If you’re doing something new – do a lot of it. If you’re in a new place – approach like a crazy person. Especially if you’re on an eurojaunt.\n\n&amp;nbsp;\n\n**Lessons (re)learned:**\n\n* Approaching in the zone is fun but the numbers usually flake.\n* Novelty effect will help you but you can't rely on it.\n* You can use it when traveling though.\n* Your base level of your pickup skills isn't susceptible to fluctaionts. Your vibe is.\n\n&amp;nbsp;\n\nYou can find more daygame mental masturbation on my [daygame blog](https://tddaygame.com/blog/).", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Red Pill Theory", "id": "64piwn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "tddaygame", "saved": false, "mod_reports": [], "name": "t3_64piwn", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": false, "link_flair_css_class": "theory", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheRedPill/comments/64piwn/flow_and_novelty_effect_in_pick_up/", "num_reports": null, "locked": false, "stickied": false, "created": 1491926576.0, "url": "https://www.reddit.com/r/TheRedPill/comments/64piwn/flow_and_novelty_effect_in_pick_up/", "author_flair_text": null, "quarantine": false, "title": "Flow And Novelty Effect in Pick Up", "created_utc": 1491897776.0, "distinguished": null, "media": null, "upvote_ratio": 0.66, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]