[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So my post isn&amp;#39;t deleted I&amp;#39;m going to preface this with - &lt;strong&gt;I do not advocate LTR&amp;#39;s. I do not advocate monogamous long term relationships. However, the value in RP is what you make of it, and I understand and appreciate many people will always want some sort of committed relationship&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;There are many of us here are in current LTR&amp;#39;s that began before we discovered TRP, and also many of us who are currently experiencing a breakup and have arrived here as a result. Many, if not most of us, have ex girlfriends in our lives, whether they are recent or old. This is geared towards newer members who have found this sub via a recent breakup, which is undoubtedly how a large majority of us found this place. This post will be discussing the following - why a long term relationship relationship fundamentally ends and the inherent impossibility of an LTR coinciding with your imperative as a man, the dynamic of the post-breakup period, why ex LTR&amp;#39;s seemingly always contact you again and how you should be thinking and behaving during all of this. &lt;/p&gt;\n\n&lt;p&gt;Hopefully by the end of this you will come around to the idea that an LTR in current society may be simply antithetical to your well-being as a man, and feel better about the confusing, helpless desperation that comes as a result of being dumped.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;A long term relationship is almost always terminated by the woman. Every long term relationship ends in the same way for the same fundamental reasons, although these reasons are usually dressed up differently and we&amp;#39;re given solipsistic platitudes such as &amp;quot;&lt;em&gt;we&amp;#39;re just at different points in our lives&lt;/em&gt;&amp;quot; &amp;quot;&lt;em&gt;it&amp;#39;s not you it&amp;#39;s me&lt;/em&gt;&amp;quot; &amp;quot;&lt;em&gt;I just don&amp;#39;t have time right now&lt;/em&gt;&amp;quot;. We must keep in mind any verbal explanation a woman gives you regarding the ending of your long term relationship is to be &lt;strong&gt;ignored&lt;/strong&gt;. She herself cannot conceptualize the real reasons she no longer wants to be with you so she cannot be blamed. She simply &lt;em&gt;feels&lt;/em&gt; in her body that she can&amp;#39;t be with you. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;An LTR ends because the woman is no longer sexually and in turn emotionally invested in you&lt;/strong&gt;. That is quite literally all there is to it. She has, over the course of weeks/months, detached herself from you in a sexual context, mentally removed you from &amp;quot;lover&amp;quot; status and has compartmentalized you into an inescapable box labeled &amp;quot;friend&amp;quot; which roughly translates to &amp;quot;genetic dead end&amp;quot; and &amp;quot;mistake&amp;quot;. I don&amp;#39;t have to explain the reasons for her detaching from you - they are all over this sub. Your inevitable betafication throughout your LTR has inadvertently revealed your true nature to her and it fundamentally disgusts her on a viscerally primal level, and is in direct opposition to her imperative to mate with &lt;em&gt;her conception&lt;/em&gt; (this is important) of an alpha male. She feels like she has been &lt;em&gt;tricked&lt;/em&gt;. For her to continue sleeping with a man who has revealed he is not the man she went into the relationship hoping he would be is antithetical to her mating strategy and core biology, and her vagina will quite literally shut down around you, despite her still &amp;quot;loving&amp;quot; you and caring for you. It is an unconscious process and once these beta traits reveal themselves to her the natural and reflexive detachment process begins irreversibly. Some rare women will continue sleeping with a man right up to the day they dump him. Usually this is her last-resort-hamster attempts to find out if she is able to &amp;quot;feel&amp;quot; anything, if she herself is the one &amp;quot;broken&amp;quot;, if maybe this time she won&amp;#39;t feel disgusted by her partner.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Up the Dosage&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;When you first enter a relationship with a woman, the blue male thought process revolves around a semblance of a projected future, along the lines of &amp;quot;&lt;em&gt;fantastic, a hot, cool girl I can settle down, relax and enjoy life with&lt;/em&gt;&amp;quot;. The female thought process is in the moment. She thinks &amp;quot;&lt;em&gt;awesome, I&amp;#39;ve got an alpha male who is making me feel so good, I&amp;#39;m so happy right now with the way I feel&lt;/em&gt;&amp;quot;, while unconsciously she is thinking - and her body is screaming at her - &amp;quot;&lt;em&gt;I need this man to continue behaving the way he is behaving right now in this moment, I need him to keep making me feel the way he is making me feel in this current moment and I need this to continue indefinitely unwaveringly&lt;/em&gt;&amp;quot;. She is not thinking in terms of the future, of the fluctuations of realistic human nature and behavior, and she can&amp;#39;t conceptualize that a man would eventually stop making her feel the way she&amp;#39;s feeling during the hook-up phase - as this is the premise on which she enters a monogamous relationship in the first place. She believes a relationship is merely a prolonged, unending flow of the same feelings she is receiving during this non-committal hook-up phase.&lt;/p&gt;\n\n&lt;p&gt;Gradually, she realizes she no longer feels the same about the situation. (&lt;em&gt;&amp;quot;I don&amp;#39;t feel the same way about you anymore, I&amp;#39;m sorry, I wish I could fix it, I don&amp;#39;t know why I feel like this&amp;quot;&lt;/em&gt;) Your promise of monogamy and it&amp;#39;s inevitable implications has tarnished your image in her eyes, and at that moment you enter into an LTR with her she is biologically wired to destroy you as unconscious punishment for removing yourself from the sexual market place and investing in her, self sacrificing and openly rejecting your own sexual imperative. You forsake your sexual imperative which is to spread your seed and fuck hundreds of women for hers - which is to lock down a strong man and sap him of resources. She recognizes, or more accurately &lt;strong&gt;feels&lt;/strong&gt; this imbalance and sacrifice on your behalf and resents you for it, in the same way she resents all other male sacrifices made on her behalf. The only difference here is that this sacrifice is one fundamental to your human nature, making it particularly abhorrent in her eyes. &lt;/p&gt;\n\n&lt;p&gt;The man you are now, a loyal, committed boyfriend with eyes only for her, is at direct odds with the fantasy of you on which she was excited to enter a relationship with you by. This confuses and disgusts her, and she is perpetually aware that your commitment to her is at odds with your imperative to fuck other women which was part of her fantasy projected onto you. &lt;/p&gt;\n\n&lt;p&gt;A woman fantasizes about taming an alpha male and taking him from the wild to make her own. This is a &lt;em&gt;fantasy&lt;/em&gt;. She does &lt;strong&gt;not&lt;/strong&gt; want this. She wants you to remain a wild beast, she needs you to remain a wild beast. The mere act of promising exclusivity and devotion to a woman is the moment her fundamental attraction for you plummets through the floor and maintains a steady downward trajectory, and you are almost immediately shifted from &amp;quot;hot mysterious lover&amp;quot; to &amp;quot;resource (time, money, attention, comfort) and possession&amp;quot;.  This is inescapable. The work required to keep one woman perpetually sexually invested in you in a monogamous relationship is in absolutely no way worth it. In my deleted LTR guide I discussed the lengths it takes to keep a woman seeing you as an untamed sexual prize while still in an LTR. It is simply &lt;em&gt;not worth it&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Your attainability and familiarity in her eyes becomes repulsive (note this is on an unconscious level and primarily felt in her vagina). Now that she has you, she no longer sees you in the same way and as i&amp;#39;ve already said - she feels tricked, deceived, cheated even. This is the moment the detachment begins and she engages in her new unconscious search for a man who can give her the feelings you were giving her during the hook-up phase of your relationship, because she believes these feelings she&amp;#39;s receiving during the hookup phase are how a relationship is supposed to feel permanently and that your inability to unwaveringly supply her with these feelings means you are unsuitable. She has limitless men available at her fingertips. A new dick and the associated heroin-like injection of rollercoaster emotion and feelings she is searching for is one text message away, one Tinder message, one FB message, one Instagram &amp;quot;like&amp;quot; away. &lt;/p&gt;\n\n&lt;p&gt;A woman is not aware of the intricacies of her sexual imperative. She (on some level) knows she has to find the strongest man possible to give her children and resources, but she doesn&amp;#39;t realize the mere act of locking this man down and having him invest in her will cause her to detach from him sexually, and she wanders through life, ending relationship after relationship in search of her fantasy ideal which culminates in a life of flings and riding the CC, or settling with a beta male post-wall, while bemoaning the lack of real men.&lt;/p&gt;\n\n&lt;p&gt;Now we understand why a relationship ends, I will discuss &lt;strong&gt;ex dynamics&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;Upon dumping you, a woman needs the emotional satisfaction of knowing that she has left you a weak, ruined man. She needs this in order to confirm her feelings that you are in fact unsuitable for her, and she needs it to give her the confidence to tentatively jump back on the CC and ride cocks knowing in the back of her mind there is a man she can derive emotional validation once the non-commital poundings of Chad start to erode her self worth. She simultaneously wants to be as far from you as humanly possible and not hear a word from you, while also needing to know that there is a man waiting for her and wanting her back. She will keep in contact with you sporadically as a means to gauge how invested you are in her and to indulge in the self-reassuring leverage of power over a male while she&amp;#39;s simultaneously being pounded into submission and degradation by Chad. She will message you months/weeks later to check up on you to make sure you&amp;#39;re still ruined and to assuage any doubts that she might&amp;#39;ve made a mistake. &lt;/p&gt;\n\n&lt;p&gt;The blue man will beg and plead, chase and stalk, call and cry. The woman feeds off of this validation and uses it to propel herself back onto the CC - she feels good about herself as she has a man pining over her, she feels worthy, she has the confidence to now fuck whoever she wants without having to feel the gaping void of emotional validation that comes with riding the cock of an unavailable Chad - because you are providing that to her. It doesn&amp;#39;t occur to her that you are in emotional turmoil as a result of her contacting you - all she needs from you is validation so she can feel comfortable in riding the CC. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve noticed exes will usually message you Sunday night or early in the week, around ~2-3 months after breakup. They&amp;#39;ll do this because they&amp;#39;ve fucked someone that weekend, are hungover, depressed and feeling bad about themselves. They use you as an emotional tool to reassure them they are still wanted and cared about, sending out &amp;quot;feeler&amp;quot; texts like &amp;quot;hey, what&amp;#39;s up&amp;quot; in hopes your response is one communicating you&amp;#39;re still hung up on them - and once they have this validation they&amp;#39;ll disappear again, ignoring any further contact, reinvigorated and ready to ride. &lt;/p&gt;\n\n&lt;p&gt;Never get back with an ex. Once a woman has terminated a relationship with you, it is irrecoverable and a relationship will never again work with this person. You will forever remain the man she ended a relationship with, which is the ultimate perversion of the natural order of male dominance and female submission. &lt;/p&gt;\n\n&lt;p&gt;No matter how alpha, how improved you become, you will forever remain the man she dumped, the man who cried over her, the man who &lt;strong&gt;she&lt;/strong&gt; decided to end things with and who she deemed unsuitable. If you become ripped and successful, she will indulge in the memory of you as a self-masturbatory mental trophy, talking about you to Chad after he&amp;#39;s blown his loud in her ass - &amp;quot;yeah, but &lt;strong&gt;I dumped him&lt;/strong&gt;, he &lt;em&gt;cried&lt;/em&gt; to me&amp;quot;. If for some bizarre reason (scarcity) you do decide to take her back, she will resent you for not only promising exclusivity again to her, but for doing so with full knowledge she ended things with you and rode strange dick. &lt;/p&gt;\n\n&lt;p&gt;The only way forward is to cut your exes out of your life. They are dead. No contact indefinitely, delete and block phone numbers, remove from social media and forget their existence. They are relics of a time long past, where you were a naive boy, and they served as  stepping stones to becoming a man. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Hopefully, if you&amp;#39;ve stayed with me, we all have an understanding of the inherent difficulties of LTR&amp;#39;s in our current societal climate. This is the truth about why LTR&amp;#39;s fail. For those of you recently dumped and hurting, destroy any glimmer of wanting your ex back by envisioning what she is actually thinking and doing right now. &lt;/p&gt;\n\n&lt;p&gt;The path to happiness is one of multiple plates who adore and worship you for following your sexual imperative and valuing yourself as a man, combined with a frame built upon stoicism, abundance, self love, and above all fundamentally existential independence.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So my post isn't deleted I'm going to preface this with - **I do not advocate LTR's. I do not advocate monogamous long term relationships. However, the value in RP is what you make of it, and I understand and appreciate many people will always want some sort of committed relationship** \n\nThere are many of us here are in current LTR's that began before we discovered TRP, and also many of us who are currently experiencing a breakup and have arrived here as a result. Many, if not most of us, have ex girlfriends in our lives, whether they are recent or old. This is geared towards newer members who have found this sub via a recent breakup, which is undoubtedly how a large majority of us found this place. This post will be discussing the following - why a long term relationship relationship fundamentally ends and the inherent impossibility of an LTR coinciding with your imperative as a man, the dynamic of the post-breakup period, why ex LTR's seemingly always contact you again and how you should be thinking and behaving during all of this. \n\nHopefully by the end of this you will come around to the idea that an LTR in current society may be simply antithetical to your well-being as a man, and feel better about the confusing, helpless desperation that comes as a result of being dumped.\n\n-------\n\nA long term relationship is almost always terminated by the woman. Every long term relationship ends in the same way for the same fundamental reasons, although these reasons are usually dressed up differently and we're given solipsistic platitudes such as \"*we're just at different points in our lives*\" \"*it's not you it's me*\" \"*I just don't have time right now*\". We must keep in mind any verbal explanation a woman gives you regarding the ending of your long term relationship is to be **ignored**. She herself cannot conceptualize the real reasons she no longer wants to be with you so she cannot be blamed. She simply *feels* in her body that she can't be with you. \n\n**An LTR ends because the woman is no longer sexually and in turn emotionally invested in you**. That is quite literally all there is to it. She has, over the course of weeks/months, detached herself from you in a sexual context, mentally removed you from \"lover\" status and has compartmentalized you into an inescapable box labeled \"friend\" which roughly translates to \"genetic dead end\" and \"mistake\". I don't have to explain the reasons for her detaching from you - they are all over this sub. Your inevitable betafication throughout your LTR has inadvertently revealed your true nature to her and it fundamentally disgusts her on a viscerally primal level, and is in direct opposition to her imperative to mate with *her conception* (this is important) of an alpha male. She feels like she has been *tricked*. For her to continue sleeping with a man who has revealed he is not the man she went into the relationship hoping he would be is antithetical to her mating strategy and core biology, and her vagina will quite literally shut down around you, despite her still \"loving\" you and caring for you. It is an unconscious process and once these beta traits reveal themselves to her the natural and reflexive detachment process begins irreversibly. Some rare women will continue sleeping with a man right up to the day they dump him. Usually this is her last-resort-hamster attempts to find out if she is able to \"feel\" anything, if she herself is the one \"broken\", if maybe this time she won't feel disgusted by her partner.\n\n**Up the Dosage**\n\nWhen you first enter a relationship with a woman, the blue male thought process revolves around a semblance of a projected future, along the lines of \"*fantastic, a hot, cool girl I can settle down, relax and enjoy life with*\". The female thought process is in the moment. She thinks \"*awesome, I've got an alpha male who is making me feel so good, I'm so happy right now with the way I feel*\", while unconsciously she is thinking - and her body is screaming at her - \"*I need this man to continue behaving the way he is behaving right now in this moment, I need him to keep making me feel the way he is making me feel in this current moment and I need this to continue indefinitely unwaveringly*\". She is not thinking in terms of the future, of the fluctuations of realistic human nature and behavior, and she can't conceptualize that a man would eventually stop making her feel the way she's feeling during the hook-up phase - as this is the premise on which she enters a monogamous relationship in the first place. She believes a relationship is merely a prolonged, unending flow of the same feelings she is receiving during this non-committal hook-up phase.\n\nGradually, she realizes she no longer feels the same about the situation. (*\"I don't feel the same way about you anymore, I'm sorry, I wish I could fix it, I don't know why I feel like this\"*) Your promise of monogamy and it's inevitable implications has tarnished your image in her eyes, and at that moment you enter into an LTR with her she is biologically wired to destroy you as unconscious punishment for removing yourself from the sexual market place and investing in her, self sacrificing and openly rejecting your own sexual imperative. You forsake your sexual imperative which is to spread your seed and fuck hundreds of women for hers - which is to lock down a strong man and sap him of resources. She recognizes, or more accurately **feels** this imbalance and sacrifice on your behalf and resents you for it, in the same way she resents all other male sacrifices made on her behalf. The only difference here is that this sacrifice is one fundamental to your human nature, making it particularly abhorrent in her eyes. \n\nThe man you are now, a loyal, committed boyfriend with eyes only for her, is at direct odds with the fantasy of you on which she was excited to enter a relationship with you by. This confuses and disgusts her, and she is perpetually aware that your commitment to her is at odds with your imperative to fuck other women which was part of her fantasy projected onto you. \n\nA woman fantasizes about taming an alpha male and taking him from the wild to make her own. This is a *fantasy*. She does **not** want this. She wants you to remain a wild beast, she needs you to remain a wild beast. The mere act of promising exclusivity and devotion to a woman is the moment her fundamental attraction for you plummets through the floor and maintains a steady downward trajectory, and you are almost immediately shifted from \"hot mysterious lover\" to \"resource (time, money, attention, comfort) and possession\".  This is inescapable. The work required to keep one woman perpetually sexually invested in you in a monogamous relationship is in absolutely no way worth it. In my deleted LTR guide I discussed the lengths it takes to keep a woman seeing you as an untamed sexual prize while still in an LTR. It is simply *not worth it*.\n\nYour attainability and familiarity in her eyes becomes repulsive (note this is on an unconscious level and primarily felt in her vagina). Now that she has you, she no longer sees you in the same way and as i've already said - she feels tricked, deceived, cheated even. This is the moment the detachment begins and she engages in her new unconscious search for a man who can give her the feelings you were giving her during the hook-up phase of your relationship, because she believes these feelings she's receiving during the hookup phase are how a relationship is supposed to feel permanently and that your inability to unwaveringly supply her with these feelings means you are unsuitable. She has limitless men available at her fingertips. A new dick and the associated heroin-like injection of rollercoaster emotion and feelings she is searching for is one text message away, one Tinder message, one FB message, one Instagram \"like\" away. \n\nA woman is not aware of the intricacies of her sexual imperative. She (on some level) knows she has to find the strongest man possible to give her children and resources, but she doesn't realize the mere act of locking this man down and having him invest in her will cause her to detach from him sexually, and she wanders through life, ending relationship after relationship in search of her fantasy ideal which culminates in a life of flings and riding the CC, or settling with a beta male post-wall, while bemoaning the lack of real men.\n\nNow we understand why a relationship ends, I will discuss **ex dynamics**. \n\nUpon dumping you, a woman needs the emotional satisfaction of knowing that she has left you a weak, ruined man. She needs this in order to confirm her feelings that you are in fact unsuitable for her, and she needs it to give her the confidence to tentatively jump back on the CC and ride cocks knowing in the back of her mind there is a man she can derive emotional validation once the non-commital poundings of Chad start to erode her self worth. She simultaneously wants to be as far from you as humanly possible and not hear a word from you, while also needing to know that there is a man waiting for her and wanting her back. She will keep in contact with you sporadically as a means to gauge how invested you are in her and to indulge in the self-reassuring leverage of power over a male while she's simultaneously being pounded into submission and degradation by Chad. She will message you months/weeks later to check up on you to make sure you're still ruined and to assuage any doubts that she might've made a mistake. \n\nThe blue man will beg and plead, chase and stalk, call and cry. The woman feeds off of this validation and uses it to propel herself back onto the CC - she feels good about herself as she has a man pining over her, she feels worthy, she has the confidence to now fuck whoever she wants without having to feel the gaping void of emotional validation that comes with riding the cock of an unavailable Chad - because you are providing that to her. It doesn't occur to her that you are in emotional turmoil as a result of her contacting you - all she needs from you is validation so she can feel comfortable in riding the CC. \n\nI've noticed exes will usually message you Sunday night or early in the week, around ~2-3 months after breakup. They'll do this because they've fucked someone that weekend, are hungover, depressed and feeling bad about themselves. They use you as an emotional tool to reassure them they are still wanted and cared about, sending out \"feeler\" texts like \"hey, what's up\" in hopes your response is one communicating you're still hung up on them - and once they have this validation they'll disappear again, ignoring any further contact, reinvigorated and ready to ride. \n\nNever get back with an ex. Once a woman has terminated a relationship with you, it is irrecoverable and a relationship will never again work with this person. You will forever remain the man she ended a relationship with, which is the ultimate perversion of the natural order of male dominance and female submission. \n\nNo matter how alpha, how improved you become, you will forever remain the man she dumped, the man who cried over her, the man who **she** decided to end things with and who she deemed unsuitable. If you become ripped and successful, she will indulge in the memory of you as a self-masturbatory mental trophy, talking about you to Chad after he's blown his loud in her ass - \"yeah, but **I dumped him**, he *cried* to me\". If for some bizarre reason (scarcity) you do decide to take her back, she will resent you for not only promising exclusivity again to her, but for doing so with full knowledge she ended things with you and rode strange dick. \n\nThe only way forward is to cut your exes out of your life. They are dead. No contact indefinitely, delete and block phone numbers, remove from social media and forget their existence. They are relics of a time long past, where you were a naive boy, and they served as  stepping stones to becoming a man. \n\n---------\n\nHopefully, if you've stayed with me, we all have an understanding of the inherent difficulties of LTR's in our current societal climate. This is the truth about why LTR's fail. For those of you recently dumped and hurting, destroy any glimmer of wanting your ex back by envisioning what she is actually thinking and doing right now. \n\nThe path to happiness is one of multiple plates who adore and worship you for following your sexual imperative and valuing yourself as a man, combined with a frame built upon stoicism, abundance, self love, and above all fundamentally existential independence.  \n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Red Pill Theory", "id": "6556hg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 449, "report_reasons": null, "author": "diomedes777", "saved": false, "mod_reports": [], "name": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": 1492095379.0, "link_flair_css_class": "theory", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheRedPill/comments/6556hg/diomedes_triple_strength_rp_guide_to_ltr_breakups/", "num_reports": null, "locked": false, "stickied": false, "created": 1492115709.0, "url": "https://www.reddit.com/r/TheRedPill/comments/6556hg/diomedes_triple_strength_rp_guide_to_ltr_breakups/", "author_flair_text": null, "quarantine": false, "title": "Diomedes' Triple Strength RP Guide To LTR Breakups and Exes", "created_utc": 1492086909.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 170, "visited": false, "subreddit_type": "public", "ups": 449}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7mqtw", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "biographie", "parent_id": "t1_dg7ihzq", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Serves as a good reminder. Reading it actually hurts. \n\nI'd think OP has experienced a lot of the things he's written about. I know I have, thus why it resonated a lot.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Serves as a good reminder. Reading it actually hurts. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d think OP has experienced a lot of the things he&amp;#39;s written about. I know I have, thus why it resonated a lot.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7mqtw", "score_hidden": false, "stickied": false, "created": 1492123152.0, "created_utc": 1492094352.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg89k78", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Knowmadik", "parent_id": "t1_dg7q663", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Please create a post based on this comment.  This needs to be expounded upon.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please create a post based on this comment.  This needs to be expounded upon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg89k78", "score_hidden": false, "stickied": false, "created": 1492148052.0, "created_utc": 1492119252.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg99ll5", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "MisfitMind00", "parent_id": "t1_dg8r0i2", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Don't trigger him with science and facts. He might die from emotional distress.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t trigger him with science and facts. He might die from emotional distress.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg99ll5", "score_hidden": false, "stickied": false, "created": 1492212169.0, "created_utc": 1492183369.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8r0i2", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "vorverk", "parent_id": "t1_dg8a5xx", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Might be a completely different scale. But according to brain scans, it uses the same brain regions, so the pain and emotions are similar. Look it up. Thats how evolution and brain works... There are master chess players that use the brain regions for face recognition to see patterns. Yeah, playing chess is nothing like looking at a face and recognising it. But to them it kinda is.", "edited": 1492146511.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Might be a completely different scale. But according to brain scans, it uses the same brain regions, so the pain and emotions are similar. Look it up. Thats how evolution and brain works... There are master chess players that use the brain regions for face recognition to see patterns. Yeah, playing chess is nothing like looking at a face and recognising it. But to them it kinda is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8r0i2", "score_hidden": false, "stickied": false, "created": 1492172423.0, "created_utc": 1492143623.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8a5xx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ThaneWestbrook", "parent_id": "t1_dg7q663", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 1, "body": "Breaking up is nothing like losing a child. Goddamn I cannot even describe how much of a retard you are.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Breaking up is nothing like losing a child. Goddamn I cannot even describe how much of a retard you are.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8a5xx", "score_hidden": false, "stickied": false, "created": 1492148808.0, "created_utc": 1492120008.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7q663", "gilded": 0, "archived": false, "score": 57, "report_reasons": null, "author": "vorverk", "parent_id": "t1_dg7ihzq", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "\"Love\" is a fucked up thing - evolution hijacked the part of the brain that was supposed to be used for [love for children](http://www.bbc.com/earth/story/20160212-the-unexpected-origin-of-love)\n\nYour brain is tricking you and your emotions that the woman you \"love\" is your child (uses the same brain regions) and it makes you do everything for your \"love\". Breaking up is as hurtful as losing a child. \nWomen can never love you the same way. They can only love their child in the same way.", "edited": 1492116442.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Love&amp;quot; is a fucked up thing - evolution hijacked the part of the brain that was supposed to be used for &lt;a href=\"http://www.bbc.com/earth/story/20160212-the-unexpected-origin-of-love\"&gt;love for children&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Your brain is tricking you and your emotions that the woman you &amp;quot;love&amp;quot; is your child (uses the same brain regions) and it makes you do everything for your &amp;quot;love&amp;quot;. Breaking up is as hurtful as losing a child. \nWomen can never love you the same way. They can only love their child in the same way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7q663", "score_hidden": false, "stickied": false, "created": 1492126914.0, "created_utc": 1492098114.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 57}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ihzq", "gilded": 0, "archived": false, "score": 108, "report_reasons": null, "author": "rudeboy4ever", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Really needed to read this. One of the hardest parts of the redpill to swallow. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Really needed to read this. One of the hardest parts of the redpill to swallow. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7ihzq", "score_hidden": false, "stickied": false, "created": 1492117708.0, "created_utc": 1492088908.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 108}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8d0du", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Hltchens", "parent_id": "t1_dg837rw", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt;It's only after we've lost everything that we're free to do anything \n\n\n&gt;I'm breaking my attachment to physical power and possessions, because only through destroying myself can I discover the greater power of my spirit.\n\n&gt;I've met God across his long walnut desk with his diplomas hanging on the wall behind him, and God asks me, \"Why?\"\nWhy did I cause so much pain?\nDidn't I realize that each of us is a sacred, unique snowflake of special unique specialness?\nCan't I see how we're all manifestations of love?\nI look at God behind his desk, taking notes on a pad, but God's got this all wrong.\nWe are not special\nWe are not crap or trash either.\nWe just are.\nWe just are, and what happens just happens.\nAnd God says, \"No, that's not right.\"\nYeah. Well. Whatever. You can't teach God anything.\n\n-fight club \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s only after we&amp;#39;ve lost everything that we&amp;#39;re free to do anything &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m breaking my attachment to physical power and possessions, because only through destroying myself can I discover the greater power of my spirit.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve met God across his long walnut desk with his diplomas hanging on the wall behind him, and God asks me, &amp;quot;Why?&amp;quot;\nWhy did I cause so much pain?\nDidn&amp;#39;t I realize that each of us is a sacred, unique snowflake of special unique specialness?\nCan&amp;#39;t I see how we&amp;#39;re all manifestations of love?\nI look at God behind his desk, taking notes on a pad, but God&amp;#39;s got this all wrong.\nWe are not special\nWe are not crap or trash either.\nWe just are.\nWe just are, and what happens just happens.\nAnd God says, &amp;quot;No, that&amp;#39;s not right.&amp;quot;\nYeah. Well. Whatever. You can&amp;#39;t teach God anything.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;-fight club &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8d0du", "score_hidden": false, "stickied": false, "created": 1492152501.0, "created_utc": 1492123701.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg837rw", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "Moonwlkr50", "parent_id": "t1_dg7wktp", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Right there with you. Got dumped, lied to and dragged through a bunch of bullshit without true closure or explanation over 2 years ago by my ex. I was depressed, needy, and lacking all confidence during the last year of dramatic bs that came with the breakup. It killed my trust and excitement in women almost entirely. Took me over a year to even try talking to women again. And now, like you, I'm in the best shape I've ever been in physically, making moves in my career, etc. But I'm still missing part of myself because of the way my ex shit on me (thankfully many of my weak qualities have gone, but a lot of good things about my personality went with them too).\n\nI think eventually I'll find the missing pieces in other things besides women. My happiness was too grounded in the status of my LTR anyway so it was probably something that needed to happen to me. It's hard to succeed in anything if you're too soft.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right there with you. Got dumped, lied to and dragged through a bunch of bullshit without true closure or explanation over 2 years ago by my ex. I was depressed, needy, and lacking all confidence during the last year of dramatic bs that came with the breakup. It killed my trust and excitement in women almost entirely. Took me over a year to even try talking to women again. And now, like you, I&amp;#39;m in the best shape I&amp;#39;ve ever been in physically, making moves in my career, etc. But I&amp;#39;m still missing part of myself because of the way my ex shit on me (thankfully many of my weak qualities have gone, but a lot of good things about my personality went with them too).&lt;/p&gt;\n\n&lt;p&gt;I think eventually I&amp;#39;ll find the missing pieces in other things besides women. My happiness was too grounded in the status of my LTR anyway so it was probably something that needed to happen to me. It&amp;#39;s hard to succeed in anything if you&amp;#39;re too soft.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg837rw", "score_hidden": false, "stickied": false, "created": 1492140853.0, "created_utc": 1492112053.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8c85x", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "kupakuma", "parent_id": "t1_dg7wktp", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "*MOTHERFOOKIN BRO HUGS*\n\nIm in the same boat. I'm in the best shape of my life, got a job with good benefits, 401k, and future plans for improvement..\n\nBut I too dont see women the same way anymore.. even the ones that seem nice and kind... I know that they take my finances as huge factor of indication of my fuckability.. i don't want to believe it, but they are all gold diggers to some degree. I have female friends that \"only hang out with guys cuz I dont get along with girls\", and as much as I want to genuinely like them, I simply cant - I know they are using other guys for validation.\n\nSometimes I slip and spew out bits of red pill theory, and I hear the same bs.\"no no no. Being a nice guy is super important, and attractive.\" All I can do is just nod and agree, while thinking to myself how completely fucked up in the head they are, because their actions tell a different story.\n\nBiology is fucked up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;MOTHERFOOKIN BRO HUGS&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Im in the same boat. I&amp;#39;m in the best shape of my life, got a job with good benefits, 401k, and future plans for improvement..&lt;/p&gt;\n\n&lt;p&gt;But I too dont see women the same way anymore.. even the ones that seem nice and kind... I know that they take my finances as huge factor of indication of my fuckability.. i don&amp;#39;t want to believe it, but they are all gold diggers to some degree. I have female friends that &amp;quot;only hang out with guys cuz I dont get along with girls&amp;quot;, and as much as I want to genuinely like them, I simply cant - I know they are using other guys for validation.&lt;/p&gt;\n\n&lt;p&gt;Sometimes I slip and spew out bits of red pill theory, and I hear the same bs.&amp;quot;no no no. Being a nice guy is super important, and attractive.&amp;quot; All I can do is just nod and agree, while thinking to myself how completely fucked up in the head they are, because their actions tell a different story.&lt;/p&gt;\n\n&lt;p&gt;Biology is fucked up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8c85x", "score_hidden": false, "stickied": false, "created": 1492151471.0, "created_utc": 1492122671.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg80u2l", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "BinaryResult", "parent_id": "t1_dg7wktp", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I feel you.  Currently in the best relationship of my life but I cant look at her the same way I looked at my wife even though she treated me like shit and my current woman worships me.  Just knowing their true nature makes it so it will never be the same as before you took the pill.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel you.  Currently in the best relationship of my life but I cant look at her the same way I looked at my wife even though she treated me like shit and my current woman worships me.  Just knowing their true nature makes it so it will never be the same as before you took the pill.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg80u2l", "score_hidden": false, "stickied": false, "created": 1492138265.0, "created_utc": 1492109465.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8xyzn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "EntangledQuarks", "parent_id": "t1_dg7wktp", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I'm right there with you man - I'm virtually in the same boat time wise. And I feel you, I don't think I could ever see a relationship the same again and truly be where I once was.\n\nI akin it to I can't fall \"in love\" again, in the blue pill definition of it. Which is probably a good thing in the long run because that definition of love is a falsehood, as we all have realized.\n\nHowever, maybe things will change as time goes on and we get older and more mature and maybe a more mature woman will come around. At this point, I just live each day to the fullest. I try to put my past behind me and keep my eyes on the future and focus on what I want out of this life. \n\nI believe you have great qualities bro. Accept the wounds of the past and learn from them, see them as a stepping stone that led you to becoming the great man you are today, because without them you never would have reached this point in your life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m right there with you man - I&amp;#39;m virtually in the same boat time wise. And I feel you, I don&amp;#39;t think I could ever see a relationship the same again and truly be where I once was.&lt;/p&gt;\n\n&lt;p&gt;I akin it to I can&amp;#39;t fall &amp;quot;in love&amp;quot; again, in the blue pill definition of it. Which is probably a good thing in the long run because that definition of love is a falsehood, as we all have realized.&lt;/p&gt;\n\n&lt;p&gt;However, maybe things will change as time goes on and we get older and more mature and maybe a more mature woman will come around. At this point, I just live each day to the fullest. I try to put my past behind me and keep my eyes on the future and focus on what I want out of this life. &lt;/p&gt;\n\n&lt;p&gt;I believe you have great qualities bro. Accept the wounds of the past and learn from them, see them as a stepping stone that led you to becoming the great man you are today, because without them you never would have reached this point in your life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8xyzn", "score_hidden": false, "stickied": false, "created": 1492189056.0, "created_utc": 1492160256.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dgctyda", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TRP_MushaShugyo", "parent_id": "t1_dgbrjc0", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Underrated comment of the year, thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Underrated comment of the year, thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgctyda", "score_hidden": false, "stickied": false, "created": 1492417982.0, "created_utc": 1492389182.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrjc0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SkorchZang", "parent_id": "t1_dg7wktp", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Nah, it won't be all that long before you get over it and have a new perspective, especially on a steady red pill diet. The \"wounds till dying day\" thing reveals itself to you as childish, self-centered nonsense and you actually begin to enjoy its comical emotional tugs. Perhaps a little like a masochist at first, but you grow way beyond that in time. It's about identity, the way you think about your own self as so special is what suffers painful changes, polishings, and improvements. That roller-coaster seems out of place to a man who's supposed to have it all figured out, but it is destiny, it is absolutely needed.\n\nThis stuff hurts bad when you don't know what to do with it, or what is happening. Ultimately it's the rocket fuel you need to exit the orbit of planet blue pill and chart your own path. Something to be genuinely grateful for and have chuckles about with your buds.", "edited": 1492323296.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah, it won&amp;#39;t be all that long before you get over it and have a new perspective, especially on a steady red pill diet. The &amp;quot;wounds till dying day&amp;quot; thing reveals itself to you as childish, self-centered nonsense and you actually begin to enjoy its comical emotional tugs. Perhaps a little like a masochist at first, but you grow way beyond that in time. It&amp;#39;s about identity, the way you think about your own self as so special is what suffers painful changes, polishings, and improvements. That roller-coaster seems out of place to a man who&amp;#39;s supposed to have it all figured out, but it is destiny, it is absolutely needed.&lt;/p&gt;\n\n&lt;p&gt;This stuff hurts bad when you don&amp;#39;t know what to do with it, or what is happening. Ultimately it&amp;#39;s the rocket fuel you need to exit the orbit of planet blue pill and chart your own path. Something to be genuinely grateful for and have chuckles about with your buds.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgbrjc0", "score_hidden": false, "stickied": false, "created": 1492351619.0, "created_utc": 1492322819.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8xlx4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dragon_Garoo", "parent_id": "t1_dg8g2w3", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Took me almost 3 years for \"The One\" to fade.  Her replacement still is a ghost that echoes.  But screw that.  I look at pics occasionally that pop up and say \"WTF was I thinking?\"  Nearly 300 lbs after she 'put on the relationship weight' and just..  not a good person.  She's riding the CC because well, they all do and adding to the sociopathic/narcissistic tendancies, coupled with a healthy dose of emotional incest from her mother, she's always going to be empty inside and seeking to fill the void with cock/pussy/orgasm and food.  Lots and lots of food.  lol.\n\nThe pain goes.  They are not anything special.  You'll be ok.  Just takes time and focus on you.  \n\nThis is a great post.  I too feel like any new \"relationships\" are just.. meh.  If you can avoid letting your heart get pulled in - and it will fucking try hard - you'll do well and realize that none of them are worth it.  None.\n\nThe hurt fades.  The bitterness fades and becomes philisophical knowledge.  Sometimes you want to slip RP facts to them and well, they just can't accept and learn.  Sent one girl to RPW and she just can't absorb it.  Want to keep me?  Remember I'm captain.  \n\nWant to keep her?  Be the Captain.  You'll slip.  You'll have bad days, weeks, troubles.  That's when you'll lose them.  Knowing it in advance gives you a bit of pre-care and balms the eventual wounds.  Plate if you must but for many here, constant plating becomes empty and seems.. pointless.  I understand that.  Smashing in yet another 20 something pussy becomes repetitive.\n\nPrediction:  When true AI comes to pass and sex dolls can be real companions...  our species is dead.  lol.", "edited": 1492159342.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Took me almost 3 years for &amp;quot;The One&amp;quot; to fade.  Her replacement still is a ghost that echoes.  But screw that.  I look at pics occasionally that pop up and say &amp;quot;WTF was I thinking?&amp;quot;  Nearly 300 lbs after she &amp;#39;put on the relationship weight&amp;#39; and just..  not a good person.  She&amp;#39;s riding the CC because well, they all do and adding to the sociopathic/narcissistic tendancies, coupled with a healthy dose of emotional incest from her mother, she&amp;#39;s always going to be empty inside and seeking to fill the void with cock/pussy/orgasm and food.  Lots and lots of food.  lol.&lt;/p&gt;\n\n&lt;p&gt;The pain goes.  They are not anything special.  You&amp;#39;ll be ok.  Just takes time and focus on you.  &lt;/p&gt;\n\n&lt;p&gt;This is a great post.  I too feel like any new &amp;quot;relationships&amp;quot; are just.. meh.  If you can avoid letting your heart get pulled in - and it will fucking try hard - you&amp;#39;ll do well and realize that none of them are worth it.  None.&lt;/p&gt;\n\n&lt;p&gt;The hurt fades.  The bitterness fades and becomes philisophical knowledge.  Sometimes you want to slip RP facts to them and well, they just can&amp;#39;t accept and learn.  Sent one girl to RPW and she just can&amp;#39;t absorb it.  Want to keep me?  Remember I&amp;#39;m captain.  &lt;/p&gt;\n\n&lt;p&gt;Want to keep her?  Be the Captain.  You&amp;#39;ll slip.  You&amp;#39;ll have bad days, weeks, troubles.  That&amp;#39;s when you&amp;#39;ll lose them.  Knowing it in advance gives you a bit of pre-care and balms the eventual wounds.  Plate if you must but for many here, constant plating becomes empty and seems.. pointless.  I understand that.  Smashing in yet another 20 something pussy becomes repetitive.&lt;/p&gt;\n\n&lt;p&gt;Prediction:  When true AI comes to pass and sex dolls can be real companions...  our species is dead.  lol.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8xlx4", "score_hidden": false, "stickied": false, "created": 1492187865.0, "created_utc": 1492159065.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8g2w3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NewTRPGuy", "parent_id": "t1_dg8fz32", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Well it's been 2 years so idk", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well it&amp;#39;s been 2 years so idk&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8g2w3", "score_hidden": false, "stickied": false, "created": 1492156603.0, "created_utc": 1492127803.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8fz32", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LOST_TALE", "parent_id": "t1_dg8fen9", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "If your blue pill in the ether, it still ends in about 2 weeks, few months your 38% to RP, and before you even discover RP you're halfway. And halfway qualifies as ''you won't be able to get back to it then''", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If your blue pill in the ether, it still ends in about 2 weeks, few months your 38% to RP, and before you even discover RP you&amp;#39;re halfway. And halfway qualifies as &amp;#39;&amp;#39;you won&amp;#39;t be able to get back to it then&amp;#39;&amp;#39;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8fz32", "score_hidden": false, "stickied": false, "created": 1492156462.0, "created_utc": 1492127662.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8fen9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NewTRPGuy", "parent_id": "t1_dg8f5ff", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Are you talking about the wounds?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you talking about the wounds?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8fen9", "score_hidden": false, "stickied": false, "created": 1492155675.0, "created_utc": 1492126875.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8f5ff", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LOST_TALE", "parent_id": "t1_dg7wktp", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Nah, they go away. give it 5 years and they'll be so gone you won't be able to get back to them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah, they go away. give it 5 years and they&amp;#39;ll be so gone you won&amp;#39;t be able to get back to them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8f5ff", "score_hidden": false, "stickied": false, "created": 1492155341.0, "created_utc": 1492126541.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8x0pg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "asongoneal", "parent_id": "t1_dg7wktp", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Jesus! Please make a post about said ordeal!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jesus! Please make a post about said ordeal!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8x0pg", "score_hidden": false, "stickied": false, "created": 1492186005.0, "created_utc": 1492157205.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7wktp", "gilded": 0, "archived": false, "score": 53, "report_reasons": null, "author": "NewTRPGuy", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Reading this piece opened up a lot of old wounds, wounds that will probably stay with me until my dying day. I totally understand where you're coming from because I was there, just over 2 years ago. It was probably the toughest time in my life and till this day I still feel like it yesterday. \n\nI may sound like a bitch for what i'm about to say, but i'm just going to come out and say it: My failed relationship completely turned me off to future prospects. I don't think I can ever be in a relationship again nor can I ever enjoy the company of another woman. I've tried, but it just doesn't feel the same anymore. I work out, i'm in the best shape of my life, I have a better job, but apart of me died in that relationship. Not just my blue pill half, but alot of my great qualities went along with it too.\n\nThank you for writing this piece. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reading this piece opened up a lot of old wounds, wounds that will probably stay with me until my dying day. I totally understand where you&amp;#39;re coming from because I was there, just over 2 years ago. It was probably the toughest time in my life and till this day I still feel like it yesterday. &lt;/p&gt;\n\n&lt;p&gt;I may sound like a bitch for what i&amp;#39;m about to say, but i&amp;#39;m just going to come out and say it: My failed relationship completely turned me off to future prospects. I don&amp;#39;t think I can ever be in a relationship again nor can I ever enjoy the company of another woman. I&amp;#39;ve tried, but it just doesn&amp;#39;t feel the same anymore. I work out, i&amp;#39;m in the best shape of my life, I have a better job, but apart of me died in that relationship. Not just my blue pill half, but alot of my great qualities went along with it too.&lt;/p&gt;\n\n&lt;p&gt;Thank you for writing this piece. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7wktp", "score_hidden": false, "stickied": false, "created": 1492133734.0, "created_utc": 1492104934.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 53}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8m1t3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RedSkeller", "parent_id": "t1_dg8b3f7", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "You nailed it, I constantly felt like I couldn't get enough sleep - and it was just the day to day stuff. Finally I came to the realization that she needed more parenting and I was going to have to be the one to do it. I just checked out at that point and started to game other women.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You nailed it, I constantly felt like I couldn&amp;#39;t get enough sleep - and it was just the day to day stuff. Finally I came to the realization that she needed more parenting and I was going to have to be the one to do it. I just checked out at that point and started to game other women.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8m1t3", "score_hidden": false, "stickied": false, "created": 1492164842.0, "created_utc": 1492136042.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8b3f7", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "JediStrikerTy", "parent_id": "t1_dg7n2pu", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The no hobbies and no friends thing absolutely wore me out. Someone who needs to be entertained daily or even weekly will ware you down to the nub. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The no hobbies and no friends thing absolutely wore me out. Someone who needs to be entertained daily or even weekly will ware you down to the nub. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8b3f7", "score_hidden": false, "stickied": false, "created": 1492149980.0, "created_utc": 1492121180.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7n2pu", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "RedSkeller", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Awesome post, even nailed the Sunday morning weekend regret texts. My last LTR ended although we were constantly having sex, which I'm still confused about, although I was very uninterested once I discovered she had no actual hobbies or genuine friends and parroted popular opinions. She banged a Chad, tried to crawl back and I played her, and eventually had an older ex take her back. Shit is a hilarious predicatable cycle. And I've learned being single is a good life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome post, even nailed the Sunday morning weekend regret texts. My last LTR ended although we were constantly having sex, which I&amp;#39;m still confused about, although I was very uninterested once I discovered she had no actual hobbies or genuine friends and parroted popular opinions. She banged a Chad, tried to crawl back and I played her, and eventually had an older ex take her back. Shit is a hilarious predicatable cycle. And I&amp;#39;ve learned being single is a good life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7n2pu", "score_hidden": false, "stickied": false, "created": 1492123531.0, "created_utc": 1492094731.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7jbby", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "diomedes777", "parent_id": "t1_dg7iydt", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Thank you. I've reworded it - I don't believe they're necessarily impossible. They are however, in my opinion, simply not worth the effort. There definitely exists women capable of LTR's, the problem is in every instance we enter one we're essentially playing poker with blindfolds over our eyes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I&amp;#39;ve reworded it - I don&amp;#39;t believe they&amp;#39;re necessarily impossible. They are however, in my opinion, simply not worth the effort. There definitely exists women capable of LTR&amp;#39;s, the problem is in every instance we enter one we&amp;#39;re essentially playing poker with blindfolds over our eyes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7jbby", "score_hidden": false, "stickied": false, "created": 1492118865.0, "created_utc": 1492090065.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7iydt", "gilded": 0, "archived": false, "score": 54, "report_reasons": null, "author": "Hillarysdilddo_2016", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Very happy to see some quality posts. Lots of shit on this sub lately. \n\nLTRs are not impossible... Maybe effectively impossible in this society but there exists a small subset of women with the right values. You will simply have a very hard time finding and vetting them. \n\nBut your analysis is spot on, regarding cutting your losses. After all you don't eat a good steak dinner after you shat it out. You move on and find another steak. \n\nGood advice regarding the post-breakup \"emotional feeler texts\" don't get caught in that trap.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very happy to see some quality posts. Lots of shit on this sub lately. &lt;/p&gt;\n\n&lt;p&gt;LTRs are not impossible... Maybe effectively impossible in this society but there exists a small subset of women with the right values. You will simply have a very hard time finding and vetting them. &lt;/p&gt;\n\n&lt;p&gt;But your analysis is spot on, regarding cutting your losses. After all you don&amp;#39;t eat a good steak dinner after you shat it out. You move on and find another steak. &lt;/p&gt;\n\n&lt;p&gt;Good advice regarding the post-breakup &amp;quot;emotional feeler texts&amp;quot; don&amp;#39;t get caught in that trap.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7iydt", "score_hidden": false, "stickied": false, "created": 1492118367.0, "created_utc": 1492089567.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 54}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8fpvj", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "healslutthrowaway1", "parent_id": "t1_dg84xl5", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Real men are feminists! ^((proceeds to fuck the anti-feminists)^)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Real men are feminists! &lt;sup&gt;(proceeds to fuck the anti-feminists&lt;/sup&gt;&lt;sup&gt;)&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8fpvj", "score_hidden": false, "stickied": false, "created": 1492156104.0, "created_utc": 1492127304.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84xl5", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "e4tshit", "parent_id": "t1_dg84dzm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "\"man up\" said the people without dicks...telling the people with dicks...what it means to have a dick. Remember, they get to tell us what is and isn't manly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;man up&amp;quot; said the people without dicks...telling the people with dicks...what it means to have a dick. Remember, they get to tell us what is and isn&amp;#39;t manly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg84xl5", "score_hidden": false, "stickied": false, "created": 1492142724.0, "created_utc": 1492113924.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84dzm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "darren559", "parent_id": "t1_dg841o7", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "  Yes, the reason I am ending it is the \"manning up\" part. Actually took me a minute after she said this and I was like \"WTF?\" I actually went beta for a second thinking \"what does she mean?\" Took me a second to throw that blue pill up real quick (emotional investment) and just throw her out and move forward in my life without the noise. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, the reason I am ending it is the &amp;quot;manning up&amp;quot; part. Actually took me a minute after she said this and I was like &amp;quot;WTF?&amp;quot; I actually went beta for a second thinking &amp;quot;what does she mean?&amp;quot; Took me a second to throw that blue pill up real quick (emotional investment) and just throw her out and move forward in my life without the noise. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg84dzm", "score_hidden": false, "stickied": false, "created": 1492142121.0, "created_utc": 1492113321.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg841o7", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "e4tshit", "parent_id": "t1_dg7u28r", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; I guess I wasn't exactly alpha in the last relationship simply because I was committed, lesson learned\n\nIt's all right there, but then they'll bitch about \"manning up\" and \"where have the good men gone\". They self sabotage then export the blame to us. I reserve the right to learn from my mistakes and this is a inconvenience to them because we're just suppose to be useful to them and their agenda. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I guess I wasn&amp;#39;t exactly alpha in the last relationship simply because I was committed, lesson learned&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s all right there, but then they&amp;#39;ll bitch about &amp;quot;manning up&amp;quot; and &amp;quot;where have the good men gone&amp;quot;. They self sabotage then export the blame to us. I reserve the right to learn from my mistakes and this is a inconvenience to them because we&amp;#39;re just suppose to be useful to them and their agenda. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg841o7", "score_hidden": false, "stickied": false, "created": 1492141748.0, "created_utc": 1492112948.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dgb3r7w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "czatara", "parent_id": "t1_dgaycaq", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I am sorry for you, but don't do or sign anything without confirming that the child is really yours and talking to a lawyer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am sorry for you, but don&amp;#39;t do or sign anything without confirming that the child is really yours and talking to a lawyer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgb3r7w", "score_hidden": false, "stickied": false, "created": 1492315645.0, "created_utc": 1492286845.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaycaq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hyper_Sonik", "parent_id": "t1_dg92w2q", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I'm in the exact boat right now. Got my high school sweetheart pregnant and after 4 months she discarded me. Now she says ONLY to contact her if its about the baby. I tried telling her it's either we're in this together or you do it all on your own. Meaning, i am willing to walk away from the entire situation including if that means never seeing my child again- not through my own choice, but through her rejection. She recently contacted me and critisized me for \"ignoring her\" even though she pushed me away. I'm very confused as to what I should do. If I should just walk away and not look back, or fight for my half of the rights to my Son. I feel like she's bluffing in a way, but if I call her bluff she will hold it against me and use it against me in the future. I don't want this fight, but it's looking like I am going to have to engage in this battle. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in the exact boat right now. Got my high school sweetheart pregnant and after 4 months she discarded me. Now she says ONLY to contact her if its about the baby. I tried telling her it&amp;#39;s either we&amp;#39;re in this together or you do it all on your own. Meaning, i am willing to walk away from the entire situation including if that means never seeing my child again- not through my own choice, but through her rejection. She recently contacted me and critisized me for &amp;quot;ignoring her&amp;quot; even though she pushed me away. I&amp;#39;m very confused as to what I should do. If I should just walk away and not look back, or fight for my half of the rights to my Son. I feel like she&amp;#39;s bluffing in a way, but if I call her bluff she will hold it against me and use it against me in the future. I don&amp;#39;t want this fight, but it&amp;#39;s looking like I am going to have to engage in this battle. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaycaq", "score_hidden": false, "stickied": false, "created": 1492308313.0, "created_utc": 1492279513.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg92w2q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "darren559", "parent_id": "t1_dg8xrcq", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": " I concur my friend. The warm fuzzys they feel from a new relationship start to fade and then it's over in their minds. I remember when the most current LTR came over when we first started dating she would clean the hell out of my place and cook me gourmet meals every fucking night. Now, I new that she was just doing this because of the heroin high that women get off of new relationships with the warm fuzzys are about to burst from within, and I took advantage of it for as long as it would last (why not, it's good to be king while it lasts). I told her that I will clean my stuff, she will clean hers, this is a fair relationship and all I ask is for her to take care of her business, and my stance will never change. She kept this up for another year, being superwoman. Cooking, cleaning, not complaining, etc.. \n\n   Well then it started to slow, hardly noticeable, but it was there if you were looking for it (red pill). Now the hedonic treadmill has taken it's course over her and the luster has wore off and she is missing those warm fuzzies she once had. The cold and distant personality had set in and I knew it was time. There is no coming back from that. No matter what you say and how right you are about anything regarding it, even if she truly hears you and agrees that the relationship is about as good as it will get from anyone, it matters not if the warm fuzzys are no longer floating around inside their body.\n\n  BTW, having kids is the best thing, but the marriage and house... well when divorce happens and you have kids then you become a slave (for real) in today's society and must hand over pretty mucn half of your net income to the ex spouse who rode the cock carousel before deciding to divorce yo in the form of alimony and child support. Not to mention that half of your income and all assetts (which she did not help accumulate) are gone. Soo.... in conclusion, consider yourself lucky. If you wanna have kids then find a women which seems as stable as possible for the kids sake, have a coulple of kids with her, DO NOT MARRY, and then know in the future that part of this deal is she will eventually take off and that you will have to pay child support, but she will not take half your assets and you will not have to pay alimony. That is about as good as it gets in today's societ.", "edited": 1492174255.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I concur my friend. The warm fuzzys they feel from a new relationship start to fade and then it&amp;#39;s over in their minds. I remember when the most current LTR came over when we first started dating she would clean the hell out of my place and cook me gourmet meals every fucking night. Now, I new that she was just doing this because of the heroin high that women get off of new relationships with the warm fuzzys are about to burst from within, and I took advantage of it for as long as it would last (why not, it&amp;#39;s good to be king while it lasts). I told her that I will clean my stuff, she will clean hers, this is a fair relationship and all I ask is for her to take care of her business, and my stance will never change. She kept this up for another year, being superwoman. Cooking, cleaning, not complaining, etc.. &lt;/p&gt;\n\n&lt;p&gt;Well then it started to slow, hardly noticeable, but it was there if you were looking for it (red pill). Now the hedonic treadmill has taken it&amp;#39;s course over her and the luster has wore off and she is missing those warm fuzzies she once had. The cold and distant personality had set in and I knew it was time. There is no coming back from that. No matter what you say and how right you are about anything regarding it, even if she truly hears you and agrees that the relationship is about as good as it will get from anyone, it matters not if the warm fuzzys are no longer floating around inside their body.&lt;/p&gt;\n\n&lt;p&gt;BTW, having kids is the best thing, but the marriage and house... well when divorce happens and you have kids then you become a slave (for real) in today&amp;#39;s society and must hand over pretty mucn half of your net income to the ex spouse who rode the cock carousel before deciding to divorce yo in the form of alimony and child support. Not to mention that half of your income and all assetts (which she did not help accumulate) are gone. Soo.... in conclusion, consider yourself lucky. If you wanna have kids then find a women which seems as stable as possible for the kids sake, have a coulple of kids with her, DO NOT MARRY, and then know in the future that part of this deal is she will eventually take off and that you will have to pay child support, but she will not take half your assets and you will not have to pay alimony. That is about as good as it gets in today&amp;#39;s societ.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg92w2q", "score_hidden": false, "stickied": false, "created": 1492202556.0, "created_utc": 1492173756.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8xrcq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dragon_Garoo", "parent_id": "t1_dg7u28r", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "3-4 years is the end of romantic love.  The feelz fade and they dry up, start looking for and actively riding the CC.  My ex LTR was pretty RP when I think about it; she even said early on \"everything ends\" she knew she wouldn't last, she just didn't know why.  I was BP enough to hope for marriage and kids and a house.  Stupid.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;3-4 years is the end of romantic love.  The feelz fade and they dry up, start looking for and actively riding the CC.  My ex LTR was pretty RP when I think about it; she even said early on &amp;quot;everything ends&amp;quot; she knew she wouldn&amp;#39;t last, she just didn&amp;#39;t know why.  I was BP enough to hope for marriage and kids and a house.  Stupid.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8xrcq", "score_hidden": false, "stickied": false, "created": 1492188352.0, "created_utc": 1492159552.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dgaxev6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hyper_Sonik", "parent_id": "t1_dg7u28r", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I fucking love you bro's. You make sense out of the pain and nonsense that women impose on us. Thank God for TRP. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I fucking love you bro&amp;#39;s. You make sense out of the pain and nonsense that women impose on us. Thank God for TRP. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaxev6", "score_hidden": false, "stickied": false, "created": 1492307060.0, "created_utc": 1492278260.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7u28r", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "darren559", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": " God damn, that was dead on accurate. I am actually getting out of a recent LTR  to see if I could get it to work knowing how women truly were after I took the redpill after my divorce four years ago, and no matter what, relationships are not meant to work in today's society. \n\n  If you are truly Alpha (current long term relationship which I am ending), they will love it in the beginning, but if you never ever change from being Alpha then they will eventually come to resent that shit because the fear of losing you will be too much and their anxiety will eventually cause them to leave you because that eats women from the inside out.\n\n  However, if you show even the slightest bit of love and commitment (old marriage),  that is the beginning of the end also. You may have it good for a month, a year, and maybe up to three years, but it will all go according how diomedes has laid it out. It's not even fucking worth it because you will be subjected to a never ending barrage of shit tests. If you decide to try to brush off the shit tests in a neutral manner to stay in a committed relationship, you will eventually be caught unaware on a bad day and fail miserably on one of the endless barrage of shit tests being thrown your way and that is all it takes.\n\n And this whole time you have been having to deal with shit tests, whether or not you are alpha or not. Also, I guess I wasn't exactly alpha in the last relationship simply because I was committed, lesson learned. Just stay away from committed relationships and have fun, life is way to short for all that noise in your life.", "edited": 1492109444.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;God damn, that was dead on accurate. I am actually getting out of a recent LTR  to see if I could get it to work knowing how women truly were after I took the redpill after my divorce four years ago, and no matter what, relationships are not meant to work in today&amp;#39;s society. &lt;/p&gt;\n\n&lt;p&gt;If you are truly Alpha (current long term relationship which I am ending), they will love it in the beginning, but if you never ever change from being Alpha then they will eventually come to resent that shit because the fear of losing you will be too much and their anxiety will eventually cause them to leave you because that eats women from the inside out.&lt;/p&gt;\n\n&lt;p&gt;However, if you show even the slightest bit of love and commitment (old marriage),  that is the beginning of the end also. You may have it good for a month, a year, and maybe up to three years, but it will all go according how diomedes has laid it out. It&amp;#39;s not even fucking worth it because you will be subjected to a never ending barrage of shit tests. If you decide to try to brush off the shit tests in a neutral manner to stay in a committed relationship, you will eventually be caught unaware on a bad day and fail miserably on one of the endless barrage of shit tests being thrown your way and that is all it takes.&lt;/p&gt;\n\n&lt;p&gt;And this whole time you have been having to deal with shit tests, whether or not you are alpha or not. Also, I guess I wasn&amp;#39;t exactly alpha in the last relationship simply because I was committed, lesson learned. Just stay away from committed relationships and have fun, life is way to short for all that noise in your life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7u28r", "score_hidden": false, "stickied": false, "created": 1492131064.0, "created_utc": 1492102264.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8iv1h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TRP_MushaShugyo", "parent_id": "t1_dg839z5", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Ha- and on your cakeday, too", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ha- and on your cakeday, too&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8iv1h", "score_hidden": false, "stickied": false, "created": 1492160420.0, "created_utc": 1492131620.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg839z5", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "e4tshit", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Felt sick while reading it. I had a new message from my ex this morning (broke up over a year ago), then I read this. It's like the universe is winking at me. This post is gold. You know how sometimes the only thing that'll make you feel better is to just puke...? When i think about the time that has elapsed and still this bitch is stabbing in the dark to see about getting a response, attention, validation, etc, it makes me realize how hard I was pigeon holed as weak in her eyes. \n\nI wish she'd stop contacting me but to ask her to stop would come off  as hurt feelings and I don't want to give her the satisfaction. OP nailed it about her only contacting you after feeling bad about getting  nailed by a random. The time on 90% of her emails to me are 7-9am. Meaning, she isn't thinking about me at 9pm when she's about to go slut it up, it's the morning after when she's hung over and taking \"plan b\". She's looking for the low hanging fruit, empty carbs. \n\nI'm ashamed of how familiar this sick feeling is but I know it helps. It's like my life is a graph of nonsense and TRP is the index that makes sense of the chaos.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Felt sick while reading it. I had a new message from my ex this morning (broke up over a year ago), then I read this. It&amp;#39;s like the universe is winking at me. This post is gold. You know how sometimes the only thing that&amp;#39;ll make you feel better is to just puke...? When i think about the time that has elapsed and still this bitch is stabbing in the dark to see about getting a response, attention, validation, etc, it makes me realize how hard I was pigeon holed as weak in her eyes. &lt;/p&gt;\n\n&lt;p&gt;I wish she&amp;#39;d stop contacting me but to ask her to stop would come off  as hurt feelings and I don&amp;#39;t want to give her the satisfaction. OP nailed it about her only contacting you after feeling bad about getting  nailed by a random. The time on 90% of her emails to me are 7-9am. Meaning, she isn&amp;#39;t thinking about me at 9pm when she&amp;#39;s about to go slut it up, it&amp;#39;s the morning after when she&amp;#39;s hung over and taking &amp;quot;plan b&amp;quot;. She&amp;#39;s looking for the low hanging fruit, empty carbs. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m ashamed of how familiar this sick feeling is but I know it helps. It&amp;#39;s like my life is a graph of nonsense and TRP is the index that makes sense of the chaos.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg839z5", "score_hidden": false, "stickied": false, "created": 1492140919.0, "created_utc": 1492112119.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7u8wy", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "judo_ftw", "parent_id": "t1_dg7jv18", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Problem is that I'd say about 1/2 of guys dumping girls is because the girls were being such bitches that they forced the break up, but didn't want to take responsibility for it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Problem is that I&amp;#39;d say about 1/2 of guys dumping girls is because the girls were being such bitches that they forced the break up, but didn&amp;#39;t want to take responsibility for it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7u8wy", "score_hidden": false, "stickied": false, "created": 1492131260.0, "created_utc": 1492102460.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg80j1m", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "troghin2", "parent_id": "t1_dg7jv18", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The saddest thing about your comment is it's true, 80% of men in where I live get dumped by the women they love, see them whore around instagram posting booty in bikini pics, parties with drinks on hand and all that.. But still get back to them if they have the chance. It's like a subtle cuckness that goes around that disgusts me in extreme levels ", "edited": 1492111846.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The saddest thing about your comment is it&amp;#39;s true, 80% of men in where I live get dumped by the women they love, see them whore around instagram posting booty in bikini pics, parties with drinks on hand and all that.. But still get back to them if they have the chance. It&amp;#39;s like a subtle cuckness that goes around that disgusts me in extreme levels &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg80j1m", "score_hidden": false, "stickied": false, "created": 1492137935.0, "created_utc": 1492109135.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7v84q", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "antariusz", "parent_id": "t1_dg7tojc", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Huh? No. \n\nYou're just arguing pedantically. \n\nI'm talking about just ghosting a girl or telling her you're just busy or something if she wants to hang out. Not \"treating her bad until she leaves you\"\n\nYou're right, he did say \"almost always\" the relationship is ended by a woman because MOST men are blue pill beta pussy faggots.\n\nI'm saying,  your goal should be to be the man she thinks about while she fucks her future husband. Your goal should be to find the next piece of ass LONG before a woman gets bored with you. If you aren't bored of her first, that means you don't have enough options, because inevitably each woman will become boring when you have enough women to pick from, and if you don't it's because your SMV isn't high enough, so you should work on that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Huh? No. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re just arguing pedantically. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m talking about just ghosting a girl or telling her you&amp;#39;re just busy or something if she wants to hang out. Not &amp;quot;treating her bad until she leaves you&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re right, he did say &amp;quot;almost always&amp;quot; the relationship is ended by a woman because MOST men are blue pill beta pussy faggots.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m saying,  your goal should be to be the man she thinks about while she fucks her future husband. Your goal should be to find the next piece of ass LONG before a woman gets bored with you. If you aren&amp;#39;t bored of her first, that means you don&amp;#39;t have enough options, because inevitably each woman will become boring when you have enough women to pick from, and if you don&amp;#39;t it&amp;#39;s because your SMV isn&amp;#39;t high enough, so you should work on that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7v84q", "score_hidden": false, "stickied": false, "created": 1492132292.0, "created_utc": 1492103492.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7tojc", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "P4_Brotagonist", "parent_id": "t1_dg7kut7", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Actually he said that they almost always do, which is true. He said that when the woman DOES end it, then it's because of what he said. He said \"this is how is goes when the woman breaks up with the man\" and then you said \"YEAH BUT I CAN ASSURE YOU THAT WHAT YOU SAID ISN'T TRUE WHEN THE MAN DOES IT,\" which he never even said was the case.  \n  \nAlso you are talking about intentionally fucking things up with a girl. If that means you start treating her badly or whatever until \"she leaves you,\" then she didn't at all leave you. She sat there wanting you but unable to stand the roller coaster finally gave up and got the fuck off, but still pined for ups and downs. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually he said that they almost always do, which is true. He said that when the woman DOES end it, then it&amp;#39;s because of what he said. He said &amp;quot;this is how is goes when the woman breaks up with the man&amp;quot; and then you said &amp;quot;YEAH BUT I CAN ASSURE YOU THAT WHAT YOU SAID ISN&amp;#39;T TRUE WHEN THE MAN DOES IT,&amp;quot; which he never even said was the case.  &lt;/p&gt;\n\n&lt;p&gt;Also you are talking about intentionally fucking things up with a girl. If that means you start treating her badly or whatever until &amp;quot;she leaves you,&amp;quot; then she didn&amp;#39;t at all leave you. She sat there wanting you but unable to stand the roller coaster finally gave up and got the fuck off, but still pined for ups and downs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7tojc", "score_hidden": false, "stickied": false, "created": 1492130659.0, "created_utc": 1492101859.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7kut7", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "antariusz", "parent_id": "t1_dg7jv18", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Yea, that was the only thing I disagree with your post. \n\nYou pretend like all relationships end because the woman loses attraction to the man.\n\nI can assure you, things play out differently when you're a man intentionally dropping your plates, to spin other, better, prospects. \n\nMy current ex, who I dated for a year and a half has text me (mostly ignored) every single day for 3 months straight, telling me how much she loves me and misses me. Other women are willingly turning themselves into FWB, only texting when they want to be ducked, doesn't matter, if you have something better (someone better) to do, it drives them crazy, ex or no. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea, that was the only thing I disagree with your post. &lt;/p&gt;\n\n&lt;p&gt;You pretend like all relationships end because the woman loses attraction to the man.&lt;/p&gt;\n\n&lt;p&gt;I can assure you, things play out differently when you&amp;#39;re a man intentionally dropping your plates, to spin other, better, prospects. &lt;/p&gt;\n\n&lt;p&gt;My current ex, who I dated for a year and a half has text me (mostly ignored) every single day for 3 months straight, telling me how much she loves me and misses me. Other women are willingly turning themselves into FWB, only texting when they want to be ducked, doesn&amp;#39;t matter, if you have something better (someone better) to do, it drives them crazy, ex or no. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7kut7", "score_hidden": false, "stickied": false, "created": 1492120883.0, "created_utc": 1492092083.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jv18", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "diomedes777", "parent_id": "t1_dg7jlsx", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The key is that you dumped them. That's all that matters. You retained frame and their attraction towards you skyrocketed as a result of you terminating the relationship. In these situations I don't really give a shit if a guy gets back with an ex he dumped, although it's still fucking stupid, this post is referring to women who dump men because that instills a dynamic that can never be recovered from. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The key is that you dumped them. That&amp;#39;s all that matters. You retained frame and their attraction towards you skyrocketed as a result of you terminating the relationship. In these situations I don&amp;#39;t really give a shit if a guy gets back with an ex he dumped, although it&amp;#39;s still fucking stupid, this post is referring to women who dump men because that instills a dynamic that can never be recovered from. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7jv18", "score_hidden": false, "stickied": false, "created": 1492119597.0, "created_utc": 1492090797.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8xw6q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dragon_Garoo", "parent_id": "t1_dg7jlsx", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "They got nexted and wanted to know they still have SMV by reaching out to you for 'the feelz' and to be one of the first stops on the new journey on the CC.  Nothing wrong with smashing them out, but very easy to get sucked back in.  Men have a huge ability to love, it's how we built society.  That protection mode shit sucks us back in.  Better to not do it.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They got nexted and wanted to know they still have SMV by reaching out to you for &amp;#39;the feelz&amp;#39; and to be one of the first stops on the new journey on the CC.  Nothing wrong with smashing them out, but very easy to get sucked back in.  Men have a huge ability to love, it&amp;#39;s how we built society.  That protection mode shit sucks us back in.  Better to not do it.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8xw6q", "score_hidden": false, "stickied": false, "created": 1492188800.0, "created_utc": 1492160000.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jlsx", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "troghin2", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "One strange thing occured to me these days.. Two exes came back wanting to talk to me, all happy and shit. Weirded me the fuck out. Seriously, even though I broke up with both, they were reaching back like really fucking submissively (\"I miss you, can I pass by your house? I'll make that massive burger you like\") and made me think they were plotting to kill me.\n\n\nI don't know, I've seen a lot of men taking back their exes.. It's just sad how lonely these guys are.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One strange thing occured to me these days.. Two exes came back wanting to talk to me, all happy and shit. Weirded me the fuck out. Seriously, even though I broke up with both, they were reaching back like really fucking submissively (&amp;quot;I miss you, can I pass by your house? I&amp;#39;ll make that massive burger you like&amp;quot;) and made me think they were plotting to kill me.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know, I&amp;#39;ve seen a lot of men taking back their exes.. It&amp;#39;s just sad how lonely these guys are.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7jlsx", "score_hidden": false, "stickied": false, "created": 1492119255.0, "created_utc": 1492090455.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7jpto", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "diomedes777", "parent_id": "t1_dg7jh1k", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I've also been in this situation with an ex LTR who was 28 and I was 24. She left me in search of stability, came back ~6 months later. Remember she is a slave to her biology. Her body is relaying scrambled messages from her rapidly ticking uterus screaming at her to find a man to provide her children while her vagina is simultaneously wanting to be dominated by a strong man. She oscillates between these two messages. She will most likely leave you and either come back due to loneliness, or find and lock down a willing BB and still come back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve also been in this situation with an ex LTR who was 28 and I was 24. She left me in search of stability, came back ~6 months later. Remember she is a slave to her biology. Her body is relaying scrambled messages from her rapidly ticking uterus screaming at her to find a man to provide her children while her vagina is simultaneously wanting to be dominated by a strong man. She oscillates between these two messages. She will most likely leave you and either come back due to loneliness, or find and lock down a willing BB and still come back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7jpto", "score_hidden": false, "stickied": false, "created": 1492119405.0, "created_utc": 1492090605.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jh1k", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "HookersAndBlow4ME", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "What about when they approach the wall, say at 28 or so?  I've noticed my alpha behavior (openly banging 22yo's) in front of my LTR is provoking her to try and jump ship.  My theory is that she is now looking for me to be her beta bucks since I'm pretty loaded.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What about when they approach the wall, say at 28 or so?  I&amp;#39;ve noticed my alpha behavior (openly banging 22yo&amp;#39;s) in front of my LTR is provoking her to try and jump ship.  My theory is that she is now looking for me to be her beta bucks since I&amp;#39;m pretty loaded.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7jh1k", "score_hidden": false, "stickied": false, "created": 1492119077.0, "created_utc": 1492090277.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg86bv0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "TRP_MushaShugyo", "parent_id": "t1_dg83qwo", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Wow, that makes a lot of sense- very interesting. Would explain why men didn't have to deal with this as much before the contraceptive pill was created.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, that makes a lot of sense- very interesting. Would explain why men didn&amp;#39;t have to deal with this as much before the contraceptive pill was created.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg86bv0", "score_hidden": false, "stickied": false, "created": 1492144264.0, "created_utc": 1492115464.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dgdszkz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hb8only", "parent_id": "t1_dg83qwo", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "it was already discussed on TRP - even biggest Chad alpha male after fucking a lot of times with a girl and using condoms, she (subconcesiously) feels that he is infertile (subcons has no idea about condoms) and she feels that she need to find a new one for fucking...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it was already discussed on TRP - even biggest Chad alpha male after fucking a lot of times with a girl and using condoms, she (subconcesiously) feels that he is infertile (subcons has no idea about condoms) and she feels that she need to find a new one for fucking...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgdszkz", "score_hidden": false, "stickied": false, "created": 1492479116.0, "created_utc": 1492450316.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg83qwo", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "iFuckedJohnOliversGF", "parent_id": "t1_dg831pi", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I've always wondered about that. Like after over a year your gf probably subconsciously hates you for not giving her a child. Even if she's still in school and doesn't want one atm.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always wondered about that. Like after over a year your gf probably subconsciously hates you for not giving her a child. Even if she&amp;#39;s still in school and doesn&amp;#39;t want one atm.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg83qwo", "score_hidden": false, "stickied": false, "created": 1492141426.0, "created_utc": 1492112626.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg831pi", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "joseph177", "parent_id": "t1_dg7o6dk", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I believe you are right about the drying up vagina; but I think it's a biological process of fucking and not getting pregnant.  Her body is having sex and not getting pregnant, time to swing to another male who is more fertile.\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I believe you are right about the drying up vagina; but I think it&amp;#39;s a biological process of fucking and not getting pregnant.  Her body is having sex and not getting pregnant, time to swing to another male who is more fertile.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg831pi", "score_hidden": false, "stickied": false, "created": 1492140668.0, "created_utc": 1492111868.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7zbuv", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "verify_account", "parent_id": "t1_dg7o6dk", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; women were created\n\nThat's not quite how evolution works, but biologically speaking bearing our offspring is their primary purpose.   \n\nIt's also interesting to note that they are the sexual selectors simply because the egg evolved to require more resources than  your sperm.  That extra stored energy came from her and that little extra amount makes her the sexual selector. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;women were created&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s not quite how evolution works, but biologically speaking bearing our offspring is their primary purpose.   &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also interesting to note that they are the sexual selectors simply because the egg evolved to require more resources than  your sperm.  That extra stored energy came from her and that little extra amount makes her the sexual selector. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7zbuv", "score_hidden": false, "stickied": false, "created": 1492136655.0, "created_utc": 1492107855.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8ad10", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "alexclarkbarry", "parent_id": "t1_dg7o6dk", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "It is evolution 101, only the strongest will survive.  Women exist to constantly test the strength of a man, making the strong even stronger while leaving the weak to wither and die.  ", "edited": 1492124675.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is evolution 101, only the strongest will survive.  Women exist to constantly test the strength of a man, making the strong even stronger while leaving the weak to wither and die.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8ad10", "score_hidden": false, "stickied": false, "created": 1492149052.0, "created_utc": 1492120252.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7o6dk", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "diomedes777", "parent_id": "t1_dg7nw46", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "It is my honest opinion that women were created purely and only to facilitate the continuation of our species through child birth and support of man. They are the polar opposite of men in every possible way which allows us to become necessarily attracted to them in order to breed. That's basically it. Their job is to support men and raise children, not to be equal, spiritual partners in a life-journey with another human, because their life experience is so diametrically opposed to ours that we can really relate to them on no other level other than that we both share the same environment. We're essentially aliens to eachother, and the reality is we have to be in order for us to be attracted to one another and create life. That's a pretty bitter pill in itself, quite liberating though I guess", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is my honest opinion that women were created purely and only to facilitate the continuation of our species through child birth and support of man. They are the polar opposite of men in every possible way which allows us to become necessarily attracted to them in order to breed. That&amp;#39;s basically it. Their job is to support men and raise children, not to be equal, spiritual partners in a life-journey with another human, because their life experience is so diametrically opposed to ours that we can really relate to them on no other level other than that we both share the same environment. We&amp;#39;re essentially aliens to eachother, and the reality is we have to be in order for us to be attracted to one another and create life. That&amp;#39;s a pretty bitter pill in itself, quite liberating though I guess&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7o6dk", "score_hidden": false, "stickied": false, "created": 1492124765.0, "created_utc": 1492095965.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dgab53o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Macomea", "parent_id": "t1_dg7nw46", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "You expect the relationship between you and woman to be just like one between you and a man. By masculine standards, a woman is 'fucked in the head'. You're blaming an apple for not being a banana. Relationships with women exist, just not for you.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You expect the relationship between you and woman to be just like one between you and a man. By masculine standards, a woman is &amp;#39;fucked in the head&amp;#39;. You&amp;#39;re blaming an apple for not being a banana. Relationships with women exist, just not for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgab53o", "score_hidden": false, "stickied": false, "created": 1492261068.0, "created_utc": 1492232268.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7nw46", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "BonelessSkinless", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I've learned relationships with women can't exist. We can fuck them and use them and that's it. They're so fucked in the head that they contradict themselves for what they want and get pleasure from emotionally crippling men. I get it now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve learned relationships with women can&amp;#39;t exist. We can fuck them and use them and that&amp;#39;s it. They&amp;#39;re so fucked in the head that they contradict themselves for what they want and get pleasure from emotionally crippling men. I get it now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7nw46", "score_hidden": false, "stickied": false, "created": 1492124449.0, "created_utc": 1492095649.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8bdbd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "readordie13", "parent_id": "t1_dg82vgx", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This is the frustrating truth... Wish there was a way to kick that thought out of exe's minds but not possible. Only thing to do is not give a fuck what they believe cause IN OUR MINDS, they are irrelevant and that's all that matters.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the frustrating truth... Wish there was a way to kick that thought out of exe&amp;#39;s minds but not possible. Only thing to do is not give a fuck what they believe cause IN OUR MINDS, they are irrelevant and that&amp;#39;s all that matters.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8bdbd", "score_hidden": false, "stickied": false, "created": 1492150334.0, "created_utc": 1492121534.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dgaut7w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CharlieMungerReader", "parent_id": "t1_dg955kx", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Her satisfaction shouldn't matter to you. If she married the hottest guy who met all her needs sexually and financially and psycologically, it's best to move on with your life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Her satisfaction shouldn&amp;#39;t matter to you. If she married the hottest guy who met all her needs sexually and financially and psycologically, it&amp;#39;s best to move on with your life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaut7w", "score_hidden": false, "stickied": false, "created": 1492303510.0, "created_utc": 1492274710.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg955kx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bunz-o-matic", "parent_id": "t1_dg82vgx", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; It will actually raise her feeling of self worth. She will look at what you have become and think \"I dumped him so I must be better than that\". Not realizing who you are now is very different to who you were then.\n\nI think about this often. It annoys the fuck out of me knowing that my ex will show pictures of me to her friends and gloat about being with me. I wish I could yank that satisfaction from her.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It will actually raise her feeling of self worth. She will look at what you have become and think &amp;quot;I dumped him so I must be better than that&amp;quot;. Not realizing who you are now is very different to who you were then.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think about this often. It annoys the fuck out of me knowing that my ex will show pictures of me to her friends and gloat about being with me. I wish I could yank that satisfaction from her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg955kx", "score_hidden": false, "stickied": false, "created": 1492206324.0, "created_utc": 1492177524.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82vgx", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "SwordfshII", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt;If you become ripped and successful, she will indulge in the memory of you as a self-masturbatory mental trophy\n\nIt will actually raise her feeling of self worth. She will look at what you have become and think \"I dumped him so I must be better than that\". Not realizing who you are now is very different to who you were then.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If you become ripped and successful, she will indulge in the memory of you as a self-masturbatory mental trophy&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It will actually raise her feeling of self worth. She will look at what you have become and think &amp;quot;I dumped him so I must be better than that&amp;quot;. Not realizing who you are now is very different to who you were then.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg82vgx", "score_hidden": false, "stickied": false, "created": 1492140480.0, "created_utc": 1492111680.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg89xre", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Knowmadik", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Excellent.  This is sidebar stuff.  It's that painful, pit in your stomach truth that needs to be read and digested by everyone in the Manosphere.\n\nYears back, before I was Red Pill,  I was in this relationship for about 2.5 years.  Sex dried up, she had lost all respect for me, all the stuff that the OP just expounded on.  She started sleeping around (cheating).  \n\nRelationship was over.  When I finally realized it I began taking steps to separate.  Immediately the sex picked up and was bonkers. \n I remember her saying, \"I don't know why but this is the best sex we've had since we first met\".  \n\nWhat I know now and didn't know then was that I was applying dread game.  I was taking steps to get out of the relationship, effectively rejecting her, and, well, there you go.\n\nOnce she loses interest, your only shot at retaining the woman is to apply dread game.  I don't recommend this however, because her true feelings (or lack thereof) towards you haven't changed, she is simply having a reaction to **rejection** which is a *female's worst possible outcome*.\n\nWhen she loses interest sexually, just get out.  It's done, it's over, it's not coming back.  Play your dread game right and you can keep her as a plate, but the LTR is over.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Excellent.  This is sidebar stuff.  It&amp;#39;s that painful, pit in your stomach truth that needs to be read and digested by everyone in the Manosphere.&lt;/p&gt;\n\n&lt;p&gt;Years back, before I was Red Pill,  I was in this relationship for about 2.5 years.  Sex dried up, she had lost all respect for me, all the stuff that the OP just expounded on.  She started sleeping around (cheating).  &lt;/p&gt;\n\n&lt;p&gt;Relationship was over.  When I finally realized it I began taking steps to separate.  Immediately the sex picked up and was bonkers. \n I remember her saying, &amp;quot;I don&amp;#39;t know why but this is the best sex we&amp;#39;ve had since we first met&amp;quot;.  &lt;/p&gt;\n\n&lt;p&gt;What I know now and didn&amp;#39;t know then was that I was applying dread game.  I was taking steps to get out of the relationship, effectively rejecting her, and, well, there you go.&lt;/p&gt;\n\n&lt;p&gt;Once she loses interest, your only shot at retaining the woman is to apply dread game.  I don&amp;#39;t recommend this however, because her true feelings (or lack thereof) towards you haven&amp;#39;t changed, she is simply having a reaction to &lt;strong&gt;rejection&lt;/strong&gt; which is a &lt;em&gt;female&amp;#39;s worst possible outcome&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;When she loses interest sexually, just get out.  It&amp;#39;s done, it&amp;#39;s over, it&amp;#39;s not coming back.  Play your dread game right and you can keep her as a plate, but the LTR is over.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg89xre", "score_hidden": false, "stickied": false, "created": 1492148522.0, "created_utc": 1492119722.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg80reh", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "aleddito", "parent_id": "t1_dg7mo5w", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Hopefully in the future you could write an even better one with more knowledge.  Or maybe someone saved it. \n\n\nThanks for sharing though! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hopefully in the future you could write an even better one with more knowledge.  Or maybe someone saved it. &lt;/p&gt;\n\n&lt;p&gt;Thanks for sharing though! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg80reh", "score_hidden": false, "stickied": false, "created": 1492138186.0, "created_utc": 1492109386.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8qnp7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Wel108", "parent_id": "t1_dg7mo5w", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I'd like to see the sir. I believe information is information, we can do with it what we please.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d like to see the sir. I believe information is information, we can do with it what we please.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8qnp7", "score_hidden": false, "stickied": false, "created": 1492171839.0, "created_utc": 1492143039.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7mo5w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "diomedes777", "parent_id": "t1_dg7l7km", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Sadly not, I stupidly didn't save it in a separate document after I posted it. Took me fucking hours too, very very stupid. :( ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sadly not, I stupidly didn&amp;#39;t save it in a separate document after I posted it. Took me fucking hours too, very very stupid. :( &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7mo5w", "score_hidden": false, "stickied": false, "created": 1492123064.0, "created_utc": 1492094264.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7l7km", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "bamfswaggy1", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Is it possible if I can get my hands on your LTR guide?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is it possible if I can get my hands on your LTR guide?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7l7km", "score_hidden": false, "stickied": false, "created": 1492121328.0, "created_utc": 1492092528.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7ti72", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "judo_ftw", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This is a problem that I keep coming back to. Most RP advice on break up and ex's seems to be aimed at relationships that straddle BP to RP. \n\nA broken plate isn't an ex. A woman you refused commitment to is well within her rights to go exclusive with someone else. There's absolutely nothing wrong with getting back with her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a problem that I keep coming back to. Most RP advice on break up and ex&amp;#39;s seems to be aimed at relationships that straddle BP to RP. &lt;/p&gt;\n\n&lt;p&gt;A broken plate isn&amp;#39;t an ex. A woman you refused commitment to is well within her rights to go exclusive with someone else. There&amp;#39;s absolutely nothing wrong with getting back with her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7ti72", "score_hidden": false, "stickied": false, "created": 1492130471.0, "created_utc": 1492101671.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7tzwi", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "epistemic_humility", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Wonderful post OP. Really summing it up and your closing paragraph is side bar worthy. I wrote it down to keep it in mind. \n\nThe plate life is really good. I've got two in one state one in another and two where I am now. \n\nI had one more up until yesterday when she made a bunch of excuses and waited for me to cry or fight for her. I just said okay and hung up. I was able to do that because of my other plates. Im not bummed or upset, I ghosted right out of it and don't plan to talk to her ever again. My most prevailing thoughts at the time were just 'damn, I need another plate now' and 'oh, this means I can spend some more time with plate x' \n\nHaha too good. I did find trp after a failed 7 year ltr, took me a solid three years to embody it and develop a harem and the attitude to run it. \n\nCheers man, keep up the writing and Thinking. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wonderful post OP. Really summing it up and your closing paragraph is side bar worthy. I wrote it down to keep it in mind. &lt;/p&gt;\n\n&lt;p&gt;The plate life is really good. I&amp;#39;ve got two in one state one in another and two where I am now. &lt;/p&gt;\n\n&lt;p&gt;I had one more up until yesterday when she made a bunch of excuses and waited for me to cry or fight for her. I just said okay and hung up. I was able to do that because of my other plates. Im not bummed or upset, I ghosted right out of it and don&amp;#39;t plan to talk to her ever again. My most prevailing thoughts at the time were just &amp;#39;damn, I need another plate now&amp;#39; and &amp;#39;oh, this means I can spend some more time with plate x&amp;#39; &lt;/p&gt;\n\n&lt;p&gt;Haha too good. I did find trp after a failed 7 year ltr, took me a solid three years to embody it and develop a harem and the attitude to run it. &lt;/p&gt;\n\n&lt;p&gt;Cheers man, keep up the writing and Thinking. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7tzwi", "score_hidden": false, "stickied": false, "created": 1492130996.0, "created_utc": 1492102196.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7ugwx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lifeisledzep", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This is precisely what happened to me a year ago. Even 3 months after we finished talking she sent out her feeler text ON A MONDAY \"Hey, what's up?\". Literally verbatim to what you said. \n\nBy that point I had decided it was time to fully swallow the red pill. I didn't have her contact but I had an idea it was her from the number. All I said was \"who's this?\" And I never responded again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is precisely what happened to me a year ago. Even 3 months after we finished talking she sent out her feeler text ON A MONDAY &amp;quot;Hey, what&amp;#39;s up?&amp;quot;. Literally verbatim to what you said. &lt;/p&gt;\n\n&lt;p&gt;By that point I had decided it was time to fully swallow the red pill. I didn&amp;#39;t have her contact but I had an idea it was her from the number. All I said was &amp;quot;who&amp;#39;s this?&amp;quot; And I never responded again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7ugwx", "score_hidden": false, "stickied": false, "created": 1492131491.0, "created_utc": 1492102691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8ewdw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "freedominlight2", "parent_id": "t1_dg7tujs", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "She doesn't fight off anything. You are the one who creates the environment where those things are secondary to your own agency. What it boils down to is a woman choosing to submit to a frame. The world's, her own or yours.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She doesn&amp;#39;t fight off anything. You are the one who creates the environment where those things are secondary to your own agency. What it boils down to is a woman choosing to submit to a frame. The world&amp;#39;s, her own or yours.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8ewdw", "score_hidden": false, "stickied": false, "created": 1492155026.0, "created_utc": 1492126226.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7tujs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "P4_Brotagonist", "parent_id": "t1_dg7odts", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt;  Stop looking to the woman's natural inclinations and the world's toxic conditioning as the final authority.\n\n\"Stop looking at what a woman does biologically as well as what society tells her to do which both happen to align to say the same exact thing.\"  \n  \nDo you even realize how silly that sounds? Logic and reason should be a strong suit, and if you are hedging your bets on a woman fighting off both her natural desires AND what everything around her tells her, then either you are somewhat foolish or I want your luck for the lottery. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Stop looking to the woman&amp;#39;s natural inclinations and the world&amp;#39;s toxic conditioning as the final authority.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;quot;Stop looking at what a woman does biologically as well as what society tells her to do which both happen to align to say the same exact thing.&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;Do you even realize how silly that sounds? Logic and reason should be a strong suit, and if you are hedging your bets on a woman fighting off both her natural desires AND what everything around her tells her, then either you are somewhat foolish or I want your luck for the lottery. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7tujs", "score_hidden": false, "stickied": false, "created": 1492130838.0, "created_utc": 1492102038.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7odts", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "freedominlight2", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The emotional roller coasters don't have to be that extreme to sustain attraction. What you are desiring is someone's obsession, attained by manipulating negative feelings. Of course things will come crashing down when she realises you're not actually a god. \n\nYou are still a man, the most powerful agent of change on the planet. Maintaining  the love, desire and respect of one woman is not so difficult. Stop looking to the woman's natural inclinations and the world's toxic conditioning as the final authority. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The emotional roller coasters don&amp;#39;t have to be that extreme to sustain attraction. What you are desiring is someone&amp;#39;s obsession, attained by manipulating negative feelings. Of course things will come crashing down when she realises you&amp;#39;re not actually a god. &lt;/p&gt;\n\n&lt;p&gt;You are still a man, the most powerful agent of change on the planet. Maintaining  the love, desire and respect of one woman is not so difficult. Stop looking to the woman&amp;#39;s natural inclinations and the world&amp;#39;s toxic conditioning as the final authority. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7odts", "score_hidden": false, "stickied": false, "created": 1492124990.0, "created_utc": 1492096190.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8y4gr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Dragon_Garoo", "parent_id": "t1_dg83y3m", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "AWALT.  Not just married types.  Every woman you've ever been with is keeping orbiters and looking to ride the CC.  It just is.  It's one of the reasons you never want to creep their phone/socmed, etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;AWALT.  Not just married types.  Every woman you&amp;#39;ve ever been with is keeping orbiters and looking to ride the CC.  It just is.  It&amp;#39;s one of the reasons you never want to creep their phone/socmed, etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8y4gr", "score_hidden": false, "stickied": false, "created": 1492189553.0, "created_utc": 1492160753.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg83y3m", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Docbear64", "parent_id": "t1_dg82l2h", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Funny enough the married ones I've been with  in non-polyamorous relationships respond to personal ads .  Most of them browse sexual personals \" just for kicks and giggles\" or because it \" helps with the boredom\" they \" never do this\" but somehow decide that I'm special enough to respond to .   \n  \nYou're right though married women  are the most aggressive and least subtle kind of woman and it's because the husbands security allows them to be there is no real rejection situation  for them . A mom whose at home and bored 75% of the time watching kids or older is just begging for someone ... anyone   to think of her as a dirty little slut (except her husband apparently).   Once she cums she can go back home and put on her wholesome  mom costume again .", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Funny enough the married ones I&amp;#39;ve been with  in non-polyamorous relationships respond to personal ads .  Most of them browse sexual personals &amp;quot; just for kicks and giggles&amp;quot; or because it &amp;quot; helps with the boredom&amp;quot; they &amp;quot; never do this&amp;quot; but somehow decide that I&amp;#39;m special enough to respond to .   &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re right though married women  are the most aggressive and least subtle kind of woman and it&amp;#39;s because the husbands security allows them to be there is no real rejection situation  for them . A mom whose at home and bored 75% of the time watching kids or older is just begging for someone ... anyone   to think of her as a dirty little slut (except her husband apparently).   Once she cums she can go back home and put on her wholesome  mom costume again .&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg83y3m", "score_hidden": false, "stickied": false, "created": 1492141640.0, "created_utc": 1492112840.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82l2h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "newls", "parent_id": "t1_dg80ppm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; The most scarring moment for me thus far after encountering this sub was sleeping with married women . \n\nI'd be interested to hear how you'd do this. I'd guess it's just the same as building attraction, and I have heard it is actually easier than seducing single women or women with boyfriends.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The most scarring moment for me thus far after encountering this sub was sleeping with married women . &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;d be interested to hear how you&amp;#39;d do this. I&amp;#39;d guess it&amp;#39;s just the same as building attraction, and I have heard it is actually easier than seducing single women or women with boyfriends.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg82l2h", "score_hidden": false, "stickied": false, "created": 1492140167.0, "created_utc": 1492111367.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg80ppm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Docbear64", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt;Your attainability and familiarity in her eyes becomes repulsive (note this is on an unconscious level and primarily felt in her vagina). Now that she has you, she no longer sees you in the same way and as i've already said - she feels tricked, deceived, cheated even. This is the moment the detachment begins and she engages in her new unconscious search for a man who can give her the feelings you were giving her during the hook-up phase of your relationship, because she believes these feelings she's receiving during the hookup phase are how a relationship is supposed to feel permanently and that your inability to unwaveringly supply her with these feelings means you are unsuitable. \n  \n The most scarring moment for me thus far after encountering this sub was sleeping with married women . I had fun with them , they were absolute whores and excited about it , however   hearing them talk abut the men that they'd been with 10+ years , had children with , a home, and  who basically pledged to love and cherish them forever was mind blowing . Maybe its not all married cheating women but the ones I have experienced seemed to hate their husbands.  I can't help but think that if I found a chick who I legitimately liked  , developed feelings for , and then proposed to and that In let's say 15 years she could be talking shit to some young kid who just wanted to get his dick wet the wait the way these women talked to me .  \n  \nGreat post and definitely a solemn reminder about the reality of our current Sexual marketplace in terms of relationships.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Your attainability and familiarity in her eyes becomes repulsive (note this is on an unconscious level and primarily felt in her vagina). Now that she has you, she no longer sees you in the same way and as i&amp;#39;ve already said - she feels tricked, deceived, cheated even. This is the moment the detachment begins and she engages in her new unconscious search for a man who can give her the feelings you were giving her during the hook-up phase of your relationship, because she believes these feelings she&amp;#39;s receiving during the hookup phase are how a relationship is supposed to feel permanently and that your inability to unwaveringly supply her with these feelings means you are unsuitable. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The most scarring moment for me thus far after encountering this sub was sleeping with married women . I had fun with them , they were absolute whores and excited about it , however   hearing them talk abut the men that they&amp;#39;d been with 10+ years , had children with , a home, and  who basically pledged to love and cherish them forever was mind blowing . Maybe its not all married cheating women but the ones I have experienced seemed to hate their husbands.  I can&amp;#39;t help but think that if I found a chick who I legitimately liked  , developed feelings for , and then proposed to and that In let&amp;#39;s say 15 years she could be talking shit to some young kid who just wanted to get his dick wet the wait the way these women talked to me .  &lt;/p&gt;\n\n&lt;p&gt;Great post and definitely a solemn reminder about the reality of our current Sexual marketplace in terms of relationships.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg80ppm", "score_hidden": false, "stickied": false, "created": 1492138136.0, "created_utc": 1492109336.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg84a37", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DevilSaintDevil", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Wouldn't it be nice. . .  But if you have kids, it isn't possible to walk away completely and never have to talk to or deal with the ex again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wouldn&amp;#39;t it be nice. . .  But if you have kids, it isn&amp;#39;t possible to walk away completely and never have to talk to or deal with the ex again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg84a37", "score_hidden": false, "stickied": false, "created": 1492142005.0, "created_utc": 1492113205.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg859kx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sd4c", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Phenomenal post.  Any advice on what to do if you want kids?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Phenomenal post.  Any advice on what to do if you want kids?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg859kx", "score_hidden": false, "stickied": false, "created": 1492143093.0, "created_utc": 1492114293.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8ag7i", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TRPmc117", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; A long term relationship is almost always terminated by the woman.\n\nThis is something that pops up in TRP a lot, but it's an exaggeration. I know plenty of guys who have been the one to break up with the girl (myself included). I broke up with my oneitis and it was insanely difficult to deal with. It's how I ended up here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;A long term relationship is almost always terminated by the woman.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is something that pops up in TRP a lot, but it&amp;#39;s an exaggeration. I know plenty of guys who have been the one to break up with the girl (myself included). I broke up with my oneitis and it was insanely difficult to deal with. It&amp;#39;s how I ended up here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8ag7i", "score_hidden": false, "stickied": false, "created": 1492149164.0, "created_utc": 1492120364.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8p5eb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Synzael", "parent_id": "t1_dg8bc8q", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "You don't want to say that. It's perfectly fine to relegate a girl to purely Fwb status after its over. However you don't say it explicitly. You make it known with your actions, and refuse any verbal/emotional actions of recommitment. This guide is fine for most guys, but truly red pill guys that can go back to spinning a few quality plates on a dime can safely relegate an LTR to FWB status as long as they hold frame and make it clear she's the one that fucked up her chances of future exclusive commitment with you. But not with your words, by your actions", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t want to say that. It&amp;#39;s perfectly fine to relegate a girl to purely Fwb status after its over. However you don&amp;#39;t say it explicitly. You make it known with your actions, and refuse any verbal/emotional actions of recommitment. This guide is fine for most guys, but truly red pill guys that can go back to spinning a few quality plates on a dime can safely relegate an LTR to FWB status as long as they hold frame and make it clear she&amp;#39;s the one that fucked up her chances of future exclusive commitment with you. But not with your words, by your actions&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8p5eb", "score_hidden": false, "stickied": false, "created": 1492169410.0, "created_utc": 1492140610.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8y76l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dragon_Garoo", "parent_id": "t1_dg8bc8q", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Ignore it... or... wait a long time and say \"been pretty busy.\"  But just know she just fucked or got dumped by a chad and is looking for validation by toying with your emotions again.  Easier to not answer if your weak for her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ignore it... or... wait a long time and say &amp;quot;been pretty busy.&amp;quot;  But just know she just fucked or got dumped by a chad and is looking for validation by toying with your emotions again.  Easier to not answer if your weak for her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8y76l", "score_hidden": false, "stickied": false, "created": 1492189801.0, "created_utc": 1492161001.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8bc8q", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ads464", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "How should you respond to this feeler text? \n\nWhen an ex contacted me I just responded with 'unless you want to fuck I'm not interested' \n\nOr should I just leave it (no contact ever again). New redpiller here. Thank you ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How should you respond to this feeler text? &lt;/p&gt;\n\n&lt;p&gt;When an ex contacted me I just responded with &amp;#39;unless you want to fuck I&amp;#39;m not interested&amp;#39; &lt;/p&gt;\n\n&lt;p&gt;Or should I just leave it (no contact ever again). New redpiller here. Thank you &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8bc8q", "score_hidden": false, "stickied": false, "created": 1492150297.0, "created_utc": 1492121497.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dgc0ze6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "waking-life", "parent_id": "t1_dg8c6c0", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Yes, she absolutely still gets validation. Delete **and** block.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, she absolutely still gets validation. Delete &lt;strong&gt;and&lt;/strong&gt; block.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgc0ze6", "score_hidden": false, "stickied": false, "created": 1492378313.0, "created_utc": 1492349513.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8c6c0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "readordie13", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Great post, Needed to read this. Had a relationship end at her will with the reasoning of \"we have different lifestyles\" and \"I thought I was ready but I'm realizing I am not\". So I move on and not talk to her then 2 weeks later I get the \"I miss you\" and \"Its hard going from talking to someone all the time and then no communication\" messages. We started talking/hanging out again and she kept giving me mixed signals. Very flirty and touchy when we hung out. We didn't have sex but slept in the same twin size bed for God's sake. I realized she was only doing this to try and keep me wrapped around her finger as an orbiter for emotional validation and support. Ended up texting her something along the lines of \"Our time together was fun and I learned a lot however I don't see you in my life outside of a relationship. Wish you all the best in life. Goodbye.\" She ended up reacting like a child cause my ass wasn't about talking her through the countless future Chad's that treat her like shit. Unfollowed me off most social media and all that Jazz. I still follow her on stuff cause I'm not petty and I just don't care. Just curious on peoples thoughts, do you think she still gets validation if you follow her but not interact with any of her content? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post, Needed to read this. Had a relationship end at her will with the reasoning of &amp;quot;we have different lifestyles&amp;quot; and &amp;quot;I thought I was ready but I&amp;#39;m realizing I am not&amp;quot;. So I move on and not talk to her then 2 weeks later I get the &amp;quot;I miss you&amp;quot; and &amp;quot;Its hard going from talking to someone all the time and then no communication&amp;quot; messages. We started talking/hanging out again and she kept giving me mixed signals. Very flirty and touchy when we hung out. We didn&amp;#39;t have sex but slept in the same twin size bed for God&amp;#39;s sake. I realized she was only doing this to try and keep me wrapped around her finger as an orbiter for emotional validation and support. Ended up texting her something along the lines of &amp;quot;Our time together was fun and I learned a lot however I don&amp;#39;t see you in my life outside of a relationship. Wish you all the best in life. Goodbye.&amp;quot; She ended up reacting like a child cause my ass wasn&amp;#39;t about talking her through the countless future Chad&amp;#39;s that treat her like shit. Unfollowed me off most social media and all that Jazz. I still follow her on stuff cause I&amp;#39;m not petty and I just don&amp;#39;t care. Just curious on peoples thoughts, do you think she still gets validation if you follow her but not interact with any of her content? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8c6c0", "score_hidden": false, "stickied": false, "created": 1492151403.0, "created_utc": 1492122603.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7u1ta", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "askmrcia", "parent_id": "t1_dg7kgoh", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Non monogamous has plenty of differences. You're not losing much when things end unlike a monogamous relationship. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Non monogamous has plenty of differences. You&amp;#39;re not losing much when things end unlike a monogamous relationship. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7u1ta", "score_hidden": false, "stickied": false, "created": 1492131051.0, "created_utc": 1492102251.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7kgoh", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "gothem_ffaja", "parent_id": "t1_dg7iwht", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Sure. I agree with you.\nRelationships just fail, brake, fade whatever...\nBut maybe it's just an illusion and dream we pursue, that there is a chance to have a life - time or at least very longlasting and satisfying romantic relationship. \n Otherwise non-monogamous relationship concepts would work like charm. But they usually end nearly the same way. \n Maybe the whole thing we need to acknowledge, that there is no eternal relationship and it will end at some point.  ", "edited": 1492091893.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure. I agree with you.\nRelationships just fail, brake, fade whatever...\nBut maybe it&amp;#39;s just an illusion and dream we pursue, that there is a chance to have a life - time or at least very longlasting and satisfying romantic relationship. \n Otherwise non-monogamous relationship concepts would work like charm. But they usually end nearly the same way. \n Maybe the whole thing we need to acknowledge, that there is no eternal relationship and it will end at some point.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7kgoh", "score_hidden": false, "stickied": false, "created": 1492120378.0, "created_utc": 1492091578.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg80a5s", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "derektwerd", "parent_id": "t1_dg7iwht", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I was in japan for the last 3 months and every one of the girls i was with knew I was leaving and knew I was seeing other girls (maybe not overtly) and there was definitely emotions involved. I thoroughly enjoyed my time with each of them but I never intended to make any commitment to them and they knew it.\n\nMy point is I agree with you. Non committed doesn't mean emotionless. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was in japan for the last 3 months and every one of the girls i was with knew I was leaving and knew I was seeing other girls (maybe not overtly) and there was definitely emotions involved. I thoroughly enjoyed my time with each of them but I never intended to make any commitment to them and they knew it.&lt;/p&gt;\n\n&lt;p&gt;My point is I agree with you. Non committed doesn&amp;#39;t mean emotionless. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg80a5s", "score_hidden": false, "stickied": false, "created": 1492137672.0, "created_utc": 1492108872.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7iwht", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "diomedes777", "parent_id": "t1_dg7iixn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The proof is in every failed monogamous relationship, every sex-less marriage, every man strung along by an ex girlfriend, every man driven to insanity after a breakup who can't understand why his girlfriend seems to feel nothing for him anymore, every man feeling a gnawing of existential uneasiness when he's taking unending shit from his LTR who hasn't blown him in months, who's feeling anxious knowing he's built his entire life around this relationship and he's caught her messaging another guy months after they've bought a house together. The proof is everywhere my friend. \n\nNon-monogamy doesn't mean emotionally-void relationships. It means loving women for what they fundamentally are and can provide you without the investment, without the stress and without the feeling of \"this is not right\" that, I dunno about you, accompanies me in every single committed monogamous relationship I've ever had. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The proof is in every failed monogamous relationship, every sex-less marriage, every man strung along by an ex girlfriend, every man driven to insanity after a breakup who can&amp;#39;t understand why his girlfriend seems to feel nothing for him anymore, every man feeling a gnawing of existential uneasiness when he&amp;#39;s taking unending shit from his LTR who hasn&amp;#39;t blown him in months, who&amp;#39;s feeling anxious knowing he&amp;#39;s built his entire life around this relationship and he&amp;#39;s caught her messaging another guy months after they&amp;#39;ve bought a house together. The proof is everywhere my friend. &lt;/p&gt;\n\n&lt;p&gt;Non-monogamy doesn&amp;#39;t mean emotionally-void relationships. It means loving women for what they fundamentally are and can provide you without the investment, without the stress and without the feeling of &amp;quot;this is not right&amp;quot; that, I dunno about you, accompanies me in every single committed monogamous relationship I&amp;#39;ve ever had. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7iwht", "score_hidden": false, "stickied": false, "created": 1492118294.0, "created_utc": 1492089494.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7lqe2", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Metalgear222", "parent_id": "t1_dg7jfo2", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Couldn't of said it better. Low investment plates are where a man's happiness with women lies.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Couldn&amp;#39;t of said it better. Low investment plates are where a man&amp;#39;s happiness with women lies.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7lqe2", "score_hidden": false, "stickied": false, "created": 1492121964.0, "created_utc": 1492093164.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7u4oi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "judo_ftw", "parent_id": "t1_dg7jfo2", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Going to my other comment, do you ever get back with casual plates? Isn't that a totally different paradigm? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Going to my other comment, do you ever get back with casual plates? Isn&amp;#39;t that a totally different paradigm? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7u4oi", "score_hidden": false, "stickied": false, "created": 1492131135.0, "created_utc": 1492102335.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7knpq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gothem_ffaja", "parent_id": "t1_dg7jfo2", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Well, i guess we are talking about different definitions of plate. \nFor me a plate is a sex-only relationship. If friendship or feels occure it's a FWB for me, which i agree, can be a wonderful thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, i guess we are talking about different definitions of plate. \nFor me a plate is a sex-only relationship. If friendship or feels occure it&amp;#39;s a FWB for me, which i agree, can be a wonderful thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7knpq", "score_hidden": false, "stickied": false, "created": 1492120626.0, "created_utc": 1492091826.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jfo2", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "diomedes777", "parent_id": "t1_dg7j0r4", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I'm in the  same boat - Currently have a three year plate who worships me. I have been crystal clear on my stance on monogamy and she is fine with it. I have derived the most positive experiences I've ever had with a woman from this girl, and every LTR i've ever had simply pales in comparison to the happiness I get from casual plates. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in the  same boat - Currently have a three year plate who worships me. I have been crystal clear on my stance on monogamy and she is fine with it. I have derived the most positive experiences I&amp;#39;ve ever had with a woman from this girl, and every LTR i&amp;#39;ve ever had simply pales in comparison to the happiness I get from casual plates. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7jfo2", "score_hidden": false, "stickied": false, "created": 1492119027.0, "created_utc": 1492090227.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7j0r4", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Metalgear222", "parent_id": "t1_dg7iixn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; A non-monogamous relationship is just as doomed, as a monogamous. Eather it works, or it doesn't.\n\nSpoken like someone who doesn't know. I've had a sex-only plate for over 2 n a half years now that is still strong as ever. We have a great relationship but I keep her advances on my commitment checked.\n\nI've also been in LTR's and experienced firsthand the distaste that grows stronger in them every day just because of the comfortability that you've \"chosen\" her. \n\nOP is spot on.. once you've LTR'd, you've removed yourself from mysterious lover to provider status.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;A non-monogamous relationship is just as doomed, as a monogamous. Eather it works, or it doesn&amp;#39;t.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Spoken like someone who doesn&amp;#39;t know. I&amp;#39;ve had a sex-only plate for over 2 n a half years now that is still strong as ever. We have a great relationship but I keep her advances on my commitment checked.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve also been in LTR&amp;#39;s and experienced firsthand the distaste that grows stronger in them every day just because of the comfortability that you&amp;#39;ve &amp;quot;chosen&amp;quot; her. &lt;/p&gt;\n\n&lt;p&gt;OP is spot on.. once you&amp;#39;ve LTR&amp;#39;d, you&amp;#39;ve removed yourself from mysterious lover to provider status.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7j0r4", "score_hidden": false, "stickied": false, "created": 1492118461.0, "created_utc": 1492089661.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7si9o", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Kommanderdude", "parent_id": "t1_dg7iixn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "In the US there is. The courts in this country are setup to ass rape a man for everything he has if he gets divorced. So there is reason to fear marriage for the modern man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the US there is. The courts in this country are setup to ass rape a man for everything he has if he gets divorced. So there is reason to fear marriage for the modern man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7si9o", "score_hidden": false, "stickied": false, "created": 1492129399.0, "created_utc": 1492100599.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7iixn", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "gothem_ffaja", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Some points are good. \nBut sounds very dogmatic to me.\nStatements proclamated as laws without any proof. \nOf course there is some kind of dynamic and pattern in gender relationships determined by our reptile/ape brain parts. But humans are also evolutionary gifted with a neocortex, which allows us to behave much more complex in terms of mating.\nSure, it's easy to follow easy laws like:\nNever get back with an ex, never enter a monogamous relationship, Next for  every little misbehaviour yada yada...\nA non-monogamous relationship is just as doomed, as a monogamous. Eather it works, or it doesn't.\nHaving only shallow sex- based relationships only is a fear - mindset IMHO. \nIf you don't build you life on this relationship, if you are independent and enter the relationship knowing, that it will end someday eather thru death or brake up,there is really no reason to fear LTR.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some points are good. \nBut sounds very dogmatic to me.\nStatements proclamated as laws without any proof. \nOf course there is some kind of dynamic and pattern in gender relationships determined by our reptile/ape brain parts. But humans are also evolutionary gifted with a neocortex, which allows us to behave much more complex in terms of mating.\nSure, it&amp;#39;s easy to follow easy laws like:\nNever get back with an ex, never enter a monogamous relationship, Next for  every little misbehaviour yada yada...\nA non-monogamous relationship is just as doomed, as a monogamous. Eather it works, or it doesn&amp;#39;t.\nHaving only shallow sex- based relationships only is a fear - mindset IMHO. \nIf you don&amp;#39;t build you life on this relationship, if you are independent and enter the relationship knowing, that it will end someday eather thru death or brake up,there is really no reason to fear LTR.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7iixn", "score_hidden": false, "stickied": false, "created": 1492117746.0, "created_utc": 1492088946.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7i6b3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "funfitguyb", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Haha seems to reflect exactly what happened to me a year ago. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha seems to reflect exactly what happened to me a year ago. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7i6b3", "score_hidden": false, "stickied": false, "created": 1492117221.0, "created_utc": 1492088421.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8f8v8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sd4c", "parent_id": "t1_dg7ofeh", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This is why LTRs are like using Game on Hard Mode.  You have to be \"on\", 24/7.  It's important for a guy in a RL to be away from his woman (overnight) a couple times a month- keeping the dread alive = keeping the panties wet", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is why LTRs are like using Game on Hard Mode.  You have to be &amp;quot;on&amp;quot;, 24/7.  It&amp;#39;s important for a guy in a RL to be away from his woman (overnight) a couple times a month- keeping the dread alive = keeping the panties wet&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8f8v8", "score_hidden": false, "stickied": false, "created": 1492155466.0, "created_utc": 1492126666.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ofeh", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "diomedes777", "parent_id": "t1_dg7o4kv", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "It's literally felt in her vagina. Familiarity and accessibility breeds contempt in human relationships. You essentially become familiarized and viewed as literal family to her. Women constantly talk about not even viewing their husbands or boyfriends as sexual prospects, \"he's become like family\", the thought of even touching him repulses her. She wouldn't fuck her dad so why would she fuck you? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s literally felt in her vagina. Familiarity and accessibility breeds contempt in human relationships. You essentially become familiarized and viewed as literal family to her. Women constantly talk about not even viewing their husbands or boyfriends as sexual prospects, &amp;quot;he&amp;#39;s become like family&amp;quot;, the thought of even touching him repulses her. She wouldn&amp;#39;t fuck her dad so why would she fuck you? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7ofeh", "score_hidden": false, "stickied": false, "created": 1492125040.0, "created_utc": 1492096240.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7o4kv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TRP_MushaShugyo", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt;Your attainability and familiarity in her eyes becomes repulsive (note this is on an unconscious level and primarily felt in her vagina).\n\nIs this literally felt in her vagina, or a metaphor?\n&amp;nbsp;\n\nAmazing post, btw. Especially:\n\n&gt;They are relics of a time long past, where you were a naive boy, and they served as stepping stones to becoming a man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Your attainability and familiarity in her eyes becomes repulsive (note this is on an unconscious level and primarily felt in her vagina).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Is this literally felt in her vagina, or a metaphor?\n&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Amazing post, btw. Especially:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;They are relics of a time long past, where you were a naive boy, and they served as stepping stones to becoming a man.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7o4kv", "score_hidden": false, "stickied": false, "created": 1492124709.0, "created_utc": 1492095909.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7yfbg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DubbleFUPAwitCheez", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Well said friend. A post worth coming back to when the reins start to slip", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well said friend. A post worth coming back to when the reins start to slip&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7yfbg", "score_hidden": false, "stickied": false, "created": 1492135693.0, "created_utc": 1492106893.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg821fa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sumethreuaweiei", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The way I rationalize an LTR or the hope of having a wife/children is that we only get to live this life once. Fuck it, might as well pursue my dream ya know?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The way I rationalize an LTR or the hope of having a wife/children is that we only get to live this life once. Fuck it, might as well pursue my dream ya know?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg821fa", "score_hidden": false, "stickied": false, "created": 1492139576.0, "created_utc": 1492110776.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg82z5g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "VickVaseline", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Unfortunately, if you and your ex have a kid, the whole notion of \"no contact indefinitely\" goes out the window.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unfortunately, if you and your ex have a kid, the whole notion of &amp;quot;no contact indefinitely&amp;quot; goes out the window.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg82z5g", "score_hidden": false, "stickied": false, "created": 1492140590.0, "created_utc": 1492111790.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg836js", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mr-Ed209", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Incredible read. Side bar this shit", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Incredible read. Side bar this shit&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg836js", "score_hidden": false, "stickied": false, "created": 1492140815.0, "created_utc": 1492112015.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg85yv1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aanarchist", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "it could be as simple as she doesn't appreciate a good thing when she sees it, because society bombards her with attention and validation 24/7. even women who are like 5/10s have dudes tripping over themselves for her and you could be everything a woman ever wanted in a man, she still wouldn't be satisfied. it's a waste of life energy indulging her bullshit, so you call her on it then leave.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it could be as simple as she doesn&amp;#39;t appreciate a good thing when she sees it, because society bombards her with attention and validation 24/7. even women who are like 5/10s have dudes tripping over themselves for her and you could be everything a woman ever wanted in a man, she still wouldn&amp;#39;t be satisfied. it&amp;#39;s a waste of life energy indulging her bullshit, so you call her on it then leave.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg85yv1", "score_hidden": false, "stickied": false, "created": 1492143862.0, "created_utc": 1492115062.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg898g4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "6ix_", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "You just convinced me to block and delete my ex's number. Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You just convinced me to block and delete my ex&amp;#39;s number. Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg898g4", "score_hidden": false, "stickied": false, "created": 1492147651.0, "created_utc": 1492118851.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8emvr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Johnnyvile", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Or the \"I need space\" excuse. This is what she means, https://img.memesuper.com/75f78f71e38f25ba59bf8ae15139e2fc_iimgur-i-need-space-memes_483-511.jpeg", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or the &amp;quot;I need space&amp;quot; excuse. This is what she means, &lt;a href=\"https://img.memesuper.com/75f78f71e38f25ba59bf8ae15139e2fc_iimgur-i-need-space-memes_483-511.jpeg\"&gt;https://img.memesuper.com/75f78f71e38f25ba59bf8ae15139e2fc_iimgur-i-need-space-memes_483-511.jpeg&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8emvr", "score_hidden": false, "stickied": false, "created": 1492154670.0, "created_utc": 1492125870.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg9p812", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Geckobird", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "\"Talking about you to Chad after he's blown his loud in her ass\" \n\nI just got a mental image of a Chad blowing weed smoke into my ex's ass. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Talking about you to Chad after he&amp;#39;s blown his loud in her ass&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I just got a mental image of a Chad blowing weed smoke into my ex&amp;#39;s ass. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9p812", "score_hidden": false, "stickied": false, "created": 1492230449.0, "created_utc": 1492201649.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dgamycb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Auriga1", "parent_id": "t1_dga3ppu", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Thanks man i really needed to hear that. After reading this yesterday i went on a long bike ride to clear my mind and think about what i want and as i was riding along i started make up a list in my head which i've now put to paper. \n\nI mean it's nothing much but i think it's a good start.\nIf you're interested it ended up like this:\n\nDo not criticize yourself, criticize women - you're a 10/10\n\nGoal: More money and independence either through education or a job\n\ndo's:\n\n* Spend your money wisely (on healthy food and gym membership and the likes)\n* Be more social with women (even if i have no desire to fuck the girl so as to not turn MGTOW)\n* Self improve on a daily basis (read or workout or socialize)\n* Stop being beta in any sense of the word, not just in regard to women but men too.\n* Read TRP often \n\ndon'ts \n\n* NEVER EVER contact or communicate with an ex. \n* Never watch blue pill porn (submissive men, cucks, female dominance etc) as it normalizes the blue pill mentality in it's watchers \n* Completely stop smoking weed\n* Criticize yourself \n\nBut really I'd love to give many thanks to diomedes777, Davie London and the countless of awesome dudes in here saving the world one broken soul at a time and at the same time waking up the populous both men AND women. \n\nHopefully this is a much of a rebirth as it feels like xD", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks man i really needed to hear that. After reading this yesterday i went on a long bike ride to clear my mind and think about what i want and as i was riding along i started make up a list in my head which i&amp;#39;ve now put to paper. &lt;/p&gt;\n\n&lt;p&gt;I mean it&amp;#39;s nothing much but i think it&amp;#39;s a good start.\nIf you&amp;#39;re interested it ended up like this:&lt;/p&gt;\n\n&lt;p&gt;Do not criticize yourself, criticize women - you&amp;#39;re a 10/10&lt;/p&gt;\n\n&lt;p&gt;Goal: More money and independence either through education or a job&lt;/p&gt;\n\n&lt;p&gt;do&amp;#39;s:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Spend your money wisely (on healthy food and gym membership and the likes)&lt;/li&gt;\n&lt;li&gt;Be more social with women (even if i have no desire to fuck the girl so as to not turn MGTOW)&lt;/li&gt;\n&lt;li&gt;Self improve on a daily basis (read or workout or socialize)&lt;/li&gt;\n&lt;li&gt;Stop being beta in any sense of the word, not just in regard to women but men too.&lt;/li&gt;\n&lt;li&gt;Read TRP often &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;don&amp;#39;ts &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;NEVER EVER contact or communicate with an ex. &lt;/li&gt;\n&lt;li&gt;Never watch blue pill porn (submissive men, cucks, female dominance etc) as it normalizes the blue pill mentality in it&amp;#39;s watchers &lt;/li&gt;\n&lt;li&gt;Completely stop smoking weed&lt;/li&gt;\n&lt;li&gt;Criticize yourself &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;But really I&amp;#39;d love to give many thanks to diomedes777, Davie London and the countless of awesome dudes in here saving the world one broken soul at a time and at the same time waking up the populous both men AND women. &lt;/p&gt;\n\n&lt;p&gt;Hopefully this is a much of a rebirth as it feels like xD&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgamycb", "score_hidden": false, "stickied": false, "created": 1492291507.0, "created_utc": 1492262707.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga3ppu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "diomedes777", "parent_id": "t1_dg9r2jz", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "They exist to reproduce and raise kids. If you don't want kids, they exist to bust a load in and let off steam around when you need some stress relief. They are not here to talk to about anything that isn't mundane triviality, not here to discuss concepts or ideas with and not here to be friends with - all of these things are antithetical female sexual attraction and women simply operate on a level of viewing the world as a sexualised child. If it isn't about sex with an attractive man, they don't give a fuck. \n\nWhat do you do? shift your purpose to that of one that fulfills you - dedicate your life to some sort of purpose. Fuck hookers and sluts when you're horny, drink beers with your friends when you're lonely and then get right back to your mission ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They exist to reproduce and raise kids. If you don&amp;#39;t want kids, they exist to bust a load in and let off steam around when you need some stress relief. They are not here to talk to about anything that isn&amp;#39;t mundane triviality, not here to discuss concepts or ideas with and not here to be friends with - all of these things are antithetical female sexual attraction and women simply operate on a level of viewing the world as a sexualised child. If it isn&amp;#39;t about sex with an attractive man, they don&amp;#39;t give a fuck. &lt;/p&gt;\n\n&lt;p&gt;What do you do? shift your purpose to that of one that fulfills you - dedicate your life to some sort of purpose. Fuck hookers and sluts when you&amp;#39;re horny, drink beers with your friends when you&amp;#39;re lonely and then get right back to your mission &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga3ppu", "score_hidden": false, "stickied": false, "created": 1492249490.0, "created_utc": 1492220690.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9r2jz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Auriga1", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Found this subreddit about 2 weeks ago and have been lurking. I practiced some TRP stuff prior to finding out about it but the more posts i read in here the more i start to look down on women. Not just hate them which isn't the worst but looking down on them as lesser lifeforms... After having been on this sub for a while i think i've been turned into a MGTOW. \n\nThe hardest of all the realizations i've had over the past weeks is that women have no inherent worth to them - They are basically a warm hole and a financial black hole. Besides fulfilling the sexual urges of men what are they good for? And am i willing to trade my freedom for mere pussy?\n\nI mean i could just become a chad but as a  prior serial relationship junkie i've come to derive ZERO pleasure from casual sex/ one night stands  and this post here pretty much nailed it on why LTR is a waste of time for me so what do i do here? Buy a fleshlight and move out into the woods?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Found this subreddit about 2 weeks ago and have been lurking. I practiced some TRP stuff prior to finding out about it but the more posts i read in here the more i start to look down on women. Not just hate them which isn&amp;#39;t the worst but looking down on them as lesser lifeforms... After having been on this sub for a while i think i&amp;#39;ve been turned into a MGTOW. &lt;/p&gt;\n\n&lt;p&gt;The hardest of all the realizations i&amp;#39;ve had over the past weeks is that women have no inherent worth to them - They are basically a warm hole and a financial black hole. Besides fulfilling the sexual urges of men what are they good for? And am i willing to trade my freedom for mere pussy?&lt;/p&gt;\n\n&lt;p&gt;I mean i could just become a chad but as a  prior serial relationship junkie i&amp;#39;ve come to derive ZERO pleasure from casual sex/ one night stands  and this post here pretty much nailed it on why LTR is a waste of time for me so what do i do here? Buy a fleshlight and move out into the woods?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9r2jz", "score_hidden": false, "stickied": false, "created": 1492232697.0, "created_utc": 1492203897.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg7k4tc", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "diomedes777", "parent_id": "t1_dg7jx0i", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "It's the same thing. Why do lesbian relationships always have a \"man\" role in them? It's really the same thing. The \"man\" stops being the \"man\", stops asserting, stops being the \"man\" that \"he\" initially was and becomes passive and direction-less within the relationship and the relationship just becomes two lost, directionless women who are now confused, unattracted to eachother and both looking for masculine direction. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s the same thing. Why do lesbian relationships always have a &amp;quot;man&amp;quot; role in them? It&amp;#39;s really the same thing. The &amp;quot;man&amp;quot; stops being the &amp;quot;man&amp;quot;, stops asserting, stops being the &amp;quot;man&amp;quot; that &amp;quot;he&amp;quot; initially was and becomes passive and direction-less within the relationship and the relationship just becomes two lost, directionless women who are now confused, unattracted to eachother and both looking for masculine direction. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7k4tc", "score_hidden": false, "stickied": false, "created": 1492119952.0, "created_utc": 1492091152.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jx0i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wheel_", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Do you have a similar analysis for lesbian (i.e. girl + girl) LTRs and breakups?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have a similar analysis for lesbian (i.e. girl + girl) LTRs and breakups?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg7jx0i", "score_hidden": false, "stickied": false, "created": 1492119669.0, "created_utc": 1492090869.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg803dr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AssMaster95", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "My most recent ex contacted me a week after breaking up with me and I gave it another go and sex resumed with a condom, I know, and the week we were off for I didn't hear from her as she went to a concert and probably banged some guys. A week goes by and she says she's pregnant, I used to bang her raw in bc, I know. Long story short plan b but she insisted on abortion, she broke up not long after as she became distant. Haven't heard from her after 6 months. Not completely over her, despite other women, but I can say it's been good without constant emotional changes from a LtR.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My most recent ex contacted me a week after breaking up with me and I gave it another go and sex resumed with a condom, I know, and the week we were off for I didn&amp;#39;t hear from her as she went to a concert and probably banged some guys. A week goes by and she says she&amp;#39;s pregnant, I used to bang her raw in bc, I know. Long story short plan b but she insisted on abortion, she broke up not long after as she became distant. Haven&amp;#39;t heard from her after 6 months. Not completely over her, despite other women, but I can say it&amp;#39;s been good without constant emotional changes from a LtR.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg803dr", "score_hidden": false, "stickied": false, "created": 1492137468.0, "created_utc": 1492108668.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8f3gm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sd4c", "parent_id": "t1_dg83aot", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "1) So long as you both only sleep with each other, it's theoretically possible to salvage things  \n  \n-but-  \n  \n2) Marriage: she wants to marry you because she sees potential in you that you can't see.  This is good, but the problem is that once you finish your degree and get a good paying job, your success will attract women of a higher tier than you can get with no job  \n  \nIf you're not driven to do anything but porno when you're with her, your attraction is likely based solely on her caretaking of you.  You probably don't find her physically compelling, or you'd save it all for her.  \n  \nIf you even THINK you have a problem with porn, quit jacking it and get your T levels checked.  Don't drink, smoke pot or take pills and lift 3x a week, hard.  Make your life kick major ass and it won't matter whether she's into you or not.  \n  \nHint: video games are not part of a life that kicks major ass  \n  \nHint 2: they are literally a bullshit illusion fueled by your PRETENDING TO BE someone whose life kicks ass  \n  \nHint 3: meditation, testosterone, and sustained sobriety will allow you to see through illusions", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1) So long as you both only sleep with each other, it&amp;#39;s theoretically possible to salvage things  &lt;/p&gt;\n\n&lt;p&gt;-but-  &lt;/p&gt;\n\n&lt;p&gt;2) Marriage: she wants to marry you because she sees potential in you that you can&amp;#39;t see.  This is good, but the problem is that once you finish your degree and get a good paying job, your success will attract women of a higher tier than you can get with no job  &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re not driven to do anything but porno when you&amp;#39;re with her, your attraction is likely based solely on her caretaking of you.  You probably don&amp;#39;t find her physically compelling, or you&amp;#39;d save it all for her.  &lt;/p&gt;\n\n&lt;p&gt;If you even THINK you have a problem with porn, quit jacking it and get your T levels checked.  Don&amp;#39;t drink, smoke pot or take pills and lift 3x a week, hard.  Make your life kick major ass and it won&amp;#39;t matter whether she&amp;#39;s into you or not.  &lt;/p&gt;\n\n&lt;p&gt;Hint: video games are not part of a life that kicks major ass  &lt;/p&gt;\n\n&lt;p&gt;Hint 2: they are literally a bullshit illusion fueled by your PRETENDING TO BE someone whose life kicks ass  &lt;/p&gt;\n\n&lt;p&gt;Hint 3: meditation, testosterone, and sustained sobriety will allow you to see through illusions&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8f3gm", "score_hidden": false, "stickied": false, "created": 1492155270.0, "created_utc": 1492126470.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg83aot", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "excellence83", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "What if she leaves for legitimate reasons that you later address, surely it can't be so cut and dry that it could never work in the future? I'm 8 months out from her leaving me after 4 years together. The reason she gave was that I wouldn't marry her. I think the real reason is that I haven't worked for the last 3 years, partly being lazy but also as I'm studying a degree full time. Plus I've had a full on porn addiction that she's well aware of. since the breakup she's been in constant contact with me. She didn't hook up with anyone else and our sex has been ongoing though she always recoils after a few good days of sex and gets back on the \"you won't marry me\" issue. Am I really to believe that getting my life on track, ditching the addiction and working part time won't fix the problem? What am I to make of the \"you won't marry me\" complaint?\n", "edited": 1492112639.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What if she leaves for legitimate reasons that you later address, surely it can&amp;#39;t be so cut and dry that it could never work in the future? I&amp;#39;m 8 months out from her leaving me after 4 years together. The reason she gave was that I wouldn&amp;#39;t marry her. I think the real reason is that I haven&amp;#39;t worked for the last 3 years, partly being lazy but also as I&amp;#39;m studying a degree full time. Plus I&amp;#39;ve had a full on porn addiction that she&amp;#39;s well aware of. since the breakup she&amp;#39;s been in constant contact with me. She didn&amp;#39;t hook up with anyone else and our sex has been ongoing though she always recoils after a few good days of sex and gets back on the &amp;quot;you won&amp;#39;t marry me&amp;quot; issue. Am I really to believe that getting my life on track, ditching the addiction and working part time won&amp;#39;t fix the problem? What am I to make of the &amp;quot;you won&amp;#39;t marry me&amp;quot; complaint?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg83aot", "score_hidden": false, "stickied": false, "created": 1492140940.0, "created_utc": 1492112140.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg89vsj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "whocaresguy", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Thank you!  It was a yr ago I started seeing my ex and I am thinking about her.  \n\nObstacles are stepping stones!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you!  It was a yr ago I started seeing my ex and I am thinking about her.  &lt;/p&gt;\n\n&lt;p&gt;Obstacles are stepping stones!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg89vsj", "score_hidden": false, "stickied": false, "created": 1492148453.0, "created_utc": 1492119653.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8cle5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LeJamesBron32", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Damn, this explained so many things that I went through post-breakup a few years ago and did not even realize were happening to me. Thanks for opening my eyes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn, this explained so many things that I went through post-breakup a few years ago and did not even realize were happening to me. Thanks for opening my eyes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8cle5", "score_hidden": false, "stickied": false, "created": 1492151954.0, "created_utc": 1492123154.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8euj0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Johnnyvile", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "LTR or not, some people will want it some will never want to do it again. TRP is great for either. I think you can learn a lot to make better choices in going into an LTR if that is what you want. There is no THE ONE. Waiting out the friend zone will never work. You start to notice crazy women and their bs. You know to go out and get women to build up your experience so you're not one of those guys that falls in love with the first girl to give you attention/sex. Not all sex needs to be a relationship. The most important thing is you, your goals, life, confidence, etc. Do not let a relationship define who you are and give up things about yourself for a woman. If she is the type of girl that is even flirting with other men while you are together GTFO! Does she have tons of guy friends? GTFO!\n\nOr just stay out of LTRs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;LTR or not, some people will want it some will never want to do it again. TRP is great for either. I think you can learn a lot to make better choices in going into an LTR if that is what you want. There is no THE ONE. Waiting out the friend zone will never work. You start to notice crazy women and their bs. You know to go out and get women to build up your experience so you&amp;#39;re not one of those guys that falls in love with the first girl to give you attention/sex. Not all sex needs to be a relationship. The most important thing is you, your goals, life, confidence, etc. Do not let a relationship define who you are and give up things about yourself for a woman. If she is the type of girl that is even flirting with other men while you are together GTFO! Does she have tons of guy friends? GTFO!&lt;/p&gt;\n\n&lt;p&gt;Or just stay out of LTRs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8euj0", "score_hidden": false, "stickied": false, "created": 1492154957.0, "created_utc": 1492126157.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8gfg8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "botbullet0", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "So what happens if I dumped her? Still fuckable or nah", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So what happens if I dumped her? Still fuckable or nah&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8gfg8", "score_hidden": false, "stickied": false, "created": 1492157086.0, "created_utc": 1492128286.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dgct01c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "czatara", "parent_id": "t1_dgbjei2", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The endgame for TRP is still an open topic IMHO. Just realize that eventually, every man becomes MGTOW.\n\nIf you trust a woman to take good care of you well into your old age, you're in for a big surprise.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The endgame for TRP is still an open topic IMHO. Just realize that eventually, every man becomes MGTOW.&lt;/p&gt;\n\n&lt;p&gt;If you trust a woman to take good care of you well into your old age, you&amp;#39;re in for a big surprise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgct01c", "score_hidden": false, "stickied": false, "created": 1492416706.0, "created_utc": 1492387906.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbjei2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lolduude", "parent_id": "t1_dgb49ps", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I meant when we are around 40 years old as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I meant when we are around 40 years old as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgbjei2", "score_hidden": false, "stickied": false, "created": 1492337822.0, "created_utc": 1492309022.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb49ps", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "czatara", "parent_id": "t1_dg8gnv0", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "No! Why would anyone want that?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No! Why would anyone want that?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgb49ps", "score_hidden": false, "stickied": false, "created": 1492316348.0, "created_utc": 1492287548.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8gnv0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lolduude", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Does RP suggest LTR with post wall women? Or when we are around 40?\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does RP suggest LTR with post wall women? Or when we are around 40?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8gnv0", "score_hidden": false, "stickied": false, "created": 1492157397.0, "created_utc": 1492128597.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8kmqy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CuntyMcFagNuts69", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Even when you as a man end a relationship, she had a part in it\n\nI found out my previous ltr was getting ready to branch swing so I ended it. Sounds fine right! Well technically she ended it. I made my mind up when I found out about it, she made her mind up long before that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even when you as a man end a relationship, she had a part in it&lt;/p&gt;\n\n&lt;p&gt;I found out my previous ltr was getting ready to branch swing so I ended it. Sounds fine right! Well technically she ended it. I made my mind up when I found out about it, she made her mind up long before that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8kmqy", "score_hidden": false, "stickied": false, "created": 1492162860.0, "created_utc": 1492134060.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8yjft", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dragon_Garoo", "parent_id": "t1_dg8lkbk", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Glad you made it bro.  So relatable.  We need men's clubs, so we can be there for each other in these times.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad you made it bro.  So relatable.  We need men&amp;#39;s clubs, so we can be there for each other in these times.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8yjft", "score_hidden": false, "stickied": false, "created": 1492190904.0, "created_utc": 1492162104.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8lkbk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WhyWeGot84", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Never has a post been more relatable. I gamed my first LTR starting at 18, all the way until I was 21 (still am 21). We broke up when we went on exchange, and sort of got back together (it was off and non). Before getting back to our home country, I cheated on her and dumped her (I didn't tell her, ofcourse) - she was devastated ofcourse, crying and pleading. Unfortunately, about a couple of weeks later, my suicidal depression surfaced. I tried talking to her for the first time in ages about what was going on with me. She didn't want to listen or help out. A day after talking to her, I found out that she's been fucking some other dude who's guts I hate for a couple of weeks - saw them together at a club and a mate told me the entire backstory. \n\nN.B: I was there for a year and a bit when she was hurting herself and depressed as fuck. Ofcourse, she won't ever remember what I did for her, solipsism right? \n\nA day later after finding out she was involved with the guy I tried to commit suicide. I had nobody there for me - no friends, and family would've made it significantly worse. This was three weeks ago today. I've checked myself into a doctor and psych, and also undergoing physical rehab for lower back issues I have. I'm picking myself up slowly, stopping substance abuse (alcohol and weed), focusing on university again and on work/internships. Trying to get back into TRP theory one element at a time.\n\nOne of the most things I realised out of the breakup is that nobody can take care of you but yourself. That means invest as much time and money as you need to in yourself (within reason). I'm taking care of myself and doing things I've wanted now without nobody's approval. Self-validation (as \"beta\" as validation sounds) is the most important things you can do for yourself.\n\nBest of luck to everyone who's going through a breakup or who will go through a breakup. Mind, body and soul. Take care of yourself.", "edited": 1492135534.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Never has a post been more relatable. I gamed my first LTR starting at 18, all the way until I was 21 (still am 21). We broke up when we went on exchange, and sort of got back together (it was off and non). Before getting back to our home country, I cheated on her and dumped her (I didn&amp;#39;t tell her, ofcourse) - she was devastated ofcourse, crying and pleading. Unfortunately, about a couple of weeks later, my suicidal depression surfaced. I tried talking to her for the first time in ages about what was going on with me. She didn&amp;#39;t want to listen or help out. A day after talking to her, I found out that she&amp;#39;s been fucking some other dude who&amp;#39;s guts I hate for a couple of weeks - saw them together at a club and a mate told me the entire backstory. &lt;/p&gt;\n\n&lt;p&gt;N.B: I was there for a year and a bit when she was hurting herself and depressed as fuck. Ofcourse, she won&amp;#39;t ever remember what I did for her, solipsism right? &lt;/p&gt;\n\n&lt;p&gt;A day later after finding out she was involved with the guy I tried to commit suicide. I had nobody there for me - no friends, and family would&amp;#39;ve made it significantly worse. This was three weeks ago today. I&amp;#39;ve checked myself into a doctor and psych, and also undergoing physical rehab for lower back issues I have. I&amp;#39;m picking myself up slowly, stopping substance abuse (alcohol and weed), focusing on university again and on work/internships. Trying to get back into TRP theory one element at a time.&lt;/p&gt;\n\n&lt;p&gt;One of the most things I realised out of the breakup is that nobody can take care of you but yourself. That means invest as much time and money as you need to in yourself (within reason). I&amp;#39;m taking care of myself and doing things I&amp;#39;ve wanted now without nobody&amp;#39;s approval. Self-validation (as &amp;quot;beta&amp;quot; as validation sounds) is the most important things you can do for yourself.&lt;/p&gt;\n\n&lt;p&gt;Best of luck to everyone who&amp;#39;s going through a breakup or who will go through a breakup. Mind, body and soul. Take care of yourself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8lkbk", "score_hidden": false, "stickied": false, "created": 1492164153.0, "created_utc": 1492135353.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8sfar", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dRePe_Thill", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt;&gt;They are relics of a time long past, where you were a naive boy, and they served as stepping stones to becoming a man.\n\nVery nice post and the sentence above is a great way to view past relationships.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;They are relics of a time long past, where you were a naive boy, and they served as stepping stones to becoming a man.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Very nice post and the sentence above is a great way to view past relationships.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8sfar", "score_hidden": false, "stickied": false, "created": 1492174959.0, "created_utc": 1492146159.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8t79c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ex_addict_bro", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Solid. Also people stumbling over this should read 'Practical female psychology'. In reality it is simple and there's nothing to cry about. Just women doing their thing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Solid. Also people stumbling over this should read &amp;#39;Practical female psychology&amp;#39;. In reality it is simple and there&amp;#39;s nothing to cry about. Just women doing their thing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8t79c", "score_hidden": false, "stickied": false, "created": 1492176477.0, "created_utc": 1492147677.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8tftb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "suske127", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Dig this post, but personally, I think depending on the situation/ex, I'd still be down to fuck. Not get back together with the gal - but I might still hit a few if the opportunity came around, and they were the desperate one/initiator/ IOIs. Happened to a buddy of mine, his GF came home for a weekend from college and was hinting she wanted to smash. He said he was over it and declined, but I might have said why not. Then again, I've yet to have a woman break up with me, which could correlate to the mindset I just explained \n(vs. his \"I'm too proud for you\" mindset) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dig this post, but personally, I think depending on the situation/ex, I&amp;#39;d still be down to fuck. Not get back together with the gal - but I might still hit a few if the opportunity came around, and they were the desperate one/initiator/ IOIs. Happened to a buddy of mine, his GF came home for a weekend from college and was hinting she wanted to smash. He said he was over it and declined, but I might have said why not. Then again, I&amp;#39;ve yet to have a woman break up with me, which could correlate to the mindset I just explained \n(vs. his &amp;quot;I&amp;#39;m too proud for you&amp;quot; mindset) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8tftb", "score_hidden": false, "stickied": false, "created": 1492176936.0, "created_utc": 1492148136.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8vlhz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pandaholic23", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This post put me back on track. My ex knows better than to try to contact me but everytime I see her at school, traffic, etc. She goes out of her way to try to makes herself visible as possible to get my attention. First I thought she was doing it because she wanted me back and realized she made a mistake branch swinging, but now I realized she's probably doing it for the validation and will do a 180 as soon as I show any sign of interest. I was actually starting to feel relieved that she got the short end of the stick about the break up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This post put me back on track. My ex knows better than to try to contact me but everytime I see her at school, traffic, etc. She goes out of her way to try to makes herself visible as possible to get my attention. First I thought she was doing it because she wanted me back and realized she made a mistake branch swinging, but now I realized she&amp;#39;s probably doing it for the validation and will do a 180 as soon as I show any sign of interest. I was actually starting to feel relieved that she got the short end of the stick about the break up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8vlhz", "score_hidden": false, "stickied": false, "created": 1492181981.0, "created_utc": 1492153181.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg8xnz4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "corneliucodreanu", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Nailed it. Upvoted and saved. Where coul one could go through your analysis of the opportunity costs of investing in an LTR and why it's not worth it? Definitely want to read that one as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nailed it. Upvoted and saved. Where coul one could go through your analysis of the opportunity costs of investing in an LTR and why it&amp;#39;s not worth it? Definitely want to read that one as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8xnz4", "score_hidden": false, "stickied": false, "created": 1492188048.0, "created_utc": 1492159248.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dga2xl6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "diomedes777", "parent_id": "t1_dg8ydhi", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Everything you've ever been taught about quite literally everything slowly turns out to be lies and its up to you to reeducate yourself on how the world, and in this case women, really operate. It is very liberating, I agree. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everything you&amp;#39;ve ever been taught about quite literally everything slowly turns out to be lies and its up to you to reeducate yourself on how the world, and in this case women, really operate. It is very liberating, I agree. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga2xl6", "score_hidden": false, "stickied": false, "created": 1492248417.0, "created_utc": 1492219617.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ydhi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AB_R", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Female nature, betafication, female irrational rationalisations due to emotions - it has it all. That's TRP for you. It's a nasty truth, but I began to fall in love with. My entire life was about finding the truths out there, as ugly as they may be, because in the end, they're liberating, if you can accept them.\n\nThe easiest solution I found for keeping women around: plate them, and if they want a relationship, make it an open one. Sure, many won't like it, but it's the only way they see they can't have their way with you and they have constant competition, which keeps attraction at a constant high.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Female nature, betafication, female irrational rationalisations due to emotions - it has it all. That&amp;#39;s TRP for you. It&amp;#39;s a nasty truth, but I began to fall in love with. My entire life was about finding the truths out there, as ugly as they may be, because in the end, they&amp;#39;re liberating, if you can accept them.&lt;/p&gt;\n\n&lt;p&gt;The easiest solution I found for keeping women around: plate them, and if they want a relationship, make it an open one. Sure, many won&amp;#39;t like it, but it&amp;#39;s the only way they see they can&amp;#39;t have their way with you and they have constant competition, which keeps attraction at a constant high.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8ydhi", "score_hidden": false, "stickied": false, "created": 1492190379.0, "created_utc": 1492161579.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dga3axr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "diomedes777", "parent_id": "t1_dg90hqb", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "My most recent LTR ended things because I was being a complete asshole, I was total Chad to the point where I was actually appearing beta in her eyes because I wouldn't fuck her, the day we broke up I had fucked a tinder girl in my girlfriends house while she was out at dinner with her family, she came home and wanted to fuck but my dick couldn't work and I wasn't horny. She dumped me because I was treating her like a low level plate, ignoring her more often than not and wasn't even fucking her. that relationship was ridiculous and I have no idea whether she deep down knew I was cheating or whether she believed I was actually just a pussy who didn't like sex. Absolute joke of a relationship and I can only blame myself for even getting into such a situation. \n\nBut it would be interesting to know how women feel when they're sort of \"forced\" to dump a guy who's treating them like shit, as the overwhelming majority of cases are the man doing the complete opposite ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My most recent LTR ended things because I was being a complete asshole, I was total Chad to the point where I was actually appearing beta in her eyes because I wouldn&amp;#39;t fuck her, the day we broke up I had fucked a tinder girl in my girlfriends house while she was out at dinner with her family, she came home and wanted to fuck but my dick couldn&amp;#39;t work and I wasn&amp;#39;t horny. She dumped me because I was treating her like a low level plate, ignoring her more often than not and wasn&amp;#39;t even fucking her. that relationship was ridiculous and I have no idea whether she deep down knew I was cheating or whether she believed I was actually just a pussy who didn&amp;#39;t like sex. Absolute joke of a relationship and I can only blame myself for even getting into such a situation. &lt;/p&gt;\n\n&lt;p&gt;But it would be interesting to know how women feel when they&amp;#39;re sort of &amp;quot;forced&amp;quot; to dump a guy who&amp;#39;s treating them like shit, as the overwhelming majority of cases are the man doing the complete opposite &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga3axr", "score_hidden": false, "stickied": false, "created": 1492248933.0, "created_utc": 1492220133.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg90hqb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yomo86", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Consider yourself lucky if she broke up because \"you were too much of a dick\" and the like. Adding comfort and vulnerability in little doses is far more easier than swallowing the pill the first time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Consider yourself lucky if she broke up because &amp;quot;you were too much of a dick&amp;quot; and the like. Adding comfort and vulnerability in little doses is far more easier than swallowing the pill the first time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg90hqb", "score_hidden": false, "stickied": false, "created": 1492197082.0, "created_utc": 1492168282.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg951s1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bunz-o-matic", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The dreaded Sunday/Monday text. LMAO. Christ, if that doesn't ring true.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The dreaded Sunday/Monday text. LMAO. Christ, if that doesn&amp;#39;t ring true.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg951s1", "score_hidden": false, "stickied": false, "created": 1492206167.0, "created_utc": 1492177367.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg97sjf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "davielondon", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Fantastic article. However, I was the one who dumped my gf and ended the LTR...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fantastic article. However, I was the one who dumped my gf and ended the LTR...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg97sjf", "score_hidden": false, "stickied": false, "created": 1492209930.0, "created_utc": 1492181130.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg9bt20", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "midgetpooooo", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I have a question. I agree with​ all that you've said, it's been my perspective on LTR for a long time from observing my friend's relationships rise and fall over the years. \n##\nHowever, I had an LTR and we didn't break up the way you described since I moved for University. We didn't talk about breaking up per se but it was implied. I still kept in touch with her because I wanted to see how she was doing but she became more distant naturally until she finally called me through tears to break up officially and not talk for awhile. \n## \nNow, I did not appreciate her attitude and her saying things exactly like you described. So it's been about a month now of no contact and I can tell it's hitting her hard because she doesn't check my snap stories at all (lol I know but I don't use FB or anything else, 24 hours and it's gone is healthy). Anyway I'll be returning home for the summer. I would like to fuck her again while I'm back in a casual sense rather than like before. \n##\nIn your opinion, what would be the best approach to accomplish this in this situation?\n##\nEdit: Just to add, reason I'm interested in this girl is because she is a HB 9/10 and I was her first so over the course of our time together she became quite the awesome sexual partner. ", "edited": 1492187284.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a question. I agree with​ all that you&amp;#39;ve said, it&amp;#39;s been my perspective on LTR for a long time from observing my friend&amp;#39;s relationships rise and fall over the years. &lt;/p&gt;\n\n&lt;p&gt;However, I had an LTR and we didn&amp;#39;t break up the way you described since I moved for University. We didn&amp;#39;t talk about breaking up per se but it was implied. I still kept in touch with her because I wanted to see how she was doing but she became more distant naturally until she finally called me through tears to break up officially and not talk for awhile. &lt;/p&gt;\n\n&lt;p&gt;Now, I did not appreciate her attitude and her saying things exactly like you described. So it&amp;#39;s been about a month now of no contact and I can tell it&amp;#39;s hitting her hard because she doesn&amp;#39;t check my snap stories at all (lol I know but I don&amp;#39;t use FB or anything else, 24 hours and it&amp;#39;s gone is healthy). Anyway I&amp;#39;ll be returning home for the summer. I would like to fuck her again while I&amp;#39;m back in a casual sense rather than like before. &lt;/p&gt;\n\n&lt;p&gt;In your opinion, what would be the best approach to accomplish this in this situation?&lt;/p&gt;\n\n&lt;p&gt;Edit: Just to add, reason I&amp;#39;m interested in this girl is because she is a HB 9/10 and I was her first so over the course of our time together she became quite the awesome sexual partner. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9bt20", "score_hidden": false, "stickied": false, "created": 1492214738.0, "created_utc": 1492185938.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg9dome", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "last_shadow_fat", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "6 years LTR and she dumps me  with your first fucking example  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;6 years LTR and she dumps me  with your first fucking example  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9dome", "score_hidden": false, "stickied": false, "created": 1492216816.0, "created_utc": 1492188016.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg9k2od", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LymanRP", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Great post. TLDR, if your LTR breaks up with you, she's not attracted to you anymore and either:\n\nA. Already has new dick lined up and is about to branch swing, or...\n\nB. Wants to be single and available for new dick\n\nIn the case of outcome B, she may even come crawling back to you months later (especially if she's approaching the wall and is unable to find a better option on the market). If this happens and you take her back, then you will forever be labeled in her mind as BB and her fallback choice. The future does not bode well for either of you, so buckle up for a rough ride that will likely lead to infidelity and divorce.\n\nYour best (and really only move) when your LTR dumps you is to accept it, then ghost her and never look back. It sucks, it's a kick in the nuts, but **she left you because she was not attracted to you anymore.** Learn and move on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post. TLDR, if your LTR breaks up with you, she&amp;#39;s not attracted to you anymore and either:&lt;/p&gt;\n\n&lt;p&gt;A. Already has new dick lined up and is about to branch swing, or...&lt;/p&gt;\n\n&lt;p&gt;B. Wants to be single and available for new dick&lt;/p&gt;\n\n&lt;p&gt;In the case of outcome B, she may even come crawling back to you months later (especially if she&amp;#39;s approaching the wall and is unable to find a better option on the market). If this happens and you take her back, then you will forever be labeled in her mind as BB and her fallback choice. The future does not bode well for either of you, so buckle up for a rough ride that will likely lead to infidelity and divorce.&lt;/p&gt;\n\n&lt;p&gt;Your best (and really only move) when your LTR dumps you is to accept it, then ghost her and never look back. It sucks, it&amp;#39;s a kick in the nuts, but &lt;strong&gt;she left you because she was not attracted to you anymore.&lt;/strong&gt; Learn and move on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9k2od", "score_hidden": false, "stickied": false, "created": 1492224247.0, "created_utc": 1492195447.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg9r253", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Brixylian", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "North of 50, this has little relevance. By then, life has either ingrained IDGAF, or one remains a simpering perpetual twat.\n\nAt a certain point in a man's life power and means can never be subsumed by the emotional vagaries of bitches.\n\nFor he has built a life in which he gives and takes on his own terms. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;North of 50, this has little relevance. By then, life has either ingrained IDGAF, or one remains a simpering perpetual twat.&lt;/p&gt;\n\n&lt;p&gt;At a certain point in a man&amp;#39;s life power and means can never be subsumed by the emotional vagaries of bitches.&lt;/p&gt;\n\n&lt;p&gt;For he has built a life in which he gives and takes on his own terms. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9r253", "score_hidden": false, "stickied": false, "created": 1492232683.0, "created_utc": 1492203883.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dg9sagf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TxnyMontana", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Excellent! So useful material. Thanks for it bro!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Excellent! So useful material. Thanks for it bro!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9sagf", "score_hidden": false, "stickied": false, "created": 1492234242.0, "created_utc": 1492205442.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dgawznt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hyper_Sonik", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Sometimes when I feel myself getting depressed or nostalgic over my pregnant ex (my child) I read material like this and understand that female nature that causes these types of situations. And ALL women are like that. It is their biological nature. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes when I feel myself getting depressed or nostalgic over my pregnant ex (my child) I read material like this and understand that female nature that causes these types of situations. And ALL women are like that. It is their biological nature. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgawznt", "score_hidden": false, "stickied": false, "created": 1492306484.0, "created_utc": 1492277684.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dgcyr7s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dymatizeee", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This post hit me on every god damn level. My LTR started and ended the exact same way you described it. She said some bullshit reason like how we aren't compatible anymore or at different points of our life. At the end of the day, she wasn't emotionally invested anymore. \n\nThank you for this insightful post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This post hit me on every god damn level. My LTR started and ended the exact same way you described it. She said some bullshit reason like how we aren&amp;#39;t compatible anymore or at different points of our life. At the end of the day, she wasn&amp;#39;t emotionally invested anymore. &lt;/p&gt;\n\n&lt;p&gt;Thank you for this insightful post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgcyr7s", "score_hidden": false, "stickied": false, "created": 1492424424.0, "created_utc": 1492395624.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dgcz6mf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "scissor_me_timbers00", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This is excellent. Although I do think it's possible for a man and woman to have a lifelong marriage of devotion to eachother. The man just has to maintain leadership, and understand that sex will be less frequent. But that doesn't mean it will be pity sex necessarily.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is excellent. Although I do think it&amp;#39;s possible for a man and woman to have a lifelong marriage of devotion to eachother. The man just has to maintain leadership, and understand that sex will be less frequent. But that doesn&amp;#39;t mean it will be pity sex necessarily.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgcz6mf", "score_hidden": false, "stickied": false, "created": 1492425020.0, "created_utc": 1492396220.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dga4p7o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TyrannicalWill", "parent_id": "t1_dg8ouku", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Refute the millions of marriages portion. The latter was just to acknowledge many of you were born from single mothers and project your mommy issues.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Refute the millions of marriages portion. The latter was just to acknowledge many of you were born from single mothers and project your mommy issues.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga4p7o", "score_hidden": false, "stickied": false, "created": 1492250876.0, "created_utc": 1492222076.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ouku", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "diomedes777", "parent_id": "t1_dg8gjxx", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Stop using the \"my grandparents\" \"my parents\" example. They are both completely redundant and have nothing to do with the current sexual climate. We live in a different time that is incomparable to the period in which our parents and grandparents met. That is why TRP exists. Go away cuck", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stop using the &amp;quot;my grandparents&amp;quot; &amp;quot;my parents&amp;quot; example. They are both completely redundant and have nothing to do with the current sexual climate. We live in a different time that is incomparable to the period in which our parents and grandparents met. That is why TRP exists. Go away cuck&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8ouku", "score_hidden": false, "stickied": false, "created": 1492168943.0, "created_utc": 1492140143.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dga5edu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TyrannicalWill", "parent_id": "t1_dga5248", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The argument 'LTR is a fantasy' is different than the argument 'Marriage is a shit deal'. I already acknowledge societal decline.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The argument &amp;#39;LTR is a fantasy&amp;#39; is different than the argument &amp;#39;Marriage is a shit deal&amp;#39;. I already acknowledge societal decline.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga5edu", "score_hidden": false, "stickied": false, "created": 1492251907.0, "created_utc": 1492223107.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga5248", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SnowShower63", "parent_id": "t1_dga49w4", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Why do half of them fail? How many people stay in unhappy marriages for the kids or out of financial necessity?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why do half of them fail? How many people stay in unhappy marriages for the kids or out of financial necessity?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga5248", "score_hidden": false, "stickied": false, "created": 1492251403.0, "created_utc": 1492222603.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga49w4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TyrannicalWill", "parent_id": "t1_dg8zbpe", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "And your reading comprehension is garbage. Why are there millions of marriages that exist if LTR is this abstract fantasy?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And your reading comprehension is garbage. Why are there millions of marriages that exist if LTR is this abstract fantasy?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga49w4", "score_hidden": false, "stickied": false, "created": 1492250260.0, "created_utc": 1492221460.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zbpe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SnowShower63", "parent_id": "t1_dg8gjxx", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Women today aren't like your grandmother or even your mother, son", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Women today aren&amp;#39;t like your grandmother or even your mother, son&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8zbpe", "score_hidden": false, "stickied": false, "created": 1492193500.0, "created_utc": 1492164700.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_6556hg", "likes": null, "replies": "", "user_reports": [], "id": "dgc9ip1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TyrannicalWill", "parent_id": "t1_dgc15aa", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Right and wrong? How binary. I just see tradeoffs that cater to certain people. At least LTRs don't contribute to the decline of civilization. There are many men that are happy with their marriages because they didn't pick up some desensitized slut.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right and wrong? How binary. I just see tradeoffs that cater to certain people. At least LTRs don&amp;#39;t contribute to the decline of civilization. There are many men that are happy with their marriages because they didn&amp;#39;t pick up some desensitized slut.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgc9ip1", "score_hidden": false, "stickied": false, "created": 1492390805.0, "created_utc": 1492362005.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc15aa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "newName543456", "parent_id": "t1_dg8gjxx", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt;  that's why we have millions of marriages here in the US. \n\nEat shit, millions of flies can't be wrong!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;that&amp;#39;s why we have millions of marriages here in the US. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Eat shit, millions of flies can&amp;#39;t be wrong!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgc15aa", "score_hidden": false, "stickied": false, "created": 1492378622.0, "created_utc": 1492349822.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8gjxx", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "TyrannicalWill", "parent_id": "t3_6556hg", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This PUA community is delusional. Yeah sure LTRs are a fantasy, that's why we have millions of marriages here in the US. That's why my grandparents have been married for 50 years and my parents 20+ years. You guys talk like you have the world figured out. Reality is you're a bunch of porn &amp; sex addicts who are depressed without their next novel babe fix as illustrated by the Coolidge Effect. Enjoy your miserable sluts &amp; desensitization.", "edited": 1492128677.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This PUA community is delusional. Yeah sure LTRs are a fantasy, that&amp;#39;s why we have millions of marriages here in the US. That&amp;#39;s why my grandparents have been married for 50 years and my parents 20+ years. You guys talk like you have the world figured out. Reality is you&amp;#39;re a bunch of porn &amp;amp; sex addicts who are depressed without their next novel babe fix as illustrated by the Coolidge Effect. Enjoy your miserable sluts &amp;amp; desensitization.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8gjxx", "score_hidden": false, "stickied": false, "created": 1492157256.0, "created_utc": 1492128456.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}]