[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Summary:&lt;/strong&gt; One of the top issues guys have when it comes to talking to strangers is their desire to ask &lt;strong&gt;thousand different questions&lt;/strong&gt;. It can be fixed by showing how to use statements, accusations, guesses and leading sentences to move the conversation forward. But some take it too far.&lt;/p&gt;\n\n&lt;p&gt;A lot of men learning about those things are just &lt;strong&gt;socially inexperienced&lt;/strong&gt;. They can thrive e.g. in their workplace but put them next to a total stranger and they have no clue what to do. When they see a simple, useful piece of advice that seems to work (&amp;quot;don&amp;#39;t ask questions, speak in statements&amp;quot;) they take it to the extreme and avoid questions like they’re avoiding golddiggers. And that can get weird pretty quickly.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Too Much of Anything Is Always Bad&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;If there is &lt;strong&gt;too much of something&lt;/strong&gt;, then sure as hell it&amp;#39;s not right. You can go over the top with anything - from saying too many compliments (one is fine, two is the limit for daygame interactions) to being too pushy (making fun of the poor girl all the time). You have to find the sweet spot, which is different for every man.&lt;/p&gt;\n\n&lt;p&gt;The whole goal of &lt;strong&gt;learning pickup&lt;/strong&gt; is to be able to show the &amp;quot;best version of yourself&amp;quot;. One guy is naturally funny and he jokes a lot. Therefore, for him the optimal level of jerkiness and challenging will be higher than for stone-cold Joe. That&amp;#39;s a problem which is overcome only by calibration in field.&lt;/p&gt;\n\n&lt;p&gt;Thankfully, we don&amp;#39;t have to guess anything about using questions. We know that asking too many is sucking value out of your interlocutor and is regarded as unattractive. &lt;strong&gt;Avoid using too many questions.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Avoid.&amp;quot; It&amp;#39;s not a hard rule. Yes, it&amp;#39;s better to use statements, assumptions, stories, challenges, jokes and exaggerations than to ask questions. There are various levels of detail you can convey in your messages. If you&amp;#39;re asking a rich, &lt;strong&gt;open questions&lt;/strong&gt; then you&amp;#39;ll be fine. Don&amp;#39;t take it to the extreme when it means having an awkward conversation.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Assume Familiarity&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;If you struggle both with talking to strangers and girls that you cold-approach then pay attention to &lt;strong&gt;how do you talk to people you already know.&lt;/strong&gt; Hell, even record yourself and realize that most of the things that come out of your mouth are simple statements. You don&amp;#39;t ask &amp;quot;And then?&amp;quot; you say &amp;quot;No way!&amp;quot; expecting the other party to follow up.&lt;/p&gt;\n\n&lt;p&gt;So why are you behaving differently in front of a hot girl? &amp;quot;I don&amp;#39;t know her&amp;quot; is the usual answer. The thing is, you want to end up with her in your bed. And for that you have to either get to know each other or make an impression that you are already familiar. You can do that by &lt;strong&gt;treating her like someone you already know&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s why you &lt;strong&gt;assume familiarity&lt;/strong&gt;. You use assumptions like you already know her (&amp;quot;you&amp;#39;re always like that&amp;quot;, &amp;quot;I bet you...&amp;quot;, &amp;quot;as usual&amp;quot;) and you talk with her like with any other friend of yours. Of course you&amp;#39;ll flirt and sexualize the conversation which is something I hope you’re not doing with your male colleagues.&lt;/p&gt;\n\n&lt;p&gt;You want her to know that &lt;strong&gt;you&amp;#39;re hitting on her&lt;/strong&gt;. But you definitely don&amp;#39;t want to emphasize that you&amp;#39;ve just met by the way you talk. Don&amp;#39;t even think of addressing her as Miss (unless to joke around).&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Questions In Texting&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;A very old and still very up-to-date piece of advice on texting is the SQI model. *&lt;em&gt;Statement-Question-Invite. *&lt;/em&gt;Try to balance all three and you&amp;#39;ll be fine. Remember that it&amp;#39;s a rule of thumb so if your last two-three texts were statements, then it&amp;#39;s time for a question (or an invite).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen far too many text conversations starting with &amp;quot;What&amp;#39;s up?&amp;quot; and then going through &amp;quot;What are you doing?&amp;quot; and into the abyss of &amp;quot;And then?&amp;quot; or something similar. I&amp;#39;ve touched upon that topic when I wrote the 3 tips to fix your texting game.&lt;/p&gt;\n\n&lt;p&gt;Your texts have to either &lt;strong&gt;bring you closer to an invite, increase your attractiveness or keep her interested&lt;/strong&gt; (if it&amp;#39;s a long-game). If they&amp;#39;re not doing any of that - don&amp;#39;t bother with sending them.&lt;/p&gt;\n\n&lt;p&gt;On the other hand I probably created quite a few &amp;quot;statement zombies&amp;quot; who try to never use a question mark in their texts. The level of mental acrobatics required to invite a girl on a date without using any questions at all is impressive. But it&amp;#39;s also foolish.&lt;/p&gt;\n\n&lt;p&gt;In case you&amp;#39;re wondering - &lt;strong&gt;it&amp;#39;s better to err on the side of not asking questions&lt;/strong&gt; but try to keep the flow of the conversation. If there&amp;#39;s something you want to ask about - do it. Even twice in a row, why not? Keep the conversation natural, assume familiarity and treat the advice you read as a guidelines.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;After all it is artistry, not engineering.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Lessons (re)learned:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Don&amp;#39;t ask those questions, use stements instead!&lt;/li&gt;\n&lt;li&gt;Easy way to not ask a question is saying &amp;quot;I bet you...&amp;quot; or &amp;quot;You look like a girl who...&amp;quot;.&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t take it too far. The conversation should feel natural.&lt;/li&gt;\n&lt;li&gt;Assume familiarity.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;That wasn&amp;#39;t that much of a mental masturbation like my other posts. If you like that then take a look at my &lt;a href=\"https://tddaygame.com/blog/\"&gt;daygame blog&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**Summary:** One of the top issues guys have when it comes to talking to strangers is their desire to ask **thousand different questions**. It can be fixed by showing how to use statements, accusations, guesses and leading sentences to move the conversation forward. But some take it too far.\n\nA lot of men learning about those things are just **socially inexperienced**. They can thrive e.g. in their workplace but put them next to a total stranger and they have no clue what to do. When they see a simple, useful piece of advice that seems to work (\"don't ask questions, speak in statements\") they take it to the extreme and avoid questions like they’re avoiding golddiggers. And that can get weird pretty quickly.\n\n&amp;nbsp;\n\n**Too Much of Anything Is Always Bad**\n\n&amp;nbsp;\n\nIf there is **too much of something**, then sure as hell it's not right. You can go over the top with anything - from saying too many compliments (one is fine, two is the limit for daygame interactions) to being too pushy (making fun of the poor girl all the time). You have to find the sweet spot, which is different for every man.\n\nThe whole goal of **learning pickup** is to be able to show the \"best version of yourself\". One guy is naturally funny and he jokes a lot. Therefore, for him the optimal level of jerkiness and challenging will be higher than for stone-cold Joe. That's a problem which is overcome only by calibration in field.\n\nThankfully, we don't have to guess anything about using questions. We know that asking too many is sucking value out of your interlocutor and is regarded as unattractive. **Avoid using too many questions.**\n\n\"Avoid.\" It's not a hard rule. Yes, it's better to use statements, assumptions, stories, challenges, jokes and exaggerations than to ask questions. There are various levels of detail you can convey in your messages. If you're asking a rich, **open questions** then you'll be fine. Don't take it to the extreme when it means having an awkward conversation.\n\n&amp;nbsp;\n\n**Assume Familiarity**\n\n&amp;nbsp;\n\nIf you struggle both with talking to strangers and girls that you cold-approach then pay attention to **how do you talk to people you already know.** Hell, even record yourself and realize that most of the things that come out of your mouth are simple statements. You don't ask \"And then?\" you say \"No way!\" expecting the other party to follow up.\n\nSo why are you behaving differently in front of a hot girl? \"I don't know her\" is the usual answer. The thing is, you want to end up with her in your bed. And for that you have to either get to know each other or make an impression that you are already familiar. You can do that by **treating her like someone you already know**.\n\nThat's why you **assume familiarity**. You use assumptions like you already know her (\"you're always like that\", \"I bet you...\", \"as usual\") and you talk with her like with any other friend of yours. Of course you'll flirt and sexualize the conversation which is something I hope you’re not doing with your male colleagues.\n\nYou want her to know that **you're hitting on her**. But you definitely don't want to emphasize that you've just met by the way you talk. Don't even think of addressing her as Miss (unless to joke around).\n\n&amp;nbsp;\n\n**Questions In Texting**\n\n&amp;nbsp;\n\nA very old and still very up-to-date piece of advice on texting is the SQI model. **Statement-Question-Invite. **Try to balance all three and you'll be fine. Remember that it's a rule of thumb so if your last two-three texts were statements, then it's time for a question (or an invite).\n\nI've seen far too many text conversations starting with \"What's up?\" and then going through \"What are you doing?\" and into the abyss of \"And then?\" or something similar. I've touched upon that topic when I wrote the 3 tips to fix your texting game.\n\nYour texts have to either **bring you closer to an invite, increase your attractiveness or keep her interested** (if it's a long-game). If they're not doing any of that - don't bother with sending them.\n\nOn the other hand I probably created quite a few \"statement zombies\" who try to never use a question mark in their texts. The level of mental acrobatics required to invite a girl on a date without using any questions at all is impressive. But it's also foolish.\n\nIn case you're wondering - **it's better to err on the side of not asking questions** but try to keep the flow of the conversation. If there's something you want to ask about - do it. Even twice in a row, why not? Keep the conversation natural, assume familiarity and treat the advice you read as a guidelines.\n\n&amp;nbsp;\n\nAfter all it is artistry, not engineering.\n\n&amp;nbsp;\n\n**Lessons (re)learned:**\n\n* Don't ask those questions, use stements instead!\n* Easy way to not ask a question is saying \"I bet you...\" or \"You look like a girl who...\".\n* Don't take it too far. The conversation should feel natural.\n* Assume familiarity.\n\n&amp;nbsp;\n\nThat wasn't that much of a mental masturbation like my other posts. If you like that then take a look at my [daygame blog](https://tddaygame.com/blog/).", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Red Pill Theory", "id": "658qet", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 38, "report_reasons": null, "author": "tddaygame", "saved": false, "mod_reports": [], "name": "t3_658qet", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": false, "link_flair_css_class": "theory", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheRedPill/comments/658qet/asking_too_muchtoo_little_questions/", "num_reports": null, "locked": false, "stickied": false, "created": 1492150759.0, "url": "https://www.reddit.com/r/TheRedPill/comments/658qet/asking_too_muchtoo_little_questions/", "author_flair_text": null, "quarantine": false, "title": "Asking Too Much/Too Little Questions", "created_utc": 1492121959.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 38}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658qet", "likes": null, "replies": "", "user_reports": [], "id": "dg914zk", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "GrabHerByThePEPE", "parent_id": "t3_658qet", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Excellent post. Key takeaway for me was \"definitely let her know you're hitting on her. Do not bring attention to the fact that you guys just met.\" The second one is clearly her role, our role is to push against that. Subconscious game, excellent. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Excellent post. Key takeaway for me was &amp;quot;definitely let her know you&amp;#39;re hitting on her. Do not bring attention to the fact that you guys just met.&amp;quot; The second one is clearly her role, our role is to push against that. Subconscious game, excellent. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg914zk", "score_hidden": false, "stickied": false, "created": 1492198782.0, "created_utc": 1492169982.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658qet", "likes": null, "replies": "", "user_reports": [], "id": "dgai87v", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "DM112090", "parent_id": "t3_658qet", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Read this on the commute home yesterday.\n\nExcellent practical advice. Your texting bit hit me outta left field. It's rare to see good texting advice on TRP, which sucks because of how annoyingly relevant it is to the game.\n\nKeep up the good work. Walk-ups take the most balls, hence why you're not getting more attention; sissies on here have no balls for your method.\n\nI'll keep reading what you got. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Read this on the commute home yesterday.&lt;/p&gt;\n\n&lt;p&gt;Excellent practical advice. Your texting bit hit me outta left field. It&amp;#39;s rare to see good texting advice on TRP, which sucks because of how annoyingly relevant it is to the game.&lt;/p&gt;\n\n&lt;p&gt;Keep up the good work. Walk-ups take the most balls, hence why you&amp;#39;re not getting more attention; sissies on here have no balls for your method.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll keep reading what you got. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgai87v", "score_hidden": false, "stickied": false, "created": 1492279279.0, "created_utc": 1492250479.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658qet", "likes": null, "replies": "", "user_reports": [], "id": "dgbr9jx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TRPLeader", "parent_id": "t3_658qet", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Maybe it's me. I don't text much. Unless we've already slept together. Then I'm very casual. \n\nFirst meets will be super short with minimal fluff. Might start with a link to whatever I just was reading. When I get a reply will send \"come to X at 8 for a drink.\"\n\nHave tried texting more. Do not find it overly valuable. Have not found it makes much difference. If anything, it shows over investment on my part and degrades attraction. \n\nThoughts? Would love recommendation if any think there are more textually verbose methods which will bring greater results. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe it&amp;#39;s me. I don&amp;#39;t text much. Unless we&amp;#39;ve already slept together. Then I&amp;#39;m very casual. &lt;/p&gt;\n\n&lt;p&gt;First meets will be super short with minimal fluff. Might start with a link to whatever I just was reading. When I get a reply will send &amp;quot;come to X at 8 for a drink.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Have tried texting more. Do not find it overly valuable. Have not found it makes much difference. If anything, it shows over investment on my part and degrades attraction. &lt;/p&gt;\n\n&lt;p&gt;Thoughts? Would love recommendation if any think there are more textually verbose methods which will bring greater results. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgbr9jx", "score_hidden": false, "stickied": false, "created": 1492351012.0, "created_utc": 1492322212.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]