[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I think this is going to be a long post, because I want to get as much as I can out of this; therefore, I think it is best to say everything so that responses can be as precise and helpful as possible. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Intro&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I am currently 22 years old, a recent graduate of college, and I started a job as a high school teacher this year. I have had a girlfriend (who is 23) for the past 7.5 years. That&amp;#39;s right, I started dating her when I was 15 or so. I want to first describe the background to how I got with her to better frame this entire thing.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Background&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;When I was in early middle school, I had ONEitis bad; I was the typical nice guy beta who tried so hard to get this one chick. And what a surprise, she LJBF&amp;#39;d me and never got with me. After going after her for literally 2 years, I was super distraught and angry. Although I was only like 12 or something, it really hit home. So, then I started not giving a fuck with women, and started working on my flirting game. By the end of middle school and the beginning of high school, I was kind of spinning plates. I was too much of a pussy (I was just scared and nervous at the time) to actually get with any of them, but I flirted with many girls who flirted back, and a few offered to fuck me or give me a bj. I can&amp;#39;t explain why I didn&amp;#39;t (again, I had never done it before and I was like 13 or 14) so I declined. I was really working my game though. &lt;/p&gt;\n\n&lt;p&gt;By the end of my freshman year, one of those spinning plates was my current gf. I flirted with her for a bit, and when she stopped flirting back, I dropped the plate. After I started flirting and getting with some other girl, my gf wanted me BAD. I told her to wait a few weeks, and maybe I would change my mind. Now, this sounds pretty alpha (and it was), I just had no idea I was doing it. Well, a few weeks went by, and I didn&amp;#39;t get with her.&lt;/p&gt;\n\n&lt;p&gt;Fast forward about a year later, she still wants to get with me, and I am still not letting her. This was mostly because I wasn&amp;#39;t really sure I wanted a relationship. Anyway, after another few months (and not being aware of TRP at the time coupled with me being a naive 15 year old) I started dating her.&lt;/p&gt;\n\n&lt;p&gt;A few concluding thoughts from the background are that I was pretty alpha without knowing it and she was a plate. I think I have always had some of the TRP principles in me, I just never knew I used them or had them. Also, she was a plate, which I think is a good thing, but I&amp;#39;m not sure. Anyway, let me progress to summarizing the past 7 years.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;My Relationship for the Past 7 Years&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;So, only being 15, and her being 16, we really didn&amp;#39;t know what the fuck we were doing. However, I definitely held all the power in the relationship-she first offered to give me a handjob (I had never done it before). Then, the next week a blowjob. And, after the first year, sex. Now while this seems like it is moving very slowly, please keep in mind our age at the time. Things were going alright, but there were definitely shit tests.&lt;/p&gt;\n\n&lt;p&gt;I remember very vividly there were times where she would try to stop me from seeing my friends, or subtly get upset at the fact that I was spending time with other people. She would do the same thing when I mentioned my female friends. Again, not being aware of TRP, I started doing one of two things to keep from upsetting her: 1) I would lie to her. I have lied to her so many times about things that are so mundane, especially when we were teens. I went to my female &amp;#39;friend&amp;#39;s&amp;#39; house and lied to her saying I went to a male friend&amp;#39;s. I have lied to her and said that I am home alone when I am out with my friends, etc. Or 2) I would give in, and just hang out with her instead of my friends. I didn&amp;#39;t make it a big deal, but it definitely annoyed me.&lt;/p&gt;\n\n&lt;p&gt;The past 6 years was the typical relationship shit, with us calling each other pet names, saying how much we love each other - ONEitis shit. While this all happened, though, I definitely kept a relatively strong frame, or at least I still had the power in the relationship in the sense that she needed me MUCH more than I needed her. The biggest changes happened in the past year.&lt;/p&gt;\n\n&lt;p&gt;Last year, she started becoming distant from me after some arguments over religion (I&amp;#39;m an atheist, she is not), children (she wants them, I&amp;#39;m not sure), and other things. There was a dead bedroom for literally 4-5 months, and she rejected all of my initiations. I wish I could say I dropped her ass, but I beta-ed out. I cried like a bitch, wrote her love notes, bought her shit, etc. The rationale for me was that I was going to try everything in my power to keep her as my gf, and if she didn&amp;#39;t come back to normal by X date, I was going to break up with her. The motivation was more out of making sure that I was not to blame for this failing relationship than anything. Well, it almost came to the point where I broke it with her, but she came back apologizing and making up to me etc. While that was a year ago, it still fuels emotions in me.&lt;/p&gt;\n\n&lt;p&gt;Over that past year, I really healed a lot. I realized that this relationship - a 7 year &amp;#39;sure thing&amp;#39; as I had thought it - is not permanent nor destined. I am MUCH more reserved in showing too much affection to her, and try not to repeat my past mistake. She sometimes gets frustrated with how I am act now (more conservative with loving her I suppose you could say). I remember just in February she claimed &amp;quot;I wish it was the way it was before.&amp;quot; It hurt me, but at the same time I was okay with her being upset. I have some anger in me now that&amp;#39;s like, &amp;quot;Bitch, do you have any idea what you put me through those 4-5 months last year? Get the fuck out of here.&amp;quot; But I still respect her and I do love her. I just want to make sure I am on the right track with everything. I want to make sure that &lt;em&gt;I&lt;/em&gt; am happy and that &lt;em&gt;I&lt;/em&gt; am getting the most out of life. So, I want to talk about where I am now.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Current Position&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I literally just started reading the Rational Male book, so I am no expert in TRP (if that&amp;#39;s obvious enough). I want to describe my very recent experiences so that you can make sense of them for me and also give me some suggestions. In regards to my relationship, I am still with her, and I am being more alpha in regards to doing what I want (most of the time). I think it is still important to compromise, but I do what I want if it is important to me. I have recently been hitting up strip clubs, but I don&amp;#39;t know why. Like this week I hit one up by myself, flirted with some chicks, etc. I don&amp;#39;t get to flirt with girls often at all because I never go out (I have work, grad school work, or I am with the gf or friends). I don&amp;#39;t know why I am hitting up strip clubs, but I think I am done with that since all they want is my money, and there not fucking worth it. I am hiding the fact that I went to strip clubs from my gf, as she is super jealous and would freak out if she knew. If she asked me if I have ever been to one, I would probably lie. Part of me feels like that&amp;#39;s beta though? What are your thoughts with this?&lt;/p&gt;\n\n&lt;p&gt;I have taken up hobbies such as guitar and MMA, which I consistently have practiced 3-4 times per week for a few months now. I don&amp;#39;t go to the gym because of the cost, but I might soon (I used to 2 years ago, but it got pretty expensive). I am trying to develop more professionally, but as a teacher, it is hard - there is no merit based promotions in the typical sense. &lt;/p&gt;\n\n&lt;p&gt;She, however, is putting pressure on me to marry her. I don&amp;#39;t really answer her, but she will - every few months or so - make a &amp;#39;joke&amp;#39; about getting married. I&amp;#39;m not necessarily against getting married to her, in fact I&amp;#39;m not against it at all, I just want to wait. I&amp;#39;m not in a position to lose much of my shit, she makes more than me; but I am NOT getting married now. She got us rings to wear on our wedding finger, which I typically do and she does too. Again, this might be the wrong move, idk. It would definitely hurt her if I didn&amp;#39;t wear it. What should I do with this? I have already worn it for the past 6-7 months. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Future&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;So where do I go from here? What am I still fucking up on, and what should I be doing? I already plan on finishing the Rational Male, but what should I actually be &lt;em&gt;doing&lt;/em&gt; to get the most out of my life and relationship? Please ask questions if you need more info, I want to get something out of this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I think this is going to be a long post, because I want to get as much as I can out of this; therefore, I think it is best to say everything so that responses can be as precise and helpful as possible. \n\n**Intro**\n\nI am currently 22 years old, a recent graduate of college, and I started a job as a high school teacher this year. I have had a girlfriend (who is 23) for the past 7.5 years. That's right, I started dating her when I was 15 or so. I want to first describe the background to how I got with her to better frame this entire thing.\n\n**Background**\n\nWhen I was in early middle school, I had ONEitis bad; I was the typical nice guy beta who tried so hard to get this one chick. And what a surprise, she LJBF'd me and never got with me. After going after her for literally 2 years, I was super distraught and angry. Although I was only like 12 or something, it really hit home. So, then I started not giving a fuck with women, and started working on my flirting game. By the end of middle school and the beginning of high school, I was kind of spinning plates. I was too much of a pussy (I was just scared and nervous at the time) to actually get with any of them, but I flirted with many girls who flirted back, and a few offered to fuck me or give me a bj. I can't explain why I didn't (again, I had never done it before and I was like 13 or 14) so I declined. I was really working my game though. \n\nBy the end of my freshman year, one of those spinning plates was my current gf. I flirted with her for a bit, and when she stopped flirting back, I dropped the plate. After I started flirting and getting with some other girl, my gf wanted me BAD. I told her to wait a few weeks, and maybe I would change my mind. Now, this sounds pretty alpha (and it was), I just had no idea I was doing it. Well, a few weeks went by, and I didn't get with her.\n\nFast forward about a year later, she still wants to get with me, and I am still not letting her. This was mostly because I wasn't really sure I wanted a relationship. Anyway, after another few months (and not being aware of TRP at the time coupled with me being a naive 15 year old) I started dating her.\n\nA few concluding thoughts from the background are that I was pretty alpha without knowing it and she was a plate. I think I have always had some of the TRP principles in me, I just never knew I used them or had them. Also, she was a plate, which I think is a good thing, but I'm not sure. Anyway, let me progress to summarizing the past 7 years.\n\n**My Relationship for the Past 7 Years**\n\nSo, only being 15, and her being 16, we really didn't know what the fuck we were doing. However, I definitely held all the power in the relationship-she first offered to give me a handjob (I had never done it before). Then, the next week a blowjob. And, after the first year, sex. Now while this seems like it is moving very slowly, please keep in mind our age at the time. Things were going alright, but there were definitely shit tests.\n\nI remember very vividly there were times where she would try to stop me from seeing my friends, or subtly get upset at the fact that I was spending time with other people. She would do the same thing when I mentioned my female friends. Again, not being aware of TRP, I started doing one of two things to keep from upsetting her: 1) I would lie to her. I have lied to her so many times about things that are so mundane, especially when we were teens. I went to my female 'friend's' house and lied to her saying I went to a male friend's. I have lied to her and said that I am home alone when I am out with my friends, etc. Or 2) I would give in, and just hang out with her instead of my friends. I didn't make it a big deal, but it definitely annoyed me.\n\nThe past 6 years was the typical relationship shit, with us calling each other pet names, saying how much we love each other - ONEitis shit. While this all happened, though, I definitely kept a relatively strong frame, or at least I still had the power in the relationship in the sense that she needed me MUCH more than I needed her. The biggest changes happened in the past year.\n\nLast year, she started becoming distant from me after some arguments over religion (I'm an atheist, she is not), children (she wants them, I'm not sure), and other things. There was a dead bedroom for literally 4-5 months, and she rejected all of my initiations. I wish I could say I dropped her ass, but I beta-ed out. I cried like a bitch, wrote her love notes, bought her shit, etc. The rationale for me was that I was going to try everything in my power to keep her as my gf, and if she didn't come back to normal by X date, I was going to break up with her. The motivation was more out of making sure that I was not to blame for this failing relationship than anything. Well, it almost came to the point where I broke it with her, but she came back apologizing and making up to me etc. While that was a year ago, it still fuels emotions in me.\n\nOver that past year, I really healed a lot. I realized that this relationship - a 7 year 'sure thing' as I had thought it - is not permanent nor destined. I am MUCH more reserved in showing too much affection to her, and try not to repeat my past mistake. She sometimes gets frustrated with how I am act now (more conservative with loving her I suppose you could say). I remember just in February she claimed \"I wish it was the way it was before.\" It hurt me, but at the same time I was okay with her being upset. I have some anger in me now that's like, \"Bitch, do you have any idea what you put me through those 4-5 months last year? Get the fuck out of here.\" But I still respect her and I do love her. I just want to make sure I am on the right track with everything. I want to make sure that *I* am happy and that *I* am getting the most out of life. So, I want to talk about where I am now.\n\n**Current Position**\n\nI literally just started reading the Rational Male book, so I am no expert in TRP (if that's obvious enough). I want to describe my very recent experiences so that you can make sense of them for me and also give me some suggestions. In regards to my relationship, I am still with her, and I am being more alpha in regards to doing what I want (most of the time). I think it is still important to compromise, but I do what I want if it is important to me. I have recently been hitting up strip clubs, but I don't know why. Like this week I hit one up by myself, flirted with some chicks, etc. I don't get to flirt with girls often at all because I never go out (I have work, grad school work, or I am with the gf or friends). I don't know why I am hitting up strip clubs, but I think I am done with that since all they want is my money, and there not fucking worth it. I am hiding the fact that I went to strip clubs from my gf, as she is super jealous and would freak out if she knew. If she asked me if I have ever been to one, I would probably lie. Part of me feels like that's beta though? What are your thoughts with this?\n\nI have taken up hobbies such as guitar and MMA, which I consistently have practiced 3-4 times per week for a few months now. I don't go to the gym because of the cost, but I might soon (I used to 2 years ago, but it got pretty expensive). I am trying to develop more professionally, but as a teacher, it is hard - there is no merit based promotions in the typical sense. \n\nShe, however, is putting pressure on me to marry her. I don't really answer her, but she will - every few months or so - make a 'joke' about getting married. I'm not necessarily against getting married to her, in fact I'm not against it at all, I just want to wait. I'm not in a position to lose much of my shit, she makes more than me; but I am NOT getting married now. She got us rings to wear on our wedding finger, which I typically do and she does too. Again, this might be the wrong move, idk. It would definitely hurt her if I didn't wear it. What should I do with this? I have already worn it for the past 6-7 months. \n\n**The Future**\n\nSo where do I go from here? What am I still fucking up on, and what should I be doing? I already plan on finishing the Rational Male, but what should I actually be *doing* to get the most out of my life and relationship? Please ask questions if you need more info, I want to get something out of this.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "", "id": "658vpm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "JewBarbeque1942", "saved": false, "mod_reports": [], "name": "t3_658vpm", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": 1492124157.0, "link_flair_css_class": "unflaired", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheRedPill/comments/658vpm/new_to_trp_been_in_a_relationship_my_whole_life/", "num_reports": null, "locked": false, "stickied": false, "created": 1492152334.0, "url": "https://www.reddit.com/r/TheRedPill/comments/658vpm/new_to_trp_been_in_a_relationship_my_whole_life/", "author_flair_text": null, "quarantine": false, "title": "New to TRP, been in a relationship my whole life, need some advice.", "created_utc": 1492123534.0, "distinguished": null, "media": null, "upvote_ratio": 0.63, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658vpm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658vpm", "likes": null, "replies": "", "user_reports": [], "id": "dg9tnd7", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ideal_lemon", "parent_id": "t1_dg8hy9c", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "man i wish you lived inside my head mentoring me everyday.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;man i wish you lived inside my head mentoring me everyday.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9tnd7", "score_hidden": false, "stickied": false, "created": 1492235994.0, "created_utc": 1492207194.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8hy9c", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "MattyAnon", "parent_id": "t3_658vpm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "*Trying to make it work* is the biggest mistake.\n\nYou want to be permanently trying to escape, and only staying if she makes things *awesome*.\n\n&gt;  I don't know why I am hitting up strip clubs\n\nBecause you want other women - contact with them at least.\n\n&gt; She, however, is putting pressure on me to marry her\n\n#Do Not Marry\n\nIt's simply a terrible deal.  You've already learned that without some degree of threatening to leave she'll treat you like shit.  You want to remove the only power you have?\n\nYou want to replace \"Deny me sex and I will leave you\" with \"Deny me sex and I will leave you half my stuff and pay you alimony\" ?\n\n&gt;  I'm not necessarily against getting married to her\n\nYou have a lot to learn about women if you think that marriage placates them or benefits you in ANY way.  It's simply a financial trap for men, and confers ZERO advantage to you.  It's expensive to marry, limits your options, and expensive to divorce.  FOR LIFE.\n\n&gt; She got us rings to wear on our wedding finger, which I typically do and she does too\n\nLegally this may constitute marriage in your state.  Check the laws.  She's being clever here because \"carrying on as if married\" can be construed as legally married in some places.\n\n&gt; t. I'm not in a position to lose much of my shit, she makes more than me; but I am NOT getting married now.\n\nIf she stops working, you'll owe her money.  And she will, once you give her ~~a retirement plan~~ marriage.\n\n&gt; It would definitely hurt her if I didn't wear it.\n\nYou need to put YOU first.  Haven't you learned that yet?\n\n&gt; So where do I go from here? What am I still fucking up on, and what should I be doing? \n\nFundamentally you need to let her and the relationship go.  You are dependent and invested in it.  This is fucking with your head.  Whether you stay with her or not should be dependent on how awesome a time you're having with her, not because you are *trying to make things work*.\n\n&gt; I already plan on finishing the Rational Male, but what should I actually be doing to get the most out of my life and relationship? \n\nLive your life as if you had no relationship.  Let her be only a benefit, never a cost.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Trying to make it work&lt;/em&gt; is the biggest mistake.&lt;/p&gt;\n\n&lt;p&gt;You want to be permanently trying to escape, and only staying if she makes things &lt;em&gt;awesome&lt;/em&gt;.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t know why I am hitting up strip clubs&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Because you want other women - contact with them at least.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She, however, is putting pressure on me to marry her&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;h1&gt;Do Not Marry&lt;/h1&gt;\n\n&lt;p&gt;It&amp;#39;s simply a terrible deal.  You&amp;#39;ve already learned that without some degree of threatening to leave she&amp;#39;ll treat you like shit.  You want to remove the only power you have?&lt;/p&gt;\n\n&lt;p&gt;You want to replace &amp;quot;Deny me sex and I will leave you&amp;quot; with &amp;quot;Deny me sex and I will leave you half my stuff and pay you alimony&amp;quot; ?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m not necessarily against getting married to her&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You have a lot to learn about women if you think that marriage placates them or benefits you in ANY way.  It&amp;#39;s simply a financial trap for men, and confers ZERO advantage to you.  It&amp;#39;s expensive to marry, limits your options, and expensive to divorce.  FOR LIFE.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She got us rings to wear on our wedding finger, which I typically do and she does too&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Legally this may constitute marriage in your state.  Check the laws.  She&amp;#39;s being clever here because &amp;quot;carrying on as if married&amp;quot; can be construed as legally married in some places.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;t. I&amp;#39;m not in a position to lose much of my shit, she makes more than me; but I am NOT getting married now.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If she stops working, you&amp;#39;ll owe her money.  And she will, once you give her &lt;del&gt;a retirement plan&lt;/del&gt; marriage.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It would definitely hurt her if I didn&amp;#39;t wear it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You need to put YOU first.  Haven&amp;#39;t you learned that yet?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So where do I go from here? What am I still fucking up on, and what should I be doing? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Fundamentally you need to let her and the relationship go.  You are dependent and invested in it.  This is fucking with your head.  Whether you stay with her or not should be dependent on how awesome a time you&amp;#39;re having with her, not because you are &lt;em&gt;trying to make things work&lt;/em&gt;.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I already plan on finishing the Rational Male, but what should I actually be doing to get the most out of my life and relationship? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Live your life as if you had no relationship.  Let her be only a benefit, never a cost.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8hy9c", "score_hidden": false, "stickied": false, "created": 1492159183.0, "created_utc": 1492130383.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658vpm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658vpm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658vpm", "likes": null, "replies": "", "user_reports": [], "id": "dg8sb37", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Arminarmeen", "parent_id": "t1_dg8rwef", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "My thoughts? Here are my though. From a 3rd person perspective.\n\n1. We are young and only live a limited time on earth, so we might as well make use of our resources, and of course create resources so we will be happy. Understand that one day everyone you know, in your family is going to die, so make use of your time wisely.\n2. Technology enabled us to connect in a way we could never before. You can literally hop on a plane that costs 2 weeks of pay, and meet women in china, spain, russia, fucking everywhere. \n3. You've been fucking around for 7 fucking years brother. 7. Your cock's worth won't decline until you are 35. It might not even decline when you're 45 if youre in prime shape.\n4. Imagne the best day of your life when you felt fucking amazing, that how your days should be, and if you are stressing about being ONE with a woman, tieing yourself to her, living in the same house, with all these bullshit rules, you re giving away your freedom.\n5. Once you lose everything is when you are free to do anything. I know, because I wanted to marry as well, once, I'm 21 now, but those days are gone. And after I got over her, I'm completely free.  Once you lose everything is when you are free to do anything.\n6. Way too much pressure, break free from the shackles and do what YOU want to do. You won't marry a chick unless you are 100% about her...are you a 100% about her? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My thoughts? Here are my though. From a 3rd person perspective.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;We are young and only live a limited time on earth, so we might as well make use of our resources, and of course create resources so we will be happy. Understand that one day everyone you know, in your family is going to die, so make use of your time wisely.&lt;/li&gt;\n&lt;li&gt;Technology enabled us to connect in a way we could never before. You can literally hop on a plane that costs 2 weeks of pay, and meet women in china, spain, russia, fucking everywhere. &lt;/li&gt;\n&lt;li&gt;You&amp;#39;ve been fucking around for 7 fucking years brother. 7. Your cock&amp;#39;s worth won&amp;#39;t decline until you are 35. It might not even decline when you&amp;#39;re 45 if youre in prime shape.&lt;/li&gt;\n&lt;li&gt;Imagne the best day of your life when you felt fucking amazing, that how your days should be, and if you are stressing about being ONE with a woman, tieing yourself to her, living in the same house, with all these bullshit rules, you re giving away your freedom.&lt;/li&gt;\n&lt;li&gt;Once you lose everything is when you are free to do anything. I know, because I wanted to marry as well, once, I&amp;#39;m 21 now, but those days are gone. And after I got over her, I&amp;#39;m completely free.  Once you lose everything is when you are free to do anything.&lt;/li&gt;\n&lt;li&gt;Way too much pressure, break free from the shackles and do what YOU want to do. You won&amp;#39;t marry a chick unless you are 100% about her...are you a 100% about her? &lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8sb37", "score_hidden": false, "stickied": false, "created": 1492174730.0, "created_utc": 1492145930.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658vpm", "likes": null, "replies": "", "user_reports": [], "id": "dgafwou", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "juliusstreicher", "parent_id": "t1_dg8rwef", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; She is pressuring me to marry her, which I ignore or say 'not yet' to. What are your thoughts?\n\nYou are afraid to tell her that you went to a strip club.  It doesn't matter what his thoughts are, you will marry her, have a miserable 3 year marriage with a lot of arguing, and then divorce. But, she will quit her job at the end of the first 8 months, \"to try and make the marriage work\", and get pregnant.  She will be fucking Chad by the time the baby is 6 months old, and you will owe her alimony and child support. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She is pressuring me to marry her, which I ignore or say &amp;#39;not yet&amp;#39; to. What are your thoughts?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You are afraid to tell her that you went to a strip club.  It doesn&amp;#39;t matter what his thoughts are, you will marry her, have a miserable 3 year marriage with a lot of arguing, and then divorce. But, she will quit her job at the end of the first 8 months, &amp;quot;to try and make the marriage work&amp;quot;, and get pregnant.  She will be fucking Chad by the time the baby is 6 months old, and you will owe her alimony and child support. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgafwou", "score_hidden": false, "stickied": false, "created": 1492272021.0, "created_utc": 1492243221.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8rwef", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JewBarbeque1942", "parent_id": "t1_dg8rmai", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I'm not sure if you are aware, since you didn't read through it, but we are 22 and 23 now. In terms of your steps, I have done #2,3, &amp; 4 (starting up 1 again soon). She may be playing power games, but there is no doubt I have the power - the only time I didn't was one point last year where I lost my shit. She is pressuring me to marry her, which I ignore or say 'not yet' to. What are your thoughts?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure if you are aware, since you didn&amp;#39;t read through it, but we are 22 and 23 now. In terms of your steps, I have done #2,3, &amp;amp; 4 (starting up 1 again soon). She may be playing power games, but there is no doubt I have the power - the only time I didn&amp;#39;t was one point last year where I lost my shit. She is pressuring me to marry her, which I ignore or say &amp;#39;not yet&amp;#39; to. What are your thoughts?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8rwef", "score_hidden": false, "stickied": false, "created": 1492173973.0, "created_utc": 1492145173.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8rmai", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Arminarmeen", "parent_id": "t3_658vpm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I shit you not, I scrolled through the whole thing and I saw \"15 &amp; 16\" and I didn't even read the article. I didn't read it because I don't have much time.\n\n1. Start lifting if you aren't already.\n2. Focus on your studying and start boxing, or muay thai, or any physical sport.\n3. Have 1 or 2 serious hobbies that will pay off in the long run\n4. Get a job &amp; money. Do things for you, for your future. \n5. It is said that women are 3-4 years ahead of men mentally up until they are about 22-24, so basically she's using you.\n6. I just read \"she is pressuring to marry you\"...honestly... every relationship has power, it just depends on who has it. Honestly, she is playing a power game with you, you are just a body to her, and entity she needs to conquer.. for herself. She is just seeing if she can tame you.\n7. Leave her, and focus on you.\n\nIn all honestly, this is so much of a headfuck and pressure on you, as I've said, the only thing I read is \"15 &amp; 16\" and \"She, however, is putting pressure on me to marry her\" this is too much pressure if you are coming here to RedPill and asking for advice. It is fucking with your head big time. For this reason, refer to my points, follow it, and just dump her. She is playing a power game. Ignore her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I shit you not, I scrolled through the whole thing and I saw &amp;quot;15 &amp;amp; 16&amp;quot; and I didn&amp;#39;t even read the article. I didn&amp;#39;t read it because I don&amp;#39;t have much time.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Start lifting if you aren&amp;#39;t already.&lt;/li&gt;\n&lt;li&gt;Focus on your studying and start boxing, or muay thai, or any physical sport.&lt;/li&gt;\n&lt;li&gt;Have 1 or 2 serious hobbies that will pay off in the long run&lt;/li&gt;\n&lt;li&gt;Get a job &amp;amp; money. Do things for you, for your future. &lt;/li&gt;\n&lt;li&gt;It is said that women are 3-4 years ahead of men mentally up until they are about 22-24, so basically she&amp;#39;s using you.&lt;/li&gt;\n&lt;li&gt;I just read &amp;quot;she is pressuring to marry you&amp;quot;...honestly... every relationship has power, it just depends on who has it. Honestly, she is playing a power game with you, you are just a body to her, and entity she needs to conquer.. for herself. She is just seeing if she can tame you.&lt;/li&gt;\n&lt;li&gt;Leave her, and focus on you.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;In all honestly, this is so much of a headfuck and pressure on you, as I&amp;#39;ve said, the only thing I read is &amp;quot;15 &amp;amp; 16&amp;quot; and &amp;quot;She, however, is putting pressure on me to marry her&amp;quot; this is too much pressure if you are coming here to RedPill and asking for advice. It is fucking with your head big time. For this reason, refer to my points, follow it, and just dump her. She is playing a power game. Ignore her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8rmai", "score_hidden": false, "stickied": false, "created": 1492173470.0, "created_utc": 1492144670.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658vpm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658vpm", "likes": null, "replies": "", "user_reports": [], "id": "dg8ps9u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg8ou2e", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "It's interesting to see the qualitative effect that being devalued like that bears on them. It contorts them from being these gnarled entitled caricatures of women into their real authentic biological state. Once you strip them of their worth by letting them know that they aren't much more than an orifice to blow off steam in after they've invested so much time in a relationship with you, it kind of cracks their psyche and their puffed up phony self esteem.  Every last one of them becomes hyper obedient and subservient and completely feminine when you gift them with the drama, pain and belittlement of being demoted to a plate. It's weird to wrap your head around but it's a beautiful thing to witness.", "edited": 1492141873.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s interesting to see the qualitative effect that being devalued like that bears on them. It contorts them from being these gnarled entitled caricatures of women into their real authentic biological state. Once you strip them of their worth by letting them know that they aren&amp;#39;t much more than an orifice to blow off steam in after they&amp;#39;ve invested so much time in a relationship with you, it kind of cracks their psyche and their puffed up phony self esteem.  Every last one of them becomes hyper obedient and subservient and completely feminine when you gift them with the drama, pain and belittlement of being demoted to a plate. It&amp;#39;s weird to wrap your head around but it&amp;#39;s a beautiful thing to witness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8ps9u", "score_hidden": false, "stickied": false, "created": 1492170422.0, "created_utc": 1492141622.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ou2e", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "looseonthemoose1321", "parent_id": "t3_658vpm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Hey dude, I was actually in a KIND-OF similar position as you (22M, College grad, etc.)\n\nThe best advice I can give you right now is to think about YOURSELF and what YOU WANT, and just go for it. Fuck the 7.5 years invested, fuck all the memories (which serve no purpose but to shackle you back into an LTR that is not good for your growth), fuck what EVERYONE ELSE says, thinks, and feels. The ONLY person you should be worried about right now in your life is YOURSELF.\n\nI started my RP journey about 3 months ago after going through a breakup with my LTR of 2.5 years. It took me MONTHS just to realize that throughout my entire LTR, I was emasculated, no matter how much I tried to make it seem like I wasn't.\n\nThink about it. You're 22. You're in the PRIME age range of your young adult life. THIS is the time to explore your FULLEST potential. I can put this on my life: There IS a better woman out there for you than your current GF. There is. Trust me.\n\nMisc. tips:\n\n1. Add \"No More Mr. Nice Guy\" to your reading list. Start reading it ASAP. I feel like that book may make a lot of your issues clear to you.\n\n2. There is no such thing as the gym being \"too costly\". Lifting and going to a gym literally adds YEARS to your lifespan. I've seen multiple $10/month gyms. And if you don't have that, go to a rec center and lift there. Going to the gym and lifting is just as important as eating in this RP lifestyle you've decided to walk in. Do NOT bullshit yourself saying the gym is too costly. You will be severely stunting your growth.\n\n3. I'm not saying you have to dump your LTR (I was hesitant on dropping mines as well), but you will find stunted growth in your progression if you leave things as they are. She MUST be demoted in some way for you to truly learn and figure out RP 100%, and I say this because you must EXPERIENCE what it's like to be alone in order to see that you will be just fine without a woman, and to see the enjoyment you gain from other women whom to them, you are a complete stranger. Me personally, I demoted my LTR to plate status after being initially hesitant. I had yet to develop an 'abundance' mindset and was suffering from one-itis, but now I see that there are an INFINITE number of women out there who would value me, even as I am now, not at my fullest potential.", "edited": 1492140948.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey dude, I was actually in a KIND-OF similar position as you (22M, College grad, etc.)&lt;/p&gt;\n\n&lt;p&gt;The best advice I can give you right now is to think about YOURSELF and what YOU WANT, and just go for it. Fuck the 7.5 years invested, fuck all the memories (which serve no purpose but to shackle you back into an LTR that is not good for your growth), fuck what EVERYONE ELSE says, thinks, and feels. The ONLY person you should be worried about right now in your life is YOURSELF.&lt;/p&gt;\n\n&lt;p&gt;I started my RP journey about 3 months ago after going through a breakup with my LTR of 2.5 years. It took me MONTHS just to realize that throughout my entire LTR, I was emasculated, no matter how much I tried to make it seem like I wasn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;Think about it. You&amp;#39;re 22. You&amp;#39;re in the PRIME age range of your young adult life. THIS is the time to explore your FULLEST potential. I can put this on my life: There IS a better woman out there for you than your current GF. There is. Trust me.&lt;/p&gt;\n\n&lt;p&gt;Misc. tips:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Add &amp;quot;No More Mr. Nice Guy&amp;quot; to your reading list. Start reading it ASAP. I feel like that book may make a lot of your issues clear to you.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There is no such thing as the gym being &amp;quot;too costly&amp;quot;. Lifting and going to a gym literally adds YEARS to your lifespan. I&amp;#39;ve seen multiple $10/month gyms. And if you don&amp;#39;t have that, go to a rec center and lift there. Going to the gym and lifting is just as important as eating in this RP lifestyle you&amp;#39;ve decided to walk in. Do NOT bullshit yourself saying the gym is too costly. You will be severely stunting your growth.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I&amp;#39;m not saying you have to dump your LTR (I was hesitant on dropping mines as well), but you will find stunted growth in your progression if you leave things as they are. She MUST be demoted in some way for you to truly learn and figure out RP 100%, and I say this because you must EXPERIENCE what it&amp;#39;s like to be alone in order to see that you will be just fine without a woman, and to see the enjoyment you gain from other women whom to them, you are a complete stranger. Me personally, I demoted my LTR to plate status after being initially hesitant. I had yet to develop an &amp;#39;abundance&amp;#39; mindset and was suffering from one-itis, but now I see that there are an INFINITE number of women out there who would value me, even as I am now, not at my fullest potential.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8ou2e", "score_hidden": false, "stickied": false, "created": 1492168920.0, "created_utc": 1492140120.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658vpm", "likes": null, "replies": "", "user_reports": [], "id": "dg8xg7s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Shakydrummer", "parent_id": "t3_658vpm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Dude you're lying about half the shit you want to do. You want to keep doing that? Also fuck marriage. Can you imagine all that lying coming up, except in a sense that you're legally bound to her  instead of just being able to drop her?\nStop being afraid to drop your boundaries a bit more! You'll simply put have a better understanding for yourself if you think it's worth it if you put what you want in perspective to her and yourself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude you&amp;#39;re lying about half the shit you want to do. You want to keep doing that? Also fuck marriage. Can you imagine all that lying coming up, except in a sense that you&amp;#39;re legally bound to her  instead of just being able to drop her?\nStop being afraid to drop your boundaries a bit more! You&amp;#39;ll simply put have a better understanding for yourself if you think it&amp;#39;s worth it if you put what you want in perspective to her and yourself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8xg7s", "score_hidden": false, "stickied": false, "created": 1492187349.0, "created_utc": 1492158549.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658vpm", "likes": null, "replies": "", "user_reports": [], "id": "dg8d9l9", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "RedditAdminsSuck_88", "parent_id": "t3_658vpm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Dump the girl. Now. Why? Read the sidebar", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dump the girl. Now. Why? Read the sidebar&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8d9l9", "score_hidden": false, "stickied": false, "created": 1492152843.0, "created_utc": 1492124043.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658vpm", "likes": null, "replies": "", "user_reports": [], "id": "dg9x19i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Arie_R", "parent_id": "t3_658vpm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "You said you wanted to make sure you weren't to blame for your failing relationship but it doesn't sound like you approached your relationship like an adult considering you say you lied to her, and you also don't mention talking about why things didn't go very well at some point…. A relationship involves two people and doesn't always fall apart when one (or both) party does something unacceptable to the other, but often it's what people don't do that's causing the problems, like talking openly about your feelings and issues and finding ways to resolve these. It doesn't sound like you did this at all. \n\nIt sounds like you are treating her badly to punish her for what she supposedly did to you. I do not think that's the right way to treat a loved one and it's unproductive too. Why not just break up with her? Sounds like she'll be better off without you and this behaviour.\n\nFlirting with strippers/waitresses at a strip club? They likely have 0 interest in you and just want your money so don't take these experiences as any sort of info on how well you'll do with women whom you don't have to pay for their time/attention.\n\nIt sounds like you are too wrapped up in calling certain behaviours 'alpha' or 'beta' and that only 'alpha' behaviour is the way to go. I think that's a mistake.\n\nI don't think you should lie to your partner about where you are and what you are doing. If you think she won't approve, maybe talk to her about it. Find out why you feel the need to go to strip clubs, ask her if/why she has a problem with it and take it from there. Would you be happy if she goes to see male strippers?\n\nIt sounds like she's looking for a committed relationship and looking to marry soon (perhaps start a family). It sounds like you are not at all looking for this as you come across as selfish and unsure about what you want. It's not uncommon for people who start dating at such a young age to find out that years later, they really no longer have much in common and/or want (very) different things. I think you are wasting her time by still 'being with her' and you are wasting your own time too. I don't think you are doing her any favours by being with her. She could be single now and looking for a man with more similar views and ambitions and so can you (maybe you don't want to be seeing anyone at the moment and just want to work on yourself?).\n\nI think you should ask yourself if you want what she wants and if those aren't the same, if you could find a middle ground or perhaps just go your own ways. I honestly do not think you are bringing anything to her and it sounds like she's a bad match for you. Just break up so she can still find a better match and you are free to find out who you are and what you want.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You said you wanted to make sure you weren&amp;#39;t to blame for your failing relationship but it doesn&amp;#39;t sound like you approached your relationship like an adult considering you say you lied to her, and you also don&amp;#39;t mention talking about why things didn&amp;#39;t go very well at some point…. A relationship involves two people and doesn&amp;#39;t always fall apart when one (or both) party does something unacceptable to the other, but often it&amp;#39;s what people don&amp;#39;t do that&amp;#39;s causing the problems, like talking openly about your feelings and issues and finding ways to resolve these. It doesn&amp;#39;t sound like you did this at all. &lt;/p&gt;\n\n&lt;p&gt;It sounds like you are treating her badly to punish her for what she supposedly did to you. I do not think that&amp;#39;s the right way to treat a loved one and it&amp;#39;s unproductive too. Why not just break up with her? Sounds like she&amp;#39;ll be better off without you and this behaviour.&lt;/p&gt;\n\n&lt;p&gt;Flirting with strippers/waitresses at a strip club? They likely have 0 interest in you and just want your money so don&amp;#39;t take these experiences as any sort of info on how well you&amp;#39;ll do with women whom you don&amp;#39;t have to pay for their time/attention.&lt;/p&gt;\n\n&lt;p&gt;It sounds like you are too wrapped up in calling certain behaviours &amp;#39;alpha&amp;#39; or &amp;#39;beta&amp;#39; and that only &amp;#39;alpha&amp;#39; behaviour is the way to go. I think that&amp;#39;s a mistake.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think you should lie to your partner about where you are and what you are doing. If you think she won&amp;#39;t approve, maybe talk to her about it. Find out why you feel the need to go to strip clubs, ask her if/why she has a problem with it and take it from there. Would you be happy if she goes to see male strippers?&lt;/p&gt;\n\n&lt;p&gt;It sounds like she&amp;#39;s looking for a committed relationship and looking to marry soon (perhaps start a family). It sounds like you are not at all looking for this as you come across as selfish and unsure about what you want. It&amp;#39;s not uncommon for people who start dating at such a young age to find out that years later, they really no longer have much in common and/or want (very) different things. I think you are wasting her time by still &amp;#39;being with her&amp;#39; and you are wasting your own time too. I don&amp;#39;t think you are doing her any favours by being with her. She could be single now and looking for a man with more similar views and ambitions and so can you (maybe you don&amp;#39;t want to be seeing anyone at the moment and just want to work on yourself?).&lt;/p&gt;\n\n&lt;p&gt;I think you should ask yourself if you want what she wants and if those aren&amp;#39;t the same, if you could find a middle ground or perhaps just go your own ways. I honestly do not think you are bringing anything to her and it sounds like she&amp;#39;s a bad match for you. Just break up so she can still find a better match and you are free to find out who you are and what you want.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9x19i", "score_hidden": false, "stickied": false, "created": 1492240526.0, "created_utc": 1492211726.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658vpm", "likes": null, "replies": "", "user_reports": [], "id": "dga4ff2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Godskook", "parent_id": "t3_658vpm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "One question that, imho, must be answered a certain way for a chick to be worth marrying:\n\nDo you believe in moral absolutes, or are they relative?\n\nAsk her in a playful time when she's not expecting you to be serious.  Y'know, a fun question for philosophizing.  Do *NOT* marry a relativist.  They're the strong hamsters who divorce you later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One question that, imho, must be answered a certain way for a chick to be worth marrying:&lt;/p&gt;\n\n&lt;p&gt;Do you believe in moral absolutes, or are they relative?&lt;/p&gt;\n\n&lt;p&gt;Ask her in a playful time when she&amp;#39;s not expecting you to be serious.  Y&amp;#39;know, a fun question for philosophizing.  Do &lt;em&gt;NOT&lt;/em&gt; marry a relativist.  They&amp;#39;re the strong hamsters who divorce you later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga4ff2", "score_hidden": false, "stickied": false, "created": 1492250481.0, "created_utc": 1492221681.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_658vpm", "likes": null, "replies": "", "user_reports": [], "id": "dga7vel", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zenAFinLA", "parent_id": "t3_658vpm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Dude. I know it's hard. You need to drop this chick. It will be hard on you. You'll probably cry. You're new to this, and that's okay. It will be hard for you to separate from this girl, but there are more out there. You will never be happy with this girl because you will wonder what else was out there. You need to find out. It might take you a couple YEARS just to get to the point where you can really plate chicks and see what you really like. This shit isn't easy. Once you take the pill, your vision will be different. Just focus on yourself. It's a lonely journey for awhile, but you need to build you. Find you, the rest will follow. Good luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude. I know it&amp;#39;s hard. You need to drop this chick. It will be hard on you. You&amp;#39;ll probably cry. You&amp;#39;re new to this, and that&amp;#39;s okay. It will be hard for you to separate from this girl, but there are more out there. You will never be happy with this girl because you will wonder what else was out there. You need to find out. It might take you a couple YEARS just to get to the point where you can really plate chicks and see what you really like. This shit isn&amp;#39;t easy. Once you take the pill, your vision will be different. Just focus on yourself. It&amp;#39;s a lonely journey for awhile, but you need to build you. Find you, the rest will follow. Good luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga7vel", "score_hidden": false, "stickied": false, "created": 1492255554.0, "created_utc": 1492226754.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]