[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I came across this video on Facebook with the title &amp;quot;When the red pills kick in hard than usual.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=ikgHjXwgsz8\"&gt;https://www.youtube.com/watch?v=ikgHjXwgsz8&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;So watch the video before you read this.&lt;/p&gt;\n\n&lt;p&gt;Watched it, ok?&lt;/p&gt;\n\n&lt;p&gt;Now I am fairly new to this community. I have received some pretty good advice and incite from this community before and I always thought politics did not matter in this subreddit. Does it?&lt;/p&gt;\n\n&lt;p&gt;I am not a Trump supporter. However, it doesn&amp;#39;t mean I am a Hillary supporter or a politically correct SJW either. I feel like people&amp;#39;s own politics and religion is irrelevant to this sub. If it is relevant to this sub, it shouldn&amp;#39;t be. Sure, SJW&amp;#39;s tend to be more beta, but that is not the point.&lt;/p&gt;\n\n&lt;p&gt;When I read &amp;quot;When the Red Pill Kicks in harder than usual&amp;quot; and it was linked to this video, I thought that this guy is such a horrible representation for what the red pill community is (unless you all disagree?). If this guy is a red piller, then he is practically embarrassing all of us. Have you all seen the Dave Chapelle skit where the black guy was in the kkk but he was blind so he didn&amp;#39;t know he was black? This is like the video. Maybe this video is satire, but this guy will definitely turn people off in this community and better yet, give a reason to make fun of us.&lt;/p&gt;\n\n&lt;p&gt;I feel like the red pill was a community to help better man. I hope it is not a Trump, alt-right, conservative circle jerk. I am a moderate and I am in no way a bleeding heart liberal, but does it matter what people&amp;#39;s political and religious affiliation is in this community? Am I taking this video too seriously? Surely you all think the video is as dumb as I think it is. Do you all want to be associated with this guy? This is the dumbest thing I have seen all day...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I came across this video on Facebook with the title \"When the red pills kick in hard than usual.\"\n\nhttps://www.youtube.com/watch?v=ikgHjXwgsz8\n\nSo watch the video before you read this.\n\nWatched it, ok?\n\nNow I am fairly new to this community. I have received some pretty good advice and incite from this community before and I always thought politics did not matter in this subreddit. Does it?\n\nI am not a Trump supporter. However, it doesn't mean I am a Hillary supporter or a politically correct SJW either. I feel like people's own politics and religion is irrelevant to this sub. If it is relevant to this sub, it shouldn't be. Sure, SJW's tend to be more beta, but that is not the point.\n\nWhen I read \"When the Red Pill Kicks in harder than usual\" and it was linked to this video, I thought that this guy is such a horrible representation for what the red pill community is (unless you all disagree?). If this guy is a red piller, then he is practically embarrassing all of us. Have you all seen the Dave Chapelle skit where the black guy was in the kkk but he was blind so he didn't know he was black? This is like the video. Maybe this video is satire, but this guy will definitely turn people off in this community and better yet, give a reason to make fun of us.\n\nI feel like the red pill was a community to help better man. I hope it is not a Trump, alt-right, conservative circle jerk. I am a moderate and I am in no way a bleeding heart liberal, but does it matter what people's political and religious affiliation is in this community? Am I taking this video too seriously? Surely you all think the video is as dumb as I think it is. Do you all want to be associated with this guy? This is the dumbest thing I have seen all day...", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Rant/Venting", "id": "65bpcw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "thesquarerootof1", "saved": false, "mod_reports": [], "name": "t3_65bpcw", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": false, "link_flair_css_class": "rant", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheRedPill/comments/65bpcw/when_the_red_pills_kick_in_harder_than_usual/", "num_reports": null, "locked": false, "stickied": false, "created": 1492193122.0, "url": "https://www.reddit.com/r/TheRedPill/comments/65bpcw/when_the_red_pills_kick_in_harder_than_usual/", "author_flair_text": null, "quarantine": false, "title": "When the red pills kick in harder than usual....", "created_utc": 1492164322.0, "distinguished": null, "media": null, "upvote_ratio": 0.46, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65bpcw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65bpcw", "likes": null, "replies": "", "user_reports": [], "id": "dg91vb3", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "GrabHerByThePEPE", "parent_id": "t1_dg8zgzu", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Op us bigger problems than TRP if he can't figure this out ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Op us bigger problems than TRP if he can&amp;#39;t figure this out &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg91vb3", "score_hidden": false, "stickied": false, "created": 1492200487.0, "created_utc": 1492171687.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zgzu", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "GWar7", "parent_id": "t3_65bpcw", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "That's not a video title, it's just a comment in the video that seems to be ironic, made by a weird dude. \n\nAlso, that's an asian wearing a \"white pride\" shirt, you can't really take this video seriously. In any case, it neither mentions nor has anything to do with TRP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s not a video title, it&amp;#39;s just a comment in the video that seems to be ironic, made by a weird dude. &lt;/p&gt;\n\n&lt;p&gt;Also, that&amp;#39;s an asian wearing a &amp;quot;white pride&amp;quot; shirt, you can&amp;#39;t really take this video seriously. In any case, it neither mentions nor has anything to do with TRP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8zgzu", "score_hidden": false, "stickied": false, "created": 1492193981.0, "created_utc": 1492165181.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65bpcw", "likes": null, "replies": "", "user_reports": [], "id": "dg927kr", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Hycki", "parent_id": "t3_65bpcw", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Dont forget that redpill is from matrix and so it is used not only here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dont forget that redpill is from matrix and so it is used not only here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg927kr", "score_hidden": false, "stickied": false, "created": 1492201216.0, "created_utc": 1492172416.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65bpcw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65bpcw", "likes": null, "replies": "", "user_reports": [], "id": "dg8zp60", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GWar7", "parent_id": "t1_dg8zmr4", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "You should watch the \"i love white boys\" video, that's pretty feminine lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should watch the &amp;quot;i love white boys&amp;quot; video, that&amp;#39;s pretty feminine lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8zp60", "score_hidden": false, "stickied": false, "created": 1492194698.0, "created_utc": 1492165898.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zmr4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "throw17453", "parent_id": "t3_65bpcw", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Being \"red pilled\" has been extended by some to mean:\n\n\"have the uncomfortable truth of a situation shown to you\"\n\nSo you get people applying it to political issues, cultural issues, and really anything under the sun. It becomes a meaningless term in this context. \n\nAlso if you look at that guys videos he claims to be transgender - despite not seeming or coming across as feminine at all, autistic might be more apt.\n\n I think this represents the dangers of psychological illness + narcissism far more than anything else. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Being &amp;quot;red pilled&amp;quot; has been extended by some to mean:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;have the uncomfortable truth of a situation shown to you&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So you get people applying it to political issues, cultural issues, and really anything under the sun. It becomes a meaningless term in this context. &lt;/p&gt;\n\n&lt;p&gt;Also if you look at that guys videos he claims to be transgender - despite not seeming or coming across as feminine at all, autistic might be more apt.&lt;/p&gt;\n\n&lt;p&gt;I think this represents the dangers of psychological illness + narcissism far more than anything else. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg8zmr4", "score_hidden": false, "stickied": false, "created": 1492194491.0, "created_utc": 1492165691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65bpcw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65bpcw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65bpcw", "likes": null, "replies": "", "user_reports": [], "id": "dgdu8qh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pellrid", "parent_id": "t1_dgd49gr", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Media is not just news but movies, documentaries, music, and such. Of course not all of media are lies. But the vast majority is a bad influence, they are selling lies. Namely the mainstream and popular media are the main perpetrators. I think you understand that I wasn't thinking of Jordan Peterson's lectures on youtube, when I stated that the media lies. Lying sometimes is enough for me to turn my head away from news outlets on television. I don't believe everything I hear from alternative news sources either. Hence me saying: \n&gt;ALWAYS listen to both sides of the story.\n\nYes, people on the right do label those on the left. But there's more labeling coming from the left as of now. The reason I don't even mention leftists being labeled is because the media protects them. Any counter-argument against leftist ideologies coming from the center or the right is dismissed rapidly with aggressive labels being pushed on the people making the arguments. So, you see, labeling people on the left isn't an issue at the moment, because they hold the power, and the power to influence the masses at the present.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Media is not just news but movies, documentaries, music, and such. Of course not all of media are lies. But the vast majority is a bad influence, they are selling lies. Namely the mainstream and popular media are the main perpetrators. I think you understand that I wasn&amp;#39;t thinking of Jordan Peterson&amp;#39;s lectures on youtube, when I stated that the media lies. Lying sometimes is enough for me to turn my head away from news outlets on television. I don&amp;#39;t believe everything I hear from alternative news sources either. Hence me saying: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;ALWAYS listen to both sides of the story.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, people on the right do label those on the left. But there&amp;#39;s more labeling coming from the left as of now. The reason I don&amp;#39;t even mention leftists being labeled is because the media protects them. Any counter-argument against leftist ideologies coming from the center or the right is dismissed rapidly with aggressive labels being pushed on the people making the arguments. So, you see, labeling people on the left isn&amp;#39;t an issue at the moment, because they hold the power, and the power to influence the masses at the present.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgdu8qh", "score_hidden": false, "stickied": false, "created": 1492480491.0, "created_utc": 1492451691.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd49gr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "getrealmate_", "parent_id": "t1_dg92cw3", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Using blanket statements like \"the media lies\" is really dangerous and you shouldn't succumb to the lowest common denominator. It has been going on in the US for the last few years (I'm not American) and it's destroying the rational, scientific basis of society across the globe. News stations like Fox and Breitbart lie, as well as CNN, MSNBC and others, SOMETIMES, but not as much as the first two. \n\nAnd people from the right definitely label leftists, I don't know what you're on about there... communist, socialist, liberal, tree hugger, etc, etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Using blanket statements like &amp;quot;the media lies&amp;quot; is really dangerous and you shouldn&amp;#39;t succumb to the lowest common denominator. It has been going on in the US for the last few years (I&amp;#39;m not American) and it&amp;#39;s destroying the rational, scientific basis of society across the globe. News stations like Fox and Breitbart lie, as well as CNN, MSNBC and others, SOMETIMES, but not as much as the first two. &lt;/p&gt;\n\n&lt;p&gt;And people from the right definitely label leftists, I don&amp;#39;t know what you&amp;#39;re on about there... communist, socialist, liberal, tree hugger, etc, etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgd49gr", "score_hidden": false, "stickied": false, "created": 1492432739.0, "created_utc": 1492403939.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg92cw3", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "pellrid", "parent_id": "t3_65bpcw", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "4chan's politically incorrect forum uses the term \"red pill\" a lot. I don't think many of them are actually familiar with this sub. The term has become widespread as an expression of realization. By realization, people mean, recognizing that the media lies, and basically everything they are told are lies.\n\nNow, talking about political views. It seems many people support Trump here, and there is nothing wrong with their political views, and especially nothing wrong with them having their own opinion. Most people from the left are quick to dismiss anything a person from the right says, and they'll label it sexist, racist and whatnot, without actually holding a discussion with rightist individuals. It happens the other way around too, just without the stupid labeling. If you actually stop listening to people's opinions and seek information for yourself, you may find you agree with many of Trump's policies and views. I discourage anyone to \"pick a side.\" That only leads to misguided views.\n\nWho cares what they associate this sub with. I mean, there will be effects, because the ignorant will believe we share common views with delusional idiots like these. We can't really do anything about it anyways.\n\nWhat I'm trying to tell you is: don't let the majority's opinions shape your own. Educate yourself, ALWAYS listen to both sides of the story.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;4chan&amp;#39;s politically incorrect forum uses the term &amp;quot;red pill&amp;quot; a lot. I don&amp;#39;t think many of them are actually familiar with this sub. The term has become widespread as an expression of realization. By realization, people mean, recognizing that the media lies, and basically everything they are told are lies.&lt;/p&gt;\n\n&lt;p&gt;Now, talking about political views. It seems many people support Trump here, and there is nothing wrong with their political views, and especially nothing wrong with them having their own opinion. Most people from the left are quick to dismiss anything a person from the right says, and they&amp;#39;ll label it sexist, racist and whatnot, without actually holding a discussion with rightist individuals. It happens the other way around too, just without the stupid labeling. If you actually stop listening to people&amp;#39;s opinions and seek information for yourself, you may find you agree with many of Trump&amp;#39;s policies and views. I discourage anyone to &amp;quot;pick a side.&amp;quot; That only leads to misguided views.&lt;/p&gt;\n\n&lt;p&gt;Who cares what they associate this sub with. I mean, there will be effects, because the ignorant will believe we share common views with delusional idiots like these. We can&amp;#39;t really do anything about it anyways.&lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;m trying to tell you is: don&amp;#39;t let the majority&amp;#39;s opinions shape your own. Educate yourself, ALWAYS listen to both sides of the story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg92cw3", "score_hidden": false, "stickied": false, "created": 1492201520.0, "created_utc": 1492172720.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65bpcw", "likes": null, "replies": "", "user_reports": [], "id": "dga00ay", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ozaku7", "parent_id": "t3_65bpcw", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "It must be admitted that there are some toxic brats around here who are bitter and don't really get it. Taking the red pill has anger as a side-effect, but that's nothing but choking in my opinion. If you really swallowed it, you accept what happened, stay calm, and make the best of it to move on and become the best you can be, while seeing the world for how it really works.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It must be admitted that there are some toxic brats around here who are bitter and don&amp;#39;t really get it. Taking the red pill has anger as a side-effect, but that&amp;#39;s nothing but choking in my opinion. If you really swallowed it, you accept what happened, stay calm, and make the best of it to move on and become the best you can be, while seeing the world for how it really works.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga00ay", "score_hidden": false, "stickied": false, "created": 1492244459.0, "created_utc": 1492215659.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65bpcw", "likes": null, "replies": "", "user_reports": [], "id": "dgalhum", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "newName543456", "parent_id": "t3_65bpcw", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "LOL.\n\nHis political views don't mean he must be RP.\n\nHe could be Trump supporter and still believe love conquers all and all that nonsense.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;LOL.&lt;/p&gt;\n\n&lt;p&gt;His political views don&amp;#39;t mean he must be RP.&lt;/p&gt;\n\n&lt;p&gt;He could be Trump supporter and still believe love conquers all and all that nonsense.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgalhum", "score_hidden": false, "stickied": false, "created": 1492288466.0, "created_utc": 1492259666.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]