[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A man straight from the bluepill world would think that being sexualized is one of the worst possible experiences a woman can have; after all, it&amp;#39;s talked about with a tone of shock and disgust that leaves no doubt, and the charge of sexualizing women is levied against basically every single piece of media there is.&lt;/p&gt;\n\n&lt;p&gt;Except... women are obsessed with being sexualized. Female magazines are filled to the brim with tips on how to be sexier, female fashion is designed with the primary goal of making women more sexually appealing (at the expense of everything else, like comfort or convenience), female entertainment largely rotates around romance stories where the protagonist may not necessarily start out sexy but, at some point, will have a moment of revelation where her true beauty emerges.&lt;/p&gt;\n\n&lt;p&gt;This has caused some confusion even among feminist authors, as the glaring contradiction can not be totally ignored. So, in perfect female fashion, they made up a rationalization which, also in perfect female fashion, ended up being more revealing than the truth it was meant to hide: &amp;quot;being sexy is empowering!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Yes, sexy women are &amp;quot;empowered&amp;quot;. Empowered to do what? feminists don&amp;#39;t really say, because the answer immediately puts the lie to the concept: empowered to attract men, of course. &lt;strong&gt;Sexual attractiveness is female power&lt;/strong&gt;, the primary female power, a truth even feminists acknowledge in their funny little twisted way.&lt;/p&gt;\n\n&lt;p&gt;Women &lt;strong&gt;crave&lt;/strong&gt; being sexualized, they desperately want to be sexually desired and go to extreme lengths for that goal. And, what&amp;#39;s more, they live in a world where men have been absolutely castrated by feminism, where men hesitate to show even the smallest hint of sexual desire lest they &amp;quot;creep out&amp;quot; women.&lt;/p&gt;\n\n&lt;p&gt;This plays enormously to your advantage. A man not afraid of the sexual level of interaction is already playing in a different league than all others. Things like&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;not being afraid of being in her same space, as most dudes are&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;not being afraid of physical contact and, during physical contact, not behaving as if continuously apologizing for it, unlike most dudes&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;not shying away from talk of sex, sexually charged jokes and similar topics&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;in general, showing through words and actions that you know full well she&amp;#39;s a sexual creature who &lt;strong&gt;wants&lt;/strong&gt; to be sexually attractive&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;All of these will give you an astounding competitive advantage over Joe Average. A man so enlightened has entirely different interactions with women: much more relaxed on both sides, consequently much more pleasurable and fun even if they don&amp;#39;t go sexual, and the interaction will far more likely slide towards sexual engagement if that&amp;#39;s where you want to take it. &lt;/p&gt;\n\n&lt;p&gt;The difference in social dynamics is so stark it gave rise to the old PUA metaphor of the &amp;quot;secret society&amp;quot;, the idea that some men operate on a different social level when dealing with women, and to them there are possibilities open which are precluded to all others. This is, of course, exactly true in the metaphorical sense: you don&amp;#39;t present a plastic membership card, but you do show that you belong to the &amp;quot;secret society&amp;quot; when you express the frame we discussed.&lt;/p&gt;\n\n&lt;p&gt;So what can you &lt;strong&gt;do&lt;/strong&gt;? you can make a choice: belong to the club, or not. Now, of course, there&amp;#39;s a little catch: you won&amp;#39;t get rid of all those years of BP programming in an instant, like throwing a switch. Choosing to belong to the secret society will take conscious effort: you&amp;#39;ll have to stamp out and counteract all those ingrained behaviors stemming from the notion that women don&amp;#39;t want to be sexualized; you&amp;#39;ll have to put yourself out there, consciously push yourself out of your comfort zone, and engage in the sexual level of interaction. You&amp;#39;ll be embarrassed, but the embarrassment will be far less than you imagine, and the rewards indisputably worth it. If you haven&amp;#39;t started yet, stop wasting time living a life of sexual frustration and get working.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A man straight from the bluepill world would think that being sexualized is one of the worst possible experiences a woman can have; after all, it's talked about with a tone of shock and disgust that leaves no doubt, and the charge of sexualizing women is levied against basically every single piece of media there is.\n\nExcept... women are obsessed with being sexualized. Female magazines are filled to the brim with tips on how to be sexier, female fashion is designed with the primary goal of making women more sexually appealing (at the expense of everything else, like comfort or convenience), female entertainment largely rotates around romance stories where the protagonist may not necessarily start out sexy but, at some point, will have a moment of revelation where her true beauty emerges.\n\nThis has caused some confusion even among feminist authors, as the glaring contradiction can not be totally ignored. So, in perfect female fashion, they made up a rationalization which, also in perfect female fashion, ended up being more revealing than the truth it was meant to hide: \"being sexy is empowering!\"\n\nYes, sexy women are \"empowered\". Empowered to do what? feminists don't really say, because the answer immediately puts the lie to the concept: empowered to attract men, of course. **Sexual attractiveness is female power**, the primary female power, a truth even feminists acknowledge in their funny little twisted way.\n\nWomen **crave** being sexualized, they desperately want to be sexually desired and go to extreme lengths for that goal. And, what's more, they live in a world where men have been absolutely castrated by feminism, where men hesitate to show even the smallest hint of sexual desire lest they \"creep out\" women.\n\nThis plays enormously to your advantage. A man not afraid of the sexual level of interaction is already playing in a different league than all others. Things like\n\n- not being afraid of being in her same space, as most dudes are\n\n- not being afraid of physical contact and, during physical contact, not behaving as if continuously apologizing for it, unlike most dudes\n\n- not shying away from talk of sex, sexually charged jokes and similar topics\n\n- in general, showing through words and actions that you know full well she's a sexual creature who **wants** to be sexually attractive\n\nAll of these will give you an astounding competitive advantage over Joe Average. A man so enlightened has entirely different interactions with women: much more relaxed on both sides, consequently much more pleasurable and fun even if they don't go sexual, and the interaction will far more likely slide towards sexual engagement if that's where you want to take it. \n\nThe difference in social dynamics is so stark it gave rise to the old PUA metaphor of the \"secret society\", the idea that some men operate on a different social level when dealing with women, and to them there are possibilities open which are precluded to all others. This is, of course, exactly true in the metaphorical sense: you don't present a plastic membership card, but you do show that you belong to the \"secret society\" when you express the frame we discussed.\n\nSo what can you **do**? you can make a choice: belong to the club, or not. Now, of course, there's a little catch: you won't get rid of all those years of BP programming in an instant, like throwing a switch. Choosing to belong to the secret society will take conscious effort: you'll have to stamp out and counteract all those ingrained behaviors stemming from the notion that women don't want to be sexualized; you'll have to put yourself out there, consciously push yourself out of your comfort zone, and engage in the sexual level of interaction. You'll be embarrassed, but the embarrassment will be far less than you imagine, and the rewards indisputably worth it. If you haven't started yet, stop wasting time living a life of sexual frustration and get working.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Red Pill Theory", "id": "65d3bj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 474, "report_reasons": null, "author": "G_Petronius", "saved": false, "mod_reports": [], "name": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": false, "link_flair_css_class": "theory", "author_flair_css_class": "endorsement", "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheRedPill/comments/65d3bj/women_want_to_be_sexualized/", "num_reports": null, "locked": false, "stickied": false, "created": 1492211720.0, "url": "https://www.reddit.com/r/TheRedPill/comments/65d3bj/women_want_to_be_sexualized/", "author_flair_text": "Endorsed Contributor", "quarantine": false, "title": "Women Want To Be Sexualized", "created_utc": 1492182920.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 120, "visited": false, "subreddit_type": "public", "ups": 474}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9ss64", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "MisterRoid", "parent_id": "t1_dg9pjbm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "As someone who wants to become a father, I found your comment inspiring.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone who wants to become a father, I found your comment inspiring.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9ss64", "score_hidden": false, "stickied": false, "created": 1492234880.0, "created_utc": 1492206080.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgc60xy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "good_guy_submitter", "parent_id": "t1_dgbsxas", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I really don't care how rich you are. Children should have a mother from ages 0-10. And then at 11 you can't exactly pry them away from their mom either, not humanely. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really don&amp;#39;t care how rich you are. Children should have a mother from ages 0-10. And then at 11 you can&amp;#39;t exactly pry them away from their mom either, not humanely. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgc60xy", "score_hidden": false, "stickied": false, "created": 1492386177.0, "created_utc": 1492357377.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbsxas", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BoobToArmRatio", "parent_id": "t1_dgbfvci", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Idk if everything in your response was targeted at mine, but you've grossly misinterpreted everything I said. I'm really not recommending anything and I agree with most of what you said. I just think it's excessive for you to call someone a nutjob for wanting kids but taking their financial risk exposure into consideration. Is Cristiano Ronaldo a nutjob for choosing surrogacy? If you had more assets, maybe you would think twice before making such broad statements.\n\nI'm not a \"enjoy the decline\" guy either. I will have kids someday and I do plan to have them the traditional way. I don't disagree that they should have a loving mother. I just think you are rushing to judge other men's choices too quickly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Idk if everything in your response was targeted at mine, but you&amp;#39;ve grossly misinterpreted everything I said. I&amp;#39;m really not recommending anything and I agree with most of what you said. I just think it&amp;#39;s excessive for you to call someone a nutjob for wanting kids but taking their financial risk exposure into consideration. Is Cristiano Ronaldo a nutjob for choosing surrogacy? If you had more assets, maybe you would think twice before making such broad statements.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not a &amp;quot;enjoy the decline&amp;quot; guy either. I will have kids someday and I do plan to have them the traditional way. I don&amp;#39;t disagree that they should have a loving mother. I just think you are rushing to judge other men&amp;#39;s choices too quickly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgbsxas", "score_hidden": false, "stickied": false, "created": 1492355055.0, "created_utc": 1492326255.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbfvci", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "good_guy_submitter", "parent_id": "t1_dgbagdy", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Everything in life in a risk. You take them or you don't.\n\nChildren should have a mother. Especially from ages 0-10. Only their own biological mother will ever care for them in the unconditional way a mother can. I don't care what you think about the legal climate in this discussion. I really don't give a flying fuck if your point is to recommend men raise kids without a mother. That is just insane. But I'm not advocating marriage anyway. You don't need to be legally married to have kids. I think getting married is a bad idea and I frequently say so if you see my comment history. Getting married is only adding a 3rd party to your relationship: the state. It used to be god was the 3rd party, but the state has replaced god thanks to stupid feminists. And I say that as an anti theist.\n\nI didn't marry a unicorn. I married a woman, and AWALT. But I didn't marry some bar slut either. Granted, I know she has the potential to become a slut. But it's not much different from my potential to be a shitty fafher or husband either. \n\nI'm not going to \"enjoy the decline.\" Thats like saying \"enjoy the end of the world.\" You know what, fuck that. What's the point of doing of anything if you have that attitude? You might as well just bIow twenty grand on escorts and drugs on one fatass party where you plan on suiciding by OD at the end. Call it quits, there is nothing to live for, no future.\n\nI will raise great kids who will have  great kids themself and continue my genetic line. It will be strong. My mother's father was a strong man, and the his father was strong, and his father's father was strong. I will continue that line to eternity. And I will do so without depriving my children from having a mother.           ", "edited": 1492304507.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everything in life in a risk. You take them or you don&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;Children should have a mother. Especially from ages 0-10. Only their own biological mother will ever care for them in the unconditional way a mother can. I don&amp;#39;t care what you think about the legal climate in this discussion. I really don&amp;#39;t give a flying fuck if your point is to recommend men raise kids without a mother. That is just insane. But I&amp;#39;m not advocating marriage anyway. You don&amp;#39;t need to be legally married to have kids. I think getting married is a bad idea and I frequently say so if you see my comment history. Getting married is only adding a 3rd party to your relationship: the state. It used to be god was the 3rd party, but the state has replaced god thanks to stupid feminists. And I say that as an anti theist.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t marry a unicorn. I married a woman, and AWALT. But I didn&amp;#39;t marry some bar slut either. Granted, I know she has the potential to become a slut. But it&amp;#39;s not much different from my potential to be a shitty fafher or husband either. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not going to &amp;quot;enjoy the decline.&amp;quot; Thats like saying &amp;quot;enjoy the end of the world.&amp;quot; You know what, fuck that. What&amp;#39;s the point of doing of anything if you have that attitude? You might as well just bIow twenty grand on escorts and drugs on one fatass party where you plan on suiciding by OD at the end. Call it quits, there is nothing to live for, no future.&lt;/p&gt;\n\n&lt;p&gt;I will raise great kids who will have  great kids themself and continue my genetic line. It will be strong. My mother&amp;#39;s father was a strong man, and the his father was strong, and his father&amp;#39;s father was strong. I will continue that line to eternity. And I will do so without depriving my children from having a mother.           &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgbfvci", "score_hidden": false, "stickied": false, "created": 1492332706.0, "created_utc": 1492303906.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbagdy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BoobToArmRatio", "parent_id": "t1_dgao6hs", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "It's great that you found a unicorn to get married and have kids with, but if she divorced you and took steps to prevent you from seeing your kids, I don't think you would have the same sentiment. Plenty of guys on here have gotten shit on by getting married and having kids and to merely say its tricky is grossly understating the risk.\n\nI don't see the need to call someone looking into surrogacy a nutjob. We look down on single mothers, yet they are lauded as heroes in society. It's in the best interest of women to look down on men who opt out one way or another. We should be supporting our brothers who are just seeking better options in the current legal climate.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s great that you found a unicorn to get married and have kids with, but if she divorced you and took steps to prevent you from seeing your kids, I don&amp;#39;t think you would have the same sentiment. Plenty of guys on here have gotten shit on by getting married and having kids and to merely say its tricky is grossly understating the risk.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t see the need to call someone looking into surrogacy a nutjob. We look down on single mothers, yet they are lauded as heroes in society. It&amp;#39;s in the best interest of women to look down on men who opt out one way or another. We should be supporting our brothers who are just seeking better options in the current legal climate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgbagdy", "score_hidden": false, "stickied": false, "created": 1492324962.0, "created_utc": 1492296162.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgao6hs", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "good_guy_submitter", "parent_id": "t1_dgaajli", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The kids are worth it. Assuming you are K selected and not R. The biggest sacrifice I think I'm making is I only fuck one woman instead of spinning 3-4 plates. And so I have to manage the one woman and keep her wet while also keeping her interesting to me. And any mistakes I make with her are permanent, I can't just drop her and pick up a new chick.\n\n\nFinding a woman to have them with is tricky. The key I've found is to get a woman who has a great relationship with her dad, and a great dad. I married a daddy's girl and she is still a daddy's girl but I am now the daddy. \n\nA lot of nutjobs on here talk about paying a  surrogate if you have kids. Fuck that. Kids need a mother. Kids need a father. \n\n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The kids are worth it. Assuming you are K selected and not R. The biggest sacrifice I think I&amp;#39;m making is I only fuck one woman instead of spinning 3-4 plates. And so I have to manage the one woman and keep her wet while also keeping her interesting to me. And any mistakes I make with her are permanent, I can&amp;#39;t just drop her and pick up a new chick.&lt;/p&gt;\n\n&lt;p&gt;Finding a woman to have them with is tricky. The key I&amp;#39;ve found is to get a woman who has a great relationship with her dad, and a great dad. I married a daddy&amp;#39;s girl and she is still a daddy&amp;#39;s girl but I am now the daddy. &lt;/p&gt;\n\n&lt;p&gt;A lot of nutjobs on here talk about paying a  surrogate if you have kids. Fuck that. Kids need a mother. Kids need a father. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgao6hs", "score_hidden": false, "stickied": false, "created": 1492293737.0, "created_utc": 1492264937.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaajli", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg9pjbm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaajli", "score_hidden": false, "stickied": false, "created": 1492260012.0, "created_utc": 1492231212.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgb1m7l", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Wel108", "parent_id": "t1_dg9pjbm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Don't even know you, but I respect you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t even know you, but I respect you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgb1m7l", "score_hidden": false, "stickied": false, "created": 1492312751.0, "created_utc": 1492283951.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgano9u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "good_guy_submitter", "parent_id": "t1_dgahnqy", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Yes and no. It's a pain because I used to be a pretty lazy person. I can't be lazy anymore. But that's also a good thing. Maintaining frame 24/7 has made me more successful with just about everything in life. I get shit done and I have become a master of time management although the latter is because with kids I have half the time I used to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes and no. It&amp;#39;s a pain because I used to be a pretty lazy person. I can&amp;#39;t be lazy anymore. But that&amp;#39;s also a good thing. Maintaining frame 24/7 has made me more successful with just about everything in life. I get shit done and I have become a master of time management although the latter is because with kids I have half the time I used to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgano9u", "score_hidden": false, "stickied": false, "created": 1492292843.0, "created_utc": 1492264043.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgahnqy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Trustworthy12", "parent_id": "t1_dg9pjbm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Have you found there to be any positive aspects to having to keep up frame 24/7 or is it only a drag?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you found there to be any positive aspects to having to keep up frame 24/7 or is it only a drag?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgahnqy", "score_hidden": false, "stickied": false, "created": 1492277421.0, "created_utc": 1492248621.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9pjbm", "gilded": 0, "archived": false, "score": 64, "report_reasons": null, "author": "good_guy_submitter", "parent_id": "t1_dg9cu90", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "As a dad of several children. I wouldn't have it any other way. I love my kids way more than anything I thought possible prior. \n\nI am married to their mother, and I trust her with them, but I don't trust her anymore than any other woman when it comes to sex. I got each kid DNA tested to ensure they were mine, and they are. My wife is incredible and kind and submissive, but her nature is still hamster brained. AWALT. A woman will never make you happy. I can never let my guard down around her or else the she stops putting out. If I want regular sex I have to maintain attraction and that means never dropping frame. TBH it's a pain in the ass and I sometimes I wish I had a shoulder to cry on when things go to shit but that is what my guy friends are for. The second I show weakness to her, her pussy dries up and closes down.\n\nIts a pain in the ass being a dad, but God I love my kids and it is so so worth it. I can't wait until my son is old enough to start chasing tail so I can show him the ropes.  \n\nLife is a pain in the ass but if you fill it with things of love you can find happiness in it.", "edited": 1492202282.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a dad of several children. I wouldn&amp;#39;t have it any other way. I love my kids way more than anything I thought possible prior. &lt;/p&gt;\n\n&lt;p&gt;I am married to their mother, and I trust her with them, but I don&amp;#39;t trust her anymore than any other woman when it comes to sex. I got each kid DNA tested to ensure they were mine, and they are. My wife is incredible and kind and submissive, but her nature is still hamster brained. AWALT. A woman will never make you happy. I can never let my guard down around her or else the she stops putting out. If I want regular sex I have to maintain attraction and that means never dropping frame. TBH it&amp;#39;s a pain in the ass and I sometimes I wish I had a shoulder to cry on when things go to shit but that is what my guy friends are for. The second I show weakness to her, her pussy dries up and closes down.&lt;/p&gt;\n\n&lt;p&gt;Its a pain in the ass being a dad, but God I love my kids and it is so so worth it. I can&amp;#39;t wait until my son is old enough to start chasing tail so I can show him the ropes.  &lt;/p&gt;\n\n&lt;p&gt;Life is a pain in the ass but if you fill it with things of love you can find happiness in it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9pjbm", "score_hidden": false, "stickied": false, "created": 1492230825.0, "created_utc": 1492202025.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 64}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgd4j6w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TRPLeader", "parent_id": "t1_dgaezfo", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Wherever I go, people keep on peopleing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wherever I go, people keep on peopleing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgd4j6w", "score_hidden": false, "stickied": false, "created": 1492433228.0, "created_utc": 1492404428.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgalyax", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "LannuaLie", "parent_id": "t1_dgaezfo", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "People around you are illiterate fucktards? Must be sad.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People around you are illiterate fucktards? Must be sad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgalyax", "score_hidden": false, "stickied": false, "created": 1492289465.0, "created_utc": 1492260665.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaezfo", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "dapowa", "parent_id": "t1_dgacpc7", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "oh no people are being people.. the fuck", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oh no people are being people.. the fuck&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaezfo", "score_hidden": false, "stickied": false, "created": 1492269530.0, "created_utc": 1492240730.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgacpc7", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "LannuaLie", "parent_id": "t1_dg9wdvr", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "It's arabs not muslims. I can't believe TRP of all places had people who believe something they see without looking into it.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s arabs not muslims. I can&amp;#39;t believe TRP of all places had people who believe something they see without looking into it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgacpc7", "score_hidden": false, "stickied": false, "created": 1492264161.0, "created_utc": 1492235361.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgaf0xo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dapowa", "parent_id": "t1_dga6zhu", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "sounds like you don't know how to train a bitch at all. I'm talking dogs, and women too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;sounds like you don&amp;#39;t know how to train a bitch at all. I&amp;#39;m talking dogs, and women too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaf0xo", "score_hidden": false, "stickied": false, "created": 1492269634.0, "created_utc": 1492240834.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga6zhu", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "Punlio", "parent_id": "t1_dga6qhk", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "You're right. I bet you wish you could talk to them about real entertainment like watching a dog lmao.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right. I bet you wish you could talk to them about real entertainment like watching a dog lmao.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga6zhu", "score_hidden": false, "stickied": false, "created": 1492254177.0, "created_utc": 1492225377.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dga6qhk", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "AnonymousAnomaly", "parent_id": "t1_dga68ms", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I would rather pick up my dogs shit than listen to some skank drone on about the fucking Kardashians or whatever mind numbing shit that interests them. I wish women were more interesting and loyal than a dog, but they're not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would rather pick up my dogs shit than listen to some skank drone on about the fucking Kardashians or whatever mind numbing shit that interests them. I wish women were more interesting and loyal than a dog, but they&amp;#39;re not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga6qhk", "score_hidden": false, "stickied": false, "created": 1492253813.0, "created_utc": 1492225013.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgc9aw9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hahayeahthatscool", "parent_id": "t1_dga68ms", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Girls go fucking hamshit for dogs. You're a retard that has never been outside if you aren't aware of that fact. Actually 1 second on tinder would teach you that, so you don't even need to have the anxiety attack you get from leaving your room, you sister.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Girls go fucking hamshit for dogs. You&amp;#39;re a retard that has never been outside if you aren&amp;#39;t aware of that fact. Actually 1 second on tinder would teach you that, so you don&amp;#39;t even need to have the anxiety attack you get from leaving your room, you sister.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgc9aw9", "score_hidden": false, "stickied": false, "created": 1492390534.0, "created_utc": 1492361734.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga68ms", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "Punlio", "parent_id": "t1_dga4g36", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "You're actually so right. After I take my dog for a walk (looking super alpha as I bend down to pick up it's shit) I like to go to chat up some women who make some friendly conversation because the situation is setup that they are unable to leave. I then go home and sit and watch my dog for hours, rolling on the floor with laughter as it does mundane things on repeat forever. \n\nIt's ok to admit that a dog is just a socially acceptable waifu pillow for weak minded people guys...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re actually so right. After I take my dog for a walk (looking super alpha as I bend down to pick up it&amp;#39;s shit) I like to go to chat up some women who make some friendly conversation because the situation is setup that they are unable to leave. I then go home and sit and watch my dog for hours, rolling on the floor with laughter as it does mundane things on repeat forever. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s ok to admit that a dog is just a socially acceptable waifu pillow for weak minded people guys...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga68ms", "score_hidden": false, "stickied": false, "created": 1492253097.0, "created_utc": 1492224297.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": -8}}], "after": null, "before": null}}, "user_reports": [], "id": "dga4g36", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "AnonymousAnomaly", "parent_id": "t1_dg9wlg8", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Do you know how much hot pussy walks around in a dog park? If going to bars and clubs are not your thing dog parks are perfect. Not to mention the countless hours of laughter and entertainment they provide. (Dogs not women)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you know how much hot pussy walks around in a dog park? If going to bars and clubs are not your thing dog parks are perfect. Not to mention the countless hours of laughter and entertainment they provide. (Dogs not women)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga4g36", "score_hidden": false, "stickied": false, "created": 1492250508.0, "created_utc": 1492221708.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9wlg8", "gilded": 0, "archived": false, "score": -29, "report_reasons": null, "author": "Punlio", "parent_id": "t1_dg9wdvr", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I was being sarcastic but dogs are trash tho. If you are so lonely that you need to bond with an animal that can't communicate with you and you spend money on it while it annoys everyone around you, then you are kind of a loser.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was being sarcastic but dogs are trash tho. If you are so lonely that you need to bond with an animal that can&amp;#39;t communicate with you and you spend money on it while it annoys everyone around you, then you are kind of a loser.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9wlg8", "score_hidden": false, "stickied": false, "created": 1492239935.0, "created_utc": 1492211135.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -29}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9wdvr", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "clint_bronson", "parent_id": "t1_dg9r0ln", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Are you a muslim? And don't like dogs because its haram?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you a muslim? And don&amp;#39;t like dogs because its haram?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9wdvr", "score_hidden": false, "stickied": false, "created": 1492239649.0, "created_utc": 1492210849.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dga0ee1", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "-INFOWARS-", "parent_id": "t1_dg9zprn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I wouldn't say that there are no benefits. There are some. Dogs are always loyal, playful, helpful with depression and you can excercise with them. I just don't think a dog is suitable for a 25 yr old who wants regular pussy.\n\nThe way I see is it is that dogs are easy to train but must always be looked after. Like a LTR requires continuous frame otherwise it fails. If you don't walk your dog or get it regularly checked up, there's no point of having one.\n\nIf you have a family, dogs are great as you can share responsibility. If you're a single 25 yr old, having a dog is a mega BP.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t say that there are no benefits. There are some. Dogs are always loyal, playful, helpful with depression and you can excercise with them. I just don&amp;#39;t think a dog is suitable for a 25 yr old who wants regular pussy.&lt;/p&gt;\n\n&lt;p&gt;The way I see is it is that dogs are easy to train but must always be looked after. Like a LTR requires continuous frame otherwise it fails. If you don&amp;#39;t walk your dog or get it regularly checked up, there&amp;#39;s no point of having one.&lt;/p&gt;\n\n&lt;p&gt;If you have a family, dogs are great as you can share responsibility. If you&amp;#39;re a single 25 yr old, having a dog is a mega BP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga0ee1", "score_hidden": false, "stickied": false, "created": 1492244978.0, "created_utc": 1492216178.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgaemt5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "killermike-el-P", "parent_id": "t1_dg9zprn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "If you attacked me my dog would fuck you up. Is that a benefit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you attacked me my dog would fuck you up. Is that a benefit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaemt5", "score_hidden": false, "stickied": false, "created": 1492268620.0, "created_utc": 1492239820.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9zprn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Punlio", "parent_id": "t1_dg9zelf", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 1, "body": "I was being sarcastic but the core message is true. Dogs are exactly like little kids, but with no pay off. Would the sub of had the same reaction to the comment if it was \"Do you have a kid? Because I think you need a kid\" absolutely not.\n\nI thought this sub was about harsh thruths, but apparently people here think that owning a dog is the same as being with a dog that your friends own every once in a while.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was being sarcastic but the core message is true. Dogs are exactly like little kids, but with no pay off. Would the sub of had the same reaction to the comment if it was &amp;quot;Do you have a kid? Because I think you need a kid&amp;quot; absolutely not.&lt;/p&gt;\n\n&lt;p&gt;I thought this sub was about harsh thruths, but apparently people here think that owning a dog is the same as being with a dog that your friends own every once in a while.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9zprn", "score_hidden": false, "stickied": false, "created": 1492244075.0, "created_utc": 1492215275.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9zelf", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "-INFOWARS-", "parent_id": "t1_dg9r0ln", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This was said crudely but it's sort of true. A dog needs regular walks, food and vet checks. A couple of thousand dollars a year. If you have a 9-5 job, it's too much to have a dog and get the most out of one.\n\nDogs imo are better when you're older and retired. If you want a pet, I recomment a cat when you're younger. Far less hassle but there's less you can get out of a cat.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was said crudely but it&amp;#39;s sort of true. A dog needs regular walks, food and vet checks. A couple of thousand dollars a year. If you have a 9-5 job, it&amp;#39;s too much to have a dog and get the most out of one.&lt;/p&gt;\n\n&lt;p&gt;Dogs imo are better when you&amp;#39;re older and retired. If you want a pet, I recomment a cat when you&amp;#39;re younger. Far less hassle but there&amp;#39;s less you can get out of a cat.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9zelf", "score_hidden": false, "stickied": false, "created": 1492243662.0, "created_utc": 1492214862.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9r0ln", "gilded": 0, "archived": false, "score": -57, "report_reasons": null, "author": "Punlio", "parent_id": "t1_dg9fn5i", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Owning a dog is the most blue pill thing you can do. Providing for something that you don't get to fuck? No way. They are also super annoying when they bark.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Owning a dog is the most blue pill thing you can do. Providing for something that you don&amp;#39;t get to fuck? No way. They are also super annoying when they bark.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9r0ln", "score_hidden": false, "stickied": false, "created": 1492232630.0, "created_utc": 1492203830.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -57}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9fn5i", "gilded": 0, "archived": false, "score": 57, "report_reasons": null, "author": "MrAnderzon", "parent_id": "t1_dg9cu90", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Do you have a dog? Because I think you need a dog", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have a dog? Because I think you need a dog&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9fn5i", "score_hidden": false, "stickied": false, "created": 1492219036.0, "created_utc": 1492190236.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 57}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dga7gfy", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "logicalthinker1", "parent_id": "t1_dg9cu90", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Happiness is a bad goal. happiness is an extreme emotion. If you're always happy, you're never happy. Strive for fulfillment and balance. You can't be happy if you're never sad. You can never be calm if you're never irate.\n\nThe euphoria you get from eating a nice big meal doesn't come from the meal itself. It comes from the swing of empty stomach to full stomach.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Happiness is a bad goal. happiness is an extreme emotion. If you&amp;#39;re always happy, you&amp;#39;re never happy. Strive for fulfillment and balance. You can&amp;#39;t be happy if you&amp;#39;re never sad. You can never be calm if you&amp;#39;re never irate.&lt;/p&gt;\n\n&lt;p&gt;The euphoria you get from eating a nice big meal doesn&amp;#39;t come from the meal itself. It comes from the swing of empty stomach to full stomach.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga7gfy", "score_hidden": false, "stickied": false, "created": 1492254897.0, "created_utc": 1492226097.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9fyp6", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "SJHammer", "parent_id": "t1_dg9cu90", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The way you've described yourself, I was there recently. Stop giving a fuck about anyone else. Do you, do what makes you happy. Thats it. You know or will learn what makes you happy with the opposite sex. Tell them what makes you happy! They will either do it, or they will leave. You're a 10, they want your approval.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The way you&amp;#39;ve described yourself, I was there recently. Stop giving a fuck about anyone else. Do you, do what makes you happy. Thats it. You know or will learn what makes you happy with the opposite sex. Tell them what makes you happy! They will either do it, or they will leave. You&amp;#39;re a 10, they want your approval.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9fyp6", "score_hidden": false, "stickied": false, "created": 1492219402.0, "created_utc": 1492190602.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9d9pg", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "ICanResetUrPassword", "parent_id": "t1_dg9cu90", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Same age as you, pretty much similar experiences. I think the biggest thing that has helped for me is to stop focusing on a destination with women. Focus on a constant learning with your goals, career, etc. Focus on getting better everyday with fitness, learning, traveling, projects, skills. Build deep meaningful relationships with your family and/or friends. There is no end happiness goal. There is only the pursuit until we die.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same age as you, pretty much similar experiences. I think the biggest thing that has helped for me is to stop focusing on a destination with women. Focus on a constant learning with your goals, career, etc. Focus on getting better everyday with fitness, learning, traveling, projects, skills. Build deep meaningful relationships with your family and/or friends. There is no end happiness goal. There is only the pursuit until we die.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9d9pg", "score_hidden": false, "stickied": false, "created": 1492216344.0, "created_utc": 1492187544.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9fk4n", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Thresher_XG", "parent_id": "t1_dg9cu90", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Wow I think you described me perfectly lol. We are both in the same boat. It's a strange feeling for sure", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow I think you described me perfectly lol. We are both in the same boat. It&amp;#39;s a strange feeling for sure&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9fk4n", "score_hidden": false, "stickied": false, "created": 1492218939.0, "created_utc": 1492190139.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9nhol", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Psychonautsareus", "parent_id": "t1_dg9cu90", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "So you know you're unhappy and you know that the only person that can make you happy is yourself, then what is the problem? Go out and do something whatever you want to do at that given moment and you will be happy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you know you&amp;#39;re unhappy and you know that the only person that can make you happy is yourself, then what is the problem? Go out and do something whatever you want to do at that given moment and you will be happy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9nhol", "score_hidden": false, "stickied": false, "created": 1492228366.0, "created_utc": 1492199566.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgab6ve", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fiat30", "parent_id": "t1_dg9cu90", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I'm 27, I found fulfillment by pursing mastery in my field. It's not enough for us to punch in and pay bills. Having read some of the posts from older gentlemen around here, a family doesn't automatically equate to happiness and fulfillment. As for the feelings of uncertainty, I grapple with them too. Luis CK has a great saying that at this age, it's normal, we should face these thoughts and find answers for ourselves because *that's* what will make us unique. I highly recommend Mastery by Robert Greene if you want to find and excel at your calling.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 27, I found fulfillment by pursing mastery in my field. It&amp;#39;s not enough for us to punch in and pay bills. Having read some of the posts from older gentlemen around here, a family doesn&amp;#39;t automatically equate to happiness and fulfillment. As for the feelings of uncertainty, I grapple with them too. Luis CK has a great saying that at this age, it&amp;#39;s normal, we should face these thoughts and find answers for ourselves because &lt;em&gt;that&amp;#39;s&lt;/em&gt; what will make us unique. I highly recommend Mastery by Robert Greene if you want to find and excel at your calling.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgab6ve", "score_hidden": false, "stickied": false, "created": 1492261157.0, "created_utc": 1492232357.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dga6yg7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mummersfarce_is_done", "parent_id": "t1_dg9cu90", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "May I suggest you to follow your mission? Women are desserts, not the main food.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;May I suggest you to follow your mission? Women are desserts, not the main food.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga6yg7", "score_hidden": false, "stickied": false, "created": 1492254135.0, "created_utc": 1492225335.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgaun14", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Questionnaire7", "parent_id": "t1_dg9cu90", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Travel to a more conservative part of the world and find a Girl there. To be honest im imaging a Muslim country may be the way to go. Maybe not so conservative as Saudia Arabia because then you'd actually have to convert. Id bet there are conservative places where same religion dating/marriages arent required by custom.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Travel to a more conservative part of the world and find a Girl there. To be honest im imaging a Muslim country may be the way to go. Maybe not so conservative as Saudia Arabia because then you&amp;#39;d actually have to convert. Id bet there are conservative places where same religion dating/marriages arent required by custom.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaun14", "score_hidden": false, "stickied": false, "created": 1492303264.0, "created_utc": 1492274464.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgcrypg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "time_stop2", "parent_id": "t1_dg9cu90", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This sounds oddly similar to my exact situation...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This sounds oddly similar to my exact situation...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgcrypg", "score_hidden": false, "stickied": false, "created": 1492415278.0, "created_utc": 1492386478.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dga431o", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "GBP4tendies", "parent_id": "t1_dg9cu90", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "We must secure the existence of our people and a future for white children. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We must secure the existence of our people and a future for white children. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga431o", "score_hidden": false, "stickied": false, "created": 1492249995.0, "created_utc": 1492221195.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9cu90", "gilded": 0, "archived": false, "score": 105, "report_reasons": null, "author": "metalhead4", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I'm 26, have a career, have my toys, make money but I'm constantly unhappy. Figured I'd be married and have kids by now when I was younger. But the years keep adding up and I don't feel like I'm anywhere closer to what should make me consistently happy. I've had a couple serious girlfriends who I thought could've been the one until they all stabbed me in the back and now I have serious doubts I'll ever be able to trust a woman who isn't in my family again. \n\nI've had meaningless hookups, I've had many dates, I've had girls stick around for a bit who end up ghosting you in the end. I've played the cocky asshole, I've played the caring boyfriend. I've been polite on dates and paid for their meals and held the door for them. I've had dates where I don't pay for them or we split the bill.  I've lead girls on who wanted a relationship but I was only interested in fucking them for as long as I could. I've been red pill, I've been blue pill. I've been human. \n\nThe constant underlying issue is I don't know what makes me happy with the opposite sex and I'm sick of trying different bitches to find it. It's such a waste of time when the only person you can really count on for your own happiness is yourself. Sometimes I think I am depressed but I know everything is in our head so I just distract myself with other shit. Whether it be working out, riding my motorcycle, playing games, watching shows etc. I don't know if I want to be Chad and just fuck sluts for the rest of my life. I don't know if I want to be a provider and have a family to look after. \n\nUntil I figure it out, I'll keep getting up for work everyday and paying bills until I die. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 26, have a career, have my toys, make money but I&amp;#39;m constantly unhappy. Figured I&amp;#39;d be married and have kids by now when I was younger. But the years keep adding up and I don&amp;#39;t feel like I&amp;#39;m anywhere closer to what should make me consistently happy. I&amp;#39;ve had a couple serious girlfriends who I thought could&amp;#39;ve been the one until they all stabbed me in the back and now I have serious doubts I&amp;#39;ll ever be able to trust a woman who isn&amp;#39;t in my family again. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had meaningless hookups, I&amp;#39;ve had many dates, I&amp;#39;ve had girls stick around for a bit who end up ghosting you in the end. I&amp;#39;ve played the cocky asshole, I&amp;#39;ve played the caring boyfriend. I&amp;#39;ve been polite on dates and paid for their meals and held the door for them. I&amp;#39;ve had dates where I don&amp;#39;t pay for them or we split the bill.  I&amp;#39;ve lead girls on who wanted a relationship but I was only interested in fucking them for as long as I could. I&amp;#39;ve been red pill, I&amp;#39;ve been blue pill. I&amp;#39;ve been human. &lt;/p&gt;\n\n&lt;p&gt;The constant underlying issue is I don&amp;#39;t know what makes me happy with the opposite sex and I&amp;#39;m sick of trying different bitches to find it. It&amp;#39;s such a waste of time when the only person you can really count on for your own happiness is yourself. Sometimes I think I am depressed but I know everything is in our head so I just distract myself with other shit. Whether it be working out, riding my motorcycle, playing games, watching shows etc. I don&amp;#39;t know if I want to be Chad and just fuck sluts for the rest of my life. I don&amp;#39;t know if I want to be a provider and have a family to look after. &lt;/p&gt;\n\n&lt;p&gt;Until I figure it out, I&amp;#39;ll keep getting up for work everyday and paying bills until I die. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9cu90", "score_hidden": false, "stickied": false, "created": 1492215862.0, "created_utc": 1492187062.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 105}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9prde", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "MattyAnon", "parent_id": "t1_dg9mout", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "hahaha.... forgot about this one from IllimitableMen.  Heard most often in the form of \"I'm not that kind of girl!\".\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hahaha.... forgot about this one from IllimitableMen.  Heard most often in the form of &amp;quot;I&amp;#39;m not that kind of girl!&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9prde", "score_hidden": false, "stickied": false, "created": 1492231097.0, "created_utc": 1492202297.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9mout", "gilded": 0, "archived": false, "score": 43, "report_reasons": null, "author": "axamsa", "parent_id": "t1_dg99y4t", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Maxim #122\nWomen loathe being sexually objectified by lesser men, crafting their disgust for the unworthy into a veneer of moral superiority. Yet hidden within this guise of upright disgust is a depraved desire to be objectified by a powerful man. The weak man gets nothing, the strong man enjoys her perversions. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maxim #122\nWomen loathe being sexually objectified by lesser men, crafting their disgust for the unworthy into a veneer of moral superiority. Yet hidden within this guise of upright disgust is a depraved desire to be objectified by a powerful man. The weak man gets nothing, the strong man enjoys her perversions. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9mout", "score_hidden": false, "stickied": false, "created": 1492227401.0, "created_utc": 1492198601.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 43}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgajide", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "tyrryt", "parent_id": "t1_dg9be47", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; Something done by an Alpha that will give her the tingles will be seen as creepy if done by a Beta/Omega. \n\n\"Creepy\" is just code for \"not of sufficient value to bang her\" - it's not actually disliked, and a woman ignored by a group of betas would be as disappointed as one ignored by alphas, or by women.  Even moreso, because beta attention should be easier to get. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Something done by an Alpha that will give her the tingles will be seen as creepy if done by a Beta/Omega. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;quot;Creepy&amp;quot; is just code for &amp;quot;not of sufficient value to bang her&amp;quot; - it&amp;#39;s not actually disliked, and a woman ignored by a group of betas would be as disappointed as one ignored by alphas, or by women.  Even moreso, because beta attention should be easier to get. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgajide", "score_hidden": false, "stickied": false, "created": 1492283313.0, "created_utc": 1492254513.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgauhx5", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Questionnaire7", "parent_id": "t1_dg9be47", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Once I sat next to an hb9 in Calculus class. The beta bude who sat in front of us turned around one day and told her to be careful not to spill her Starbucks drink on the ground. She reacted with a look of disgust and didnt say anything. Then I said \"yea watch out you idiot your gonna make a mess in here.\" She immediately smiled, laughted and said, oops and pulled her drink away from the edge of the table. Essentially the exact same line delivered, 100% opposite reactions ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Once I sat next to an hb9 in Calculus class. The beta bude who sat in front of us turned around one day and told her to be careful not to spill her Starbucks drink on the ground. She reacted with a look of disgust and didnt say anything. Then I said &amp;quot;yea watch out you idiot your gonna make a mess in here.&amp;quot; She immediately smiled, laughted and said, oops and pulled her drink away from the edge of the table. Essentially the exact same line delivered, 100% opposite reactions &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgauhx5", "score_hidden": false, "stickied": false, "created": 1492303059.0, "created_utc": 1492274259.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9fhpu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MrAnderzon", "parent_id": "t1_dg9be47", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Pete Campbell didn't he go back to his wife towards the end?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pete Campbell didn&amp;#39;t he go back to his wife towards the end?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9fhpu", "score_hidden": false, "stickied": false, "created": 1492218861.0, "created_utc": 1492190061.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9be47", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "LymanRP", "parent_id": "t1_dg99y4t", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; Women crave being sexualized\n&gt; .... by attractive alpha men.\n\nSo true. Something done by an Alpha that will give her the tingles will be seen as creepy if done by a Beta/Omega. I've seen it happen all the time in my friend group. I love poking fun at my girlfriends over this using what I like to call the Mad Men comparison (phenomenal show to see some old school TRP vs. BP in action). The girls get all giggly and giddy when Don Draper and Roger Sterling hit on them, but it becomes creepy when the same is done by Pete Campbell.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Women crave being sexualized\n.... by attractive alpha men.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So true. Something done by an Alpha that will give her the tingles will be seen as creepy if done by a Beta/Omega. I&amp;#39;ve seen it happen all the time in my friend group. I love poking fun at my girlfriends over this using what I like to call the Mad Men comparison (phenomenal show to see some old school TRP vs. BP in action). The girls get all giggly and giddy when Don Draper and Roger Sterling hit on them, but it becomes creepy when the same is done by Pete Campbell.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9be47", "score_hidden": false, "stickied": false, "created": 1492214268.0, "created_utc": 1492185468.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9pisc", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "LookThroughRedEyes", "parent_id": "t1_dg9fiwt", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "No it's the best thing that I've done to myself, because I found this place and I will never do it to myself ever again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No it&amp;#39;s the best thing that I&amp;#39;ve done to myself, because I found this place and I will never do it to myself ever again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9pisc", "score_hidden": false, "stickied": false, "created": 1492230805.0, "created_utc": 1492202005.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9fiwt", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "hardestmonk", "parent_id": "t1_dg99y4t", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "While reading this, I once more understand that being a beta in the past was the worst thing that I have done to myself. I would rather get slapped as a cocky but unwanted guy, than listen to her tantrums and like her photos on fb. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While reading this, I once more understand that being a beta in the past was the worst thing that I have done to myself. I would rather get slapped as a cocky but unwanted guy, than listen to her tantrums and like her photos on fb. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9fiwt", "score_hidden": false, "stickied": false, "created": 1492218901.0, "created_utc": 1492190101.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9pcuk", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "Auvergnat", "parent_id": "t1_dg9m864", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "It's just two different things. Women love to be seen as sexually attractive to everyone, but they only want sexual interaction with those they themselves are attracted to.", "edited": 1492203981.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s just two different things. Women love to be seen as sexually attractive to everyone, but they only want sexual interaction with those they themselves are attracted to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9pcuk", "score_hidden": false, "stickied": false, "created": 1492230606.0, "created_utc": 1492201806.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9qovh", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "Docbear64", "parent_id": "t1_dg9m864", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I love this old Comedy skit which I think is pretty accurate if you read between the lines  : https://www.youtube.com/watch?v=hbeEuYAZFL4 .   \n \n An old plate of mine was a slut she loved to send nudes to guys that she wanted to fuck . She did it all the time .  However one day she was telling me a story about how her best friends older brother  tried hitting on her.  He mentioned he would love to see a pic of her tits and she was fucking insulted.   She mentioned how he didn't know how to treat women and he was and this is an exact quote \" creepy\" .  \n  \nMind you I've had this girl come over, blow me , and sent her home. I've called her just about every offensive name you can call a woman ( She was into it) , I and many others had fucked this girl seven ways to sunday .      Yet this dude she was not attracted to merely mentioning a sexual interest in her was vile and repulsive.  \n  \nI get what both of you are saying women are validation machines but thereis a quality bar  however I think that quality bar fluctuates with her mood just like everything else about a woman ( her memories , perceptions ,etc.) . When she feels ugly and like a pile of shit some loser telling her she's hotter than  Elizabeth Taylor in her prime will make her feel better. His advances aren't appreciated quite as much  but his attention is ( Even this is blurry Women go out on dates and give Beta Schlubs a \" shot\" to wine and dine them when they are burned out on alphas) .   \n  \nWhen she feels attractive  though and like she can have Any man she wants? It's an offense ,  why would she entertain the interest of some scrub when she knows that she can do better?  She's hot , she knows/ feels it , and a man that she perceives beneath her  complimenting her is a waste of time and if he thinks he has a chance it's actually offensive .  \" Why would a girl like me go out with a guy like him?\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love this old Comedy skit which I think is pretty accurate if you read between the lines  : &lt;a href=\"https://www.youtube.com/watch?v=hbeEuYAZFL4\"&gt;https://www.youtube.com/watch?v=hbeEuYAZFL4&lt;/a&gt; .   &lt;/p&gt;\n\n&lt;p&gt;An old plate of mine was a slut she loved to send nudes to guys that she wanted to fuck . She did it all the time .  However one day she was telling me a story about how her best friends older brother  tried hitting on her.  He mentioned he would love to see a pic of her tits and she was fucking insulted.   She mentioned how he didn&amp;#39;t know how to treat women and he was and this is an exact quote &amp;quot; creepy&amp;quot; .  &lt;/p&gt;\n\n&lt;p&gt;Mind you I&amp;#39;ve had this girl come over, blow me , and sent her home. I&amp;#39;ve called her just about every offensive name you can call a woman ( She was into it) , I and many others had fucked this girl seven ways to sunday .      Yet this dude she was not attracted to merely mentioning a sexual interest in her was vile and repulsive.  &lt;/p&gt;\n\n&lt;p&gt;I get what both of you are saying women are validation machines but thereis a quality bar  however I think that quality bar fluctuates with her mood just like everything else about a woman ( her memories , perceptions ,etc.) . When she feels ugly and like a pile of shit some loser telling her she&amp;#39;s hotter than  Elizabeth Taylor in her prime will make her feel better. His advances aren&amp;#39;t appreciated quite as much  but his attention is ( Even this is blurry Women go out on dates and give Beta Schlubs a &amp;quot; shot&amp;quot; to wine and dine them when they are burned out on alphas) .   &lt;/p&gt;\n\n&lt;p&gt;When she feels attractive  though and like she can have Any man she wants? It&amp;#39;s an offense ,  why would she entertain the interest of some scrub when she knows that she can do better?  She&amp;#39;s hot , she knows/ feels it , and a man that she perceives beneath her  complimenting her is a waste of time and if he thinks he has a chance it&amp;#39;s actually offensive .  &amp;quot; Why would a girl like me go out with a guy like him?&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9qovh", "score_hidden": false, "stickied": false, "created": 1492232224.0, "created_utc": 1492203424.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9rsbj", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "good_guy_submitter", "parent_id": "t1_dg9rjes", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Yeah. Such is women. Everything about them is indirect. They evolved to be that way, it was necessary as our weaker counterparts. While you can risk angering another dude and know the worst he can do is try to fight you, women can't physically defend themselves from even a pathetic beta male. \n\nDon't hate them for it. But understand it and proceed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah. Such is women. Everything about them is indirect. They evolved to be that way, it was necessary as our weaker counterparts. While you can risk angering another dude and know the worst he can do is try to fight you, women can&amp;#39;t physically defend themselves from even a pathetic beta male. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t hate them for it. But understand it and proceed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9rsbj", "score_hidden": false, "stickied": false, "created": 1492233600.0, "created_utc": 1492204800.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9rjes", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "bobjoe177", "parent_id": "t1_dg9p33q", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I get the same thing w dudes hitting on me, but the interaction is so different when I rebuff them. I have no qualms about giving a hard no right off the bat, and they inevitably understand exactly what I mean by it. With women getting unwanted advances they often just give these vague indirect subtexty clues and then wonder why betafag doesn't get the hint.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get the same thing w dudes hitting on me, but the interaction is so different when I rebuff them. I have no qualms about giving a hard no right off the bat, and they inevitably understand exactly what I mean by it. With women getting unwanted advances they often just give these vague indirect subtexty clues and then wonder why betafag doesn&amp;#39;t get the hint.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9rjes", "score_hidden": false, "stickied": false, "created": 1492233291.0, "created_utc": 1492204491.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9p33q", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "good_guy_submitter", "parent_id": "t1_dg9m864", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Eh I'm with g petro on this one.\n\nIt's the reason girls post on gonewild and the like. The girls that are regulars get plenty of pm'd dick pics from unattractive fat guys. Yet they keep posting.\n\nI can't say I blame them. If I could legally walk around naked and have all sorts of women, attractive and ugly alike, drooling over me and hitting on me then I'd probably do so. But women don't approach. \n\nThe truth is, I get hit on more by gay guys than women. That is something I don't want, but it is still flattering. They can look and compliment me all they want, but please don't ever touch me. Which is probably exactly how women feel about the majority of men.\n\n\n\n   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh I&amp;#39;m with g petro on this one.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s the reason girls post on gonewild and the like. The girls that are regulars get plenty of pm&amp;#39;d dick pics from unattractive fat guys. Yet they keep posting.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t say I blame them. If I could legally walk around naked and have all sorts of women, attractive and ugly alike, drooling over me and hitting on me then I&amp;#39;d probably do so. But women don&amp;#39;t approach. &lt;/p&gt;\n\n&lt;p&gt;The truth is, I get hit on more by gay guys than women. That is something I don&amp;#39;t want, but it is still flattering. They can look and compliment me all they want, but please don&amp;#39;t ever touch me. Which is probably exactly how women feel about the majority of men.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9p33q", "score_hidden": false, "stickied": false, "created": 1492230283.0, "created_utc": 1492201483.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9s7ec", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "drallcom3", "parent_id": "t1_dg9m864", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "A woman doesn't have power over a beta that isn't attracted to her, and in a broader sense he isn't that beta then since he has choices. Therefore she likes any attraction. Shit tests are just for selection.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A woman doesn&amp;#39;t have power over a beta that isn&amp;#39;t attracted to her, and in a broader sense he isn&amp;#39;t that beta then since he has choices. Therefore she likes any attraction. Shit tests are just for selection.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9s7ec", "score_hidden": false, "stickied": false, "created": 1492234134.0, "created_utc": 1492205334.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9m864", "gilded": 0, "archived": false, "score": 46, "report_reasons": null, "author": "Barvazon", "parent_id": "t1_dg9ar0p", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I disagree.\n\nYou're unattractive? That's sexual harassment. You're hot? Completely different story.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I disagree.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re unattractive? That&amp;#39;s sexual harassment. You&amp;#39;re hot? Completely different story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9m864", "score_hidden": false, "stickied": false, "created": 1492226850.0, "created_utc": 1492198050.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 46}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ar0p", "gilded": 0, "archived": false, "score": 54, "report_reasons": null, "author": "G_Petronius", "parent_id": "t1_dg99y4t", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; .... by attractive alpha men.\n\nBy all men, beta and alpha alike. Being sexually attractive to a man gives a woman power over him; if he's an alpha, power to hopefully fuck him, and if he's a beta power to make him do what she wants. She won't get wet at the thought of a beta wanting her, she won't make herself available to his awkward and timid advances, but she won't be troubled by the notion. She might feign it for the purpose of manipulation (\"how dare you find me attractive? you must humble yourself and make amends for this terrible crime!\") or because it's socially advantageous (such as shaming a man who is 'beneath' her to reaffirm her social standing).\n\nIn fact, women get fucking offended if a man who by all rights should be a beta doesn't seem to worship her every step and implicitly want to fuck her. How dare he?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;.... by attractive alpha men.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;By all men, beta and alpha alike. Being sexually attractive to a man gives a woman power over him; if he&amp;#39;s an alpha, power to hopefully fuck him, and if he&amp;#39;s a beta power to make him do what she wants. She won&amp;#39;t get wet at the thought of a beta wanting her, she won&amp;#39;t make herself available to his awkward and timid advances, but she won&amp;#39;t be troubled by the notion. She might feign it for the purpose of manipulation (&amp;quot;how dare you find me attractive? you must humble yourself and make amends for this terrible crime!&amp;quot;) or because it&amp;#39;s socially advantageous (such as shaming a man who is &amp;#39;beneath&amp;#39; her to reaffirm her social standing).&lt;/p&gt;\n\n&lt;p&gt;In fact, women get fucking offended if a man who by all rights should be a beta doesn&amp;#39;t seem to worship her every step and implicitly want to fuck her. How dare he?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9ar0p", "score_hidden": false, "stickied": false, "created": 1492213525.0, "created_utc": 1492184725.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 54}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dga4z0z", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "CrypticG", "parent_id": "t1_dg99y4t", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Rule 1: Be attractive\n\nRule 2: Don't be unattractive", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rule 1: Be attractive&lt;/p&gt;\n\n&lt;p&gt;Rule 2: Don&amp;#39;t be unattractive&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga4z0z", "score_hidden": false, "stickied": false, "created": 1492251276.0, "created_utc": 1492222476.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgamarw", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "NaughtyFred", "parent_id": "t1_dg99y4t", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "It's a real thing. I gamed a girl off reddit who before was saying and doing all sorts of nasty stuff via text and video. Second she met me and realised I didn't meet her standards she became a whole different, more prudish person.\n\nLesson learned.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a real thing. I gamed a girl off reddit who before was saying and doing all sorts of nasty stuff via text and video. Second she met me and realised I didn&amp;#39;t meet her standards she became a whole different, more prudish person.&lt;/p&gt;\n\n&lt;p&gt;Lesson learned.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgamarw", "score_hidden": false, "stickied": false, "created": 1492290196.0, "created_utc": 1492261396.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgacrk5", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "slay_it_forward", "parent_id": "t1_dg9akd5", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "You don't get inducted by reading reddit posts. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t get inducted by reading reddit posts. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgacrk5", "score_hidden": false, "stickied": false, "created": 1492264297.0, "created_utc": 1492235497.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9akd5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "420KUSHBUSH", "parent_id": "t1_dg99y4t", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Feels good to finally be inducted.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Feels good to finally be inducted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9akd5", "score_hidden": false, "stickied": false, "created": 1492213313.0, "created_utc": 1492184513.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgcwdql", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MattyAnon", "parent_id": "t1_dgcvguo", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; Nobody made me believe women when they told me to be a nice guy, I did that all on my own.\n\nI don't buy this.\n\nI don't hold you or any other man (or me) responsible for the brainwashing we got.  We're all social creatures.  It's not our fault we were misled by everyone around us.\n\n&gt; Just because it makes you happy doesn't mean its good for you, or good for other people, and you are CERTAINLY not entitled to it.\n\nLook, noone is saying \"be happy at all costs even if that means raping your younger sister\", that's just silly.\n\nBut all normal children absolutely should have a happy and normal childhood.  That's practically the bedrock of any civilised society and something we should all strive for.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Nobody made me believe women when they told me to be a nice guy, I did that all on my own.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t buy this.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t hold you or any other man (or me) responsible for the brainwashing we got.  We&amp;#39;re all social creatures.  It&amp;#39;s not our fault we were misled by everyone around us.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Just because it makes you happy doesn&amp;#39;t mean its good for you, or good for other people, and you are CERTAINLY not entitled to it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Look, noone is saying &amp;quot;be happy at all costs even if that means raping your younger sister&amp;quot;, that&amp;#39;s just silly.&lt;/p&gt;\n\n&lt;p&gt;But all normal children absolutely should have a happy and normal childhood.  That&amp;#39;s practically the bedrock of any civilised society and something we should all strive for.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgcwdql", "score_hidden": false, "stickied": false, "created": 1492421158.0, "created_utc": 1492392358.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcvguo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MrBellsprout123", "parent_id": "t1_dgc5mnv", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "You don't get to decide what kids should and should not get. No you are not entitled to a happy childhood, you are entitled to nothing in this world.  \n\nI believe you to be brainwashed more than me, telling little children that they're entitled to happiness is exactly what the feminist narrative teaches you.\n\n\"You are entitled to a happy childhood, and if you don't have one, its not your fault and you got screwed over.\"\n\nThis is not true, you are not entitled to anything.  You have to work, for everything, even if you're a child. I could have ignored the feminist narrative, sure they fed it to me, but nobody made me buy into it.  Nobody put a gun to my head and made me drive women to their boyfriends house just so they could get fucked, and then make me pick them up.  Nobody put a gun to my head and made me do that, I did that all on my own.  Nobody made me believe women when they told me to be a nice guy, I did that all on my own. Nobody made me buy into the feminist brainwashing, I did all of that on my own. I take 100% ownership of my miserable and depressing childhood, and it is 100% my fault.  There's about a 1000 things I could have done differently.\n\n&gt;All kids should have a happy childhood\n\nWhat if making the children happy means raping their younger sister?  What if making them happy means beating the shit out of smaller kids?  I bet that 16 year old is really happy when she gets plated by the 25 year old drug dealer. Just because it makes you happy doesn't mean its good for  you, or good for other people, and you are certainly not entitled to it.  I think you need to put a little more thought into your opinions.   \n\nSure it sounds good to say that all kids should have a happy childhood, and everyone will clap and everyone will like you, everyone will talk about what a nice guy you are, because its an approved point of view, but its simply not true.  Don't be that guy.\n\nYou are entitled to nothing, not even life, not even the air you breathe or the water you drink, you are not entitled to parents, you are not entitled to a father, you are not entitled to a mother, you are entitled to nothing.  ALL of these things are a gift from life to you.  The moment you believe to be entitled to these things, is the moment you've lost.\nI feel very sorry for people who believe they are entitled to these things.  Being grateful is a much better feeling than being entitled.  One is an appreciation of the things in your life, the second is an undeserved sense of standard of living.\n\nFor thousands of years the mortality rate for babies was very high, now its very low.  Regardless of your childhood, you should be happy you had one at all, a lot of people didn't.", "edited": 1492392139.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t get to decide what kids should and should not get. No you are not entitled to a happy childhood, you are entitled to nothing in this world.  &lt;/p&gt;\n\n&lt;p&gt;I believe you to be brainwashed more than me, telling little children that they&amp;#39;re entitled to happiness is exactly what the feminist narrative teaches you.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You are entitled to a happy childhood, and if you don&amp;#39;t have one, its not your fault and you got screwed over.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This is not true, you are not entitled to anything.  You have to work, for everything, even if you&amp;#39;re a child. I could have ignored the feminist narrative, sure they fed it to me, but nobody made me buy into it.  Nobody put a gun to my head and made me drive women to their boyfriends house just so they could get fucked, and then make me pick them up.  Nobody put a gun to my head and made me do that, I did that all on my own.  Nobody made me believe women when they told me to be a nice guy, I did that all on my own. Nobody made me buy into the feminist brainwashing, I did all of that on my own. I take 100% ownership of my miserable and depressing childhood, and it is 100% my fault.  There&amp;#39;s about a 1000 things I could have done differently.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;All kids should have a happy childhood&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What if making the children happy means raping their younger sister?  What if making them happy means beating the shit out of smaller kids?  I bet that 16 year old is really happy when she gets plated by the 25 year old drug dealer. Just because it makes you happy doesn&amp;#39;t mean its good for  you, or good for other people, and you are certainly not entitled to it.  I think you need to put a little more thought into your opinions.   &lt;/p&gt;\n\n&lt;p&gt;Sure it sounds good to say that all kids should have a happy childhood, and everyone will clap and everyone will like you, everyone will talk about what a nice guy you are, because its an approved point of view, but its simply not true.  Don&amp;#39;t be that guy.&lt;/p&gt;\n\n&lt;p&gt;You are entitled to nothing, not even life, not even the air you breathe or the water you drink, you are not entitled to parents, you are not entitled to a father, you are not entitled to a mother, you are entitled to nothing.  ALL of these things are a gift from life to you.  The moment you believe to be entitled to these things, is the moment you&amp;#39;ve lost.\nI feel very sorry for people who believe they are entitled to these things.  Being grateful is a much better feeling than being entitled.  One is an appreciation of the things in your life, the second is an undeserved sense of standard of living.&lt;/p&gt;\n\n&lt;p&gt;For thousands of years the mortality rate for babies was very high, now its very low.  Regardless of your childhood, you should be happy you had one at all, a lot of people didn&amp;#39;t.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgcvguo", "score_hidden": false, "stickied": false, "created": 1492420000.0, "created_utc": 1492391200.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc5mnv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MattyAnon", "parent_id": "t1_dgboqzd", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; e I'll always know what her motives are. I lost a lot of time when I was a kid, not that I was entitled to it.\n\nYou WERE entitled to it.  And yes your mother (and everyone else) brainwashed you.\n\n&gt; \"You are not entitled to a happy childhood.\"\n\nIf this gives you peace then great.  But all kids should have a happy childhood.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;e I&amp;#39;ll always know what her motives are. I lost a lot of time when I was a kid, not that I was entitled to it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You WERE entitled to it.  And yes your mother (and everyone else) brainwashed you.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;You are not entitled to a happy childhood.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If this gives you peace then great.  But all kids should have a happy childhood.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgc5mnv", "score_hidden": false, "stickied": false, "created": 1492385633.0, "created_utc": 1492356833.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgboqzd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MrBellsprout123", "parent_id": "t1_dg99y4t", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "If I had read this paragraph when I was 16 It would have saved me a lot of heart ache.  \n\nI won't say I'm pissed at my mother for brainwashing me, but lets just say for the rest of my life I'll always know what her motives are.  I lost a lot of time when I was a kid, not that I was entitled to it.\n\nOne thing that has helped me a ton when reflecting on my blue pill days, with all the anger and bitterness and wasted time, is this:\n\n\"You are not entitled to a happy childhood.\"\n\nWhen I reflect on this I feel really good and proud of myself for realizing this, and just thankful that I found TRP when I did.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I had read this paragraph when I was 16 It would have saved me a lot of heart ache.  &lt;/p&gt;\n\n&lt;p&gt;I won&amp;#39;t say I&amp;#39;m pissed at my mother for brainwashing me, but lets just say for the rest of my life I&amp;#39;ll always know what her motives are.  I lost a lot of time when I was a kid, not that I was entitled to it.&lt;/p&gt;\n\n&lt;p&gt;One thing that has helped me a ton when reflecting on my blue pill days, with all the anger and bitterness and wasted time, is this:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You are not entitled to a happy childhood.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;When I reflect on this I feel really good and proud of myself for realizing this, and just thankful that I found TRP when I did.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgboqzd", "score_hidden": false, "stickied": false, "created": 1492346159.0, "created_utc": 1492317359.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg99y4t", "gilded": 0, "archived": false, "score": 248, "report_reasons": null, "author": "MattyAnon", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Yup.\n\nSociety is created by the majority.  The majority of women are over 30 and the majority of men are beta.  Those are the loudest voices and those are the majority of the voices.\n\n&gt; Women crave being sexualized\n\n.... by attractive alpha men.\n\nBetas are expected to admire her from afar and validate her and provide for her and click \"like\" and offer to marry her but are ewwwwwwww not allowed to touch.  That would be icky and wrong and they must be shamed for this behaviour.  Because she's totally not a sex object.  She has hopes and dreams and is a real person!\n\n.... except she truly and deeply desires to submit and slut herself out for an attractive man.  To please him and in the process be pleased herself.\n\nYou are expected to know all this so that she doesn't have to admit it or take responsibility for it.\n\nWelcome to the secret society.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yup.&lt;/p&gt;\n\n&lt;p&gt;Society is created by the majority.  The majority of women are over 30 and the majority of men are beta.  Those are the loudest voices and those are the majority of the voices.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Women crave being sexualized&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;.... by attractive alpha men.&lt;/p&gt;\n\n&lt;p&gt;Betas are expected to admire her from afar and validate her and provide for her and click &amp;quot;like&amp;quot; and offer to marry her but are ewwwwwwww not allowed to touch.  That would be icky and wrong and they must be shamed for this behaviour.  Because she&amp;#39;s totally not a sex object.  She has hopes and dreams and is a real person!&lt;/p&gt;\n\n&lt;p&gt;.... except she truly and deeply desires to submit and slut herself out for an attractive man.  To please him and in the process be pleased herself.&lt;/p&gt;\n\n&lt;p&gt;You are expected to know all this so that she doesn&amp;#39;t have to admit it or take responsibility for it.&lt;/p&gt;\n\n&lt;p&gt;Welcome to the secret society.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg99y4t", "score_hidden": false, "stickied": false, "created": 1492212585.0, "created_utc": 1492183785.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 248}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9bkvd", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "LymanRP", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Great post. One of my biggest TRP turning points was to fully recognize that women WANT to be sexual, and that it is good for me to be sexual as an attractive, confident man. So many years of BP programming had me being friendly with women, afraid to joke/flirt/touch for fear of being labeled as creepy, etc. I can think of a handful of women from high school through my early 20's who in hindsight were basically throwing themselves at me but old school BP me was afraid to make a move.\n\nWhen in doubt, escalate and assume attraction. Be sexual and don't be ashamed of it. You don't apologize when you're hungry and you need a bite to eat, nor when you're thirsty and you need a drink. Sex is a biological need. Be sexual and don't apologize for it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post. One of my biggest TRP turning points was to fully recognize that women WANT to be sexual, and that it is good for me to be sexual as an attractive, confident man. So many years of BP programming had me being friendly with women, afraid to joke/flirt/touch for fear of being labeled as creepy, etc. I can think of a handful of women from high school through my early 20&amp;#39;s who in hindsight were basically throwing themselves at me but old school BP me was afraid to make a move.&lt;/p&gt;\n\n&lt;p&gt;When in doubt, escalate and assume attraction. Be sexual and don&amp;#39;t be ashamed of it. You don&amp;#39;t apologize when you&amp;#39;re hungry and you need a bite to eat, nor when you&amp;#39;re thirsty and you need a drink. Sex is a biological need. Be sexual and don&amp;#39;t apologize for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9bkvd", "score_hidden": false, "stickied": false, "created": 1492214483.0, "created_utc": 1492185683.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9mk8p", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "SpeakerToRedditors", "parent_id": "t1_dg9fzxi", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Think of it this way. **Nothing** Chad can do is creepy. \n   Creeyness = SMV/suxual advances.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Think of it this way. &lt;strong&gt;Nothing&lt;/strong&gt; Chad can do is creepy. \n   Creeyness = SMV/suxual advances.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9mk8p", "score_hidden": false, "stickied": false, "created": 1492227248.0, "created_utc": 1492198448.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9fzxi", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "SJHammer", "parent_id": "t1_dg9cy8v", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Ive said that sooooo many times \"I dont want to be creepy\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ive said that sooooo many times &amp;quot;I dont want to be creepy&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9fzxi", "score_hidden": false, "stickied": false, "created": 1492219442.0, "created_utc": 1492190642.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9cy8v", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "DM112090", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Makes me happy to know there are so many sociologically observant men on here.\n\nYour part on men being conditioned not to \"creep women out\" hit the nail on the head. \n\nWomen want to feel wanted.\n\nRelevant story. Plate I took years ago - real dirty talker - asks me right in the thick of hitting it: \"You jerk off to me? Yeah?\"\n\nI turned her over into doggy and didn't say a word. I was gonna start laughing otherwise. She was the mousiest, most timid girl in my sights.\n\nBut do you see what it reveals? Women *want* to be wanted.\n\nIt is programmed into them first to be the object of men's desire, and second, to hate our dominion over them. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Makes me happy to know there are so many sociologically observant men on here.&lt;/p&gt;\n\n&lt;p&gt;Your part on men being conditioned not to &amp;quot;creep women out&amp;quot; hit the nail on the head. &lt;/p&gt;\n\n&lt;p&gt;Women want to feel wanted.&lt;/p&gt;\n\n&lt;p&gt;Relevant story. Plate I took years ago - real dirty talker - asks me right in the thick of hitting it: &amp;quot;You jerk off to me? Yeah?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I turned her over into doggy and didn&amp;#39;t say a word. I was gonna start laughing otherwise. She was the mousiest, most timid girl in my sights.&lt;/p&gt;\n\n&lt;p&gt;But do you see what it reveals? Women &lt;em&gt;want&lt;/em&gt; to be wanted.&lt;/p&gt;\n\n&lt;p&gt;It is programmed into them first to be the object of men&amp;#39;s desire, and second, to hate our dominion over them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9cy8v", "score_hidden": false, "stickied": false, "created": 1492215984.0, "created_utc": 1492187184.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgasadd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "max_peenor", "parent_id": "t1_dgallx2", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Uh huh.  They do, but you need to get them there.  There is a lot of science behind the difference between sexually spontaneous, which most men are, and sexually responsive, which most women are.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Uh huh.  They do, but you need to get them there.  There is a lot of science behind the difference between sexually spontaneous, which most men are, and sexually responsive, which most women are.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgasadd", "score_hidden": false, "stickied": false, "created": 1492299969.0, "created_utc": 1492271169.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgallx2", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Sir_Distic", "parent_id": "t1_dg9drd7", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Bull. The vast majority of women under 30 LOVE sex. They want it as often as men do. They have been taught by society not to ask for it or act like they want it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bull. The vast majority of women under 30 LOVE sex. They want it as often as men do. They have been taught by society not to ask for it or act like they want it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgallx2", "score_hidden": false, "stickied": false, "created": 1492288707.0, "created_utc": 1492259907.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgdnpod", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "max_peenor", "parent_id": "t1_dgatilo", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; The VAST MAJORITY of women are what's called \"sexually responsive.\" \n\nInitiating for women usually doesn't involve them running at you with a spread pussy ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The VAST MAJORITY of women are what&amp;#39;s called &amp;quot;sexually responsive.&amp;quot; &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Initiating for women usually doesn&amp;#39;t involve them running at you with a spread pussy &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgdnpod", "score_hidden": false, "stickied": false, "created": 1492473216.0, "created_utc": 1492444416.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgatilo", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "nattyX", "parent_id": "t1_dgas7nm", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; They don't start there.\n\nNo. A lot start there, take you there, finish, and want seconds. Are you implying women don't initiate?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;They don&amp;#39;t start there.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No. A lot start there, take you there, finish, and want seconds. Are you implying women don&amp;#39;t initiate?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgatilo", "score_hidden": false, "stickied": false, "created": 1492301673.0, "created_utc": 1492272873.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgas7nm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "max_peenor", "parent_id": "t1_dgaq5ej", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "They want you to take them there.  They don't start there.  You miss the point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They want you to take them there.  They don&amp;#39;t start there.  You miss the point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgas7nm", "score_hidden": false, "stickied": false, "created": 1492299861.0, "created_utc": 1492271061.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaq5ej", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nattyX", "parent_id": "t1_dg9drd7", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Well written but not true. Women love being impaled by cock. A large majority of women want sex just as much if not more than men.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well written but not true. Women love being impaled by cock. A large majority of women want sex just as much if not more than men.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaq5ej", "score_hidden": false, "stickied": false, "created": 1492296898.0, "created_utc": 1492268098.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9drd7", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "max_peenor", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "\"You always seem to get through to me.\" -- A young lass I would summon for sex dates from time to time.   She would tell me how she didn't really like sex but somehow I managed to get past that and get her into the mood.\n\n\"He's disgusting.  He begs for sex.  I can't stand it.\"  -- Same lass talking about her finance (yeah, didn't know about him at first).  He was not an unattractive guy at all, but he begged for sex.  BEGGED.  The only words about sex she got from me was a warning of what was going to happen to her.\n\nThe vast majority of women are what's called \"sexually responsive.\"  They actually don't want sex or even enjoy it until it is actually happening to them, and then they fucking love it.  You need to carry them across that threshold.  It starts with attraction.  It moves through physically taking command of their bodies (consensually, of course, but still with certainty and strength).  It ends with you pounding her delicate parts.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;You always seem to get through to me.&amp;quot; -- A young lass I would summon for sex dates from time to time.   She would tell me how she didn&amp;#39;t really like sex but somehow I managed to get past that and get her into the mood.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He&amp;#39;s disgusting.  He begs for sex.  I can&amp;#39;t stand it.&amp;quot;  -- Same lass talking about her finance (yeah, didn&amp;#39;t know about him at first).  He was not an unattractive guy at all, but he begged for sex.  BEGGED.  The only words about sex she got from me was a warning of what was going to happen to her.&lt;/p&gt;\n\n&lt;p&gt;The vast majority of women are what&amp;#39;s called &amp;quot;sexually responsive.&amp;quot;  They actually don&amp;#39;t want sex or even enjoy it until it is actually happening to them, and then they fucking love it.  You need to carry them across that threshold.  It starts with attraction.  It moves through physically taking command of their bodies (consensually, of course, but still with certainty and strength).  It ends with you pounding her delicate parts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9drd7", "score_hidden": false, "stickied": false, "created": 1492216900.0, "created_utc": 1492188100.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9lr5p", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "SpeakerToRedditors", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Exactly, however women want to be sexualized by men. 80% of the males she see are not men.", "edited": 1492197664.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly, however women want to be sexualized by men. 80% of the males she see are not men.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9lr5p", "score_hidden": false, "stickied": false, "created": 1492226273.0, "created_utc": 1492197473.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9h5co", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "slothsenpai", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This has been by far one of the more ground-breaking things for me when swallowing the pill. Even the intelligent, successful, upper class girls love being objectified who admit to me later that my sexually charged conversations turned them on, even after she seemed a bit apathetic/bored when I initially had polite conversations with her from the beginning.\n\nEven to this day, it's hard to unlearn most of this shit since if you're with a girl who's deemed \"too pretty\", you might suddenly get intimidated and refrain from sex talk in fear of \"disrespecting\" her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This has been by far one of the more ground-breaking things for me when swallowing the pill. Even the intelligent, successful, upper class girls love being objectified who admit to me later that my sexually charged conversations turned them on, even after she seemed a bit apathetic/bored when I initially had polite conversations with her from the beginning.&lt;/p&gt;\n\n&lt;p&gt;Even to this day, it&amp;#39;s hard to unlearn most of this shit since if you&amp;#39;re with a girl who&amp;#39;s deemed &amp;quot;too pretty&amp;quot;, you might suddenly get intimidated and refrain from sex talk in fear of &amp;quot;disrespecting&amp;quot; her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9h5co", "score_hidden": false, "stickied": false, "created": 1492220779.0, "created_utc": 1492191979.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9akul", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Rudeyyyy", "parent_id": "t1_dg99zih", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "agreed, you should see yourself as a 10/10 and nothing less. If you have something you don't like about yourself, address it, and fix it. Making women feel like they aren't sexy will make them throw themselves at you almost because they want to feel wanted and want validation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;agreed, you should see yourself as a 10/10 and nothing less. If you have something you don&amp;#39;t like about yourself, address it, and fix it. Making women feel like they aren&amp;#39;t sexy will make them throw themselves at you almost because they want to feel wanted and want validation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9akul", "score_hidden": false, "stickied": false, "created": 1492213328.0, "created_utc": 1492184528.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgaa4pl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Duck_H8r", "parent_id": "t1_dg99zih", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I just found this one out, never thought I'd be \"own of those jerks\" even though I didn't get physically or emotionally involved before splitting up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just found this one out, never thought I&amp;#39;d be &amp;quot;own of those jerks&amp;quot; even though I didn&amp;#39;t get physically or emotionally involved before splitting up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaa4pl", "score_hidden": false, "stickied": false, "created": 1492259292.0, "created_utc": 1492230492.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgaff3h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "collegegreens", "parent_id": "t1_dg99zih", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This sounds like the hot and cold technique. I've used it to great effect myself. It only works once you have them initially hooked, so I guess if you're super attractive you could start off cold, but most of us should start hot. Then you deprive them of it. Treat them like a man (which they hate). Notice other women. Then when you're at your place you can push her against the wall and she'll already be dripping wet. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This sounds like the hot and cold technique. I&amp;#39;ve used it to great effect myself. It only works once you have them initially hooked, so I guess if you&amp;#39;re super attractive you could start off cold, but most of us should start hot. Then you deprive them of it. Treat them like a man (which they hate). Notice other women. Then when you&amp;#39;re at your place you can push her against the wall and she&amp;#39;ll already be dripping wet. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaff3h", "score_hidden": false, "stickied": false, "created": 1492270675.0, "created_utc": 1492241875.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg99zih", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "jumpinglane", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "wanna know the secret to attracting women? treat them like they are NOT sexy, treat them indifferent. Treat them like they are below average for you. They will jump through all kind of hoops to make you care for them, to feel like a woman, a sexual object. only applies with high SMV, of course.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;wanna know the secret to attracting women? treat them like they are NOT sexy, treat them indifferent. Treat them like they are below average for you. They will jump through all kind of hoops to make you care for them, to feel like a woman, a sexual object. only applies with high SMV, of course.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg99zih", "score_hidden": false, "stickied": false, "created": 1492212629.0, "created_utc": 1492183829.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9tagq", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Elephantois", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "for those interested in the \"secret society\":\n\nhttp://bristollair.com/2008/inner-game/nature-reality/secret-society/\n\nit's a great read if nothing else, but I think it hits at something very deep and real", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;for those interested in the &amp;quot;secret society&amp;quot;:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://bristollair.com/2008/inner-game/nature-reality/secret-society/\"&gt;http://bristollair.com/2008/inner-game/nature-reality/secret-society/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;it&amp;#39;s a great read if nothing else, but I think it hits at something very deep and real&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9tagq", "score_hidden": false, "stickied": false, "created": 1492235531.0, "created_utc": 1492206731.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgac4c6", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "CHIPPENDALESIXNINE", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Holy shit. Made me have an epiphany. This isn't saying as to go up and \"grab me by the pussy\". It's telling me to not make the mistake I've been making. I thought back to times where chicks sit too close, talk to close to my face, or grab me by the arm as they say bye or thank you. It's like they're asking to be sexualized. They've been actually making their moves the best they know how and my blue pill ass has been pulling away all those times, as if they got that close to me on accident. Then my body language basically says, \"I'm not interested\" or \"I'm intimidated and your SMV is higher\". \n\nI actually remember a specific night where a hot chick offered to salsa with me, I declined because I don't know how, she offered to teach me, but I thought I'd make a fool out of myself. She actually thought I was rejecting her. Dumb ass BP mistakes I'll never make again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy shit. Made me have an epiphany. This isn&amp;#39;t saying as to go up and &amp;quot;grab me by the pussy&amp;quot;. It&amp;#39;s telling me to not make the mistake I&amp;#39;ve been making. I thought back to times where chicks sit too close, talk to close to my face, or grab me by the arm as they say bye or thank you. It&amp;#39;s like they&amp;#39;re asking to be sexualized. They&amp;#39;ve been actually making their moves the best they know how and my blue pill ass has been pulling away all those times, as if they got that close to me on accident. Then my body language basically says, &amp;quot;I&amp;#39;m not interested&amp;quot; or &amp;quot;I&amp;#39;m intimidated and your SMV is higher&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;I actually remember a specific night where a hot chick offered to salsa with me, I declined because I don&amp;#39;t know how, she offered to teach me, but I thought I&amp;#39;d make a fool out of myself. She actually thought I was rejecting her. Dumb ass BP mistakes I&amp;#39;ll never make again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgac4c6", "score_hidden": false, "stickied": false, "created": 1492262933.0, "created_utc": 1492234133.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9di2u", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "NuclearTruthBomb", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Women are the objects. Men are the objectifiers. \n\nLike any other kind of object, women are attained by the most successful of men. And once they become owned, they are a reflection of their owner, not themselves. \n\nOf course, like high-end wristwatches and sports cars, high-grade women are unattainable to the average Joe Smoe. To purchase one, you must accumulate high value. Then she's free to become \"yours\", whenever you are buying her or renting.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Women are the objects. Men are the objectifiers. &lt;/p&gt;\n\n&lt;p&gt;Like any other kind of object, women are attained by the most successful of men. And once they become owned, they are a reflection of their owner, not themselves. &lt;/p&gt;\n\n&lt;p&gt;Of course, like high-end wristwatches and sports cars, high-grade women are unattainable to the average Joe Smoe. To purchase one, you must accumulate high value. Then she&amp;#39;s free to become &amp;quot;yours&amp;quot;, whenever you are buying her or renting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9di2u", "score_hidden": false, "stickied": false, "created": 1492216609.0, "created_utc": 1492187809.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9hfgm", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "samureyejacque", "parent_id": "t1_dg9ehmh", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I agree with this. I see your comment getting downvoted but my own experiences speak to the validity of this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with this. I see your comment getting downvoted but my own experiences speak to the validity of this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9hfgm", "score_hidden": false, "stickied": false, "created": 1492221109.0, "created_utc": 1492192309.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9teef", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Docbear64", "parent_id": "t1_dg9ehmh", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Absolutely,  the most interesting thing I've experienced as I've become more experienced with women is the ones who complain about men who catch feelings for them and how attracted they become to you when you don't fall head over heels for them like other men .  \n  \nI never thought about it but it is the absolute opposite of everything I grew up being taught about women and yet the more women I meet the more I know with this \"affliction\" of men hopelessly falling in love with them  when all she really wanted to do was have  a regular dick to sit on every so often .", "edited": 1492210066.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Absolutely,  the most interesting thing I&amp;#39;ve experienced as I&amp;#39;ve become more experienced with women is the ones who complain about men who catch feelings for them and how attracted they become to you when you don&amp;#39;t fall head over heels for them like other men .  &lt;/p&gt;\n\n&lt;p&gt;I never thought about it but it is the absolute opposite of everything I grew up being taught about women and yet the more women I meet the more I know with this &amp;quot;affliction&amp;quot; of men hopelessly falling in love with them  when all she really wanted to do was have  a regular dick to sit on every so often .&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9teef", "score_hidden": false, "stickied": false, "created": 1492235675.0, "created_utc": 1492206875.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9lroj", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Ketogainsmongoose", "parent_id": "t1_dg9ehmh", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Women want to be sexualized by a man of appropriate SMV. They don't want to be sexualized by Betas, they're evolutionary dead ends. \n\nWhy make something so simple, so complicated? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Women want to be sexualized by a man of appropriate SMV. They don&amp;#39;t want to be sexualized by Betas, they&amp;#39;re evolutionary dead ends. &lt;/p&gt;\n\n&lt;p&gt;Why make something so simple, so complicated? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9lroj", "score_hidden": false, "stickied": false, "created": 1492226292.0, "created_utc": 1492197492.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgdegc4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FallenDK", "parent_id": "t1_dg9ehmh", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Sex is a gift women give? This is the most blue pill shit", "edited": 1492440607.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sex is a gift women give? This is the most blue pill shit&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgdegc4", "score_hidden": false, "stickied": false, "created": 1492459675.0, "created_utc": 1492430875.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ehmh", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "hornycutiger", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Ahh.  The sex trap.  I was locked in it for over a decade.  Do you really think women want to be sexualized?  That's perhaps the one thing almost all men are experts at doing.  And women are far more complicated than that.  No.  Women do not want to be sexualized perse.  A woman who wants to be sexualized feels that way not as an inherent or biological instinct, but as a consequence of security and control.  Women want a man who can make them feel secure.  Protected.  And a man who will tell them what to do and exert control over them.  Feminists are void of sexual desires.  They chaffe at being sexualized.  But the control and power they covet for women, makes them miserable sexually, and for good reason.  Sex is a gift women give, and a power they hold, but it's only given to men who will give them what they want.  Provide security, safety, money, and control of a relationship, and they will become sexualized.  That doesn't mean beat them and treat them like crap, but it means being a man.  Take a LTR for example.  Some say they never work.  In the beginning, a woman falls in love (lust because they don't really love like men do), because a man initially DOES NOT LOVE them.  Once that man falls in love with them, they will cease being sexual.  The man then goes from intriguing mate to a conquored and worthless person.  IF the man can keep from falling in love with the girl, the relationship can last as long as he's satisfied with her.  And it will last until the man wonders.  Feminism strikes at the core of what makes men desirable for women, but in reality it hurts them more than anything men can do to them.  Confidence, control, assertiveness, while maintaining emotional apathy (not falling in love), will drive women nuts.  I can go on and on about the real-world experiences I have had to back this up.  This is a very good post, but the rabbit hole is a lot deeper than that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ahh.  The sex trap.  I was locked in it for over a decade.  Do you really think women want to be sexualized?  That&amp;#39;s perhaps the one thing almost all men are experts at doing.  And women are far more complicated than that.  No.  Women do not want to be sexualized perse.  A woman who wants to be sexualized feels that way not as an inherent or biological instinct, but as a consequence of security and control.  Women want a man who can make them feel secure.  Protected.  And a man who will tell them what to do and exert control over them.  Feminists are void of sexual desires.  They chaffe at being sexualized.  But the control and power they covet for women, makes them miserable sexually, and for good reason.  Sex is a gift women give, and a power they hold, but it&amp;#39;s only given to men who will give them what they want.  Provide security, safety, money, and control of a relationship, and they will become sexualized.  That doesn&amp;#39;t mean beat them and treat them like crap, but it means being a man.  Take a LTR for example.  Some say they never work.  In the beginning, a woman falls in love (lust because they don&amp;#39;t really love like men do), because a man initially DOES NOT LOVE them.  Once that man falls in love with them, they will cease being sexual.  The man then goes from intriguing mate to a conquored and worthless person.  IF the man can keep from falling in love with the girl, the relationship can last as long as he&amp;#39;s satisfied with her.  And it will last until the man wonders.  Feminism strikes at the core of what makes men desirable for women, but in reality it hurts them more than anything men can do to them.  Confidence, control, assertiveness, while maintaining emotional apathy (not falling in love), will drive women nuts.  I can go on and on about the real-world experiences I have had to back this up.  This is a very good post, but the rabbit hole is a lot deeper than that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9ehmh", "score_hidden": false, "stickied": false, "created": 1492217720.0, "created_utc": 1492188920.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgaf63b", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Lildoc_911", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I've seen it work first hand. This guy who's mutual friends in my close network used to go after every girl. EVERY girl. He'd get laughed at, drinks dumped on him, kicked out of bars...but he always had a woman on his side. The ones that he kept around we fucking hot as hell too.\n\nHe wasn't faithful for shit. They would tell our network that he was a shitbag, they wanted to leave, or never see him again. They still go to his apartment to get fucked.\n\nWe stopped calling him a dog and started calling him a wolf. Dude was very overt about his intentions. Fucking.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen it work first hand. This guy who&amp;#39;s mutual friends in my close network used to go after every girl. EVERY girl. He&amp;#39;d get laughed at, drinks dumped on him, kicked out of bars...but he always had a woman on his side. The ones that he kept around we fucking hot as hell too.&lt;/p&gt;\n\n&lt;p&gt;He wasn&amp;#39;t faithful for shit. They would tell our network that he was a shitbag, they wanted to leave, or never see him again. They still go to his apartment to get fucked.&lt;/p&gt;\n\n&lt;p&gt;We stopped calling him a dog and started calling him a wolf. Dude was very overt about his intentions. Fucking.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaf63b", "score_hidden": false, "stickied": false, "created": 1492270002.0, "created_utc": 1492241202.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgafc7n", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "PaulMurrayCbr", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; Yes, sexy women are \"empowered\". Empowered to do what?\n\nTo the female mind, this question makes no sense. Being empowered is a feelz. \n\nIt's also inherently passive. The genuinely powerful don't need to be empowered.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Yes, sexy women are &amp;quot;empowered&amp;quot;. Empowered to do what?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To the female mind, this question makes no sense. Being empowered is a feelz. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also inherently passive. The genuinely powerful don&amp;#39;t need to be empowered.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgafc7n", "score_hidden": false, "stickied": false, "created": 1492270456.0, "created_utc": 1492241656.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgaliu6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sir_Distic", "parent_id": "t1_dga0cn8", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Women are fully capable and willing to let a guy know she finds him creepy or not interested. She'll let you know. \n\nGo for it, touch her. If she's not interested no big deal. There are other women out there who want your touch. \n   As for the last part: Only into her for her looks. Tell me what else she has to offer...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Women are fully capable and willing to let a guy know she finds him creepy or not interested. She&amp;#39;ll let you know. &lt;/p&gt;\n\n&lt;p&gt;Go for it, touch her. If she&amp;#39;s not interested no big deal. There are other women out there who want your touch. \n   As for the last part: Only into her for her looks. Tell me what else she has to offer...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaliu6", "score_hidden": false, "stickied": false, "created": 1492288524.0, "created_utc": 1492259724.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga0cn8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "_MysticFox", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "What's the difference between properly applying this and a girl feeling like you're a sleaze and only into her for her looks?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What&amp;#39;s the difference between properly applying this and a girl feeling like you&amp;#39;re a sleaze and only into her for her looks?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga0cn8", "score_hidden": false, "stickied": false, "created": 1492244914.0, "created_utc": 1492216114.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9limp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "VasiliyZaitzev", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Fuck yeah they do...for women **Being DESIRED is the Orgasm**.\n\nOf course standard rules apply: Be attractive, don't be unattractive, etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck yeah they do...for women &lt;strong&gt;Being DESIRED is the Orgasm&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;Of course standard rules apply: Be attractive, don&amp;#39;t be unattractive, etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9limp", "score_hidden": false, "stickied": false, "created": 1492225988.0, "created_utc": 1492197188.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dg9lcou", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "livel0bster", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This is why grabbing them by the pussy isn't a bad thing. THEY WANT IT", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is why grabbing them by the pussy isn&amp;#39;t a bad thing. THEY WANT IT&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9lcou", "score_hidden": false, "stickied": false, "created": 1492225792.0, "created_utc": 1492196992.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dga7ndm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TyrannicalWill", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Finally PUA stuff that isn't actually crap. Good job OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Finally PUA stuff that isn&amp;#39;t actually crap. Good job OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga7ndm", "score_hidden": false, "stickied": false, "created": 1492255197.0, "created_utc": 1492226397.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dga89xj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Fedor_Gavnyukov", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "of course they love being sexualized. just today i was rolling with my boy and saw a few girls running on a long street. all pretty good looking. they were all separate and good distance from each other. so we honked as we passed each one. every one of them smiled at us, and one of them waived and gave me thumbs up when i made a gesture with my hands insinuating that her ass is in great shape.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;of course they love being sexualized. just today i was rolling with my boy and saw a few girls running on a long street. all pretty good looking. they were all separate and good distance from each other. so we honked as we passed each one. every one of them smiled at us, and one of them waived and gave me thumbs up when i made a gesture with my hands insinuating that her ass is in great shape.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga89xj", "score_hidden": false, "stickied": false, "created": 1492256188.0, "created_utc": 1492227388.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgaqa7f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yomo86", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "For a woman, the only thing worse than being regarded just as a disposable piece of meat is not being regarded as a piece of meat, at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For a woman, the only thing worse than being regarded just as a disposable piece of meat is not being regarded as a piece of meat, at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaqa7f", "score_hidden": false, "stickied": false, "created": 1492297101.0, "created_utc": 1492268301.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgcdgyh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mckallidon", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "What most people don't understand is time and place. Women want to be sexualized, but only in certain contexts. This is why cat calling fails but being a dick one on one works. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What most people don&amp;#39;t understand is time and place. Women want to be sexualized, but only in certain contexts. This is why cat calling fails but being a dick one on one works. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgcdgyh", "score_hidden": false, "stickied": false, "created": 1492396034.0, "created_utc": 1492367234.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgcuxr4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sadguy88", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Why would anyone want to be one of these \"secret society\" guys? All you are is a walking, talking dildo. You aren't an alpha.\n\nIf you don't want to call out someone for cheating on their spouse(who they are in love with) then you might as well donate your balls to someone else.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why would anyone want to be one of these &amp;quot;secret society&amp;quot; guys? All you are is a walking, talking dildo. You aren&amp;#39;t an alpha.&lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t want to call out someone for cheating on their spouse(who they are in love with) then you might as well donate your balls to someone else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgcuxr4", "score_hidden": false, "stickied": false, "created": 1492419304.0, "created_utc": 1492390504.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgd82eq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mr_Dead", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "It's as simple as this. Finding a mate isn't like hunting where you stalk the prey you want. It's like fishing. You throw out your hook and see what you catch. Either keep it or throw it back. If you're not catching anything you're not using the right bait. First decide what you want. Then bait your hook accordingly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s as simple as this. Finding a mate isn&amp;#39;t like hunting where you stalk the prey you want. It&amp;#39;s like fishing. You throw out your hook and see what you catch. Either keep it or throw it back. If you&amp;#39;re not catching anything you&amp;#39;re not using the right bait. First decide what you want. Then bait your hook accordingly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgd82eq", "score_hidden": false, "stickied": false, "created": 1492440690.0, "created_utc": 1492411890.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dga8mg9", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "godofcatsandgoodfood", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The Red Pill should be about using the societal ideology surrounding sex to get laid, not trying to reassure yourself that you have value because women like you.\n\nWomen, men, all of you can go to hell. I don't give a rat's ass what society thinks sex is. All I care about is can I game the system. \n\nIt shouldn't matter to you whether feminists are right or wrong, the Red Pill isn't about right and wrong, it's about getting laid. Personally, I like fucking feminists because they rationalize sex as something good rather than something dutiful, dutiful docile women just lie there and let you fuck them. \n\nDon't let your self esteem (aka \"society points\") get in the way of a good lay.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Red Pill should be about using the societal ideology surrounding sex to get laid, not trying to reassure yourself that you have value because women like you.&lt;/p&gt;\n\n&lt;p&gt;Women, men, all of you can go to hell. I don&amp;#39;t give a rat&amp;#39;s ass what society thinks sex is. All I care about is can I game the system. &lt;/p&gt;\n\n&lt;p&gt;It shouldn&amp;#39;t matter to you whether feminists are right or wrong, the Red Pill isn&amp;#39;t about right and wrong, it&amp;#39;s about getting laid. Personally, I like fucking feminists because they rationalize sex as something good rather than something dutiful, dutiful docile women just lie there and let you fuck them. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t let your self esteem (aka &amp;quot;society points&amp;quot;) get in the way of a good lay.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga8mg9", "score_hidden": false, "stickied": false, "created": 1492256758.0, "created_utc": 1492227958.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgb0f7q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "newName543456", "parent_id": "t1_dg9nc1o", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "&gt; Most girls don't want to be sexualized\n\nPerhaps not by you. That I can certainly believe ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Most girls don&amp;#39;t want to be sexualized&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Perhaps not by you. That I can certainly believe ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgb0f7q", "score_hidden": false, "stickied": false, "created": 1492311174.0, "created_utc": 1492282374.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9nc1o", "gilded": 0, "archived": false, "score": -7, "report_reasons": null, "author": "Psychonautsareus", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "From reading these posts on this sub I can tell many of y'all don't really talk to a lot of woman or get girls. Most girls don't want to be sexualized, they just want attention.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From reading these posts on this sub I can tell many of y&amp;#39;all don&amp;#39;t really talk to a lot of woman or get girls. Most girls don&amp;#39;t want to be sexualized, they just want attention.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9nc1o", "score_hidden": false, "stickied": false, "created": 1492228177.0, "created_utc": 1492199377.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65d3bj", "likes": null, "replies": "", "user_reports": [], "id": "dgab6et", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "damaged_goods420", "parent_id": "t1_dga94ie", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Whew I can hear your heavy breathing from here ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whew I can hear your heavy breathing from here &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgab6et", "score_hidden": false, "stickied": false, "created": 1492261132.0, "created_utc": 1492232332.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga94ie", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65d3bj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga94ie", "score_hidden": false, "stickied": false, "created": 1492257581.0, "created_utc": 1492228781.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -5}}], "after": null, "before": null}}]