[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Shower thoughts \nBlue pill focuses on the past, Red Pill focuses on the future.&lt;/p&gt;\n\n&lt;p&gt;The past, focusing on regret, reliving decisions you should have made, feeling guilty/sad/ashamed of past events, running from those emotions or running from the past, believing the future is scary or feeling anxiety due to the expectation the future will be as termoultious as the past and you will be helpless to control it.&lt;/p&gt;\n\n&lt;p&gt;These are just examples of a plethora of ways a person is focused on the past. The BP reasons why a person would constantly focus on them are sort of obvious if you&amp;#39;ve done your reading but for the new people I&amp;#39;ll explain&lt;/p&gt;\n\n&lt;p&gt;As you begin to internalize that you don&amp;#39;t owe anyone an Explanation for your own desires and decisions, you begin to regret the past less. First you start to see mistakes as a learning lesson. a redpill mind would see a failure to a challenge as a failure that is necessary to build the skills to proficiently succeed in the future (future focused). They do not see it as a deficiency in themselves as a person, but a deficiency in a skillset and may even find pride in thinking, &amp;quot;I gave it my all and did the best I could do&amp;quot;. Failure is water on a ducks back. Many leaders including JFK had tremendous failure, but their handling it created opportunity instead of demise. A blue pill mentality takes mistakes with shame (nnmng), they take them personally, and sometimes even use them as examples of how they are just as &amp;quot;bad&amp;quot; as they always suspected. This causes the BP mind to focus on repairing the ego, running from the shame, suppressing the negative emotions, instead of learning the lesson as a lesson. The BP mind can&amp;#39;t let go of this shame/emotion/response. It forces them to either constantly focus on it specifically or pretend it isn&amp;#39;t there which causes an unconscience effect to mood and self fulfilling prophecy. The BP mind gets hit with the second arrow trying to take care of the first arrow which creates a spiral of mistakes and shame. The RP mind is already thinking of his next attempt at what ever it may be, how he will incorporate the new lesson to prevent the same type of failure. They never attributed the failure to their own ego, so they are able to learn the lesson instead of pridfully ignore it happens or defensively dismiss it to guard the ego. The fact they learned the lesson that defeated them last time makes them feel able to attempt this task again but this time that pesky failure will get it&amp;#39;s ass kicked with the new information our RP mind has from their lesson  learned. Should they continually fail, they will accept a capability limitation but still do not attribute it to their capability as a person and will get again focus on finding a new task or hobby (future thinking) and begin to be excited for a new challenge which will inevitable be filled with filled with failure as well.  The RP mind believes they can handle what ever may come, and that means handle the failing of a task until it&amp;#39;s no longer a challenge and is passed with ease. They focus on the future and it&amp;#39;s unlimited capability. The BP is scared shitless of failure because he makes failure so damn painful to himself that it&amp;#39;s unbearable to even risk taking on something that may have failure in it. The RP makes failure painless, and welcomes the future, while the BP can&amp;#39;t stop thinking of how bad the ego hit and shame hurt that he still hasn&amp;#39;t let go of from the last time he failed. &lt;/p&gt;\n\n&lt;p&gt;The BP mind thinks of previous relationships constantly and wishes they had them back. Thinks of the mistakes made that caused the relationship to end. Focuses on the feeling of failure that now has them in &amp;quot;unbearable&amp;quot; emotional consequences. Like Pavlov&amp;#39;s dog, they think why am I alone? Because I fucked everything up. I should have done xyz different. They dictate how their behavior should have been in hindsight to allow them to fit the container their relationship was trying to put them in. I.e. I was a square and should have been a circle to fit in the hole... either they were at the time compromising their values and their SO became unattracted as a consequence or they stuck to their values and now looking back are trying to judge their past self and  compromise that past selfs values by saying they should have behaved differently. Either way, they compsomised their values and disrespected themselves. Either way they are wrong.They are in the wrong in a way that has no win, because it is an attempt to be incongruent with the self, and self esteem takes a hit as a consequence. They attribute their failure to themselves and feel worthless. This makes them unable to gain the momentum to find a new relationship and they continue to focus on the &amp;quot;good old days&amp;quot; of the past. A RP mentality either is proud of their past self for sticking to his values and realizes that relationship was headed for failure regardless, or they realize they did make a mistake. They focus on the mistake as a lesson, not flaw. Most importantly, they remember they got to the point to make mistakes by traveling through many successes first. And if they succeeded before, they can and will succeed again. This brings hope and forward looking to the RP man. Who now, hopes to have the same string of successes in the future but he has learned from the mistake that ended the relationship last time and given he was in the wrong, he knows it is simply a skill he needed to learn and he has, and won&amp;#39;t make the mistake again.&lt;/p&gt;\n\n&lt;p&gt;Long story short, incongruent behavior to your inner beliefs cause hits to your self respect via sadness, shame, ect. Those things anchor the mind in the past. As you become more RP, your response to failure is different, your outlook on rather you consider something a fail or win changes based on how well you were authentic instead of your performance. RP realizes performance can be fixed, the true failure is to disrespect yourself by supplication, crowd pleasing, nice guy behavior, or otherwise non authentic acts. The BP mindset simply does a checksum to see if their behavior was what was called for by the situation for it to end with the least amount of consequences... to hell if he would have had to act incongruent to himself to make it a success. A RP mind quits a task that requires him to be unloyal to his values... A BP mind feels like shit that they didn&amp;#39;t compromise quickly enough to prevent someone else from judging them (causing loss of self respect for the compromise attitude, and shame from feeling judged).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying if you think of the past you are BP... I am saying the common trends and themes of BP thinking lands them thinking of the past often usually negatively. RP thinking generally focuses with eagerness and excitement on the future. Where you find yourself thinking the most may be an indicator of your internal pill, given that you find out why you are thinking of that time. If you find you are thinking of the past a lot, and feeling negatively about it... chances are there are some real deeply embedded BP beliefs that are anchoring you. When you figure out what those are, you can understand why you are so bothered by the past and focused on it... what specific limiting belief do you habe and the RP mentality can help you process and recover from the sadness or other negative emotions associated&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Shower thoughts \nBlue pill focuses on the past, Red Pill focuses on the future.\n\nThe past, focusing on regret, reliving decisions you should have made, feeling guilty/sad/ashamed of past events, running from those emotions or running from the past, believing the future is scary or feeling anxiety due to the expectation the future will be as termoultious as the past and you will be helpless to control it.\n\nThese are just examples of a plethora of ways a person is focused on the past. The BP reasons why a person would constantly focus on them are sort of obvious if you've done your reading but for the new people I'll explain\n\nAs you begin to internalize that you don't owe anyone an Explanation for your own desires and decisions, you begin to regret the past less. First you start to see mistakes as a learning lesson. a redpill mind would see a failure to a challenge as a failure that is necessary to build the skills to proficiently succeed in the future (future focused). They do not see it as a deficiency in themselves as a person, but a deficiency in a skillset and may even find pride in thinking, \"I gave it my all and did the best I could do\". Failure is water on a ducks back. Many leaders including JFK had tremendous failure, but their handling it created opportunity instead of demise. A blue pill mentality takes mistakes with shame (nnmng), they take them personally, and sometimes even use them as examples of how they are just as \"bad\" as they always suspected. This causes the BP mind to focus on repairing the ego, running from the shame, suppressing the negative emotions, instead of learning the lesson as a lesson. The BP mind can't let go of this shame/emotion/response. It forces them to either constantly focus on it specifically or pretend it isn't there which causes an unconscience effect to mood and self fulfilling prophecy. The BP mind gets hit with the second arrow trying to take care of the first arrow which creates a spiral of mistakes and shame. The RP mind is already thinking of his next attempt at what ever it may be, how he will incorporate the new lesson to prevent the same type of failure. They never attributed the failure to their own ego, so they are able to learn the lesson instead of pridfully ignore it happens or defensively dismiss it to guard the ego. The fact they learned the lesson that defeated them last time makes them feel able to attempt this task again but this time that pesky failure will get it's ass kicked with the new information our RP mind has from their lesson  learned. Should they continually fail, they will accept a capability limitation but still do not attribute it to their capability as a person and will get again focus on finding a new task or hobby (future thinking) and begin to be excited for a new challenge which will inevitable be filled with filled with failure as well.  The RP mind believes they can handle what ever may come, and that means handle the failing of a task until it's no longer a challenge and is passed with ease. They focus on the future and it's unlimited capability. The BP is scared shitless of failure because he makes failure so damn painful to himself that it's unbearable to even risk taking on something that may have failure in it. The RP makes failure painless, and welcomes the future, while the BP can't stop thinking of how bad the ego hit and shame hurt that he still hasn't let go of from the last time he failed. \n\nThe BP mind thinks of previous relationships constantly and wishes they had them back. Thinks of the mistakes made that caused the relationship to end. Focuses on the feeling of failure that now has them in \"unbearable\" emotional consequences. Like Pavlov's dog, they think why am I alone? Because I fucked everything up. I should have done xyz different. They dictate how their behavior should have been in hindsight to allow them to fit the container their relationship was trying to put them in. I.e. I was a square and should have been a circle to fit in the hole... either they were at the time compromising their values and their SO became unattracted as a consequence or they stuck to their values and now looking back are trying to judge their past self and  compromise that past selfs values by saying they should have behaved differently. Either way, they compsomised their values and disrespected themselves. Either way they are wrong.They are in the wrong in a way that has no win, because it is an attempt to be incongruent with the self, and self esteem takes a hit as a consequence. They attribute their failure to themselves and feel worthless. This makes them unable to gain the momentum to find a new relationship and they continue to focus on the \"good old days\" of the past. A RP mentality either is proud of their past self for sticking to his values and realizes that relationship was headed for failure regardless, or they realize they did make a mistake. They focus on the mistake as a lesson, not flaw. Most importantly, they remember they got to the point to make mistakes by traveling through many successes first. And if they succeeded before, they can and will succeed again. This brings hope and forward looking to the RP man. Who now, hopes to have the same string of successes in the future but he has learned from the mistake that ended the relationship last time and given he was in the wrong, he knows it is simply a skill he needed to learn and he has, and won't make the mistake again.\n\n\nLong story short, incongruent behavior to your inner beliefs cause hits to your self respect via sadness, shame, ect. Those things anchor the mind in the past. As you become more RP, your response to failure is different, your outlook on rather you consider something a fail or win changes based on how well you were authentic instead of your performance. RP realizes performance can be fixed, the true failure is to disrespect yourself by supplication, crowd pleasing, nice guy behavior, or otherwise non authentic acts. The BP mindset simply does a checksum to see if their behavior was what was called for by the situation for it to end with the least amount of consequences... to hell if he would have had to act incongruent to himself to make it a success. A RP mind quits a task that requires him to be unloyal to his values... A BP mind feels like shit that they didn't compromise quickly enough to prevent someone else from judging them (causing loss of self respect for the compromise attitude, and shame from feeling judged).\n\nI'm not saying if you think of the past you are BP... I am saying the common trends and themes of BP thinking lands them thinking of the past often usually negatively. RP thinking generally focuses with eagerness and excitement on the future. Where you find yourself thinking the most may be an indicator of your internal pill, given that you find out why you are thinking of that time. If you find you are thinking of the past a lot, and feeling negatively about it... chances are there are some real deeply embedded BP beliefs that are anchoring you. When you figure out what those are, you can understand why you are so bothered by the past and focused on it... what specific limiting belief do you habe and the RP mentality can help you process and recover from the sadness or other negative emotions associated", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Red Pill Theory", "id": "65fozu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 126, "report_reasons": null, "author": "kendallb183", "saved": false, "mod_reports": [], "name": "t3_65fozu", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": false, "link_flair_css_class": "theory", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheRedPill/comments/65fozu/one_indicator_of_your_internal_pill_color_red/", "num_reports": null, "locked": false, "stickied": false, "created": 1492237894.0, "url": "https://www.reddit.com/r/TheRedPill/comments/65fozu/one_indicator_of_your_internal_pill_color_red/", "author_flair_text": null, "quarantine": false, "title": "One indicator of your internal pill color, red, blue, or purple", "created_utc": 1492209094.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 31, "visited": false, "subreddit_type": "public", "ups": 126}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": "", "user_reports": [], "id": "dgb8igu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Edmondfromchateaudif", "parent_id": "t1_dgb7iey", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Yea, very useful. You can watch a short video on it here: \n\nhttps://www.ted.com/talks/carol_dweck_the_power_of_believing_that_you_can_improve\n\nWho is a good example of the growth mindset? Richard Feynman, watch this: https://www.youtube.com/watch?v=lytxafTXg6c", "edited": 1492294594.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea, very useful. You can watch a short video on it here: &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.ted.com/talks/carol_dweck_the_power_of_believing_that_you_can_improve\"&gt;https://www.ted.com/talks/carol_dweck_the_power_of_believing_that_you_can_improve&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Who is a good example of the growth mindset? Richard Feynman, watch this: &lt;a href=\"https://www.youtube.com/watch?v=lytxafTXg6c\"&gt;https://www.youtube.com/watch?v=lytxafTXg6c&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgb8igu", "score_hidden": false, "stickied": false, "created": 1492322181.0, "created_utc": 1492293381.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb7iey", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "c9victor", "parent_id": "t1_dg9xoio", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Goddamit yet another interesting sounding book to read lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Goddamit yet another interesting sounding book to read lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgb7iey", "score_hidden": false, "stickied": false, "created": 1492320810.0, "created_utc": 1492292010.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": "", "user_reports": [], "id": "dgbkzxc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "good_guy_submitter", "parent_id": "t1_dg9xoio", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I also recommend Gorilla mindset by Mike Cernovich.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I also recommend Gorilla mindset by Mike Cernovich.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgbkzxc", "score_hidden": false, "stickied": false, "created": 1492340168.0, "created_utc": 1492311368.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9xoio", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "Edmondfromchateaudif", "parent_id": "t3_65fozu", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This post screams \"mindset\" by Carol Dweck. I presume you have read it?\n\nFailure means \"not yet\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This post screams &amp;quot;mindset&amp;quot; by Carol Dweck. I presume you have read it?&lt;/p&gt;\n\n&lt;p&gt;Failure means &amp;quot;not yet&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dg9xoio", "score_hidden": false, "stickied": false, "created": 1492241373.0, "created_utc": 1492212573.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": "", "user_reports": [], "id": "dga3lk1", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "kendallb183", "parent_id": "t1_dga35ln", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "What I've realized is a change in the belief of how life works in general really makes a difference versus trying to understand and solve something you can't even do anything about. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What I&amp;#39;ve realized is a change in the belief of how life works in general really makes a difference versus trying to understand and solve something you can&amp;#39;t even do anything about. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga3lk1", "score_hidden": false, "stickied": false, "created": 1492249340.0, "created_utc": 1492220540.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": "", "user_reports": [], "id": "dgac4k0", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Acquin", "parent_id": "t1_dga35ln", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The guy who wrote Man's Search For Meaning had to have a positive mindset in his 3 years in Auschwitz. If you combine that with negative visualisation you're miles ahead already. There is a reason for your suffering. Embrace it, and in time you will laugh at your present suffering.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The guy who wrote Man&amp;#39;s Search For Meaning had to have a positive mindset in his 3 years in Auschwitz. If you combine that with negative visualisation you&amp;#39;re miles ahead already. There is a reason for your suffering. Embrace it, and in time you will laugh at your present suffering.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgac4k0", "score_hidden": false, "stickied": false, "created": 1492262946.0, "created_utc": 1492234146.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": "", "user_reports": [], "id": "dganrtr", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "jahozafet", "parent_id": "t1_dga35ln", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Perfect time for monk mode.  I clawed slowly out of a depression recently . . . pretty much the only thing that made me feel better was working out or lifting weights. Give yourself some natural hits of dopamine as often as possible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Perfect time for monk mode.  I clawed slowly out of a depression recently . . . pretty much the only thing that made me feel better was working out or lifting weights. Give yourself some natural hits of dopamine as often as possible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dganrtr", "score_hidden": false, "stickied": false, "created": 1492293020.0, "created_utc": 1492264220.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": "", "user_reports": [], "id": "dgc1jzg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "_Ozu_", "parent_id": "t1_dga35ln", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Regretting the past is normal if you spent most of your life in a BP mindset. However, fear of the future indicates a lack of goals, direction, motivation and momentum. If you're afraid, it's usually because you're uncertain, and if you're uncertain, it's because you lack a concrete vision and path, or because you feel inadequate to achieve what you want (in which cause, \"git gud\", as they say). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Regretting the past is normal if you spent most of your life in a BP mindset. However, fear of the future indicates a lack of goals, direction, motivation and momentum. If you&amp;#39;re afraid, it&amp;#39;s usually because you&amp;#39;re uncertain, and if you&amp;#39;re uncertain, it&amp;#39;s because you lack a concrete vision and path, or because you feel inadequate to achieve what you want (in which cause, &amp;quot;git gud&amp;quot;, as they say). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgc1jzg", "score_hidden": false, "stickied": false, "created": 1492379375.0, "created_utc": 1492350575.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dga35ln", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "for_cris", "parent_id": "t3_65fozu", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This resonates with me oh so much. It's what I'm experiencing now, a time period of deep regret of the past and a seemingly endless wallowing in a fearful mindset of the future. I'm rarely in good spirits, as my situation just seems to worsen?, rather than get better. It's hard climbing out of a depression. It's hard.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This resonates with me oh so much. It&amp;#39;s what I&amp;#39;m experiencing now, a time period of deep regret of the past and a seemingly endless wallowing in a fearful mindset of the future. I&amp;#39;m rarely in good spirits, as my situation just seems to worsen?, rather than get better. It&amp;#39;s hard climbing out of a depression. It&amp;#39;s hard.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga35ln", "score_hidden": false, "stickied": false, "created": 1492248732.0, "created_utc": 1492219932.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": "", "user_reports": [], "id": "dga61id", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "CallMeHaseo", "parent_id": "t3_65fozu", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "This was good I needed this today", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was good I needed this today&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga61id", "score_hidden": false, "stickied": false, "created": 1492252816.0, "created_utc": 1492224016.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": "", "user_reports": [], "id": "dgc4vgn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kendallb183", "parent_id": "t1_dgbaph8", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "First, I meant, can't control others. Second, there's a quick read that pays a lot of dividends, called the six pillars of self esteem by Dr Branden. It really lays out the idea of congruence in yourself and the effect on self esteem, and thus confidence.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First, I meant, can&amp;#39;t control others. Second, there&amp;#39;s a quick read that pays a lot of dividends, called the six pillars of self esteem by Dr Branden. It really lays out the idea of congruence in yourself and the effect on self esteem, and thus confidence.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgc4vgn", "score_hidden": false, "stickied": false, "created": 1492384586.0, "created_utc": 1492355786.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbaph8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TRP_MushaShugyo", "parent_id": "t1_dga829c", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Thanks so much for the great and thorough response, I really appreciate it. I do love myself as a person very much, always have, but I have learned through the experiences with this person that I did not *demonstrate* this self-respect, as you said. I am already at the point where I have recognized the truth you're saying: I did make so many mistakes with this person and I can now identity probably all of them. Yes, I have learned these invaluable lessons and I am certain I will not make them again in the future. Truthfully, I guess I'm just bummed that I made them with this particular person, because I genuinely do believe she was really special (yes, oneitis, but I've met so many people at this point... I was really impressed by her). You are right that I didn't *show* that I respect myself enough, or at all, with this person- this was probably the biggest mistake, and definitely one of the greatest and most important changes I've made in my life since TRP. \n&amp;nbsp;\n\n&gt;You would forgive her instantly for a mistake, yet not yourself... you find her more valuable than you in that clear obvious way.\n\nI'd never considered this, you're absolutely right.\n\n&gt;because at the end of the day, being congruent with those wants desires and thoughts is what is confidence. When you can do that, then you also realize you can control others.\n\nWhat do you mean by this?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks so much for the great and thorough response, I really appreciate it. I do love myself as a person very much, always have, but I have learned through the experiences with this person that I did not &lt;em&gt;demonstrate&lt;/em&gt; this self-respect, as you said. I am already at the point where I have recognized the truth you&amp;#39;re saying: I did make so many mistakes with this person and I can now identity probably all of them. Yes, I have learned these invaluable lessons and I am certain I will not make them again in the future. Truthfully, I guess I&amp;#39;m just bummed that I made them with this particular person, because I genuinely do believe she was really special (yes, oneitis, but I&amp;#39;ve met so many people at this point... I was really impressed by her). You are right that I didn&amp;#39;t &lt;em&gt;show&lt;/em&gt; that I respect myself enough, or at all, with this person- this was probably the biggest mistake, and definitely one of the greatest and most important changes I&amp;#39;ve made in my life since TRP. \n&amp;nbsp;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You would forgive her instantly for a mistake, yet not yourself... you find her more valuable than you in that clear obvious way.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;d never considered this, you&amp;#39;re absolutely right.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;because at the end of the day, being congruent with those wants desires and thoughts is what is confidence. When you can do that, then you also realize you can control others.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What do you mean by this?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgbaph8", "score_hidden": false, "stickied": false, "created": 1492325337.0, "created_utc": 1492296537.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga829c", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kendallb183", "parent_id": "t1_dga6ok7", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "It's like WISNIFG talks about not trying to argue... just agree with a truth inside of what the person is saying i.e. fogging, and then stick to what you really believe. I realize I fucked things up... but I also realize I deserved much better treatment than I even let myself be treated. \n\nLet me try to explain this. I let myself be treated like a 4 when I deserve a 8. When I was treated like a 3, I spent all this effort trying to convince people to treat me better, to treat me like a 4. \n\nFirst, I looked back and felt so sad that I was treated how I was, and why wouldn't anyone love me or care... I was disregarded and hurt and shit.\n\nNow I look back and think, why did you ever allow yourself to even be in the same room with people who would treat you like a 4? And you did worst than any of them... you may as well have drug yourself through pig shit by allowing yourself to be ok with being treated like a 4... \n\nBut... instead of feeling super shitty about it, I just think, yup, I fucked that up... guess I just won't do it again. I lost that relationship, but hey I can distinctly real several times I have a potential relationship to include that relationship I was just describing. Now I have a new trick in my book to ensure I am treated how I deserve... I will be the one to make sure I'm treated like I feel I deserve because I won't be around or involve myself with people who would otherwise.  This makes me feel safe and also optimistic for the future and relationships. I'm not apprehensive because finally I feel like someone has my back the way I've always needed... and it's me.  \n\nEdit: also, instead of trying to ignore the fact she LJBF you... realize you did something wrong or y'all weren't compatible. Figure out what you did wrong and remember there will be yet another fucking girl you get to try a new technique on... and if you truly learn RP mentality, you will learn to love who you are as a person who makes mistakes like all other people too, and forgive yourself for it like you would anyone else but expect yourself to learn and not repeat it as expected of anyone else also. Honestly, she is treating you with the same level of disrespect you treat yourself. No suprise. You would forgive her instantly for a mistake, yet not yourself... you find her more valuable than you in that clear obvious way. She doesn't even need to k ow how you view her, she can see clearly how you value yourself and that's enough. She knows a guess of her value, and it's far above the way she sees you disrespect yourself by lying to yourself, falsly representing yourself, and worst of all, beating yourself up for simply wanting the things you want.\n\nWhen you can respectfully disagree with a person, when you can agree that something may be good for someone else but not you, then you become able to see yourself as a separate being that you are responsible to take care of... and you start focusing onbeing authentic to that being... because at the end of the day, being congruent with those wants desires and thoughts is what is confidence. When you can do thay, then you also realize you can control others... and you are so busy taking care of yourself you aren't welcome to adding to the agenda with other people's shit. When this happens... you start not caring if someone liked you or not, because you like you... and your there for you.\n\nPeople hang with who they identify with. When you don't like you, you try to hang with people who also don't like you... When you really love yourself, you will stop looking for validation and start hanging with people who actually love you too.... because you will just have fun with them no thoughts needed. And life significantly improved from there. ", "edited": 1492227849.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s like WISNIFG talks about not trying to argue... just agree with a truth inside of what the person is saying i.e. fogging, and then stick to what you really believe. I realize I fucked things up... but I also realize I deserved much better treatment than I even let myself be treated. &lt;/p&gt;\n\n&lt;p&gt;Let me try to explain this. I let myself be treated like a 4 when I deserve a 8. When I was treated like a 3, I spent all this effort trying to convince people to treat me better, to treat me like a 4. &lt;/p&gt;\n\n&lt;p&gt;First, I looked back and felt so sad that I was treated how I was, and why wouldn&amp;#39;t anyone love me or care... I was disregarded and hurt and shit.&lt;/p&gt;\n\n&lt;p&gt;Now I look back and think, why did you ever allow yourself to even be in the same room with people who would treat you like a 4? And you did worst than any of them... you may as well have drug yourself through pig shit by allowing yourself to be ok with being treated like a 4... &lt;/p&gt;\n\n&lt;p&gt;But... instead of feeling super shitty about it, I just think, yup, I fucked that up... guess I just won&amp;#39;t do it again. I lost that relationship, but hey I can distinctly real several times I have a potential relationship to include that relationship I was just describing. Now I have a new trick in my book to ensure I am treated how I deserve... I will be the one to make sure I&amp;#39;m treated like I feel I deserve because I won&amp;#39;t be around or involve myself with people who would otherwise.  This makes me feel safe and also optimistic for the future and relationships. I&amp;#39;m not apprehensive because finally I feel like someone has my back the way I&amp;#39;ve always needed... and it&amp;#39;s me.  &lt;/p&gt;\n\n&lt;p&gt;Edit: also, instead of trying to ignore the fact she LJBF you... realize you did something wrong or y&amp;#39;all weren&amp;#39;t compatible. Figure out what you did wrong and remember there will be yet another fucking girl you get to try a new technique on... and if you truly learn RP mentality, you will learn to love who you are as a person who makes mistakes like all other people too, and forgive yourself for it like you would anyone else but expect yourself to learn and not repeat it as expected of anyone else also. Honestly, she is treating you with the same level of disrespect you treat yourself. No suprise. You would forgive her instantly for a mistake, yet not yourself... you find her more valuable than you in that clear obvious way. She doesn&amp;#39;t even need to k ow how you view her, she can see clearly how you value yourself and that&amp;#39;s enough. She knows a guess of her value, and it&amp;#39;s far above the way she sees you disrespect yourself by lying to yourself, falsly representing yourself, and worst of all, beating yourself up for simply wanting the things you want.&lt;/p&gt;\n\n&lt;p&gt;When you can respectfully disagree with a person, when you can agree that something may be good for someone else but not you, then you become able to see yourself as a separate being that you are responsible to take care of... and you start focusing onbeing authentic to that being... because at the end of the day, being congruent with those wants desires and thoughts is what is confidence. When you can do thay, then you also realize you can control others... and you are so busy taking care of yourself you aren&amp;#39;t welcome to adding to the agenda with other people&amp;#39;s shit. When this happens... you start not caring if someone liked you or not, because you like you... and your there for you.&lt;/p&gt;\n\n&lt;p&gt;People hang with who they identify with. When you don&amp;#39;t like you, you try to hang with people who also don&amp;#39;t like you... When you really love yourself, you will stop looking for validation and start hanging with people who actually love you too.... because you will just have fun with them no thoughts needed. And life significantly improved from there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga829c", "score_hidden": false, "stickied": false, "created": 1492255847.0, "created_utc": 1492227047.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dga6ok7", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "TRP_MushaShugyo", "parent_id": "t3_65fozu", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Man, this really hits home for me right now, thank you.\n\n&amp;nbsp;\n\nI do see getting burned by the oneitis and finding TRP as a lesson- an essential one for me to become the man I must become. I am a new person since those days, just several months ago, and I am extremely optimistic and confident about the future. I did give it my all and absolutely did the best I possibly could with what I knew at the time... which was to be a huge beta/doormat. I never thought I was \"bad,\" always thought I was doing the right thing by totally supplicating.\n\n&amp;nbsp;\n\nYet I still feel incredible shame over how I acted, now that I see the light. I guess that shame is starting to dissipate now that time has passed, now that I have clear life goals, and now that I've had success with women that my former BP self could never have imagined. But I still often find myself feeling ashamed/embarrassed by the way I acted, and do sometimes wish I could have a do-over with her (lingering oneitis still, I guess). It was constructive for a time, but is now just a detriment to progress. Over 6 months from when we last spoke, I still care about how weak she sees/saw me, and am pained at how she (I let her) disrespected me. And that no matter how much success I have in life she will always see herself as \"better/above\" me since she rejected ME with the LJBF. It's my ego pulling me down. I know the correct path is to just straight up force myself to stop thinking about her, period, and not give a fuck at all. That's something I'm working on, and would be really freeing. \n\n&amp;nbsp;\n\nStill, I know that it is *impossible* for me to make those countless mistakes again, and that's the real lesson.", "edited": 1492225212.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man, this really hits home for me right now, thank you.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;I do see getting burned by the oneitis and finding TRP as a lesson- an essential one for me to become the man I must become. I am a new person since those days, just several months ago, and I am extremely optimistic and confident about the future. I did give it my all and absolutely did the best I possibly could with what I knew at the time... which was to be a huge beta/doormat. I never thought I was &amp;quot;bad,&amp;quot; always thought I was doing the right thing by totally supplicating.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Yet I still feel incredible shame over how I acted, now that I see the light. I guess that shame is starting to dissipate now that time has passed, now that I have clear life goals, and now that I&amp;#39;ve had success with women that my former BP self could never have imagined. But I still often find myself feeling ashamed/embarrassed by the way I acted, and do sometimes wish I could have a do-over with her (lingering oneitis still, I guess). It was constructive for a time, but is now just a detriment to progress. Over 6 months from when we last spoke, I still care about how weak she sees/saw me, and am pained at how she (I let her) disrespected me. And that no matter how much success I have in life she will always see herself as &amp;quot;better/above&amp;quot; me since she rejected ME with the LJBF. It&amp;#39;s my ego pulling me down. I know the correct path is to just straight up force myself to stop thinking about her, period, and not give a fuck at all. That&amp;#39;s something I&amp;#39;m working on, and would be really freeing. &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Still, I know that it is &lt;em&gt;impossible&lt;/em&gt; for me to make those countless mistakes again, and that&amp;#39;s the real lesson.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga6ok7", "score_hidden": false, "stickied": false, "created": 1492253736.0, "created_utc": 1492224936.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": "", "user_reports": [], "id": "dgag4qe", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "srgio123", "parent_id": "t1_dga7ntn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "TIL I have been taking grade B my whole life", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;TIL I have been taking grade B my whole life&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgag4qe", "score_hidden": false, "stickied": false, "created": 1492272664.0, "created_utc": 1492243864.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dga7ntn", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "kendallb183", "parent_id": "t1_dga758l", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "How else can I take these grade A dick pics?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How else can I take these grade A dick pics?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga7ntn", "score_hidden": false, "stickied": false, "created": 1492255216.0, "created_utc": 1492226416.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dga758l", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "balderdash76", "parent_id": "t3_65fozu", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Dude, you take your phone in the shower?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude, you take your phone in the shower?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga758l", "score_hidden": false, "stickied": false, "created": 1492254418.0, "created_utc": 1492225618.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": "", "user_reports": [], "id": "dga7jrl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "chelseadent", "parent_id": "t3_65fozu", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Great post overall. Funnily enough my BJJ teacher touched on some similar themes in class today - basically saying don't let your ego get in the way when you're rolling and not to feel shame/embarassment when you're tapping out. Firstly tap when you're actually caught so you don't snap your shit up and avoid injuries allowing you to train longer, better and more consistently. Secondly, think of each time you tap out as an opportunity to learn and improve - ask your partner (especially if they're more experienced) how you can avoid getting caught next time or get out from the unfavourable position. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post overall. Funnily enough my BJJ teacher touched on some similar themes in class today - basically saying don&amp;#39;t let your ego get in the way when you&amp;#39;re rolling and not to feel shame/embarassment when you&amp;#39;re tapping out. Firstly tap when you&amp;#39;re actually caught so you don&amp;#39;t snap your shit up and avoid injuries allowing you to train longer, better and more consistently. Secondly, think of each time you tap out as an opportunity to learn and improve - ask your partner (especially if they&amp;#39;re more experienced) how you can avoid getting caught next time or get out from the unfavourable position. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dga7jrl", "score_hidden": false, "stickied": false, "created": 1492255042.0, "created_utc": 1492226242.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": "", "user_reports": [], "id": "dgady5v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "CaliBear92", "parent_id": "t3_65fozu", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Just switch BP with Insecure.\n\nI sorta wish this board wasn't full of buzzwords.\n\nBut the advice was helpful buddy, thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just switch BP with Insecure.&lt;/p&gt;\n\n&lt;p&gt;I sorta wish this board wasn&amp;#39;t full of buzzwords.&lt;/p&gt;\n\n&lt;p&gt;But the advice was helpful buddy, thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgady5v", "score_hidden": false, "stickied": false, "created": 1492266931.0, "created_utc": 1492238131.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": "", "user_reports": [], "id": "dgaqkn2", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Facebreaker5", "parent_id": "t1_dgaq7na", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "\"Cut out video games\" You've taken a step too far.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Cut out video games&amp;quot; You&amp;#39;ve taken a step too far.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaqkn2", "score_hidden": false, "stickied": false, "created": 1492297534.0, "created_utc": 1492268734.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaq7na", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sir_Distic", "parent_id": "t1_dgaed2h", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Cut out video games, or reduce them so they are minimal, same with cartoons or other distractions. Don't blame it on child abuse. Let go of the anger you have towards it. Accept that it happened, acknowledge that it wasn't your fault and you couldn't do anything about it, then let it go. You don't have to forgive them. Just acknowledge it happened and wasn't your fault. \n\n Now build confidence, real self confidence. Work out, eat healthy, love yourself. I don't mean \"I'm the fucking best!\" I mean truly love  yourself. A girl rejects you? That's ok. Just one no. A guy wants to fight you? Nah I'm better than that and walk away. Someone at work gives you shit? Laugh it off and keep doing good work. \n\nAcknowledge your past but let it stay there. Become better now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cut out video games, or reduce them so they are minimal, same with cartoons or other distractions. Don&amp;#39;t blame it on child abuse. Let go of the anger you have towards it. Accept that it happened, acknowledge that it wasn&amp;#39;t your fault and you couldn&amp;#39;t do anything about it, then let it go. You don&amp;#39;t have to forgive them. Just acknowledge it happened and wasn&amp;#39;t your fault. &lt;/p&gt;\n\n&lt;p&gt;Now build confidence, real self confidence. Work out, eat healthy, love yourself. I don&amp;#39;t mean &amp;quot;I&amp;#39;m the fucking best!&amp;quot; I mean truly love  yourself. A girl rejects you? That&amp;#39;s ok. Just one no. A guy wants to fight you? Nah I&amp;#39;m better than that and walk away. Someone at work gives you shit? Laugh it off and keep doing good work. &lt;/p&gt;\n\n&lt;p&gt;Acknowledge your past but let it stay there. Become better now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaq7na", "score_hidden": false, "stickied": false, "created": 1492296995.0, "created_utc": 1492268195.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaed2h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "_MysticFox", "parent_id": "t3_65fozu", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I have a lot of fucking shame/no self-respect and I behave/think almost exactly like this. I attribute it to child abuse, learning social skills from cartoons, and hiding in video games. Any ways to improve in this regard?\n\nEdit: Cartoons and video games are already gone obviously, I'm saying they've left their mark already", "edited": 1492285792.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a lot of fucking shame/no self-respect and I behave/think almost exactly like this. I attribute it to child abuse, learning social skills from cartoons, and hiding in video games. Any ways to improve in this regard?&lt;/p&gt;\n\n&lt;p&gt;Edit: Cartoons and video games are already gone obviously, I&amp;#39;m saying they&amp;#39;ve left their mark already&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaed2h", "score_hidden": false, "stickied": false, "created": 1492267942.0, "created_utc": 1492239142.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": "", "user_reports": [], "id": "dgdmi0o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CHIPPENDALESIXNINE", "parent_id": "t3_65fozu", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I'd also like to add that after thinking of and picturing the future, 90% of the rest of your thinking should be on the present.  If all you do is think of the future, time will fly by, you won't realize that the \"now\" is what creates that future and the \"now\" is what will enjoy it.  If you fail to realize that, you'll find the future in the past, the past will then be what you're thinking about, and it will be full of regret of how you didn't act enough when you had the chance, to make the future you pictured become a reality to enjoy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d also like to add that after thinking of and picturing the future, 90% of the rest of your thinking should be on the present.  If all you do is think of the future, time will fly by, you won&amp;#39;t realize that the &amp;quot;now&amp;quot; is what creates that future and the &amp;quot;now&amp;quot; is what will enjoy it.  If you fail to realize that, you&amp;#39;ll find the future in the past, the past will then be what you&amp;#39;re thinking about, and it will be full of regret of how you didn&amp;#39;t act enough when you had the chance, to make the future you pictured become a reality to enjoy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgdmi0o", "score_hidden": false, "stickied": false, "created": 1492471818.0, "created_utc": 1492443018.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": "", "user_reports": [], "id": "dgb84wd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LordOfThePiss", "parent_id": "t3_65fozu", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Great post, needed to hear these words. Been thinking and worrying about the past a LOT recently, to the point where it becomes unpleasant but I can't help it. I've always been one to ponder about things way too much. Gonna start taking steps to tackle this issue. Thx for the post! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post, needed to hear these words. Been thinking and worrying about the past a LOT recently, to the point where it becomes unpleasant but I can&amp;#39;t help it. I&amp;#39;ve always been one to ponder about things way too much. Gonna start taking steps to tackle this issue. Thx for the post! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgb84wd", "score_hidden": false, "stickied": false, "created": 1492321664.0, "created_utc": 1492292864.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65fozu", "likes": null, "replies": "", "user_reports": [], "id": "dgc1hb7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_Ozu_", "parent_id": "t3_65fozu", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I focus on past/future in a (roughly) 40/60 ratio, so I think I'm purple leaning towards red. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I focus on past/future in a (roughly) 40/60 ratio, so I think I&amp;#39;m purple leaning towards red. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgc1hb7", "score_hidden": false, "stickied": false, "created": 1492379239.0, "created_utc": 1492350439.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]