[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am sure I may take some flak for posting here, but it seems like the only place that this thought might generate some discussion, if you are reading this from looking at my comments, take a moment to read it before dismissing it as sexist drivel.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Abstract&lt;/strong&gt; While having a minor argument with my s.o. this morning on a long car trip, I noticed something and as I thought bout it, and realized that, while the term &amp;quot;micro-aggression&amp;quot; is now almost a meme and a loaded word that evokes strong opinions (whether of scorn for sjw types or as a rallying cry of them) it is a real thing, but it is vastly misunderstood and to dismiss it is shortsighted when considering social dynamics at the biological level.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Background Info&lt;/strong&gt; My long term gf and I are both stubborn people, she has a lot of feistyness in her that I admire often.  She is confident and I can trust her, I have seen her mercilessly tear down guys a few times at bars and such that tried to hit on her behind my back or when they thought I was distracted.  I enjoy this, not all the time because when it comes to an argument, even if wrong she is not quick to back down and it keeps me on my toes and adds a zest to life.  Shit testing, but she already knows I will pass and accepts it.&lt;/p&gt;\n\n&lt;p&gt;Well that was a longer than I meant but I wanted to give a bit of an idea of the personality type.  The event that started the fight was a bit of road rage that led her to make a dangerous maneuver and then drive aggressively at the car that tried to cut her off.  It was close enough to a wreck that I used, I dont know, &amp;quot;command voice&amp;quot; a simple, loud and stern &amp;quot;Do not ever pull that again!&amp;quot;. Well it started a confrontational argument that only ended when I pushed a bit too hard on her and noticed that she almost started crying.  Instantly and unconsciously, I dropped the confrontational tone for a comforting one and explained that I was yelling at her because she endangered us both and because I care enough about her to get that angry about her endangering herself when driving alone.  Fight over, but she asked me an hour later why I had to reduce her to near tears before relenting (it absolutely had a tone of the idea that what happened may have bordered on abusive).  I told her that as soon as I thought I was actually hurting her enough to cry anger instantly turns into a protection instinct.  &lt;/p&gt;\n\n&lt;p&gt;I thought about this for the rest of the drive.  I know there are plenty of people that consider all of TRP as condoning abuse, but I do not consider myself abusive at all, and I think this is a situation where the idea of abuse is misplaced.  There are situations where a loved one be it a spouse or a child does something that scares you enough that you absolutely &lt;em&gt;have&lt;/em&gt; to assert authority in a way so that you can get the message across.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;I Get to the Point&lt;/strong&gt; What does this have to do with micro-aggresssions?  Well I thought about why the situation escalated into a fight and what I wish had happened instead.  I realized that what I wanted to happen was a submissive or more feminine acceptance that she should not do that, and i would have explained that i only yelled because i was genuinely worried.&lt;/p&gt;\n\n&lt;p&gt;The reason that instead it turned confrontational, is because of the anger and bit of adrenaline she already had from the road rage (and fiery temperment ((Irish not Latina but damn she can rival one))) instead of responding to me in a feminine manner she responded in a masculine confrontational manner.  Somewhere subconsciously i reacted to that as i would react to a man challenging me.  Only when as the argument escalated and she went back to a feminine frame, did my own subconscious shift from &amp;quot;i have to win this&amp;quot; agression to &amp;quot;my girl is nearly crying&amp;quot; protectiveness.&lt;/p&gt;\n\n&lt;p&gt;I realized that this can be taken farther.  When men challenge other men, one eventually wins the confrontation and a bit of social structure is created.  But often this does not happen in an actual argument or fight.  Often it is through the teasing and ribbing and mild shit talking that guys use to bond or make friends.  &lt;em&gt;These are micro-aggressions&lt;/em&gt;!  But a micro aggression in this context &lt;em&gt;is not a bad thing, it is the &amp;#39;thread&amp;#39; with which the &amp;#39;social fabric&amp;#39; is woven.  Through micro-aggressions, and certainly overt aggressions at times, a social hierarchy and order is developed.  And among men, micro-aggressions are so constant and ingrained, that is why we find the sjw descriptions of them either ridiculous or insane or whatever (and they are often taken to absurdity; I am *&lt;/em&gt;not** defending their crusade about it.). It would be like a tribe with no concept of &lt;em&gt;currency&lt;/em&gt; telling us that our ideas of it are crazy and bad, and we would be unable to see how they could not realize the necessity of a currency system in order for our society to work.&lt;/p&gt;\n\n&lt;p&gt;We live in micro-aggressions and build much of our social order from understanding on a subconscious level the purpose and use of them, to say that micro-aggressions are a bad thing that should be abandoned is like telling modern society that currency is a bad thing and should be abandoned.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;How this Relates to Feminism and Equality&lt;/strong&gt; The most commonly heard complaint about micro-aggressions (m.a.s from here on) is that women who have gotten into traditionaly male dominated feilds are targeted with them as some form of sexist weapon to keep women down.&lt;/p&gt;\n\n&lt;p&gt;This is where they are wrong, they only half understand them, and only notice when they are directed towards themselves.  They do not really see that they are constantly being used among the men there in a muh more &amp;quot;fluent&amp;quot; manner.&lt;/p&gt;\n\n&lt;p&gt;This is where I get into the idea of equality being mistaken for mysogyny.  (Ignoring the pedantic way that college kids have started using them) When the female gets to a higher level in an organization, or a man, they are now in an environment of competition and among others, like themselves, that have the necessary skills and drive to get there.  This is not really a placid place, though if one does not understand m.a.s it may seem that way on the surface.  &lt;/p&gt;\n\n&lt;p&gt;So to be there, and be competitive, the female usually exhibits some level of what we consider masculine aggression and competitiveness.  When a person of either gender acts in this way, subconsciously our minds react as they would to a (for 99% of our existence) a male competitor.  When this happens we make m.a.s towards that person as we would any other male competitor or even potential ally.&lt;/p&gt;\n\n&lt;p&gt;The problem is, that often these aggressions may escalate to the point that the woman reverts to what our subconscious read as feminine behavior and at this point the situation changes.  Of course the woman can also subconsciously detect this shift.  The problem here is that since she is not &amp;quot;fluent&amp;quot; in the male &amp;quot;language&amp;quot; of micro-aggressions, she thinks that she was targeted and then dismissed, that the men where being sexist to her. * She does not realize that in fact, before shifting her frame, she was being treated as an equal, just as a man in her place would be treated.  She was not being targeted, she was being tested.*&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Back to Personal Anectdotes&lt;/strong&gt; I work in a supervisor position for a construction related company.  A sector with mostly &amp;quot;manly men&amp;quot;.  I have had to fire a good number of people and it is never fun, even the worst fuck up, I don&amp;#39;t really like having to take someone&amp;#39;s job and income from them even when they force me, but it is my responsibility to do so for the well being of the company and at times the safety of my crew.&lt;/p&gt;\n\n&lt;p&gt;Firing guys can be a crapshoot.  Most of them take it on stride, maybe say &amp;quot;fuck you&amp;quot; maybe say &amp;quot;I understand&amp;quot;.  Rarely though it becomes a confrontation.  I am a pretty big guy, but there were two times in particular where I still grabbed two other workers to help me convince them to leave without trouble.  But one guy stands out.  He was an A class fuckup, methhead, and absolutely a danger to himself and my crew, also a pretty tough looking guy.  When I went to fire him, due to the circumstances, I was seeing red and fucking pissed, I &lt;em&gt;wanted&lt;/em&gt; this guy to fight me.  Instead he broke down in tears and begged me not to fire him.  I stammered, and was totally thrown off guard with how to handle the situation because it was so much cognitive dissonance.  A fight, or a &amp;quot;fuck you&amp;quot; or whatever I was comfortable with and prepared for, this I was not.  I ended up calling another guy over and asked him to take the dudes tools to his truck and to radio me if he wasn&amp;#39;t off the sight in 5 minutes or I would simple call the police on him.&lt;/p&gt;\n\n&lt;p&gt;The point here, and I will admit I am bad at empathy even for my gf...  I was just raised by a father who was not in anyway uncaring, but in my family the men dealt with sadness and tears with a pat on the back and a &amp;quot;hang in there, you&amp;#39;ll make it&amp;quot;... Is that in the context of masculinity, this guy reacted in a feminine manner and totally threw me off guard.  Subconsciously my anger instantly dissipated and in this case was replaced with awkwardness and disgust.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Point of All This&lt;/strong&gt; Our subconscious mind has more control over our interactions than we realize and can guide how we perceive and react to people, male or female.&lt;/p&gt;\n\n&lt;p&gt;Micro-aggressions are real and they are a quintessential aspect of male interaction and social cohesion.&lt;/p&gt;\n\n&lt;p&gt;Despite consciously knowing the person we are interacting with is male or female, our subconsious mind directs our behavior towards them by the way it interprets them acting, male or female.&lt;/p&gt;\n\n&lt;p&gt;Cognitive dissonance and the idea that micro-aggressions are bad or sexist happens when an interaction starts in one subconscious frame but then changes during the interaction.  This is how women who do not fully understand male-to-male micro-aggressions (and they absolutely have their own version but it is not the point of this essay) can mistake being treated as an equal as being discriminated against.  &lt;/p&gt;\n\n&lt;p&gt;Thank you for reading, and I am interested to hear any thoughts.  Also I am sure there are typos or random spaces because I am typing on my phone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am sure I may take some flak for posting here, but it seems like the only place that this thought might generate some discussion, if you are reading this from looking at my comments, take a moment to read it before dismissing it as sexist drivel.\n\n**Abstract** While having a minor argument with my s.o. this morning on a long car trip, I noticed something and as I thought bout it, and realized that, while the term \"micro-aggression\" is now almost a meme and a loaded word that evokes strong opinions (whether of scorn for sjw types or as a rallying cry of them) it is a real thing, but it is vastly misunderstood and to dismiss it is shortsighted when considering social dynamics at the biological level.\n\n**Background Info** My long term gf and I are both stubborn people, she has a lot of feistyness in her that I admire often.  She is confident and I can trust her, I have seen her mercilessly tear down guys a few times at bars and such that tried to hit on her behind my back or when they thought I was distracted.  I enjoy this, not all the time because when it comes to an argument, even if wrong she is not quick to back down and it keeps me on my toes and adds a zest to life.  Shit testing, but she already knows I will pass and accepts it.\n\nWell that was a longer than I meant but I wanted to give a bit of an idea of the personality type.  The event that started the fight was a bit of road rage that led her to make a dangerous maneuver and then drive aggressively at the car that tried to cut her off.  It was close enough to a wreck that I used, I dont know, \"command voice\" a simple, loud and stern \"Do not ever pull that again!\". Well it started a confrontational argument that only ended when I pushed a bit too hard on her and noticed that she almost started crying.  Instantly and unconsciously, I dropped the confrontational tone for a comforting one and explained that I was yelling at her because she endangered us both and because I care enough about her to get that angry about her endangering herself when driving alone.  Fight over, but she asked me an hour later why I had to reduce her to near tears before relenting (it absolutely had a tone of the idea that what happened may have bordered on abusive).  I told her that as soon as I thought I was actually hurting her enough to cry anger instantly turns into a protection instinct.  \n\nI thought about this for the rest of the drive.  I know there are plenty of people that consider all of TRP as condoning abuse, but I do not consider myself abusive at all, and I think this is a situation where the idea of abuse is misplaced.  There are situations where a loved one be it a spouse or a child does something that scares you enough that you absolutely *have* to assert authority in a way so that you can get the message across.\n\n**I Get to the Point** What does this have to do with micro-aggresssions?  Well I thought about why the situation escalated into a fight and what I wish had happened instead.  I realized that what I wanted to happen was a submissive or more feminine acceptance that she should not do that, and i would have explained that i only yelled because i was genuinely worried.\n\nThe reason that instead it turned confrontational, is because of the anger and bit of adrenaline she already had from the road rage (and fiery temperment ((Irish not Latina but damn she can rival one))) instead of responding to me in a feminine manner she responded in a masculine confrontational manner.  Somewhere subconsciously i reacted to that as i would react to a man challenging me.  Only when as the argument escalated and she went back to a feminine frame, did my own subconscious shift from \"i have to win this\" agression to \"my girl is nearly crying\" protectiveness.\n\nI realized that this can be taken farther.  When men challenge other men, one eventually wins the confrontation and a bit of social structure is created.  But often this does not happen in an actual argument or fight.  Often it is through the teasing and ribbing and mild shit talking that guys use to bond or make friends.  *These are micro-aggressions*!  But a micro aggression in this context *is not a bad thing, it is the 'thread' with which the 'social fabric' is woven.  Through micro-aggressions, and certainly overt aggressions at times, a social hierarchy and order is developed.  And among men, micro-aggressions are so constant and ingrained, that is why we find the sjw descriptions of them either ridiculous or insane or whatever (and they are often taken to absurdity; I am **not** defending their crusade about it.). It would be like a tribe with no concept of *currency* telling us that our ideas of it are crazy and bad, and we would be unable to see how they could not realize the necessity of a currency system in order for our society to work.\n\nWe live in micro-aggressions and build much of our social order from understanding on a subconscious level the purpose and use of them, to say that micro-aggressions are a bad thing that should be abandoned is like telling modern society that currency is a bad thing and should be abandoned.\n\n**How this Relates to Feminism and Equality** The most commonly heard complaint about micro-aggressions (m.a.s from here on) is that women who have gotten into traditionaly male dominated feilds are targeted with them as some form of sexist weapon to keep women down.\n\nThis is where they are wrong, they only half understand them, and only notice when they are directed towards themselves.  They do not really see that they are constantly being used among the men there in a muh more \"fluent\" manner.\n\nThis is where I get into the idea of equality being mistaken for mysogyny.  (Ignoring the pedantic way that college kids have started using them) When the female gets to a higher level in an organization, or a man, they are now in an environment of competition and among others, like themselves, that have the necessary skills and drive to get there.  This is not really a placid place, though if one does not understand m.a.s it may seem that way on the surface.  \n\nSo to be there, and be competitive, the female usually exhibits some level of what we consider masculine aggression and competitiveness.  When a person of either gender acts in this way, subconsciously our minds react as they would to a (for 99% of our existence) a male competitor.  When this happens we make m.a.s towards that person as we would any other male competitor or even potential ally.\n\nThe problem is, that often these aggressions may escalate to the point that the woman reverts to what our subconscious read as feminine behavior and at this point the situation changes.  Of course the woman can also subconsciously detect this shift.  The problem here is that since she is not \"fluent\" in the male \"language\" of micro-aggressions, she thinks that she was targeted and then dismissed, that the men where being sexist to her. * She does not realize that in fact, before shifting her frame, she was being treated as an equal, just as a man in her place would be treated.  She was not being targeted, she was being tested.*\n\n**Back to Personal Anectdotes** I work in a supervisor position for a construction related company.  A sector with mostly \"manly men\".  I have had to fire a good number of people and it is never fun, even the worst fuck up, I don't really like having to take someone's job and income from them even when they force me, but it is my responsibility to do so for the well being of the company and at times the safety of my crew.\n\nFiring guys can be a crapshoot.  Most of them take it on stride, maybe say \"fuck you\" maybe say \"I understand\".  Rarely though it becomes a confrontation.  I am a pretty big guy, but there were two times in particular where I still grabbed two other workers to help me convince them to leave without trouble.  But one guy stands out.  He was an A class fuckup, methhead, and absolutely a danger to himself and my crew, also a pretty tough looking guy.  When I went to fire him, due to the circumstances, I was seeing red and fucking pissed, I *wanted* this guy to fight me.  Instead he broke down in tears and begged me not to fire him.  I stammered, and was totally thrown off guard with how to handle the situation because it was so much cognitive dissonance.  A fight, or a \"fuck you\" or whatever I was comfortable with and prepared for, this I was not.  I ended up calling another guy over and asked him to take the dudes tools to his truck and to radio me if he wasn't off the sight in 5 minutes or I would simple call the police on him.\n\nThe point here, and I will admit I am bad at empathy even for my gf...  I was just raised by a father who was not in anyway uncaring, but in my family the men dealt with sadness and tears with a pat on the back and a \"hang in there, you'll make it\"... Is that in the context of masculinity, this guy reacted in a feminine manner and totally threw me off guard.  Subconsciously my anger instantly dissipated and in this case was replaced with awkwardness and disgust.\n\n**The Point of All This** Our subconscious mind has more control over our interactions than we realize and can guide how we perceive and react to people, male or female.\n\nMicro-aggressions are real and they are a quintessential aspect of male interaction and social cohesion.\n\nDespite consciously knowing the person we are interacting with is male or female, our subconsious mind directs our behavior towards them by the way it interprets them acting, male or female.\n\nCognitive dissonance and the idea that micro-aggressions are bad or sexist happens when an interaction starts in one subconscious frame but then changes during the interaction.  This is how women who do not fully understand male-to-male micro-aggressions (and they absolutely have their own version but it is not the point of this essay) can mistake being treated as an equal as being discriminated against.  \n\nThank you for reading, and I am interested to hear any thoughts.  Also I am sure there are typos or random spaces because I am typing on my phone.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Red Pill Theory", "id": "65hepn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "Occams-shaving-cream", "saved": false, "mod_reports": [], "name": "t3_65hepn", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": false, "link_flair_css_class": "theory", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheRedPill/comments/65hepn/rethinking_the_idea_of_microaggressions_and_why/", "num_reports": null, "locked": false, "stickied": false, "created": 1492260540.0, "url": "https://www.reddit.com/r/TheRedPill/comments/65hepn/rethinking_the_idea_of_microaggressions_and_why/", "author_flair_text": null, "quarantine": false, "title": "Rethinking the idea of micro-aggressions and why some feminists mistake equality for oppression.", "created_utc": 1492231740.0, "distinguished": null, "media": null, "upvote_ratio": 0.6, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65hepn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65hepn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65hepn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65hepn", "likes": null, "replies": "", "user_reports": [], "id": "dgahdbi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Occams-shaving-cream", "parent_id": "t1_dgae51p", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "That is entirely true.  That is why I tried to avoid going into the full idiocy of SJW types' interpretation of these things.\n\nI think many folks, myself included until today just laugh off the ideas of micro-agressions and so forth as bullshit.  But today it just clicked that they are a thing and a necessary thing that needs no reform.  If I go to a foreign country and expect everyone to cater my culture instead of learning how to work in theors, then *I* am the fool.\n\nLikewise with women going into male spheres and declaring things sexist because they refuse to adapt or understand how shit works.\n\nBut language is still the most powerful tool that exists to change thought.  I think it would be wise to take what TRP calls shit tests and such and fuse it with what the SJWs call microaggressions.  They are the same thing, and instead of letting them control the language and pervert reality, we should define it as such and see that it is an essential part of interaction.  To let one side define and dominate the words and ideas while just raging about the change gives away all power and initiative.  To tell them what they are complaining about is real, but that the problem is with them not understanding how things work is to regain the initiative.", "edited": 1492247906.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is entirely true.  That is why I tried to avoid going into the full idiocy of SJW types&amp;#39; interpretation of these things.&lt;/p&gt;\n\n&lt;p&gt;I think many folks, myself included until today just laugh off the ideas of micro-agressions and so forth as bullshit.  But today it just clicked that they are a thing and a necessary thing that needs no reform.  If I go to a foreign country and expect everyone to cater my culture instead of learning how to work in theors, then &lt;em&gt;I&lt;/em&gt; am the fool.&lt;/p&gt;\n\n&lt;p&gt;Likewise with women going into male spheres and declaring things sexist because they refuse to adapt or understand how shit works.&lt;/p&gt;\n\n&lt;p&gt;But language is still the most powerful tool that exists to change thought.  I think it would be wise to take what TRP calls shit tests and such and fuse it with what the SJWs call microaggressions.  They are the same thing, and instead of letting them control the language and pervert reality, we should define it as such and see that it is an essential part of interaction.  To let one side define and dominate the words and ideas while just raging about the change gives away all power and initiative.  To tell them what they are complaining about is real, but that the problem is with them not understanding how things work is to regain the initiative.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgahdbi", "score_hidden": false, "stickied": false, "created": 1492276500.0, "created_utc": 1492247700.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgae51p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "smegbot", "parent_id": "t1_dgadpjj", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Well there is that, and the basic premise of turning a molehill into a mountain....something that has run rampant if you ask me. Hyperbole is the new norm, outrage is expected.\n\nIn my experience, most people will offer any excuse they can before just admitting they are being a selfish asswipe, whether it was subconscious or not reading the proper social cues is irrelevant, these people wont/don't want to see anything beyond themselves.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well there is that, and the basic premise of turning a molehill into a mountain....something that has run rampant if you ask me. Hyperbole is the new norm, outrage is expected.&lt;/p&gt;\n\n&lt;p&gt;In my experience, most people will offer any excuse they can before just admitting they are being a selfish asswipe, whether it was subconscious or not reading the proper social cues is irrelevant, these people wont/don&amp;#39;t want to see anything beyond themselves.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgae51p", "score_hidden": false, "stickied": false, "created": 1492267397.0, "created_utc": 1492238597.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgadpjj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Occams-shaving-cream", "parent_id": "t1_dgacp49", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "She simply sounds like an ass.\n\nI am talking more subconscious, not just trying to act like a cliche bro.\n\nIt is in the type of response, more than anything I think.  True sexism, would be treating women like 1800s, you know not cussing etc because they are fragile or whatever.  What people call sexism now is more like accepting women into a male paradigm and making the 'mistake' of expecting them to react like a man.  \n\nTbh, it spans the entire SJW lexicon, \"mansoalining\" for example...  If a person does not give you the expected response of understanding a thing, the natural reaction is to continue explaining until there is the expected response of understanding.  It isn't sexist, if a man gave the same facial and body language reactions of a woman who is the \"victim\" of \"mansplaining\" the reaction of the person talking would be the exact same.\n\nSo much of it is failure to pick up on propper social cues and turning normal things into \"oppression.\"\n\nI think an interesting example is Hillary Clinton during the debates.  If you watch closely, she seems unlikeable because all of her facial and speech cues condradict her subconscious body language.  She has been in \"male world\" for long enough and has enough power that her natural reactions are more masculine and competitive but for the election she had to try and \"play\" a woman.  I think Trump realized and exploited this.  So when he needled her, her subconscious body language was instantly masculine aggression but she had to hide it, and thus seemed fake and like she was hiding something when trying to seem more feminine.  I think a not-insignificant portion of Trumps victory could be attributed to this very thing!  She supposedly \"won\" every debate, but to anyone who understands power and dominance in social interactions, she was off guard and totally submissive each time, she lost plain as day, and even if one were to just listen to it without watching there were enough cues in the voices to tell this as well.", "edited": 1492238106.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She simply sounds like an ass.&lt;/p&gt;\n\n&lt;p&gt;I am talking more subconscious, not just trying to act like a cliche bro.&lt;/p&gt;\n\n&lt;p&gt;It is in the type of response, more than anything I think.  True sexism, would be treating women like 1800s, you know not cussing etc because they are fragile or whatever.  What people call sexism now is more like accepting women into a male paradigm and making the &amp;#39;mistake&amp;#39; of expecting them to react like a man.  &lt;/p&gt;\n\n&lt;p&gt;Tbh, it spans the entire SJW lexicon, &amp;quot;mansoalining&amp;quot; for example...  If a person does not give you the expected response of understanding a thing, the natural reaction is to continue explaining until there is the expected response of understanding.  It isn&amp;#39;t sexist, if a man gave the same facial and body language reactions of a woman who is the &amp;quot;victim&amp;quot; of &amp;quot;mansplaining&amp;quot; the reaction of the person talking would be the exact same.&lt;/p&gt;\n\n&lt;p&gt;So much of it is failure to pick up on propper social cues and turning normal things into &amp;quot;oppression.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I think an interesting example is Hillary Clinton during the debates.  If you watch closely, she seems unlikeable because all of her facial and speech cues condradict her subconscious body language.  She has been in &amp;quot;male world&amp;quot; for long enough and has enough power that her natural reactions are more masculine and competitive but for the election she had to try and &amp;quot;play&amp;quot; a woman.  I think Trump realized and exploited this.  So when he needled her, her subconscious body language was instantly masculine aggression but she had to hide it, and thus seemed fake and like she was hiding something when trying to seem more feminine.  I think a not-insignificant portion of Trumps victory could be attributed to this very thing!  She supposedly &amp;quot;won&amp;quot; every debate, but to anyone who understands power and dominance in social interactions, she was off guard and totally submissive each time, she lost plain as day, and even if one were to just listen to it without watching there were enough cues in the voices to tell this as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgadpjj", "score_hidden": false, "stickied": false, "created": 1492266384.0, "created_utc": 1492237584.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgacp49", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "smegbot", "parent_id": "t3_65hepn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "My take is women can dish it out but can't take the heat.\n\nCase in point a women manager I had would say \"micro-aggressive\" male remarks almost to ape the men she worked with (only none of us talked that way). \n\nShe would say things like \"grow a pair\" and \"man up\", and call guys \"dudes\"....yet if you called women \"chicks\" or told her something equally as offensive like \"going tits up\" or \"x person is on the rag\" should would get all offended.\n\nI think the problem lies more in these \"micro-aggressions\" being a one sided street as far as what is tolerated.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My take is women can dish it out but can&amp;#39;t take the heat.&lt;/p&gt;\n\n&lt;p&gt;Case in point a women manager I had would say &amp;quot;micro-aggressive&amp;quot; male remarks almost to ape the men she worked with (only none of us talked that way). &lt;/p&gt;\n\n&lt;p&gt;She would say things like &amp;quot;grow a pair&amp;quot; and &amp;quot;man up&amp;quot;, and call guys &amp;quot;dudes&amp;quot;....yet if you called women &amp;quot;chicks&amp;quot; or told her something equally as offensive like &amp;quot;going tits up&amp;quot; or &amp;quot;x person is on the rag&amp;quot; should would get all offended.&lt;/p&gt;\n\n&lt;p&gt;I think the problem lies more in these &amp;quot;micro-aggressions&amp;quot; being a one sided street as far as what is tolerated.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgacp49", "score_hidden": false, "stickied": false, "created": 1492264146.0, "created_utc": 1492235346.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65hepn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65hepn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65hepn", "likes": null, "replies": "", "user_reports": [], "id": "dgb30gr", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Ketogainsmongoose", "parent_id": "t1_dgb26bx", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Trust is in degree. You wouldn't trust money to your friend with a gambling problem, even if you can trust him with your car because he's a good mechanic. \n\nYou can't trust a women to keep a man happy, that's not what they were built to do. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trust is in degree. You wouldn&amp;#39;t trust money to your friend with a gambling problem, even if you can trust him with your car because he&amp;#39;s a good mechanic. &lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t trust a women to keep a man happy, that&amp;#39;s not what they were built to do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgb30gr", "score_hidden": false, "stickied": false, "created": 1492314613.0, "created_utc": 1492285813.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb26bx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Occams-shaving-cream", "parent_id": "t1_dgarce5", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Trust is relative, once it is earned, it exists unless it is broken.  If you cant manage to gain the company of trustworthy people, that is on you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trust is relative, once it is earned, it exists unless it is broken.  If you cant manage to gain the company of trustworthy people, that is on you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgb26bx", "score_hidden": false, "stickied": false, "created": 1492313492.0, "created_utc": 1492284692.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgarce5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Ketogainsmongoose", "parent_id": "t3_65hepn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Got down to the \"I can trust her\" part. \n\nThat's your hamster talking. You can trust her with your dick in her mouth and little else. \n\nSeriously, this is just a waste.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Got down to the &amp;quot;I can trust her&amp;quot; part. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s your hamster talking. You can trust her with your dick in her mouth and little else. &lt;/p&gt;\n\n&lt;p&gt;Seriously, this is just a waste.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgarce5", "score_hidden": false, "stickied": false, "created": 1492298637.0, "created_utc": 1492269837.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65hepn", "likes": null, "replies": "", "user_reports": [], "id": "dganldj", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Mangoinhand", "parent_id": "t3_65hepn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Fail.\n\nIf you think you were borderline abusive, then you were. That's guy-drama.\n\nFun fact: Where do macro aggressions get hamstered into a post on micro aggressions? In your post.\n\nSpin more plates and lift more", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fail.&lt;/p&gt;\n\n&lt;p&gt;If you think you were borderline abusive, then you were. That&amp;#39;s guy-drama.&lt;/p&gt;\n\n&lt;p&gt;Fun fact: Where do macro aggressions get hamstered into a post on micro aggressions? In your post.&lt;/p&gt;\n\n&lt;p&gt;Spin more plates and lift more&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dganldj", "score_hidden": false, "stickied": false, "created": 1492292696.0, "created_utc": 1492263896.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65hepn", "likes": null, "replies": "", "user_reports": [], "id": "dgajsbf", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ddelicia", "parent_id": "t3_65hepn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I regret that i read all this, OP can't be succint for shit and has a weak frame. That is all i took from this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I regret that i read all this, OP can&amp;#39;t be succint for shit and has a weak frame. That is all i took from this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgajsbf", "score_hidden": false, "stickied": false, "created": 1492284127.0, "created_utc": 1492255327.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65hepn", "likes": null, "replies": "", "user_reports": [], "id": "dgd7ep0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ShadyShopkeeper", "parent_id": "t3_65hepn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I think you're onto something here, but debasing yourself by acknowledging inane SJW crap with attention it doesn't deserve.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re onto something here, but debasing yourself by acknowledging inane SJW crap with attention it doesn&amp;#39;t deserve.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgd7ep0", "score_hidden": false, "stickied": false, "created": 1492439147.0, "created_utc": 1492410347.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65hepn", "likes": null, "replies": "", "user_reports": [], "id": "dgbrky1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "john1518", "parent_id": "t3_65hepn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I enjoyed this, although I think this would have made just as much sense without the driving story even though it may not be germane to sexual strategy per se.  You raise a great point about micro-aggressions being overall very good and necessary in male hierarchy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I enjoyed this, although I think this would have made just as much sense without the driving story even though it may not be germane to sexual strategy per se.  You raise a great point about micro-aggressions being overall very good and necessary in male hierarchy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgbrky1", "score_hidden": false, "stickied": false, "created": 1492351723.0, "created_utc": 1492322923.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65hepn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65hepn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65hepn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65hepn", "likes": null, "replies": "", "user_reports": [], "id": "dgb1wsp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Occams-shaving-cream", "parent_id": "t1_dgahc1s", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Fair enough. It is written poorly.  Funny, I wondered if the idea of her driving would come up.  Take what you will, but my stance on that I if she wants to go on a road trip, she is going to do some of the work, and that means driving for some of the time.  \n\nBut the point isn't about her words, it was about the idea of subconscious reactions, based on tiny bits of body language and tone.  I was thinking about *why* frames shift, and *why* one needs to push someone into a specific frame.", "edited": 1492284567.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fair enough. It is written poorly.  Funny, I wondered if the idea of her driving would come up.  Take what you will, but my stance on that I if she wants to go on a road trip, she is going to do some of the work, and that means driving for some of the time.  &lt;/p&gt;\n\n&lt;p&gt;But the point isn&amp;#39;t about her words, it was about the idea of subconscious reactions, based on tiny bits of body language and tone.  I was thinking about &lt;em&gt;why&lt;/em&gt; frames shift, and &lt;em&gt;why&lt;/em&gt; one needs to push someone into a specific frame.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgb1wsp", "score_hidden": false, "stickied": false, "created": 1492313135.0, "created_utc": 1492284335.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgahc1s", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Pozac", "parent_id": "t1_dgah0k4", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 1, "body": "Too many words again. Excuses and finger pointing. Your woman is not only driving the car, she's running the whole relationship. \n\nMicroaggressions are shit tests, this is basic TRP stuff. Also you are listening to her words, not observing her actions. Confrontional argument? That's not how this stuff works at all.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Too many words again. Excuses and finger pointing. Your woman is not only driving the car, she&amp;#39;s running the whole relationship. &lt;/p&gt;\n\n&lt;p&gt;Microaggressions are shit tests, this is basic TRP stuff. Also you are listening to her words, not observing her actions. Confrontional argument? That&amp;#39;s not how this stuff works at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgahc1s", "score_hidden": false, "stickied": false, "created": 1492276391.0, "created_utc": 1492247591.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgah0k4", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Occams-shaving-cream", "parent_id": "t1_dgaey6h", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "That's cute.\n\nHaven't been here for a while, lol, I used to be pretty active on another account years ago.  You sound new, its easy to spot, you found a club that tells you what you want to hear and think its dogma.\n\nThere is valuable information here, but you won't see it from that view of \"what TRP is about, alpha beta\" etc.  Sure some of the info can get you laid if you use it, but 90% of it these days I just pointless ranting about how women are whores and you gotta be \"alpha\" ( but you likely misinterperet what that means.)\n\nSignificant others and LTRs are a choice.  If *you* read the sidebar or any of the good posts you would see the entire point is to take what you find useful and apply it.  Self improvement.  I do what I find best for myself.  And yup, some of the principles here definitely corrected things I was doing wrong and improved my relationship.  Say what you will about them, but notice most of the posts here boil down to anger that these \"alphas\" are unable to keep a successful one.  \n\nIf you get past that and look deeper into the actual information, both in the sidebar and the top rated posts from longtime users, you might realize that the central theme here is not actually getting laid, it is about social dynamics in general.  Stopping at just pulling ass is cool if that is what you are into, but there is *much* more you can learn.  Take for instance the sidebar link about \"powertalk\". Read that entire series.  It is one of the most insightful things here and most of it has nothing to do with women.\n\nIf you don't like my post, that's cool.  I would rather you refute it or challenge the ideas than waste time trying to...  Whatever it is that you think throwing cheesy insults and shade at a random stranger does, but that's your prerogative.\n\nI do hope you get a bunch of pussy, or some self improvement or something of value here; it would be pretty sad if a year or so from now you are still trying to yell into the void what this board is really about while missing the entire point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s cute.&lt;/p&gt;\n\n&lt;p&gt;Haven&amp;#39;t been here for a while, lol, I used to be pretty active on another account years ago.  You sound new, its easy to spot, you found a club that tells you what you want to hear and think its dogma.&lt;/p&gt;\n\n&lt;p&gt;There is valuable information here, but you won&amp;#39;t see it from that view of &amp;quot;what TRP is about, alpha beta&amp;quot; etc.  Sure some of the info can get you laid if you use it, but 90% of it these days I just pointless ranting about how women are whores and you gotta be &amp;quot;alpha&amp;quot; ( but you likely misinterperet what that means.)&lt;/p&gt;\n\n&lt;p&gt;Significant others and LTRs are a choice.  If &lt;em&gt;you&lt;/em&gt; read the sidebar or any of the good posts you would see the entire point is to take what you find useful and apply it.  Self improvement.  I do what I find best for myself.  And yup, some of the principles here definitely corrected things I was doing wrong and improved my relationship.  Say what you will about them, but notice most of the posts here boil down to anger that these &amp;quot;alphas&amp;quot; are unable to keep a successful one.  &lt;/p&gt;\n\n&lt;p&gt;If you get past that and look deeper into the actual information, both in the sidebar and the top rated posts from longtime users, you might realize that the central theme here is not actually getting laid, it is about social dynamics in general.  Stopping at just pulling ass is cool if that is what you are into, but there is &lt;em&gt;much&lt;/em&gt; more you can learn.  Take for instance the sidebar link about &amp;quot;powertalk&amp;quot;. Read that entire series.  It is one of the most insightful things here and most of it has nothing to do with women.&lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t like my post, that&amp;#39;s cool.  I would rather you refute it or challenge the ideas than waste time trying to...  Whatever it is that you think throwing cheesy insults and shade at a random stranger does, but that&amp;#39;s your prerogative.&lt;/p&gt;\n\n&lt;p&gt;I do hope you get a bunch of pussy, or some self improvement or something of value here; it would be pretty sad if a year or so from now you are still trying to yell into the void what this board is really about while missing the entire point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgah0k4", "score_hidden": false, "stickied": false, "created": 1492275376.0, "created_utc": 1492246576.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaey6h", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "Pozac", "parent_id": "t3_65hepn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 1, "body": "Too many words, you're blue pill and a beta who has \"a significant other\". Read the sidebar, learn what shit tests are and how not to fail them. \n\nLearn about women and men in the context of TRP and you'll see this thread does not belong here at all. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Too many words, you&amp;#39;re blue pill and a beta who has &amp;quot;a significant other&amp;quot;. Read the sidebar, learn what shit tests are and how not to fail them. &lt;/p&gt;\n\n&lt;p&gt;Learn about women and men in the context of TRP and you&amp;#39;ll see this thread does not belong here at all. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgaey6h", "score_hidden": false, "stickied": false, "created": 1492269437.0, "created_utc": 1492240637.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}]