[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=1Gdl-A1DvpA\"&gt;https://www.youtube.com/watch?v=1Gdl-A1DvpA&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This is funny, for sure. Watch the way this guy is incompetent at every step. He does not hurry up to try and stay with Ramsay at any point, claims he doesn&amp;#39;t know metric (hamstering) and in the end stops listing off things he&amp;#39;s done wrong because he&amp;#39;s afraid of being chastised. &lt;/p&gt;\n\n&lt;p&gt;I see people like this all the time in the classroom; something will get hard and they will zone out and give up and then go and complain to their friends about how incompetent the teacher was. Also, notice how Ramsay has to tell him that he fucked up the shape of his crab cake because he is doing it wrong and that he can&amp;#39;t blame the equipment. Kind of like being... well I&amp;#39;m a nice guy. His frame on everything is totally fucked up and filled with victimhood.&lt;/p&gt;\n\n&lt;p&gt;This is the perfect representation of the blue pill in life. Frankly, if this is our competition, I&amp;#39;m not surprised at all that 80/20 exists. &lt;/p&gt;\n\n&lt;p&gt;As a final note: of course Ramsay is more confident in this scenario, but juxtaposed with this normal guy, it&amp;#39;s staggering the difference in who these guys are. I&amp;#39;m not surprised one has accomplished a lot and the other- nothing. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "https://www.youtube.com/watch?v=1Gdl-A1DvpA\n\nThis is funny, for sure. Watch the way this guy is incompetent at every step. He does not hurry up to try and stay with Ramsay at any point, claims he doesn't know metric (hamstering) and in the end stops listing off things he's done wrong because he's afraid of being chastised. \n\nI see people like this all the time in the classroom; something will get hard and they will zone out and give up and then go and complain to their friends about how incompetent the teacher was. Also, notice how Ramsay has to tell him that he fucked up the shape of his crab cake because he is doing it wrong and that he can't blame the equipment. Kind of like being... well I'm a nice guy. His frame on everything is totally fucked up and filled with victimhood.\n\nThis is the perfect representation of the blue pill in life. Frankly, if this is our competition, I'm not surprised at all that 80/20 exists. \n\nAs a final note: of course Ramsay is more confident in this scenario, but juxtaposed with this normal guy, it's staggering the difference in who these guys are. I'm not surprised one has accomplished a lot and the other- nothing. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Blue Pill Example", "id": "65qbrn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "chilinfosho", "saved": false, "mod_reports": [], "name": "t3_65qbrn", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": false, "link_flair_css_class": "bp", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheRedPill/comments/65qbrn/funny_video_professional_vs_amateur_men_side/", "num_reports": null, "locked": false, "stickied": false, "created": 1492393228.0, "url": "https://www.reddit.com/r/TheRedPill/comments/65qbrn/funny_video_professional_vs_amateur_men_side/", "author_flair_text": null, "quarantine": false, "title": "Funny video- professional vs. amateur men. Side bonus: learning how to make crab cake for dates.", "created_utc": 1492364428.0, "distinguished": null, "media": null, "upvote_ratio": 0.41, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qbrn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qbrn", "likes": null, "replies": "", "user_reports": [], "id": "dgcdaz3", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "chilinfosho", "parent_id": "t1_dgccmqr", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The red pill front is normally 50% full of examples of how women do these things. I posted an example of how men do the same and how it is bad. I am focusing on me by observing other men and learning from them, which is more productive than complaining about women all the time. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The red pill front is normally 50% full of examples of how women do these things. I posted an example of how men do the same and how it is bad. I am focusing on me by observing other men and learning from them, which is more productive than complaining about women all the time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgcdaz3", "score_hidden": false, "stickied": false, "created": 1492395813.0, "created_utc": 1492367013.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgccmqr", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "aanarchist", "parent_id": "t3_65qbrn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "this entire post is a good blue pill example, thank you. focus on yourselves gents, rather than searching on youtube for random dudes to trash talk to make yourself feel better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this entire post is a good blue pill example, thank you. focus on yourselves gents, rather than searching on youtube for random dudes to trash talk to make yourself feel better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgccmqr", "score_hidden": false, "stickied": false, "created": 1492394913.0, "created_utc": 1492366113.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qbrn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qbrn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qbrn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qbrn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qbrn", "likes": null, "replies": "", "user_reports": [], "id": "dgec2st", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mckallidon", "parent_id": "t1_dgddu9x", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "If dispensing true facts within the scope of the post is a waste of breath, then kill yourself. You just had to chime in to contribute nothing but your own self-importance. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If dispensing true facts within the scope of the post is a waste of breath, then kill yourself. You just had to chime in to contribute nothing but your own self-importance. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgec2st", "score_hidden": false, "stickied": false, "created": 1492501648.0, "created_utc": 1492472848.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgddu9x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bolt892", "parent_id": "t1_dgd0x4v", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Not defending Ramsay here, but you're way too mad at him man, you're wasting your breath.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not defending Ramsay here, but you&amp;#39;re way too mad at him man, you&amp;#39;re wasting your breath.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgddu9x", "score_hidden": false, "stickied": false, "created": 1492458242.0, "created_utc": 1492429442.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qbrn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qbrn", "likes": null, "replies": "", "user_reports": [], "id": "dgddcw9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mckallidon", "parent_id": "t1_dgd8lsk", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Dude is a fucking master of masters in every arena of manhood and cheffing. Dude was my inspiration as a young man. Never gave one single fuck to anyone that was not earned. Took that shit back right away like nothing. He has forgotten more than Chad Thundercock will ever know. And he came from fucking nothing and became a god level man in the worst fucking industry. He's a perfect example of only validating yourself. He woke up and realized he wasn't doing him and said fuck my trophies, where's the action at. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude is a fucking master of masters in every arena of manhood and cheffing. Dude was my inspiration as a young man. Never gave one single fuck to anyone that was not earned. Took that shit back right away like nothing. He has forgotten more than Chad Thundercock will ever know. And he came from fucking nothing and became a god level man in the worst fucking industry. He&amp;#39;s a perfect example of only validating yourself. He woke up and realized he wasn&amp;#39;t doing him and said fuck my trophies, where&amp;#39;s the action at. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgddcw9", "score_hidden": false, "stickied": false, "created": 1492457029.0, "created_utc": 1492428229.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qbrn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qbrn", "likes": null, "replies": "", "user_reports": [], "id": "dge89c7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mckallidon", "parent_id": "t1_dge3fy4", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "That's the book that removed most doubt from my mind to stay the course of a chef and take myself as far as I can. I was like wow, this dude is as big of a lunatic as Im aspiring to be. He is so genuine and self aware it wakes you up more inside as a person if you have any soul whatsoever. Like a bro from anotha ho. \n\nThe thing about Ramsay vs White is that other people substantiate many of White's claims while Ramsay obviously gives zero fucks about honesty and integrity once you look at the big picture. It's almost like DJTs campaign lol (MAGA 2020!). Many of the headlines and articles of past when you look at all of them it's sort of obvious that Ramsay was a fucktard generating them and he was just a car wreck to show off while white mostly did himself truthfully and spoke his mind. I'm sure there's some salt in his side too, and no one remembers everything correctly, but he is a much more trustworthy person. \n\nMany of Gordon's old old comrades hate his guts.  Very few from his past would give the guy the time of day. He's an opportunistic shitbag and will fuck anyone over for 15 mins of spotlight and a nickel. He is a predator. He has no one collaborating many of his claims anywhere. Pure sensationalism. And he really took advantage of some people with his U.K. Version of kitchen nightmares. Mislead the crap out of them about what the show would actually portray. It's a better show than the US version, but he really fucked a few struggling people to make a buck. No decent chef airs out another's dirty laundry while they help them wash it. \n\nMany people from his past, including White, cut him off for his fuckery compounding his parasitism. He even crashed Whites private wedding with journalists bc that's how big of a cunt with attention issues he is. He started shit with his maker just for headlines. This is a pure total shitbag. Lucifer and Judas. Ramsay is the Jucifer. Unfortunately so much truth gets buried for the journalistic economics of the U.K. You have to not give away the end and sell it five times over without delivering to sell more papers. UK journalism is horrible lol. \n\nRamsay is a pathological liar, and a giant Narcissist. His writing is pure satire to me. He beefs with other respectable chef's to keep his headlines fresh, and acts like a fucking pro wrestling twat bc all Ramsay is, is a giant Ramsay neon sign. I've always had a Ramsay here and there in my kitchen. These people can make up the most intricate bullshit art like a Buddhist monk's sand mandala because they're too smart and just socially intelligent enough. That's why they are capable of success too. \n\nHe came off as a total dickhead with that BS with Jamie Oliver, not my favorite, but I do respect him because he does his own thing, and unlike Ramsay is actually capable of risking doing weak shit to inform people and not make himself look like a badass. He has done a lot for culinary education with youth in the U.K.  Literally just goes on a show one day and starts shit because he thrives on conflict and attention and he can't help himself from generating it. White wasn't in the headlines anymore, but Oliver was. Couldn't help himself. Natural target to cut down to feel big. Very little respect for many other chefs. Total ass clown. \n\nMarco Pierre White is the embodiment of pure mastery for its own sake. A true fucking genius and missionary for the gospel of the art. \n\nThanks for the responses and such goys. It's kind of cool to talk shop for once here. Cheers!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the book that removed most doubt from my mind to stay the course of a chef and take myself as far as I can. I was like wow, this dude is as big of a lunatic as Im aspiring to be. He is so genuine and self aware it wakes you up more inside as a person if you have any soul whatsoever. Like a bro from anotha ho. &lt;/p&gt;\n\n&lt;p&gt;The thing about Ramsay vs White is that other people substantiate many of White&amp;#39;s claims while Ramsay obviously gives zero fucks about honesty and integrity once you look at the big picture. It&amp;#39;s almost like DJTs campaign lol (MAGA 2020!). Many of the headlines and articles of past when you look at all of them it&amp;#39;s sort of obvious that Ramsay was a fucktard generating them and he was just a car wreck to show off while white mostly did himself truthfully and spoke his mind. I&amp;#39;m sure there&amp;#39;s some salt in his side too, and no one remembers everything correctly, but he is a much more trustworthy person. &lt;/p&gt;\n\n&lt;p&gt;Many of Gordon&amp;#39;s old old comrades hate his guts.  Very few from his past would give the guy the time of day. He&amp;#39;s an opportunistic shitbag and will fuck anyone over for 15 mins of spotlight and a nickel. He is a predator. He has no one collaborating many of his claims anywhere. Pure sensationalism. And he really took advantage of some people with his U.K. Version of kitchen nightmares. Mislead the crap out of them about what the show would actually portray. It&amp;#39;s a better show than the US version, but he really fucked a few struggling people to make a buck. No decent chef airs out another&amp;#39;s dirty laundry while they help them wash it. &lt;/p&gt;\n\n&lt;p&gt;Many people from his past, including White, cut him off for his fuckery compounding his parasitism. He even crashed Whites private wedding with journalists bc that&amp;#39;s how big of a cunt with attention issues he is. He started shit with his maker just for headlines. This is a pure total shitbag. Lucifer and Judas. Ramsay is the Jucifer. Unfortunately so much truth gets buried for the journalistic economics of the U.K. You have to not give away the end and sell it five times over without delivering to sell more papers. UK journalism is horrible lol. &lt;/p&gt;\n\n&lt;p&gt;Ramsay is a pathological liar, and a giant Narcissist. His writing is pure satire to me. He beefs with other respectable chef&amp;#39;s to keep his headlines fresh, and acts like a fucking pro wrestling twat bc all Ramsay is, is a giant Ramsay neon sign. I&amp;#39;ve always had a Ramsay here and there in my kitchen. These people can make up the most intricate bullshit art like a Buddhist monk&amp;#39;s sand mandala because they&amp;#39;re too smart and just socially intelligent enough. That&amp;#39;s why they are capable of success too. &lt;/p&gt;\n\n&lt;p&gt;He came off as a total dickhead with that BS with Jamie Oliver, not my favorite, but I do respect him because he does his own thing, and unlike Ramsay is actually capable of risking doing weak shit to inform people and not make himself look like a badass. He has done a lot for culinary education with youth in the U.K.  Literally just goes on a show one day and starts shit because he thrives on conflict and attention and he can&amp;#39;t help himself from generating it. White wasn&amp;#39;t in the headlines anymore, but Oliver was. Couldn&amp;#39;t help himself. Natural target to cut down to feel big. Very little respect for many other chefs. Total ass clown. &lt;/p&gt;\n\n&lt;p&gt;Marco Pierre White is the embodiment of pure mastery for its own sake. A true fucking genius and missionary for the gospel of the art. &lt;/p&gt;\n\n&lt;p&gt;Thanks for the responses and such goys. It&amp;#39;s kind of cool to talk shop for once here. Cheers!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dge89c7", "score_hidden": false, "stickied": false, "created": 1492496678.0, "created_utc": 1492467878.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dge3fy4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hetakesit", "parent_id": "t1_dgd8lsk", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Would recommend Marco's book, [White Heat](https://www.amazon.com/White-Heat-Marco-Pierre/dp/1845334582).\n\nRamsay's book [Roasting in Hell's Kitchen](https://www.amazon.com/Roasting-Hells-Kitchen-Tantrums-Perfection/dp/0061191981/) is decent too, though as /u/Mckallidon pointed out it's to be taken with a grain of salt from a pure culinary perspective. Reading both is interesting since they both provided detailed contradictory accounts of how they saw their time working together.", "edited": 1492462338.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would recommend Marco&amp;#39;s book, &lt;a href=\"https://www.amazon.com/White-Heat-Marco-Pierre/dp/1845334582\"&gt;White Heat&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Ramsay&amp;#39;s book &lt;a href=\"https://www.amazon.com/Roasting-Hells-Kitchen-Tantrums-Perfection/dp/0061191981/\"&gt;Roasting in Hell&amp;#39;s Kitchen&lt;/a&gt; is decent too, though as &lt;a href=\"/u/Mckallidon\"&gt;/u/Mckallidon&lt;/a&gt; pointed out it&amp;#39;s to be taken with a grain of salt from a pure culinary perspective. Reading both is interesting since they both provided detailed contradictory accounts of how they saw their time working together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dge3fy4", "score_hidden": false, "stickied": false, "created": 1492490837.0, "created_utc": 1492462037.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8lsk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Edmondfromchateaudif", "parent_id": "t1_dgd0x4v", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Marco Pierre White is a very very interesting man. He is as RP as they come.\n\nHis story is [here](https://www.youtube.com/watch?v=U-xCIstDBaI).\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Marco Pierre White is a very very interesting man. He is as RP as they come.&lt;/p&gt;\n\n&lt;p&gt;His story is &lt;a href=\"https://www.youtube.com/watch?v=U-xCIstDBaI\"&gt;here&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgd8lsk", "score_hidden": false, "stickied": false, "created": 1492441914.0, "created_utc": 1492413114.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0x4v", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Mckallidon", "parent_id": "t1_dgcmnxr", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Sorry for the length. I figured it'd be a good opportunity to redpill people generally about cheffing. \n\nThe best chef alive today, Marco Pierre White, Ramsay's mentor, who kicked him out of his life for being such a hack fucktard, has had more stars than any chef ever, and gave them up like nothing because they meant nothing to him and got in the way of being the best. Ramsay settled for slightly better than mediocre, chased money and fame and used money to rack up stars. Marco actually earned his stars, and gave them up to become even better than being already the best. He still had his hand in those business operations. Ramsay would rather spend his whole life building a fake persona and a fevered ego. That's why I, and many others are better chefs. He peaked early in the actual kitchen and has long been a talking head. \n\nA lot of what goes into getting stars is beyond the kitchen and limits you. If you actually understood what the Michelin rating system was you would know that it's largely BS in terms of measuring a chef's cooking. It rates a type of business, not a chef's talent. It's actually a restaurant, not the chef who gets the stars. So chefs can't necessarily claim the stars really unless they own the joint or got the restaurant to earn them under their watch. Martin Yan only has like one or two and he is 10 times the chef Ramsay is. Like anyone gives two shits how many stars Jacque Pepin has, he is still goddam Yoda. \n\nI've worked for establishments with stars. I've worked in better places that didn't have any. It's nothing bro. Just being employable at a place with stars however, already sets you apart as a chef, but in the grand scheme of things it doesn't make the chef. \n\nIt's easy to rack up stars when you pump TV revenue into a holdings corporation that basically buys Ramsay's stars by buying up talent and building cookie cutter businesses that all collect a star or two. Ramsay's stars aren't really his. Way better people work hard for him to put those on his name while he's off in papa lnd coming up with the next best way to get more attention. Fact is he's closed restaurants that had stars because they failed financially lol. If he wasn't such a narcisist, he wouldn't be so good at fooling the initiated about what he actually is. Stars don't make you money. Cheeseburger places make more profit margin than most Michelin starred places. All the star is that your place conforms to particular standards that measures overall hospitality. Much of which has nothing to do with the food or even the chef, which is why it's mostly a thing for chef owners. \n\nLike I said, I would respectfully throw down with Ramsay in the kitchen. Anything. A chef is only as good as his last service period. No number of stars outcooks me without the actual ability. Not to say that he isn't capable on a line, but he hasn't been a real chef for a long time and was only ever a shadow of Marco. I've had to hang in places where I didn't even speak the same language as anyone. Ramsay was coddled like baby compared to where most people come up. \n\nRamsay footage of actual cooking is usually very very staged. He is obsessed with making himself look like the god that he is not. Not that he cannot cook, but he isn't what he tries to make people perceive. \n\nRamsay was in college learning to manage hotels at the same age I already took over a busy kitchen and had been cooking seriously for years. I was already better than any culinary grad by 16. While he became an entertainer to be rich, I worked in every kitchen imaginable and learned far far more.  I can honestly say I'm confident I would bury him regardless of what his producers setup. He isn't a real chef anymore. He's not even ACF ranked to my knowledge because that's how little cooking he's done for a very long time. \n\nI actually do what people think he does. Fuck the stars. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry for the length. I figured it&amp;#39;d be a good opportunity to redpill people generally about cheffing. &lt;/p&gt;\n\n&lt;p&gt;The best chef alive today, Marco Pierre White, Ramsay&amp;#39;s mentor, who kicked him out of his life for being such a hack fucktard, has had more stars than any chef ever, and gave them up like nothing because they meant nothing to him and got in the way of being the best. Ramsay settled for slightly better than mediocre, chased money and fame and used money to rack up stars. Marco actually earned his stars, and gave them up to become even better than being already the best. He still had his hand in those business operations. Ramsay would rather spend his whole life building a fake persona and a fevered ego. That&amp;#39;s why I, and many others are better chefs. He peaked early in the actual kitchen and has long been a talking head. &lt;/p&gt;\n\n&lt;p&gt;A lot of what goes into getting stars is beyond the kitchen and limits you. If you actually understood what the Michelin rating system was you would know that it&amp;#39;s largely BS in terms of measuring a chef&amp;#39;s cooking. It rates a type of business, not a chef&amp;#39;s talent. It&amp;#39;s actually a restaurant, not the chef who gets the stars. So chefs can&amp;#39;t necessarily claim the stars really unless they own the joint or got the restaurant to earn them under their watch. Martin Yan only has like one or two and he is 10 times the chef Ramsay is. Like anyone gives two shits how many stars Jacque Pepin has, he is still goddam Yoda. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve worked for establishments with stars. I&amp;#39;ve worked in better places that didn&amp;#39;t have any. It&amp;#39;s nothing bro. Just being employable at a place with stars however, already sets you apart as a chef, but in the grand scheme of things it doesn&amp;#39;t make the chef. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s easy to rack up stars when you pump TV revenue into a holdings corporation that basically buys Ramsay&amp;#39;s stars by buying up talent and building cookie cutter businesses that all collect a star or two. Ramsay&amp;#39;s stars aren&amp;#39;t really his. Way better people work hard for him to put those on his name while he&amp;#39;s off in papa lnd coming up with the next best way to get more attention. Fact is he&amp;#39;s closed restaurants that had stars because they failed financially lol. If he wasn&amp;#39;t such a narcisist, he wouldn&amp;#39;t be so good at fooling the initiated about what he actually is. Stars don&amp;#39;t make you money. Cheeseburger places make more profit margin than most Michelin starred places. All the star is that your place conforms to particular standards that measures overall hospitality. Much of which has nothing to do with the food or even the chef, which is why it&amp;#39;s mostly a thing for chef owners. &lt;/p&gt;\n\n&lt;p&gt;Like I said, I would respectfully throw down with Ramsay in the kitchen. Anything. A chef is only as good as his last service period. No number of stars outcooks me without the actual ability. Not to say that he isn&amp;#39;t capable on a line, but he hasn&amp;#39;t been a real chef for a long time and was only ever a shadow of Marco. I&amp;#39;ve had to hang in places where I didn&amp;#39;t even speak the same language as anyone. Ramsay was coddled like baby compared to where most people come up. &lt;/p&gt;\n\n&lt;p&gt;Ramsay footage of actual cooking is usually very very staged. He is obsessed with making himself look like the god that he is not. Not that he cannot cook, but he isn&amp;#39;t what he tries to make people perceive. &lt;/p&gt;\n\n&lt;p&gt;Ramsay was in college learning to manage hotels at the same age I already took over a busy kitchen and had been cooking seriously for years. I was already better than any culinary grad by 16. While he became an entertainer to be rich, I worked in every kitchen imaginable and learned far far more.  I can honestly say I&amp;#39;m confident I would bury him regardless of what his producers setup. He isn&amp;#39;t a real chef anymore. He&amp;#39;s not even ACF ranked to my knowledge because that&amp;#39;s how little cooking he&amp;#39;s done for a very long time. &lt;/p&gt;\n\n&lt;p&gt;I actually do what people think he does. Fuck the stars. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgd0x4v", "score_hidden": false, "stickied": false, "created": 1492427464.0, "created_utc": 1492398664.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcmnxr", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "chilinfosho", "parent_id": "t1_dgcloub", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "So how many Michelin stars do you have? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So how many Michelin stars do you have? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgcmnxr", "score_hidden": false, "stickied": false, "created": 1492408090.0, "created_utc": 1492379290.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcloub", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Mckallidon", "parent_id": "t3_65qbrn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "OP. Your post is stupid simply because you have no qualifications to critique this or apply it to analyzing life. If you have ever seriously cooked in your life or knew anything about Gordon Ramsay you'd would realize that grasping for straws here bro. A fake video does not convey true redpill wisdom. That's bluepill thinking. \n\nI know better chefs than Ramsay. I would throw down against him any day, any kitchen, any cuisine. He can prep behind closed doors all he wants like he does before these videos. \nSeriously. He has better chefs under him that train him before he goes on camera so he looks good. He also is obsessed with self image and managing perception of himself because he's a whack job that even his own mentor wants nothing to do with. Guaranteed someone started this project to feed Ramsay's ego and earn some brownie points, and that Ramsay practiced while this dude walked in blind with no briefing. \n\nI've worked in commercial kitchens since I was 12. He is not that good of a chef as is implied. He isn't a bad chef either but he is so overrated. He is a master businessman that got rich off of entertainment and holdings, not his restaurants. He's tanked restaurants and his whole Hotel restaurant business is run by better people than him. All he does is peddle NPD on a screen. I know Greeks that barely speak English that made more money from selling food than any of his restaurants ever have. This is a dumb comparison for anyone who actually cooks professionally. \n\nAnd most chefs DO NOT use metric ever outside Europe. Many European chefs still use imperial because a lot of kitchen measurements in English are designed for good kitchen math like how metric. I've worked under French chefs from France who have NEVER used metric. There is not a single culinary school of extreme import that trains in metric. Most standard ratios are in the English system and easier to memorize as such. \n\nThis video does not accurately portray what you say it does. This is actually how people respectfully grow in a pro kitchen. This isn't excuse making. This is learning when you can verbalized your mistakes. \n\nNothing bluepill about being thrown off by a total setup to entertain plebs. Fact is if you ever cooked under pressure you would know that this guy actually handled it very well. I've seen people actually melt down and their tunnel vision was so bad they couldn't even reflect on what happened to learn like this guy did. I've cooked on camera as well. It's not easy. \n\nThere is also nothing redpill about being dishonest about your ability or mistakes, and faking it til you make it. Those people never make it to chef. \n\nThis post was fucking stupid. A lot of trash flooding into TRP from noobs that like to project their low level of understanding. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP. Your post is stupid simply because you have no qualifications to critique this or apply it to analyzing life. If you have ever seriously cooked in your life or knew anything about Gordon Ramsay you&amp;#39;d would realize that grasping for straws here bro. A fake video does not convey true redpill wisdom. That&amp;#39;s bluepill thinking. &lt;/p&gt;\n\n&lt;p&gt;I know better chefs than Ramsay. I would throw down against him any day, any kitchen, any cuisine. He can prep behind closed doors all he wants like he does before these videos. \nSeriously. He has better chefs under him that train him before he goes on camera so he looks good. He also is obsessed with self image and managing perception of himself because he&amp;#39;s a whack job that even his own mentor wants nothing to do with. Guaranteed someone started this project to feed Ramsay&amp;#39;s ego and earn some brownie points, and that Ramsay practiced while this dude walked in blind with no briefing. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve worked in commercial kitchens since I was 12. He is not that good of a chef as is implied. He isn&amp;#39;t a bad chef either but he is so overrated. He is a master businessman that got rich off of entertainment and holdings, not his restaurants. He&amp;#39;s tanked restaurants and his whole Hotel restaurant business is run by better people than him. All he does is peddle NPD on a screen. I know Greeks that barely speak English that made more money from selling food than any of his restaurants ever have. This is a dumb comparison for anyone who actually cooks professionally. &lt;/p&gt;\n\n&lt;p&gt;And most chefs DO NOT use metric ever outside Europe. Many European chefs still use imperial because a lot of kitchen measurements in English are designed for good kitchen math like how metric. I&amp;#39;ve worked under French chefs from France who have NEVER used metric. There is not a single culinary school of extreme import that trains in metric. Most standard ratios are in the English system and easier to memorize as such. &lt;/p&gt;\n\n&lt;p&gt;This video does not accurately portray what you say it does. This is actually how people respectfully grow in a pro kitchen. This isn&amp;#39;t excuse making. This is learning when you can verbalized your mistakes. &lt;/p&gt;\n\n&lt;p&gt;Nothing bluepill about being thrown off by a total setup to entertain plebs. Fact is if you ever cooked under pressure you would know that this guy actually handled it very well. I&amp;#39;ve seen people actually melt down and their tunnel vision was so bad they couldn&amp;#39;t even reflect on what happened to learn like this guy did. I&amp;#39;ve cooked on camera as well. It&amp;#39;s not easy. &lt;/p&gt;\n\n&lt;p&gt;There is also nothing redpill about being dishonest about your ability or mistakes, and faking it til you make it. Those people never make it to chef. &lt;/p&gt;\n\n&lt;p&gt;This post was fucking stupid. A lot of trash flooding into TRP from noobs that like to project their low level of understanding. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgcloub", "score_hidden": false, "stickied": false, "created": 1492406803.0, "created_utc": 1492378003.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qbrn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qbrn", "likes": null, "replies": "", "user_reports": [], "id": "dge5pti", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DigitallyDisrupt", "parent_id": "t1_dgccenq", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "An armature is the rotational part of a motor.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;An armature is the rotational part of a motor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dge5pti", "score_hidden": false, "stickied": false, "created": 1492493501.0, "created_utc": 1492464701.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgccenq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Exactly_what_I_think", "parent_id": "t3_65qbrn", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Bullshit.\n\nProfessional VS Amateur.\n\nThe only thing the amateur truly screwed up was chopping the peepers. Ramsay event admitted it was well seasoned AKA it tasted good.", "edited": 1492466804.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bullshit.&lt;/p&gt;\n\n&lt;p&gt;Professional VS Amateur.&lt;/p&gt;\n\n&lt;p&gt;The only thing the amateur truly screwed up was chopping the peepers. Ramsay event admitted it was well seasoned AKA it tasted good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgccenq", "score_hidden": false, "stickied": false, "created": 1492394610.0, "created_utc": 1492365810.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]