[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First, I truly believe if you aren&amp;#39;t incorporating reading material such as the 7 habits of highly effective people, or think and grow rich, or any other book aimed at leadership skills, you are handicapping your progress toward being the alpha of alphas. Here&amp;#39;s why, and the key to controlling others. &lt;/p&gt;\n\n&lt;p&gt;Preface: it&amp;#39;s vital to understand basic almost instinctual social dynamics of groups to understand how they elect leaders and willingly give their power and control to those leaders even when that leader may not have any authority over them at all. Then learning how that leader got his position as leader vs follower is critical to know for each of you to understand your own path to control, and how that leadership is maintained is the obvious next skill level needed to maintain this power. We will assume, no member of society in any part of this world, is ok with their free will being stripped from them.&lt;/p&gt;\n\n&lt;p&gt;We also assume you are trying to control 1 or more people other than yourself.&lt;/p&gt;\n\n&lt;p&gt;There is a model I&amp;#39;d like to use for examples sake that teaches people follow a pattern when first meeting that leads to the creation of a cohesive group. If all 4 steps are not taken, the group will not form and failure is likely. These steps are:&lt;/p&gt;\n\n&lt;p&gt;Forming - understanding the members in the group&lt;/p&gt;\n\n&lt;p&gt;Storming - dominance and submission actions leading to pecking order &lt;/p&gt;\n\n&lt;p&gt;Norming - group pecking order set and roles divided, tasks assigned and performance begins &lt;/p&gt;\n\n&lt;p&gt;Performing - cohesion of tasks leads to success&lt;/p&gt;\n\n&lt;p&gt;The progress and success of this group hinges upon a proper pecking order being set up, at which the group synergistically is more capable than the capability of the leader on their own. If the leader has excellent leadership skills, those also count toward his unique skill as a leader and the group would need to capitalize on those as well, still only being a bit better. The more people, the bigger the gap between his capability and the total capability of the group.&lt;/p&gt;\n\n&lt;p&gt;The group may not stay moving from one to the next step successfully, they may bounce back to a previous step and reflow. This costs short term progress, but in the mix of things may make longer term benefits. &lt;/p&gt;\n\n&lt;p&gt;Now we&amp;#39;ve tackled a very simplified version of group dynamics Let&amp;#39;s talk authority figures.&lt;/p&gt;\n\n&lt;p&gt;First, there are generally two types of authority that lends control to you. Formal and informal authority. &lt;/p&gt;\n\n&lt;p&gt;Formal authority - in some way you have been given the ability of control with authorized consequences that can be disposed of at your desire. This may include paperwork, legal consequences, removal of physical control from an individual (handcuffs, jail, etc), remove source of resources  (firing an employee, payroll deduction), physical pain infliction (spanking your child) ect. &lt;/p&gt;\n\n&lt;p&gt;This is sanctioned by those with more authority than you, and your power is derived strictly from their power and delegated responsibility. Should the higher power deem you no longer fit, your authority is removed. State taking your children away, you being fired from a manager position, a cop losing his badge, ect. &lt;/p&gt;\n\n&lt;p&gt;This authority is limited to the power of the black and white print that gave you the power in the first place. Most importantly psychologically people see you in that position of power and likely have dehumanized you in that role. You don&amp;#39;t give a shit who wrote the constitution, a cops name, the personality of the guy in HR who hired you, or what not. You just know and understand there are rules and enforcers. The key here is the rules that govern are the very same that give the power to those officials. &lt;/p&gt;\n\n&lt;p&gt;In a upperlevel leadership mentality, we call these simply managers. You are managing your rules given your role. &lt;/p&gt;\n\n&lt;p&gt;These people ultimately have the authority to tell other what to do, and if they don&amp;#39;t comply, face unpleasant  consequences. They can, and do at times, strip you of your free will.&lt;/p&gt;\n\n&lt;p&gt;Informal -  we&amp;#39;ll call these leaders. This is a authority that is given by the popularity of a given group. This may even be given begrudgingly by some members who disagree but succumb to social dynamics and ultimately peer pressure. In every movie or show where there is a gaggle of random people faced with a random crisis or challenge we see the informal leaders emerge. They are the ones each individual groul member has determined to be better at a skill that will lead to success, than thay member is. Which skill will lead to success? That is in the eye of the beholder. The one who gets elected informal leader has higher skill capability on average for the group in areas that the group on average have determined to be vital for the win/success/safety ect. &lt;/p&gt;\n\n&lt;p&gt;The informal leader usually goes through a series of group fitness tests before being chosen. The type of fit test is given usually on an individual basis where 1 member challenges another directly. They will usually challenge for 2 reasons/ways:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;the way that is actually subcommunicating their own most weak insecure place, they want to see if the new alphas skills can compensate for with the alphas strength in that skill &lt;/li&gt;\n&lt;li&gt;I think my skill strength is stronger than yours and were going to find out&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Some examples and explanation of the subcommunication:&lt;/p&gt;\n\n&lt;p&gt;Example:The all famous shit test by women&lt;/p&gt;\n\n&lt;p&gt;Sub-com: how much do you really believe your method/idea/gut is right? I am insecure about the future of this and I need to know you aren&amp;#39;t going to let me down.&lt;/p&gt;\n\n&lt;p&gt;Example: The person who offers only more problems to any solution you have, never coming up with their own(the troll/whiney bitch/male shit test) &lt;/p&gt;\n\n&lt;p&gt;Sub-com: I am very insecure, I&amp;#39;m going to bombard you with things to try and make you insecure in your plan to see if it works. If my tactic works, you don&amp;#39;t have what is needed to make me feel safe, you must be wrong, I will not follow you. If trolling  doesn&amp;#39;t work on you, I have vented my insecurity and you&amp;#39;re frame is strong enough I can step in it and will emotionally be able to follow you but logically I will remain skeptical. &lt;/p&gt;\n\n&lt;p&gt;Example: another person who seems to troll you but has real solutions instead of just problems&lt;/p&gt;\n\n&lt;p&gt;Sub-comm: I don&amp;#39;t believe you are as equipped to handle this as I am, I must show this publicly and gain favor. If I am to survive, we need to use my skills because they are the best for this situation. &lt;/p&gt;\n\n&lt;p&gt;Now, as the members who are vollying for the leadership role, they usually must past social, intellectual, and sometimes physical fitness tests distributed at lightening speed by the members of the group. This is where informal leaders are born. &lt;/p&gt;\n\n&lt;p&gt;Given you&amp;#39;ve put in the diligence in your social training, and leadership training, you know how to handle each of those fit tests flawlessly... you know how to handle the female shit test, AA. The whiny bitch, you resist the urge to shame him into non-existence and instead delegate to him the role of devil&amp;#39;s advocate, you&amp;#39;ve just given him a position (that shows you have delagative authority even if you dont) and the guy that may be more intelligent than you, let&amp;#39;s say he is, you control him by giving him praise for his great ideas, give him authority to speak and be heard, and show approval. &lt;/p&gt;\n\n&lt;p&gt;Again, generally the person who can past the most types of fit tests, physical, social, intelligence, will be deemed the informal leader over the group, because the group will instinctively and subconsciously listen more closely to what that person says and does.\n Please note: The group pays attention to what he says he believes, and what he does, NOT what he tells them to believe or tells them to do!&lt;/p&gt;\n\n&lt;p&gt;It is only through his passing of these fitness tests that he earns the trust of each individual on a case by case basis, that he is superior to them, and they will give their conformity to his desire, of their own free will. And as more and more people do this, a momentum builds based on social conventions that we all know such as, the higher the total number of people like something the more valuable it becomes on average, ect. &lt;/p&gt;\n\n&lt;p&gt;Ask any CEO or manager who is worth their weight in salt, and they will confirm and in fact novels upon novels have been written on this next point. The formal leader must also simultaneously earned himself the role as the informal leader to truly have ultimate power. Should he not, he is at risk of being overthrown by the informal leader and the people that follow that informal leader. However, at all times, the informal leader must never act as a formal leader unless specifically given that role by the people he leads through their election, or support in overthrowing the current formal leader. If he attempts being the formal leader and begins trying to control the actions of another without that explicit voiced approval, he will find he is trying to force their compliance against their free will, and the consequences are terrible on the individual basis. Moreover, and worse of all, the group will see the potential for their own free will to be stripped in the same way and likely will stop supporting this member. &lt;/p&gt;\n\n&lt;p&gt;And this is the big finally. In everyday context, you are NOT a formal leader, if you are, it&amp;#39;s in a very specific role. All other roles, you lose that authority. We talk shit tests from women. We talk shit tests in general. In all walks of life people are ranking you compared to them based on your skill sets in what ever category means the most to them. When trying to meet women, and establish attraction, all seduction books talk about subtly name dropping interesting fact. ALL YOUR DOING is naming skills you have and displaying your capability in them. The women will only be attracted if she gives a shit about your skill AND the skill level you&amp;#39;ve demsontrated. This starts the informal leadership chain, because you may be able to provide your strength to what she desires to be her strength, in short, your 8 in traveling can really teach her or even deliver her the  6 she&amp;#39;s been looking for because she&amp;#39;s been stuck at a 4. And travelling is super important to her! This is the same for men and women. Furthermore, they need to know your better than them in order to give you their compliance. This is why RP says you must read, grow, never stop learning. This is why seduction preaches, if you want a in shape girl, you&amp;#39;d better be in shape yourself or better. You must be better in the skills that matter the most to that given group (or just 1 additional person) and that given time for that given crisis/challenge or what matters most to them.&lt;/p&gt;\n\n&lt;p&gt;Leadership skills traverse all areas of skill sets that could be challenged, because it teaches how to organize all your grouls strengths in synergy that makes the group more effective than just 1 guy being super good at a skill. &lt;/p&gt;\n\n&lt;p&gt;An example is saying your terrible at skiing but you organize trips to ski and have staff that teaches how to ski all the way up to super advanced Nintendo level shit. It&amp;#39;s all non-profit and doesn&amp;#39;t earn you a penny. I don&amp;#39;t give a fuck who your talking to, if skiing matters to them, your leadership skill just gave them a boner over any individual skill you could have. It also compensated your lack of skiing ability akin to using a sledge hammer on a finishing nail.&lt;/p&gt;\n\n&lt;p&gt;The only way to control anyone or any group when your constantly being tested as the informal leader in all areas in life, is to demonstrate your skills, and have the balls to show and say when you disagree. If you are in fact most skilled, you may not be chosen as the leader temporarily, but as time progresses and you stay your course, NEVER FOLLOWING THE HERD TO FAILURE AND NEVER FEELING BAD FOR IT, you will find the rest of the group grows quickly tired of losing and will see your success and elect you as replacement. &lt;/p&gt;\n\n&lt;p&gt;Watch ANY scary movie ever about a group of people facing a moster/killer clowns/ anything... This ALWAYS happens. And Hollywood is simply replaying a natural occurence, sometimes saterically, as you will probably start seeing now you should have some AM regarding this topic and will see play out in your jobs everyday. &lt;/p&gt;\n\n&lt;p&gt;In my masters we have group challenges, and I rarely start off trying to volly for leadership in the group... I used to go in swinging my dick trying to make my self leader. I am way smarter than most people, I rarely fail... why the fuck not. Never worked! Always seen as an asshole, slightly ignored and we failed in predivtable ways. So, now I force myself to stay totally at one with what I believe the situation to be, and the path that should be taken. Never compromise to group social dynamics instead I plainly state my true beliefs of the consequences of the paths different members wish to travel. If we head down the wrong path, I allow the group to suffer their consequential failure, meanwhile I begin to work alone. When the group begins getting frustrated I show my superior work and it immediately earns the informal leadership I need. Only then can I delegate, direct, control. I have the social skills needed to know how to make people feel good about being led... so I know what is needed to keep their favor, even make them feel rewarded for being submissive, and it&amp;#39;s much, much more than &amp;quot;your so good at that&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;At home I quit trying to dictate what should be done... I have no formal authority. I simply state what it is I am going to do, and naturally my path is full of intrinsic and extrinsic reward for anyone who follows it, so my SO follows naturally now, because she enjoys the benefit despite the hard work. But it took leadership training to learn how to maintain motivation in delegation once compliance has been given.  &lt;/p&gt;\n\n&lt;p&gt;The ultimate way you control, is being the best when it counts, TRUSTING you are the best despite group pressure, being forward and honest and tactful in your opinions, and NEVER letting yourself fail with the herd EVER. Split long enough to show success and when the herd sees it, they will follow. &lt;/p&gt;\n\n&lt;p&gt;If your assertive but your skills actually suck, you will be cast as the worst beta there is, really the omega. If you try to lead to success and you drive straight to failure... but you were in fact the very best to lead, the task was inurmountable... The group usually knows this and forgives you. If you weren&amp;#39;t the most fit to lead, and you did... You will be hated. Hence why formal leaders can be turned on so quickly. They may not be the best fit for the role, and failure comes with  quick boot by the group. This is true abandonment. &lt;/p&gt;\n\n&lt;p&gt;In everyday life I have learned to know when I am or am not the best to lead in a task. If I&amp;#39;m not, I follow the best I can. If I am, I don&amp;#39;t tell people what to do, I tell them what I am going to do, why I&amp;#39;m going to do it... and due to me being the best, no one usually comes up with a better plan, so they realize I&amp;#39;m the guy who will give them the success they want. Then the power is mine.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "First, I truly believe if you aren't incorporating reading material such as the 7 habits of highly effective people, or think and grow rich, or any other book aimed at leadership skills, you are handicapping your progress toward being the alpha of alphas. Here's why, and the key to controlling others. \n\nPreface: it's vital to understand basic almost instinctual social dynamics of groups to understand how they elect leaders and willingly give their power and control to those leaders even when that leader may not have any authority over them at all. Then learning how that leader got his position as leader vs follower is critical to know for each of you to understand your own path to control, and how that leadership is maintained is the obvious next skill level needed to maintain this power. We will assume, no member of society in any part of this world, is ok with their free will being stripped from them.\n\nWe also assume you are trying to control 1 or more people other than yourself.\n\nThere is a model I'd like to use for examples sake that teaches people follow a pattern when first meeting that leads to the creation of a cohesive group. If all 4 steps are not taken, the group will not form and failure is likely. These steps are:\n\nForming - understanding the members in the group\n\nStorming - dominance and submission actions leading to pecking order \n\nNorming - group pecking order set and roles divided, tasks assigned and performance begins \n\nPerforming - cohesion of tasks leads to success\n\nThe progress and success of this group hinges upon a proper pecking order being set up, at which the group synergistically is more capable than the capability of the leader on their own. If the leader has excellent leadership skills, those also count toward his unique skill as a leader and the group would need to capitalize on those as well, still only being a bit better. The more people, the bigger the gap between his capability and the total capability of the group.\n\nThe group may not stay moving from one to the next step successfully, they may bounce back to a previous step and reflow. This costs short term progress, but in the mix of things may make longer term benefits. \n\nNow we've tackled a very simplified version of group dynamics Let's talk authority figures.\n\nFirst, there are generally two types of authority that lends control to you. Formal and informal authority. \n\nFormal authority - in some way you have been given the ability of control with authorized consequences that can be disposed of at your desire. This may include paperwork, legal consequences, removal of physical control from an individual (handcuffs, jail, etc), remove source of resources  (firing an employee, payroll deduction), physical pain infliction (spanking your child) ect. \n\nThis is sanctioned by those with more authority than you, and your power is derived strictly from their power and delegated responsibility. Should the higher power deem you no longer fit, your authority is removed. State taking your children away, you being fired from a manager position, a cop losing his badge, ect. \n\nThis authority is limited to the power of the black and white print that gave you the power in the first place. Most importantly psychologically people see you in that position of power and likely have dehumanized you in that role. You don't give a shit who wrote the constitution, a cops name, the personality of the guy in HR who hired you, or what not. You just know and understand there are rules and enforcers. The key here is the rules that govern are the very same that give the power to those officials. \n\nIn a upperlevel leadership mentality, we call these simply managers. You are managing your rules given your role. \n\nThese people ultimately have the authority to tell other what to do, and if they don't comply, face unpleasant  consequences. They can, and do at times, strip you of your free will.\n\nInformal -  we'll call these leaders. This is a authority that is given by the popularity of a given group. This may even be given begrudgingly by some members who disagree but succumb to social dynamics and ultimately peer pressure. In every movie or show where there is a gaggle of random people faced with a random crisis or challenge we see the informal leaders emerge. They are the ones each individual groul member has determined to be better at a skill that will lead to success, than thay member is. Which skill will lead to success? That is in the eye of the beholder. The one who gets elected informal leader has higher skill capability on average for the group in areas that the group on average have determined to be vital for the win/success/safety ect. \n\nThe informal leader usually goes through a series of group fitness tests before being chosen. The type of fit test is given usually on an individual basis where 1 member challenges another directly. They will usually challenge for 2 reasons/ways:\n\n1. the way that is actually subcommunicating their own most weak insecure place, they want to see if the new alphas skills can compensate for with the alphas strength in that skill \n2. I think my skill strength is stronger than yours and were going to find out\n\nSome examples and explanation of the subcommunication:\n\nExample:The all famous shit test by women\n\nSub-com: how much do you really believe your method/idea/gut is right? I am insecure about the future of this and I need to know you aren't going to let me down.\n\nExample: The person who offers only more problems to any solution you have, never coming up with their own(the troll/whiney bitch/male shit test) \n\nSub-com: I am very insecure, I'm going to bombard you with things to try and make you insecure in your plan to see if it works. If my tactic works, you don't have what is needed to make me feel safe, you must be wrong, I will not follow you. If trolling  doesn't work on you, I have vented my insecurity and you're frame is strong enough I can step in it and will emotionally be able to follow you but logically I will remain skeptical. \n\nExample: another person who seems to troll you but has real solutions instead of just problems\n\nSub-comm: I don't believe you are as equipped to handle this as I am, I must show this publicly and gain favor. If I am to survive, we need to use my skills because they are the best for this situation. \n\nNow, as the members who are vollying for the leadership role, they usually must past social, intellectual, and sometimes physical fitness tests distributed at lightening speed by the members of the group. This is where informal leaders are born. \n\nGiven you've put in the diligence in your social training, and leadership training, you know how to handle each of those fit tests flawlessly... you know how to handle the female shit test, AA. The whiny bitch, you resist the urge to shame him into non-existence and instead delegate to him the role of devil's advocate, you've just given him a position (that shows you have delagative authority even if you dont) and the guy that may be more intelligent than you, let's say he is, you control him by giving him praise for his great ideas, give him authority to speak and be heard, and show approval. \n\nAgain, generally the person who can past the most types of fit tests, physical, social, intelligence, will be deemed the informal leader over the group, because the group will instinctively and subconsciously listen more closely to what that person says and does.\n Please note: The group pays attention to what he says he believes, and what he does, NOT what he tells them to believe or tells them to do!\n\n It is only through his passing of these fitness tests that he earns the trust of each individual on a case by case basis, that he is superior to them, and they will give their conformity to his desire, of their own free will. And as more and more people do this, a momentum builds based on social conventions that we all know such as, the higher the total number of people like something the more valuable it becomes on average, ect. \n\nAsk any CEO or manager who is worth their weight in salt, and they will confirm and in fact novels upon novels have been written on this next point. The formal leader must also simultaneously earned himself the role as the informal leader to truly have ultimate power. Should he not, he is at risk of being overthrown by the informal leader and the people that follow that informal leader. However, at all times, the informal leader must never act as a formal leader unless specifically given that role by the people he leads through their election, or support in overthrowing the current formal leader. If he attempts being the formal leader and begins trying to control the actions of another without that explicit voiced approval, he will find he is trying to force their compliance against their free will, and the consequences are terrible on the individual basis. Moreover, and worse of all, the group will see the potential for their own free will to be stripped in the same way and likely will stop supporting this member. \n\nAnd this is the big finally. In everyday context, you are NOT a formal leader, if you are, it's in a very specific role. All other roles, you lose that authority. We talk shit tests from women. We talk shit tests in general. In all walks of life people are ranking you compared to them based on your skill sets in what ever category means the most to them. When trying to meet women, and establish attraction, all seduction books talk about subtly name dropping interesting fact. ALL YOUR DOING is naming skills you have and displaying your capability in them. The women will only be attracted if she gives a shit about your skill AND the skill level you've demsontrated. This starts the informal leadership chain, because you may be able to provide your strength to what she desires to be her strength, in short, your 8 in traveling can really teach her or even deliver her the  6 she's been looking for because she's been stuck at a 4. And travelling is super important to her! This is the same for men and women. Furthermore, they need to know your better than them in order to give you their compliance. This is why RP says you must read, grow, never stop learning. This is why seduction preaches, if you want a in shape girl, you'd better be in shape yourself or better. You must be better in the skills that matter the most to that given group (or just 1 additional person) and that given time for that given crisis/challenge or what matters most to them.\n\n Leadership skills traverse all areas of skill sets that could be challenged, because it teaches how to organize all your grouls strengths in synergy that makes the group more effective than just 1 guy being super good at a skill. \n\nAn example is saying your terrible at skiing but you organize trips to ski and have staff that teaches how to ski all the way up to super advanced Nintendo level shit. It's all non-profit and doesn't earn you a penny. I don't give a fuck who your talking to, if skiing matters to them, your leadership skill just gave them a boner over any individual skill you could have. It also compensated your lack of skiing ability akin to using a sledge hammer on a finishing nail.\n\n\nThe only way to control anyone or any group when your constantly being tested as the informal leader in all areas in life, is to demonstrate your skills, and have the balls to show and say when you disagree. If you are in fact most skilled, you may not be chosen as the leader temporarily, but as time progresses and you stay your course, NEVER FOLLOWING THE HERD TO FAILURE AND NEVER FEELING BAD FOR IT, you will find the rest of the group grows quickly tired of losing and will see your success and elect you as replacement. \n\nWatch ANY scary movie ever about a group of people facing a moster/killer clowns/ anything... This ALWAYS happens. And Hollywood is simply replaying a natural occurence, sometimes saterically, as you will probably start seeing now you should have some AM regarding this topic and will see play out in your jobs everyday. \n\nIn my masters we have group challenges, and I rarely start off trying to volly for leadership in the group... I used to go in swinging my dick trying to make my self leader. I am way smarter than most people, I rarely fail... why the fuck not. Never worked! Always seen as an asshole, slightly ignored and we failed in predivtable ways. So, now I force myself to stay totally at one with what I believe the situation to be, and the path that should be taken. Never compromise to group social dynamics instead I plainly state my true beliefs of the consequences of the paths different members wish to travel. If we head down the wrong path, I allow the group to suffer their consequential failure, meanwhile I begin to work alone. When the group begins getting frustrated I show my superior work and it immediately earns the informal leadership I need. Only then can I delegate, direct, control. I have the social skills needed to know how to make people feel good about being led... so I know what is needed to keep their favor, even make them feel rewarded for being submissive, and it's much, much more than \"your so good at that\". \n\nAt home I quit trying to dictate what should be done... I have no formal authority. I simply state what it is I am going to do, and naturally my path is full of intrinsic and extrinsic reward for anyone who follows it, so my SO follows naturally now, because she enjoys the benefit despite the hard work. But it took leadership training to learn how to maintain motivation in delegation once compliance has been given.  \n\nThe ultimate way you control, is being the best when it counts, TRUSTING you are the best despite group pressure, being forward and honest and tactful in your opinions, and NEVER letting yourself fail with the herd EVER. Split long enough to show success and when the herd sees it, they will follow. \n\nIf your assertive but your skills actually suck, you will be cast as the worst beta there is, really the omega. If you try to lead to success and you drive straight to failure... but you were in fact the very best to lead, the task was inurmountable... The group usually knows this and forgives you. If you weren't the most fit to lead, and you did... You will be hated. Hence why formal leaders can be turned on so quickly. They may not be the best fit for the role, and failure comes with  quick boot by the group. This is true abandonment. \n\nIn everyday life I have learned to know when I am or am not the best to lead in a task. If I'm not, I follow the best I can. If I am, I don't tell people what to do, I tell them what I am going to do, why I'm going to do it... and due to me being the best, no one usually comes up with a better plan, so they realize I'm the guy who will give them the success they want. Then the power is mine.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Red Pill Theory", "id": "65qla7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 38, "report_reasons": null, "author": "kendallb183", "saved": false, "mod_reports": [], "name": "t3_65qla7", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": false, "link_flair_css_class": "theory", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheRedPill/comments/65qla7/how_to_control_others/", "num_reports": null, "locked": false, "stickied": false, "created": 1492396154.0, "url": "https://www.reddit.com/r/TheRedPill/comments/65qla7/how_to_control_others/", "author_flair_text": null, "quarantine": false, "title": "How to control others", "created_utc": 1492367354.0, "distinguished": null, "media": null, "upvote_ratio": 0.8, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 38}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qla7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qla7", "likes": null, "replies": "", "user_reports": [], "id": "dgcfhf4", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "kendallb183", "parent_id": "t1_dgcf0di", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "You did good suming up one of the concepts in here, you seemed to miss a bunch of others though... If that's all you got out of this, maybe you should reread it? Maybe you can put a better TLDR that covers the other concepts too, up to you, it's your RP education. Glad you got something out of it though", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You did good suming up one of the concepts in here, you seemed to miss a bunch of others though... If that&amp;#39;s all you got out of this, maybe you should reread it? Maybe you can put a better TLDR that covers the other concepts too, up to you, it&amp;#39;s your RP education. Glad you got something out of it though&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgcfhf4", "score_hidden": false, "stickied": false, "created": 1492398734.0, "created_utc": 1492369934.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcf0di", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Newtothiz", "parent_id": "t3_65qla7", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "TLDR If you want to be a leader be good at what it's needed and don't shove it in people faces.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;TLDR If you want to be a leader be good at what it&amp;#39;s needed and don&amp;#39;t shove it in people faces.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgcf0di", "score_hidden": false, "stickied": false, "created": 1492398114.0, "created_utc": 1492369314.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qla7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qla7", "likes": null, "replies": "", "user_reports": [], "id": "dgd29nm", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "TRPLeader", "parent_id": "t1_dgczapa", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Your number one priority should be nice to yourself first.\n\nIf you have respect for yourself, and some one shit talks you, keep your shit together and say something genuine like, \"Nice shirt.\" This will demonstrate a lot more than getting into some lame war. The exception is if the transgression is grevious. Then you shit all over them; if someone disses you or says something which is genuinely inappropriate, you say, \"What the fuck is your problem man? You think that shit is funny? Go home, you obviously missed nap time.\" \n\nMachiaveli says \"men should either be carressed or eliminated.\"  Either you give a pass, like you would a child, or you destroy them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your number one priority should be nice to yourself first.&lt;/p&gt;\n\n&lt;p&gt;If you have respect for yourself, and some one shit talks you, keep your shit together and say something genuine like, &amp;quot;Nice shirt.&amp;quot; This will demonstrate a lot more than getting into some lame war. The exception is if the transgression is grevious. Then you shit all over them; if someone disses you or says something which is genuinely inappropriate, you say, &amp;quot;What the fuck is your problem man? You think that shit is funny? Go home, you obviously missed nap time.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Machiaveli says &amp;quot;men should either be carressed or eliminated.&amp;quot;  Either you give a pass, like you would a child, or you destroy them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgd29nm", "score_hidden": false, "stickied": false, "created": 1492429436.0, "created_utc": 1492400636.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qla7", "likes": null, "replies": "", "user_reports": [], "id": "dgd2oxx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kendallb183", "parent_id": "t1_dgczapa", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The idea is you don't shit on them or their ideas. You realize your entitled to your opinion and it may differ. \n\nA position of true power is simply \"I respectfully disagree\" or \"I can't stop you but I won't be able to join you in doing that plan\". \n\nAgain, if you are actually the less skilled person, then this is a dumb move. Pride for the sake of winning some pissing match isn't leadership. Real leaders know when to follow. But if you clearly know your right, being true to that knowledge and belief in a respectful way will show social skill and intellect while also establishing your own confidence. You knowing your going to do what needs to be done for your own survival will lead to the group or person seeing and potentially jumping ship to join, potentially not... but either way you win, which is what's important. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The idea is you don&amp;#39;t shit on them or their ideas. You realize your entitled to your opinion and it may differ. &lt;/p&gt;\n\n&lt;p&gt;A position of true power is simply &amp;quot;I respectfully disagree&amp;quot; or &amp;quot;I can&amp;#39;t stop you but I won&amp;#39;t be able to join you in doing that plan&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Again, if you are actually the less skilled person, then this is a dumb move. Pride for the sake of winning some pissing match isn&amp;#39;t leadership. Real leaders know when to follow. But if you clearly know your right, being true to that knowledge and belief in a respectful way will show social skill and intellect while also establishing your own confidence. You knowing your going to do what needs to be done for your own survival will lead to the group or person seeing and potentially jumping ship to join, potentially not... but either way you win, which is what&amp;#39;s important. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgd2oxx", "score_hidden": false, "stickied": false, "created": 1492430103.0, "created_utc": 1492401303.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qla7", "likes": null, "replies": "", "user_reports": [], "id": "dge98nw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Z33ger", "parent_id": "t1_dgczapa", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Learn how to talk shit so when you get roasted it doesn't fucking matter", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Learn how to talk shit so when you get roasted it doesn&amp;#39;t fucking matter&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dge98nw", "score_hidden": false, "stickied": false, "created": 1492497957.0, "created_utc": 1492469157.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qla7", "likes": null, "replies": "", "user_reports": [], "id": "dgedqcj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "trippinallday", "parent_id": "t1_dgczapa", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Be an asshole but be laid back and always have a smile on your face, along with agree and amplify. Don't go at people constantly but every once in a while with a smile on your face. They'll know you're just playing but at the same will feel insecure to some degree. \n\n\nIf they try to criticize you just agree with them or take it one step further and laugh. They won't get a reaction and you're roasting yourself so they'll probably never mention it again. As long as you don't show weakness you'll be able to chill. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Be an asshole but be laid back and always have a smile on your face, along with agree and amplify. Don&amp;#39;t go at people constantly but every once in a while with a smile on your face. They&amp;#39;ll know you&amp;#39;re just playing but at the same will feel insecure to some degree. &lt;/p&gt;\n\n&lt;p&gt;If they try to criticize you just agree with them or take it one step further and laugh. They won&amp;#39;t get a reaction and you&amp;#39;re roasting yourself so they&amp;#39;ll probably never mention it again. As long as you don&amp;#39;t show weakness you&amp;#39;ll be able to chill. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgedqcj", "score_hidden": false, "stickied": false, "created": 1492503767.0, "created_utc": 1492474967.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgczapa", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "_MysticFox", "parent_id": "t3_65qla7", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "How do you establish the pecking order? I always end up at the bottom.\n\nHere's the issue:\n\n1) You're kind to everyone, you get shit on\n2) You shit on others, you get labeled an asshole and open the door to get roasted without remorse\n\nHow do you compromise?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How do you establish the pecking order? I always end up at the bottom.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s the issue:&lt;/p&gt;\n\n&lt;p&gt;1) You&amp;#39;re kind to everyone, you get shit on\n2) You shit on others, you get labeled an asshole and open the door to get roasted without remorse&lt;/p&gt;\n\n&lt;p&gt;How do you compromise?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgczapa", "score_hidden": false, "stickied": false, "created": 1492425181.0, "created_utc": 1492396381.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qla7", "likes": null, "replies": "", "user_reports": [], "id": "dgd1qs1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TRPLeader", "parent_id": "t3_65qla7", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Enjoyed your post. Excellent ideas and examples. Loved your sub-comm explanations. Very helpful.\n\nChallenging to read through, but interesting.\n\nAs a man who has actively practiced leadership for 13 years, I see three types of leadership:\n\n1) Following the will of the group: Planning that skiing trip. Or. Was at pool few days ago. Approached girl, she was with fiance and I was with friend. We agreed to join tables. I said, to fiance, \"Why don't you go tell the bar were joining tables,\" and to my friend \"and why don't you grab our coats.\" Then I told her to help me set up the table. She recognized leadership, saying, \"I like how in charge you are.\" All I was doing was making what we wanted to happen happen (joining tables), but I laid out the plan of action and assigned roles (leadership). Notice, I asked the men, not demanded of them.\n\n2) Lead by offering value. Example would be saying you are going to get something to eat and leaving. 80% of the time people will just follow you.  Was at the bar the other day and girl was with a group of 5 friends.  She said, \"I'm hungry. I'm going to get food,\" and walked out. Her friends were like, \"I guess we're leaving\" and stumbled to follow after. I will frequently tell women, \"I'm going to get a coffee, walk with me.\"  Whether they want to stay with you or want to get a coffee, you have set action on it's course. In this case, the action was not in the mind of the party, you created it.\n\n3) Orders during emergencies. If some one is freaking out, especially during and emergency, giving direct, simple and clear orders. Example, during and injury at previous job, a young girl was freaking out; literally in the fetal position due to the sight of a co-workers blood. I gave her very clear and easy instructions to get papertowels, etc.  I find this is the same sort of frame as when I am first interacting with women, or if we are having a new experience. Has anyone tried to have a girl cook with them? Single step directions are a must.\n\nIn one the instructions were questions (why don't you...), in two it is about habing them follow you and three is the only situation I will actually bark orders. Maybe they are stressed, but, as it applies to TRP, I find 3 is my default way of effectively communicating with women towards whom I am sexual.\n\nAre you able to elaborate more on your structure of Forming, Storming, Norming &amp; Performing, please?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Enjoyed your post. Excellent ideas and examples. Loved your sub-comm explanations. Very helpful.&lt;/p&gt;\n\n&lt;p&gt;Challenging to read through, but interesting.&lt;/p&gt;\n\n&lt;p&gt;As a man who has actively practiced leadership for 13 years, I see three types of leadership:&lt;/p&gt;\n\n&lt;p&gt;1) Following the will of the group: Planning that skiing trip. Or. Was at pool few days ago. Approached girl, she was with fiance and I was with friend. We agreed to join tables. I said, to fiance, &amp;quot;Why don&amp;#39;t you go tell the bar were joining tables,&amp;quot; and to my friend &amp;quot;and why don&amp;#39;t you grab our coats.&amp;quot; Then I told her to help me set up the table. She recognized leadership, saying, &amp;quot;I like how in charge you are.&amp;quot; All I was doing was making what we wanted to happen happen (joining tables), but I laid out the plan of action and assigned roles (leadership). Notice, I asked the men, not demanded of them.&lt;/p&gt;\n\n&lt;p&gt;2) Lead by offering value. Example would be saying you are going to get something to eat and leaving. 80% of the time people will just follow you.  Was at the bar the other day and girl was with a group of 5 friends.  She said, &amp;quot;I&amp;#39;m hungry. I&amp;#39;m going to get food,&amp;quot; and walked out. Her friends were like, &amp;quot;I guess we&amp;#39;re leaving&amp;quot; and stumbled to follow after. I will frequently tell women, &amp;quot;I&amp;#39;m going to get a coffee, walk with me.&amp;quot;  Whether they want to stay with you or want to get a coffee, you have set action on it&amp;#39;s course. In this case, the action was not in the mind of the party, you created it.&lt;/p&gt;\n\n&lt;p&gt;3) Orders during emergencies. If some one is freaking out, especially during and emergency, giving direct, simple and clear orders. Example, during and injury at previous job, a young girl was freaking out; literally in the fetal position due to the sight of a co-workers blood. I gave her very clear and easy instructions to get papertowels, etc.  I find this is the same sort of frame as when I am first interacting with women, or if we are having a new experience. Has anyone tried to have a girl cook with them? Single step directions are a must.&lt;/p&gt;\n\n&lt;p&gt;In one the instructions were questions (why don&amp;#39;t you...), in two it is about habing them follow you and three is the only situation I will actually bark orders. Maybe they are stressed, but, as it applies to TRP, I find 3 is my default way of effectively communicating with women towards whom I am sexual.&lt;/p&gt;\n\n&lt;p&gt;Are you able to elaborate more on your structure of Forming, Storming, Norming &amp;amp; Performing, please?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgd1qs1", "score_hidden": false, "stickied": false, "created": 1492428651.0, "created_utc": 1492399851.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qla7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qla7", "likes": null, "replies": "", "user_reports": [], "id": "dgcsu47", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dantheredman61", "parent_id": "t1_dgcl8vv", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I came back to read it, this post is pretty comprehensive on the subject. The best leaders lead by example and not by talking. Place value on taking action, not talking about it! That being said, I'm off here and getting back to work..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I came back to read it, this post is pretty comprehensive on the subject. The best leaders lead by example and not by talking. Place value on taking action, not talking about it! That being said, I&amp;#39;m off here and getting back to work..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgcsu47", "score_hidden": false, "stickied": false, "created": 1492416472.0, "created_utc": 1492387672.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcl8vv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65qla7", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgcl8vv", "score_hidden": false, "stickied": false, "created": 1492406234.0, "created_utc": 1492377434.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65qla7", "likes": null, "replies": "", "user_reports": [], "id": "dgclinu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Edmondfromchateaudif", "parent_id": "t3_65qla7", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Your title is very misleading. \n\nLeadership is not controlling, management is.\n\nYou post has valuable insights, however what I gained from this is that leadership is earned, not given and that lack of control IS control (this is evident in the content here as mate-guarding).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your title is very misleading. &lt;/p&gt;\n\n&lt;p&gt;Leadership is not controlling, management is.&lt;/p&gt;\n\n&lt;p&gt;You post has valuable insights, however what I gained from this is that leadership is earned, not given and that lack of control IS control (this is evident in the content here as mate-guarding).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgclinu", "score_hidden": false, "stickied": false, "created": 1492406579.0, "created_utc": 1492377779.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]