[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Summary:&lt;/strong&gt; Successful player lifestyle is as much about taking chances as noticing... and creating them. You can&amp;#39;t have a lot of women in your bed without having a lot of them around you.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Life gives you &lt;strong&gt;a lot of opportunities&lt;/strong&gt;. It&amp;#39;s impossible to take all of them all the time but you have to create a habit of trying to use them. If you act more than stay passive you can achieve a lot. You can accomplish even more if you - also habitually - live your life in a way that creates &lt;strong&gt;endless opportunities&lt;/strong&gt; all around you.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Know What You Want&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;You should know &lt;strong&gt;when you like a girl&lt;/strong&gt;. If long, thin legs and slim girls give you a boner then you will notice them from far away and you should have no doubts as to whether you should approach or not. The same goes with facial features, the way she dresses and everything that you can guess at first sight.&lt;/p&gt;\n\n&lt;p&gt;You should also be honest with yourself. If you are into particular type of girls then don&amp;#39;t listen to others - go for them. At the same time, *&lt;em&gt;don&amp;#39;t ignore girls that you really, really want *&lt;/em&gt;but for some weird reason you think they&amp;#39;re not for you. Go with your primal instincts as it makes everything easier in the long run.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Notice The Chances&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;You should know when a girl likes you. &lt;strong&gt;The signs&lt;/strong&gt; are usually pretty clear and you&amp;#39;ve seen them many times. Even if she&amp;#39;s just a tease - you at least should notice that she&amp;#39;s inviting you for something. It&amp;#39;s your job to find out what it is.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not only talking about &lt;strong&gt;IOIs&lt;/strong&gt; - Indicators Of Interests - that the girls will display when they try to make you notice them. Those can be as subtle as longing looks or fine smiles. But there are more.&lt;/p&gt;\n\n&lt;p&gt;There are times when a girl gives you clear signs that she&amp;#39;s interested. You know them - she spends much more time around you that is expected for a given activity, she blatantly stares at you, she touches you a lot by accident, etc. You should be able to &lt;strong&gt;recognize those as what they are&lt;/strong&gt;. Most of the girls aren&amp;#39;t as open or brave as to approaching you.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Take The Chances&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Ahh, the good old &lt;strong&gt;leap of faith&lt;/strong&gt;. When you notice any indicator of interest or even a faint suggestion that the girl might be into you - approach her immediately. It&amp;#39;s the first step into everything else. &lt;/p&gt;\n\n&lt;p&gt;Even if the girl is just okay, even if you did zero approaches that day - do something. For the sake of cultivating that habit and reinforcing your reflexes. Because you&amp;#39;re &amp;quot;that guy&amp;quot; who pick up all the girls around you.&lt;/p&gt;\n\n&lt;p&gt;Big problem with seasoned daygamers is that they tend to approach girls only in their &lt;strong&gt;familiar environment&lt;/strong&gt;, on the streets, malls, bus stops or wherever you usually pick up girls. They are experts in noticing signs that a girl is interested in them and yet they fail to act when it happens outside their daygame watch. Your first instinct should always be to open that girl.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Create The Chances&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;All that brings us back to creating the chances. If you spend your whole life around other guys doing manly things and working hard on developing yourself then you will be disappointed with the &lt;strong&gt;number of girls&lt;/strong&gt; that you will meet. Men&amp;#39;s and women&amp;#39;s interests differ greatly. Sometimes you won&amp;#39;t even see a single cool chick doing things that you fancy. Bummer.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Cool hobbies&lt;/strong&gt; are great but they rarely draw the attention of girls. They like to listen about them for sure but not necessarily experience them firsthand. So never pick up a hobby to impress girls or to meet them via that activity. Do them for yourself, to live a better life.&lt;/p&gt;\n\n&lt;p&gt;You have to &lt;strong&gt;create the chances&lt;/strong&gt;. If you&amp;#39;re dead set on doing that &amp;quot;socially&amp;quot; then don&amp;#39;t get excited about activities that don&amp;#39;t guarantee you presence of girls that are approachable. And even if they do, you have to approach anytime you&amp;#39;ll find someone that you find attractive because it will still be uncommon.&lt;/p&gt;\n\n&lt;p&gt;Or just do whatever the hell you want socially and stick to game. That&amp;#39;s a valid strategy if you&amp;#39;re living in a big city. It&amp;#39;s an unlimited source of new, hot girls. If you want to have even more choices then combine those two. But never expect that you&amp;#39;ll get stable source of new leads outside some sort of &amp;quot;game&amp;quot; (day or night or net).&lt;/p&gt;\n\n&lt;p&gt;You have to both &lt;strong&gt;create and take your chances&lt;/strong&gt; when it comes to pickup. Not only put yourself in a position to meet a lot of hot girls but also actually approach them. This is the difference between having something and nothing. Window of opportunity isn&amp;#39;t opened forever. Act.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Lessons (re)learned:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Grasp your opportunities. You&amp;#39;ll regret if you don&amp;#39;t.&lt;/li&gt;\n&lt;li&gt;Be certain what you want, so you won&amp;#39;t miss your chances.&lt;/li&gt;\n&lt;li&gt;Err on the side of being optimistic. Assume she wants you to approach her.&lt;/li&gt;\n&lt;li&gt;Live your life so you actually have occasions to meet girls. Don&amp;#39;t be a hermit.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;If you want to read more about struggles of fellow daygamers visit &lt;a href=\"https://tddaygame.com/blog/\"&gt;my daygame blog&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**Summary:** Successful player lifestyle is as much about taking chances as noticing... and creating them. You can't have a lot of women in your bed without having a lot of them around you.\n\n&amp;nbsp;\n\nLife gives you **a lot of opportunities**. It's impossible to take all of them all the time but you have to create a habit of trying to use them. If you act more than stay passive you can achieve a lot. You can accomplish even more if you - also habitually - live your life in a way that creates **endless opportunities** all around you.\n\n&amp;nbsp;\n\n**Know What You Want**\n\n&amp;nbsp;\n\nYou should know **when you like a girl**. If long, thin legs and slim girls give you a boner then you will notice them from far away and you should have no doubts as to whether you should approach or not. The same goes with facial features, the way she dresses and everything that you can guess at first sight.\n\nYou should also be honest with yourself. If you are into particular type of girls then don't listen to others - go for them. At the same time, **don't ignore girls that you really, really want **but for some weird reason you think they're not for you. Go with your primal instincts as it makes everything easier in the long run.\n\n&amp;nbsp;\n\n**Notice The Chances**\n\n&amp;nbsp;\n\nYou should know when a girl likes you. **The signs** are usually pretty clear and you've seen them many times. Even if she's just a tease - you at least should notice that she's inviting you for something. It's your job to find out what it is.\n\nI'm not only talking about **IOIs** - Indicators Of Interests - that the girls will display when they try to make you notice them. Those can be as subtle as longing looks or fine smiles. But there are more.\n\nThere are times when a girl gives you clear signs that she's interested. You know them - she spends much more time around you that is expected for a given activity, she blatantly stares at you, she touches you a lot by accident, etc. You should be able to **recognize those as what they are**. Most of the girls aren't as open or brave as to approaching you.\n\n&amp;nbsp;\n\n**Take The Chances**\n\n&amp;nbsp;\n\nAhh, the good old **leap of faith**. When you notice any indicator of interest or even a faint suggestion that the girl might be into you - approach her immediately. It's the first step into everything else. \n\nEven if the girl is just okay, even if you did zero approaches that day - do something. For the sake of cultivating that habit and reinforcing your reflexes. Because you're \"that guy\" who pick up all the girls around you.\n\nBig problem with seasoned daygamers is that they tend to approach girls only in their **familiar environment**, on the streets, malls, bus stops or wherever you usually pick up girls. They are experts in noticing signs that a girl is interested in them and yet they fail to act when it happens outside their daygame watch. Your first instinct should always be to open that girl.\n\n&amp;nbsp;\n\n**Create The Chances**\n\n&amp;nbsp;\n\nAll that brings us back to creating the chances. If you spend your whole life around other guys doing manly things and working hard on developing yourself then you will be disappointed with the **number of girls** that you will meet. Men's and women's interests differ greatly. Sometimes you won't even see a single cool chick doing things that you fancy. Bummer.\n\n**Cool hobbies** are great but they rarely draw the attention of girls. They like to listen about them for sure but not necessarily experience them firsthand. So never pick up a hobby to impress girls or to meet them via that activity. Do them for yourself, to live a better life.\n\nYou have to **create the chances**. If you're dead set on doing that \"socially\" then don't get excited about activities that don't guarantee you presence of girls that are approachable. And even if they do, you have to approach anytime you'll find someone that you find attractive because it will still be uncommon.\n\nOr just do whatever the hell you want socially and stick to game. That's a valid strategy if you're living in a big city. It's an unlimited source of new, hot girls. If you want to have even more choices then combine those two. But never expect that you'll get stable source of new leads outside some sort of \"game\" (day or night or net).\n\nYou have to both **create and take your chances** when it comes to pickup. Not only put yourself in a position to meet a lot of hot girls but also actually approach them. This is the difference between having something and nothing. Window of opportunity isn't opened forever. Act.\n\n&amp;nbsp;\n\n**Lessons (re)learned:**\n\n* Grasp your opportunities. You'll regret if you don't.\n* Be certain what you want, so you won't miss your chances.\n* Err on the side of being optimistic. Assume she wants you to approach her.\n* Live your life so you actually have occasions to meet girls. Don't be a hermit.\n\n&amp;nbsp;\n\nIf you want to read more about struggles of fellow daygamers visit [my daygame blog](https://tddaygame.com/blog/).\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Red Pill Theory", "id": "65v3io", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 42, "report_reasons": null, "author": "tddaygame", "saved": false, "mod_reports": [], "name": "t3_65v3io", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": false, "link_flair_css_class": "theory", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheRedPill/comments/65v3io/opportunities_recognize_them_act_on_them_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492458906.0, "url": "https://www.reddit.com/r/TheRedPill/comments/65v3io/opportunities_recognize_them_act_on_them_and/", "author_flair_text": null, "quarantine": false, "title": "Opportunities - Recognize Them, Act On Them And Create Them", "created_utc": 1492430106.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 42}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65v3io", "likes": null, "replies": "", "user_reports": [], "id": "dgdhse8", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "readordie13", "parent_id": "t3_65v3io", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Great post, definitely agree with the 3rd point on being optimistic (to some degree, there is a balance). In my opinion if someone is not optimistic in any form, that can keep them from approaching a girl in the first place. Correct me if I'm wrong but I'm sure everyone here has had their mind lie and say \"no way that girl is into me, she's too hot\" Fuck that, we will never know if we don't try. Mentality I always adopt is hope for the best and prepare for the worst. If it works out great, have fun and enjoy the process. If rejected, learn and move on to the next and stay optimistic cause gold will be struck at some point. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post, definitely agree with the 3rd point on being optimistic (to some degree, there is a balance). In my opinion if someone is not optimistic in any form, that can keep them from approaching a girl in the first place. Correct me if I&amp;#39;m wrong but I&amp;#39;m sure everyone here has had their mind lie and say &amp;quot;no way that girl is into me, she&amp;#39;s too hot&amp;quot; Fuck that, we will never know if we don&amp;#39;t try. Mentality I always adopt is hope for the best and prepare for the worst. If it works out great, have fun and enjoy the process. If rejected, learn and move on to the next and stay optimistic cause gold will be struck at some point. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgdhse8", "score_hidden": false, "stickied": false, "created": 1492465622.0, "created_utc": 1492436822.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65v3io", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65v3io", "likes": null, "replies": "", "user_reports": [], "id": "dgedqlc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MrAnderzon", "parent_id": "t1_dgdzvs6", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Where's this film you speak of film maker", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where&amp;#39;s this film you speak of film maker&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgedqlc", "score_hidden": false, "stickied": false, "created": 1492503776.0, "created_utc": 1492474976.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzvs6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pras", "parent_id": "t3_65v3io", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "I am a film maker. I was making a short film about eye contact and flirting. I auditioned 4 female-male pairs for these roles.\nOne of the women got so turned on by the male actor during the audition, he didn't see it and I re channeled it towards us. She invited me for coffee thereafter but I was so busy I couldn't follow up. She tried again but I was travelling. Then I moved away....too bad. It was so hot.\n\nI have used this a few times now. I just discovered this by accident and how palpably powerful it can be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am a film maker. I was making a short film about eye contact and flirting. I auditioned 4 female-male pairs for these roles.\nOne of the women got so turned on by the male actor during the audition, he didn&amp;#39;t see it and I re channeled it towards us. She invited me for coffee thereafter but I was so busy I couldn&amp;#39;t follow up. She tried again but I was travelling. Then I moved away....too bad. It was so hot.&lt;/p&gt;\n\n&lt;p&gt;I have used this a few times now. I just discovered this by accident and how palpably powerful it can be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgdzvs6", "score_hidden": false, "stickied": false, "created": 1492486853.0, "created_utc": 1492458053.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65v3io", "likes": null, "replies": "", "user_reports": [], "id": "dgdzylu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PM-ME-SMTH-UNIQUE", "parent_id": "t3_65v3io", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Know what you want - unless your type is illegal, than don't", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Know what you want - unless your type is illegal, than don&amp;#39;t&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgdzylu", "score_hidden": false, "stickied": false, "created": 1492486941.0, "created_utc": 1492458141.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]