[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Essay&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://therationalmale.com/2017/04/17/blue-pill-conditioning-and-equalism/\"&gt;https://therationalmale.com/2017/04/17/blue-pill-conditioning-and-equalism/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Excerpt:&lt;/p&gt;\n\n&lt;p&gt;Exactly so and very important. The feminist fallacy of “interchangeable” leads to this. The mental habit some men have of projecting themselves onto others, believing “Well, I’m like this, so everyone else must be also” leads to this. It is extremely frustrating to encounter female behavior that is so obviously stupid it is like catching someone peeing in the kitchen sink.&lt;/p&gt;\n\n&lt;p&gt;Many betaized men will put up with bad behavior for far too long, then have a major blowout of anger and expect behavioral change. That doesn’t work with toddlers or dogs or women. Constant, low key, correction does work. Neuroplasticity points to a “why”; daily reiteration of a desired habit works better than once per week, etc.&lt;/p&gt;\n\n&lt;p&gt;It’s important to recognize the difference between real introspection and brooding or ruminating, too. Some women will brood over wrongs done but not connect that up with their own behavior. That’s not introspection. That’s not “failure analysis”. That’s rewiring neural pathways to perpetual resentment.&lt;/p&gt;\n\n&lt;p&gt;It is extremely difficult for an equalist, betaized man to accept the fact that women want and need to be dominated, because they for sure would hate and resent that. It is even worse for the churchgoing men, because the equalist chant from the conservative feminists in churches is almost always slathered with a layer of “sisterly love”.&lt;/p&gt;\n\n&lt;p&gt;What Anon is driving at here is my second point in Blue Pill and Red Pill men understanding the depth of their conditioning. Equalism and feminism depend on interchangeability. In order for little girls to grow up to be anything they want to be there must be an agreed upon “level playing field” from a socio-sexual point of view. This means that if little girls want to grow up to become football players and little boys want to grow up to be prima ballerinas there (at least ostensibly) must be an agreed upon equalist environment in which this can happen.&lt;/p&gt;\n\n&lt;p&gt;The egalitarian ideal the Blue Pill conditions us to believe is possible presumes there is a mutually agreeable state of intersexual equality. In reality this state is entirely contradictory to our evolved sexual strategies and our biological realities, but in theory, an egalitarian ideal can only exist in an environment that is deemed equal by both men and women. If such a state were possible, if evolved influences of our biological realities for both sexes were non-factors, then this state would also presume a mutual interchangeability between the sexes.&lt;/p&gt;\n\n&lt;p&gt;The combination of our equalist conditioning and this interchangeability is the root of much of the dysfunction we see between men and women today. Because we are taught all-is-one, because we presume we’re all the same except for the plumbing, there is also a presumption of uniformity of purpose between the sexes. Equalism is really just the religion of the Feminine Imperative, but it hides behind this feminine-primary advertising that men and women are playing by a mutually agreed upon set of rules, striving for mutually agreed (Blue Pill) goals and all in spite of our natural predilection or any competitiveness. No other social condition in the history of mankind could place women in a more socially controlling position than Hypergamy excused by equalism.&lt;/p&gt;\n\n&lt;p&gt;In such a state women can mandate their unilateral control over Hypergamy, but there is one downside – men expect a mutual interchangeability. Blue Pill men actually expect women to play by that mutuality of purpose. That’s the interchange. Women will still ensure that optimizing Hypergamy is the prime directive, and they’ll hide behind equalism to keep men in check and absolve themselves of the worst of their predations in doing so, but men still expect women to feel as men do. Blue Pill men believe that women can and will love them in an idealized way that runs contrary to their Hypergamous opportunism. Why? Because they were conditioned to believe, from a very early age, that interchangeability exists between men and women.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Essay\n\nhttps://therationalmale.com/2017/04/17/blue-pill-conditioning-and-equalism/\n\nExcerpt:\n\nExactly so and very important. The feminist fallacy of “interchangeable” leads to this. The mental habit some men have of projecting themselves onto others, believing “Well, I’m like this, so everyone else must be also” leads to this. It is extremely frustrating to encounter female behavior that is so obviously stupid it is like catching someone peeing in the kitchen sink.\n\nMany betaized men will put up with bad behavior for far too long, then have a major blowout of anger and expect behavioral change. That doesn’t work with toddlers or dogs or women. Constant, low key, correction does work. Neuroplasticity points to a “why”; daily reiteration of a desired habit works better than once per week, etc.\n\nIt’s important to recognize the difference between real introspection and brooding or ruminating, too. Some women will brood over wrongs done but not connect that up with their own behavior. That’s not introspection. That’s not “failure analysis”. That’s rewiring neural pathways to perpetual resentment.\n\nIt is extremely difficult for an equalist, betaized man to accept the fact that women want and need to be dominated, because they for sure would hate and resent that. It is even worse for the churchgoing men, because the equalist chant from the conservative feminists in churches is almost always slathered with a layer of “sisterly love”.\n\nWhat Anon is driving at here is my second point in Blue Pill and Red Pill men understanding the depth of their conditioning. Equalism and feminism depend on interchangeability. In order for little girls to grow up to be anything they want to be there must be an agreed upon “level playing field” from a socio-sexual point of view. This means that if little girls want to grow up to become football players and little boys want to grow up to be prima ballerinas there (at least ostensibly) must be an agreed upon equalist environment in which this can happen.\n\nThe egalitarian ideal the Blue Pill conditions us to believe is possible presumes there is a mutually agreeable state of intersexual equality. In reality this state is entirely contradictory to our evolved sexual strategies and our biological realities, but in theory, an egalitarian ideal can only exist in an environment that is deemed equal by both men and women. If such a state were possible, if evolved influences of our biological realities for both sexes were non-factors, then this state would also presume a mutual interchangeability between the sexes.\n\nThe combination of our equalist conditioning and this interchangeability is the root of much of the dysfunction we see between men and women today. Because we are taught all-is-one, because we presume we’re all the same except for the plumbing, there is also a presumption of uniformity of purpose between the sexes. Equalism is really just the religion of the Feminine Imperative, but it hides behind this feminine-primary advertising that men and women are playing by a mutually agreed upon set of rules, striving for mutually agreed (Blue Pill) goals and all in spite of our natural predilection or any competitiveness. No other social condition in the history of mankind could place women in a more socially controlling position than Hypergamy excused by equalism.\n\nIn such a state women can mandate their unilateral control over Hypergamy, but there is one downside – men expect a mutual interchangeability. Blue Pill men actually expect women to play by that mutuality of purpose. That’s the interchange. Women will still ensure that optimizing Hypergamy is the prime directive, and they’ll hide behind equalism to keep men in check and absolve themselves of the worst of their predations in doing so, but men still expect women to feel as men do. Blue Pill men believe that women can and will love them in an idealized way that runs contrary to their Hypergamous opportunism. Why? Because they were conditioned to believe, from a very early age, that interchangeability exists between men and women.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Red Pill Theory", "id": "65yvii", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "Rollo-Tomassi", "saved": false, "mod_reports": [], "name": "t3_65yvii", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": false, "link_flair_css_class": "theory", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/TheRedPill/comments/65yvii/blue_pill_conditioning_and_equalism/", "num_reports": null, "locked": false, "stickied": false, "created": 1492497110.0, "url": "https://www.reddit.com/r/TheRedPill/comments/65yvii/blue_pill_conditioning_and_equalism/", "author_flair_text": "TheRationalMale.com", "quarantine": false, "title": "Blue Pill Conditioning and Equalism", "created_utc": 1492468310.0, "distinguished": null, "media": null, "upvote_ratio": 0.67, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65yvii", "likes": null, "replies": "", "user_reports": [], "id": "dgec34t", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "LastRevision", "parent_id": "t3_65yvii", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "The real outline of anything Feminist is to take the positives and hold on to them as \"just the way the world works\" while attempting to socially engineer any negatives in a never-ending push to minimize responsibility while maximizing entitlement. It's a natural tendency in a world where women are free from criticism, and permitted to make whatever demands they see fit in any given situation. \n\nWomen vilify the natural tendency of male sexuality favoring young, fit girls\"- ie \"real men like curves, mature, intelligent, strong/independent women\"- while rationalizing a man's biological tendency to be far more sympathetic toward women as \"the way things work.\"\n\nAnd this biological wiring makes a truly equal world impossible; how could it not? If a boss is too hard on a woman, he's seen as a bully. If a woman cries at work it's a \"get out of jail free\" card. A woman can play the scared, confused little girl in most any situation to emotionally manipulate a man into looking at her actions more favorably. Every woman knows the trick, they figured it out by playing their own fathers when they'd show up at home, after curfew, with grass stains on the butt of their blue jeans, and it's a lesson they'll never forget. \n\nNothing in nature is equal; nature is unforgivably fascist in that regard. Trying to impose equality between the sexes is ultimately impossible and only serves to exploit the group who is more rational, ethical, and empathetic- the same group naive enough to expect those same qualities be returned when provided in good faith. Compound this problem with the idea that a strong element of a [masculine](https://killtoparty.com/2015/05/09/masculinity-positive-masculinity-and-the-white-knight-as-a-perversion-of-masculinity/) identity is protecting women- it makes men feel good, valuable, and masculine to white knight; and it should. In a fair world, white knighting would be something truly admirable- but in our Alternative 1985, we know that it's unappreciated, low-value, and a trait for idiots and suckers... and what a sad state we're in for that to be the case.\n\nWomen are a social resource and female sexuality should be tightly contained for the most functional of civilizations; this is a small price to pay for the preferential treatment men give women. Women should have the responsibility of acting as the gatekeepers of male sexuality, and in return, men reciprocate by treating women like \"ladies\"; this is where white knighting comes from in the first place- the presumption that women are the \"gentler sex\" and need the protection of a man. A man's sex drive is far more pronounced than a woman's, and for good evolutionary reason, and so men need the stopgap of a woman making him \"work for it,\" or, in other words, be socially productive as a way to earn sexuality with achievements, career, and moral character. The modern sense of a man's way of earning sexuality is entirely backwards- essentially a race to be the biggest asshole. \n\nCivilization was build on the inequalities of men and women, and the idea that each sex has their own positive to accentuate and negatives to minimize, which each playing an integral role in maintaining our civilization for generations to come. The exploitative meme of equality, favoring the whims of female nature, is knocking over the dominoes which have been slowly and carefully set up for thousands of years, as a way to let women live out a theme-park like experience in their youth, while we burn the candle at both ends.   \n", "edited": 1492473088.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The real outline of anything Feminist is to take the positives and hold on to them as &amp;quot;just the way the world works&amp;quot; while attempting to socially engineer any negatives in a never-ending push to minimize responsibility while maximizing entitlement. It&amp;#39;s a natural tendency in a world where women are free from criticism, and permitted to make whatever demands they see fit in any given situation. &lt;/p&gt;\n\n&lt;p&gt;Women vilify the natural tendency of male sexuality favoring young, fit girls&amp;quot;- ie &amp;quot;real men like curves, mature, intelligent, strong/independent women&amp;quot;- while rationalizing a man&amp;#39;s biological tendency to be far more sympathetic toward women as &amp;quot;the way things work.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And this biological wiring makes a truly equal world impossible; how could it not? If a boss is too hard on a woman, he&amp;#39;s seen as a bully. If a woman cries at work it&amp;#39;s a &amp;quot;get out of jail free&amp;quot; card. A woman can play the scared, confused little girl in most any situation to emotionally manipulate a man into looking at her actions more favorably. Every woman knows the trick, they figured it out by playing their own fathers when they&amp;#39;d show up at home, after curfew, with grass stains on the butt of their blue jeans, and it&amp;#39;s a lesson they&amp;#39;ll never forget. &lt;/p&gt;\n\n&lt;p&gt;Nothing in nature is equal; nature is unforgivably fascist in that regard. Trying to impose equality between the sexes is ultimately impossible and only serves to exploit the group who is more rational, ethical, and empathetic- the same group naive enough to expect those same qualities be returned when provided in good faith. Compound this problem with the idea that a strong element of a &lt;a href=\"https://killtoparty.com/2015/05/09/masculinity-positive-masculinity-and-the-white-knight-as-a-perversion-of-masculinity/\"&gt;masculine&lt;/a&gt; identity is protecting women- it makes men feel good, valuable, and masculine to white knight; and it should. In a fair world, white knighting would be something truly admirable- but in our Alternative 1985, we know that it&amp;#39;s unappreciated, low-value, and a trait for idiots and suckers... and what a sad state we&amp;#39;re in for that to be the case.&lt;/p&gt;\n\n&lt;p&gt;Women are a social resource and female sexuality should be tightly contained for the most functional of civilizations; this is a small price to pay for the preferential treatment men give women. Women should have the responsibility of acting as the gatekeepers of male sexuality, and in return, men reciprocate by treating women like &amp;quot;ladies&amp;quot;; this is where white knighting comes from in the first place- the presumption that women are the &amp;quot;gentler sex&amp;quot; and need the protection of a man. A man&amp;#39;s sex drive is far more pronounced than a woman&amp;#39;s, and for good evolutionary reason, and so men need the stopgap of a woman making him &amp;quot;work for it,&amp;quot; or, in other words, be socially productive as a way to earn sexuality with achievements, career, and moral character. The modern sense of a man&amp;#39;s way of earning sexuality is entirely backwards- essentially a race to be the biggest asshole. &lt;/p&gt;\n\n&lt;p&gt;Civilization was build on the inequalities of men and women, and the idea that each sex has their own positive to accentuate and negatives to minimize, which each playing an integral role in maintaining our civilization for generations to come. The exploitative meme of equality, favoring the whims of female nature, is knocking over the dominoes which have been slowly and carefully set up for thousands of years, as a way to let women live out a theme-park like experience in their youth, while we burn the candle at both ends.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgec34t", "score_hidden": false, "stickied": false, "created": 1492501658.0, "created_utc": 1492472858.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]