[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "TheRedPill", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m completely new to this subreddit and to reddit in general, but a friend of mine suggested that I post here to see if you guys could help me with my current dilemma. \nSo I&amp;#39;m a d3 college athlete, and I happened to go to an off campus party a few months ago. Today I wake up and realize that I&amp;#39;ve been accused not only of sexual harassment, but of threatening to kill her as well. The thing is, when I went to that party I was completely blacked out, and now that its been some time, I barely remember any details.\nBut here are the details of the report: She is on another college sports team. Apparently I tried to put my arm around her which made her feel uncomfortable, and afterwards threatened to kill her. But here&amp;#39;s the fishy part: she claims that we played the same sport together in middle school and that she knew me since I was 12 years old. \nIssues with this: \n1. I know for a fact we never played the same sport together because I&amp;#39;m not soft enough to play with girls\n2. I actually don&amp;#39;t even know who this girl is, making her statement that she knew me since I was 12 really creepy\nI don&amp;#39;t remember seeing her at the party, I don&amp;#39;t remember talking to her at all, even once in my lifetime, and I definitely don&amp;#39;t remember touching her. I&amp;#39;m even doubtful of putting my arm around her, because I remember I had sex before I came to the party and was not looking for a hook up.\nI&amp;#39;ve already been interrogated, and basically admitted to underage drinking (they already confirmed this with other witnesses), and that I remember nothing about my conversation with this bitch.\nThey are going to continue with the interrogation, and then have a panel determine which violations I caused and what my punishment should be. I was told that I can email the director who is in charge of this investigation if I feel the need to tell him anything else.\nThoughts? Advice? Please help me, I have no idea what my punishment could be but I can&amp;#39;t get expelled. Thank you for your time.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm completely new to this subreddit and to reddit in general, but a friend of mine suggested that I post here to see if you guys could help me with my current dilemma. \nSo I'm a d3 college athlete, and I happened to go to an off campus party a few months ago. Today I wake up and realize that I've been accused not only of sexual harassment, but of threatening to kill her as well. The thing is, when I went to that party I was completely blacked out, and now that its been some time, I barely remember any details.\nBut here are the details of the report: She is on another college sports team. Apparently I tried to put my arm around her which made her feel uncomfortable, and afterwards threatened to kill her. But here's the fishy part: she claims that we played the same sport together in middle school and that she knew me since I was 12 years old. \nIssues with this: \n1. I know for a fact we never played the same sport together because I'm not soft enough to play with girls\n2. I actually don't even know who this girl is, making her statement that she knew me since I was 12 really creepy\nI don't remember seeing her at the party, I don't remember talking to her at all, even once in my lifetime, and I definitely don't remember touching her. I'm even doubtful of putting my arm around her, because I remember I had sex before I came to the party and was not looking for a hook up.\nI've already been interrogated, and basically admitted to underage drinking (they already confirmed this with other witnesses), and that I remember nothing about my conversation with this bitch.\nThey are going to continue with the interrogation, and then have a panel determine which violations I caused and what my punishment should be. I was told that I can email the director who is in charge of this investigation if I feel the need to tell him anything else.\nThoughts? Advice? Please help me, I have no idea what my punishment could be but I can't get expelled. Thank you for your time.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "", "id": "65z6ol", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "iamyeezusalmighty", "saved": false, "mod_reports": [], "name": "t3_65z6ol", "subreddit_name_prefixed": "r/TheRedPill", "approved_by": null, "over_18": false, "domain": "self.TheRedPill", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ve1u", "edited": false, "link_flair_css_class": "unflaired", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": true, "spoiler": false, "permalink": "/r/TheRedPill/comments/65z6ol/please_i_need_helpadvice/", "num_reports": null, "locked": false, "stickied": false, "created": 1492500473.0, "url": "https://www.reddit.com/r/TheRedPill/comments/65z6ol/please_i_need_helpadvice/", "author_flair_text": null, "quarantine": false, "title": "Please I need help/advice", "created_utc": 1492471673.0, "distinguished": null, "media": null, "upvote_ratio": 0.67, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65z6ol", "likes": null, "replies": "", "user_reports": [], "id": "dgebeh4", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Olongapo", "parent_id": "t3_65z6ol", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Lawyer. Now. Do not talk with anyone without representation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lawyer. Now. Do not talk with anyone without representation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgebeh4", "score_hidden": false, "stickied": false, "created": 1492500793.0, "created_utc": 1492471993.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65z6ol", "likes": null, "replies": "", "user_reports": [], "id": "dgeblkz", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "420KUSHBUSH", "parent_id": "t3_65z6ol", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "Lawyer asap. Tell them the whole truth and nothing but the truth. You're already presumed guilty so don't talk to anyone other than your lawyer. Best of luck amigo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lawyer asap. Tell them the whole truth and nothing but the truth. You&amp;#39;re already presumed guilty so don&amp;#39;t talk to anyone other than your lawyer. Best of luck amigo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgeblkz", "score_hidden": false, "stickied": false, "created": 1492501040.0, "created_utc": 1492472240.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ve1u", "removal_reason": null, "link_id": "t3_65z6ol", "likes": null, "replies": "", "user_reports": [], "id": "dgebzpx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "paintman1254", "parent_id": "t3_65z6ol", "subreddit_name_prefixed": "r/TheRedPill", "controversiality": 0, "body": "(Reposting without link to legaladvice per subreddit rules)\n\nThis subreddit is not the right place if you're serious and if you want to get advice. Go to legaladvice if you want real help.\n\nAlso, it's better if you try to build a timeline of what you know and don't write it as a narrative. Figure out if she went to middle school with you - don't write \"I'm not soft enough to play with girls\" as your defense... Also, having sex before going to a party doesn't prevent you from putting your arm around someone else (???). \n\nRight now it sounds like the accuser has witnesses? Do you have anyone who can back you up? If you're the only person on your side and you already admitted to blacking out, it doesn't look good; you'll need someone at the party who can support you or some good character witnesses.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(Reposting without link to legaladvice per subreddit rules)&lt;/p&gt;\n\n&lt;p&gt;This subreddit is not the right place if you&amp;#39;re serious and if you want to get advice. Go to legaladvice if you want real help.&lt;/p&gt;\n\n&lt;p&gt;Also, it&amp;#39;s better if you try to build a timeline of what you know and don&amp;#39;t write it as a narrative. Figure out if she went to middle school with you - don&amp;#39;t write &amp;quot;I&amp;#39;m not soft enough to play with girls&amp;quot; as your defense... Also, having sex before going to a party doesn&amp;#39;t prevent you from putting your arm around someone else (???). &lt;/p&gt;\n\n&lt;p&gt;Right now it sounds like the accuser has witnesses? Do you have anyone who can back you up? If you&amp;#39;re the only person on your side and you already admitted to blacking out, it doesn&amp;#39;t look good; you&amp;#39;ll need someone at the party who can support you or some good character witnesses.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "TheRedPill", "name": "t1_dgebzpx", "score_hidden": false, "stickied": false, "created": 1492501538.0, "created_utc": 1492472738.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]