[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "pokemon", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Info", "id": "64zxxl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 65, "report_reasons": null, "author": "JJAB91", "saved": false, "mod_reports": [], "name": "t3_64zxxl", "subreddit_name_prefixed": "r/pokemon", "approved_by": null, "over_18": false, "domain": "graphtv.kevinformatics.com", "hidden": false, "thumbnail": "default", "subreddit_id": "t5_2qmeb", "edited": false, "link_flair_css_class": "info", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/pokemon/comments/64zxxl/the_pokemon_anime_graphed_according_to_its_imdb/", "num_reports": null, "locked": false, "stickied": false, "created": 1492049870.0, "url": "http://graphtv.kevinformatics.com/tt0176385", "author_flair_text": null, "quarantine": false, "title": "The Pokemon anime graphed according to its IMDB ratings.", "created_utc": 1492021070.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 42, "visited": false, "subreddit_type": "public", "ups": 65}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg794ip", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mjangelvortex", "parent_id": "t1_dg78i6q", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "I can see what you mean and agree with you on those points. Plus it was very interesting to see his team take on two Legendaries even if he didn't win. But still, like the Kalos league, the final outcome was still rather frustrating. Just for different reasons. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can see what you mean and agree with you on those points. Plus it was very interesting to see his team take on two Legendaries even if he didn&amp;#39;t win. But still, like the Kalos league, the final outcome was still rather frustrating. Just for different reasons. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg794ip", "score_hidden": false, "stickied": false, "created": 1492094513.0, "created_utc": 1492065713.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg78i6q", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "legendarymoonrabbit", "parent_id": "t1_dg76yad", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "At least Ash managed to beat those two legendaries when nobody else could. Tobias was written specifically to shut down Ash, but at least Sinnoh's league provided some kind of emotional closure to the series when Ash managed to defeat Paul and vindicate his method of Trainership.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At least Ash managed to beat those two legendaries when nobody else could. Tobias was written specifically to shut down Ash, but at least Sinnoh&amp;#39;s league provided some kind of emotional closure to the series when Ash managed to defeat Paul and vindicate his method of Trainership.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg78i6q", "score_hidden": false, "stickied": false, "created": 1492092980.0, "created_utc": 1492064180.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg76yad", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "mjangelvortex", "parent_id": "t1_dg75nqp", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "&gt;Popular wisdom holds that Ash would never win a \"real league\" (Orange doesn't count lol), after he lost Kanto, Johto, Hoenn, Sinnoh, AND Unova. But this was acceptable as long as he was portrayed as a novice trainer, \n\nHe wasn't much of a novice in Sinnoh either but look what we got in that league: him getting beaten by some random asshole we've never met before who apparently had both a Darkrai and a Latios. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Popular wisdom holds that Ash would never win a &amp;quot;real league&amp;quot; (Orange doesn&amp;#39;t count lol), after he lost Kanto, Johto, Hoenn, Sinnoh, AND Unova. But this was acceptable as long as he was portrayed as a novice trainer, &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He wasn&amp;#39;t much of a novice in Sinnoh either but look what we got in that league: him getting beaten by some random asshole we&amp;#39;ve never met before who apparently had both a Darkrai and a Latios. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg76yad", "score_hidden": false, "stickied": false, "created": 1492089607.0, "created_utc": 1492060807.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg7nikb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jimmycruiser", "parent_id": "t1_dg75nqp", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "The only thing that could redeem Ash losing to Alain (in my eyes) is if Ash wins the Alola League in the anime. Because in the games you become the first ever champion of Alola upon defeating Kukui, so I feel like it would be very fitting if Ash became the first champion of a region. \n\n(Lol we know the writers will never let that happen though. Ash will always lose )", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only thing that could redeem Ash losing to Alain (in my eyes) is if Ash wins the Alola League in the anime. Because in the games you become the first ever champion of Alola upon defeating Kukui, so I feel like it would be very fitting if Ash became the first champion of a region. &lt;/p&gt;\n\n&lt;p&gt;(Lol we know the writers will never let that happen though. Ash will always lose )&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg7nikb", "score_hidden": false, "stickied": false, "created": 1492124036.0, "created_utc": 1492095236.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg75nqp", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "legendarymoonrabbit", "parent_id": "t1_dg6j7tr", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "In broad strokes, the episode that infuriated the fandom like nothing else could.\n\n**TL:DR** fans felt bamboozled when all the buildup throughout the season plausibly hinted at Ash winning the league, only for him to lose in the final in a way that was dissonant with the overall series. Butthurt and saltiness briefly took over the fandom.\n\n/r/pokemon and the fandom in general is less prone to outrage and far more easygoing than most other fanbases. But this event probably struck at every fan, new or old, casual or engaged, each in their own way.\n\nPopular wisdom holds that Ash would never win a \"real league\" (Orange doesn't count lol), after he lost Kanto, Johto, Hoenn, Sinnoh, AND Unova. But this was acceptable as long as he was portrayed as a novice trainer, or later on, he overcame a personal rival during the league. At least this would give him a moral win before bowing out of the league. It was one of the pillars of the \"formula\". Each and every region journey series would follow a few common main plot points and themes which would rinse and repeat with every new region.\n\nAs the show progressed, the rivals became more complicated, and Ash would get his rare moments of actual long-term character development when he overcame his rival once and for all at the league. Ash would lose the league, yeah, but beating the rival would be a good way to cap off the journey through the region. It served to wrap up character development for the main characters before going off each their own way in the denouement. This served as a good, logical narrative ending event for each series.\n\nIn comes XY and Alain. After the ~~tepig~~ tepidly received BW series, Ash and Pikachu were once again portrayed as competent, and were given interesting travelling companions. Overall quality of writing and animation went way up, and the general sentiment, even here on this subreddit was that XY captured some of the nostalgic magic of the original series but in a functional, modern form. There was enough of the old familiar themes mixed with new things to interest new and old fans.\n\nBut the old story elements gradually evolved in a direction that was exciting to both long-term fans and viewers returning for the first time since OS/Johto/whenever. Long-time assumptions about the show were overturned, and improved on the \"formula\" that had been going on since the first episode. Ash actually wins his battles using strategy and skill! A girl actually crushes on Ash! And not just any girl, it's the travelling companion! Serena, Clemont and Bonnie actually have friendship chemistry with Ash and actually act like best friends! Bonnie isn't annoying like Max and is actually funny and endearing! The show manages to balance humor and serious themes! (an example being an episode with Espurr coping with death and loss)\n\nBut throughout all this change, there was this sense of anticipation: would this be the series where the last \"taboo\" of the anime be broken? Would Ash finally win a league? The writers certainly hinted at it. They built up Ash's pokemon team and his relationship with his pokemon like never before. There was a greater emphasis on how Ash and his team were actually good at battling and in tune with each other (so much that Greninja took on a new form when synchronized with Ash), and not winning all their battles with deus ex machina or power of friendship codswallop.\n\nThe league rival, Alain, was also built up over the course of the whole series. He got his own parallel episodes following his story. He was a Mega Evolution trainer that was stronger than Ash, someone to look up to a be a goal to reach. Alain's story was also heavily intertwined with Ash's plotline with Ash's Greninja, a non-Pikachu team member with more character focus and development than any other pokemon.\n\nThe direction of the show heading into the final buildup was that the old formula was being transformed into something new, and that all the old assumptions were being knocked down one by one. Ash had not yet managed to defeat Alain, but his pokemon were strong (ridiculously so) and he was getting ever closer to pushing the limits of his bond with Greninja. Ash even managed to reach the FINALS, something he was always prevented from doing by (Charizard being a jerk, Darkrai ex Machina). The showdown between Ash-Greninja and Alain's Mega Charizard X would be the confrontation to wrap up the rivalry plot thread and most importantly the Bond Phenomenon storyline which had become the main focus of Ash's character development for all of XYZ.\n\nAnd then Ash lost.\n\nIn the end, the truism of Ash never winning the League overcame everything else. Even the narrative build-up of overcoming the rival was thrown away. They even managed to make Ash's Greninja lose to a move with type disadvantage. They took a species beloved by the fandom, Charizard, and used its almost Mary-Sue like Mega Form to thwart the built up expectations of the fandom. All of Ash, Pikachu and Greninja's struggles meant nothing in the end. The league became a sour end to an otherwise cherished series.\n\nSo why did I bother writing all this? It was interesting to see at the time how the fandom reacted. In a subreddit usually filled with positivity and cordiality (good job, mods!), suddenly the mood shifted (thankfully it wasn't permanent). There had been such a renewal of interest in the anime due to the anticipation that Ash might finally win a league after all this time that even those who had long since stopped watching felt they could cheer him on, only to be disappointed. People were outraged, people pilloried Mega Charizard and Alain (who was otherwise fairly liked before the incident), people memed about blast burn. It was the first and only time since discovering Pokemon in 1999 that I witnessed such a large group of Pokemon fans be so emotionally invested and directed in unified anger towards something. Yet it showed that the fandom is still thriving, and can maintain a positive tone, and that overall, the XY/XYZ series was a success as it helped a greater portion of the fanbase to feel something about the anime again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In broad strokes, the episode that infuriated the fandom like nothing else could.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL:DR&lt;/strong&gt; fans felt bamboozled when all the buildup throughout the season plausibly hinted at Ash winning the league, only for him to lose in the final in a way that was dissonant with the overall series. Butthurt and saltiness briefly took over the fandom.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"/r/pokemon\"&gt;/r/pokemon&lt;/a&gt; and the fandom in general is less prone to outrage and far more easygoing than most other fanbases. But this event probably struck at every fan, new or old, casual or engaged, each in their own way.&lt;/p&gt;\n\n&lt;p&gt;Popular wisdom holds that Ash would never win a &amp;quot;real league&amp;quot; (Orange doesn&amp;#39;t count lol), after he lost Kanto, Johto, Hoenn, Sinnoh, AND Unova. But this was acceptable as long as he was portrayed as a novice trainer, or later on, he overcame a personal rival during the league. At least this would give him a moral win before bowing out of the league. It was one of the pillars of the &amp;quot;formula&amp;quot;. Each and every region journey series would follow a few common main plot points and themes which would rinse and repeat with every new region.&lt;/p&gt;\n\n&lt;p&gt;As the show progressed, the rivals became more complicated, and Ash would get his rare moments of actual long-term character development when he overcame his rival once and for all at the league. Ash would lose the league, yeah, but beating the rival would be a good way to cap off the journey through the region. It served to wrap up character development for the main characters before going off each their own way in the denouement. This served as a good, logical narrative ending event for each series.&lt;/p&gt;\n\n&lt;p&gt;In comes XY and Alain. After the &lt;del&gt;tepig&lt;/del&gt; tepidly received BW series, Ash and Pikachu were once again portrayed as competent, and were given interesting travelling companions. Overall quality of writing and animation went way up, and the general sentiment, even here on this subreddit was that XY captured some of the nostalgic magic of the original series but in a functional, modern form. There was enough of the old familiar themes mixed with new things to interest new and old fans.&lt;/p&gt;\n\n&lt;p&gt;But the old story elements gradually evolved in a direction that was exciting to both long-term fans and viewers returning for the first time since OS/Johto/whenever. Long-time assumptions about the show were overturned, and improved on the &amp;quot;formula&amp;quot; that had been going on since the first episode. Ash actually wins his battles using strategy and skill! A girl actually crushes on Ash! And not just any girl, it&amp;#39;s the travelling companion! Serena, Clemont and Bonnie actually have friendship chemistry with Ash and actually act like best friends! Bonnie isn&amp;#39;t annoying like Max and is actually funny and endearing! The show manages to balance humor and serious themes! (an example being an episode with Espurr coping with death and loss)&lt;/p&gt;\n\n&lt;p&gt;But throughout all this change, there was this sense of anticipation: would this be the series where the last &amp;quot;taboo&amp;quot; of the anime be broken? Would Ash finally win a league? The writers certainly hinted at it. They built up Ash&amp;#39;s pokemon team and his relationship with his pokemon like never before. There was a greater emphasis on how Ash and his team were actually good at battling and in tune with each other (so much that Greninja took on a new form when synchronized with Ash), and not winning all their battles with deus ex machina or power of friendship codswallop.&lt;/p&gt;\n\n&lt;p&gt;The league rival, Alain, was also built up over the course of the whole series. He got his own parallel episodes following his story. He was a Mega Evolution trainer that was stronger than Ash, someone to look up to a be a goal to reach. Alain&amp;#39;s story was also heavily intertwined with Ash&amp;#39;s plotline with Ash&amp;#39;s Greninja, a non-Pikachu team member with more character focus and development than any other pokemon.&lt;/p&gt;\n\n&lt;p&gt;The direction of the show heading into the final buildup was that the old formula was being transformed into something new, and that all the old assumptions were being knocked down one by one. Ash had not yet managed to defeat Alain, but his pokemon were strong (ridiculously so) and he was getting ever closer to pushing the limits of his bond with Greninja. Ash even managed to reach the FINALS, something he was always prevented from doing by (Charizard being a jerk, Darkrai ex Machina). The showdown between Ash-Greninja and Alain&amp;#39;s Mega Charizard X would be the confrontation to wrap up the rivalry plot thread and most importantly the Bond Phenomenon storyline which had become the main focus of Ash&amp;#39;s character development for all of XYZ.&lt;/p&gt;\n\n&lt;p&gt;And then Ash lost.&lt;/p&gt;\n\n&lt;p&gt;In the end, the truism of Ash never winning the League overcame everything else. Even the narrative build-up of overcoming the rival was thrown away. They even managed to make Ash&amp;#39;s Greninja lose to a move with type disadvantage. They took a species beloved by the fandom, Charizard, and used its almost Mary-Sue like Mega Form to thwart the built up expectations of the fandom. All of Ash, Pikachu and Greninja&amp;#39;s struggles meant nothing in the end. The league became a sour end to an otherwise cherished series.&lt;/p&gt;\n\n&lt;p&gt;So why did I bother writing all this? It was interesting to see at the time how the fandom reacted. In a subreddit usually filled with positivity and cordiality (good job, mods!), suddenly the mood shifted (thankfully it wasn&amp;#39;t permanent). There had been such a renewal of interest in the anime due to the anticipation that Ash might finally win a league after all this time that even those who had long since stopped watching felt they could cheer him on, only to be disappointed. People were outraged, people pilloried Mega Charizard and Alain (who was otherwise fairly liked before the incident), people memed about blast burn. It was the first and only time since discovering Pokemon in 1999 that I witnessed such a large group of Pokemon fans be so emotionally invested and directed in unified anger towards something. Yet it showed that the fandom is still thriving, and can maintain a positive tone, and that overall, the XY/XYZ series was a success as it helped a greater portion of the fanbase to feel something about the anime again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg75nqp", "score_hidden": false, "stickied": false, "created": 1492087349.0, "created_utc": 1492058549.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg6kfns", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "MedievalLulz", "parent_id": "t1_dg6j7tr", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "It's the episode where Ash loses Kalos.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s the episode where Ash loses Kalos.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6kfns", "score_hidden": false, "stickied": false, "created": 1492060183.0, "created_utc": 1492031383.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg77er9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "mjangelvortex", "parent_id": "t1_dg72vgv", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "[Your point in video form.](https://www.youtube.com/watch?v=lv7c_RgQLAU)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=lv7c_RgQLAU\"&gt;Your point in video form.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg77er9", "score_hidden": false, "stickied": false, "created": 1492090536.0, "created_utc": 1492061736.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg72vgv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "WinnerWake", "parent_id": "t1_dg6q0to", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "Doragon cro!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Doragon cro!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg72vgv", "score_hidden": false, "stickied": false, "created": 1492083075.0, "created_utc": 1492054275.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6q0to", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "vukov", "parent_id": "t1_dg6mztf", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "IKU ZE vs. BURASTO BAAN", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;IKU ZE vs. BURASTO BAAN&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6q0to", "score_hidden": false, "stickied": false, "created": 1492066970.0, "created_utc": 1492038170.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mztf", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "Ardub23", "parent_id": "t1_dg6mgue", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "No no, it's not water vs fire, it's water versus BURASTO BURN", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No no, it&amp;#39;s not water vs fire, it&amp;#39;s water versus BURASTO BURN&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6mztf", "score_hidden": false, "stickied": false, "created": 1492063210.0, "created_utc": 1492034410.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg76r7g", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mjangelvortex", "parent_id": "t1_dg6mgue", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "People keep bringing this up but if we were to get technical, Greninja didn't have an advantage typing wise since Mega Charizard X's Dragon Typing cancels out the Water Type weakness it would normally have when it's not Mega Evolved.\n\nThat being said, I'm still salty at the outcome. Storytelling wise it would have been more fulfilling to have Greninja beat Charizard, especially since Alain had already beaten Ash in a previous battle.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People keep bringing this up but if we were to get technical, Greninja didn&amp;#39;t have an advantage typing wise since Mega Charizard X&amp;#39;s Dragon Typing cancels out the Water Type weakness it would normally have when it&amp;#39;s not Mega Evolved.&lt;/p&gt;\n\n&lt;p&gt;That being said, I&amp;#39;m still salty at the outcome. Storytelling wise it would have been more fulfilling to have Greninja beat Charizard, especially since Alain had already beaten Ash in a previous battle.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg76r7g", "score_hidden": false, "stickied": false, "created": 1492089234.0, "created_utc": 1492060434.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mgue", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "sudo-woodo", "parent_id": "t1_dg6j7tr", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "water vs fire... which has the advantage??", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;water vs fire... which has the advantage??&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6mgue", "score_hidden": false, "stickied": false, "created": 1492062573.0, "created_utc": 1492033773.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg7mbi4", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Eona_Targaryen", "parent_id": "t1_dg7l9pc", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "It's fairly well known that Ash has never won a league, it's made fun of quite a bit on the internet. I don't see anything wrong with my comment, even if I didn't give a detailed explanation on why this particular loss was so bad.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s fairly well known that Ash has never won a league, it&amp;#39;s made fun of quite a bit on the internet. I don&amp;#39;t see anything wrong with my comment, even if I didn&amp;#39;t give a detailed explanation on why this particular loss was so bad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg7mbi4", "score_hidden": false, "stickied": false, "created": 1492122652.0, "created_utc": 1492093852.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7l9pc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "XNautPhD", "parent_id": "t1_dg6kevr", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "He said he hasn't watched *SINCE* Johto.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He said he hasn&amp;#39;t watched &lt;em&gt;SINCE&lt;/em&gt; Johto.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg7l9pc", "score_hidden": false, "stickied": false, "created": 1492121401.0, "created_utc": 1492092601.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6kevr", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "Eona_Targaryen", "parent_id": "t1_dg6j7tr", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "-_- It's the Kalos league finale.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;-_- It&amp;#39;s the Kalos league finale.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6kevr", "score_hidden": false, "stickied": false, "created": 1492060159.0, "created_utc": 1492031359.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6j7tr", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "JJAB91", "parent_id": "t1_dg6e8lc", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "I haven't watched since Johto, why do you say that?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t watched since Johto, why do you say that?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6j7tr", "score_hidden": false, "stickied": false, "created": 1492058833.0, "created_utc": 1492030033.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6e8lc", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "MedievalLulz", "parent_id": "t3_64zxxl", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "\"Down to the Fiery Finish\" is the lowest-ranked XYZ episode.\n\nWhy does this not surprise me?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Down to the Fiery Finish&amp;quot; is the lowest-ranked XYZ episode.&lt;/p&gt;\n\n&lt;p&gt;Why does this not surprise me?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6e8lc", "score_hidden": false, "stickied": false, "created": 1492053709.0, "created_utc": 1492024909.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg78in4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PTGigi", "parent_id": "t1_dg77cnk", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "It's been awhile since I last watched the older seasons of the anime, but I can definitely recall what you mean! I didn't skip any episodes (because what if something important happens!?) but I definitely wish I did for some episodes, haha. \n\n(also nice flair, haha ;D)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s been awhile since I last watched the older seasons of the anime, but I can definitely recall what you mean! I didn&amp;#39;t skip any episodes (because what if something important happens!?) but I definitely wish I did for some episodes, haha. &lt;/p&gt;\n\n&lt;p&gt;(also nice flair, haha ;D)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg78in4", "score_hidden": false, "stickied": false, "created": 1492093008.0, "created_utc": 1492064208.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg7g5dk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Viroro", "parent_id": "t1_dg7fssj", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "I *love* Paul's concept as the antithesis of Ash and he's a great foil and rival (while I like Alain's foil relationship with Ash too, I personally saw him as less of a rival and more of a worthy opponent considering only Sawyer got the 'rival battle' and 'rival showdown'-style titles in japanese), but I honestly feel a more balanced view of how he raises Pokémon and the fact he did treat Chimchar horribly being addressed better would've improved his character way more than what we actually got. Yes, you can argue the Pokémon he discarded defeating him can count as comeuppance, but I also feel Infernape went too much on a rampage in that battle and robbed the rest of the team of many chances to shine (alongside not liking how Paul used an almost completely new team, including *not using his starter*, which came across as a way to show that he lost because he didn't use his 'best team'). I've heard often that Atsuhiro Tomioka had taken a shine on Paul and became a bit his pet character, and I honestly think it's pretty obvious at some points, including how apparently Paul got perfectly 'friendly' with Ash after losing despite treating him like garbage constantly throughout Sinnoh and the only hint of any respect coming when he heard that Ash beat Pyramid King Brandon (for a split second) and when he revealed to have adopted Counter-Shield as well literally during their last battle.", "edited": 1492088234.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I &lt;em&gt;love&lt;/em&gt; Paul&amp;#39;s concept as the antithesis of Ash and he&amp;#39;s a great foil and rival (while I like Alain&amp;#39;s foil relationship with Ash too, I personally saw him as less of a rival and more of a worthy opponent considering only Sawyer got the &amp;#39;rival battle&amp;#39; and &amp;#39;rival showdown&amp;#39;-style titles in japanese), but I honestly feel a more balanced view of how he raises Pokémon and the fact he did treat Chimchar horribly being addressed better would&amp;#39;ve improved his character way more than what we actually got. Yes, you can argue the Pokémon he discarded defeating him can count as comeuppance, but I also feel Infernape went too much on a rampage in that battle and robbed the rest of the team of many chances to shine (alongside not liking how Paul used an almost completely new team, including &lt;em&gt;not using his starter&lt;/em&gt;, which came across as a way to show that he lost because he didn&amp;#39;t use his &amp;#39;best team&amp;#39;). I&amp;#39;ve heard often that Atsuhiro Tomioka had taken a shine on Paul and became a bit his pet character, and I honestly think it&amp;#39;s pretty obvious at some points, including how apparently Paul got perfectly &amp;#39;friendly&amp;#39; with Ash after losing despite treating him like garbage constantly throughout Sinnoh and the only hint of any respect coming when he heard that Ash beat Pyramid King Brandon (for a split second) and when he revealed to have adopted Counter-Shield as well literally during their last battle.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg7g5dk", "score_hidden": false, "stickied": false, "created": 1492113806.0, "created_utc": 1492085006.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7fssj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mjangelvortex", "parent_id": "t1_dg7edkq", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "Oh yeah I feel the exact same way, especially in regards to Paul. Don't get me wrong, he was a great rival for Ash because he challenged Ash both in battle and in raising Pokemon (plus personality wise he was a pretty good foil compared to him as well). But at the same time I didn't care how he pretty much got the [Karma Houndini](http://tvtropes.org/pmwiki/pmwiki.php/Main/KarmaHoudini) treatment in regards to how he abused Chimchar. And it kind of got rather annoying to see so many characters praise him in spite of his horrible treatment of Chimchar. I mean, I can understand Paul's brother giving him sort of a pass since they're family but Brock, Barry, and even Cynthia were just praising him. Brock praising him pissed me off the most because unlike the others, he witnessed the cruel things Paul did. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh yeah I feel the exact same way, especially in regards to Paul. Don&amp;#39;t get me wrong, he was a great rival for Ash because he challenged Ash both in battle and in raising Pokemon (plus personality wise he was a pretty good foil compared to him as well). But at the same time I didn&amp;#39;t care how he pretty much got the &lt;a href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/KarmaHoudini\"&gt;Karma Houndini&lt;/a&gt; treatment in regards to how he abused Chimchar. And it kind of got rather annoying to see so many characters praise him in spite of his horrible treatment of Chimchar. I mean, I can understand Paul&amp;#39;s brother giving him sort of a pass since they&amp;#39;re family but Brock, Barry, and even Cynthia were just praising him. Brock praising him pissed me off the most because unlike the others, he witnessed the cruel things Paul did. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg7fssj", "score_hidden": false, "stickied": false, "created": 1492113103.0, "created_utc": 1492084303.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7edkq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Viroro", "parent_id": "t1_dg77cnk", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "Yeah, this is one reason why I honestly prefer XY to DP, while the latter is definitely an excellent show while I watched it at the time the filler killed most of the interest even with the occasional fun or well-done one, especially due to some blatantly recycled plots (the Pika and Goliath episode as a reharsh of Lt. Surge, the episode where Dustox leaves being a more tragic take on Bye Bye Butterfree) and also how for how competent Ash was he *did* lose a lot, and I didn't like how by the halfway point of the show Paul started to be treated way too well compared to how he acted, and that *Ash* was the one that apparently had to accept that Paul had a different training style which I honestly don't feel works well when he was horribly emotionally abusive to Chimchar. That said, in hindsight I can definitely see a lot of things DP did well and do appreciate it more than when I first watched it, but I personally prefer XY because it was more consistent in pacing and quality compared to DP.", "edited": 1492085152.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, this is one reason why I honestly prefer XY to DP, while the latter is definitely an excellent show while I watched it at the time the filler killed most of the interest even with the occasional fun or well-done one, especially due to some blatantly recycled plots (the Pika and Goliath episode as a reharsh of Lt. Surge, the episode where Dustox leaves being a more tragic take on Bye Bye Butterfree) and also how for how competent Ash was he &lt;em&gt;did&lt;/em&gt; lose a lot, and I didn&amp;#39;t like how by the halfway point of the show Paul started to be treated way too well compared to how he acted, and that &lt;em&gt;Ash&lt;/em&gt; was the one that apparently had to accept that Paul had a different training style which I honestly don&amp;#39;t feel works well when he was horribly emotionally abusive to Chimchar. That said, in hindsight I can definitely see a lot of things DP did well and do appreciate it more than when I first watched it, but I personally prefer XY because it was more consistent in pacing and quality compared to DP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg7edkq", "score_hidden": false, "stickied": false, "created": 1492109788.0, "created_utc": 1492080988.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg77cnk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mjangelvortex", "parent_id": "t1_dg6kc0e", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "I can see why too. The Gen IV anime was rather fun and very story driven compared to the previous arcs. Ash, Dawn, and their Pokemon got a lot of attention in regards to character development and like the XY arc, Ash was pretty competent in a lot of these episodes.\n\nHowever despite those good points there were some things that were holding Sinnoh down. And one of the biggest problems would be the pacing issues. Sometimes there would be huge gaps before anything important happened like Ash getting another new badge. So there would be a lot of filler episodes in between and while some of those filler episodes were fun (like the Togepi episode) a lot of them would get on the boring side of things because the story and the characters would just plain not be progressing. \n\nSo that probably explains why there were a lot of fluctuations with the Diamond and Pearl arc. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can see why too. The Gen IV anime was rather fun and very story driven compared to the previous arcs. Ash, Dawn, and their Pokemon got a lot of attention in regards to character development and like the XY arc, Ash was pretty competent in a lot of these episodes.&lt;/p&gt;\n\n&lt;p&gt;However despite those good points there were some things that were holding Sinnoh down. And one of the biggest problems would be the pacing issues. Sometimes there would be huge gaps before anything important happened like Ash getting another new badge. So there would be a lot of filler episodes in between and while some of those filler episodes were fun (like the Togepi episode) a lot of them would get on the boring side of things because the story and the characters would just plain not be progressing. &lt;/p&gt;\n\n&lt;p&gt;So that probably explains why there were a lot of fluctuations with the Diamond and Pearl arc. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg77cnk", "score_hidden": false, "stickied": false, "created": 1492090413.0, "created_utc": 1492061613.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6kc0e", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "PTGigi", "parent_id": "t3_64zxxl", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "The Gen 4 anime is surprisingly controversial. Very high ratings mixed with very low ratings! Season 13 especially, it not only has the lowest ranked episode, but also the largest range between the highest and lowest values of that season. \n\nThanks for the graph, I love me some graphs ;D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Gen 4 anime is surprisingly controversial. Very high ratings mixed with very low ratings! Season 13 especially, it not only has the lowest ranked episode, but also the largest range between the highest and lowest values of that season. &lt;/p&gt;\n\n&lt;p&gt;Thanks for the graph, I love me some graphs ;D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6kc0e", "score_hidden": false, "stickied": false, "created": 1492060066.0, "created_utc": 1492031266.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg6oagr", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Essex626", "parent_id": "t3_64zxxl", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "I stopped watching sometime during early Johto.  I recently had my daughters start watching, and was surprised how good XY and XYZ are.  The story is more continuous than I remember Johto being, and the characters seemed deeper.  The battles are where the show really shines, though, with XY using the actual effects of the moves from the game, instead of... something completely different, like the early series did.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I stopped watching sometime during early Johto.  I recently had my daughters start watching, and was surprised how good XY and XYZ are.  The story is more continuous than I remember Johto being, and the characters seemed deeper.  The battles are where the show really shines, though, with XY using the actual effects of the moves from the game, instead of... something completely different, like the early series did.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6oagr", "score_hidden": false, "stickied": false, "created": 1492064832.0, "created_utc": 1492036032.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg70o69", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "legendarymoonrabbit", "parent_id": "t1_dg6so0j", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "The nerf most noticeably happened in Unova, not Sinnoh. Like Hoenn, the girl played the role of noob trainer/wannabe coordinator so that Ash and Pikachu could at least look somewhat competent while still dishing out beginner-friendly info. They threw that out the window with Unova, having Ash be the noob, but this was balanced out by the anime trying out new things to maintain interest (such as TR being competent). Contrast Pikachu losing to Elekid in Sinnoh to Pikachu losing against Snivy in Unova. We learn that Paul is Ash's peer in skill and experience, but Trip literally just received his starter and somehow managed to beat Ash.\n\nSinnoh's problem that between the last few gyms there were a whole mass of episodes where the overall plot barely progressed, even if some of those episodes weren't strictly filler (minor stuff happened). Somewhat comparable to fillerriffic Johto, but without the power of nostalgia to back it up. Pacing problems derailed the show's attempt to build up secondary characters and rivals that actually mattered and would hold emotional weight when Ash would confront them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The nerf most noticeably happened in Unova, not Sinnoh. Like Hoenn, the girl played the role of noob trainer/wannabe coordinator so that Ash and Pikachu could at least look somewhat competent while still dishing out beginner-friendly info. They threw that out the window with Unova, having Ash be the noob, but this was balanced out by the anime trying out new things to maintain interest (such as TR being competent). Contrast Pikachu losing to Elekid in Sinnoh to Pikachu losing against Snivy in Unova. We learn that Paul is Ash&amp;#39;s peer in skill and experience, but Trip literally just received his starter and somehow managed to beat Ash.&lt;/p&gt;\n\n&lt;p&gt;Sinnoh&amp;#39;s problem that between the last few gyms there were a whole mass of episodes where the overall plot barely progressed, even if some of those episodes weren&amp;#39;t strictly filler (minor stuff happened). Somewhat comparable to fillerriffic Johto, but without the power of nostalgia to back it up. Pacing problems derailed the show&amp;#39;s attempt to build up secondary characters and rivals that actually mattered and would hold emotional weight when Ash would confront them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg70o69", "score_hidden": false, "stickied": false, "created": 1492080093.0, "created_utc": 1492051293.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6so0j", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Hayarotle", "parent_id": "t1_dg6kqiz", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "There was a whole change of style, Ash and Pikachu were once again nerfed to level 5, etc. Not sure about the quality of the episodes themselves, but many fans quit right at the end of Battle Frontier for these reasons.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There was a whole change of style, Ash and Pikachu were once again nerfed to level 5, etc. Not sure about the quality of the episodes themselves, but many fans quit right at the end of Battle Frontier for these reasons.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6so0j", "score_hidden": false, "stickied": false, "created": 1492070237.0, "created_utc": 1492041437.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg7cado", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "mjangelvortex", "parent_id": "t1_dg7b314", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "Yes it was. I even double checked Bulbapedia to be sure.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes it was. I even double checked Bulbapedia to be sure.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg7cado", "score_hidden": false, "stickied": false, "created": 1492103588.0, "created_utc": 1492074788.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7b314", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "notwiththeflames", "parent_id": "t1_dg76vp6", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "Fear Factor Phony is one of the lowest rated BF episodes. That was the first one with the new voice actors, wasn't it?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fear Factor Phony is one of the lowest rated BF episodes. That was the first one with the new voice actors, wasn&amp;#39;t it?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg7b314", "score_hidden": false, "stickied": false, "created": 1492099925.0, "created_utc": 1492071125.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg76vp6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mjangelvortex", "parent_id": "t1_dg6kqiz", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "The dub having the voice actor change could possibly be one of the reasons why it took a major dive. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The dub having the voice actor change could possibly be one of the reasons why it took a major dive. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg76vp6", "score_hidden": false, "stickied": false, "created": 1492089471.0, "created_utc": 1492060671.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6kqiz", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "notwiththeflames", "parent_id": "t3_64zxxl", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "I'm surprised that the Sinnoh seasons are that low. It looks like the anime took a major dive in popularity after the Battle Frontier and only started to recover in early XY.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m surprised that the Sinnoh seasons are that low. It looks like the anime took a major dive in popularity after the Battle Frontier and only started to recover in early XY.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6kqiz", "score_hidden": false, "stickied": false, "created": 1492060529.0, "created_utc": 1492031729.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg6me3q", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BedlingtonTerrier", "parent_id": "t1_dg6kpxn", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "Right before the Sinnoh League", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right before the Sinnoh League&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6me3q", "score_hidden": false, "stickied": false, "created": 1492062483.0, "created_utc": 1492033683.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6kpxn", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "AtomicBlackJellyfish", "parent_id": "t3_64zxxl", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "Anyone know why \"Bucking the Treasure Trend\" was rated the lowest in the series? Seemed like a normal filler episode to me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anyone know why &amp;quot;Bucking the Treasure Trend&amp;quot; was rated the lowest in the series? Seemed like a normal filler episode to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6kpxn", "score_hidden": false, "stickied": false, "created": 1492060510.0, "created_utc": 1492031710.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg6vdzw", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "SleuthMechanism", "parent_id": "t3_64zxxl", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "wow... this looks.. surprisingly just like i expected. o.o  A high point at the start where pokemon was at the height of it's popularity, the biggest decline in unova, and a resurgence of interest in x&amp;y.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;wow... this looks.. surprisingly just like i expected. o.o  A high point at the start where pokemon was at the height of it&amp;#39;s popularity, the biggest decline in unova, and a resurgence of interest in x&amp;amp;y.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6vdzw", "score_hidden": false, "stickied": false, "created": 1492073526.0, "created_utc": 1492044726.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg7aynu", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "SleuthMechanism", "parent_id": "t1_dg750ez", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "the fact is that the \"filler\" was atleast relatively entertaining", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the fact is that the &amp;quot;filler&amp;quot; was atleast relatively entertaining&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg7aynu", "score_hidden": false, "stickied": false, "created": 1492099570.0, "created_utc": 1492070770.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg750ez", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "bryanj93", "parent_id": "t1_dg6zgjh", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "Or it could just be that the quality was better. \"Nostalgia\" can't explain why XY and XYZ have been rated well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or it could just be that the quality was better. &amp;quot;Nostalgia&amp;quot; can&amp;#39;t explain why XY and XYZ have been rated well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg750ez", "score_hidden": false, "stickied": false, "created": 1492086285.0, "created_utc": 1492057485.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6zgjh", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "The_Toastboy", "parent_id": "t1_dg6w4gl", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "Nostalgia is definitely a big part. Just look at the BW series, where far and away the highest rated episode is the one where Charizard comes back. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nostalgia is definitely a big part. Just look at the BW series, where far and away the highest rated episode is the one where Charizard comes back. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6zgjh", "score_hidden": false, "stickied": false, "created": 1492078571.0, "created_utc": 1492049771.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6w4gl", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "advantagefox", "parent_id": "t3_64zxxl", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "I am surprised that a lot of the original series fillers were ranked so highly, considering that the majority of them have no plot relevance. This graph makes me wonder how much influence nostalgia has over the ranking. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am surprised that a lot of the original series fillers were ranked so highly, considering that the majority of them have no plot relevance. This graph makes me wonder how much influence nostalgia has over the ranking. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6w4gl", "score_hidden": false, "stickied": false, "created": 1492074434.0, "created_utc": 1492045634.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg7hlhj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JJAB91", "parent_id": "t1_dg7egpl", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "It was a filler episode right before the Sinnoh League", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was a filler episode right before the Sinnoh League&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg7hlhj", "score_hidden": false, "stickied": false, "created": 1492116328.0, "created_utc": 1492087528.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7egpl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Viroro", "parent_id": "t3_64zxxl", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "I'm curious, can anyone see where 'Till we compete again!' (the last XY episode) is in the ranking? Somehow I can't find it in spite of SM's first two episodes being there. That said, it's nice to see that on the whole the Anime was on a consistent upward trend for the last few years, and while Alola didn't seem to have started too well in America it doesn't seem to be going to dip too harshly for now.\n\nBy the way... was Buck's episode so horrible to deserve to be the lowest rated episode of the series ever? What happened? Did he shout even more 'dudes' than Generations' Buck?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m curious, can anyone see where &amp;#39;Till we compete again!&amp;#39; (the last XY episode) is in the ranking? Somehow I can&amp;#39;t find it in spite of SM&amp;#39;s first two episodes being there. That said, it&amp;#39;s nice to see that on the whole the Anime was on a consistent upward trend for the last few years, and while Alola didn&amp;#39;t seem to have started too well in America it doesn&amp;#39;t seem to be going to dip too harshly for now.&lt;/p&gt;\n\n&lt;p&gt;By the way... was Buck&amp;#39;s episode so horrible to deserve to be the lowest rated episode of the series ever? What happened? Did he shout even more &amp;#39;dudes&amp;#39; than Generations&amp;#39; Buck?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg7egpl", "score_hidden": false, "stickied": false, "created": 1492110017.0, "created_utc": 1492081217.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg7kajg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AeroTheManiac", "parent_id": "t3_64zxxl", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "This is so biased it hurts", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is so biased it hurts&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg7kajg", "score_hidden": false, "stickied": false, "created": 1492120161.0, "created_utc": 1492091361.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg8vi8q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LunarWingCloud", "parent_id": "t3_64zxxl", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "Does not surprise me the Sinnoh and Unova sagas are by far the lowest rated. Or that Kalos is much higher by comparison to the previous sagas", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does not surprise me the Sinnoh and Unova sagas are by far the lowest rated. Or that Kalos is much higher by comparison to the previous sagas&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg8vi8q", "score_hidden": false, "stickied": false, "created": 1492181741.0, "created_utc": 1492152941.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmeb", "removal_reason": null, "link_id": "t3_64zxxl", "likes": null, "replies": "", "user_reports": [], "id": "dg6it2w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SiKBiT", "parent_id": "t3_64zxxl", "subreddit_name_prefixed": "r/pokemon", "controversiality": 0, "body": "hmmm", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hmmm&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "pokemon", "name": "t1_dg6it2w", "score_hidden": false, "stickied": false, "created": 1492058403.0, "created_utc": 1492029603.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]