[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "languagelearning", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, I&amp;#39;m currently learning Korean and I&amp;#39;m intermediate in it (Around B1) I don&amp;#39;t live in Korea and I originally learned the language to get access to literature and comics but since some of my closest friends are Korean, once I got to a good level in it they started speaking to me in Korean so my conversational Korean is okay (I understand when people speak to me and when the Koreans in my school speak to each other) but watching tv shows is more difficult. &lt;/p&gt;\n\n&lt;p&gt;I wasn&amp;#39;t really interested in learning how to speak or that much interested in learning listening until I found a dialect of Korean I really like (부산말) but it turns out there&amp;#39;s not much info on learning it anywhere (in English or standard Korean) and even if I went to Korea they only teach standard Korean in schools. And standard Korean won&amp;#39;t help me in learning it as my native friends tell me that they can&amp;#39;t understand when people speak it! &lt;/p&gt;\n\n&lt;p&gt;I found a TV show that&amp;#39;s completely in the dialect (16 episodes) but there aren&amp;#39;t subtitles in Korean for the show so I&amp;#39;m unsure how I can use it to learn. Will watching it without subtitles and shadowing though while having to guess the meaning of what I&amp;#39;m listening help in learning the dialect or is there some other method I can use? Thank you!&lt;/p&gt;\n\n&lt;p&gt;TLDR: I need to somehow learn a dialect of a language I&amp;#39;m intermediate in the standard version of with nothing but a few webpages explaining some basic differences from the standard language and the dialect and a third show with 16 hours of material.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi, I'm currently learning Korean and I'm intermediate in it (Around B1) I don't live in Korea and I originally learned the language to get access to literature and comics but since some of my closest friends are Korean, once I got to a good level in it they started speaking to me in Korean so my conversational Korean is okay (I understand when people speak to me and when the Koreans in my school speak to each other) but watching tv shows is more difficult. \n\nI wasn't really interested in learning how to speak or that much interested in learning listening until I found a dialect of Korean I really like (부산말) but it turns out there's not much info on learning it anywhere (in English or standard Korean) and even if I went to Korea they only teach standard Korean in schools. And standard Korean won't help me in learning it as my native friends tell me that they can't understand when people speak it! \n\nI found a TV show that's completely in the dialect (16 episodes) but there aren't subtitles in Korean for the show so I'm unsure how I can use it to learn. Will watching it without subtitles and shadowing though while having to guess the meaning of what I'm listening help in learning the dialect or is there some other method I can use? Thank you!\n\nTLDR: I need to somehow learn a dialect of a language I'm intermediate in the standard version of with nothing but a few webpages explaining some basic differences from the standard language and the dialect and a third show with 16 hours of material.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64v287", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "yaoikin", "saved": false, "mod_reports": [], "name": "t3_64v287", "subreddit_name_prefixed": "r/languagelearning", "approved_by": null, "over_18": false, "domain": "self.languagelearning", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rjsc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/languagelearning/comments/64v287/learning_a_dialect_from_a_tv_show/", "num_reports": null, "locked": false, "stickied": false, "created": 1491987849.0, "url": "https://www.reddit.com/r/languagelearning/comments/64v287/learning_a_dialect_from_a_tv_show/", "author_flair_text": null, "quarantine": false, "title": "Learning a dialect from a TV show?", "created_utc": 1491959049.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_64v287", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_64v287", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_64v287", "likes": null, "replies": "", "user_reports": [], "id": "dg5h4vo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AlittleMisleading", "parent_id": "t1_dg5gvsq", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "My best idea is to try to find an italki tutor who would be willing to write the script from the show. You'd probably have to pay a fair amount per episode to get someone to do this, but you won't know until you try.  \n  \n \n  \nAfter you have a script in Hangeul you can try to figure out how to turn it into subtitles, study it, or do some other method. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My best idea is to try to find an italki tutor who would be willing to write the script from the show. You&amp;#39;d probably have to pay a fair amount per episode to get someone to do this, but you won&amp;#39;t know until you try.  &lt;/p&gt;\n\n&lt;p&gt;After you have a script in Hangeul you can try to figure out how to turn it into subtitles, study it, or do some other method. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dg5h4vo", "score_hidden": false, "stickied": false, "created": 1492000514.0, "created_utc": 1491971714.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gvsq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yaoikin", "parent_id": "t1_dg5f973", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "My goal is definitely to be able to speak but I'm fine with at least being able to understand until I'm able to go visit the place itself and work on speaking.\n\nThe dialect is pretty close to the standard (the things that Koreans not from the place can't understand are mostly cherry picked examples and though the ending sounds are different in many cases, it shouldn't be too hard to understand for a native. As a learner I'm unsure about my ability to pick up on it without any subtitles.\n\nThe differences definitely aren't to the level of let's say, mandarin and shanghainese. It's more like some word differences (like we have in different English dialects) and changing in last syllables/ different intonation/ they speak faster. It's still definetely mutually intelligible. Though some misunderstandings can occur.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My goal is definitely to be able to speak but I&amp;#39;m fine with at least being able to understand until I&amp;#39;m able to go visit the place itself and work on speaking.&lt;/p&gt;\n\n&lt;p&gt;The dialect is pretty close to the standard (the things that Koreans not from the place can&amp;#39;t understand are mostly cherry picked examples and though the ending sounds are different in many cases, it shouldn&amp;#39;t be too hard to understand for a native. As a learner I&amp;#39;m unsure about my ability to pick up on it without any subtitles.&lt;/p&gt;\n\n&lt;p&gt;The differences definitely aren&amp;#39;t to the level of let&amp;#39;s say, mandarin and shanghainese. It&amp;#39;s more like some word differences (like we have in different English dialects) and changing in last syllables/ different intonation/ they speak faster. It&amp;#39;s still definetely mutually intelligible. Though some misunderstandings can occur.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dg5gvsq", "score_hidden": false, "stickied": false, "created": 1492000067.0, "created_utc": 1491971267.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5f973", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AlittleMisleading", "parent_id": "t3_64v287", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "It's possible depending on what you're goals are. \n  \nI did something similar with Norwegian. I never learned to speak Bergen dialect by watching TV, but I was able to understand it much much better after watching a TV show that takes place in Bergen. \n\nI was probably somewhere around B2 reading + listening and B1 speaking in Oslo dialect (standard). \n\nNote: Bergen dialect is a lot like Oslo dialect word choice is nearly the same. Pronunciation is closer to how the word is spelled in bokmål, but a bit harder (bokmål = standard Norwegian writing system). Grammar is a bit easier in some areas.\n  \n  \nI believe it all depends on how similar the dialect is. I would say it's not really possible to learn a Chinese dialect if you know mandarin, just from a TV show. It will be more difficult if you are trying to speak it rather than just understand. \n  \n  \n  \n  \nI don't think I could pick up a harder norwegian dialect from watching TV. I definitely couldn't learn to speak one. ", "edited": 1491968799.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s possible depending on what you&amp;#39;re goals are. &lt;/p&gt;\n\n&lt;p&gt;I did something similar with Norwegian. I never learned to speak Bergen dialect by watching TV, but I was able to understand it much much better after watching a TV show that takes place in Bergen. &lt;/p&gt;\n\n&lt;p&gt;I was probably somewhere around B2 reading + listening and B1 speaking in Oslo dialect (standard). &lt;/p&gt;\n\n&lt;p&gt;Note: Bergen dialect is a lot like Oslo dialect word choice is nearly the same. Pronunciation is closer to how the word is spelled in bokmål, but a bit harder (bokmål = standard Norwegian writing system). Grammar is a bit easier in some areas.&lt;/p&gt;\n\n&lt;p&gt;I believe it all depends on how similar the dialect is. I would say it&amp;#39;s not really possible to learn a Chinese dialect if you know mandarin, just from a TV show. It will be more difficult if you are trying to speak it rather than just understand. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think I could pick up a harder norwegian dialect from watching TV. I definitely couldn&amp;#39;t learn to speak one. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dg5f973", "score_hidden": false, "stickied": false, "created": 1491997368.0, "created_utc": 1491968568.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_64v287", "likes": null, "replies": "", "user_reports": [], "id": "dg5nzlh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Raffaele1617", "parent_id": "t3_64v287", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "If you want to learn it, my suggestion is to get to at least C1 in standard korean and then to go to the place. This is because, firstly, if natives have trouble undersganding it, you won't be able to get an ear for it withoit having advanced knowledge of the standard language first. Secondly, while listening might aid in getting an ear for it, you will not learn tbe languge/dialect in that manner, particularly if your korean is at an intermediate level. This is the unfortunate reality of many minority languages/dialects.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you want to learn it, my suggestion is to get to at least C1 in standard korean and then to go to the place. This is because, firstly, if natives have trouble undersganding it, you won&amp;#39;t be able to get an ear for it withoit having advanced knowledge of the standard language first. Secondly, while listening might aid in getting an ear for it, you will not learn tbe languge/dialect in that manner, particularly if your korean is at an intermediate level. This is the unfortunate reality of many minority languages/dialects.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dg5nzlh", "score_hidden": false, "stickied": false, "created": 1492017555.0, "created_utc": 1491988755.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]