[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "languagelearning", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I bought the Spanish version of The Lightning Thief last week and I&amp;#39;ve slowly been reading it. When I say slowly, I mean really slowly. It takes 10 minutes to get through a page. I find myself re-reading sentences to walk myself through the grammar and constantly looking up new words in the dictionary. I&amp;#39;m sure this is an effective way to learn, but I kind of hate it. By comparison, if I read a page like I would read an English book, without looking things up, I can read much faster and generally get the gist of what&amp;#39;s going on plotwise. But is this actually an effective way to learn or am I just reinforcing the things I already know while failing to learn the things I don&amp;#39;t know?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I bought the Spanish version of The Lightning Thief last week and I've slowly been reading it. When I say slowly, I mean really slowly. It takes 10 minutes to get through a page. I find myself re-reading sentences to walk myself through the grammar and constantly looking up new words in the dictionary. I'm sure this is an effective way to learn, but I kind of hate it. By comparison, if I read a page like I would read an English book, without looking things up, I can read much faster and generally get the gist of what's going on plotwise. But is this actually an effective way to learn or am I just reinforcing the things I already know while failing to learn the things I don't know?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64vp3i", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "SwoleBuddha", "saved": false, "mod_reports": [], "name": "t3_64vp3i", "subreddit_name_prefixed": "r/languagelearning", "approved_by": null, "over_18": false, "domain": "self.languagelearning", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rjsc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/languagelearning/comments/64vp3i/is_it_possible_to_read_in_your_target_language/", "num_reports": null, "locked": false, "stickied": false, "created": 1491995413.0, "url": "https://www.reddit.com/r/languagelearning/comments/64vp3i/is_it_possible_to_read_in_your_target_language/", "author_flair_text": null, "quarantine": false, "title": "Is it possible to read in your target language, but not learn anything?", "created_utc": 1491966613.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_64vp3i", "likes": null, "replies": "", "user_reports": [], "id": "dg5fj4o", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "adventuringraw", "parent_id": "t3_64vp3i", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "I did some exploring with that back when I was playing with Spanish... I made anki cards for everything I didn't understand in the first chapter or two of the first Harry Potter book, looked everything up I didn't catch in the third and fourth chapters, and after that just... kind of read until the end of the third book in the series. I did learn quite a bit, but honestly I wasn't far enough along to really learn new things comfortably just from context. My coverage was too low, probably closer to 95% than 98%, that missing few % makes a big difference. With German, even though I'm maybe 99.x% known, there's still a lot of words I wouldn't be able to get just from context. \"I went to the store to buy a goober\". Doesn't really tell you much about what a goober is, some sentences provide far less clues even than that. You're genuinely only going to recognize the real meaning of a word from context (even if you master that skill) in a relatively small number of instances, so you'll need to encounter a word more often before it starts to take on some shape and color. \n\nSo... for what it's worth, I think you probably could pick up a lot with what you're doing. You'd probably pick up more with a RL type approach (have english in the background on audio book) or reading in a dual-language book so you can glance across the page when you need a quick bit of help. Personally I like using readlang or a kindle... if looking something up only takes two or three seconds, then it's no big deal, I just take a quick peak at what I need to know, and move on. If you try going just with the gist, without looking anything up at all, you'll probably have to cover 2 or 3 (or more) times as many pages for the same amount of progress. I think you'll get it all eventually though... I read a fuck ton when I was a little kid (JRR Tolkien, Dune, Battlefield Earth, Earth Abides, Exiles Trilogy, etc) and I promise there's a fuck ton of words I didn't know back then. I learned them though, and I didn't use a dictionary to figure out what they meant... I just picked it up as I went. \n\nSo which should you pick? You should pick what works for you. With my method (looking up everything as quickly as possible, take no notes, and move along) it seems to be around 10,000 pages to hit a relative degree of comfort in reading recreationally without help from a dictionary. If you made an anki card for every unknown word, it might only take 1,000. If you didn't look anything up at all, it might take 30,000. Either way you're talking about hundreds of hours... so you should pick what appeals to you, and what you'll actually spend the time on, you know? All roads lead to Rome, you just have to walk far enough to get there. \n\nI just started reading the lightning thief to my kid, haha. It's a fun book. Enjoy, however you choose to read it. ", "edited": 1491969250.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did some exploring with that back when I was playing with Spanish... I made anki cards for everything I didn&amp;#39;t understand in the first chapter or two of the first Harry Potter book, looked everything up I didn&amp;#39;t catch in the third and fourth chapters, and after that just... kind of read until the end of the third book in the series. I did learn quite a bit, but honestly I wasn&amp;#39;t far enough along to really learn new things comfortably just from context. My coverage was too low, probably closer to 95% than 98%, that missing few % makes a big difference. With German, even though I&amp;#39;m maybe 99.x% known, there&amp;#39;s still a lot of words I wouldn&amp;#39;t be able to get just from context. &amp;quot;I went to the store to buy a goober&amp;quot;. Doesn&amp;#39;t really tell you much about what a goober is, some sentences provide far less clues even than that. You&amp;#39;re genuinely only going to recognize the real meaning of a word from context (even if you master that skill) in a relatively small number of instances, so you&amp;#39;ll need to encounter a word more often before it starts to take on some shape and color. &lt;/p&gt;\n\n&lt;p&gt;So... for what it&amp;#39;s worth, I think you probably could pick up a lot with what you&amp;#39;re doing. You&amp;#39;d probably pick up more with a RL type approach (have english in the background on audio book) or reading in a dual-language book so you can glance across the page when you need a quick bit of help. Personally I like using readlang or a kindle... if looking something up only takes two or three seconds, then it&amp;#39;s no big deal, I just take a quick peak at what I need to know, and move on. If you try going just with the gist, without looking anything up at all, you&amp;#39;ll probably have to cover 2 or 3 (or more) times as many pages for the same amount of progress. I think you&amp;#39;ll get it all eventually though... I read a fuck ton when I was a little kid (JRR Tolkien, Dune, Battlefield Earth, Earth Abides, Exiles Trilogy, etc) and I promise there&amp;#39;s a fuck ton of words I didn&amp;#39;t know back then. I learned them though, and I didn&amp;#39;t use a dictionary to figure out what they meant... I just picked it up as I went. &lt;/p&gt;\n\n&lt;p&gt;So which should you pick? You should pick what works for you. With my method (looking up everything as quickly as possible, take no notes, and move along) it seems to be around 10,000 pages to hit a relative degree of comfort in reading recreationally without help from a dictionary. If you made an anki card for every unknown word, it might only take 1,000. If you didn&amp;#39;t look anything up at all, it might take 30,000. Either way you&amp;#39;re talking about hundreds of hours... so you should pick what appeals to you, and what you&amp;#39;ll actually spend the time on, you know? All roads lead to Rome, you just have to walk far enough to get there. &lt;/p&gt;\n\n&lt;p&gt;I just started reading the lightning thief to my kid, haha. It&amp;#39;s a fun book. Enjoy, however you choose to read it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dg5fj4o", "score_hidden": false, "stickied": false, "created": 1491997811.0, "created_utc": 1491969011.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_64vp3i", "likes": null, "replies": "", "user_reports": [], "id": "dg5nppq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "vminnear", "parent_id": "t3_64vp3i", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "I usually do both passive and active reading.  I like to read passively to the end of the page/chapter, highlight words/grammar I don't know and then go back and work out what it all means.\n\nI find passive reading helps to cement stuff I already know, coming across words and grammar in different contexts, forming new memories of them. Active reading is where I would gain new knowledge. They both serve different purposes and I think you're selling passive reading short. Reinforcing what you've learned is an extremely important part of learning a new language (or anything, for that matter). Learning new words/grammar doesn't just stop after you've come across it once or twice, you have to see it over and over in different contexts until you fully assimilate and understand it and the different ways it might be used. For that, you need as much exposure as possible which makes passive reading better/more effective in that regard. \n\nPlus, I agree that active reading can get really damn tedious and passive reading can be much more enjoyable. \n", "edited": 1491988268.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I usually do both passive and active reading.  I like to read passively to the end of the page/chapter, highlight words/grammar I don&amp;#39;t know and then go back and work out what it all means.&lt;/p&gt;\n\n&lt;p&gt;I find passive reading helps to cement stuff I already know, coming across words and grammar in different contexts, forming new memories of them. Active reading is where I would gain new knowledge. They both serve different purposes and I think you&amp;#39;re selling passive reading short. Reinforcing what you&amp;#39;ve learned is an extremely important part of learning a new language (or anything, for that matter). Learning new words/grammar doesn&amp;#39;t just stop after you&amp;#39;ve come across it once or twice, you have to see it over and over in different contexts until you fully assimilate and understand it and the different ways it might be used. For that, you need as much exposure as possible which makes passive reading better/more effective in that regard. &lt;/p&gt;\n\n&lt;p&gt;Plus, I agree that active reading can get really damn tedious and passive reading can be much more enjoyable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dg5nppq", "score_hidden": false, "stickied": false, "created": 1492016668.0, "created_utc": 1491987868.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_64vp3i", "likes": null, "replies": "", "user_reports": [], "id": "dg5io6c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yaoikin", "parent_id": "t3_64vp3i", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "With Korean, when reading my first novel it took 15 minutes a page at first then by the end of the novel it dropped to 5 minutes a page :). I haven't stated reading another paperback novel yet but I've been reading stories online and I've noticed in the slightly over one month since I've finished my first novel, my Korean comprehension has grown to the point that before I would look at a page and be totally and utterly lost but now I can get the general idea without using a dictionary even if I miss some little details. I can also guess the meaning of a lot of words from context and I'm about right 98% of the time when I choose to look at the dictionary to confirm. \n\nReading a novel is very hard. However just practicing vocab through flashcards and textbooks won't necessarily make it any easier. Reading is a skill of its own that must be developed through continuously reading and stretching yourself. At first it seems impossible hard but honestly, if you stick with it it's going to get so much easier and the time you spent slugging over the book will feel like a breeze in comparison.\n\nI think you should look up everything for the first few chapters then slowly wean off until you only look for what's necessary for you to understand the passage. Good luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;With Korean, when reading my first novel it took 15 minutes a page at first then by the end of the novel it dropped to 5 minutes a page :). I haven&amp;#39;t stated reading another paperback novel yet but I&amp;#39;ve been reading stories online and I&amp;#39;ve noticed in the slightly over one month since I&amp;#39;ve finished my first novel, my Korean comprehension has grown to the point that before I would look at a page and be totally and utterly lost but now I can get the general idea without using a dictionary even if I miss some little details. I can also guess the meaning of a lot of words from context and I&amp;#39;m about right 98% of the time when I choose to look at the dictionary to confirm. &lt;/p&gt;\n\n&lt;p&gt;Reading a novel is very hard. However just practicing vocab through flashcards and textbooks won&amp;#39;t necessarily make it any easier. Reading is a skill of its own that must be developed through continuously reading and stretching yourself. At first it seems impossible hard but honestly, if you stick with it it&amp;#39;s going to get so much easier and the time you spent slugging over the book will feel like a breeze in comparison.&lt;/p&gt;\n\n&lt;p&gt;I think you should look up everything for the first few chapters then slowly wean off until you only look for what&amp;#39;s necessary for you to understand the passage. Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dg5io6c", "score_hidden": false, "stickied": false, "created": 1492003390.0, "created_utc": 1491974590.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_64vp3i", "likes": null, "replies": "", "user_reports": [], "id": "dg5ohwn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Raffaele1617", "parent_id": "t3_64vp3i", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "Stay at it, I PROMISE it's worth it. When I started reading GoT in Italian it took a simiñarly enormoud amount of tume and effort for me to get through a single page, but by the time I waa around 50+ pages in I noticed it was drammatically easier. It sucks in the beginning but starts to become a much more pleasurable way to learn as you go on. Don't give up!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stay at it, I PROMISE it&amp;#39;s worth it. When I started reading GoT in Italian it took a simiñarly enormoud amount of tume and effort for me to get through a single page, but by the time I waa around 50+ pages in I noticed it was drammatically easier. It sucks in the beginning but starts to become a much more pleasurable way to learn as you go on. Don&amp;#39;t give up!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dg5ohwn", "score_hidden": false, "stickied": false, "created": 1492019159.0, "created_utc": 1491990359.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_64vp3i", "likes": null, "replies": "", "user_reports": [], "id": "dg5op7y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "robobob9000", "parent_id": "t3_64vp3i", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "In my experience when it comes to improving foreign language fluency through reading, it's basically \"no pain no gain\". \n\nExtensive reading is fun, but produces slow progress. \n\nIntensive reading is not fun, but produces fast progress.\n\nSo you have to find your personal equilibrium. You should try to read as actively as you possibly can without hating the activity. Because if you hate the activity and you stop doing it, then it doesn't really matter how effective it is. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my experience when it comes to improving foreign language fluency through reading, it&amp;#39;s basically &amp;quot;no pain no gain&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Extensive reading is fun, but produces slow progress. &lt;/p&gt;\n\n&lt;p&gt;Intensive reading is not fun, but produces fast progress.&lt;/p&gt;\n\n&lt;p&gt;So you have to find your personal equilibrium. You should try to read as actively as you possibly can without hating the activity. Because if you hate the activity and you stop doing it, then it doesn&amp;#39;t really matter how effective it is. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dg5op7y", "score_hidden": false, "stickied": false, "created": 1492019784.0, "created_utc": 1491990984.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_64vp3i", "likes": null, "replies": "", "user_reports": [], "id": "dg5sauq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aweg", "parent_id": "t3_64vp3i", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "Have you considered parallel texts while your reading level is still lowish? You read the English and target language versions, alternating. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you considered parallel texts while your reading level is still lowish? You read the English and target language versions, alternating. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dg5sauq", "score_hidden": false, "stickied": false, "created": 1492028597.0, "created_utc": 1491999797.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_64vp3i", "likes": null, "replies": "", "user_reports": [], "id": "dg654f0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sweet_Talos", "parent_id": "t3_64vp3i", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "I found it helped me with French.\n\nThe book I bought was designed for English speakers learning French.  The recommendation was read the French through no matter how little you understood, and then read the same chapter again in English.  I did other grammar and vocabulary work during the time I was reading and by the time I got to the end, I was comprehending more than I was when I started.\n\nIt won't help your speaking or listening skills of course, but in my experience it helped with reading, grammar, and by extension, writing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I found it helped me with French.&lt;/p&gt;\n\n&lt;p&gt;The book I bought was designed for English speakers learning French.  The recommendation was read the French through no matter how little you understood, and then read the same chapter again in English.  I did other grammar and vocabulary work during the time I was reading and by the time I got to the end, I was comprehending more than I was when I started.&lt;/p&gt;\n\n&lt;p&gt;It won&amp;#39;t help your speaking or listening skills of course, but in my experience it helped with reading, grammar, and by extension, writing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dg654f0", "score_hidden": false, "stickied": false, "created": 1492044394.0, "created_utc": 1492015594.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_64vp3i", "likes": null, "replies": "", "user_reports": [], "id": "dg5u852", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "I_WASTE_MY_TIME", "parent_id": "t3_64vp3i", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "This is not an effective way to learn the language in a conversational way. In Puerto Rico the education system forces English literature on a Spanish speaking population since grade school and a very small percentage of people actually speak it and an even smaller percentage speak it fluently. All this because they focus the education on the literature and don't teach conversational English.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is not an effective way to learn the language in a conversational way. In Puerto Rico the education system forces English literature on a Spanish speaking population since grade school and a very small percentage of people actually speak it and an even smaller percentage speak it fluently. All this because they focus the education on the literature and don&amp;#39;t teach conversational English.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dg5u852", "score_hidden": false, "stickied": false, "created": 1492031733.0, "created_utc": 1492002933.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]