[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "languagelearning", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey there everyone. &lt;/p&gt;\n\n&lt;p&gt;As title says, I&amp;#39;m currently planning a youtube tutorial series on Turkish. I&amp;#39;ve seen that there&amp;#39;s a lack of quality Turkish teaching content online, and I want to make one for free. At the moment I&amp;#39;m studying basic linguistics and systematic Turkish grammar, and creating a basic idea of how to go on about it. One thing I couldn&amp;#39;t make up was how to approach vocabulary. Obviously I would teach key words and phrases, but beyond that learning vocabulary is entirely up to the learner and I want to guide that process. &lt;/p&gt;\n\n&lt;p&gt;I was thinking about introducing them to Memrise and have them learn through the official Turkish decks, or even create my own deck and update it as time goes on. Any other suggestions?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey there everyone. \n\nAs title says, I'm currently planning a youtube tutorial series on Turkish. I've seen that there's a lack of quality Turkish teaching content online, and I want to make one for free. At the moment I'm studying basic linguistics and systematic Turkish grammar, and creating a basic idea of how to go on about it. One thing I couldn't make up was how to approach vocabulary. Obviously I would teach key words and phrases, but beyond that learning vocabulary is entirely up to the learner and I want to guide that process. \n\nI was thinking about introducing them to Memrise and have them learn through the official Turkish decks, or even create my own deck and update it as time goes on. Any other suggestions?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65olx3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "lkmertgurcan", "saved": false, "mod_reports": [], "name": "t3_65olx3", "subreddit_name_prefixed": "r/languagelearning", "approved_by": null, "over_18": false, "domain": "self.languagelearning", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rjsc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/languagelearning/comments/65olx3/im_planning_a_youtube_tutorial_series_on_turkish/", "num_reports": null, "locked": false, "stickied": false, "created": 1492369533.0, "url": "https://www.reddit.com/r/languagelearning/comments/65olx3/im_planning_a_youtube_tutorial_series_on_turkish/", "author_flair_text": "Turkish N | English N | German B2 | MSA A2 ", "quarantine": false, "title": "I'm planning a youtube tutorial series on Turkish. Need some tips on handling vocabulary.", "created_utc": 1492340733.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_65olx3", "likes": null, "replies": "", "user_reports": [], "id": "dgby31u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kazga", "parent_id": "t3_65olx3", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "Something that I'd really appreciate as a learner would be a Memrise or Anki deck specifically tailored to your lessons so that I can keep up with vocabulary without much effort. My personal preference is definitely Anki, because I can easily expand the deck with vocab I encounter elsewhere. However, Memrise is more popular overall and is more appealing to people who just want to give it a try.\n\n\nAs for the actual words, I think it's best if you introduce a handful of common vocabulary each lesson (the exact amount would depend on how big you want the lessons to be) and use them in sample sentences relating to the discussed grammar point. You could also ask your students to practice the lesson's content on a given list of words.  ", "edited": 1492343010.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Something that I&amp;#39;d really appreciate as a learner would be a Memrise or Anki deck specifically tailored to your lessons so that I can keep up with vocabulary without much effort. My personal preference is definitely Anki, because I can easily expand the deck with vocab I encounter elsewhere. However, Memrise is more popular overall and is more appealing to people who just want to give it a try.&lt;/p&gt;\n\n&lt;p&gt;As for the actual words, I think it&amp;#39;s best if you introduce a handful of common vocabulary each lesson (the exact amount would depend on how big you want the lessons to be) and use them in sample sentences relating to the discussed grammar point. You could also ask your students to practice the lesson&amp;#39;s content on a given list of words.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dgby31u", "score_hidden": false, "stickied": false, "created": 1492371552.0, "created_utc": 1492342752.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_65olx3", "likes": null, "replies": "", "user_reports": [], "id": "dgcb5iw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "newappeal", "parent_id": "t3_65olx3", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "Depends on how you're gonna structure your course, but one thing I think would be helpful is simply giving lots of example sentences (which also help with grammar) and using varied vocabulary. As time goes on, include more and more advanced vocab as you teach more advanced grammatical concepts.\n\nAlso definitely post here when you have your first episodes up! I've taken a break from learning Turkish, as I'm trying to improve my Russian before going to Ukraine this summer, but I'm hoping to start back up again in the Fall. I agree that there's a serious lack of Turkish language-learning content online.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Depends on how you&amp;#39;re gonna structure your course, but one thing I think would be helpful is simply giving lots of example sentences (which also help with grammar) and using varied vocabulary. As time goes on, include more and more advanced vocab as you teach more advanced grammatical concepts.&lt;/p&gt;\n\n&lt;p&gt;Also definitely post here when you have your first episodes up! I&amp;#39;ve taken a break from learning Turkish, as I&amp;#39;m trying to improve my Russian before going to Ukraine this summer, but I&amp;#39;m hoping to start back up again in the Fall. I agree that there&amp;#39;s a serious lack of Turkish language-learning content online.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dgcb5iw", "score_hidden": false, "stickied": false, "created": 1492392968.0, "created_utc": 1492364168.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]