[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "languagelearning", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m half Portuguese, yet I&amp;#39;m too scared to say portuguese words out loud for fear of someone judging me. I&amp;#39;m even scared of my father hearing me, I&amp;#39;m scared of him judging me for speaking bad Portuguese, because he&amp;#39;s pretty much fluent in it.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s giving me horrible anxiety and i dont know why&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm half Portuguese, yet I'm too scared to say portuguese words out loud for fear of someone judging me. I'm even scared of my father hearing me, I'm scared of him judging me for speaking bad Portuguese, because he's pretty much fluent in it.\n\nIt's giving me horrible anxiety and i dont know why", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65stt8", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "Chaspen", "saved": false, "mod_reports": [], "name": "t3_65stt8", "subreddit_name_prefixed": "r/languagelearning", "approved_by": null, "over_18": false, "domain": "self.languagelearning", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rjsc", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/languagelearning/comments/65stt8/i_want_to_learn_portuguese_so_badly_but_im_too/", "num_reports": null, "locked": false, "stickied": false, "created": 1492422721.0, "url": "https://www.reddit.com/r/languagelearning/comments/65stt8/i_want_to_learn_portuguese_so_badly_but_im_too/", "author_flair_text": null, "quarantine": false, "title": "I want to learn Portuguese so badly, but I'm too scared to", "created_utc": 1492393921.0, "distinguished": null, "media": null, "upvote_ratio": 0.67, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_65stt8", "likes": null, "replies": "", "user_reports": [], "id": "dgcy6nu", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Brainwrecker", "parent_id": "t3_65stt8", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "talk to your father about it? be like yo dad im learnin Portuguese and need help you down? 10/10 your dad will say yes when it comes to things about heritage.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;talk to your father about it? be like yo dad im learnin Portuguese and need help you down? 10/10 your dad will say yes when it comes to things about heritage.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dgcy6nu", "score_hidden": false, "stickied": false, "created": 1492423627.0, "created_utc": 1492394827.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_65stt8", "likes": null, "replies": "", "user_reports": [], "id": "dgd371b", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "adventuringraw", "parent_id": "t3_65stt8", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "Anxiety is a rough thing, is it something you've experienced in other parts of your life? Most people get it in some places I think, before a math test, or before performing in front of people, or standing up and speaking, all kinds of places. \n\nIf you look at most people's anxiety though, it's usually layered a few levels deep. \"This math test is making me anxious\" is actually \"I'm afraid I'll fail\" and below that, it's \"I don't want to find out for sure that I'm a failure and that I suck at math\". \n\nIt's even harder with fathers. Somehow they're the last people in the world you want to look stupid in front of, especially if deep down, one of the reasons you want to learn is to make your father proud. My own dad and I have a pretty distant relationship. He does everything alone, and that's how I learned to do things too. Some fathers are a lot better at learning with their sons, teaching, mentoring... I don't really know what that would feel like, because that's not who my father is. If your father is someone that could teach you, and would be proud that you'd come to him and want to include him in your learning, then being vulnerable and trusting him to help you learn without judgement... that could be a great thing for your relationship. If your dad is like mine though, you might want to just include him when you're already near the end of your journey. Nothing wrong with that, fine to learn on your own for a while first, then there's no one to risk embarrassment in front of, if that's what you're afraid of. \n\nSo here's my advice. Don't think about the whole journey. It's too easy for questions to pop up. \"what if I can't?\" \"what if I'm slow and my dad thinks I'm stupid?\" \n\nWhat you should do instead, is pick some medium term goals that you absolutely know you can do. Have you learned another language before? There's a lot of ways to approach it. Some people start by learning the most common 600 words, while working on their pronunciation (fluent forever). Other people start with a course, like assimil or michael thomas. Other people learn by reading (that's what I like to do personally) and start with graded readers, and then move on to children's books. Other people learn by memorizing 10,000 useful sentences. There's a lot of ways to learn, and all of them break down into really manageable goals when you actually look at them. \n\nFor reading for example, it seems like it takes around 10,000 pages read to get pretty comfortable. By then I was able to start watching shows for fun, following conversations, read what I wanted, and if I were to start speaking with someone, I'm probably only 100 hours of practice out from being able function in the language on most topics I'd be interested in. There's no herculean effort there, nothing to fail at even, it's just one page after another. If you put in the time, you'll arrive eventually. Same goes for any other method. \n\nSo, check out this [list of ways you can learn](https://www.reddit.com/r/languagelearning/comments/5ian7q/language_learning_a_howto/). Pick one that feels right for you, given your strengths, anxieties, and goals. Some of my friends would think it's insane to learn a language alone for a year before starting to practice with native speakers I already knew, but... hey, that's kind of who I am, no shame in it, especially if it was my dad it'd go without saying that that's what I'd do. The big thing to get clear on is that your fear is just because you're looking at too big of a chunk, and you're thinking about doing it all in front of your dad. Can you learn Portuguese fluently? Well... you can of course, but if you're monolingual, that's a lot to look at. Can you go through the Michael Thomas course? Or learn your first words and phrases with anki? Or read through your first graded reader? Yes yes and yes, you know? No sweat. Just get started, come back and ask for help if you get stuck, and... you know. Prepare to spend a few hundred hours before you start to feel some headway. It's slow going, you just need to put in the hours. Good luck!", "edited": 1492402446.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anxiety is a rough thing, is it something you&amp;#39;ve experienced in other parts of your life? Most people get it in some places I think, before a math test, or before performing in front of people, or standing up and speaking, all kinds of places. &lt;/p&gt;\n\n&lt;p&gt;If you look at most people&amp;#39;s anxiety though, it&amp;#39;s usually layered a few levels deep. &amp;quot;This math test is making me anxious&amp;quot; is actually &amp;quot;I&amp;#39;m afraid I&amp;#39;ll fail&amp;quot; and below that, it&amp;#39;s &amp;quot;I don&amp;#39;t want to find out for sure that I&amp;#39;m a failure and that I suck at math&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s even harder with fathers. Somehow they&amp;#39;re the last people in the world you want to look stupid in front of, especially if deep down, one of the reasons you want to learn is to make your father proud. My own dad and I have a pretty distant relationship. He does everything alone, and that&amp;#39;s how I learned to do things too. Some fathers are a lot better at learning with their sons, teaching, mentoring... I don&amp;#39;t really know what that would feel like, because that&amp;#39;s not who my father is. If your father is someone that could teach you, and would be proud that you&amp;#39;d come to him and want to include him in your learning, then being vulnerable and trusting him to help you learn without judgement... that could be a great thing for your relationship. If your dad is like mine though, you might want to just include him when you&amp;#39;re already near the end of your journey. Nothing wrong with that, fine to learn on your own for a while first, then there&amp;#39;s no one to risk embarrassment in front of, if that&amp;#39;s what you&amp;#39;re afraid of. &lt;/p&gt;\n\n&lt;p&gt;So here&amp;#39;s my advice. Don&amp;#39;t think about the whole journey. It&amp;#39;s too easy for questions to pop up. &amp;quot;what if I can&amp;#39;t?&amp;quot; &amp;quot;what if I&amp;#39;m slow and my dad thinks I&amp;#39;m stupid?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;What you should do instead, is pick some medium term goals that you absolutely know you can do. Have you learned another language before? There&amp;#39;s a lot of ways to approach it. Some people start by learning the most common 600 words, while working on their pronunciation (fluent forever). Other people start with a course, like assimil or michael thomas. Other people learn by reading (that&amp;#39;s what I like to do personally) and start with graded readers, and then move on to children&amp;#39;s books. Other people learn by memorizing 10,000 useful sentences. There&amp;#39;s a lot of ways to learn, and all of them break down into really manageable goals when you actually look at them. &lt;/p&gt;\n\n&lt;p&gt;For reading for example, it seems like it takes around 10,000 pages read to get pretty comfortable. By then I was able to start watching shows for fun, following conversations, read what I wanted, and if I were to start speaking with someone, I&amp;#39;m probably only 100 hours of practice out from being able function in the language on most topics I&amp;#39;d be interested in. There&amp;#39;s no herculean effort there, nothing to fail at even, it&amp;#39;s just one page after another. If you put in the time, you&amp;#39;ll arrive eventually. Same goes for any other method. &lt;/p&gt;\n\n&lt;p&gt;So, check out this &lt;a href=\"https://www.reddit.com/r/languagelearning/comments/5ian7q/language_learning_a_howto/\"&gt;list of ways you can learn&lt;/a&gt;. Pick one that feels right for you, given your strengths, anxieties, and goals. Some of my friends would think it&amp;#39;s insane to learn a language alone for a year before starting to practice with native speakers I already knew, but... hey, that&amp;#39;s kind of who I am, no shame in it, especially if it was my dad it&amp;#39;d go without saying that that&amp;#39;s what I&amp;#39;d do. The big thing to get clear on is that your fear is just because you&amp;#39;re looking at too big of a chunk, and you&amp;#39;re thinking about doing it all in front of your dad. Can you learn Portuguese fluently? Well... you can of course, but if you&amp;#39;re monolingual, that&amp;#39;s a lot to look at. Can you go through the Michael Thomas course? Or learn your first words and phrases with anki? Or read through your first graded reader? Yes yes and yes, you know? No sweat. Just get started, come back and ask for help if you get stuck, and... you know. Prepare to spend a few hundred hours before you start to feel some headway. It&amp;#39;s slow going, you just need to put in the hours. Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dgd371b", "score_hidden": false, "stickied": false, "created": 1492430930.0, "created_utc": 1492402130.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_65stt8", "likes": null, "replies": "", "user_reports": [], "id": "dgcz8ks", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Andthatwasthestory", "parent_id": "t3_65stt8", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "To be honest, when I saw the title of your post, I thought it'd be a Spanish or French speaker being afraid to learn it in case it impacted their Spanish or French. \n\nAny language is going to require practise and at first, you're not going to be good at it. That's normal and that's natural. If you're scared to practise around your father, then simply practise alone. Can you use your mother as a resource?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To be honest, when I saw the title of your post, I thought it&amp;#39;d be a Spanish or French speaker being afraid to learn it in case it impacted their Spanish or French. &lt;/p&gt;\n\n&lt;p&gt;Any language is going to require practise and at first, you&amp;#39;re not going to be good at it. That&amp;#39;s normal and that&amp;#39;s natural. If you&amp;#39;re scared to practise around your father, then simply practise alone. Can you use your mother as a resource?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dgcz8ks", "score_hidden": false, "stickied": false, "created": 1492425096.0, "created_utc": 1492396296.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_65stt8", "likes": null, "replies": "", "user_reports": [], "id": "dgcxrh8", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "hoffmania1", "parent_id": "t3_65stt8", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "Aw shit! Sorry to hear you're going through that.\n\nAny chance you could find a class or meetup group where you are surrounded by other language-learners? You might be more comfortable there because everyone is in the same boat. Then, once your confidence is boosted a bit, you can try speaking in front of your father. \n\nFor the record, I've heard a lot of stories similar to yours, and in most cases people's parents are really pleased to hear their kids speaking their ancestral language and are not judgmental at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aw shit! Sorry to hear you&amp;#39;re going through that.&lt;/p&gt;\n\n&lt;p&gt;Any chance you could find a class or meetup group where you are surrounded by other language-learners? You might be more comfortable there because everyone is in the same boat. Then, once your confidence is boosted a bit, you can try speaking in front of your father. &lt;/p&gt;\n\n&lt;p&gt;For the record, I&amp;#39;ve heard a lot of stories similar to yours, and in most cases people&amp;#39;s parents are really pleased to hear their kids speaking their ancestral language and are not judgmental at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dgcxrh8", "score_hidden": false, "stickied": false, "created": 1492423036.0, "created_utc": 1492394236.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_65stt8", "likes": null, "replies": "", "user_reports": [], "id": "dgdleby", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "olive_tree94", "parent_id": "t3_65stt8", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "I can relate. I'm a heritage speaker of a language, and due to various reasons, my younger family members (8 and 10 years difference between us,) speak it more fluently than me. I only recently started trying to improve my skill in that language, so  I try to use it when calling my mother on the phone, but I am afraid of using it at home where the young teens can hear me. I'm usually strict with them when it comes to helping them with homework (English and our local language), and will not shy away from correcting them, so I feel a little bad at the idea of speaking in front of them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can relate. I&amp;#39;m a heritage speaker of a language, and due to various reasons, my younger family members (8 and 10 years difference between us,) speak it more fluently than me. I only recently started trying to improve my skill in that language, so  I try to use it when calling my mother on the phone, but I am afraid of using it at home where the young teens can hear me. I&amp;#39;m usually strict with them when it comes to helping them with homework (English and our local language), and will not shy away from correcting them, so I feel a little bad at the idea of speaking in front of them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dgdleby", "score_hidden": false, "stickied": false, "created": 1492470505.0, "created_utc": 1492441705.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_65stt8", "likes": null, "replies": "", "user_reports": [], "id": "dge1baz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lostoldnameagain", "parent_id": "t3_65stt8", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "Maybe you can use an app like HelloTalk, set up a cartoon picture and a fake name and then try to talk to people? I don't generally have anxiety, but I do feel way more uncomfortable trying to talk to real friends in a language I don't yet speak than trying to talk to Internet people while hiding behind a mask.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe you can use an app like HelloTalk, set up a cartoon picture and a fake name and then try to talk to people? I don&amp;#39;t generally have anxiety, but I do feel way more uncomfortable trying to talk to real friends in a language I don&amp;#39;t yet speak than trying to talk to Internet people while hiding behind a mask.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dge1baz", "score_hidden": false, "stickied": false, "created": 1492488462.0, "created_utc": 1492459662.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_65stt8", "likes": null, "replies": "", "user_reports": [], "id": "dgehraq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ReinierPersoon", "parent_id": "t3_65stt8", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "Think of it this way: if you speak with a foreign accent, that's no reason to be ashamed, because it means you probably speak another language as well!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Think of it this way: if you speak with a foreign accent, that&amp;#39;s no reason to be ashamed, because it means you probably speak another language as well!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dgehraq", "score_hidden": false, "stickied": false, "created": 1492508758.0, "created_utc": 1492479958.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]