[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "languagelearning", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a monolingual native English speaker. At some point I decided one of my &amp;quot;life goals&amp;quot; would be to learn another language. Some years back I decided on German because I like the way it sounds, and because it has a reputation for exactness. I learned how to do extremely basic things like pronounce the alphabet, and count. I then put the idea on hold as it seemed my brain was not very receptive to another language (better described as &amp;quot;Hey, it&amp;#39;s been like 4 hours and I&amp;#39;m not fluent yet, I suck at language, I give up.&amp;quot;)&lt;/p&gt;\n\n&lt;p&gt;When the Duolingo craze hit a few years ago, I toyed with the idea of learning German again. I spent a few weeks on it, enough time to finish Duolingo, and of course I was still barely able to formulate even basic sentences (though it was interesting being able to formulate any sentences at all). I lost interest due to the lack of significant progress, and put the idea on hold again.&lt;/p&gt;\n\n&lt;p&gt;About one year ago, I spent an entire month (between working hours) doing nothing else but flailing about with various resources trying to make some real progress for once. I tried different methods, including &amp;quot;listen and repeat&amp;quot; audio tapes, reading (with and without audio), the textbook approach, etc. Strangely, of all the things I tried, I seemed to get the best results when I approached the grammar like a puzzle to be solved. I made more progress than usual on that particular go-round, but ultimately it was noun genders that burned me out again (classifying every single noun just feels like utter nonsense as a native English speaker).&lt;/p&gt;\n\n&lt;p&gt;A couple weeks ago, I got the urge to learn again, and I decided to take a different approach from all previous attempts. Not to sound defeatist or anything, but I know full-well that I am going to give up again sooner or later (I was reading about plural forms last night, and that just about slayed me), so I have been consciously trying to find something that could really hold my interest, something that would expose me to the language, without being &lt;em&gt;about&lt;/em&gt; the language.&lt;/p&gt;\n\n&lt;p&gt;I went on YouTube, and I found videos where a German speaker plays through old video games and provides commentary. There are a &lt;em&gt;ton&lt;/em&gt; of videos, hundreds and hundreds of hours worth. Over the past couple weeks, I have probably gotten over 50 hours of listening practice, and due to the nature of the content, absolutely none of it has felt like work. It&amp;#39;s definitely the most enjoyable activity I&amp;#39;ve done with the language so far.&lt;/p&gt;\n\n&lt;p&gt;My comprehension fluctuates, especially with my mood, but I feel like my brain is parsing and understanding just a little bit more with each video. In the beginning, I could listen to several minutes and barely understand anything. Now I can occasionally get entire sentences, and generally keep up with at least the gist of what is being said in the video.&lt;/p&gt;\n\n&lt;p&gt;I guess I&amp;#39;m wondering if anybody here has done something similar and can comment on their experience with this method over long periods of time. Is it possible to develop passive understanding of a language this way?&lt;/p&gt;\n\n&lt;p&gt;(I should probably mention that I am not at all concerned with being able to speak it, I just want to be able to understand it).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am a monolingual native English speaker. At some point I decided one of my \"life goals\" would be to learn another language. Some years back I decided on German because I like the way it sounds, and because it has a reputation for exactness. I learned how to do extremely basic things like pronounce the alphabet, and count. I then put the idea on hold as it seemed my brain was not very receptive to another language (better described as \"Hey, it's been like 4 hours and I'm not fluent yet, I suck at language, I give up.\")\n\nWhen the Duolingo craze hit a few years ago, I toyed with the idea of learning German again. I spent a few weeks on it, enough time to finish Duolingo, and of course I was still barely able to formulate even basic sentences (though it was interesting being able to formulate any sentences at all). I lost interest due to the lack of significant progress, and put the idea on hold again.\n\nAbout one year ago, I spent an entire month (between working hours) doing nothing else but flailing about with various resources trying to make some real progress for once. I tried different methods, including \"listen and repeat\" audio tapes, reading (with and without audio), the textbook approach, etc. Strangely, of all the things I tried, I seemed to get the best results when I approached the grammar like a puzzle to be solved. I made more progress than usual on that particular go-round, but ultimately it was noun genders that burned me out again (classifying every single noun just feels like utter nonsense as a native English speaker).\n\nA couple weeks ago, I got the urge to learn again, and I decided to take a different approach from all previous attempts. Not to sound defeatist or anything, but I know full-well that I am going to give up again sooner or later (I was reading about plural forms last night, and that just about slayed me), so I have been consciously trying to find something that could really hold my interest, something that would expose me to the language, without being *about* the language.\n\nI went on YouTube, and I found videos where a German speaker plays through old video games and provides commentary. There are a *ton* of videos, hundreds and hundreds of hours worth. Over the past couple weeks, I have probably gotten over 50 hours of listening practice, and due to the nature of the content, absolutely none of it has felt like work. It's definitely the most enjoyable activity I've done with the language so far.\n\nMy comprehension fluctuates, especially with my mood, but I feel like my brain is parsing and understanding just a little bit more with each video. In the beginning, I could listen to several minutes and barely understand anything. Now I can occasionally get entire sentences, and generally keep up with at least the gist of what is being said in the video.\n\nI guess I'm wondering if anybody here has done something similar and can comment on their experience with this method over long periods of time. Is it possible to develop passive understanding of a language this way?\n\n(I should probably mention that I am not at all concerned with being able to speak it, I just want to be able to understand it).", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ui1q", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "less-to-worry-about", "saved": false, "mod_reports": [], "name": "t3_65ui1q", "subreddit_name_prefixed": "r/languagelearning", "approved_by": null, "over_18": false, "domain": "self.languagelearning", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rjsc", "edited": 1492420767.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/languagelearning/comments/65ui1q/is_it_possible_to_learn_a_language_by_watching/", "num_reports": null, "locked": false, "stickied": false, "created": 1492448861.0, "url": "https://www.reddit.com/r/languagelearning/comments/65ui1q/is_it_possible_to_learn_a_language_by_watching/", "author_flair_text": null, "quarantine": false, "title": "Is it possible to learn a language by watching videos?", "created_utc": 1492420061.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_65ui1q", "likes": null, "replies": "", "user_reports": [], "id": "dgdaygk", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "cassis-oolong", "parent_id": "t3_65ui1q", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "It's not an efficient method at all, but if it gets you learning why not continue? But once you gain a certain degree of fluency you will be frustrated that your listening ability does not translate to spoken or written ability. Listening is the easiest skill to develop by the way, aside from reading (depending on the language).\n\nThe \"traditional\" methods are still the shortest and most efficient ways of learning a language, short of being marooned in a country where nobody speaks a word in your language. Then you'll be forced to learn real quick.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not an efficient method at all, but if it gets you learning why not continue? But once you gain a certain degree of fluency you will be frustrated that your listening ability does not translate to spoken or written ability. Listening is the easiest skill to develop by the way, aside from reading (depending on the language).&lt;/p&gt;\n\n&lt;p&gt;The &amp;quot;traditional&amp;quot; methods are still the shortest and most efficient ways of learning a language, short of being marooned in a country where nobody speaks a word in your language. Then you&amp;#39;ll be forced to learn real quick.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dgdaygk", "score_hidden": false, "stickied": false, "created": 1492449435.0, "created_utc": 1492420635.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_65ui1q", "likes": null, "replies": "", "user_reports": [], "id": "dgdb3tb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JohnDoe_John", "parent_id": "t3_65ui1q", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "&gt; Is it possible to learn a language by watching videos?\n\nYes. However, one would be tired soon. One would better listen to the online talkative radio. It is ok to do it all day long in the background. Just to get language impressions, as understanding comes later. Several months of everyday practice could bring many phrasal constructions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Is it possible to learn a language by watching videos?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes. However, one would be tired soon. One would better listen to the online talkative radio. It is ok to do it all day long in the background. Just to get language impressions, as understanding comes later. Several months of everyday practice could bring many phrasal constructions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dgdb3tb", "score_hidden": false, "stickied": false, "created": 1492449947.0, "created_utc": 1492421147.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rjsc", "removal_reason": null, "link_id": "t3_65ui1q", "likes": null, "replies": "", "user_reports": [], "id": "dge9mkj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LetsPlayThisBro", "parent_id": "t3_65ui1q", "subreddit_name_prefixed": "r/languagelearning", "controversiality": 0, "body": "As others have pointed out, yes, you can, but it's not very efficient.   If you're willing to grind it out like that, that's up to you, but if you want to learn in a lot less time it's important to attack the language on more than one front.  Don't be devoted to any single method, use more than one.   But if you are stuck with only one, you're better off using Anki and make your own flashcards to learn vocabulary and train in the grammar the same way.  By making your own cards you're building your learning on what applies to you and what you need to know.  It's important to have at least a base of about 1000 of the most common words in any language so I'd get a frequency dictionary and concentrate on the first 1000.   It may feel like a grind but by using spaced repetition the way Anki does it will give you a good base which you can build on from other sources and add new words/sentence structures etc. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As others have pointed out, yes, you can, but it&amp;#39;s not very efficient.   If you&amp;#39;re willing to grind it out like that, that&amp;#39;s up to you, but if you want to learn in a lot less time it&amp;#39;s important to attack the language on more than one front.  Don&amp;#39;t be devoted to any single method, use more than one.   But if you are stuck with only one, you&amp;#39;re better off using Anki and make your own flashcards to learn vocabulary and train in the grammar the same way.  By making your own cards you&amp;#39;re building your learning on what applies to you and what you need to know.  It&amp;#39;s important to have at least a base of about 1000 of the most common words in any language so I&amp;#39;d get a frequency dictionary and concentrate on the first 1000.   It may feel like a grind but by using spaced repetition the way Anki does it will give you a good base which you can build on from other sources and add new words/sentence structures etc. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "languagelearning", "name": "t1_dge9mkj", "score_hidden": false, "stickied": false, "created": 1492498469.0, "created_utc": 1492469669.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]