[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "minimalism", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ok, so I am super into minimalism and at the same time super turned off. I have been interested in it for a while off and on but never really did anything. I just watched/read stuff on how it can make you happier. So I understand clean lines and the problem of choice. Problem of choice is when you have too many choices it makes it hard and then you more frequently don&amp;#39;t make any choices. That is where I think most of the happy stems from, less &amp;quot;hard&amp;quot; or &amp;quot;long&amp;quot; choices. &lt;/p&gt;\n\n&lt;p&gt;But here is my problem, we (married) have a lot of stuff and while we have a lot of decorations they seem to provide an overall warmth instead of emptiness. The majority of small things came from our wedding, like my wife made bouquets and we have pictures and the letters of our names that everyone signed. We also have rugs, lots of rugs, 9 to be exact. And while a few aren&amp;#39;t my favorites, they are older and provide a purpose to break up the blandness of the floor and give a different texture to walk on. For perspective we live in a 1200 sq ft 3 bed house. &lt;/p&gt;\n\n&lt;p&gt;On the same hand, I am all on board on the &amp;quot;stuff&amp;quot; part of minimalism. We have started to transition to quality over quality, I now have 1 hat and I used to have over 1000 DVDs/Blu-Rays. Then I went on give away/sell spree and got it down to about ~250. Now I am getting rid of a lot more, down to ~50 non-kids movies. Steps in the right direction. Same with clothes, I have a system for getting rid of clothes (I have as much as my wife b/c I still wear stuff from high school, over 10 years ago). But it doesn&amp;#39;t get rid of clothes fast enough, it is when I don&amp;#39;t wear clothes over a year then they are gone. Well my mom loves getting me clothes for Christmas each year so, I always have 3-5 new &amp;quot;outfits.&amp;quot; So I am going to try to speed up that process. &lt;/p&gt;\n\n&lt;p&gt;So here is where I need help. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;So, all the pictures I see are very clean/structured, doesn&amp;#39;t that get boring? Like it looks great to look at for 30 minutes, but there isn&amp;#39;t any color/patterns to make the mind wander. This is my biggest problem. &lt;/li&gt;\n&lt;li&gt;How do y&amp;#39;all accommodate friends? We have a guest room, but minimalist try to make a smaller footprint, do you not have friends/relatives stay over?&lt;/li&gt;\n&lt;li&gt;Same with parties. We have enough plates/bowls to host a 10 person dinner party (they are the same ones we use everyday) and seating these pictures/video there are like 3 chairs per house/apt.  do y&amp;#39;all not host parties?&lt;/li&gt;\n&lt;li&gt;Lastly (for now) another seating question. We have a sectional couch, great to lay/sit on, use it at least once a day and I can lay/sit in many different spots on it. We also have dining table chairs, we have 6 but we really only use 2 (same spots every day) and 4 bar stools also only use 2 when we sit up there. But we also have a beanbag in the office and a recliner in the living room that I use at least twice a week probably more often than that. This doesn&amp;#39;t include the seats in the garage workshop, back patio, and front patio. Basically, don&amp;#39;t you get bored of siting in the exact same 1 to 2 places?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Ok, so I am super into minimalism and at the same time super turned off. I have been interested in it for a while off and on but never really did anything. I just watched/read stuff on how it can make you happier. So I understand clean lines and the problem of choice. Problem of choice is when you have too many choices it makes it hard and then you more frequently don't make any choices. That is where I think most of the happy stems from, less \"hard\" or \"long\" choices. \n\nBut here is my problem, we (married) have a lot of stuff and while we have a lot of decorations they seem to provide an overall warmth instead of emptiness. The majority of small things came from our wedding, like my wife made bouquets and we have pictures and the letters of our names that everyone signed. We also have rugs, lots of rugs, 9 to be exact. And while a few aren't my favorites, they are older and provide a purpose to break up the blandness of the floor and give a different texture to walk on. For perspective we live in a 1200 sq ft 3 bed house. \n\nOn the same hand, I am all on board on the \"stuff\" part of minimalism. We have started to transition to quality over quality, I now have 1 hat and I used to have over 1000 DVDs/Blu-Rays. Then I went on give away/sell spree and got it down to about ~250. Now I am getting rid of a lot more, down to ~50 non-kids movies. Steps in the right direction. Same with clothes, I have a system for getting rid of clothes (I have as much as my wife b/c I still wear stuff from high school, over 10 years ago). But it doesn't get rid of clothes fast enough, it is when I don't wear clothes over a year then they are gone. Well my mom loves getting me clothes for Christmas each year so, I always have 3-5 new \"outfits.\" So I am going to try to speed up that process. \n\nSo here is where I need help. \n\n- So, all the pictures I see are very clean/structured, doesn't that get boring? Like it looks great to look at for 30 minutes, but there isn't any color/patterns to make the mind wander. This is my biggest problem. \n- How do y'all accommodate friends? We have a guest room, but minimalist try to make a smaller footprint, do you not have friends/relatives stay over?\n- Same with parties. We have enough plates/bowls to host a 10 person dinner party (they are the same ones we use everyday) and seating these pictures/video there are like 3 chairs per house/apt.  do y'all not host parties?\n- Lastly (for now) another seating question. We have a sectional couch, great to lay/sit on, use it at least once a day and I can lay/sit in many different spots on it. We also have dining table chairs, we have 6 but we really only use 2 (same spots every day) and 4 bar stools also only use 2 when we sit up there. But we also have a beanbag in the office and a recliner in the living room that I use at least twice a week probably more often than that. This doesn't include the seats in the garage workshop, back patio, and front patio. Basically, don't you get bored of siting in the exact same 1 to 2 places?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "655oth", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "Senacherib", "saved": false, "mod_reports": [], "name": "t3_655oth", "subreddit_name_prefixed": "r/minimalism", "approved_by": null, "over_18": false, "domain": "self.minimalism", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0z9", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/minimalism/comments/655oth/just_in_need_of_help_understanding/", "num_reports": null, "locked": false, "stickied": false, "created": 1492121328.0, "url": "https://www.reddit.com/r/minimalism/comments/655oth/just_in_need_of_help_understanding/", "author_flair_text": null, "quarantine": false, "title": "Just in need of help understanding.", "created_utc": 1492092528.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0z9", "removal_reason": null, "link_id": "t3_655oth", "likes": null, "replies": "", "user_reports": [], "id": "dg7ra26", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "garrettmickley", "parent_id": "t3_655oth", "subreddit_name_prefixed": "r/minimalism", "controversiality": 0, "body": "I feel like the main issue here is that you think minimalism means not having things.\n\nMinimalism is when you remove what's not important from your life and only keep what is important.\n\nRemove the things that don't add happiness and only own things that do add happiness.\n\n\"So, all the pictures I see are very clean/structured, doesn't that get boring?\" -&gt; If it bores you, don't do it. It sounds like removing those things would not add happiness to your life.\n\n\"How do y'all accommodate friends?\" -&gt; Well, I have a couch and a few chairs, as well as a blow-up mattress when people need to stay over. Someday, I will have a guest room and I will buy a second bed because giving friends a comfortable place to stay will bring me happiness.\n\n\"Same with parties.\" -&gt; I have purchased enough items to host the parties I desire to host, again, because they bring me happiness.\n\n\"Basically, don't you get bored of siting in the exact same 1 to 2 places?\" -&gt; I don't know if I understand the question...I have chairs that can be moved around. The couch doesn't really move much, nor does the recliner. The rest of the chairs are easily moved from one location to another. I also have a beanbag chair which is easily moved as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like the main issue here is that you think minimalism means not having things.&lt;/p&gt;\n\n&lt;p&gt;Minimalism is when you remove what&amp;#39;s not important from your life and only keep what is important.&lt;/p&gt;\n\n&lt;p&gt;Remove the things that don&amp;#39;t add happiness and only own things that do add happiness.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So, all the pictures I see are very clean/structured, doesn&amp;#39;t that get boring?&amp;quot; -&amp;gt; If it bores you, don&amp;#39;t do it. It sounds like removing those things would not add happiness to your life.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;How do y&amp;#39;all accommodate friends?&amp;quot; -&amp;gt; Well, I have a couch and a few chairs, as well as a blow-up mattress when people need to stay over. Someday, I will have a guest room and I will buy a second bed because giving friends a comfortable place to stay will bring me happiness.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Same with parties.&amp;quot; -&amp;gt; I have purchased enough items to host the parties I desire to host, again, because they bring me happiness.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Basically, don&amp;#39;t you get bored of siting in the exact same 1 to 2 places?&amp;quot; -&amp;gt; I don&amp;#39;t know if I understand the question...I have chairs that can be moved around. The couch doesn&amp;#39;t really move much, nor does the recliner. The rest of the chairs are easily moved from one location to another. I also have a beanbag chair which is easily moved as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "minimalism", "name": "t1_dg7ra26", "score_hidden": false, "stickied": false, "created": 1492128091.0, "created_utc": 1492099291.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0z9", "removal_reason": null, "link_id": "t3_655oth", "likes": null, "replies": "", "user_reports": [], "id": "dg7u3om", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "letterairy", "parent_id": "t3_655oth", "subreddit_name_prefixed": "r/minimalism", "controversiality": 0, "body": "It seems that you're interested in minimalism living and turned off by minimalist aesthetic - which is perfectly reasonable.\n\nBeing minimalist can simply mean working to find what is enough for you. It's not an exact process and it is different for everyone. It also fluctuates constantly due to your changing needs and interests, so mindfulness is needed above all else to make the choices that bring you a happiness through contentment instead of fleeting pleasures.\n\nHowever, since the practice of being mindful is so personal, there's no exact rules that apply to all situations. Some promote methods that work for them - like the 100 possessions idea - but no personalized method like that is universal. \n\nLearning about minimalism will ultimately lead to you confronting what your personal needs are in order to feel content and then practicing mindfulness going forward to meet those needs without excess, while taking into account the flexibility of your changing situation and interests over time.\n\nBasically: pick and choose what works for you when it comes to the minimalist lifestyle. Leave the rest behind.\n\nAs for your detailed questions:\n\n- If the minimalist aesthetic doesn't work for you, that's totally okay. You can live as a minimalist and not be interested in minimalist art or minimalist interiors. They're different things.\n\n- If you accommodate friends often or even simply feel more comfortable with the idea that you do have a guest room to accommodate a friend whenever needed, then that is a part of what makes you feel content. If the extra room bothers you because you want to live in more affordable accommodations, then you can likely look for a 2 bedroom instead of 3 at a better price. It's about considering how you want to accommodate your friends, not how other minimalists accommodate theirs. Though I'm sure most people find a way that works best for their own situation. (In my case, I don't have a lot of friends visiting due to my roommate situation, but my friends tend to prefer that I visit their apartments instead - so it works out).\n\n- Once again, that really depends on each person's situation. Do you often host 10 person dinner parties or do you find you more often host 5 person dinner parties instead? Do you actually never host parties or do you often hold immense ones and have to resort to paper plates all of the time? If you stored some of your nonessential dishware away for a year or two - did you really need it after all? Would you be willing to let it go and hold onto the stuff that you do use all of the time? Even folks who live in tiny homes can accommodate a large dinner party if they decide to set up tables on the grass in front of their home, for example - but it really comes down to finding your own habits and tailor fitting it to what you need.\n\n- It's good that you're thinking about where you are sitting and why - that's a part of the mindfulness I mentioned. That comes down to personal preference again. I don't feel bored with the two places I tend to sit at home - they're comfy and accommodate my habits. If you need more than one place to sit to feel comfortable at home, then that's what works for you. If there are some places you never sit, then you could consider removing the seating to allow for the additional space in your home.\n\nOne last thing, since you do not seem to like bare minimum interior decoration but you are interested in the idea of comfort without excess, you might like /r/ScandinavianInterior/", "edited": 1492102701.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It seems that you&amp;#39;re interested in minimalism living and turned off by minimalist aesthetic - which is perfectly reasonable.&lt;/p&gt;\n\n&lt;p&gt;Being minimalist can simply mean working to find what is enough for you. It&amp;#39;s not an exact process and it is different for everyone. It also fluctuates constantly due to your changing needs and interests, so mindfulness is needed above all else to make the choices that bring you a happiness through contentment instead of fleeting pleasures.&lt;/p&gt;\n\n&lt;p&gt;However, since the practice of being mindful is so personal, there&amp;#39;s no exact rules that apply to all situations. Some promote methods that work for them - like the 100 possessions idea - but no personalized method like that is universal. &lt;/p&gt;\n\n&lt;p&gt;Learning about minimalism will ultimately lead to you confronting what your personal needs are in order to feel content and then practicing mindfulness going forward to meet those needs without excess, while taking into account the flexibility of your changing situation and interests over time.&lt;/p&gt;\n\n&lt;p&gt;Basically: pick and choose what works for you when it comes to the minimalist lifestyle. Leave the rest behind.&lt;/p&gt;\n\n&lt;p&gt;As for your detailed questions:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;If the minimalist aesthetic doesn&amp;#39;t work for you, that&amp;#39;s totally okay. You can live as a minimalist and not be interested in minimalist art or minimalist interiors. They&amp;#39;re different things.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If you accommodate friends often or even simply feel more comfortable with the idea that you do have a guest room to accommodate a friend whenever needed, then that is a part of what makes you feel content. If the extra room bothers you because you want to live in more affordable accommodations, then you can likely look for a 2 bedroom instead of 3 at a better price. It&amp;#39;s about considering how you want to accommodate your friends, not how other minimalists accommodate theirs. Though I&amp;#39;m sure most people find a way that works best for their own situation. (In my case, I don&amp;#39;t have a lot of friends visiting due to my roommate situation, but my friends tend to prefer that I visit their apartments instead - so it works out).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Once again, that really depends on each person&amp;#39;s situation. Do you often host 10 person dinner parties or do you find you more often host 5 person dinner parties instead? Do you actually never host parties or do you often hold immense ones and have to resort to paper plates all of the time? If you stored some of your nonessential dishware away for a year or two - did you really need it after all? Would you be willing to let it go and hold onto the stuff that you do use all of the time? Even folks who live in tiny homes can accommodate a large dinner party if they decide to set up tables on the grass in front of their home, for example - but it really comes down to finding your own habits and tailor fitting it to what you need.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;It&amp;#39;s good that you&amp;#39;re thinking about where you are sitting and why - that&amp;#39;s a part of the mindfulness I mentioned. That comes down to personal preference again. I don&amp;#39;t feel bored with the two places I tend to sit at home - they&amp;#39;re comfy and accommodate my habits. If you need more than one place to sit to feel comfortable at home, then that&amp;#39;s what works for you. If there are some places you never sit, then you could consider removing the seating to allow for the additional space in your home.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;One last thing, since you do not seem to like bare minimum interior decoration but you are interested in the idea of comfort without excess, you might like &lt;a href=\"/r/ScandinavianInterior/\"&gt;/r/ScandinavianInterior/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "minimalism", "name": "t1_dg7u3om", "score_hidden": false, "stickied": false, "created": 1492131106.0, "created_utc": 1492102306.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0z9", "removal_reason": null, "link_id": "t3_655oth", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0z9", "removal_reason": null, "link_id": "t3_655oth", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0z9", "removal_reason": null, "link_id": "t3_655oth", "likes": null, "replies": "", "user_reports": [], "id": "dgdiho2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "anachronic", "parent_id": "t1_dgclfbi", "subreddit_name_prefixed": "r/minimalism", "controversiality": 0, "body": "I eat lots of veggies, grains, beans.  Stir-fry, rice &amp; beans, big giant salad bowls of veggies &amp; beans, soup, noodles, microwave stuff like breakfast burritos or veggie burgers.  I'm making miso soup right now with tempeh and seaweed and noodles as a late breakfast.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I eat lots of veggies, grains, beans.  Stir-fry, rice &amp;amp; beans, big giant salad bowls of veggies &amp;amp; beans, soup, noodles, microwave stuff like breakfast burritos or veggie burgers.  I&amp;#39;m making miso soup right now with tempeh and seaweed and noodles as a late breakfast.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "minimalism", "name": "t1_dgdiho2", "score_hidden": false, "stickied": false, "created": 1492466672.0, "created_utc": 1492437872.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgclfbi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "KatsumeBlisk", "parent_id": "t1_dg85xky", "subreddit_name_prefixed": "r/minimalism", "controversiality": 0, "body": "What kinda stuff do you eat? I realize it's not really important, but your comment made me curious.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What kinda stuff do you eat? I realize it&amp;#39;s not really important, but your comment made me curious.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "minimalism", "name": "t1_dgclfbi", "score_hidden": false, "stickied": false, "created": 1492406459.0, "created_utc": 1492377659.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg85xky", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "anachronic", "parent_id": "t3_655oth", "subreddit_name_prefixed": "r/minimalism", "controversiality": 0, "body": "&gt; So, all the pictures I see are very clean/structured, doesn't that get boring? Like it looks great to look at for 30 minutes, but there isn't any color/patterns to make the mind wander. This is my biggest problem.\n\nSo add color &amp; patterns.  :)\n\n&gt; How do y'all accommodate friends? We have a guest room, but minimalist try to make a smaller footprint, do you not have friends/relatives stay over?\n\nI live in a 1br, so when friends crash, they can choose between a couch, a recliner, and an air mattress (for camping).\n\nI don't feel the need to have an entire separate bedroom / bed / sheets / pillows / etc... just so someone can sleep for 6-7 hours on it every couple months.  The furniture I already own serve that purpose just fine.\n\n&gt; Same with parties. \n\nI don't have the time to cook for 10 people and I doubt anyone would want what I'd make anyway, because I eat very healthy.  I'll tell people to eat first, bring takeout, order delivery, or we can go out to a restaurant.  \n\nIt really hasn't been an issue, although occasionally someone bitches that I don't have any junk food or chips/soda... but I don't eat that stuff so I never buy it.  Everyone's more than welcome to bring any particular snacks they enjoy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;So, all the pictures I see are very clean/structured, doesn&amp;#39;t that get boring? Like it looks great to look at for 30 minutes, but there isn&amp;#39;t any color/patterns to make the mind wander. This is my biggest problem.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So add color &amp;amp; patterns.  :)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;How do y&amp;#39;all accommodate friends? We have a guest room, but minimalist try to make a smaller footprint, do you not have friends/relatives stay over?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I live in a 1br, so when friends crash, they can choose between a couch, a recliner, and an air mattress (for camping).&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t feel the need to have an entire separate bedroom / bed / sheets / pillows / etc... just so someone can sleep for 6-7 hours on it every couple months.  The furniture I already own serve that purpose just fine.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Same with parties. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t have the time to cook for 10 people and I doubt anyone would want what I&amp;#39;d make anyway, because I eat very healthy.  I&amp;#39;ll tell people to eat first, bring takeout, order delivery, or we can go out to a restaurant.  &lt;/p&gt;\n\n&lt;p&gt;It really hasn&amp;#39;t been an issue, although occasionally someone bitches that I don&amp;#39;t have any junk food or chips/soda... but I don&amp;#39;t eat that stuff so I never buy it.  Everyone&amp;#39;s more than welcome to bring any particular snacks they enjoy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "minimalism", "name": "t1_dg85xky", "score_hidden": false, "stickied": false, "created": 1492143822.0, "created_utc": 1492115022.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0z9", "removal_reason": null, "link_id": "t3_655oth", "likes": null, "replies": "", "user_reports": [], "id": "dg8t4ld", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "onceagainonreddit", "parent_id": "t3_655oth", "subreddit_name_prefixed": "r/minimalism", "controversiality": 0, "body": "It is personal. Minimalism just means Less is more. You already have less than what could be a disaster you know. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is personal. Minimalism just means Less is more. You already have less than what could be a disaster you know. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "minimalism", "name": "t1_dg8t4ld", "score_hidden": false, "stickied": false, "created": 1492176331.0, "created_utc": 1492147531.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0z9", "removal_reason": null, "link_id": "t3_655oth", "likes": null, "replies": "", "user_reports": [], "id": "dg8uzu9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aeon_goyangi", "parent_id": "t3_655oth", "subreddit_name_prefixed": "r/minimalism", "controversiality": 0, "body": "Minimalism means having enough. What is enough for you will not be the same as what is enough for someone else. Your enough may feel very overwhelming for someone like me. That doesn't mean it's wrong. It's just not right for me.\n\nFind your enough and don't compare it to the enough of others.\n\nIf everything you have adds something positive to your life then you are walking the same path as the rest of us. Don't over think it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Minimalism means having enough. What is enough for you will not be the same as what is enough for someone else. Your enough may feel very overwhelming for someone like me. That doesn&amp;#39;t mean it&amp;#39;s wrong. It&amp;#39;s just not right for me.&lt;/p&gt;\n\n&lt;p&gt;Find your enough and don&amp;#39;t compare it to the enough of others.&lt;/p&gt;\n\n&lt;p&gt;If everything you have adds something positive to your life then you are walking the same path as the rest of us. Don&amp;#39;t over think it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "minimalism", "name": "t1_dg8uzu9", "score_hidden": false, "stickied": false, "created": 1492180449.0, "created_utc": 1492151649.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]