[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "financialindependence", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;OK all.  First time posting here, long time lurker.  I have been working towards FI since I started working out of college 8 years ago, and think due to multiple factors I am on the precipice of actually being able to.  My apologies for the longer post, I will try to keep it brief but want to ensure I get the pertinent facts out so I receive the most informed advice / opinions.&lt;/p&gt;\n\n&lt;p&gt;WORK: I do not enjoy what I do, although I am good at it (I work in corporate finance).  My weeks are currently in the 60 hour range, and are fairly high stress for a variety of factors.  Oh, I also just got promoted at work and now live in Switzerland which I don&amp;#39;t think is 100% pertinent to the conversation here but perhaps is worth mentioning.  &lt;/p&gt;\n\n&lt;p&gt;FINANCES: my wife and I started off our professional lives with about 110K in student debt (combined) which is now zero--we are 100% debt free.  Our net worth is roughly $1.2M.  Our annual spending is around $30K, but since we are expecting our first child I am bumping this up to $50K.  Our passive, usable income stands around $30K / year, but since that is rental based it will rise over time.  My wife, after spending about two years as a stay at home mom will want to return to work, where she does not plan on retiring early at all--she makes around $45K / year after taxes.  I too plan on working part time, either contract based seasonally (I snowboard professionally in the winter), or part time year round--call it perhaps $30-35K / year after taxes in terms of what I would bring in with this plan initially, with further upside as I &amp;quot;tune&amp;quot; things over the years.  &lt;/p&gt;\n\n&lt;p&gt;I fully expect to still contribute to our Roth IRA (11,000/year), and have my wife contribute the max to any retirement program offered by her employer.  I would like to still keep saving as well--its fun, and will ensure we are able to continue forth on less income.  &lt;/p&gt;\n\n&lt;p&gt;The issue, as i see it, is that I am terrified of taking this jump--should it be something I can even do (not convinced).  Not sure what all you guys think, but I don&amp;#39;t want to spend any more time than I have to working in a career I don&amp;#39;t enjoy, not snowboarding as much as I could while I am fairly young, and having less time with my soon to be born son.  Any advice?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "OK all.  First time posting here, long time lurker.  I have been working towards FI since I started working out of college 8 years ago, and think due to multiple factors I am on the precipice of actually being able to.  My apologies for the longer post, I will try to keep it brief but want to ensure I get the pertinent facts out so I receive the most informed advice / opinions.\n\nWORK: I do not enjoy what I do, although I am good at it (I work in corporate finance).  My weeks are currently in the 60 hour range, and are fairly high stress for a variety of factors.  Oh, I also just got promoted at work and now live in Switzerland which I don't think is 100% pertinent to the conversation here but perhaps is worth mentioning.  \n\nFINANCES: my wife and I started off our professional lives with about 110K in student debt (combined) which is now zero--we are 100% debt free.  Our net worth is roughly $1.2M.  Our annual spending is around $30K, but since we are expecting our first child I am bumping this up to $50K.  Our passive, usable income stands around $30K / year, but since that is rental based it will rise over time.  My wife, after spending about two years as a stay at home mom will want to return to work, where she does not plan on retiring early at all--she makes around $45K / year after taxes.  I too plan on working part time, either contract based seasonally (I snowboard professionally in the winter), or part time year round--call it perhaps $30-35K / year after taxes in terms of what I would bring in with this plan initially, with further upside as I \"tune\" things over the years.  \n\nI fully expect to still contribute to our Roth IRA (11,000/year), and have my wife contribute the max to any retirement program offered by her employer.  I would like to still keep saving as well--its fun, and will ensure we are able to continue forth on less income.  \n\nThe issue, as i see it, is that I am terrified of taking this jump--should it be something I can even do (not convinced).  Not sure what all you guys think, but I don't want to spend any more time than I have to working in a career I don't enjoy, not snowboarding as much as I could while I am fairly young, and having less time with my soon to be born son.  Any advice?\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65uawf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "atomant32", "saved": false, "mod_reports": [], "name": "t3_65uawf", "subreddit_name_prefixed": "r/financialindependence", "approved_by": null, "over_18": false, "domain": "self.financialindependence", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2t34z", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/financialindependence/comments/65uawf/can_i_responsibly_retire/", "num_reports": null, "locked": false, "stickied": false, "created": 1492444945.0, "url": "https://www.reddit.com/r/financialindependence/comments/65uawf/can_i_responsibly_retire/", "author_flair_text": null, "quarantine": false, "title": "Can I Responsibly Retire?", "created_utc": 1492416145.0, "distinguished": null, "media": null, "upvote_ratio": 0.62, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": "", "user_reports": [], "id": "dgd9vyt", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "The_5_Laws_Of_Gold", "parent_id": "t3_65uawf", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "So what you understand you say is that you want to retire only for 2 years while you have a child and then your income will fully support your expenses so at worst case scenario you will spend $100 000. Although I think that there i no way you will go up by $20 000 just because you have a child. Grates cost of having a child is childcare and since you will be at home this is not a case so you probably will spend more around $70 000 over 2 years\n\nSo at best case scenario you will spend $35 000 a year which can be fully supported by your part time job. At worst case scenario you will spend $50 000 a year with $35 000 a year from your part time job covered and leaves you with $15 000 a year to cover from your passive income which you can easily do. \n\nIf that is what you guys want to do in life then just go for it you can easily support this lifestyle and even earn more money than you spend after your retire. \n\nWe were in lucky position that my partner had 9 months full pay maternity leave and it helped us a lot in getting used to shock of having children so I do recommend taking that time off to anyone who can afford it. \n\nBe brave and take a leap man, don't do things you hate if you can do things you love and still save money. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So what you understand you say is that you want to retire only for 2 years while you have a child and then your income will fully support your expenses so at worst case scenario you will spend $100 000. Although I think that there i no way you will go up by $20 000 just because you have a child. Grates cost of having a child is childcare and since you will be at home this is not a case so you probably will spend more around $70 000 over 2 years&lt;/p&gt;\n\n&lt;p&gt;So at best case scenario you will spend $35 000 a year which can be fully supported by your part time job. At worst case scenario you will spend $50 000 a year with $35 000 a year from your part time job covered and leaves you with $15 000 a year to cover from your passive income which you can easily do. &lt;/p&gt;\n\n&lt;p&gt;If that is what you guys want to do in life then just go for it you can easily support this lifestyle and even earn more money than you spend after your retire. &lt;/p&gt;\n\n&lt;p&gt;We were in lucky position that my partner had 9 months full pay maternity leave and it helped us a lot in getting used to shock of having children so I do recommend taking that time off to anyone who can afford it. &lt;/p&gt;\n\n&lt;p&gt;Be brave and take a leap man, don&amp;#39;t do things you hate if you can do things you love and still save money. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgd9vyt", "score_hidden": false, "stickied": false, "created": 1492445736.0, "created_utc": 1492416936.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": "", "user_reports": [], "id": "dgdal6u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "atomant32", "parent_id": "t1_dgdag5y", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "Expenses are based on living in the US where the game plan would be implemented.   My wife is also here with me so no childcare expenses.   Switzerland is just a temporary living arrangement.   Hope this clarifies  and thanks for the response!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Expenses are based on living in the US where the game plan would be implemented.   My wife is also here with me so no childcare expenses.   Switzerland is just a temporary living arrangement.   Hope this clarifies  and thanks for the response!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgdal6u", "score_hidden": false, "stickied": false, "created": 1492448136.0, "created_utc": 1492419336.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdag5y", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "brele1", "parent_id": "t3_65uawf", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "your annual expense sounds unrealistically low for Switzerland unless you intend to leave. Childcare in Switzerland is also extraordinarily high", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;your annual expense sounds unrealistically low for Switzerland unless you intend to leave. Childcare in Switzerland is also extraordinarily high&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgdag5y", "score_hidden": false, "stickied": false, "created": 1492447646.0, "created_utc": 1492418846.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": "", "user_reports": [], "id": "dgddrh6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "expatfirepro", "parent_id": "t3_65uawf", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "Personally I would work until you bring home a healthy baby and the wife returns to work. This will add some cushion to your life plan, and allow you to see true baby expenses for about 2 years (don't forget to add healthcare and replacement costs for cars and large purchases into your spending). \n\nI would also have a serious discussion with my spouse to ensure she's fully on board with the approach. If you work that extra 3 years or so, that may be a good compromise. \n\nIt may help to simulate how many years your wife has to work until your investments cover your total expenses at a withdrawal rate that you feel comfortable. For example, if wife works for X years part time then the investments can support estimated spending at only 3% withdrawal rate. \n\nYour wife may appreciate you staying home while she works for X years, rather than planning to work \"forever\" while you stay at home. She may also find that after having the baby she wants to be a stay at home mom indefinitely. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally I would work until you bring home a healthy baby and the wife returns to work. This will add some cushion to your life plan, and allow you to see true baby expenses for about 2 years (don&amp;#39;t forget to add healthcare and replacement costs for cars and large purchases into your spending). &lt;/p&gt;\n\n&lt;p&gt;I would also have a serious discussion with my spouse to ensure she&amp;#39;s fully on board with the approach. If you work that extra 3 years or so, that may be a good compromise. &lt;/p&gt;\n\n&lt;p&gt;It may help to simulate how many years your wife has to work until your investments cover your total expenses at a withdrawal rate that you feel comfortable. For example, if wife works for X years part time then the investments can support estimated spending at only 3% withdrawal rate. &lt;/p&gt;\n\n&lt;p&gt;Your wife may appreciate you staying home while she works for X years, rather than planning to work &amp;quot;forever&amp;quot; while you stay at home. She may also find that after having the baby she wants to be a stay at home mom indefinitely. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgddrh6", "score_hidden": false, "stickied": false, "created": 1492458051.0, "created_utc": 1492429251.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": "", "user_reports": [], "id": "dge4sxw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kamesen99", "parent_id": "t3_65uawf", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "The issue I hear from you is that going from 100% to 0% off this high income career that got you to this situation in the first place is daunting. Reasonably so. The problem isn't whether your financials support your decision but rather \"is this a wise idea?\". My suggestion is there no reason why you have to quit cold turkey and instead maybe you should try to transition into the FI life in a more gradual way.\n\nMy recommendation is to request a part-time gig at your current place of employment with similar responsibilities. Say that for personal reasons you're only able to work 32 hours per week going forward, you understand this is a sacrifice for your employer, but you'd be willing to take the pay cut that comes with reduced hours. Ideally you'd keep benefits but ultimately it's up to you whether it's worth it. They may only offer part time gigs as 30 hours with no benefits. You will have less projects to oversee, less accounts to manage, less applications to process, etc.\n\nThis way you don't jump into something that may be potentially damaging, and you're time diversified. You add more time into your schedule, you only work 6 hours a day, or 3.5 days a week, depending how you want to schedule it. I understand you're currently on assignment but you can stay in your current situation until your assignment is done or speak frankly with your management (if the assignment is longer than a year and you hate where you live) and say \"you can bring me back from assignment for part time, or risk losing me entirely\". It's likely your management sees you as an asset and is willing to comprise somewhat to keep you on board. Keep this in mind. \n\nThe point is to eventually be in a place where you're comfortable enough to pull the trigger whether that's 6 months or a couple of years. Good luck.", "edited": 1492463785.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The issue I hear from you is that going from 100% to 0% off this high income career that got you to this situation in the first place is daunting. Reasonably so. The problem isn&amp;#39;t whether your financials support your decision but rather &amp;quot;is this a wise idea?&amp;quot;. My suggestion is there no reason why you have to quit cold turkey and instead maybe you should try to transition into the FI life in a more gradual way.&lt;/p&gt;\n\n&lt;p&gt;My recommendation is to request a part-time gig at your current place of employment with similar responsibilities. Say that for personal reasons you&amp;#39;re only able to work 32 hours per week going forward, you understand this is a sacrifice for your employer, but you&amp;#39;d be willing to take the pay cut that comes with reduced hours. Ideally you&amp;#39;d keep benefits but ultimately it&amp;#39;s up to you whether it&amp;#39;s worth it. They may only offer part time gigs as 30 hours with no benefits. You will have less projects to oversee, less accounts to manage, less applications to process, etc.&lt;/p&gt;\n\n&lt;p&gt;This way you don&amp;#39;t jump into something that may be potentially damaging, and you&amp;#39;re time diversified. You add more time into your schedule, you only work 6 hours a day, or 3.5 days a week, depending how you want to schedule it. I understand you&amp;#39;re currently on assignment but you can stay in your current situation until your assignment is done or speak frankly with your management (if the assignment is longer than a year and you hate where you live) and say &amp;quot;you can bring me back from assignment for part time, or risk losing me entirely&amp;quot;. It&amp;#39;s likely your management sees you as an asset and is willing to comprise somewhat to keep you on board. Keep this in mind. &lt;/p&gt;\n\n&lt;p&gt;The point is to eventually be in a place where you&amp;#39;re comfortable enough to pull the trigger whether that&amp;#39;s 6 months or a couple of years. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dge4sxw", "score_hidden": false, "stickied": false, "created": 1492492395.0, "created_utc": 1492463595.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": "", "user_reports": [], "id": "dgda5hj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "montalvv", "parent_id": "t3_65uawf", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "You don't say how old you are, but I'm guessing around 30, in which case, your remaining professional snow-boarding years are stastically limited. For that reason alone I would say - go for it. \n\nWorst case scenario is (God forbid) you should get seriously injured and no longer be able to work. In that case, your wife and baby need to be covered by insurance to help with paying for any care you need and day care expenses for the baby while she works. So sort that out before you finish your current job. Also, think about location - will you be able to stay in Switz after you quit, or do you plan to move somewhere else? Maybe pay for the move before you quit.\n\nYou can always come back to work in finance after a year if you end up not liking the lifestyle...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t say how old you are, but I&amp;#39;m guessing around 30, in which case, your remaining professional snow-boarding years are stastically limited. For that reason alone I would say - go for it. &lt;/p&gt;\n\n&lt;p&gt;Worst case scenario is (God forbid) you should get seriously injured and no longer be able to work. In that case, your wife and baby need to be covered by insurance to help with paying for any care you need and day care expenses for the baby while she works. So sort that out before you finish your current job. Also, think about location - will you be able to stay in Switz after you quit, or do you plan to move somewhere else? Maybe pay for the move before you quit.&lt;/p&gt;\n\n&lt;p&gt;You can always come back to work in finance after a year if you end up not liking the lifestyle...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgda5hj", "score_hidden": false, "stickied": false, "created": 1492446624.0, "created_utc": 1492417824.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": "", "user_reports": [], "id": "dgdf7es", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ER10years_throwaway", "parent_id": "t3_65uawf", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "&gt;Responsibly\n\nYou'll get good advice in this thread, but IMO it depends in large part on your risk tolerance. What is it?\n\n&gt; we are expecting our first child\n\nYou don't mention this and I'm sure you've thought of it, and I have no idea what your medical situation would be in Switzerland, but here goes anyway. If you're dependent in any way on employer-sponsored health insurance, please consider working until maybe a year after your kid comes along. There are many many many possible complications, again, as I'm sure you know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Responsibly&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;ll get good advice in this thread, but IMO it depends in large part on your risk tolerance. What is it?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;we are expecting our first child&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You don&amp;#39;t mention this and I&amp;#39;m sure you&amp;#39;ve thought of it, and I have no idea what your medical situation would be in Switzerland, but here goes anyway. If you&amp;#39;re dependent in any way on employer-sponsored health insurance, please consider working until maybe a year after your kid comes along. There are many many many possible complications, again, as I&amp;#39;m sure you know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgdf7es", "score_hidden": false, "stickied": false, "created": 1492461214.0, "created_utc": 1492432414.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": "", "user_reports": [], "id": "dgdjcs1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "atomant32", "parent_id": "t1_dgdgupg", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "My wife will continue to work, so we will be covered for a long time by her employer program.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My wife will continue to work, so we will be covered for a long time by her employer program.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgdjcs1", "score_hidden": false, "stickied": false, "created": 1492467870.0, "created_utc": 1492439070.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdgupg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jmcgonig", "parent_id": "t3_65uawf", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "Health insurance?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Health insurance?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgdgupg", "score_hidden": false, "stickied": false, "created": 1492464145.0, "created_utc": 1492435345.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": "", "user_reports": [], "id": "dgde4ga", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "expatfirepro", "parent_id": "t3_65uawf", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "One final note. Your wife may also decide during her 2 years at home that a second baby is in the cards. \n\nYou're doing great and obviously concerned about your current plan. There's a lot of uncertainty with kids so it doesn't hurt to wait until your crystal ball is less cloudy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One final note. Your wife may also decide during her 2 years at home that a second baby is in the cards. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re doing great and obviously concerned about your current plan. There&amp;#39;s a lot of uncertainty with kids so it doesn&amp;#39;t hurt to wait until your crystal ball is less cloudy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgde4ga", "score_hidden": false, "stickied": false, "created": 1492458910.0, "created_utc": 1492430110.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": "", "user_reports": [], "id": "dgdfgew", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lsp2005", "parent_id": "t3_65uawf", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "I would not take the jump until you have fully formed your family and then I would wait until the child is two years old to make sure you are not planning for a second child. Could you take a two month sabbatical to snowboard professionally? Honestly, that has a short shelf life, where you likely are doing it until about 35 or injured.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would not take the jump until you have fully formed your family and then I would wait until the child is two years old to make sure you are not planning for a second child. Could you take a two month sabbatical to snowboard professionally? Honestly, that has a short shelf life, where you likely are doing it until about 35 or injured.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgdfgew", "score_hidden": false, "stickied": false, "created": 1492461697.0, "created_utc": 1492432897.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": "", "user_reports": [], "id": "dgdjbug", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "atomant32", "parent_id": "t1_dgdi3j4", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "That is the plan, to work part time or seasonally.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is the plan, to work part time or seasonally.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgdjbug", "score_hidden": false, "stickied": false, "created": 1492467836.0, "created_utc": 1492439036.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdi3j4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "753UDKM", "parent_id": "t3_65uawf", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "Maybe work part time, or do some contract analyst type jobs to pad your savings a bit?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe work part time, or do some contract analyst type jobs to pad your savings a bit?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgdi3j4", "score_hidden": false, "stickied": false, "created": 1492466095.0, "created_utc": 1492437295.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": "", "user_reports": [], "id": "dge3b14", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fireSPOUSE", "parent_id": "t3_65uawf", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "I think the big \"if\" is whether you wife will really want to return to work in two years. A LOT of parents decide that they'd rather stay at home for 4-5, until the child is in school. And then you could always end up wanting a second kid (because kids are fun) and that 5 years turns into 7-8. If you plan works then you're fine, but you're essentially giving up the freedom to have your wife stay home longer before the baby even arrives.   \nI personally meant to pursue a second engineering degree while staying home with two kids for 5-7 years. I ended up with four kids and haven't been back to work for 15 years. Planning for life is different than living it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the big &amp;quot;if&amp;quot; is whether you wife will really want to return to work in two years. A LOT of parents decide that they&amp;#39;d rather stay at home for 4-5, until the child is in school. And then you could always end up wanting a second kid (because kids are fun) and that 5 years turns into 7-8. If you plan works then you&amp;#39;re fine, but you&amp;#39;re essentially giving up the freedom to have your wife stay home longer before the baby even arrives.&lt;br/&gt;\nI personally meant to pursue a second engineering degree while staying home with two kids for 5-7 years. I ended up with four kids and haven&amp;#39;t been back to work for 15 years. Planning for life is different than living it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dge3b14", "score_hidden": false, "stickied": false, "created": 1492490684.0, "created_utc": 1492461884.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": "", "user_reports": [], "id": "dgdj8uz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FI_notRE", "parent_id": "t1_dgdgpmm", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "I agree, everyone talks about baby equipment, clothes, etc., that's all rounding error if done properly compared to the cost of childcare.  So, if you're going to FIRE and/or have a SAHP, they shouldn't be too expensive.  If you're paying childcare, I don't think 20k a year is enough of a budget unless you're sure you're going to have one.\n\nEdit:  Also, my vote is quit your job, you have enough money, especially since you can find part time work you enjoy over the next 20 years to try to grow your investments instead of using SWR for all of them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree, everyone talks about baby equipment, clothes, etc., that&amp;#39;s all rounding error if done properly compared to the cost of childcare.  So, if you&amp;#39;re going to FIRE and/or have a SAHP, they shouldn&amp;#39;t be too expensive.  If you&amp;#39;re paying childcare, I don&amp;#39;t think 20k a year is enough of a budget unless you&amp;#39;re sure you&amp;#39;re going to have one.&lt;/p&gt;\n\n&lt;p&gt;Edit:  Also, my vote is quit your job, you have enough money, especially since you can find part time work you enjoy over the next 20 years to try to grow your investments instead of using SWR for all of them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgdj8uz", "score_hidden": false, "stickied": false, "created": 1492467721.0, "created_utc": 1492438921.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": "", "user_reports": [], "id": "dgdjbc2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "atomant32", "parent_id": "t1_dgdgpmm", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "The $20 is admittedly high for a baby, but I am including additional health insurance costs, home costs, etc... so yeah, its a bit much but I felt that if I need $40K and shoot and cover for $50K, then its a bit of \"buffer\" in the plan. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The $20 is admittedly high for a baby, but I am including additional health insurance costs, home costs, etc... so yeah, its a bit much but I felt that if I need $40K and shoot and cover for $50K, then its a bit of &amp;quot;buffer&amp;quot; in the plan. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgdjbc2", "score_hidden": false, "stickied": false, "created": 1492467816.0, "created_utc": 1492439016.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdgpmm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gumbytex", "parent_id": "t3_65uawf", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "$20k for a baby?!  Holy smokes!  Unless that's medical costs, disavow yourself the notion that kids are expensive (if you're retiring and don't have to pay for child care).  Buy ALL their stuff used from garage sales, thrift stores, and get hand-me-downs.  They don't care.  Kids can be super cheap, especially young ones.\n\nYes, you're set.  Pull the plug.  Stop trading money for time, you have enough money.  You're young enough that if things don't work out as you planned (even though it looks like they should), you can earn more money, acquire new skills, etc.", "edited": 1492435435.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;$20k for a baby?!  Holy smokes!  Unless that&amp;#39;s medical costs, disavow yourself the notion that kids are expensive (if you&amp;#39;re retiring and don&amp;#39;t have to pay for child care).  Buy ALL their stuff used from garage sales, thrift stores, and get hand-me-downs.  They don&amp;#39;t care.  Kids can be super cheap, especially young ones.&lt;/p&gt;\n\n&lt;p&gt;Yes, you&amp;#39;re set.  Pull the plug.  Stop trading money for time, you have enough money.  You&amp;#39;re young enough that if things don&amp;#39;t work out as you planned (even though it looks like they should), you can earn more money, acquire new skills, etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgdgpmm", "score_hidden": false, "stickied": false, "created": 1492463922.0, "created_utc": 1492435122.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t34z", "removal_reason": null, "link_id": "t3_65uawf", "likes": null, "replies": "", "user_reports": [], "id": "dgdk4cq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ILMG07", "parent_id": "t3_65uawf", "subreddit_name_prefixed": "r/financialindependence", "controversiality": 0, "body": "1) You are way overestimating the cost of a kid (unless you want to be more specific-- are you going to send them to a fancy prep school K-12?).\n\n2) This is a slam dunk as much as anyone can ever have. If the plan is a plan you can stick to, you are golden with plenty of cushion and alternatives.\n\n3) On the other hand, you are young and you and wife may not end up wanting to stick to the plan. She may change her mind about going back to work, for example, or hate working when you aren't, or you might both want more kids, etc. I wouldn't necessarily refrain from pulling the trigger but I would mentally prepare, together, for a number of possible outcomes including you deciding to go back to work at some point (which shouldn't be hard if you are staying up to date with contracting work from time to time).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1) You are way overestimating the cost of a kid (unless you want to be more specific-- are you going to send them to a fancy prep school K-12?).&lt;/p&gt;\n\n&lt;p&gt;2) This is a slam dunk as much as anyone can ever have. If the plan is a plan you can stick to, you are golden with plenty of cushion and alternatives.&lt;/p&gt;\n\n&lt;p&gt;3) On the other hand, you are young and you and wife may not end up wanting to stick to the plan. She may change her mind about going back to work, for example, or hate working when you aren&amp;#39;t, or you might both want more kids, etc. I wouldn&amp;#39;t necessarily refrain from pulling the trigger but I would mentally prepare, together, for a number of possible outcomes including you deciding to go back to work at some point (which shouldn&amp;#39;t be hard if you are staying up to date with contracting work from time to time).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "financialindependence", "name": "t1_dgdk4cq", "score_hidden": false, "stickied": false, "created": 1492468893.0, "created_utc": 1492440093.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]