[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Physics", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Upon taking three years to find myself and work out my mental setbacks, I&amp;#39;ve ardently come to the conclusion that I need to further our understanding of existence and anything outside of it. However, the problem arises when it comes down to personal identity and passion for my hobbies.&lt;/p&gt;\n\n&lt;p&gt;To reach my full potential, I feel I need to cut out most activities unnecessary to my academic aspirations. Nowadays I&amp;#39;m quite hard-pressed and poor and can&amp;#39;t afford the aggregate of my extended education, social life, and expensive (plus time-consuming) hobbies of music and computer science. Thus, I&amp;#39;m at a predicament of time/life management.&lt;/p&gt;\n\n&lt;p&gt;[TLDR] From your experience, have you ever felt the need to purge your life of transitory desires (albeit enjoyable) to focus on your studies? What has been worth the sacrifice? And perhaps most importantly, have your changes/growths and sacrifices negatively affected your lifelong personal identity and/or mental health?&lt;/p&gt;\n\n&lt;p&gt;Extras::\nI&amp;#39;m on my way to my 22nd birthday. I&amp;#39;m quite susceptible to depression, anxiety, and psychosis, but recent medication has me back on track and more ambitious than ever. Due to anxiety, I might not check or reply to some comments for a bit. I apologize, but internet people can be ruthless and I don&amp;#39;t handle it well. I was wasteful with my earlier youth and have become rather diverted from academia, though I truly believe if I put in enough time and effort that I can join the ranks of intellectuals making headway in understanding the true nature and elementary engineering of the universe. As it stands, my primary setbacks are my finances and the fear of loss of welfare from giving up personal identity (albeit faulty and peripheral) in pursuit of undiluted knowledge and problem-solving.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Upon taking three years to find myself and work out my mental setbacks, I've ardently come to the conclusion that I need to further our understanding of existence and anything outside of it. However, the problem arises when it comes down to personal identity and passion for my hobbies.\n\nTo reach my full potential, I feel I need to cut out most activities unnecessary to my academic aspirations. Nowadays I'm quite hard-pressed and poor and can't afford the aggregate of my extended education, social life, and expensive (plus time-consuming) hobbies of music and computer science. Thus, I'm at a predicament of time/life management.\n\n[TLDR] From your experience, have you ever felt the need to purge your life of transitory desires (albeit enjoyable) to focus on your studies? What has been worth the sacrifice? And perhaps most importantly, have your changes/growths and sacrifices negatively affected your lifelong personal identity and/or mental health?\n\nExtras::\nI'm on my way to my 22nd birthday. I'm quite susceptible to depression, anxiety, and psychosis, but recent medication has me back on track and more ambitious than ever. Due to anxiety, I might not check or reply to some comments for a bit. I apologize, but internet people can be ruthless and I don't handle it well. I was wasteful with my earlier youth and have become rather diverted from academia, though I truly believe if I put in enough time and effort that I can join the ranks of intellectuals making headway in understanding the true nature and elementary engineering of the universe. As it stands, my primary setbacks are my finances and the fear of loss of welfare from giving up personal identity (albeit faulty and peripheral) in pursuit of undiluted knowledge and problem-solving.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Question", "id": "64pipt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "sentientearthdweller", "saved": false, "mod_reports": [], "name": "t3_64pipt", "subreddit_name_prefixed": "r/Physics", "approved_by": null, "over_18": false, "domain": "self.Physics", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhi6", "edited": false, "link_flair_css_class": "question", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Physics/comments/64pipt/how_far_is_too_far_when_devoting_my_life_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1491926493.0, "url": "https://www.reddit.com/r/Physics/comments/64pipt/how_far_is_too_far_when_devoting_my_life_to/", "author_flair_text": null, "quarantine": false, "title": "How far is too far when devoting my life to physics?", "created_utc": 1491897693.0, "distinguished": null, "media": null, "upvote_ratio": 0.56, "num_comments": 19, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": "", "user_reports": [], "id": "dg4uiv5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sentientearthdweller", "parent_id": "t1_dg45pjj", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "You're right; the aspect of diversity itself is important academically, socially, and mentally. Thanks for the insight.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right; the aspect of diversity itself is important academically, socially, and mentally. Thanks for the insight.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg4uiv5", "score_hidden": false, "stickied": false, "created": 1491970437.0, "created_utc": 1491941637.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg45pjj", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "spyder575", "parent_id": "t3_64pipt", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "I'm in my last year of undergraduate now, and I would strongly recommend that you retain a sense of identity separate from physics. Take it from someone who has already made the mistake that you're thinking of making. \n\nAll passions have ebbs and flows over time, and if you limit yourself to only your passion then you will be left empty during the 'ebb'. A bad 'physics' day will then follow you around in your free time and end up being a bad week or month or year. You end up basing your self-worth on your ability in obscure skills in physics (which may not even be of much use to you later on in your career), since you have nothing else to base yourself on. Devoting yourself only to one thing will also leave you a bland human being, which won't help you in your journey into academia. Selection committees for a wide range of things (monetary scholarships included) want to see diversity and breadth in your interests and skills. \n\nTry keeping some friends who are not also studying physics and/or don't want to discuss any aspect of it. Keep some hobbies that are not physics related. You need to have a good answer to the question \"what do you do outside of physics?\". I don't have an answer to that (my answer is \"nothing\"), and I feel incredibly hollow as a result. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in my last year of undergraduate now, and I would strongly recommend that you retain a sense of identity separate from physics. Take it from someone who has already made the mistake that you&amp;#39;re thinking of making. &lt;/p&gt;\n\n&lt;p&gt;All passions have ebbs and flows over time, and if you limit yourself to only your passion then you will be left empty during the &amp;#39;ebb&amp;#39;. A bad &amp;#39;physics&amp;#39; day will then follow you around in your free time and end up being a bad week or month or year. You end up basing your self-worth on your ability in obscure skills in physics (which may not even be of much use to you later on in your career), since you have nothing else to base yourself on. Devoting yourself only to one thing will also leave you a bland human being, which won&amp;#39;t help you in your journey into academia. Selection committees for a wide range of things (monetary scholarships included) want to see diversity and breadth in your interests and skills. &lt;/p&gt;\n\n&lt;p&gt;Try keeping some friends who are not also studying physics and/or don&amp;#39;t want to discuss any aspect of it. Keep some hobbies that are not physics related. You need to have a good answer to the question &amp;quot;what do you do outside of physics?&amp;quot;. I don&amp;#39;t have an answer to that (my answer is &amp;quot;nothing&amp;quot;), and I feel incredibly hollow as a result. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg45pjj", "score_hidden": false, "stickied": false, "created": 1491940934.0, "created_utc": 1491912134.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": "", "user_reports": [], "id": "dg4utxt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sentientearthdweller", "parent_id": "t1_dg461f5", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "Yeah, you're probably right. I have so much interest and curiosity in the matter that I don't want to waste time, but the last thing I want is to lose interest or perspective.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, you&amp;#39;re probably right. I have so much interest and curiosity in the matter that I don&amp;#39;t want to waste time, but the last thing I want is to lose interest or perspective.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg4utxt", "score_hidden": false, "stickied": false, "created": 1491970779.0, "created_utc": 1491941979.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg461f5", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "stathibus", "parent_id": "t3_64pipt", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "If you carry on this way you will burn out within a year. Take a breath.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you carry on this way you will burn out within a year. Take a breath.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg461f5", "score_hidden": false, "stickied": false, "created": 1491941567.0, "created_utc": 1491912767.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": "", "user_reports": [], "id": "dg4wy2u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sentientearthdweller", "parent_id": "t1_dg46zh8", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "Naïvety is the crux of youth. Your fire hydrant and muddy well analogies work really well at addressing how I feel now and the uncertainty of where I'll be down the road. Sometimes it seems family, finances, and fun are the suppressors of personal potential, but I've come to understand that I don't understand as much as I think. Progression is most important to me, but I can't argue against the importance of balance and satisfaction -- with or without modelling perturbations to the simple harmonic motion of a cryogenic torsion pendulum. Thanks, you sound like you'd make a good mentor.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Naïvety is the crux of youth. Your fire hydrant and muddy well analogies work really well at addressing how I feel now and the uncertainty of where I&amp;#39;ll be down the road. Sometimes it seems family, finances, and fun are the suppressors of personal potential, but I&amp;#39;ve come to understand that I don&amp;#39;t understand as much as I think. Progression is most important to me, but I can&amp;#39;t argue against the importance of balance and satisfaction -- with or without modelling perturbations to the simple harmonic motion of a cryogenic torsion pendulum. Thanks, you sound like you&amp;#39;d make a good mentor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg4wy2u", "score_hidden": false, "stickied": false, "created": 1491973165.0, "created_utc": 1491944365.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg46zh8", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "thatnerdd", "parent_id": "t3_64pipt", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "Hi Sentientearthdweller,\n\nI think you want to take the exact opposite approach. It's very easy to to lose yourself in what you're doing, and it makes you vulnerable to exploitation. I know it can be hard to hear, but while the natural sciences are better than some areas, there are still people who are willing to use everything you have to give without giving anything back to you.\n\nThere's an excellent book on the subject, [Disciplined Minds](https://www.amazon.com/dp/B008GRDKPG/ref=dp-kindle-redirect?_encoding=UTF8&amp;btkr=1), by Jeff Schmidt.\n\nAs for my own experience, I entered graduate school in physics at 23, because there was nothing more interesting or worthwhile for me to do with my life beyond finding the outer bounds of human knowledge, and spending the rest of my life extending it as best as I could.\n\nOver the course of grad school, I got married to another academic and had two kids. My wife was in a less \"employable\" field outside of academia (Sociology), and I wasn't interested in solving [the two body problem](https://en.wikipedia.org/wiki/Two-body_problem_\\(career\\)).\n\nI also found physics research to be much less satisfying than I expected. When you're an undergraduate or grad student, you're drinking from the \"fire hydrant\" of knowledge: there's all you can swallow and then so much more. Academic research is more like digging a well in the mud with a teaspoon. You're thirsty all the time, and every now and then you get a few sips of muddy water. After that Master's, here's what I added to my knowledge base: I became an expert in torsion pendulums, learned a bit about machining metal, got some (inadequate) programming skills, and learned about handling cryogenic fluids and working with ultra-high vacuum equipment. Interesting stuff, as such things go, but a far cry from learning about the fundamentals of the universe, even though I was involved in some pretty basic research (measuring gravity: G, the Inverse-Square Law, and the Equivalence Principle). \n\nThe bottom line is, I left academia with a Ph.D., but to be honest, by the time I finished, the only reason why I finished is because I started. I had other priorities. I'm glad there are people doing basic research, but I wasn't about to spend years making a post-doc salary and then trying to figure out the tenure track grind while trying to coordinate with my wife's career and raise our children. \n\nThese days, I work in the tech industry, at a database company. My physics Ph.D. is basically just a marketing stamp on my resume, and it's nice that it gets me job interviews, but it's strange that I spent my twenties working on it and now it's not contributing in any meaningful way to what I do, and that its value lies primarily in being able to impress others. Truthfully, though, I'm happy. The challenges of my job are just as interesting as the puzzles I solved on a regular basis in graduate school. I love my colleagues, I get to spend time with my family, and I make a comfortable living for myself and my family, doing something that I love. I was able to move to support my wife's (successful) career as a professor, and I don't miss what might have been. I got enough of a taste of it, and I'm happier doing what I'm doing than I would have been. I deal with puzzles daily, and figuring out how to efficiently store and retrieve data from a machine is every bit as satisfying as learning how to model perturbations to the simple harmonic motion of a cryogenic torsion pendulum.\n\nThe bottom line is, should you go to grad school, the \"you\" that enters won't be the same as the \"you\" that graduates. You'll be shaped by your experiences along the way, and your priorities will shift. If you don't mind me being a little blunt, you'll also be less naive. And those will be changes that you will value, and you may not be as interested in what you're interested in, now.\n\nThe bottom line is, the finances shouldn't be too much of an issue; you'll be fine, regardless. The personal identity is the real thing you want to work hard to preserve, in the field or out. \n\nSincerely,\n\n-Thatnerdd", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi Sentientearthdweller,&lt;/p&gt;\n\n&lt;p&gt;I think you want to take the exact opposite approach. It&amp;#39;s very easy to to lose yourself in what you&amp;#39;re doing, and it makes you vulnerable to exploitation. I know it can be hard to hear, but while the natural sciences are better than some areas, there are still people who are willing to use everything you have to give without giving anything back to you.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s an excellent book on the subject, &lt;a href=\"https://www.amazon.com/dp/B008GRDKPG/ref=dp-kindle-redirect?_encoding=UTF8&amp;amp;btkr=1\"&gt;Disciplined Minds&lt;/a&gt;, by Jeff Schmidt.&lt;/p&gt;\n\n&lt;p&gt;As for my own experience, I entered graduate school in physics at 23, because there was nothing more interesting or worthwhile for me to do with my life beyond finding the outer bounds of human knowledge, and spending the rest of my life extending it as best as I could.&lt;/p&gt;\n\n&lt;p&gt;Over the course of grad school, I got married to another academic and had two kids. My wife was in a less &amp;quot;employable&amp;quot; field outside of academia (Sociology), and I wasn&amp;#39;t interested in solving &lt;a href=\"https://en.wikipedia.org/wiki/Two-body_problem_(career)\"&gt;the two body problem&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;I also found physics research to be much less satisfying than I expected. When you&amp;#39;re an undergraduate or grad student, you&amp;#39;re drinking from the &amp;quot;fire hydrant&amp;quot; of knowledge: there&amp;#39;s all you can swallow and then so much more. Academic research is more like digging a well in the mud with a teaspoon. You&amp;#39;re thirsty all the time, and every now and then you get a few sips of muddy water. After that Master&amp;#39;s, here&amp;#39;s what I added to my knowledge base: I became an expert in torsion pendulums, learned a bit about machining metal, got some (inadequate) programming skills, and learned about handling cryogenic fluids and working with ultra-high vacuum equipment. Interesting stuff, as such things go, but a far cry from learning about the fundamentals of the universe, even though I was involved in some pretty basic research (measuring gravity: G, the Inverse-Square Law, and the Equivalence Principle). &lt;/p&gt;\n\n&lt;p&gt;The bottom line is, I left academia with a Ph.D., but to be honest, by the time I finished, the only reason why I finished is because I started. I had other priorities. I&amp;#39;m glad there are people doing basic research, but I wasn&amp;#39;t about to spend years making a post-doc salary and then trying to figure out the tenure track grind while trying to coordinate with my wife&amp;#39;s career and raise our children. &lt;/p&gt;\n\n&lt;p&gt;These days, I work in the tech industry, at a database company. My physics Ph.D. is basically just a marketing stamp on my resume, and it&amp;#39;s nice that it gets me job interviews, but it&amp;#39;s strange that I spent my twenties working on it and now it&amp;#39;s not contributing in any meaningful way to what I do, and that its value lies primarily in being able to impress others. Truthfully, though, I&amp;#39;m happy. The challenges of my job are just as interesting as the puzzles I solved on a regular basis in graduate school. I love my colleagues, I get to spend time with my family, and I make a comfortable living for myself and my family, doing something that I love. I was able to move to support my wife&amp;#39;s (successful) career as a professor, and I don&amp;#39;t miss what might have been. I got enough of a taste of it, and I&amp;#39;m happier doing what I&amp;#39;m doing than I would have been. I deal with puzzles daily, and figuring out how to efficiently store and retrieve data from a machine is every bit as satisfying as learning how to model perturbations to the simple harmonic motion of a cryogenic torsion pendulum.&lt;/p&gt;\n\n&lt;p&gt;The bottom line is, should you go to grad school, the &amp;quot;you&amp;quot; that enters won&amp;#39;t be the same as the &amp;quot;you&amp;quot; that graduates. You&amp;#39;ll be shaped by your experiences along the way, and your priorities will shift. If you don&amp;#39;t mind me being a little blunt, you&amp;#39;ll also be less naive. And those will be changes that you will value, and you may not be as interested in what you&amp;#39;re interested in, now.&lt;/p&gt;\n\n&lt;p&gt;The bottom line is, the finances shouldn&amp;#39;t be too much of an issue; you&amp;#39;ll be fine, regardless. The personal identity is the real thing you want to work hard to preserve, in the field or out. &lt;/p&gt;\n\n&lt;p&gt;Sincerely,&lt;/p&gt;\n\n&lt;p&gt;-Thatnerdd&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg46zh8", "score_hidden": false, "stickied": false, "created": 1491943226.0, "created_utc": 1491914426.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": "", "user_reports": [], "id": "dg4xb6a", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sentientearthdweller", "parent_id": "t1_dg460dm", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "\"Purge\" is probably too harsh of an action. However, studying and theorizing are my favorite hobbies, so unless I burn out (likely, it seems, with this mindset) I'd receive both satisfaction and progression in academia. I'm great with numbers, but iffy at maintaining a stable mind. An increased focus on the latter is probably the right idea. Thanks, I'll keep that in mind.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Purge&amp;quot; is probably too harsh of an action. However, studying and theorizing are my favorite hobbies, so unless I burn out (likely, it seems, with this mindset) I&amp;#39;d receive both satisfaction and progression in academia. I&amp;#39;m great with numbers, but iffy at maintaining a stable mind. An increased focus on the latter is probably the right idea. Thanks, I&amp;#39;ll keep that in mind.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg4xb6a", "score_hidden": false, "stickied": false, "created": 1491973586.0, "created_utc": 1491944786.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg460dm", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "TheSumOfAllPeanuts", "parent_id": "t3_64pipt", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "I think balance is key, so \"purging\" sounds like an idea that wouldn't work for me. Studying seriously requires giving up some free time, however it is very difficult to study (or do anything really) when you're miserable. Beyond that, what's the point if it makes you unhappy? So what you should go for is finding the right mix of studying and off-time, so that you can be happy and also get ahead in physics.  \nThat being said, and keeping with the theme of the importance of happiness, my opinion is that taking care of your mental health is by far the most important thing. More than understanding existence, reaching your potential, undiluted knowledge, or any other motivations you might have. That has to come first whenever you're making these kinds of decisions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think balance is key, so &amp;quot;purging&amp;quot; sounds like an idea that wouldn&amp;#39;t work for me. Studying seriously requires giving up some free time, however it is very difficult to study (or do anything really) when you&amp;#39;re miserable. Beyond that, what&amp;#39;s the point if it makes you unhappy? So what you should go for is finding the right mix of studying and off-time, so that you can be happy and also get ahead in physics.&lt;br/&gt;\nThat being said, and keeping with the theme of the importance of happiness, my opinion is that taking care of your mental health is by far the most important thing. More than understanding existence, reaching your potential, undiluted knowledge, or any other motivations you might have. That has to come first whenever you&amp;#39;re making these kinds of decisions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg460dm", "score_hidden": false, "stickied": false, "created": 1491941515.0, "created_utc": 1491912715.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": "", "user_reports": [], "id": "dg4y939", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sentientearthdweller", "parent_id": "t1_dg4apmv", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "Using my time efficiently and staying on task are two things I hope to reign in, and I can see how happiness and productivity could benefit eachother in the long run. Moreover, your note of continuing to reevaluate priorities really sticks out to me. It's something I've struggled with in the past, and I get lost in the philosophy of it all rather quickly. Your experience in the line of physics seems to be shared by plenty others; still, I'm young and naïve and probing the depths of reality burns in my chest. Best of luck in grad school.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Using my time efficiently and staying on task are two things I hope to reign in, and I can see how happiness and productivity could benefit eachother in the long run. Moreover, your note of continuing to reevaluate priorities really sticks out to me. It&amp;#39;s something I&amp;#39;ve struggled with in the past, and I get lost in the philosophy of it all rather quickly. Your experience in the line of physics seems to be shared by plenty others; still, I&amp;#39;m young and naïve and probing the depths of reality burns in my chest. Best of luck in grad school.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg4y939", "score_hidden": false, "stickied": false, "created": 1491974721.0, "created_utc": 1491945921.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4apmv", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "greenlaser3", "parent_id": "t3_64pipt", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "I don't think the sacrifice is worth it. Rather than asking yourself \"how can I spend more time working?\" you're better off asking \"how can I use my work time more effectively?\" First decide how much time is worth spending on your work, and then try to maximize how you use that time.\n\nPersonally, I've cut down my working hours a lot since starting grad school. Maybe I get less done than I could in the short term, but I'm happy, I'm not on track to burn out, and I'm still pretty productive. I think that having the discipline to say \"no, I need to finish this *before* the weekend\" has made me a lot more efficient with my time. I'm a little less productive, but a lot happier with my life. Of course, it depends on your priorities. Some people do seem to throw their entire lives into their work and they're very happy. But you really have to evaluate your priorities. (And keep reevaluating them as you move forward!) \n\nAnd for physics especially, you have to be careful of getting caught up in the grandiose vision of \"probing the depths of reality\" or whatever. In practise, physics is almost nothing like that. You spend months wrestling with a problem, and you finally make a little bit of progress on something that very few people care about. You almost have to love the *process* more than the results. But the point is -- don't throw your life into physics because of some grand vision of furthering humanity. Do it because you love doing it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think the sacrifice is worth it. Rather than asking yourself &amp;quot;how can I spend more time working?&amp;quot; you&amp;#39;re better off asking &amp;quot;how can I use my work time more effectively?&amp;quot; First decide how much time is worth spending on your work, and then try to maximize how you use that time.&lt;/p&gt;\n\n&lt;p&gt;Personally, I&amp;#39;ve cut down my working hours a lot since starting grad school. Maybe I get less done than I could in the short term, but I&amp;#39;m happy, I&amp;#39;m not on track to burn out, and I&amp;#39;m still pretty productive. I think that having the discipline to say &amp;quot;no, I need to finish this &lt;em&gt;before&lt;/em&gt; the weekend&amp;quot; has made me a lot more efficient with my time. I&amp;#39;m a little less productive, but a lot happier with my life. Of course, it depends on your priorities. Some people do seem to throw their entire lives into their work and they&amp;#39;re very happy. But you really have to evaluate your priorities. (And keep reevaluating them as you move forward!) &lt;/p&gt;\n\n&lt;p&gt;And for physics especially, you have to be careful of getting caught up in the grandiose vision of &amp;quot;probing the depths of reality&amp;quot; or whatever. In practise, physics is almost nothing like that. You spend months wrestling with a problem, and you finally make a little bit of progress on something that very few people care about. You almost have to love the &lt;em&gt;process&lt;/em&gt; more than the results. But the point is -- don&amp;#39;t throw your life into physics because of some grand vision of furthering humanity. Do it because you love doing it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg4apmv", "score_hidden": false, "stickied": false, "created": 1491948541.0, "created_utc": 1491919741.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": "", "user_reports": [], "id": "dg4l2zl", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MagicUnicornLove", "parent_id": "t3_64pipt", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "In addition to what other people have been saying, I'll note that grad school is a breeding ground for the type of mental illness you already consider yourself susceptible to. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In addition to what other people have been saying, I&amp;#39;ll note that grad school is a breeding ground for the type of mental illness you already consider yourself susceptible to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg4l2zl", "score_hidden": false, "stickied": false, "created": 1491960197.0, "created_utc": 1491931397.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": "", "user_reports": [], "id": "dg46z7u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "iorgfeflkd", "parent_id": "t3_64pipt", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "It's all about work-life balance.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s all about work-life balance.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg46z7u", "score_hidden": false, "stickied": false, "created": 1491943214.0, "created_utc": 1491914414.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": "", "user_reports": [], "id": "dg4amww", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "hikaruzero", "parent_id": "t3_64pipt", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "If you want to peer into the darkness and uncover as much truth as you can, you mustn't burn the candle at both ends.  That flame will be bright but brief and after it's gone you'll be left in the dark for an extended time once more.  You need to make the candle last, if you want to make your way through the darkness to your destination.  If you burn yourself out before you get where you want to go, it will all be for nought.\n\nHope that helps!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you want to peer into the darkness and uncover as much truth as you can, you mustn&amp;#39;t burn the candle at both ends.  That flame will be bright but brief and after it&amp;#39;s gone you&amp;#39;ll be left in the dark for an extended time once more.  You need to make the candle last, if you want to make your way through the darkness to your destination.  If you burn yourself out before you get where you want to go, it will all be for nought.&lt;/p&gt;\n\n&lt;p&gt;Hope that helps!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg4amww", "score_hidden": false, "stickied": false, "created": 1491948443.0, "created_utc": 1491919643.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": "", "user_reports": [], "id": "dg46b7e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "flashdash54", "parent_id": "t3_64pipt", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "Your rate of physics per time might be better if you give up everything else, but you will last longer and get more physics total if you keep other things in your life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your rate of physics per time might be better if you give up everything else, but you will last longer and get more physics total if you keep other things in your life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg46b7e", "score_hidden": false, "stickied": false, "created": 1491942056.0, "created_utc": 1491913256.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": "", "user_reports": [], "id": "dg5hmrw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "quezalcoatl", "parent_id": "t3_64pipt", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "Chill the fuck out, you neither are nor should want to be Nima Arkani-Hamed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Chill the fuck out, you neither are nor should want to be Nima Arkani-Hamed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg5hmrw", "score_hidden": false, "stickied": false, "created": 1492001415.0, "created_utc": 1491972615.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": "", "user_reports": [], "id": "dg43mc9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pure_supremacy", "parent_id": "t3_64pipt", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "I can't really answer your questions fully being only a first year in physics, but i can at least share my opinion on the matter. As i am now i do actually feel i need to cut out a lit of hobbies out of my everyday life in order to aspire in academics. Less time on the internet doing pointless stuff like watching videos, less going out every night, less time reading books etc. Maybe I could manage without doing all that, but in the end if I really want to get into physics i feel like i should put all the time in expanding my knowledge otherwise I won't amount to much. I don't know how it is with other fields of study, but in physics in order to become great you either need to be a genius or put enormous effort into your academic career. Again this is just my opinion, but I too have pondered on these questions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t really answer your questions fully being only a first year in physics, but i can at least share my opinion on the matter. As i am now i do actually feel i need to cut out a lit of hobbies out of my everyday life in order to aspire in academics. Less time on the internet doing pointless stuff like watching videos, less going out every night, less time reading books etc. Maybe I could manage without doing all that, but in the end if I really want to get into physics i feel like i should put all the time in expanding my knowledge otherwise I won&amp;#39;t amount to much. I don&amp;#39;t know how it is with other fields of study, but in physics in order to become great you either need to be a genius or put enormous effort into your academic career. Again this is just my opinion, but I too have pondered on these questions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg43mc9", "score_hidden": false, "stickied": false, "created": 1491936070.0, "created_utc": 1491907270.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": "", "user_reports": [], "id": "dg5pwlx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "xk86", "parent_id": "t3_64pipt", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "I would say you are quite motivated, and that is a good thing. On the other hand you shouldn't be too idealistic especially if you are susceptible to depression and psychosis. This is because when you enter research you will find that the problems you are working on are very narrow and don't 'shake the foundations of humanity'. If you are going in thinking you will change the world you will be disappointed and this might exacerbate your depressive symptoms, because you will think you are doing work that is not meaningful. I have suffered from mental health issues during my phd, and it can be very tough. I would suggest first doing a masters and getting a feel of the kind of research you will be involved in. Additionally, it takes a shorter amount of time so you will be able to judge whether you can stand the arduous amounts of hours required for phd research. Best of luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would say you are quite motivated, and that is a good thing. On the other hand you shouldn&amp;#39;t be too idealistic especially if you are susceptible to depression and psychosis. This is because when you enter research you will find that the problems you are working on are very narrow and don&amp;#39;t &amp;#39;shake the foundations of humanity&amp;#39;. If you are going in thinking you will change the world you will be disappointed and this might exacerbate your depressive symptoms, because you will think you are doing work that is not meaningful. I have suffered from mental health issues during my phd, and it can be very tough. I would suggest first doing a masters and getting a feel of the kind of research you will be involved in. Additionally, it takes a shorter amount of time so you will be able to judge whether you can stand the arduous amounts of hours required for phd research. Best of luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg5pwlx", "score_hidden": false, "stickied": false, "created": 1492023327.0, "created_utc": 1491994527.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": "", "user_reports": [], "id": "dg7coxq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ElhnsBeluj", "parent_id": "t3_64pipt", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "Well, I can totally see where you are coming from, but I would tell you not to fall into that trap. In my (relative short) time in physics so far I have come to the conclusion that, at least for me, it is not so easy to disentangle physics and my other hobbies and interests. Physics may be one of my principal interests, but the other ones are also part of me and I cannot forget that. Also because my other interests have helped me further my physics career!\n\nI am an incurable techie/hacker I love to pull software and hardware apart and try to put it back together. This is part of my identity just as much as physics and I am convinced that it has helped me at least as much as my studies in physics to advance my physics career. I will be starting my PhD in October (provided I do not fail my year) and what got me what was really quite unexpected across the board success in my applications was this passion for computers. \n\nConclusion being that not only will your other hobbies keep you sane, they might actually improve you as a physicist. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I can totally see where you are coming from, but I would tell you not to fall into that trap. In my (relative short) time in physics so far I have come to the conclusion that, at least for me, it is not so easy to disentangle physics and my other hobbies and interests. Physics may be one of my principal interests, but the other ones are also part of me and I cannot forget that. Also because my other interests have helped me further my physics career!&lt;/p&gt;\n\n&lt;p&gt;I am an incurable techie/hacker I love to pull software and hardware apart and try to put it back together. This is part of my identity just as much as physics and I am convinced that it has helped me at least as much as my studies in physics to advance my physics career. I will be starting my PhD in October (provided I do not fail my year) and what got me what was really quite unexpected across the board success in my applications was this passion for computers. &lt;/p&gt;\n\n&lt;p&gt;Conclusion being that not only will your other hobbies keep you sane, they might actually improve you as a physicist. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg7coxq", "score_hidden": false, "stickied": false, "created": 1492104828.0, "created_utc": 1492076028.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pipt", "likes": null, "replies": "", "user_reports": [], "id": "dg69hy4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SirKnightRyan", "parent_id": "t3_64pipt", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "The biggest problem I see here is that you confuse academic success with real understanding; and you define yourself by your academic success, FUCK THAT. Refine your hobbies, don't view them as seprate things, EVERYTHING IS CONNECTED. Find the deepest connections between what you love and figure out why you love it. Just because you're intrested in the nature of reality doesn't mean you're a \"physicist\" or a \"computer scientist\" or whatever, no one perfectly falls into these categories. Find what you love and chase it. \nPS. dont go crazy, thats the hardest part", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The biggest problem I see here is that you confuse academic success with real understanding; and you define yourself by your academic success, FUCK THAT. Refine your hobbies, don&amp;#39;t view them as seprate things, EVERYTHING IS CONNECTED. Find the deepest connections between what you love and figure out why you love it. Just because you&amp;#39;re intrested in the nature of reality doesn&amp;#39;t mean you&amp;#39;re a &amp;quot;physicist&amp;quot; or a &amp;quot;computer scientist&amp;quot; or whatever, no one perfectly falls into these categories. Find what you love and chase it. \nPS. dont go crazy, thats the hardest part&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg69hy4", "score_hidden": false, "stickied": false, "created": 1492048823.0, "created_utc": 1492020023.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]