[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Physics", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello &lt;a href=\"/r/Physics\"&gt;/r/Physics&lt;/a&gt;,&lt;/p&gt;\n\n&lt;p&gt;How well is time understood? I&amp;#39;d like to say &amp;#39;how well de we understand time?&amp;#39;. But i came to the conclusion that i don&amp;#39;t understand time at all. It&amp;#39;s a fascinating subject. Is there currently any cutting edge physics going on in this subject? Or is it completely understood already?\nCurrently i&amp;#39;m studying for a special relativity exam. But apart from it being relative, do we actually know what it is? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello /r/Physics,\n\nHow well is time understood? I'd like to say 'how well de we understand time?'. But i came to the conclusion that i don't understand time at all. It's a fascinating subject. Is there currently any cutting edge physics going on in this subject? Or is it completely understood already?\nCurrently i'm studying for a special relativity exam. But apart from it being relative, do we actually know what it is? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Question", "id": "64pz93", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "xHipster", "saved": false, "mod_reports": [], "name": "t3_64pz93", "subreddit_name_prefixed": "r/Physics", "approved_by": null, "over_18": false, "domain": "self.Physics", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhi6", "edited": false, "link_flair_css_class": "question", "author_flair_css_class": "misc", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Physics/comments/64pz93/how_well_is_time_understood/", "num_reports": null, "locked": false, "stickied": false, "created": 1491934700.0, "url": "https://www.reddit.com/r/Physics/comments/64pz93/how_well_is_time_understood/", "author_flair_text": "Undergraduate", "quarantine": false, "title": "How well is time understood?", "created_utc": 1491905900.0, "distinguished": null, "media": null, "upvote_ratio": 0.47, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pz93", "likes": null, "replies": "", "user_reports": [], "id": "dg492m4", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "iorgfeflkd", "parent_id": "t3_64pz93", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "I think this question can be benefit from being more focused or specific. Time is well understood in the sense that we can predict how systems will evolve over time and understand how the measured duration of time depends on the local frame of reference. There are things that aren't fully understood, like how we live in a universe where things are ostensibly time-reversal symmetric (predicting the future evolution of a system is the same as predicting its past evolution) yet there is a definite arrow of time evolving in one direction. A book you may be interested in reading is The Big Picture by Sean Carroll.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this question can be benefit from being more focused or specific. Time is well understood in the sense that we can predict how systems will evolve over time and understand how the measured duration of time depends on the local frame of reference. There are things that aren&amp;#39;t fully understood, like how we live in a universe where things are ostensibly time-reversal symmetric (predicting the future evolution of a system is the same as predicting its past evolution) yet there is a definite arrow of time evolving in one direction. A book you may be interested in reading is The Big Picture by Sean Carroll.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg492m4", "score_hidden": false, "stickied": false, "created": 1491946377.0, "created_utc": 1491917577.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pz93", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pz93", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pz93", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pz93", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pz93", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pz93", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pz93", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pz93", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pz93", "likes": null, "replies": "", "user_reports": [], "id": "dg6rcrz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hikaruzero", "parent_id": "t1_dg6obqj", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "&gt;Have you ever read his book?\n\nYes of course, I own it, and have read it cover to cover several times.  Why do you think I mentioned it? :p\n\n&gt;It describes thought experiment after thought experiment. The rail car and the observer, etc.\n\nThe book is intended to teach laymen about relativity.  Hence my remark about how his thought experiments are idealized chiefly in order to capture essential features.  Each of those thought experiments are modelled after very real-world scenarios where those same experiments have already been performed countless times -- the only way you're going to get closer to empirical reality than those thought experiments is by *actually performing* the experiments for yourself, which is a lot to expect of a layman reading a book.  Most of them do not own trains and are not going to go out and buy a train ticket and make their buddy stand aways down the tracks waiting while holding a clock.  It is expected that the layman realizes that these experiments have already been done and that they could trivially go out and do them if they so wished.\n\n&gt;Granted, those theories concern empirical applications and were applied to empirical problems. But the development of them was largely accomplished through thought experiment and mathematics.\n\nI mean, you said precisely that his \"work was done in thought experiments with no real corollary to empirical measurements or processes\" but *every last thought experiment* in the book has a *direct* corollary to empirical measurements and processes.  The problems are of the \"rail car and observer\" type, based on reading clocks and rulers -- exactly the kind of problems that can be very easily and intuitively related to the observable behavior of real-world objects.  They are the \"suppose you had a long rod\" and \"imagine two people travelling towards each other\" types.  These are the types of thought experiments that are as close as possible to simple empirical experiments that an ordinary person can do.  They're only not empirical themselves because they are printed as words in a book, most of them having already been performed many times over.  To say that they have \"no corollary\" to empirical reality is just ... like ... [what? seriously?](http://i1.kym-cdn.com/photos/images/facebook/000/548/129/538.jpg)\n\n&gt;After all, the means to test some of his most ground-breaking work empirically didn't even exist until after his death.\n\n[Are you kidding me](https://2.bp.blogspot.com/-wbMbAWbJGwo/V4VKdXU_z4I/AAAAAAAAEwo/fEF5El0ANgoIW38qES91HXbVSWt3IdRjACLcB/s1600/confusing-tech-language.jpg)? Goodness gracious!  This is the least true thing you have said so far!\n\nIt was known at the time of its publishing (1915) that it was able to correctly account for the anomalous precession of Mercury, which had been measured back in 1859.  Tests of gravitational lensing of light passing near the Sun, confirming GR's predictions came [as early as 1919](https://en.wikipedia.org/wiki/Tests_of_general_relativity#Deflection_of_light_by_the_Sun).  To quote Wikipedia, \"The result was considered spectacular news and made the front page of most major newspapers. It made Einstein and his theory of general relativity world-famous.\"\n\nPrior to all that, there were experiments going on back in the late 1800s (the most important of which I already mentioned) establishing the constancy of the speed of light, and the Lorentz transformations featured in special relativity were [originally introduced by Hendrik Lorentz specifically to account for experimental data at the time](https://en.wikipedia.org/wiki/Tests_of_special_relativity#Second-order_experiments):  \"To explain all experiments conducted before 1904, Lorentz was forced to again expand his theory by introducing the complete Lorentz transformation. Henri Poincaré declared in 1905 that the impossibility of demonstrating absolute motion (principle of relativity) is apparently a law of nature.\"\n\nHubble empirically established [his famous law](https://en.wikipedia.org/wiki/Hubble%27s_law) back in 1929, which was something of an embarrassment to Einstein at the time, since Einstein set the value of the cosmological constant in his theory to produce a static universe, and Hubble discovered empirically that it was expanding -- Einstein later thanked Hubble in person for proving his original parameterization of his theory false.  The Michelson-Morley experiment was [improved upon to test special relativity](https://en.wikipedia.org/wiki/Kennedy%E2%80%93Thorndike_experiment) in 1932, [time dilaiton was tested](https://en.wikipedia.org/wiki/Ives%E2%80%93Stilwell_experiment) in 1938 ... and there were plenty more tests long before Einstein died nearly two decades later, in 1955.\n\nMilikan [tested Einstein's theory about the photoelectric effect in 1914](https://en.wikipedia.org/wiki/Robert_Andrews_Millikan#Photoelectric_effect) (\"His results published in 1914 confirmed Einstein's predictions in every detail\"), and experiments concerning [old quantum theory](https://en.wikipedia.org/wiki/Old_quantum_theory#History) were already showing the failings of the Rutherford-Bohr model of the atom and paving the way for proper quantum mechanics long before the EPR debates.  The Copenhagen interpretation of QM was proposed back in 1927 based on the evidence supporting QM at the time, and is precisely what Einstein came out against in those debates.\n\nI mean, it is just ... completely, manifestly untrue that the means to test Einstein's works didn't come until after his death.  *Numerous predictions* of all his major works were tested *decades* before his death, with some evidence already clearly supporting his theories at the very time they were published!\n\n&gt;But to say science HAS to have some empirical measurement or test to be called science or scientific investigation simply isn't true.\n\nNo amount of repeating this over and over is going to make it true.  Science is pretty much universally considered to be the study of the natural world and the process of gaining knowledge about facts.\n\nWikipedia defines it as:  \"a systematic enterprise that builds and organizes knowledge in the form of testable explanations and predictions about the universe.\" Dictionary.com's top two definitions for science are: \"a branch of knowledge or study dealing with a body of facts or truths systematically arranged and showing the operation of general laws,\" (note that it also defines a \"fact\" as \"something that actually exists; reality; truth\" and \"a truth known by actual experience or observation; something known to be true\") and alternatively as \"systematic knowledge of the physical or material world gained through observation and experimentation.\"\n\nLike it or not, science is widely considered to be directly pertaining to empirical measurements and observations.  The scientific method itself, in *all* of its differently-stated versions, holds observation and experiment as unignorable, key parts.  Just because there are many theoretical scientists does not mean that their work has no empirical component.  Theoretical physicists aren't just coming up with theories that they already know are wrong or that they know don't pertain to reality in any way.  They formulate their theories based on *known empirical facts*, specifically to come up with *testable predictions*.  Just because they aren't physically doing experiments does not at all imply that their work \"deals *only* with theory and math.\"  If it *did* deal only with theory and math, then they would be mathematicians!  But because they deal with theories and math *based on known facts about reality* and *applied to make predictions about reality*, that makes them a theoretical scientist and not merely a mathemetician.", "edited": 1492040748.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Have you ever read his book?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes of course, I own it, and have read it cover to cover several times.  Why do you think I mentioned it? :p&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It describes thought experiment after thought experiment. The rail car and the observer, etc.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The book is intended to teach laymen about relativity.  Hence my remark about how his thought experiments are idealized chiefly in order to capture essential features.  Each of those thought experiments are modelled after very real-world scenarios where those same experiments have already been performed countless times -- the only way you&amp;#39;re going to get closer to empirical reality than those thought experiments is by &lt;em&gt;actually performing&lt;/em&gt; the experiments for yourself, which is a lot to expect of a layman reading a book.  Most of them do not own trains and are not going to go out and buy a train ticket and make their buddy stand aways down the tracks waiting while holding a clock.  It is expected that the layman realizes that these experiments have already been done and that they could trivially go out and do them if they so wished.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Granted, those theories concern empirical applications and were applied to empirical problems. But the development of them was largely accomplished through thought experiment and mathematics.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I mean, you said precisely that his &amp;quot;work was done in thought experiments with no real corollary to empirical measurements or processes&amp;quot; but &lt;em&gt;every last thought experiment&lt;/em&gt; in the book has a &lt;em&gt;direct&lt;/em&gt; corollary to empirical measurements and processes.  The problems are of the &amp;quot;rail car and observer&amp;quot; type, based on reading clocks and rulers -- exactly the kind of problems that can be very easily and intuitively related to the observable behavior of real-world objects.  They are the &amp;quot;suppose you had a long rod&amp;quot; and &amp;quot;imagine two people travelling towards each other&amp;quot; types.  These are the types of thought experiments that are as close as possible to simple empirical experiments that an ordinary person can do.  They&amp;#39;re only not empirical themselves because they are printed as words in a book, most of them having already been performed many times over.  To say that they have &amp;quot;no corollary&amp;quot; to empirical reality is just ... like ... &lt;a href=\"http://i1.kym-cdn.com/photos/images/facebook/000/548/129/538.jpg\"&gt;what? seriously?&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;After all, the means to test some of his most ground-breaking work empirically didn&amp;#39;t even exist until after his death.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://2.bp.blogspot.com/-wbMbAWbJGwo/V4VKdXU_z4I/AAAAAAAAEwo/fEF5El0ANgoIW38qES91HXbVSWt3IdRjACLcB/s1600/confusing-tech-language.jpg\"&gt;Are you kidding me&lt;/a&gt;? Goodness gracious!  This is the least true thing you have said so far!&lt;/p&gt;\n\n&lt;p&gt;It was known at the time of its publishing (1915) that it was able to correctly account for the anomalous precession of Mercury, which had been measured back in 1859.  Tests of gravitational lensing of light passing near the Sun, confirming GR&amp;#39;s predictions came &lt;a href=\"https://en.wikipedia.org/wiki/Tests_of_general_relativity#Deflection_of_light_by_the_Sun\"&gt;as early as 1919&lt;/a&gt;.  To quote Wikipedia, &amp;quot;The result was considered spectacular news and made the front page of most major newspapers. It made Einstein and his theory of general relativity world-famous.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Prior to all that, there were experiments going on back in the late 1800s (the most important of which I already mentioned) establishing the constancy of the speed of light, and the Lorentz transformations featured in special relativity were &lt;a href=\"https://en.wikipedia.org/wiki/Tests_of_special_relativity#Second-order_experiments\"&gt;originally introduced by Hendrik Lorentz specifically to account for experimental data at the time&lt;/a&gt;:  &amp;quot;To explain all experiments conducted before 1904, Lorentz was forced to again expand his theory by introducing the complete Lorentz transformation. Henri Poincaré declared in 1905 that the impossibility of demonstrating absolute motion (principle of relativity) is apparently a law of nature.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Hubble empirically established &lt;a href=\"https://en.wikipedia.org/wiki/Hubble%27s_law\"&gt;his famous law&lt;/a&gt; back in 1929, which was something of an embarrassment to Einstein at the time, since Einstein set the value of the cosmological constant in his theory to produce a static universe, and Hubble discovered empirically that it was expanding -- Einstein later thanked Hubble in person for proving his original parameterization of his theory false.  The Michelson-Morley experiment was &lt;a href=\"https://en.wikipedia.org/wiki/Kennedy%E2%80%93Thorndike_experiment\"&gt;improved upon to test special relativity&lt;/a&gt; in 1932, &lt;a href=\"https://en.wikipedia.org/wiki/Ives%E2%80%93Stilwell_experiment\"&gt;time dilaiton was tested&lt;/a&gt; in 1938 ... and there were plenty more tests long before Einstein died nearly two decades later, in 1955.&lt;/p&gt;\n\n&lt;p&gt;Milikan &lt;a href=\"https://en.wikipedia.org/wiki/Robert_Andrews_Millikan#Photoelectric_effect\"&gt;tested Einstein&amp;#39;s theory about the photoelectric effect in 1914&lt;/a&gt; (&amp;quot;His results published in 1914 confirmed Einstein&amp;#39;s predictions in every detail&amp;quot;), and experiments concerning &lt;a href=\"https://en.wikipedia.org/wiki/Old_quantum_theory#History\"&gt;old quantum theory&lt;/a&gt; were already showing the failings of the Rutherford-Bohr model of the atom and paving the way for proper quantum mechanics long before the EPR debates.  The Copenhagen interpretation of QM was proposed back in 1927 based on the evidence supporting QM at the time, and is precisely what Einstein came out against in those debates.&lt;/p&gt;\n\n&lt;p&gt;I mean, it is just ... completely, manifestly untrue that the means to test Einstein&amp;#39;s works didn&amp;#39;t come until after his death.  &lt;em&gt;Numerous predictions&lt;/em&gt; of all his major works were tested &lt;em&gt;decades&lt;/em&gt; before his death, with some evidence already clearly supporting his theories at the very time they were published!&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But to say science HAS to have some empirical measurement or test to be called science or scientific investigation simply isn&amp;#39;t true.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No amount of repeating this over and over is going to make it true.  Science is pretty much universally considered to be the study of the natural world and the process of gaining knowledge about facts.&lt;/p&gt;\n\n&lt;p&gt;Wikipedia defines it as:  &amp;quot;a systematic enterprise that builds and organizes knowledge in the form of testable explanations and predictions about the universe.&amp;quot; Dictionary.com&amp;#39;s top two definitions for science are: &amp;quot;a branch of knowledge or study dealing with a body of facts or truths systematically arranged and showing the operation of general laws,&amp;quot; (note that it also defines a &amp;quot;fact&amp;quot; as &amp;quot;something that actually exists; reality; truth&amp;quot; and &amp;quot;a truth known by actual experience or observation; something known to be true&amp;quot;) and alternatively as &amp;quot;systematic knowledge of the physical or material world gained through observation and experimentation.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Like it or not, science is widely considered to be directly pertaining to empirical measurements and observations.  The scientific method itself, in &lt;em&gt;all&lt;/em&gt; of its differently-stated versions, holds observation and experiment as unignorable, key parts.  Just because there are many theoretical scientists does not mean that their work has no empirical component.  Theoretical physicists aren&amp;#39;t just coming up with theories that they already know are wrong or that they know don&amp;#39;t pertain to reality in any way.  They formulate their theories based on &lt;em&gt;known empirical facts&lt;/em&gt;, specifically to come up with &lt;em&gt;testable predictions&lt;/em&gt;.  Just because they aren&amp;#39;t physically doing experiments does not at all imply that their work &amp;quot;deals &lt;em&gt;only&lt;/em&gt; with theory and math.&amp;quot;  If it &lt;em&gt;did&lt;/em&gt; deal only with theory and math, then they would be mathematicians!  But because they deal with theories and math &lt;em&gt;based on known facts about reality&lt;/em&gt; and &lt;em&gt;applied to make predictions about reality&lt;/em&gt;, that makes them a theoretical scientist and not merely a mathemetician.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg6rcrz", "score_hidden": false, "stickied": false, "created": 1492068621.0, "created_utc": 1492039821.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6obqj", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "DWMcAliley", "parent_id": "t1_dg6jp5o", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "Have you ever read his book on Relativity entirely?  It describes thought experiment after thought experiment.  The rail car and the observer, etc.  That was exactly what I was talking about.\n\nGranted, those theories concern empirical applications and were applied to empirical problems.  But the development of them was largely accomplished through thought experiment and mathematics.  After all, the means to test some of his most ground-breaking work empirically didn't even exist until after his death.  \n\nI get that science can't be pure thought experiments.  That's philosophy.  But to say science HAS to have some empirical measurement or test to be called science or scientific investigation simply isn't true.  Einstein and Hawking both do most of their work with thought experiment and theory.  Heck, there's a whole branch of physics called theoretical physics that deals only with theory and math.  ", "edited": 1492036315.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you ever read his book on Relativity entirely?  It describes thought experiment after thought experiment.  The rail car and the observer, etc.  That was exactly what I was talking about.&lt;/p&gt;\n\n&lt;p&gt;Granted, those theories concern empirical applications and were applied to empirical problems.  But the development of them was largely accomplished through thought experiment and mathematics.  After all, the means to test some of his most ground-breaking work empirically didn&amp;#39;t even exist until after his death.  &lt;/p&gt;\n\n&lt;p&gt;I get that science can&amp;#39;t be pure thought experiments.  That&amp;#39;s philosophy.  But to say science HAS to have some empirical measurement or test to be called science or scientific investigation simply isn&amp;#39;t true.  Einstein and Hawking both do most of their work with thought experiment and theory.  Heck, there&amp;#39;s a whole branch of physics called theoretical physics that deals only with theory and math.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg6obqj", "score_hidden": false, "stickied": false, "created": 1492064878.0, "created_utc": 1492036078.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jp5o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hikaruzero", "parent_id": "t1_dg6cz54", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "&gt;Not all scientific investigation requires empirical measurements or quantities.\n\n*Yes*, it *absolutely, emphatically does* require empirical aspects to be called science.\n\nEdit: I mean ... science is pretty much *defined* as the study of the natural world, in common language at least (Dictionary.com: \"systematic knowledge of the physical or material world gained through observation and experimentation;\" Wikipedia: \"... a systematic enterprise that builds and organizes knowledge in the form of testable explanations and predictions about the universe\").  How can you study the natural world without *any* empirical component -- without observing it and testing its behaviour?\n\nEven on the pure theory side ... someone who scribbles away and comes up with a mathematical framework is a mathematician.  Someone who does the same *and then makes testable predictions* about reality with it, is a theoretical physicist.  It's the part that relates to empirical reality that makes it science.  Without that empirical part, it's just math, or philosophy, or some other discipline.\n\n&gt;Some of Einstein's greatest work was done in thought experiments with no real corollary to empirical measurements or processes.\n\nNo, I'm sorry but that's just ... dead wrong.  Basically *all* of Einstein's work was based heavily on empirical concerns.\n\nHis work on special relativity revolved around the empirical observation that the speed of light was measured to be constant by the Michelson-Morley experiment (which was unexpected at the time), and Maxwell's equations which were empirically established.  His work on general relativity was motivated in part by [Mach's principle](https://en.wikipedia.org/wiki/Mach%27s_principle) -- the observation that local inertial frames are influenced by the global distribution of matter -- and the *very* real observation that a body falling due to gravity feels weightless (which isn't just apparent in a space elevator thought experiment, you can feel it if you jump off of a short ledge, it's easy to demonstrate in reality).  Einstein's thought experiments here weren't pure thought experiments, they are just idealized to capture the essential features of known empirical considerations.  If you read Einstein's book *Relativity: the Special and the General Theory*, he summarizes how his thinking *starts* with the pure, visceral empirical concerns (\"time is what we measure with a clock; length measurements are made in relation to a rigid body serving as a ruler,\" etc.) and then straightforwardly takes the implications of observations about these kinds of measurements to their logical extremes.\n\nLikewise with Einstein's other works, for example on the photoelectric effect, which was observed qualitatively before it motivated Einstein to consider that light itself might be quantized, and not only matter or the interaction between the two.  And observational reality was at the heart of the EPR debate, where Einstein's material conceptualization of the classical world kept him at odds with quantum mechanics -- refusing to accept that QM could be a complete description of the world because of how different the properties of its description were compared to our everyday experience with how the world works.  He was famously uncomfortable with what he pejoratively called \"spooky action at a distance\" because it didn't seem to jive with everything we previously knew about observational reality (that it was deterministic, locally real and counterfactually definite).\n\nEinstein wasn't just some idealized genius who locked himself in a room with a chalkboard and magically produced the right answers.  He had that genius quality too, but he started from the most simple, barebones empirical observations and worked his way up methodically from there.  He didn't just stab at metaphysics in the dark and guess correctly every time.  Ain't nobody who can do that, despite what some televangelists may tell you.", "edited": 1492035748.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Not all scientific investigation requires empirical measurements or quantities.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;em&gt;Yes&lt;/em&gt;, it &lt;em&gt;absolutely, emphatically does&lt;/em&gt; require empirical aspects to be called science.&lt;/p&gt;\n\n&lt;p&gt;Edit: I mean ... science is pretty much &lt;em&gt;defined&lt;/em&gt; as the study of the natural world, in common language at least (Dictionary.com: &amp;quot;systematic knowledge of the physical or material world gained through observation and experimentation;&amp;quot; Wikipedia: &amp;quot;... a systematic enterprise that builds and organizes knowledge in the form of testable explanations and predictions about the universe&amp;quot;).  How can you study the natural world without &lt;em&gt;any&lt;/em&gt; empirical component -- without observing it and testing its behaviour?&lt;/p&gt;\n\n&lt;p&gt;Even on the pure theory side ... someone who scribbles away and comes up with a mathematical framework is a mathematician.  Someone who does the same &lt;em&gt;and then makes testable predictions&lt;/em&gt; about reality with it, is a theoretical physicist.  It&amp;#39;s the part that relates to empirical reality that makes it science.  Without that empirical part, it&amp;#39;s just math, or philosophy, or some other discipline.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Some of Einstein&amp;#39;s greatest work was done in thought experiments with no real corollary to empirical measurements or processes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, I&amp;#39;m sorry but that&amp;#39;s just ... dead wrong.  Basically &lt;em&gt;all&lt;/em&gt; of Einstein&amp;#39;s work was based heavily on empirical concerns.&lt;/p&gt;\n\n&lt;p&gt;His work on special relativity revolved around the empirical observation that the speed of light was measured to be constant by the Michelson-Morley experiment (which was unexpected at the time), and Maxwell&amp;#39;s equations which were empirically established.  His work on general relativity was motivated in part by &lt;a href=\"https://en.wikipedia.org/wiki/Mach%27s_principle\"&gt;Mach&amp;#39;s principle&lt;/a&gt; -- the observation that local inertial frames are influenced by the global distribution of matter -- and the &lt;em&gt;very&lt;/em&gt; real observation that a body falling due to gravity feels weightless (which isn&amp;#39;t just apparent in a space elevator thought experiment, you can feel it if you jump off of a short ledge, it&amp;#39;s easy to demonstrate in reality).  Einstein&amp;#39;s thought experiments here weren&amp;#39;t pure thought experiments, they are just idealized to capture the essential features of known empirical considerations.  If you read Einstein&amp;#39;s book &lt;em&gt;Relativity: the Special and the General Theory&lt;/em&gt;, he summarizes how his thinking &lt;em&gt;starts&lt;/em&gt; with the pure, visceral empirical concerns (&amp;quot;time is what we measure with a clock; length measurements are made in relation to a rigid body serving as a ruler,&amp;quot; etc.) and then straightforwardly takes the implications of observations about these kinds of measurements to their logical extremes.&lt;/p&gt;\n\n&lt;p&gt;Likewise with Einstein&amp;#39;s other works, for example on the photoelectric effect, which was observed qualitatively before it motivated Einstein to consider that light itself might be quantized, and not only matter or the interaction between the two.  And observational reality was at the heart of the EPR debate, where Einstein&amp;#39;s material conceptualization of the classical world kept him at odds with quantum mechanics -- refusing to accept that QM could be a complete description of the world because of how different the properties of its description were compared to our everyday experience with how the world works.  He was famously uncomfortable with what he pejoratively called &amp;quot;spooky action at a distance&amp;quot; because it didn&amp;#39;t seem to jive with everything we previously knew about observational reality (that it was deterministic, locally real and counterfactually definite).&lt;/p&gt;\n\n&lt;p&gt;Einstein wasn&amp;#39;t just some idealized genius who locked himself in a room with a chalkboard and magically produced the right answers.  He had that genius quality too, but he started from the most simple, barebones empirical observations and worked his way up methodically from there.  He didn&amp;#39;t just stab at metaphysics in the dark and guess correctly every time.  Ain&amp;#39;t nobody who can do that, despite what some televangelists may tell you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg6jp5o", "score_hidden": false, "stickied": false, "created": 1492059350.0, "created_utc": 1492030550.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6cz54", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "DWMcAliley", "parent_id": "t1_dg52zn7", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "Just to point out...  Not all scientific investigation requires empirical measurements or quantities.  Some of Einstein's greatest work was done in thought experiments with no real corollary to empirical measurements or processes.  \n\nThen again, that's why he was Einstein...  so to speak...\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just to point out...  Not all scientific investigation requires empirical measurements or quantities.  Some of Einstein&amp;#39;s greatest work was done in thought experiments with no real corollary to empirical measurements or processes.  &lt;/p&gt;\n\n&lt;p&gt;Then again, that&amp;#39;s why he was Einstein...  so to speak...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg6cz54", "score_hidden": false, "stickied": false, "created": 1492052396.0, "created_utc": 1492023596.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52zn7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hikaruzero", "parent_id": "t1_dg4x2w6", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "&gt;There is no single scientific method.\n\nThat's fine, it is really only tangential to my point -- nuanced versions though there may be, there aren't any versions I am aware of that don't have an empirical component as an absolutely critical, core part.\n\nWell except maybe \"creation science.\"  But I'm gonna go out on a (very short) limb and call that not real science. :)\n\n&gt;Your claim that if something isn't empirical then it isn't science is WAY too strong.\n\nWell, we don't agree on this matter.\n\nEdit: To be clear, after writing the rest of this post, what I mean to state is that anything that lacks an empirical component is not science.\n\n&gt;There are plenty of things that scientists do that they consider science but are non-empirical.\n\nI never claimed *everything* that scientists do is empirical.  Nevertheless *everything* that is science has an empirical component.  There are non-empirical components to science as well -- for example, hypothesizing, which needn't be motivated or steered by empirical concerns (and may indeed by motivated by metaphysical ones, which is arguably why metaphysics has value to science despite not being science in and of itself, just like math and logic have value to science despite not being inherently scientific).\n\n&gt;For example, physicists claim all the time not only that our models are predictive, but that they tell us something about the way the universe actually is (metaphysics essentially).\n\nThat a model accurately matches nature tells us only that nature possesses a mathematical structure that the model also possesses, and typically only in a limiting case.  Science does not have the capacity to distinguish between competing models that contain equivalent structures, except insofar as they may differ in an empirical way (in which case the structures aren't truly equivalent).\n\nAs an example, a related hot topic would be the various interpretations of quantum mechanics.  Science tells us nothing about which interpretation is correct.  Only that the model every interpretation is based on is an accurate description of nature.  The mathematical framework itself comes pretty much *entirely* absent metaphysical claims.  We still see back-and-forths about the ontological parts of QM ... whether wavefunction collapse is ontic, whether nature is real but non-local, or local but not real, whether it is counterfactually definite or indefinite, deterministic or non-deterministic, and so on.  Even whether the wavefunction itself is ontologically real or is merely a statistical description of ensembles of systems remains debated.  Practically nothing about quantum mechanics as a model is metaphysical, only the *interpretation* of the model is metaphysical.\n\n&gt;Theorists investigate new theories that may or may not lead to any empirical predictions; they don't know yet.\n\nThere is of course a blurry line as to the definition of \"theory.\"  A \"scientific theory\" is typically regarded as a theory that makes testable predictions and can be falsified, at least in principle if not in practice.  A \"theory\" in the context of theoretical physics can also mean a mathematical framework that *doesn't* accurately describe nature, but is studied for the insights it can provide into the important features of theories that do accurately describe nature, or perhaps merely because it is interesting mathematically (which itself has value to physics, as mathematics in general is unreasonably effective at describing the natural world, to borrow the quote ... and historically there are many areas of mathematics that, once developed, could later be applied to physics and found to accurately describe nature).  Hypothesizing about potential natural structures/behaviors is innately scientific, even though those models may later go on to be falsified.\n\n&gt;People investigate theoretically or computationally the relationship between two well-known models. Sometimes we do purely deductive things like proofs, is Boltzmann's H-theorem not science? Given the same exact fit to empirical results, scientists frequently engage in non-empirical reasoning to decide between theories.\n\nJust to reiterate, nobody in this conversation ever said they didn't.  What I said was that empirical reasoning is a *necessary* part of science, not that it is the *only* part of science, nor even that it is *sufficient*.\n\n&gt;So, if you want to soften that position a bit and say that science has to be related to empirical stuff\n\nThis *is* what I originally said.  My precise words were:  \"The scientific method necessitates an empirical component.\"  So I see no need to soften my position as my position is already sufficiently soft.  :P\n\nMore edits:  To your original point, which was:  \"You're not being sufficiently clear about the distinction between scientific investigation and empirical investigation.\"  If that is a sufficient distinction, that not all of scientific investigation is empirical, but that the former does require the latter, then you are correct -- I will concede that as a difference.  But, regarding your later original remark, \"You might think that an empirical component is required for something to be scientific, and depending upon how strong you want to make that requirement ... that view ranges from plausible but to deeply contested on the weaker side to completely implausible on the stronger side,\" again I consider it fundamentally imperative that an empirical component is absolutely required in all versions of the scientific method (the reasonable ones anyway, I mean to discount the wingnut religious type proposals that might accept non-empirical \"evidence\" for example) and I am firm about the strength of that statement and I don't believe that such a strong statement is really debated *at all* among scientists.  I am quite confident that the extreme-vast majority of people who society labels as scientists agree that science requires an empirical component to be called such.", "edited": 1491953813.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;There is no single scientific method.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s fine, it is really only tangential to my point -- nuanced versions though there may be, there aren&amp;#39;t any versions I am aware of that don&amp;#39;t have an empirical component as an absolutely critical, core part.&lt;/p&gt;\n\n&lt;p&gt;Well except maybe &amp;quot;creation science.&amp;quot;  But I&amp;#39;m gonna go out on a (very short) limb and call that not real science. :)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Your claim that if something isn&amp;#39;t empirical then it isn&amp;#39;t science is WAY too strong.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, we don&amp;#39;t agree on this matter.&lt;/p&gt;\n\n&lt;p&gt;Edit: To be clear, after writing the rest of this post, what I mean to state is that anything that lacks an empirical component is not science.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;There are plenty of things that scientists do that they consider science but are non-empirical.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I never claimed &lt;em&gt;everything&lt;/em&gt; that scientists do is empirical.  Nevertheless &lt;em&gt;everything&lt;/em&gt; that is science has an empirical component.  There are non-empirical components to science as well -- for example, hypothesizing, which needn&amp;#39;t be motivated or steered by empirical concerns (and may indeed by motivated by metaphysical ones, which is arguably why metaphysics has value to science despite not being science in and of itself, just like math and logic have value to science despite not being inherently scientific).&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;For example, physicists claim all the time not only that our models are predictive, but that they tell us something about the way the universe actually is (metaphysics essentially).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That a model accurately matches nature tells us only that nature possesses a mathematical structure that the model also possesses, and typically only in a limiting case.  Science does not have the capacity to distinguish between competing models that contain equivalent structures, except insofar as they may differ in an empirical way (in which case the structures aren&amp;#39;t truly equivalent).&lt;/p&gt;\n\n&lt;p&gt;As an example, a related hot topic would be the various interpretations of quantum mechanics.  Science tells us nothing about which interpretation is correct.  Only that the model every interpretation is based on is an accurate description of nature.  The mathematical framework itself comes pretty much &lt;em&gt;entirely&lt;/em&gt; absent metaphysical claims.  We still see back-and-forths about the ontological parts of QM ... whether wavefunction collapse is ontic, whether nature is real but non-local, or local but not real, whether it is counterfactually definite or indefinite, deterministic or non-deterministic, and so on.  Even whether the wavefunction itself is ontologically real or is merely a statistical description of ensembles of systems remains debated.  Practically nothing about quantum mechanics as a model is metaphysical, only the &lt;em&gt;interpretation&lt;/em&gt; of the model is metaphysical.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Theorists investigate new theories that may or may not lead to any empirical predictions; they don&amp;#39;t know yet.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There is of course a blurry line as to the definition of &amp;quot;theory.&amp;quot;  A &amp;quot;scientific theory&amp;quot; is typically regarded as a theory that makes testable predictions and can be falsified, at least in principle if not in practice.  A &amp;quot;theory&amp;quot; in the context of theoretical physics can also mean a mathematical framework that &lt;em&gt;doesn&amp;#39;t&lt;/em&gt; accurately describe nature, but is studied for the insights it can provide into the important features of theories that do accurately describe nature, or perhaps merely because it is interesting mathematically (which itself has value to physics, as mathematics in general is unreasonably effective at describing the natural world, to borrow the quote ... and historically there are many areas of mathematics that, once developed, could later be applied to physics and found to accurately describe nature).  Hypothesizing about potential natural structures/behaviors is innately scientific, even though those models may later go on to be falsified.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;People investigate theoretically or computationally the relationship between two well-known models. Sometimes we do purely deductive things like proofs, is Boltzmann&amp;#39;s H-theorem not science? Given the same exact fit to empirical results, scientists frequently engage in non-empirical reasoning to decide between theories.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Just to reiterate, nobody in this conversation ever said they didn&amp;#39;t.  What I said was that empirical reasoning is a &lt;em&gt;necessary&lt;/em&gt; part of science, not that it is the &lt;em&gt;only&lt;/em&gt; part of science, nor even that it is &lt;em&gt;sufficient&lt;/em&gt;.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So, if you want to soften that position a bit and say that science has to be related to empirical stuff&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This &lt;em&gt;is&lt;/em&gt; what I originally said.  My precise words were:  &amp;quot;The scientific method necessitates an empirical component.&amp;quot;  So I see no need to soften my position as my position is already sufficiently soft.  :P&lt;/p&gt;\n\n&lt;p&gt;More edits:  To your original point, which was:  &amp;quot;You&amp;#39;re not being sufficiently clear about the distinction between scientific investigation and empirical investigation.&amp;quot;  If that is a sufficient distinction, that not all of scientific investigation is empirical, but that the former does require the latter, then you are correct -- I will concede that as a difference.  But, regarding your later original remark, &amp;quot;You might think that an empirical component is required for something to be scientific, and depending upon how strong you want to make that requirement ... that view ranges from plausible but to deeply contested on the weaker side to completely implausible on the stronger side,&amp;quot; again I consider it fundamentally imperative that an empirical component is absolutely required in all versions of the scientific method (the reasonable ones anyway, I mean to discount the wingnut religious type proposals that might accept non-empirical &amp;quot;evidence&amp;quot; for example) and I am firm about the strength of that statement and I don&amp;#39;t believe that such a strong statement is really debated &lt;em&gt;at all&lt;/em&gt; among scientists.  I am quite confident that the extreme-vast majority of people who society labels as scientists agree that science requires an empirical component to be called such.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg52zn7", "score_hidden": false, "stickied": false, "created": 1491980690.0, "created_utc": 1491951890.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4x2w6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheoryOfSomething", "parent_id": "t1_dg4snz4", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "There is no single scientific method. This has been a focus of much recent in philosophy of science (particularly recently); an overview of which you can find in the [Stanford Encyclopedia](https://plato.stanford.edu/entries/scientific-method/). Consider what Steven Weinberg had to say:\n\n&gt;The fact that the standards of scientific success shift with time does not only make the philosophy of science difficult; it also raises problems for the public understanding of science. We do not have a fixed scientific method to rally around and defend.\n\nSo, whatever science is, it is not a derivative of any single scientific method. Drawing a clear line between exactly what is science and what is not science (particularly as related to pseudo-science) is a long-standing problem in philosophy of science known as [demarcation](https://plato.stanford.edu/entries/pseudo-science/). \n\nYour claim that if something isn't empirical then it isn't science is WAY too strong. There are plenty of things that scientists do that they consider science but are non-empirical. For example, physicists claim all the time not only that our models are predictive, but that they tell us something about the way the universe *actually is* (metaphysics essentially). Theorists investigate new theories that may or may not lead to any empirical predictions; they don't know yet. People investigate theoretically or computationally the relationship between two well-known models. Sometimes we do purely deductive things like proofs, is Boltzmann's H-theorem not science? Given the same exact fit to empirical results, scientists frequently engage in non-empirical reasoning to decide between theories.\n\nSo, if you want to soften that position a bit and say that science has to be related to empirical stuff, or it has to in principle give empirical predictions, or some other significantly weaker condition then alright. And that's why I said empirical requirements range from crazy on the strong side to plausible on the weaker side.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is no single scientific method. This has been a focus of much recent in philosophy of science (particularly recently); an overview of which you can find in the &lt;a href=\"https://plato.stanford.edu/entries/scientific-method/\"&gt;Stanford Encyclopedia&lt;/a&gt;. Consider what Steven Weinberg had to say:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The fact that the standards of scientific success shift with time does not only make the philosophy of science difficult; it also raises problems for the public understanding of science. We do not have a fixed scientific method to rally around and defend.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So, whatever science is, it is not a derivative of any single scientific method. Drawing a clear line between exactly what is science and what is not science (particularly as related to pseudo-science) is a long-standing problem in philosophy of science known as &lt;a href=\"https://plato.stanford.edu/entries/pseudo-science/\"&gt;demarcation&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;Your claim that if something isn&amp;#39;t empirical then it isn&amp;#39;t science is WAY too strong. There are plenty of things that scientists do that they consider science but are non-empirical. For example, physicists claim all the time not only that our models are predictive, but that they tell us something about the way the universe &lt;em&gt;actually is&lt;/em&gt; (metaphysics essentially). Theorists investigate new theories that may or may not lead to any empirical predictions; they don&amp;#39;t know yet. People investigate theoretically or computationally the relationship between two well-known models. Sometimes we do purely deductive things like proofs, is Boltzmann&amp;#39;s H-theorem not science? Given the same exact fit to empirical results, scientists frequently engage in non-empirical reasoning to decide between theories.&lt;/p&gt;\n\n&lt;p&gt;So, if you want to soften that position a bit and say that science has to be related to empirical stuff, or it has to in principle give empirical predictions, or some other significantly weaker condition then alright. And that&amp;#39;s why I said empirical requirements range from crazy on the strong side to plausible on the weaker side.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg4x2w6", "score_hidden": false, "stickied": false, "created": 1491973317.0, "created_utc": 1491944517.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4snz4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hikaruzero", "parent_id": "t1_dg4rqqm", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "&gt;You're not being sufficiently clear about the distinction between scientific investigation and empirical investigation.\n\nThat's because I am not aware of any significant distinction between the two. :p\n\n&gt;The metaphysics of time seems unlikely to be empirically accessible (although maybe that's debatable).\n\nI don't think there is really any debate on that -- if metaphysics were empirically accessible, then it would just be \"physics.\"  :)  It is so termed \"metaphysics\" because it is philosophy and not science, whereas physics is science and not philosophy.  Metaphysics is *concerned* with physics, being effectively *philosophy* of physics, but it is not physics and I don't believe that distinction is seriously debated.\n\n&gt;You might think that an empirical component is required for something to be scientific, and depending upon how strong you want to make that requirement (regarding type, quality, possibility, etc. of empirical investigation) that view ranges from plausible but to deeply contested on the weaker side to completely implausible on the stronger side.\n\nI mean, all that which is \"science\" is derivative of the scientific method.  The scientific method necessitates an empirical component.  If it's not empirical, it's not scientific, and that isn't really a contested consideration; it is *definitional* to science.  It seems clear to me that there is no handwaving to be had regarding that.", "edited": 1491941171.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You&amp;#39;re not being sufficiently clear about the distinction between scientific investigation and empirical investigation.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s because I am not aware of any significant distinction between the two. :p&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The metaphysics of time seems unlikely to be empirically accessible (although maybe that&amp;#39;s debatable).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think there is really any debate on that -- if metaphysics were empirically accessible, then it would just be &amp;quot;physics.&amp;quot;  :)  It is so termed &amp;quot;metaphysics&amp;quot; because it is philosophy and not science, whereas physics is science and not philosophy.  Metaphysics is &lt;em&gt;concerned&lt;/em&gt; with physics, being effectively &lt;em&gt;philosophy&lt;/em&gt; of physics, but it is not physics and I don&amp;#39;t believe that distinction is seriously debated.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You might think that an empirical component is required for something to be scientific, and depending upon how strong you want to make that requirement (regarding type, quality, possibility, etc. of empirical investigation) that view ranges from plausible but to deeply contested on the weaker side to completely implausible on the stronger side.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I mean, all that which is &amp;quot;science&amp;quot; is derivative of the scientific method.  The scientific method necessitates an empirical component.  If it&amp;#39;s not empirical, it&amp;#39;s not scientific, and that isn&amp;#39;t really a contested consideration; it is &lt;em&gt;definitional&lt;/em&gt; to science.  It seems clear to me that there is no handwaving to be had regarding that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg4snz4", "score_hidden": false, "stickied": false, "created": 1491968405.0, "created_utc": 1491939605.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4rqqm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheoryOfSomething", "parent_id": "t1_dg4bzvh", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "&gt;  It's hard to settle such a matter given that it can't be investigated scientifically.\n\nYou're not being sufficiently clear about the distinction between scientific investigation and empirical investigation. The metaphysics of time seems unlikely to be empirically accessible (although maybe that's debatable). You might think that an empirical component is required for something to be scientific, and depending upon how strong you want to make that requirement (regarding type, quality, possibility, etc. of empirical investigation) that view ranges from plausible but to deeply contested on the weaker side to completely implausible on the stronger side.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s hard to settle such a matter given that it can&amp;#39;t be investigated scientifically.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re not being sufficiently clear about the distinction between scientific investigation and empirical investigation. The metaphysics of time seems unlikely to be empirically accessible (although maybe that&amp;#39;s debatable). You might think that an empirical component is required for something to be scientific, and depending upon how strong you want to make that requirement (regarding type, quality, possibility, etc. of empirical investigation) that view ranges from plausible but to deeply contested on the weaker side to completely implausible on the stronger side.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg4rqqm", "score_hidden": false, "stickied": false, "created": 1491967406.0, "created_utc": 1491938606.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4bzvh", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "hikaruzero", "parent_id": "t3_64pz93", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "Yeah ... I think it's safe to say that we understand quite a lot about the \"how\" of time, but not much about the \"why\" of time.  Our most successful theory of how time works and how it is related to other physical concepts like space, mass, movement, reference frames, and causality would be general relativity, which is one of the best-tested theories in all of physics.  We understand enough about time that we can verify some of the most minute effects concerning time, and successfully predict the behavior of systems over time.\n\nAs for *why* time is that way, and *what* it fundamentally is underlying our models of the mathematical structure of time ... that isn't really a scientific question and can't be investigated via the scientific method.  That's really a question of philosophy, and well ... philosophers say a lot of things about time, some insightful, some way off the mark or even provably wrong.  I don't think there is much settled regarding that.  It's hard to settle such a matter given that it can't be investigated scientifically.\n\nHope that helps!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah ... I think it&amp;#39;s safe to say that we understand quite a lot about the &amp;quot;how&amp;quot; of time, but not much about the &amp;quot;why&amp;quot; of time.  Our most successful theory of how time works and how it is related to other physical concepts like space, mass, movement, reference frames, and causality would be general relativity, which is one of the best-tested theories in all of physics.  We understand enough about time that we can verify some of the most minute effects concerning time, and successfully predict the behavior of systems over time.&lt;/p&gt;\n\n&lt;p&gt;As for &lt;em&gt;why&lt;/em&gt; time is that way, and &lt;em&gt;what&lt;/em&gt; it fundamentally is underlying our models of the mathematical structure of time ... that isn&amp;#39;t really a scientific question and can&amp;#39;t be investigated via the scientific method.  That&amp;#39;s really a question of philosophy, and well ... philosophers say a lot of things about time, some insightful, some way off the mark or even provably wrong.  I don&amp;#39;t think there is much settled regarding that.  It&amp;#39;s hard to settle such a matter given that it can&amp;#39;t be investigated scientifically.&lt;/p&gt;\n\n&lt;p&gt;Hope that helps!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg4bzvh", "score_hidden": false, "stickied": false, "created": 1491950122.0, "created_utc": 1491921322.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pz93", "likes": null, "replies": "", "user_reports": [], "id": "dg6cu82", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DWMcAliley", "parent_id": "t3_64pz93", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "You could check out Paul Davies book The Arrow of Time.  It's pretty interesting, though some of the \"cutting edge\" physics in the book is a bit dated (in my edition, anyway).   That book lays out a solid scientific framework for how to think about and discuss time.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could check out Paul Davies book The Arrow of Time.  It&amp;#39;s pretty interesting, though some of the &amp;quot;cutting edge&amp;quot; physics in the book is a bit dated (in my edition, anyway).   That book lays out a solid scientific framework for how to think about and discuss time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg6cu82", "score_hidden": false, "stickied": false, "created": 1492052255.0, "created_utc": 1492023455.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pz93", "likes": null, "replies": "", "user_reports": [], "id": "dg4pgmm", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "springbottom", "parent_id": "t3_64pz93", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "Time is a tool you can put on the wall\nOr wear it on your wrist\nThe past is far behind us\nThe future doesn't exist!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Time is a tool you can put on the wall\nOr wear it on your wrist\nThe past is far behind us\nThe future doesn&amp;#39;t exist!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg4pgmm", "score_hidden": false, "stickied": false, "created": 1491964997.0, "created_utc": 1491936197.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pz93", "likes": null, "replies": "", "user_reports": [], "id": "dg4yx55", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "CoachHouseStudio", "parent_id": "t3_64pz93", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "Time flies like an arrow, fruit flies like a banana.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Time flies like an arrow, fruit flies like a banana.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg4yx55", "score_hidden": false, "stickied": false, "created": 1491975524.0, "created_utc": 1491946724.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhi6", "removal_reason": null, "link_id": "t3_64pz93", "likes": null, "replies": "", "user_reports": [], "id": "dg6a4fw", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "SirKnightRyan", "parent_id": "t3_64pz93", "subreddit_name_prefixed": "r/Physics", "controversiality": 0, "body": "0 %", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;0 %&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Physics", "name": "t1_dg6a4fw", "score_hidden": false, "stickied": false, "created": 1492049471.0, "created_utc": 1492020671.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]