[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "DnD", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Last night was my first time running a session in a local game shop.  I was DM&amp;#39;ing a one-shot for some first-time players, many of them women.  I had a few misgivings about bringing them to the shop because I&amp;#39;d never been there.  I didn&amp;#39;t know the atmosphere.  But I didn&amp;#39;t have a lot of options.&lt;/p&gt;\n\n&lt;p&gt;Luckily, most of the night went off without a hitch.  I got my players settled in and we ran through my dungeon.  We&amp;#39;re having a blast, although one of my players didn&amp;#39;t seem to be staying invested.  That&amp;#39;s fine.  It&amp;#39;s her first time, and she wasn&amp;#39;t really sure about the whole D&amp;amp;D thing.  I do my best to give her and everyone else a good first experience with the game, and if they end up liking it, then that&amp;#39;s great.&lt;/p&gt;\n\n&lt;p&gt;Then, people&amp;#39;s games started to wrap up.&lt;/p&gt;\n\n&lt;p&gt;At first, I noticed a few guys meandering near our table and hovering over some of my players&amp;#39; shoulders.  That&amp;#39;s okay.  Anybody&amp;#39;s free to watch.  But then, it takes a turn for the worst.&lt;/p&gt;\n\n&lt;p&gt;A young man decides that it is completely appropriate to pull up a seat at my table and start talking to one of my players WHILE WE ARE IN THE MIDDLE OF OUR GAME.  What&amp;#39;s worse?  It was my least engaged player.  My player who probably felt the least comfortable in this venue and playing this game.  My friend, who went out of her way to try my hobby, even if she maybe wasn&amp;#39;t interested in the whole tabletop thing.&lt;/p&gt;\n\n&lt;p&gt;This guy does not address the whole table, he addresses her.  And continues to try to talk to her despite her obvious discomfort.  Despite me trying to intercept his attempts at conversation from across the table when I have five million things and several first-time players to manage.  DO NOT DO THIS!  Do NOT fucking do this!&lt;/p&gt;\n\n&lt;p&gt;Networking and making friends is fine.  That&amp;#39;s what game shops are for -- meeting new people in your hobby.  But I didn&amp;#39;t walk up to your game, single out the least comfortable member of your party, and proceeed to attempt conversation with them while they are trying to play.  So, kindly don&amp;#39;t fucking do this to my table.  Also, DON&amp;#39;T SINGLE PEOPLE OUT.  You wanna make some new friends?  Talk to the whole group (preferably when we&amp;#39;re DONE playing).  When you pop a squat next to one of my female friends and keep trying to rope them into a conversation they clearly don&amp;#39;t want to have, it is blatantly obvious what you&amp;#39;re trying to do.  And it is blatantly obvious that we all want you to STOP.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never had to deal with this.  Maybe I should&amp;#39;ve told him to go away, but that didn&amp;#39;t seem in the spirit of the shop.  At one point, I asked him to stop talking because we were trying to get through combat.  He did...for a second.  I gave another warning, and eventually, he wandered away.&lt;/p&gt;\n\n&lt;p&gt;He may have just ensured that my friends never want to come to this game shop again.  Perhaps any chance I had of getting them into the hobby has been shattered because their first experience is now associated with a dude creeping on my most vulnerable friend.  So, thanks for that, stranger.  Thanks for violating several unspoken rules to have an awkward attempt at conversation with a girl.  Good fucking job.&lt;/p&gt;\n\n&lt;p&gt;Personally, I would hope that the gaming community can be inclusive for everybody.  Anyone should be able to walk into a store and feel at home.  Feel like they have people to support them.  And yes, that does mean talking to new people.  But not when we&amp;#39;re engaged in a game.  Not to a single person amongst a group of six.  That&amp;#39;s offputting.  And it may not be intentional, but it&amp;#39;s predatory.  We all know exactly why he singled out my female friend, rather than engaging all of us.  Why he didn&amp;#39;t try to talk to me or the other guy in the group.  It was apparent to my female friends, too.&lt;/p&gt;\n\n&lt;p&gt;This is why women so often get excluded from this community.&lt;/p&gt;\n\n&lt;p&gt;So, please, please, please observe basic decency in public venues.  Don&amp;#39;t interrupt games or try to pick up girls.  We&amp;#39;re all trying to have fun, so don&amp;#39;t make anyone feel singled out or vulnerable.  This kills our culture.&lt;/p&gt;\n\n&lt;p&gt;Oh, and one last point.  If you&amp;#39;re not involved in my game, DO NOT CORRECT ME ON A RULE THAT I&amp;#39;M PRETTY SURE DOESN&amp;#39;T EXIST.&lt;/p&gt;\n\n&lt;p&gt;/end rant&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Last night was my first time running a session in a local game shop.  I was DM'ing a one-shot for some first-time players, many of them women.  I had a few misgivings about bringing them to the shop because I'd never been there.  I didn't know the atmosphere.  But I didn't have a lot of options.\n\nLuckily, most of the night went off without a hitch.  I got my players settled in and we ran through my dungeon.  We're having a blast, although one of my players didn't seem to be staying invested.  That's fine.  It's her first time, and she wasn't really sure about the whole D&amp;D thing.  I do my best to give her and everyone else a good first experience with the game, and if they end up liking it, then that's great.\n\nThen, people's games started to wrap up.\n\nAt first, I noticed a few guys meandering near our table and hovering over some of my players' shoulders.  That's okay.  Anybody's free to watch.  But then, it takes a turn for the worst.\n\nA young man decides that it is completely appropriate to pull up a seat at my table and start talking to one of my players WHILE WE ARE IN THE MIDDLE OF OUR GAME.  What's worse?  It was my least engaged player.  My player who probably felt the least comfortable in this venue and playing this game.  My friend, who went out of her way to try my hobby, even if she maybe wasn't interested in the whole tabletop thing.\n\nThis guy does not address the whole table, he addresses her.  And continues to try to talk to her despite her obvious discomfort.  Despite me trying to intercept his attempts at conversation from across the table when I have five million things and several first-time players to manage.  DO NOT DO THIS!  Do NOT fucking do this!\n\nNetworking and making friends is fine.  That's what game shops are for -- meeting new people in your hobby.  But I didn't walk up to your game, single out the least comfortable member of your party, and proceeed to attempt conversation with them while they are trying to play.  So, kindly don't fucking do this to my table.  Also, DON'T SINGLE PEOPLE OUT.  You wanna make some new friends?  Talk to the whole group (preferably when we're DONE playing).  When you pop a squat next to one of my female friends and keep trying to rope them into a conversation they clearly don't want to have, it is blatantly obvious what you're trying to do.  And it is blatantly obvious that we all want you to STOP.\n\nI've never had to deal with this.  Maybe I should've told him to go away, but that didn't seem in the spirit of the shop.  At one point, I asked him to stop talking because we were trying to get through combat.  He did...for a second.  I gave another warning, and eventually, he wandered away.\n\nHe may have just ensured that my friends never want to come to this game shop again.  Perhaps any chance I had of getting them into the hobby has been shattered because their first experience is now associated with a dude creeping on my most vulnerable friend.  So, thanks for that, stranger.  Thanks for violating several unspoken rules to have an awkward attempt at conversation with a girl.  Good fucking job.\n\nPersonally, I would hope that the gaming community can be inclusive for everybody.  Anyone should be able to walk into a store and feel at home.  Feel like they have people to support them.  And yes, that does mean talking to new people.  But not when we're engaged in a game.  Not to a single person amongst a group of six.  That's offputting.  And it may not be intentional, but it's predatory.  We all know exactly why he singled out my female friend, rather than engaging all of us.  Why he didn't try to talk to me or the other guy in the group.  It was apparent to my female friends, too.\n\nThis is why women so often get excluded from this community.\n\nSo, please, please, please observe basic decency in public venues.  Don't interrupt games or try to pick up girls.  We're all trying to have fun, so don't make anyone feel singled out or vulnerable.  This kills our culture.\n\nOh, and one last point.  If you're not involved in my game, DO NOT CORRECT ME ON A RULE THAT I'M PRETTY SURE DOESN'T EXIST.\n\n/end rant", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65pszu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 777, "report_reasons": null, "author": "HimuShin", "saved": false, "mod_reports": [], "name": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "approved_by": null, "over_18": false, "domain": "self.DnD", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r9ei", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/DnD/comments/65pszu/rant_do_not_chat_up_my_players_while_were_in_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1492387189.0, "url": "https://www.reddit.com/r/DnD/comments/65pszu/rant_do_not_chat_up_my_players_while_were_in_the/", "author_flair_text": null, "quarantine": false, "title": "[Rant] DO NOT chat up my players while we're in the middle of a game. DO. NOT.", "created_utc": 1492358389.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 461, "visited": false, "subreddit_type": "public", "ups": 777}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdol2y", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "shortsinsnow", "parent_id": "t1_dgchprj", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "That feels a bit passive-aggressive, and if anything would make me feel unwelcome as a player over all. *What? There are signs about not talking to people? How unwelcoming*. I get what you're trying to say and get across, but as soon as it's a big sign with rules on it, something like \"Please don't sit at tables with active games\" could seem off putting. \n\nBesides, rules are only for people who would listen to them anyways, and if this individual was looking to hone in on the 'female gamer unicorn', then a sign would likely not have stopped them anyways. Just my 2¢", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That feels a bit passive-aggressive, and if anything would make me feel unwelcome as a player over all. &lt;em&gt;What? There are signs about not talking to people? How unwelcoming&lt;/em&gt;. I get what you&amp;#39;re trying to say and get across, but as soon as it&amp;#39;s a big sign with rules on it, something like &amp;quot;Please don&amp;#39;t sit at tables with active games&amp;quot; could seem off putting. &lt;/p&gt;\n\n&lt;p&gt;Besides, rules are only for people who would listen to them anyways, and if this individual was looking to hone in on the &amp;#39;female gamer unicorn&amp;#39;, then a sign would likely not have stopped them anyways. Just my 2¢&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdol2y", "score_hidden": false, "stickied": false, "created": 1492474211.0, "created_utc": 1492445411.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchprj", "gilded": 0, "archived": false, "score": 48, "report_reasons": null, "author": "ScienceNAlcohol", "parent_id": "t1_dgc8dal", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Or make a sign. It's could also be something that OP could try and speak with the owner of the shop if they would be cool to install such a rule when role playing games are occuring. If it's a shop rule theoretically they can have more push to at least make sure something like this doesn't happen again. Though it just depends on the shop owner.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or make a sign. It&amp;#39;s could also be something that OP could try and speak with the owner of the shop if they would be cool to install such a rule when role playing games are occuring. If it&amp;#39;s a shop rule theoretically they can have more push to at least make sure something like this doesn&amp;#39;t happen again. Though it just depends on the shop owner.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgchprj", "score_hidden": false, "stickied": false, "created": 1492401656.0, "created_utc": 1492372856.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 48}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmg4p", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "lostsanityreturned", "parent_id": "t1_dgdlewt", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "&gt;No, it's weak DMs who let idiots ruin the fun for everyone by not dealing with problem people/players\n\nNot at all, not all DMs sign up for that shit or have the skills needed to start with. It is still the problem player's fault even if a weaker dm is lacking certain skill sets.\n\nEspecially in a social situation like this it can be hard for someone to gauge what they are or aren't allowed to take action on.\n\nPlace the blame where it deserves to be placed", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;No, it&amp;#39;s weak DMs who let idiots ruin the fun for everyone by not dealing with problem people/players&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Not at all, not all DMs sign up for that shit or have the skills needed to start with. It is still the problem player&amp;#39;s fault even if a weaker dm is lacking certain skill sets.&lt;/p&gt;\n\n&lt;p&gt;Especially in a social situation like this it can be hard for someone to gauge what they are or aren&amp;#39;t allowed to take action on.&lt;/p&gt;\n\n&lt;p&gt;Place the blame where it deserves to be placed&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdmg4p", "score_hidden": false, "stickied": false, "created": 1492471760.0, "created_utc": 1492442960.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqdvk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "frogjg2003", "parent_id": "t1_dgdlewt", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "&gt;Last night was my first time running a session in a local game shop. I was DM'ing a one-shot for some first-time players, many of them women. I had a few misgivings about bringing them to the shop because I'd never been there. I didn't know the atmosphere. But I didn't have a lot of options.\n\nNew location, new players, less than ideal options. This isn't a weak DM. This is a DM out of his element without any of the usual support structures he's used to, no matter how minor.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Last night was my first time running a session in a local game shop. I was DM&amp;#39;ing a one-shot for some first-time players, many of them women. I had a few misgivings about bringing them to the shop because I&amp;#39;d never been there. I didn&amp;#39;t know the atmosphere. But I didn&amp;#39;t have a lot of options.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;New location, new players, less than ideal options. This isn&amp;#39;t a weak DM. This is a DM out of his element without any of the usual support structures he&amp;#39;s used to, no matter how minor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdqdvk", "score_hidden": false, "stickied": false, "created": 1492476222.0, "created_utc": 1492447422.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdlewt", "gilded": 0, "archived": false, "score": -7, "report_reasons": null, "author": "Promptic", "parent_id": "t1_dgd5l7h", "subreddit_name_prefixed": "r/DnD", "controversiality": 1, "body": "I know some people are very non-confrontational but the guy clearly didn't give a single shit and OP let himself get stepped all over. OP should be apologizing to his friend for being too spineless to deal with an obvious saboteur of the session.\n\nEdit:\n\n&gt; This is why women so often get excluded from this community.\n\nNo, it's weak DMs who let idiots ruin the fun for everyone by not dealing with problem people/players.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know some people are very non-confrontational but the guy clearly didn&amp;#39;t give a single shit and OP let himself get stepped all over. OP should be apologizing to his friend for being too spineless to deal with an obvious saboteur of the session.&lt;/p&gt;\n\n&lt;p&gt;Edit:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;This is why women so often get excluded from this community.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, it&amp;#39;s weak DMs who let idiots ruin the fun for everyone by not dealing with problem people/players.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdlewt", "score_hidden": false, "stickied": false, "created": 1492470526.0, "created_utc": 1492441726.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd5l7h", "gilded": 0, "archived": false, "score": 80, "report_reasons": null, "author": "DMSassyPants", "parent_id": "t1_dgcsjqr", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Sometimes it takes time to process events like this. And rants can help us along in that processing. \n\nOP did not do nothing. OP recognized his own failure and frustration, ranted to us to help himself process, and some of us will take this rant as a pre-process in the event this happens to us.\n\nFar from lame.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes it takes time to process events like this. And rants can help us along in that processing. &lt;/p&gt;\n\n&lt;p&gt;OP did not do nothing. OP recognized his own failure and frustration, ranted to us to help himself process, and some of us will take this rant as a pre-process in the event this happens to us.&lt;/p&gt;\n\n&lt;p&gt;Far from lame.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd5l7h", "score_hidden": false, "stickied": false, "created": 1492435292.0, "created_utc": 1492406492.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 80}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcya32", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "SherlockGamer", "parent_id": "t1_dgcsjqr", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "This 100% next time step up and say something but remember to control yourself and be polite at first.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This 100% next time step up and say something but remember to control yourself and be polite at first.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcya32", "score_hidden": false, "stickied": false, "created": 1492423762.0, "created_utc": 1492394962.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdl4d4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cashonlyplz", "parent_id": "t1_dgcsjqr", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "You're talking about people who play DnD. Assertive is a trait reserved for but a few of us, naturally. I used to be like OP, too. Agree with the sentiment, though. Its your game, OP. Make it your domain.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re talking about people who play DnD. Assertive is a trait reserved for but a few of us, naturally. I used to be like OP, too. Agree with the sentiment, though. Its your game, OP. Make it your domain.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdl4d4", "score_hidden": false, "stickied": false, "created": 1492470159.0, "created_utc": 1492441359.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcsjqr", "gilded": 0, "archived": false, "score": 48, "report_reasons": null, "author": "BroodingDecepticon", "parent_id": "t1_dgc8dal", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Yup. Doing nothing and then writing a 5 page essay on reddit is probably the lamest thing one can do in such a situation. Either step up in the moment or realize that you were too passive to stand up for your friend. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yup. Doing nothing and then writing a 5 page essay on reddit is probably the lamest thing one can do in such a situation. Either step up in the moment or realize that you were too passive to stand up for your friend. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcsjqr", "score_hidden": false, "stickied": false, "created": 1492416074.0, "created_utc": 1492387274.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 48}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8dal", "gilded": 0, "archived": false, "score": 343, "report_reasons": null, "author": "HutSutRawlson", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "You would have been 100% justified in asking him to leave after he pulled up a chair. \n\n\"You're welcome to stay and watch, but please don't sit down at the table.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You would have been 100% justified in asking him to leave after he pulled up a chair. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re welcome to stay and watch, but please don&amp;#39;t sit down at the table.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc8dal", "score_hidden": false, "stickied": false, "created": 1492389334.0, "created_utc": 1492360534.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 343}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgd5g6g", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ImportantOpinions", "parent_id": "t1_dgcm1h8", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "The best stories find inspiration from real life. Personally, I'd introduce the NPC and say how he's making everyone around the tavern uncomfortable and ask the table what they want to do about it. Suggest to the new player skills her character is proficient. Hopefully, she's proficient in Intimidation. :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The best stories find inspiration from real life. Personally, I&amp;#39;d introduce the NPC and say how he&amp;#39;s making everyone around the tavern uncomfortable and ask the table what they want to do about it. Suggest to the new player skills her character is proficient. Hopefully, she&amp;#39;s proficient in Intimidation. :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd5g6g", "score_hidden": false, "stickied": false, "created": 1492435013.0, "created_utc": 1492406213.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcm1h8", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "HimuShin", "parent_id": "t1_dgclb0j", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I can dig it.  Thanks for giving me a positive spin on this.  Threads get really vitriolic after a certain point...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can dig it.  Thanks for giving me a positive spin on this.  Threads get really vitriolic after a certain point...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcm1h8", "score_hidden": false, "stickied": false, "created": 1492407268.0, "created_utc": 1492378468.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgd1ihi", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RedHedStepChId", "parent_id": "t1_dgclb0j", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "*ABSOLUTELY*, This guy's got it. Make a simple modular npc who ran into an old friend. Either they aren't going to like it and dip or you could let the crew your DMing relish in your versatility.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;ABSOLUTELY&lt;/em&gt;, This guy&amp;#39;s got it. Make a simple modular npc who ran into an old friend. Either they aren&amp;#39;t going to like it and dip or you could let the crew your DMing relish in your versatility.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd1ihi", "score_hidden": false, "stickied": false, "created": 1492428318.0, "created_utc": 1492399518.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdl6mf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cashonlyplz", "parent_id": "t1_dgclb0j", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "That's a great idea and I am now stealing it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a great idea and I am now stealing it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdl6mf", "score_hidden": false, "stickied": false, "created": 1492470237.0, "created_utc": 1492441437.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgclb0j", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "ImportantOpinions", "parent_id": "t1_dgcgqu6", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Next time your friend plays, you can have that nerd inspire an NPC at the tavern. Could be fun for the player and you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Next time your friend plays, you can have that nerd inspire an NPC at the tavern. Could be fun for the player and you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgclb0j", "score_hidden": false, "stickied": false, "created": 1492406309.0, "created_utc": 1492377509.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgclzra", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "VerbiageBarrage", "parent_id": "t1_dgcgqu6", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Agreed. Being the DM makes you the referee of the game. \"Yo dude, step off and let us finish our game\" is perfectly fine.\n\nAdvice I wish I myself took more. I'm far too polite with asshats sometimes - and at the gamestore, you'll always find 2 or 3 socially inept people that can't stop being dumb.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed. Being the DM makes you the referee of the game. &amp;quot;Yo dude, step off and let us finish our game&amp;quot; is perfectly fine.&lt;/p&gt;\n\n&lt;p&gt;Advice I wish I myself took more. I&amp;#39;m far too polite with asshats sometimes - and at the gamestore, you&amp;#39;ll always find 2 or 3 socially inept people that can&amp;#39;t stop being dumb.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgclzra", "score_hidden": false, "stickied": false, "created": 1492407205.0, "created_utc": 1492378405.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcgqu6", "gilded": 0, "archived": false, "score": 69, "report_reasons": null, "author": "HimuShin", "parent_id": "t1_dgcb4jm", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Yeah, you're right.  I learned a lesson, and this isn't something I intend to let happen again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, you&amp;#39;re right.  I learned a lesson, and this isn&amp;#39;t something I intend to let happen again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcgqu6", "score_hidden": false, "stickied": false, "created": 1492400393.0, "created_utc": 1492371593.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 69}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcb4jm", "gilded": 0, "archived": false, "score": 165, "report_reasons": null, "author": "RBomb19", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "My only advice is to act sooner. It sounds like you allowed this behavior to go on for too long before intervening out of politeness. You dont need to be polite to people who are being obviously rude to you. Nip that shit as soon as it becomes a problem and you'll save everyone time and anxiety. I'm always sorry to hear about experiences like these though, its a damn shame for our community", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My only advice is to act sooner. It sounds like you allowed this behavior to go on for too long before intervening out of politeness. You dont need to be polite to people who are being obviously rude to you. Nip that shit as soon as it becomes a problem and you&amp;#39;ll save everyone time and anxiety. I&amp;#39;m always sorry to hear about experiences like these though, its a damn shame for our community&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcb4jm", "score_hidden": false, "stickied": false, "created": 1492392932.0, "created_utc": 1492364132.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 165}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcrcxv", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgcq4ru", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcrcxv", "score_hidden": false, "stickied": false, "created": 1492414477.0, "created_utc": 1492385677.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcq4ru", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgcpt90", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcq4ru", "score_hidden": false, "stickied": false, "created": 1492412789.0, "created_utc": 1492383989.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcpt90", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgcopas", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcpt90", "score_hidden": false, "stickied": false, "created": 1492412343.0, "created_utc": 1492383543.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcopas", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgcobs4", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcopas", "score_hidden": false, "stickied": false, "created": 1492410818.0, "created_utc": 1492382018.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcobs4", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgcku0b", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcobs4", "score_hidden": false, "stickied": false, "created": 1492410295.0, "created_utc": 1492381495.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcku0b", "gilded": 0, "archived": false, "score": 37, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgcdhz2", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": 1492381690.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcku0b", "score_hidden": false, "stickied": false, "created": 1492405707.0, "created_utc": 1492376907.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 37}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgd0m1o", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgckrj6", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd0m1o", "score_hidden": false, "stickied": false, "created": 1492427015.0, "created_utc": 1492398215.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgckrj6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgcf4iu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgckrj6", "score_hidden": false, "stickied": false, "created": 1492405617.0, "created_utc": 1492376817.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcf4iu", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgce5g1", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcf4iu", "score_hidden": false, "stickied": false, "created": 1492398264.0, "created_utc": 1492369464.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcop25", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgce5g1", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcop25", "score_hidden": false, "stickied": false, "created": 1492410807.0, "created_utc": 1492382007.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgce5g1", "gilded": 0, "archived": false, "score": 93, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgcdhz2", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgce5g1", "score_hidden": false, "stickied": false, "created": 1492396957.0, "created_utc": 1492368157.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 93}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdhz2", "gilded": 0, "archived": false, "score": 74, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgc7bze", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcdhz2", "score_hidden": false, "stickied": false, "created": 1492396072.0, "created_utc": 1492367272.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 74}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7bze", "gilded": 0, "archived": false, "score": 222, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgc6uql", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc7bze", "score_hidden": false, "stickied": false, "created": 1492387947.0, "created_utc": 1492359147.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 222}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgccc2a", "gilded": 0, "archived": false, "score": 47, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgcc8ds", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgccc2a", "score_hidden": false, "stickied": false, "created": 1492394514.0, "created_utc": 1492365714.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 47}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcc8ds", "gilded": 0, "archived": false, "score": 37, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgc6uql", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcc8ds", "score_hidden": false, "stickied": false, "created": 1492394381.0, "created_utc": 1492365581.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 37}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6uql", "gilded": 0, "archived": false, "score": 416, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc6uql", "score_hidden": false, "stickied": false, "created": 1492387297.0, "created_utc": 1492358497.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 416}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcm7tw", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "VerbiageBarrage", "parent_id": "t1_dgcd3lu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Some people are just incredibly bad at reading situations. One of my players is an awesome DM - she does a monthly girls game for women trying to get into the hobby, she has really funny and interesting NPCs, and she really is a great player - the kind of player you're always hoping to get, who reads all your goddamn lore and is intertwined in your world. \n\nShe has some turnip of a co-worker who is forever trying to explain to her how bullshit works, including explaining to her what attracts women to the hobbies and what's offensive to them....I mean...she's a woman, she probably knows this shit for herself. And he's completely tone deaf to how the fuck he sounds. (Like a condescending idiot.) It's the fucking worst.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some people are just incredibly bad at reading situations. One of my players is an awesome DM - she does a monthly girls game for women trying to get into the hobby, she has really funny and interesting NPCs, and she really is a great player - the kind of player you&amp;#39;re always hoping to get, who reads all your goddamn lore and is intertwined in your world. &lt;/p&gt;\n\n&lt;p&gt;She has some turnip of a co-worker who is forever trying to explain to her how bullshit works, including explaining to her what attracts women to the hobbies and what&amp;#39;s offensive to them....I mean...she&amp;#39;s a woman, she probably knows this shit for herself. And he&amp;#39;s completely tone deaf to how the fuck he sounds. (Like a condescending idiot.) It&amp;#39;s the fucking worst.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcm7tw", "score_hidden": false, "stickied": false, "created": 1492407500.0, "created_utc": 1492378700.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgchszv", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "ScienceNAlcohol", "parent_id": "t1_dgcd3lu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Also known as the 'nice guy' often times.  Which always make me want to crawl out of my skin.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also known as the &amp;#39;nice guy&amp;#39; often times.  Which always make me want to crawl out of my skin.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgchszv", "score_hidden": false, "stickied": false, "created": 1492401772.0, "created_utc": 1492372972.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcmrx2", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Plageous", "parent_id": "t1_dgcd3lu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "This isn't to be confused with someone who does want help. Sometimes someone might want advise on what to do on their turn or how to build a magic deck, but when they do they'll ask. Let them come to you for advice, or maybe, MAYBE, offer to give them advice in the right situation. Don't ever assume someone needs or wants your help. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t to be confused with someone who does want help. Sometimes someone might want advise on what to do on their turn or how to build a magic deck, but when they do they&amp;#39;ll ask. Let them come to you for advice, or maybe, MAYBE, offer to give them advice in the right situation. Don&amp;#39;t ever assume someone needs or wants your help. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcmrx2", "score_hidden": false, "stickied": false, "created": 1492408240.0, "created_utc": 1492379440.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcz1jy", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Einbrecher", "parent_id": "t1_dgclfr1", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Depends.\n\nIf by bystander you mean that you're a player at the table seeing it happen to another player at the table, just politely ask those people to go away. \"Hey dude, we appreciate the help, but we've got it covered. You're free to watch, but please keep the commentary to yourself so that we can keep distractions to a minimum.\"\n\nIf by bystander you mean that you're a person in the shop seeing something like that happen at a table, it's a bit more iffy because you probably don't have all the information pertaining to the situation and might make things worse by trying to step in. If it's a lurker who commonly does that, calling them out for it or finding some other way to drag them from the table while at the same time indicating to the table that it's OK to tell the guy to get lost is pretty much all you can do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Depends.&lt;/p&gt;\n\n&lt;p&gt;If by bystander you mean that you&amp;#39;re a player at the table seeing it happen to another player at the table, just politely ask those people to go away. &amp;quot;Hey dude, we appreciate the help, but we&amp;#39;ve got it covered. You&amp;#39;re free to watch, but please keep the commentary to yourself so that we can keep distractions to a minimum.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;If by bystander you mean that you&amp;#39;re a person in the shop seeing something like that happen at a table, it&amp;#39;s a bit more iffy because you probably don&amp;#39;t have all the information pertaining to the situation and might make things worse by trying to step in. If it&amp;#39;s a lurker who commonly does that, calling them out for it or finding some other way to drag them from the table while at the same time indicating to the table that it&amp;#39;s OK to tell the guy to get lost is pretty much all you can do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcz1jy", "score_hidden": false, "stickied": false, "created": 1492424822.0, "created_utc": 1492396022.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcry01", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "belltype", "parent_id": "t1_dgclfr1", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "\"Let's figure it out as we play the game!\" And proceed to help as she asks for it or remind her of certain abilities.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Let&amp;#39;s figure it out as we play the game!&amp;quot; And proceed to help as she asks for it or remind her of certain abilities.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcry01", "score_hidden": false, "stickied": false, "created": 1492415250.0, "created_utc": 1492386450.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgctda2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Some_Asian_Kid99", "parent_id": "t1_dgclfr1", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "\"Yo dude, let's all chill out a bit.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Yo dude, let&amp;#39;s all chill out a bit.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgctda2", "score_hidden": false, "stickied": false, "created": 1492417194.0, "created_utc": 1492388394.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdk5db", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Meatloaf_Monday", "parent_id": "t1_dgclfr1", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA \n\nscream time", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA &lt;/p&gt;\n\n&lt;p&gt;scream time&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdk5db", "score_hidden": false, "stickied": false, "created": 1492468929.0, "created_utc": 1492440129.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgclfr1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ImportantOpinions", "parent_id": "t1_dgcd3lu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "As a bystander, what would you want others to do about that behavior? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a bystander, what would you want others to do about that behavior? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgclfr1", "score_hidden": false, "stickied": false, "created": 1492406475.0, "created_utc": 1492377675.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgckrl3", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "deputy_dog", "parent_id": "t1_dgcd3lu", "subreddit_name_prefixed": "r/DnD", "controversiality": 1, "body": "a.k.a. mansplaining", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;a.k.a. mansplaining&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgckrl3", "score_hidden": false, "stickied": false, "created": 1492405619.0, "created_utc": 1492376819.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgd2rvu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ReqOnDeck", "parent_id": "t1_dgd18lv", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[*Princess](https://s-media-cache-ak0.pinimg.com/originals/e2/76/b7/e276b7895267a46f72e8f7c01fa3347d.jpg)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://s-media-cache-ak0.pinimg.com/originals/e2/76/b7/e276b7895267a46f72e8f7c01fa3347d.jpg\"&gt;*Princess&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd2rvu", "score_hidden": false, "stickied": false, "created": 1492430238.0, "created_utc": 1492401438.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd18lv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Trinculoisdead", "parent_id": "t1_dgcd3lu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Well ex-CUUuuUuuse me!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well ex-CUUuuUuuse me!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd18lv", "score_hidden": false, "stickied": false, "created": 1492427926.0, "created_utc": 1492399126.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcd3lu", "gilded": 0, "archived": false, "score": 88, "report_reasons": null, "author": "kokihi", "parent_id": "t1_dgc7cdq", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "[RANT]\nI can not STAND the \"helpers\". The guys who assume that you don't know how to play because you're a woman, so they take it upon themselves to explain the basics to you. IMO, they are the worst. \nAnd I've run into them no matter what I'm doing. \nI went to the shop to prep a session for a campaign I've been running for a year. \"Oh, hey, getting into D&amp;D? Lemme explain how it works.\" \nI was playing a casual game of Magic: The Gathering with a friend\n\"Hey, lemme show you how a burn deck is supposed to be built\" \nI was playing Warmachine with my fiance \nSome dude I've never even SEEN before just stands DIRECTLY next to me, WAY inside my personal bubble, and starts telling me what to do on my turn! \n\n\nThe fact is, it ISN'T kindness. It's condescending. And as much as these guys think they're being nice, they're really being assholes. \n\nReally, they make me appreciate the decent guys who just treat women in hobbies like a person that much more. You guys are doing it right. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[RANT]\nI can not STAND the &amp;quot;helpers&amp;quot;. The guys who assume that you don&amp;#39;t know how to play because you&amp;#39;re a woman, so they take it upon themselves to explain the basics to you. IMO, they are the worst. \nAnd I&amp;#39;ve run into them no matter what I&amp;#39;m doing. \nI went to the shop to prep a session for a campaign I&amp;#39;ve been running for a year. &amp;quot;Oh, hey, getting into D&amp;amp;D? Lemme explain how it works.&amp;quot; \nI was playing a casual game of Magic: The Gathering with a friend\n&amp;quot;Hey, lemme show you how a burn deck is supposed to be built&amp;quot; \nI was playing Warmachine with my fiance \nSome dude I&amp;#39;ve never even SEEN before just stands DIRECTLY next to me, WAY inside my personal bubble, and starts telling me what to do on my turn! &lt;/p&gt;\n\n&lt;p&gt;The fact is, it ISN&amp;#39;T kindness. It&amp;#39;s condescending. And as much as these guys think they&amp;#39;re being nice, they&amp;#39;re really being assholes. &lt;/p&gt;\n\n&lt;p&gt;Really, they make me appreciate the decent guys who just treat women in hobbies like a person that much more. You guys are doing it right. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcd3lu", "score_hidden": false, "stickied": false, "created": 1492395539.0, "created_utc": 1492366739.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 88}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdyaxn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AmandaWakefield", "parent_id": "t1_dgcq2ed", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Only if I can refer to you as asshole 1. Seriously that guy sounds like a knob", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Only if I can refer to you as asshole 1. Seriously that guy sounds like a knob&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdyaxn", "score_hidden": false, "stickied": false, "created": 1492485057.0, "created_utc": 1492456257.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcq2ed", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Myschly", "parent_id": "t1_dgc7cdq", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "One of the women in my group told me the first and last time she played at the most famous game shop in our town they were 4 adventurers, 2 of which were female, and when names had been introduced one guy was \"witty\" enough to say \"I'm not so good with names, maybe I can just say chick 1 and chick 2?\"... Yeah...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One of the women in my group told me the first and last time she played at the most famous game shop in our town they were 4 adventurers, 2 of which were female, and when names had been introduced one guy was &amp;quot;witty&amp;quot; enough to say &amp;quot;I&amp;#39;m not so good with names, maybe I can just say chick 1 and chick 2?&amp;quot;... Yeah...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcq2ed", "score_hidden": false, "stickied": false, "created": 1492412697.0, "created_utc": 1492383897.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcb6ld", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "hidef38", "parent_id": "t1_dgc7cdq", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I'm a woman who's involved in a lot of male dominated hobbies/communities (DnD, video games, Dagorhir, and engineering job) and a lot of men try to overcompensate and end up coming off creepy, or just reminding me that I'm in the minority. \nI see a lot of men either wishing that there were more women in these spaces, or criticizing girls they think just want attention, and the solution to both of those problems is just treat women like anyone else. If you have a helpful tip or idea share it! But don't make it about her gender. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a woman who&amp;#39;s involved in a lot of male dominated hobbies/communities (DnD, video games, Dagorhir, and engineering job) and a lot of men try to overcompensate and end up coming off creepy, or just reminding me that I&amp;#39;m in the minority. \nI see a lot of men either wishing that there were more women in these spaces, or criticizing girls they think just want attention, and the solution to both of those problems is just treat women like anyone else. If you have a helpful tip or idea share it! But don&amp;#39;t make it about her gender. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcb6ld", "score_hidden": false, "stickied": false, "created": 1492393007.0, "created_utc": 1492364207.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcaxwf", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "omnipotentsquirrel", "parent_id": "t1_dgc81dt", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Honestly it's not the genders thing for me he's disturbing a game that I worked hard on preparing. Please if you want to join roll up a character if not please leave my table so I can have my players full attention.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly it&amp;#39;s not the genders thing for me he&amp;#39;s disturbing a game that I worked hard on preparing. Please if you want to join roll up a character if not please leave my table so I can have my players full attention.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcaxwf", "score_hidden": false, "stickied": false, "created": 1492392684.0, "created_utc": 1492363884.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcrdwf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Little_Gray", "parent_id": "t1_dgc81dt", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "By singling them out and telling them not so politely to piss off.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;By singling them out and telling them not so politely to piss off.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcrdwf", "score_hidden": false, "stickied": false, "created": 1492414513.0, "created_utc": 1492385713.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcs3px", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "belltype", "parent_id": "t1_dgc8ulh", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Rolling all up in their DMs (game) if you will.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rolling all up in their DMs (game) if you will.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcs3px", "score_hidden": false, "stickied": false, "created": 1492415463.0, "created_utc": 1492386663.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8ulh", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "Psychachu", "parent_id": "t1_dgc8e8a", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "That is fine for a problem player, but OP was dealing with a game ship random who sat down at his table to chat and was not actually playing with them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is fine for a problem player, but OP was dealing with a game ship random who sat down at his table to chat and was not actually playing with them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc8ulh", "score_hidden": false, "stickied": false, "created": 1492389963.0, "created_utc": 1492361163.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8e8a", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "CheetahSnake", "parent_id": "t1_dgc81dt", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "So, I've been running public games for awhile, and as frustrating as it is I found the best way to help any problem player is to be patient with them.\n\nI'm going to sound entirely insensitive, but it's like training a dog.  If you snap and shout, they'll be resistant and unlikely to work with you.  Calmly asking them to stop something, or suggesting an alternative route is what seems to help the most.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, I&amp;#39;ve been running public games for awhile, and as frustrating as it is I found the best way to help any problem player is to be patient with them.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to sound entirely insensitive, but it&amp;#39;s like training a dog.  If you snap and shout, they&amp;#39;ll be resistant and unlikely to work with you.  Calmly asking them to stop something, or suggesting an alternative route is what seems to help the most.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc8e8a", "score_hidden": false, "stickied": false, "created": 1492389366.0, "created_utc": 1492360566.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc81dt", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "HimuShin", "parent_id": "t1_dgc7cdq", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I run a few games for groups that are mostly women, and I certainly endeavor not to patronize anyone.  And due to the demographics of these groups, there's very little conflict surrounding gender.  This is honestly the first issue I had with this kind of thing, and it was due to an outside party.  Much harder to manage than I imagined...\n\nLike, how do you even go about educating these kinds of people?  I've been an awkward dude before, trying to get a girl's attention.  But there's a time where you have to disengage.  And there are times when it's not cool to swoop in.  And there are ways to not make people feel singled-out and vulnerable.  But how do you get these people to understand?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I run a few games for groups that are mostly women, and I certainly endeavor not to patronize anyone.  And due to the demographics of these groups, there&amp;#39;s very little conflict surrounding gender.  This is honestly the first issue I had with this kind of thing, and it was due to an outside party.  Much harder to manage than I imagined...&lt;/p&gt;\n\n&lt;p&gt;Like, how do you even go about educating these kinds of people?  I&amp;#39;ve been an awkward dude before, trying to get a girl&amp;#39;s attention.  But there&amp;#39;s a time where you have to disengage.  And there are times when it&amp;#39;s not cool to swoop in.  And there are ways to not make people feel singled-out and vulnerable.  But how do you get these people to understand?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc81dt", "score_hidden": false, "stickied": false, "created": 1492388896.0, "created_utc": 1492360096.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcmju2", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "VerbiageBarrage", "parent_id": "t1_dgc7cdq", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I mean, I would handle it by just calling them out not personally, but as a general rule. Setting ground rules around the players of your games is perfectly appropriate. \n\nI've never had anyone say something in my earshot like \"I don't think this game is your speed, hun\" but I'd just put that jackass on blast. Make fun of them for a bit and then tell them to get the fuck away from my players. \n\nAs for the put players on a pedestal, I am guilty of taking time with new players, trying to make sure they get to put in input and punishing them a bit less for bad ideas. I think that's important for any new player. Honestly though, I have to do this more with new/young/socially awkward people than a particular gender. On the other hand, if they are new to the game, and the only new person, I could see how a woman could feel singled out by that.\n\nBeing in peoples bubble is not fucking ok for anyone. It's just not. You don't have to be in the bubble to help. Quit. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean, I would handle it by just calling them out not personally, but as a general rule. Setting ground rules around the players of your games is perfectly appropriate. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never had anyone say something in my earshot like &amp;quot;I don&amp;#39;t think this game is your speed, hun&amp;quot; but I&amp;#39;d just put that jackass on blast. Make fun of them for a bit and then tell them to get the fuck away from my players. &lt;/p&gt;\n\n&lt;p&gt;As for the put players on a pedestal, I am guilty of taking time with new players, trying to make sure they get to put in input and punishing them a bit less for bad ideas. I think that&amp;#39;s important for any new player. Honestly though, I have to do this more with new/young/socially awkward people than a particular gender. On the other hand, if they are new to the game, and the only new person, I could see how a woman could feel singled out by that.&lt;/p&gt;\n\n&lt;p&gt;Being in peoples bubble is not fucking ok for anyone. It&amp;#39;s just not. You don&amp;#39;t have to be in the bubble to help. Quit. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcmju2", "score_hidden": false, "stickied": false, "created": 1492407934.0, "created_utc": 1492379134.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdj90g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NerdsRuleTheWorld", "parent_id": "t1_dgd28o6", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "If you ask them and they ignore you, talk back, or try again after being warned, then you get management involved. Explain you're trying to play a game and want to make this a regular place to do so (bring in more money with some frequency, which is a little important for a business to run successfully) and this jackass won't leave your players alone while you're trying to run the game and wouldn't leave when asked. If management won't step in, then leave and never return to that shop and encourage all your friends to visit anywhere else when they want to buy their shit or play their games, and let them know you're doing exactly that in a polite but firm manner.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you ask them and they ignore you, talk back, or try again after being warned, then you get management involved. Explain you&amp;#39;re trying to play a game and want to make this a regular place to do so (bring in more money with some frequency, which is a little important for a business to run successfully) and this jackass won&amp;#39;t leave your players alone while you&amp;#39;re trying to run the game and wouldn&amp;#39;t leave when asked. If management won&amp;#39;t step in, then leave and never return to that shop and encourage all your friends to visit anywhere else when they want to buy their shit or play their games, and let them know you&amp;#39;re doing exactly that in a polite but firm manner.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdj90g", "score_hidden": false, "stickied": false, "created": 1492467727.0, "created_utc": 1492438927.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd28o6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Terramagi", "parent_id": "t1_dgc7cdq", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Yeah, hate to break it to you, but that's not going to happen. Want to know why?\n\nD&amp;D is mostly played by nerds. More than half of them barely made it through high-school without jumping off a bridge through expertly honed conflict aversion techniques. The people who you want to rise up and perform some sort of cull to make it a more friendly place probably have trouble ordering pizza on the phone, let alone starting a conflict face to face. And that's even ignoring the fact that 80% of the time they're not going to be dissuaded easily.\n\n\"Hey would you leave my player alone, we're in the middle of a game here.\"\n\"Piss off, I'm trying to get some.\"\n\nWhat's step 3 here? What do you really think these broken people can do without just tensing up and hoping that it goes away like the OP did?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, hate to break it to you, but that&amp;#39;s not going to happen. Want to know why?&lt;/p&gt;\n\n&lt;p&gt;D&amp;amp;D is mostly played by nerds. More than half of them barely made it through high-school without jumping off a bridge through expertly honed conflict aversion techniques. The people who you want to rise up and perform some sort of cull to make it a more friendly place probably have trouble ordering pizza on the phone, let alone starting a conflict face to face. And that&amp;#39;s even ignoring the fact that 80% of the time they&amp;#39;re not going to be dissuaded easily.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hey would you leave my player alone, we&amp;#39;re in the middle of a game here.&amp;quot;\n&amp;quot;Piss off, I&amp;#39;m trying to get some.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s step 3 here? What do you really think these broken people can do without just tensing up and hoping that it goes away like the OP did?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd28o6", "score_hidden": false, "stickied": false, "created": 1492429395.0, "created_utc": 1492400595.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7cdq", "gilded": 0, "archived": false, "score": 118, "report_reasons": null, "author": "CheetahSnake", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I actually talk about this a lot with some of my friends who are engaged/married.  Everyone seems to want more women in the hobby, but no one seem to want to address the thing keeping them out.\n\nSome part of it is these negatives of blatant sexual comments, singling them out, or even saying things like \"I don't think this game is your speed hun.\"\n\nEqually as bad though are the players or GMs who put any woman at their table on a pedestal.  \"oh look at how good Mary is!\" \"I'll do anything that is Sarah's idea!\" Or leaning over shoulders and \"helping\".  This kind of behavior while to some is just a little social awkwardness, always with a \"but he's not doing anything wrong\" leaves most women that I've spoken to feeling dirty awkward.\n\nUntil we can get our fellows to stop beating women in the face with kindness and attention, then this hobby will never be as inclusive as we want it to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually talk about this a lot with some of my friends who are engaged/married.  Everyone seems to want more women in the hobby, but no one seem to want to address the thing keeping them out.&lt;/p&gt;\n\n&lt;p&gt;Some part of it is these negatives of blatant sexual comments, singling them out, or even saying things like &amp;quot;I don&amp;#39;t think this game is your speed hun.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Equally as bad though are the players or GMs who put any woman at their table on a pedestal.  &amp;quot;oh look at how good Mary is!&amp;quot; &amp;quot;I&amp;#39;ll do anything that is Sarah&amp;#39;s idea!&amp;quot; Or leaning over shoulders and &amp;quot;helping&amp;quot;.  This kind of behavior while to some is just a little social awkwardness, always with a &amp;quot;but he&amp;#39;s not doing anything wrong&amp;quot; leaves most women that I&amp;#39;ve spoken to feeling dirty awkward.&lt;/p&gt;\n\n&lt;p&gt;Until we can get our fellows to stop beating women in the face with kindness and attention, then this hobby will never be as inclusive as we want it to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc7cdq", "score_hidden": false, "stickied": false, "created": 1492387963.0, "created_utc": 1492359163.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 118}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdn7u1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "theblackveil", "parent_id": "t1_dgc83oe", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "One thing I feel needs to be said, because I'm seeing tons of support for basically eschewing any interaction from outsiders:\n\nI run into friends occasionally at my FLGS that I'm either not currently in games with or haven't seen in awhile pretty frequently; I WILL (assuming it's not obviously at the height of a segment or mid-important thing) stop and do a quick handshake and a *how's it going* and then make sure to break away before it becomes full blown conversation.\n\nThis dude inserting himself into a group and then singling out one player is totally bs and bad. But I don't want everyone reading this thread to think they can't do a quick hey, looks fun, have a great time, which is the vibe I'm getting from all of these responses/comment chains.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One thing I feel needs to be said, because I&amp;#39;m seeing tons of support for basically eschewing any interaction from outsiders:&lt;/p&gt;\n\n&lt;p&gt;I run into friends occasionally at my FLGS that I&amp;#39;m either not currently in games with or haven&amp;#39;t seen in awhile pretty frequently; I WILL (assuming it&amp;#39;s not obviously at the height of a segment or mid-important thing) stop and do a quick handshake and a &lt;em&gt;how&amp;#39;s it going&lt;/em&gt; and then make sure to break away before it becomes full blown conversation.&lt;/p&gt;\n\n&lt;p&gt;This dude inserting himself into a group and then singling out one player is totally bs and bad. But I don&amp;#39;t want everyone reading this thread to think they can&amp;#39;t do a quick hey, looks fun, have a great time, which is the vibe I&amp;#39;m getting from all of these responses/comment chains.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdn7u1", "score_hidden": false, "stickied": false, "created": 1492472647.0, "created_utc": 1492443847.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc83oe", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "HimuShin", "parent_id": "t1_dgc7ogj", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I've actually DM'd a few times, and feel as though I have a pretty good grasp on keeping things on-track.  Just never had to deal with this before, so it's a learning experience, I suppose.\n\nBut in the future, when I run games in public, I'm going to be much more hard-line about outsiders approaching the table.  I seriously do not want this repeated in any group I run.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve actually DM&amp;#39;d a few times, and feel as though I have a pretty good grasp on keeping things on-track.  Just never had to deal with this before, so it&amp;#39;s a learning experience, I suppose.&lt;/p&gt;\n\n&lt;p&gt;But in the future, when I run games in public, I&amp;#39;m going to be much more hard-line about outsiders approaching the table.  I seriously do not want this repeated in any group I run.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc83oe", "score_hidden": false, "stickied": false, "created": 1492388980.0, "created_utc": 1492360180.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcya3h", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "GrogsGolfCaddy", "parent_id": "t1_dgc7ogj", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "&gt; coked up Kender in an pawn shop.\n\nThat image is more terrifying than anything wrought by Lovecraft.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;coked up Kender in an pawn shop.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That image is more terrifying than anything wrought by Lovecraft.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcya3h", "score_hidden": false, "stickied": false, "created": 1492423762.0, "created_utc": 1492394962.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdxxd1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PennyPriddy", "parent_id": "t1_dgco09h", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "It sounded like the DM knew his players, so it could be they were friends of the DM, just that the DM didn't have a placec to run the game, so the game shop worked.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounded like the DM knew his players, so it could be they were friends of the DM, just that the DM didn&amp;#39;t have a placec to run the game, so the game shop worked.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdxxd1", "score_hidden": false, "stickied": false, "created": 1492484623.0, "created_utc": 1492455823.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgco09h", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "j3w3ls", "parent_id": "t1_dgc7ogj", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I'll just say that many girls will feel both awkward and a little worried with going to a private residence on a first time. Having a creepo in a game store is bad - but just imagine that in someone's house. At least in a public place it's easier to leave. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll just say that many girls will feel both awkward and a little worried with going to a private residence on a first time. Having a creepo in a game store is bad - but just imagine that in someone&amp;#39;s house. At least in a public place it&amp;#39;s easier to leave. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgco09h", "score_hidden": false, "stickied": false, "created": 1492409863.0, "created_utc": 1492381063.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7ogj", "gilded": 0, "archived": false, "score": 61, "report_reasons": null, "author": "XavierMendel", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Game/hobby shops always seem to attract weird people. For every well adjusted, normal, sociable person in there, there's one or two walking stereotypes that make everyone else regret coming.\n\nYou did fine for your first time DMing. DMing is built on experience. You get better over time. Whether it's weeks, months, years, even decades. You learn from others and steal from other DMs like a coked up Kender in an pawn shop.\n\nI impose a rule at the table: If you're not in the party, you're silent. You can observe quietly if you wish, and ask questions to the DM about the game, but that's it. The expectation is that you observe to gain interest and understanding. Don't do it without my approval first either. If you show up mid-session to sit in, you either leave or produce pizza. Hitting on players is never allowed. D&amp;D is supposed to be a relaxing and engaging recreational activity, not a time to field advances from unwanted strangers.\n\nOverall, let me give you this advice: Until you're better at controlling the table, and who is there, run it in a private place. Dining room, basement, whatever. Game shops are fine for people who can effectively control their environment and make people listen, as well as shops with owners and managers who are harsh on this sort of behavior. Others, it takes experienced DMs and players to manage.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Game/hobby shops always seem to attract weird people. For every well adjusted, normal, sociable person in there, there&amp;#39;s one or two walking stereotypes that make everyone else regret coming.&lt;/p&gt;\n\n&lt;p&gt;You did fine for your first time DMing. DMing is built on experience. You get better over time. Whether it&amp;#39;s weeks, months, years, even decades. You learn from others and steal from other DMs like a coked up Kender in an pawn shop.&lt;/p&gt;\n\n&lt;p&gt;I impose a rule at the table: If you&amp;#39;re not in the party, you&amp;#39;re silent. You can observe quietly if you wish, and ask questions to the DM about the game, but that&amp;#39;s it. The expectation is that you observe to gain interest and understanding. Don&amp;#39;t do it without my approval first either. If you show up mid-session to sit in, you either leave or produce pizza. Hitting on players is never allowed. D&amp;amp;D is supposed to be a relaxing and engaging recreational activity, not a time to field advances from unwanted strangers.&lt;/p&gt;\n\n&lt;p&gt;Overall, let me give you this advice: Until you&amp;#39;re better at controlling the table, and who is there, run it in a private place. Dining room, basement, whatever. Game shops are fine for people who can effectively control their environment and make people listen, as well as shops with owners and managers who are harsh on this sort of behavior. Others, it takes experienced DMs and players to manage.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc7ogj", "score_hidden": false, "stickied": false, "created": 1492388415.0, "created_utc": 1492359615.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 61}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcdjsu", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "_Warth0g_", "parent_id": "t1_dgc8ra3", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Well that was his first problem", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well that was his first problem&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcdjsu", "score_hidden": false, "stickied": false, "created": 1492396140.0, "created_utc": 1492367340.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8ra3", "gilded": 0, "archived": false, "score": 45, "report_reasons": null, "author": "HimuShin", "parent_id": "t1_dgc8kpj", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "For reference, he had been playing Pathfinder before accosting our table.  He knew what was up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For reference, he had been playing Pathfinder before accosting our table.  He knew what was up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc8ra3", "score_hidden": false, "stickied": false, "created": 1492389838.0, "created_utc": 1492361038.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 45}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8kpj", "gilded": 0, "archived": false, "score": 41, "report_reasons": null, "author": "D16_Nichevo", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "&gt; This guy does not address the whole table, he addresses her.\n\nAt first I thought to myself that he probably didn't really understand what was going on. He had no idea of what D&amp;D is.\n\nBut on thinking of it more: that behaviour would've been inappropriate if you were playing poker, Monopoly, or even just sitting at a table talking.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;This guy does not address the whole table, he addresses her.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;At first I thought to myself that he probably didn&amp;#39;t really understand what was going on. He had no idea of what D&amp;amp;D is.&lt;/p&gt;\n\n&lt;p&gt;But on thinking of it more: that behaviour would&amp;#39;ve been inappropriate if you were playing poker, Monopoly, or even just sitting at a table talking.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc8kpj", "score_hidden": false, "stickied": false, "created": 1492389602.0, "created_utc": 1492360802.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 41}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgd56yc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "VerbiageBarrage", "parent_id": "t1_dgd03k3", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "It's nice to have close friends that know you and know when to shoulder off the assholes. And honestly, interrupting a D&amp;D game is such a asshole thing to do on so many levels.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s nice to have close friends that know you and know when to shoulder off the assholes. And honestly, interrupting a D&amp;amp;D game is such a asshole thing to do on so many levels.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd56yc", "score_hidden": false, "stickied": false, "created": 1492434496.0, "created_utc": 1492405696.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd03k3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Laurapocalyptic", "parent_id": "t1_dgcxxli", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Genuinely oblivious guys are fine, and are usually cool with being let down gently. Dickheads are not fine. \n\n(*Interrupting my DnD game? Death-worthy tbh. I have monsters to slay and BBEGs to usurp!*)\n\nI think I'm pretty decent at standing up for myself verbally, but I am absolutely tiny so some people just kinda ignore what I say... :L That's where the 6ft buddies come in haha \n\nI don't think they'd really see it as white-knighting, thankfully. They'd more see it as \"save this dude before Laura hits him with her bag of dice\" :P \n\nBut your concern is sweet! I appreciate the support!!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Genuinely oblivious guys are fine, and are usually cool with being let down gently. Dickheads are not fine. &lt;/p&gt;\n\n&lt;p&gt;(&lt;em&gt;Interrupting my DnD game? Death-worthy tbh. I have monsters to slay and BBEGs to usurp!&lt;/em&gt;)&lt;/p&gt;\n\n&lt;p&gt;I think I&amp;#39;m pretty decent at standing up for myself verbally, but I am absolutely tiny so some people just kinda ignore what I say... :L That&amp;#39;s where the 6ft buddies come in haha &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think they&amp;#39;d really see it as white-knighting, thankfully. They&amp;#39;d more see it as &amp;quot;save this dude before Laura hits him with her bag of dice&amp;quot; :P &lt;/p&gt;\n\n&lt;p&gt;But your concern is sweet! I appreciate the support!!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd03k3", "score_hidden": false, "stickied": false, "created": 1492426292.0, "created_utc": 1492397492.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcxxli", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "VerbiageBarrage", "parent_id": "t1_dgceh11", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Hey, don't feel bad about shutting it down yourself. If you say something that indicates you're offended and not enjoying the attention, that takes the guesswork out of it for people around you, and they will likely take your side in the matter. \n\nIn my experience, people don't want to come off as white knights, so they aren't going to intervene unless you give them an obvious clue to. But given a heads up, they'll probably be glad to shut down dipshits.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, don&amp;#39;t feel bad about shutting it down yourself. If you say something that indicates you&amp;#39;re offended and not enjoying the attention, that takes the guesswork out of it for people around you, and they will likely take your side in the matter. &lt;/p&gt;\n\n&lt;p&gt;In my experience, people don&amp;#39;t want to come off as white knights, so they aren&amp;#39;t going to intervene unless you give them an obvious clue to. But given a heads up, they&amp;#39;ll probably be glad to shut down dipshits.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcxxli", "score_hidden": false, "stickied": false, "created": 1492423276.0, "created_utc": 1492394476.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdbpml", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Laurapocalyptic", "parent_id": "t1_dgd0xm6", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Three are good friends, three I didn't know all that well before we started playing", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Three are good friends, three I didn&amp;#39;t know all that well before we started playing&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdbpml", "score_hidden": false, "stickied": false, "created": 1492452030.0, "created_utc": 1492423230.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0xm6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BlueFireAt", "parent_id": "t1_dgceh11", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Are you playing with friends? Generally I've found that means you already know what you're going to get with your party.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you playing with friends? Generally I&amp;#39;ve found that means you already know what you&amp;#39;re going to get with your party.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd0xm6", "score_hidden": false, "stickied": false, "created": 1492427482.0, "created_utc": 1492398682.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgceh11", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Laurapocalyptic", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I'd like to shout out my two DnD groups here. I'm the only female PC in both at the moment, but they don't treat me any differently because of it. I do something stupid? They roast me just like the rest. I do something good? Party time, just like whenever another member of the party does it. Really cool guys, and I owe them for getting me invested into this fab game. \n\nWe play it privately, however. I'm kinda dreading what will happen if we ever play in a public setting, but I like to think the guys will shut down any negative behaviour towards me just for my gender. \n\nOP, I really hope these ladies enjoyed the game despite that rude twat. If they ever want to chat to another girl who plays, my DMs are open! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d like to shout out my two DnD groups here. I&amp;#39;m the only female PC in both at the moment, but they don&amp;#39;t treat me any differently because of it. I do something stupid? They roast me just like the rest. I do something good? Party time, just like whenever another member of the party does it. Really cool guys, and I owe them for getting me invested into this fab game. &lt;/p&gt;\n\n&lt;p&gt;We play it privately, however. I&amp;#39;m kinda dreading what will happen if we ever play in a public setting, but I like to think the guys will shut down any negative behaviour towards me just for my gender. &lt;/p&gt;\n\n&lt;p&gt;OP, I really hope these ladies enjoyed the game despite that rude twat. If they ever want to chat to another girl who plays, my DMs are open! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgceh11", "score_hidden": false, "stickied": false, "created": 1492397390.0, "created_utc": 1492368590.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgdb35y", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ObsidianOverlord", "parent_id": "t1_dgcs084", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I mean approaching someone in a public place doesn't make someone creepy, just really inconsiderate.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean approaching someone in a public place doesn&amp;#39;t make someone creepy, just really inconsiderate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdb35y", "score_hidden": false, "stickied": false, "created": 1492449886.0, "created_utc": 1492421086.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdemq3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Birdbraned", "parent_id": "t1_dgcs084", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "In the middle of combat, introduce him as an NPC hostage at risk of dying.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the middle of combat, introduce him as an NPC hostage at risk of dying.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdemq3", "score_hidden": false, "stickied": false, "created": 1492460053.0, "created_utc": 1492431253.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcs084", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "Theons_sausage", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "You should've introduced him as an NPC. \n\nDM: \"Female Friend (FF), suddenly while you are all sitting at the tavern, a creepy man slides into the seat next to you. You notice his hair is greasy and unwashed, his skin has a thin film covering it, and his thin wormy lips curl into a grin as he hovers near you, breathing heavily.\" \n\nFF: Umm, I say hello to him? \n\nDM: *looks over at creepy man IRL* \"How do you respond?\" \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should&amp;#39;ve introduced him as an NPC. &lt;/p&gt;\n\n&lt;p&gt;DM: &amp;quot;Female Friend (FF), suddenly while you are all sitting at the tavern, a creepy man slides into the seat next to you. You notice his hair is greasy and unwashed, his skin has a thin film covering it, and his thin wormy lips curl into a grin as he hovers near you, breathing heavily.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;FF: Umm, I say hello to him? &lt;/p&gt;\n\n&lt;p&gt;DM: &lt;em&gt;looks over at creepy man IRL&lt;/em&gt; &amp;quot;How do you respond?&amp;quot; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcs084", "score_hidden": false, "stickied": false, "created": 1492415335.0, "created_utc": 1492386535.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcpsbc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LakeVermilionDreams", "parent_id": "t1_dgc8y9o", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I think you should mention it anyways. If it's the first offense, the store owner might give a few more chances just as you are suggesting you do, but if this person already has a history that the shopkeep knows of (that you might not) maybe this would have already been a third strike against him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you should mention it anyways. If it&amp;#39;s the first offense, the store owner might give a few more chances just as you are suggesting you do, but if this person already has a history that the shopkeep knows of (that you might not) maybe this would have already been a third strike against him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcpsbc", "score_hidden": false, "stickied": false, "created": 1492412307.0, "created_utc": 1492383507.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8y9o", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "HimuShin", "parent_id": "t1_dgc8uww", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "If I wind up frequenting this place, and it continues to occur, I will certainly be bringing it up with management.  And I'm going to be much harsher about this behavior.  I'm frankly upset with myself that I didn't do more to help my friend in this situation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I wind up frequenting this place, and it continues to occur, I will certainly be bringing it up with management.  And I&amp;#39;m going to be much harsher about this behavior.  I&amp;#39;m frankly upset with myself that I didn&amp;#39;t do more to help my friend in this situation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc8y9o", "score_hidden": false, "stickied": false, "created": 1492390099.0, "created_utc": 1492361299.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8uww", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Kitakitakita", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "That's just crazy. I feel like DnD is supposed to improve social skills, but for some people it just falls short. \n\nThe good thing about being in a store however, is that you can go to the clerk or whoevers in charge and talk to them about it.repeated offences can easily ban him from the store.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s just crazy. I feel like DnD is supposed to improve social skills, but for some people it just falls short. &lt;/p&gt;\n\n&lt;p&gt;The good thing about being in a store however, is that you can go to the clerk or whoevers in charge and talk to them about it.repeated offences can easily ban him from the store.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc8uww", "score_hidden": false, "stickied": false, "created": 1492389975.0, "created_utc": 1492361175.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcgtzr", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "HimuShin", "parent_id": "t1_dgcbrdo", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I absolutely agree.  I was one of the people in the wrong here.  It was a situation I hadn't prepared for, and my natural reaction was to try to keep things going.  Frankly, I've never had to deal with disruption of this level, so I definitely got a lesson in how not to handle it.  And in the future, I'll remember it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I absolutely agree.  I was one of the people in the wrong here.  It was a situation I hadn&amp;#39;t prepared for, and my natural reaction was to try to keep things going.  Frankly, I&amp;#39;ve never had to deal with disruption of this level, so I definitely got a lesson in how not to handle it.  And in the future, I&amp;#39;ll remember it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcgtzr", "score_hidden": false, "stickied": false, "created": 1492400508.0, "created_utc": 1492371708.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcyhjn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "GrogsGolfCaddy", "parent_id": "t1_dgcbrdo", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Though I agree the DM could have handled things better for his players, I don't think you can simply say \"it's on you.\"\n\nUltimately, it's on the creepy guy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Though I agree the DM could have handled things better for his players, I don&amp;#39;t think you can simply say &amp;quot;it&amp;#39;s on you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Ultimately, it&amp;#39;s on the creepy guy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcyhjn", "score_hidden": false, "stickied": false, "created": 1492424050.0, "created_utc": 1492395250.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgd04w0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Einbrecher", "parent_id": "t1_dgcbrdo", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Justification isn't necessary, and it's likely that he'd try and argue the point. On what you said, he'd probably say that he knows and is trying to help out - don't even give him that handhold. Simply say:\n\n\"Dude, you're disrupting this entire table. Either cut it out or please leave us alone.\"\n\nCue incoherent babbling, feigned innocence, and a poor attempt at faking offense taken\n\n\"I don't care. You're welcome to step back and watch, but please refrain from interrupting us.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Justification isn&amp;#39;t necessary, and it&amp;#39;s likely that he&amp;#39;d try and argue the point. On what you said, he&amp;#39;d probably say that he knows and is trying to help out - don&amp;#39;t even give him that handhold. Simply say:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Dude, you&amp;#39;re disrupting this entire table. Either cut it out or please leave us alone.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Cue incoherent babbling, feigned innocence, and a poor attempt at faking offense taken&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I don&amp;#39;t care. You&amp;#39;re welcome to step back and watch, but please refrain from interrupting us.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd04w0", "score_hidden": false, "stickied": false, "created": 1492426346.0, "created_utc": 1492397546.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbrdo", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Bronco_Corgi", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Actually, I put thus in you as GM.  As soon as it started you should have said 'dude..  we are in the middle of a game and you are interrupting... these are first timers so I need their attention.'", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually, I put thus in you as GM.  As soon as it started you should have said &amp;#39;dude..  we are in the middle of a game and you are interrupting... these are first timers so I need their attention.&amp;#39;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcbrdo", "score_hidden": false, "stickied": false, "created": 1492393759.0, "created_utc": 1492364959.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcsm7i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "belltype", "parent_id": "t1_dgcnnnk", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "That sucks hard time. You won't come even if you roll with your own DnD posse?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That sucks hard time. You won&amp;#39;t come even if you roll with your own DnD posse?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcsm7i", "score_hidden": false, "stickied": false, "created": 1492416170.0, "created_utc": 1492387370.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdkai0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kylden_Ar", "parent_id": "t1_dgcnnnk", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I am a guy DM, and this is why I stopped running at public shops. I usually have 1-3 female players depending on the game (usually one player's younger sister, an occasional spouse, and an identifies as female transitioning) and I'm not making them put up with this shit. \n\nIn the day of social media, Amazon, and DriveThru RPG, I think it's time the so called \"Friendly\" local game store dies. It's an outdated model held up by a lot of Gatekeepers to help maintain their \"hold\" on the hobby. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am a guy DM, and this is why I stopped running at public shops. I usually have 1-3 female players depending on the game (usually one player&amp;#39;s younger sister, an occasional spouse, and an identifies as female transitioning) and I&amp;#39;m not making them put up with this shit. &lt;/p&gt;\n\n&lt;p&gt;In the day of social media, Amazon, and DriveThru RPG, I think it&amp;#39;s time the so called &amp;quot;Friendly&amp;quot; local game store dies. It&amp;#39;s an outdated model held up by a lot of Gatekeepers to help maintain their &amp;quot;hold&amp;quot; on the hobby. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdkai0", "score_hidden": false, "stickied": false, "created": 1492469114.0, "created_utc": 1492440314.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcnnnk", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "jerk--alert", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "This is why I stopped gaming at shops. I play MtG and D&amp;D and I know I miss out on a lot of gaming opportunities by not going to the shop to game, but I just can't handle it anymore. \n\nI'm there to hang out and game, not get awkwardly hit on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is why I stopped gaming at shops. I play MtG and D&amp;amp;D and I know I miss out on a lot of gaming opportunities by not going to the shop to game, but I just can&amp;#39;t handle it anymore. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m there to hang out and game, not get awkwardly hit on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcnnnk", "score_hidden": false, "stickied": false, "created": 1492409390.0, "created_utc": 1492380590.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcq3hf", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "TableTerra", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "\"Excuse me sir, we are in the middle of a game and our players would prefer no distractions\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Excuse me sir, we are in the middle of a game and our players would prefer no distractions&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcq3hf", "score_hidden": false, "stickied": false, "created": 1492412739.0, "created_utc": 1492383939.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dge0dvp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Croktopus", "parent_id": "t1_dgds007", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "yeah that points already been made. you still dont walk up to a stranger's gaming table to rules lawyer. but i was just talking about my own experience.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeah that points already been made. you still dont walk up to a stranger&amp;#39;s gaming table to rules lawyer. but i was just talking about my own experience.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dge0dvp", "score_hidden": false, "stickied": false, "created": 1492487414.0, "created_utc": 1492458614.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgds007", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Pomegranate_of_Pain", "parent_id": "t1_dgcri8w", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Vulnerability *is* part of 5e. PHB-p.197\nOP's characters could have been fighting skeletons which do have vulnerability bludgeoning.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Vulnerability &lt;em&gt;is&lt;/em&gt; part of 5e. PHB-p.197\nOP&amp;#39;s characters could have been fighting skeletons which do have vulnerability bludgeoning.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgds007", "score_hidden": false, "stickied": false, "created": 1492478017.0, "created_utc": 1492449217.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcri8w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Croktopus", "parent_id": "t1_dgcndzw", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "That's actually been the most common thing I've been \"corrected\" on in my 5e game, is damage resistances/vulnerabilities/immunities, based on past editions. Just any rules based on past editions. If you're gonna do a rule correction, I have no problem with it, just look it up in a 5e rulebook beforehand and don't say \"yeah I'm pretty sure\" when I ask if it's a 5e rule and not pathfinder.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s actually been the most common thing I&amp;#39;ve been &amp;quot;corrected&amp;quot; on in my 5e game, is damage resistances/vulnerabilities/immunities, based on past editions. Just any rules based on past editions. If you&amp;#39;re gonna do a rule correction, I have no problem with it, just look it up in a 5e rulebook beforehand and don&amp;#39;t say &amp;quot;yeah I&amp;#39;m pretty sure&amp;quot; when I ask if it&amp;#39;s a 5e rule and not pathfinder.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcri8w", "score_hidden": false, "stickied": false, "created": 1492414674.0, "created_utc": 1492385874.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdh6h0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "quaid4", "parent_id": "t1_dgcndzw", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "It's in pathfinder, I remember trying to convince my dm an axe is basically slashing, piercing, and bludgeoning rolled into one", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s in pathfinder, I remember trying to convince my dm an axe is basically slashing, piercing, and bludgeoning rolled into one&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdh6h0", "score_hidden": false, "stickied": false, "created": 1492464671.0, "created_utc": 1492435871.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcndzw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Plageous", "parent_id": "t1_dgclsmp", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Yeah in 2e and 3.xe but I'm pretty sure most of that has been taken out of the game. It might be a thing in Pathfinder but I'm not sure. Either way it's not ok to just jump in on rules in a game you aren't participating in", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah in 2e and 3.xe but I&amp;#39;m pretty sure most of that has been taken out of the game. It might be a thing in Pathfinder but I&amp;#39;m not sure. Either way it&amp;#39;s not ok to just jump in on rules in a game you aren&amp;#39;t participating in&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcndzw", "score_hidden": false, "stickied": false, "created": 1492409047.0, "created_utc": 1492380247.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgclsmp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "murdeoc", "parent_id": "t1_dgciycb", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "so the guy was prob right and pointing out vulnerability?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;so the guy was prob right and pointing out vulnerability?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgclsmp", "score_hidden": false, "stickied": false, "created": 1492406943.0, "created_utc": 1492378143.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgckh8t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kane_t", "parent_id": "t1_dgciycb", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Oh, neat.  I haven't looked much into 5e.  Good to know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, neat.  I haven&amp;#39;t looked much into 5e.  Good to know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgckh8t", "score_hidden": false, "stickied": false, "created": 1492405224.0, "created_utc": 1492376424.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgciycb", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "meacle", "parent_id": "t1_dgciia1", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I only play 5e, and I can say there are still a lot of damage resistances around. In particular, skeletons don't have damage resistance slashing/piercing, but do have a vulnerability to bludgeoning. Not that it's really relevant to any of the rest of the thread or anything ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I only play 5e, and I can say there are still a lot of damage resistances around. In particular, skeletons don&amp;#39;t have damage resistance slashing/piercing, but do have a vulnerability to bludgeoning. Not that it&amp;#39;s really relevant to any of the rest of the thread or anything &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgciycb", "score_hidden": false, "stickied": false, "created": 1492403238.0, "created_utc": 1492374438.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgciia1", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "kane_t", "parent_id": "t1_dgchsbi", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Probably something about how, in older D&amp;D versions, a lot of monsters had damage resistance to specific physical damage types.  For example, reanimated skeletons would have DR vs. slashing and piercing, so you wanted to use bludgeoning damage against them if you could.  That hasn't been in D&amp;D for like a decade, though, as far as I know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Probably something about how, in older D&amp;amp;D versions, a lot of monsters had damage resistance to specific physical damage types.  For example, reanimated skeletons would have DR vs. slashing and piercing, so you wanted to use bludgeoning damage against them if you could.  That hasn&amp;#39;t been in D&amp;amp;D for like a decade, though, as far as I know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgciia1", "score_hidden": false, "stickied": false, "created": 1492402667.0, "created_utc": 1492373867.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcp6zt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MushrooomSamba", "parent_id": "t1_dgchsbi", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Which game were you running? What monsters was the party fighting?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Which game were you running? What monsters was the party fighting?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcp6zt", "score_hidden": false, "stickied": false, "created": 1492411500.0, "created_utc": 1492382700.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchsbi", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "HimuShin", "parent_id": "t1_dgcea4u", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Haha, I was waiting for someone to ask.  I haven't looked it up, but he said something about attack rolls and bludgeoning damage.  Like one of my players should've been doing more damage?  I don't even rememeber, but it didn't sound like anything I'd heard before.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha, I was waiting for someone to ask.  I haven&amp;#39;t looked it up, but he said something about attack rolls and bludgeoning damage.  Like one of my players should&amp;#39;ve been doing more damage?  I don&amp;#39;t even rememeber, but it didn&amp;#39;t sound like anything I&amp;#39;d heard before.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgchsbi", "score_hidden": false, "stickied": false, "created": 1492401747.0, "created_utc": 1492372947.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcea4u", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "MushrooomSamba", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "&gt;Oh, and one last point. If you're not involved in my game, DO NOT CORRECT ME ON A RULE THAT I'M PRETTY SURE DOESN'T EXIST.\n\nMost of the useful things to say on the rest have already been said, so I'm curious about this part. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Oh, and one last point. If you&amp;#39;re not involved in my game, DO NOT CORRECT ME ON A RULE THAT I&amp;#39;M PRETTY SURE DOESN&amp;#39;T EXIST.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Most of the useful things to say on the rest have already been said, so I&amp;#39;m curious about this part. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcea4u", "score_hidden": false, "stickied": false, "created": 1492397129.0, "created_utc": 1492368329.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcv4k5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "nuttyjigs", "parent_id": "t1_dgcfhlm", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "That...Sounds borderline illegal. Sucks how people like this ruin hobbies for everyone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That...Sounds borderline illegal. Sucks how people like this ruin hobbies for everyone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcv4k5", "score_hidden": false, "stickied": false, "created": 1492419555.0, "created_utc": 1492390755.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcfhlm", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "JadedRabbit", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Man this isn't exclusive to D&amp;D either. A while back we had a bunch of curious high school students come into our LGS. Some of them were kitchen table Magic: the Gathering players and with them were some friends. A friend, the owner, and I collaborated to get them each a starter deck at no charge to show them the hobby. They seemed responsive and most of the usuals were playing against them with similar, low power decks. \n\nThen enter That Guy. He starts focusing in on the two girls playing against each other while my friend helps rules questions. He just goes on to be the creepiest dude ever. Touching their hands to recommend plays, sitting really close, and just crossing personal space lines. When he started saying stuff about how nice they smelled we got the owner involved to force him to the other room, or he could leave. \n\nNever saw those kids come back. That guy was always weird to play commander with, but. Fuck. I didn't expect him to pull out the stops.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man this isn&amp;#39;t exclusive to D&amp;amp;D either. A while back we had a bunch of curious high school students come into our LGS. Some of them were kitchen table Magic: the Gathering players and with them were some friends. A friend, the owner, and I collaborated to get them each a starter deck at no charge to show them the hobby. They seemed responsive and most of the usuals were playing against them with similar, low power decks. &lt;/p&gt;\n\n&lt;p&gt;Then enter That Guy. He starts focusing in on the two girls playing against each other while my friend helps rules questions. He just goes on to be the creepiest dude ever. Touching their hands to recommend plays, sitting really close, and just crossing personal space lines. When he started saying stuff about how nice they smelled we got the owner involved to force him to the other room, or he could leave. &lt;/p&gt;\n\n&lt;p&gt;Never saw those kids come back. That guy was always weird to play commander with, but. Fuck. I didn&amp;#39;t expect him to pull out the stops.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcfhlm", "score_hidden": false, "stickied": false, "created": 1492398740.0, "created_utc": 1492369940.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcwfdi", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "GrappinPrime", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "For real man, I hate playing in shops because as dope as they are there is always one dude who is just socially off putting enough to ruin the experience.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For real man, I hate playing in shops because as dope as they are there is always one dude who is just socially off putting enough to ruin the experience.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcwfdi", "score_hidden": false, "stickied": false, "created": 1492421218.0, "created_utc": 1492392418.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcxm1e", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Is_Generally_Hostile", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Did you actually do anything about this in the moment? This is super bullshit stuff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did you actually do anything about this in the moment? This is super bullshit stuff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcxm1e", "score_hidden": false, "stickied": false, "created": 1492422823.0, "created_utc": 1492394023.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgczpte", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Einbrecher", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "You're the DM - it's your table. If something is going on that you don't like, then you need to speak up and handle it immediately regardless of whether it's a player or a bystander creating the problem.\n\nDoubly true, if you are playing in a public venue and have vulnerable players, you need to stand up for them immediately. That player is probably already uncomfortable with the situation, and they're now probably additionally uncertain as to whether or not it's their place or yours as the DM to address it and will most likely tend towards inaction. Don't let that happen, or make it clear that the player is well within their rights to tell the creep to get lost if that's what they want.\n\nIt's typical gaming shop etiquette that bystanders are free to watch as long as they're not disrupting play. Where you draw that line of \"disrupting play\" is totally up to you.\n\nFor me, sitting down at the table, talking to anyone seated at the table, and talking over what's going on at the table are all things I consider disruptive. If someone does it once, I remind them that they're free to watch as long as they don't disrupt us. If they do it again, I politely ask them to leave us alone. If it happens again, I get up and find the manager of the store.\n\nIf that last step doesn't solve the problem for you, then you should find another venue.\n\nAnyone who balks at that is most likely part of the problem. Nobody likes interruptions to their games, and nobody likes seeing people at their table harassed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re the DM - it&amp;#39;s your table. If something is going on that you don&amp;#39;t like, then you need to speak up and handle it immediately regardless of whether it&amp;#39;s a player or a bystander creating the problem.&lt;/p&gt;\n\n&lt;p&gt;Doubly true, if you are playing in a public venue and have vulnerable players, you need to stand up for them immediately. That player is probably already uncomfortable with the situation, and they&amp;#39;re now probably additionally uncertain as to whether or not it&amp;#39;s their place or yours as the DM to address it and will most likely tend towards inaction. Don&amp;#39;t let that happen, or make it clear that the player is well within their rights to tell the creep to get lost if that&amp;#39;s what they want.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s typical gaming shop etiquette that bystanders are free to watch as long as they&amp;#39;re not disrupting play. Where you draw that line of &amp;quot;disrupting play&amp;quot; is totally up to you.&lt;/p&gt;\n\n&lt;p&gt;For me, sitting down at the table, talking to anyone seated at the table, and talking over what&amp;#39;s going on at the table are all things I consider disruptive. If someone does it once, I remind them that they&amp;#39;re free to watch as long as they don&amp;#39;t disrupt us. If they do it again, I politely ask them to leave us alone. If it happens again, I get up and find the manager of the store.&lt;/p&gt;\n\n&lt;p&gt;If that last step doesn&amp;#39;t solve the problem for you, then you should find another venue.&lt;/p&gt;\n\n&lt;p&gt;Anyone who balks at that is most likely part of the problem. Nobody likes interruptions to their games, and nobody likes seeing people at their table harassed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgczpte", "score_hidden": false, "stickied": false, "created": 1492425771.0, "created_utc": 1492396971.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcsupl", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "IceMutt", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "My spouse is somewhat surprised at the rate in which I've cited this to be an issue at many stores. If I'm not at my usual FLGS (mostly am there for weekly open boardgaming though I pick up much of my RPG stuff), I don't like to go into stores by myself. Spouse or friend have to be with me, someone I can talk to for the premise of being occupied/unavailable.  \nAt least during open boardgaming, people are generally happy to say hi, but if someone hangs around asking questions while not being part of the ongoing game for too long, the general ability for the table to start shunning the interloper and talking around/ignoring them seems to be instant. If it continues, someone, if not the whole table will try to disrupt. I have not seen it have to escalate past there publicly.  \nMy feeling is any game you are running or participating in, you are completely free to ask someone interrupting your game to stop without invitation to hang around. IMO, as DM, it's your game to run and also your place to enforce conduct, including those non-players. It's not always easy as the individual being bothered to shake off the problem person, having another person step in is hugely helpful, especially if it's more firm. I'm also someone all for leaving as a group at the end, especially if someone is being bothered. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My spouse is somewhat surprised at the rate in which I&amp;#39;ve cited this to be an issue at many stores. If I&amp;#39;m not at my usual FLGS (mostly am there for weekly open boardgaming though I pick up much of my RPG stuff), I don&amp;#39;t like to go into stores by myself. Spouse or friend have to be with me, someone I can talk to for the premise of being occupied/unavailable.&lt;br/&gt;\nAt least during open boardgaming, people are generally happy to say hi, but if someone hangs around asking questions while not being part of the ongoing game for too long, the general ability for the table to start shunning the interloper and talking around/ignoring them seems to be instant. If it continues, someone, if not the whole table will try to disrupt. I have not seen it have to escalate past there publicly.&lt;br/&gt;\nMy feeling is any game you are running or participating in, you are completely free to ask someone interrupting your game to stop without invitation to hang around. IMO, as DM, it&amp;#39;s your game to run and also your place to enforce conduct, including those non-players. It&amp;#39;s not always easy as the individual being bothered to shake off the problem person, having another person step in is hugely helpful, especially if it&amp;#39;s more firm. I&amp;#39;m also someone all for leaving as a group at the end, especially if someone is being bothered. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcsupl", "score_hidden": false, "stickied": false, "created": 1492416495.0, "created_utc": 1492387695.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcvcw6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "somekerfuffle", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I've encountered this problem as well and I totally understand your frustration. My gaming kit now includes a spray bottle. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve encountered this problem as well and I totally understand your frustration. My gaming kit now includes a spray bottle. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcvcw6", "score_hidden": false, "stickied": false, "created": 1492419857.0, "created_utc": 1492391057.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dge0528", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ehloanna", "parent_id": "t1_dgdp1rs", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Happens more to me in my PC gaming hobby than it does in TTRPG gaming.   \n\nOverall though it happens more in gaming related events than anything else I've ever experienced.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Happens more to me in my PC gaming hobby than it does in TTRPG gaming.   &lt;/p&gt;\n\n&lt;p&gt;Overall though it happens more in gaming related events than anything else I&amp;#39;ve ever experienced.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dge0528", "score_hidden": false, "stickied": false, "created": 1492487139.0, "created_utc": 1492458339.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdp1rs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "irongyrfalcon", "parent_id": "t1_dgcxh7h", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Is it more prevalent in gaming or is it everywhere?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is it more prevalent in gaming or is it everywhere?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdp1rs", "score_hidden": false, "stickied": false, "created": 1492474737.0, "created_utc": 1492445937.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcxh7h", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ehloanna", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Unfortunately as a woman in the hobby you have to deal with it all the time in various ways. Whether I'm playing or DMing it has happened. I've gotten to the point where I'm not afraid to call people on their bullshit so it isn't too bad.  \n\nSome people just don't understand what's socially acceptable and it makes me cringe so hard.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unfortunately as a woman in the hobby you have to deal with it all the time in various ways. Whether I&amp;#39;m playing or DMing it has happened. I&amp;#39;ve gotten to the point where I&amp;#39;m not afraid to call people on their bullshit so it isn&amp;#39;t too bad.  &lt;/p&gt;\n\n&lt;p&gt;Some people just don&amp;#39;t understand what&amp;#39;s socially acceptable and it makes me cringe so hard.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcxh7h", "score_hidden": false, "stickied": false, "created": 1492422634.0, "created_utc": 1492393834.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgd3j3x", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Warskull", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Some people are just jerks.  Don't try to passively aggressively attack the hobby as a whole.  There are jerks everywhere.\n\nSometimes you just got to say \"hey, we are trying to play a game here.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some people are just jerks.  Don&amp;#39;t try to passively aggressively attack the hobby as a whole.  There are jerks everywhere.&lt;/p&gt;\n\n&lt;p&gt;Sometimes you just got to say &amp;quot;hey, we are trying to play a game here.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd3j3x", "score_hidden": false, "stickied": false, "created": 1492431482.0, "created_utc": 1492402682.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgd67f2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "davefalkayn", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Repeat after me: \"Dude, I'm running a game here. You can wait until the game is done before you interrupt my players. You got it? Good.\"\n\nHonest truth; most of the time, these guys are too clueless to even realize they're being a pain. A sharp blast on the clue train whistle usually suffices. But if he doesn't stop, it's incumbent upon the store owner/manager to toss his horny ass out of the shop till he cools down. And if your store owner hasn't got the cojones to look out for his game masters, you need to find another venue. \n\nPractice this mantra a while out loud until you can do it reflexively. It needs to come out like a well practiced kata. By now, I can do it without breaking stride in my game. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Repeat after me: &amp;quot;Dude, I&amp;#39;m running a game here. You can wait until the game is done before you interrupt my players. You got it? Good.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Honest truth; most of the time, these guys are too clueless to even realize they&amp;#39;re being a pain. A sharp blast on the clue train whistle usually suffices. But if he doesn&amp;#39;t stop, it&amp;#39;s incumbent upon the store owner/manager to toss his horny ass out of the shop till he cools down. And if your store owner hasn&amp;#39;t got the cojones to look out for his game masters, you need to find another venue. &lt;/p&gt;\n\n&lt;p&gt;Practice this mantra a while out loud until you can do it reflexively. It needs to come out like a well practiced kata. By now, I can do it without breaking stride in my game. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd67f2", "score_hidden": false, "stickied": false, "created": 1492436559.0, "created_utc": 1492407759.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgclnjm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ImportantOpinions", "parent_id": "t1_dgcc4i3", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Yea a sign would discourage the good interactions and the bad would likely ignore the sign. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea a sign would discourage the good interactions and the bad would likely ignore the sign. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgclnjm", "score_hidden": false, "stickied": false, "created": 1492406758.0, "created_utc": 1492377958.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcc4i3", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Koalachan", "parent_id": "t1_dgcbnwo", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Most players and gamers are more than willing to let people walk up, sit down, even chat, as long as they don't distract too much from the overall game. DnD can be a little different from most games though due to the amount of engagement required. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most players and gamers are more than willing to let people walk up, sit down, even chat, as long as they don&amp;#39;t distract too much from the overall game. DnD can be a little different from most games though due to the amount of engagement required. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcc4i3", "score_hidden": false, "stickied": false, "created": 1492394237.0, "created_utc": 1492365437.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbnwo", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "WN-Nhairne", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Shouldnt the owner/employees of the shop be responsible for dealing with this stuff? Seems like 'dont bother other games in progress' should be printed on the wall. My two cents anyways.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Shouldnt the owner/employees of the shop be responsible for dealing with this stuff? Seems like &amp;#39;dont bother other games in progress&amp;#39; should be printed on the wall. My two cents anyways.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcbnwo", "score_hidden": false, "stickied": false, "created": 1492393636.0, "created_utc": 1492364836.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcij06", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "wisdumb", "parent_id": "t1_dgci7q5", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I play at a shop called Paladins Game Castle. Rooms are free and dedicated to DnD players at 530 on Tuesday and Wednesday night's at 530. \n\nThe store owner manager will go through and kick out card players if they refuse to leave when asked nicely by the players and dms.\n\nEdit: downvote says I should allow some rude cocksucker to waltz in and interrupt my game. Noted and will continue to not comply with allowing it to happen.", "edited": 1492375471.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I play at a shop called Paladins Game Castle. Rooms are free and dedicated to DnD players at 530 on Tuesday and Wednesday night&amp;#39;s at 530. &lt;/p&gt;\n\n&lt;p&gt;The store owner manager will go through and kick out card players if they refuse to leave when asked nicely by the players and dms.&lt;/p&gt;\n\n&lt;p&gt;Edit: downvote says I should allow some rude cocksucker to waltz in and interrupt my game. Noted and will continue to not comply with allowing it to happen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcij06", "score_hidden": false, "stickied": false, "created": 1492402693.0, "created_utc": 1492373893.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgci7q5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tshirt_Addict", "parent_id": "t1_dgcemq7", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "The FLGS has rooms?  Are they rented?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The FLGS has rooms?  Are they rented?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgci7q5", "score_hidden": false, "stickied": false, "created": 1492402297.0, "created_utc": 1492373497.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcemq7", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "wisdumb", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "This happened two weeks ago at the lgs I was playing at. Some random came I to the room we were playing and interrupted our game by talking to our DM. Am is a nice guy and didn't know how to handle the situation. I, the player, still in pc evil mode told the dude to get the fuck out.\n\nThe door gets locked every time we play now.\n\nEdit: lgs=local game store", "edited": 1492373920.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This happened two weeks ago at the lgs I was playing at. Some random came I to the room we were playing and interrupted our game by talking to our DM. Am is a nice guy and didn&amp;#39;t know how to handle the situation. I, the player, still in pc evil mode told the dude to get the fuck out.&lt;/p&gt;\n\n&lt;p&gt;The door gets locked every time we play now.&lt;/p&gt;\n\n&lt;p&gt;Edit: lgs=local game store&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcemq7", "score_hidden": false, "stickied": false, "created": 1492397608.0, "created_utc": 1492368808.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgda41j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ComeHellOrHighOtter", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "You should have said something, man. Don't just sit there like a spineless pussy while someone disrespect you, your players, and your game like that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should have said something, man. Don&amp;#39;t just sit there like a spineless pussy while someone disrespect you, your players, and your game like that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgda41j", "score_hidden": false, "stickied": false, "created": 1492446491.0, "created_utc": 1492417691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcobkg", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "allyspacey", "parent_id": "t1_dgcco9b", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "It's really sad that it's like this. My local shop stopped hosting in-store game nights because of issues with harassment to both patrons and staff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s really sad that it&amp;#39;s like this. My local shop stopped hosting in-store game nights because of issues with harassment to both patrons and staff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcobkg", "score_hidden": false, "stickied": false, "created": 1492410287.0, "created_utc": 1492381487.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcco9b", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "kokihi", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Yeah...I'm a woman, and even in my LGS which is incredibly welcoming to women there are plenty of thirsty creepy dudes who will try to ruin your fun by having some of their own. (Luckily for me, if any of the shop employees see you getting uncomfortable, or you tell them someone is upsetting you, they'll intervene. Even some of the super regular regulars will have our backs.) \n\nI play Warmachine and Magic at my LGS, and even with the welcoming atmosphere, I've had many games go sour because some dude I don't know wouldn't leave me alone. And I'm not even particularly attractive! \n\nSometimes it's hard to get decent guys to realize just how many desperate creepers there are. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah...I&amp;#39;m a woman, and even in my LGS which is incredibly welcoming to women there are plenty of thirsty creepy dudes who will try to ruin your fun by having some of their own. (Luckily for me, if any of the shop employees see you getting uncomfortable, or you tell them someone is upsetting you, they&amp;#39;ll intervene. Even some of the super regular regulars will have our backs.) &lt;/p&gt;\n\n&lt;p&gt;I play Warmachine and Magic at my LGS, and even with the welcoming atmosphere, I&amp;#39;ve had many games go sour because some dude I don&amp;#39;t know wouldn&amp;#39;t leave me alone. And I&amp;#39;m not even particularly attractive! &lt;/p&gt;\n\n&lt;p&gt;Sometimes it&amp;#39;s hard to get decent guys to realize just how many desperate creepers there are. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcco9b", "score_hidden": false, "stickied": false, "created": 1492394968.0, "created_utc": 1492366168.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgctzzl", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "mk572", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Sorry, but posting a rant on reddit isn't solving the issue. You should have stopped the session right there and politely told the guy to stop bugging her and leave.\n\nAs a DM, you don't just enforce the game rules, you also enforce the social rules. You were the one who didn't create a safe space.\n\nAt least what you can do now is apologize for the guy's behavior to your friend. Doesn't change anything in hindsight but I'm sure she'll appreciate to know that you noticed and that you care.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry, but posting a rant on reddit isn&amp;#39;t solving the issue. You should have stopped the session right there and politely told the guy to stop bugging her and leave.&lt;/p&gt;\n\n&lt;p&gt;As a DM, you don&amp;#39;t just enforce the game rules, you also enforce the social rules. You were the one who didn&amp;#39;t create a safe space.&lt;/p&gt;\n\n&lt;p&gt;At least what you can do now is apologize for the guy&amp;#39;s behavior to your friend. Doesn&amp;#39;t change anything in hindsight but I&amp;#39;m sure she&amp;#39;ll appreciate to know that you noticed and that you care.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgctzzl", "score_hidden": false, "stickied": false, "created": 1492418043.0, "created_utc": 1492389243.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcz6qd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Yeti_Poet", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "So you talked to him twice and he left. It seems like the situation was resolved pretty reasonably.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you talked to him twice and he left. It seems like the situation was resolved pretty reasonably.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcz6qd", "score_hidden": false, "stickied": false, "created": 1492425024.0, "created_utc": 1492396224.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgedesq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "r4ph442", "parent_id": "t1_dgcv4vb", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I have a friend that does the counter-creep method... it's kind of funny sometimes, but usually it's too much. He does it at card game tournaments usually, which is probably a pretty similar situation when there's not so many women. I'm not so down with using homophobia to scare off creepers (and it won't work so much at a D&amp;D table), but sometimes it's nice to have an enforcer like that around. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a friend that does the counter-creep method... it&amp;#39;s kind of funny sometimes, but usually it&amp;#39;s too much. He does it at card game tournaments usually, which is probably a pretty similar situation when there&amp;#39;s not so many women. I&amp;#39;m not so down with using homophobia to scare off creepers (and it won&amp;#39;t work so much at a D&amp;amp;D table), but sometimes it&amp;#39;s nice to have an enforcer like that around. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgedesq", "score_hidden": false, "stickied": false, "created": 1492503364.0, "created_utc": 1492474564.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcv4vb", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "AlphaBreak", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Since all of the good suggestions are taken, I suppose it's up to me to make the bad ones.  \n\n1) Counter-creep. When guy rolls up to table acting like that, immediately engage him directly in a conversation, 1 on 1. Saddle your chair right up to him, touch him on the arm as you talk, and stare into his eyes with complete focus, as you tell him he smells nice. If he says anything about how uncomfortable he is, then tell him \"I'LL STOP IF YOU STOP, YOU WEIRDO!\"  \n\n2) Start maniacally cackling as soon as he talks and announce to the table that the gods have sensed that PCs indifference and unless their focus is brought back to the fore, then a divine smiting shall be upon them. If he keeps trying to talk to her, announce that her doom has been spelt in the heavens unless she renounces her wicked attention wandering ways.  \n\n3) An actual god materializes in the campaign starts hitting on her PC before a goddess appears alongside him, shouts \"KNOCK IT OFF YOU CREEP!\" and slaps him into unconsciousness. She turns to the PC and says \"Sorry about that. Have a great day. Know what? Here have some temp HP for the trouble\" before dragging the unconcious god away. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since all of the good suggestions are taken, I suppose it&amp;#39;s up to me to make the bad ones.  &lt;/p&gt;\n\n&lt;p&gt;1) Counter-creep. When guy rolls up to table acting like that, immediately engage him directly in a conversation, 1 on 1. Saddle your chair right up to him, touch him on the arm as you talk, and stare into his eyes with complete focus, as you tell him he smells nice. If he says anything about how uncomfortable he is, then tell him &amp;quot;I&amp;#39;LL STOP IF YOU STOP, YOU WEIRDO!&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;2) Start maniacally cackling as soon as he talks and announce to the table that the gods have sensed that PCs indifference and unless their focus is brought back to the fore, then a divine smiting shall be upon them. If he keeps trying to talk to her, announce that her doom has been spelt in the heavens unless she renounces her wicked attention wandering ways.  &lt;/p&gt;\n\n&lt;p&gt;3) An actual god materializes in the campaign starts hitting on her PC before a goddess appears alongside him, shouts &amp;quot;KNOCK IT OFF YOU CREEP!&amp;quot; and slaps him into unconsciousness. She turns to the PC and says &amp;quot;Sorry about that. Have a great day. Know what? Here have some temp HP for the trouble&amp;quot; before dragging the unconcious god away. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcv4vb", "score_hidden": false, "stickied": false, "created": 1492419566.0, "created_utc": 1492390766.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcpb2g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "KazeinHD", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I recall being in the middle of a game, well immersed and in a rather emotional storyarc, when a group of turbonerds flooded into the room we were playing in and told us a riveting tale of how the group killed each other in PVP and one player got so into character that he refused to warn his sleeping teammates of a group of jackalweres in the middle of tearing him apart. *Thrilling.*\n\nI got pretty mad, and it's the first time I've seen that specific DM on the verge of actual murder. /u/JamecanBecan", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I recall being in the middle of a game, well immersed and in a rather emotional storyarc, when a group of turbonerds flooded into the room we were playing in and told us a riveting tale of how the group killed each other in PVP and one player got so into character that he refused to warn his sleeping teammates of a group of jackalweres in the middle of tearing him apart. &lt;em&gt;Thrilling.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I got pretty mad, and it&amp;#39;s the first time I&amp;#39;ve seen that specific DM on the verge of actual murder. &lt;a href=\"/u/JamecanBecan\"&gt;/u/JamecanBecan&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcpb2g", "score_hidden": false, "stickied": false, "created": 1492411658.0, "created_utc": 1492382858.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgczqd6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TempestK", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Probably should have told him to step off immediately given his behavior, but I'm just armchair quarterbacking here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Probably should have told him to step off immediately given his behavior, but I&amp;#39;m just armchair quarterbacking here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgczqd6", "score_hidden": false, "stickied": false, "created": 1492425792.0, "created_utc": 1492396992.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdqifd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Abaltacht", "parent_id": "t1_dgdk2hj", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "This is the most objective, impartial, and logical response in the thread. I hope people pay attention to it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the most objective, impartial, and logical response in the thread. I hope people pay attention to it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdqifd", "score_hidden": false, "stickied": false, "created": 1492476360.0, "created_utc": 1492447560.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdk2hj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheItinerantSkeptic", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "On the one hand, the proper response to this guy would have been, \"Hey, man, we're still playing. If you wanna hang out &amp; watch, that's cool, but please don't be a distraction.\"\n\nOn the other hand, people sometimes just suck at reading signals. It's one of the greatest handicaps in dating, and gamers dating, as much as I wish otherwise, can often be comically inept if they're younger (as in, before their mid to late 20s, sadly). The guy should have probably privately been complimented on being brave enough to engage with her instead of sitting across the room giving her the creepy hairy eyeball (which far too many socially uncomfortable people are prone to doing).\n\nShe has some responsibility to speak up for herself, as she's the only one who can affirmatively delineate how she's feeling about someone's overtures (even if she later confirms to you privately that she was, in fact, feeling exactly how you assumed she was). If you're adults (I'm assuming everyone in your group is over 18?), she has the ability to tell someone she isn't interested. If the person persists at that point, THEN you or others at the table step in and help her out. But trust her agency in this: she can speak for herself.\n\nI don't think this has much to do with why \"women so often get excluded from this community\". Yes, there are women who don't engage in RPGs because it isn't their thing, or because they perceive the people in the hobby to be creepy or otherwise undesirable, and just like any community, those types of people DO exist in gaming. But women aren't being \"excluded\" because people might try to engage with them as a result of finding them attractive.\n\nI'm feeling like there's a bit of white-knighting going on here, at least from the words you've used. It doesn't mean this guy wasn't being rude (he was; if it was at a gaming store and I were in his position, I'd have observed the group, and if I noted it looked like things were winding up, I'd just go browsing a bit until people were starting to leave, then go talk with the woman after it was obvious she was finished for the night, and on her way out; I'd have probably done it right outside the store, as many gaming stores have narrow thoroughfares that can leave someone feeling trapped if they're engaged and don't want to be), but I think you may be overreacting a bit to this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;On the one hand, the proper response to this guy would have been, &amp;quot;Hey, man, we&amp;#39;re still playing. If you wanna hang out &amp;amp; watch, that&amp;#39;s cool, but please don&amp;#39;t be a distraction.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;On the other hand, people sometimes just suck at reading signals. It&amp;#39;s one of the greatest handicaps in dating, and gamers dating, as much as I wish otherwise, can often be comically inept if they&amp;#39;re younger (as in, before their mid to late 20s, sadly). The guy should have probably privately been complimented on being brave enough to engage with her instead of sitting across the room giving her the creepy hairy eyeball (which far too many socially uncomfortable people are prone to doing).&lt;/p&gt;\n\n&lt;p&gt;She has some responsibility to speak up for herself, as she&amp;#39;s the only one who can affirmatively delineate how she&amp;#39;s feeling about someone&amp;#39;s overtures (even if she later confirms to you privately that she was, in fact, feeling exactly how you assumed she was). If you&amp;#39;re adults (I&amp;#39;m assuming everyone in your group is over 18?), she has the ability to tell someone she isn&amp;#39;t interested. If the person persists at that point, THEN you or others at the table step in and help her out. But trust her agency in this: she can speak for herself.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think this has much to do with why &amp;quot;women so often get excluded from this community&amp;quot;. Yes, there are women who don&amp;#39;t engage in RPGs because it isn&amp;#39;t their thing, or because they perceive the people in the hobby to be creepy or otherwise undesirable, and just like any community, those types of people DO exist in gaming. But women aren&amp;#39;t being &amp;quot;excluded&amp;quot; because people might try to engage with them as a result of finding them attractive.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m feeling like there&amp;#39;s a bit of white-knighting going on here, at least from the words you&amp;#39;ve used. It doesn&amp;#39;t mean this guy wasn&amp;#39;t being rude (he was; if it was at a gaming store and I were in his position, I&amp;#39;d have observed the group, and if I noted it looked like things were winding up, I&amp;#39;d just go browsing a bit until people were starting to leave, then go talk with the woman after it was obvious she was finished for the night, and on her way out; I&amp;#39;d have probably done it right outside the store, as many gaming stores have narrow thoroughfares that can leave someone feeling trapped if they&amp;#39;re engaged and don&amp;#39;t want to be), but I think you may be overreacting a bit to this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdk2hj", "score_hidden": false, "stickied": false, "created": 1492468824.0, "created_utc": 1492440024.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdkg9g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Kylden_Ar", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I am a guy DM, and this is why I stopped running at public shops. I usually have 1-3 female players depending on the game (usually one player's younger sister, an occasional spouse, and an identifies as female transitioning) and I'm not making them put up with this shit. \n\nIn the day of social media, Amazon, and DriveThru RPG, I think it's time the so called \"Friendly\" local game store dies. It's an outdated model held up by a lot of Gatekeepers to help maintain their \"hold\" on the hobby. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am a guy DM, and this is why I stopped running at public shops. I usually have 1-3 female players depending on the game (usually one player&amp;#39;s younger sister, an occasional spouse, and an identifies as female transitioning) and I&amp;#39;m not making them put up with this shit. &lt;/p&gt;\n\n&lt;p&gt;In the day of social media, Amazon, and DriveThru RPG, I think it&amp;#39;s time the so called &amp;quot;Friendly&amp;quot; local game store dies. It&amp;#39;s an outdated model held up by a lot of Gatekeepers to help maintain their &amp;quot;hold&amp;quot; on the hobby. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdkg9g", "score_hidden": false, "stickied": false, "created": 1492469318.0, "created_utc": 1492440518.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdlb37", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jyrox", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I would have directly engaged the individual in a manner such as:\n\n\"Hi! Would you like to play? No? Alright, if you could remove yourself from the table and stop distracting our friend who is new to the game, I'd greatly appreciate it!\"\n\nIf they persist, you get store management involved. It may not be in the \"spirit\" of the shop, but everyone is entitled to feel **comfortable** when playing tabletop games with friends.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would have directly engaged the individual in a manner such as:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hi! Would you like to play? No? Alright, if you could remove yourself from the table and stop distracting our friend who is new to the game, I&amp;#39;d greatly appreciate it!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;If they persist, you get store management involved. It may not be in the &amp;quot;spirit&amp;quot; of the shop, but everyone is entitled to feel &lt;strong&gt;comfortable&lt;/strong&gt; when playing tabletop games with friends.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdlb37", "score_hidden": false, "stickied": false, "created": 1492470391.0, "created_utc": 1492441591.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcf96u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BeJesusChris", "parent_id": "t1_dgce22g", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I recently tried D&amp;D at a local game store as well, DM was great but there was a table right next to us playing warhammer. He got completely overpowered by the noise and it broke the immersion completely. Was the only negative from the day tho.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I recently tried D&amp;amp;D at a local game store as well, DM was great but there was a table right next to us playing warhammer. He got completely overpowered by the noise and it broke the immersion completely. Was the only negative from the day tho.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcf96u", "score_hidden": false, "stickied": false, "created": 1492398435.0, "created_utc": 1492369635.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgce22g", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "G44o", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I play at a card shop also, and my DM was telling in amazing detail the gruesome actions of the combat, meanwhile 3 of the members were talking so loudly the DM couldn't even hear himself.\n\nThen, they asked what's going on!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I play at a card shop also, and my DM was telling in amazing detail the gruesome actions of the combat, meanwhile 3 of the members were talking so loudly the DM couldn&amp;#39;t even hear himself.&lt;/p&gt;\n\n&lt;p&gt;Then, they asked what&amp;#39;s going on!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgce22g", "score_hidden": false, "stickied": false, "created": 1492396831.0, "created_utc": 1492368031.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcpo1l", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "StarryNotions", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "It's never blatantly obvious enough, cousin. Not really. Being indignant it happened isn't enough, you know? You've got to step in.\n\n\"HEY! Quit chatting up my players while we are playing! You're making her uncomfortable, leave.\" And then when he tries to defend himself by asking her if she's uncomfortable, \"doesn't matter, knock it off, leave.\"\n\nBecause everyone sees women in these corners squirming and everyone says \"gosh, that sucks, I'm so sorry\" but no one tries to stop it. :-(\n\nEdit: this is, of course, predicated on the perp attempting to socially woo the lady, which speaks to 'no social issues', and your ability to do so. I don't want to pile on, and I see I kinda have. But I do want a standalone \"please don't leave people like this and then say 'that's rough' after\". Some people need to see that this is an option.", "edited": 1492384505.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s never blatantly obvious enough, cousin. Not really. Being indignant it happened isn&amp;#39;t enough, you know? You&amp;#39;ve got to step in.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;HEY! Quit chatting up my players while we are playing! You&amp;#39;re making her uncomfortable, leave.&amp;quot; And then when he tries to defend himself by asking her if she&amp;#39;s uncomfortable, &amp;quot;doesn&amp;#39;t matter, knock it off, leave.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Because everyone sees women in these corners squirming and everyone says &amp;quot;gosh, that sucks, I&amp;#39;m so sorry&amp;quot; but no one tries to stop it. :-(&lt;/p&gt;\n\n&lt;p&gt;Edit: this is, of course, predicated on the perp attempting to socially woo the lady, which speaks to &amp;#39;no social issues&amp;#39;, and your ability to do so. I don&amp;#39;t want to pile on, and I see I kinda have. But I do want a standalone &amp;quot;please don&amp;#39;t leave people like this and then say &amp;#39;that&amp;#39;s rough&amp;#39; after&amp;quot;. Some people need to see that this is an option.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcpo1l", "score_hidden": false, "stickied": false, "created": 1492412143.0, "created_utc": 1492383343.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcnp20", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Frymewitheggs", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I don't see anywhere, where you stepped in and said for him to clear off. You don't give a warning to someone, you give them an option. Watch in silence or leave. I'm that simple.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t see anywhere, where you stepped in and said for him to clear off. You don&amp;#39;t give a warning to someone, you give them an option. Watch in silence or leave. I&amp;#39;m that simple.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcnp20", "score_hidden": false, "stickied": false, "created": 1492409442.0, "created_utc": 1492380642.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcpp7x", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "StarryNotions", "parent_id": "t1_dgchuua", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Please do. I guarantee once you take a stand, a whole bunch of uncomfortable people have got your back. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please do. I guarantee once you take a stand, a whole bunch of uncomfortable people have got your back. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcpp7x", "score_hidden": false, "stickied": false, "created": 1492412187.0, "created_utc": 1492383387.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchuua", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "HimuShin", "parent_id": "t1_dgcffjv", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Shoulda, coulda, woulda.  Will next time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Shoulda, coulda, woulda.  Will next time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgchuua", "score_hidden": false, "stickied": false, "created": 1492401838.0, "created_utc": 1492373038.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcffjv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DeerLicksBadger", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "You could've fixed this in two seconds by telling him to get the fuck up and walk away. Always gonna be dudes like that in game shops.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could&amp;#39;ve fixed this in two seconds by telling him to get the fuck up and walk away. Always gonna be dudes like that in game shops.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcffjv", "score_hidden": false, "stickied": false, "created": 1492398665.0, "created_utc": 1492369865.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcebit", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EPICDRO1D", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "We go to this gamestore every Friday to play with my group and we have this person called The Seeker who is aptly named after his ability to seek out anyone that seems to be having fun and intercept that", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We go to this gamestore every Friday to play with my group and we have this person called The Seeker who is aptly named after his ability to seek out anyone that seems to be having fun and intercept that&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcebit", "score_hidden": false, "stickied": false, "created": 1492397179.0, "created_utc": 1492368379.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcq6tq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "StarryNotions", "parent_id": "t1_dgcfl7s", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Yes and no. Therapy covers some hints, but there are indeed some issues that make you blind to stuff.\n\nWe generally solve this by assuming a neurotypical person and allowing for exception should circumstances actually require one. But yeah.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes and no. Therapy covers some hints, but there are indeed some issues that make you blind to stuff.&lt;/p&gt;\n\n&lt;p&gt;We generally solve this by assuming a neurotypical person and allowing for exception should circumstances actually require one. But yeah.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcq6tq", "score_hidden": false, "stickied": false, "created": 1492412869.0, "created_utc": 1492384069.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcfl7s", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sailorgirlm", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "No I won't excuse someone's behavior. I will tell someone they need to stop lashing out at someone because of their own issues whatever they may be. I've learned from personal experience and therapy that just because I'm feeling shitty doesn't make it right for me to act out. That doesn't solve anything and is just using your diagnosis as an excuse. You learn to deal with it and handle it because you are just going to feel worse once you realized you made someone feel like shit cause you do and that's not right. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No I won&amp;#39;t excuse someone&amp;#39;s behavior. I will tell someone they need to stop lashing out at someone because of their own issues whatever they may be. I&amp;#39;ve learned from personal experience and therapy that just because I&amp;#39;m feeling shitty doesn&amp;#39;t make it right for me to act out. That doesn&amp;#39;t solve anything and is just using your diagnosis as an excuse. You learn to deal with it and handle it because you are just going to feel worse once you realized you made someone feel like shit cause you do and that&amp;#39;s not right. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcfl7s", "score_hidden": false, "stickied": false, "created": 1492398875.0, "created_utc": 1492370075.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcn69c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "owensphere50", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I'll admit that distractions are very annoying in a game setting but that guy obviously has a social disability and that player of yours wasn't interested in your game so either have the game at your house or place that isn't as public, or when that does happen tell him to stop and if he doesn't just make sure he knows that you are doing something and that girl can talk to him later. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll admit that distractions are very annoying in a game setting but that guy obviously has a social disability and that player of yours wasn&amp;#39;t interested in your game so either have the game at your house or place that isn&amp;#39;t as public, or when that does happen tell him to stop and if he doesn&amp;#39;t just make sure he knows that you are doing something and that girl can talk to him later. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcn69c", "score_hidden": false, "stickied": false, "created": 1492408773.0, "created_utc": 1492379973.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgctz7s", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Garvidal", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I would have blown up and gone all Joe Pesci on his ass.  \n\nEXCUSE ME, Im trying to run a Fucking game.  Did I invite you into my game.  Your distracting my FUCKIN Players.  Do I come over in interrupt your fuckin game.  NO... I... DID.... NOT.  I put time and effort into running a game for my players and your interrupting ME!!!!! During my FUCKING GAME.  Who the fuck are you, who the fuck to you think you are!  Please kindly, with sugar on top, Fuck OFF.\n\nThis may be a little bit extreme but its not far from the truth.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would have blown up and gone all Joe Pesci on his ass.  &lt;/p&gt;\n\n&lt;p&gt;EXCUSE ME, Im trying to run a Fucking game.  Did I invite you into my game.  Your distracting my FUCKIN Players.  Do I come over in interrupt your fuckin game.  NO... I... DID.... NOT.  I put time and effort into running a game for my players and your interrupting ME!!!!! During my FUCKING GAME.  Who the fuck are you, who the fuck to you think you are!  Please kindly, with sugar on top, Fuck OFF.&lt;/p&gt;\n\n&lt;p&gt;This may be a little bit extreme but its not far from the truth.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgctz7s", "score_hidden": false, "stickied": false, "created": 1492418015.0, "created_utc": 1492389215.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgchdy2", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "forgotmypasswordzzz", "parent_id": "t1_dgcdqz9", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "People might walk up and talk to you if you're just idly watching something from the sidelines, but personally speaking I'd never approach someone sitting down at a table currently doing something to strike up a conversation.  If theres someone standing behind someone else sitting at the table I might talk to them discretely and if they take longer than a few seconds to respond realize that they're paying attention here and conversation isn't wanted.\n\nThats just me though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People might walk up and talk to you if you&amp;#39;re just idly watching something from the sidelines, but personally speaking I&amp;#39;d never approach someone sitting down at a table currently doing something to strike up a conversation.  If theres someone standing behind someone else sitting at the table I might talk to them discretely and if they take longer than a few seconds to respond realize that they&amp;#39;re paying attention here and conversation isn&amp;#39;t wanted.&lt;/p&gt;\n\n&lt;p&gt;Thats just me though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgchdy2", "score_hidden": false, "stickied": false, "created": 1492401231.0, "created_utc": 1492372431.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdqz9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "AccountNumber22", "parent_id": "t1_dgccd77", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "You're in a hobby store, people are going to walk up to you and talk to you. I wouldn't call it an \"urban solitude\" place at all. I also wouldn't walk up to a group playing an RPG either. Any other game and I might ask questions or start a tiny conversation about the game. But I also mainly play on board game days at stores and used to play Magic.\n\nAnd OP's disinterested friend was already disinterested, and probably still will be. The game is not everyone's cup of tea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re in a hobby store, people are going to walk up to you and talk to you. I wouldn&amp;#39;t call it an &amp;quot;urban solitude&amp;quot; place at all. I also wouldn&amp;#39;t walk up to a group playing an RPG either. Any other game and I might ask questions or start a tiny conversation about the game. But I also mainly play on board game days at stores and used to play Magic.&lt;/p&gt;\n\n&lt;p&gt;And OP&amp;#39;s disinterested friend was already disinterested, and probably still will be. The game is not everyone&amp;#39;s cup of tea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcdqz9", "score_hidden": false, "stickied": false, "created": 1492396411.0, "created_utc": 1492367611.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcer2g", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Sailorgirlm", "parent_id": "t1_dgccfc4", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "You need to stop diagnosing people. That's all you've been posting about in this thread. That is the therapist's/doctor's/psychologist's/psychiatrist's job.  Just because you or a love one has an invisible disorder doesn't mean you are qualified to say that this person has issues and must be blank. I've suffered from depression most of my life and my issues don't qualify me to make those assumptions. He's upset and just expressing it; you don't know him and if he is more angry than normal.", "edited": 1492369222.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to stop diagnosing people. That&amp;#39;s all you&amp;#39;ve been posting about in this thread. That is the therapist&amp;#39;s/doctor&amp;#39;s/psychologist&amp;#39;s/psychiatrist&amp;#39;s job.  Just because you or a love one has an invisible disorder doesn&amp;#39;t mean you are qualified to say that this person has issues and must be blank. I&amp;#39;ve suffered from depression most of my life and my issues don&amp;#39;t qualify me to make those assumptions. He&amp;#39;s upset and just expressing it; you don&amp;#39;t know him and if he is more angry than normal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcer2g", "score_hidden": false, "stickied": false, "created": 1492397767.0, "created_utc": 1492368967.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dgccfc4", "gilded": 0, "archived": false, "score": -13, "report_reasons": null, "author": "mcbobboreddit", "parent_id": "t1_dgccd77", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Totally true. But IF THE CAPS ARE ANY INDICATION, he is more than normally upset about it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Totally true. But IF THE CAPS ARE ANY INDICATION, he is more than normally upset about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgccfc4", "score_hidden": false, "stickied": false, "created": 1492394635.0, "created_utc": 1492365835.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -13}}], "after": null, "before": null}}, "user_reports": [], "id": "dgccd77", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "tasseographer", "parent_id": "t1_dgcar6k", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Re: 4: You don't have to have social anxiety to be upset when the code of urban solitude is broken.  Walking up to strangers and interrupting them is rude and alarming even if they're in a public setting, even if they're not clearly trying to focus on another activity.\n\nIgnoring a group of strangers (and their requests to stop disrupting the activity you're crashing) to single out their friend is transparently predatory in a way that makes people feel not just uncomfortable and disrespected but UNSAFE.  Any normal person would get worked up about this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Re: 4: You don&amp;#39;t have to have social anxiety to be upset when the code of urban solitude is broken.  Walking up to strangers and interrupting them is rude and alarming even if they&amp;#39;re in a public setting, even if they&amp;#39;re not clearly trying to focus on another activity.&lt;/p&gt;\n\n&lt;p&gt;Ignoring a group of strangers (and their requests to stop disrupting the activity you&amp;#39;re crashing) to single out their friend is transparently predatory in a way that makes people feel not just uncomfortable and disrespected but UNSAFE.  Any normal person would get worked up about this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgccd77", "score_hidden": false, "stickied": false, "created": 1492394557.0, "created_utc": 1492365757.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgchzyc", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "mcbobboreddit", "parent_id": "t1_dgchnei", "subreddit_name_prefixed": "r/DnD", "controversiality": 1, "body": "&gt; Am I not supposed to bring new players to a public place? What if they're Internet strangers? Am I to invite them into my home?\n\nLibrary, probably.  Any place with low levels of distraction.\n\n&gt; If a student in a classroom looks uninterested, I would not go and try to talk to them. That would be rude to the teacher.\n\nTrue, but that's a very, very different setting.  The teacher is paid to be there, certified, etc, and enjoys a clear position of authority.  You have limited authority over the conduct of your own game (and that gets more limited by the day, it seems, based on gaming trends), but none whatsoever over the game shop as a whole.  Again, that library room you reserved would also be a different story.\n\n&gt;  So, there.\n\nSorry if I came off as hostile.\n\n&gt; You realize what you're doing wrong and you try to get better. That's what I do.\n\nImagine for a minute what it must be like for those who don't realize it and won't get better no matter how much they try.  The best they can attain is faking it well.  Wouldn't that just completely suck?  It horrifies me.  I'm like you, I really recoil when I see I've done something awkward and will try to build processes around it.  If someone makes a negative comment about a piece of clothing I own, for example, I'll up and throw it away.  \"Not making that mistake again.\"  But I've seen with my own eyes people, and not just my son, who were born different and will never have even that level of self awareness.  They're not exclusively autistic, either, there are kids in his class with completely different diagnoses who will likely wind up at a game store one of these days.  I pray that people treat them well, and give them the benefit of the doubt.\n\n&gt; You're right that we should have a modicum of sympathy for the awkward game store kid.\n\nBless you, sir.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Am I not supposed to bring new players to a public place? What if they&amp;#39;re Internet strangers? Am I to invite them into my home?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Library, probably.  Any place with low levels of distraction.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If a student in a classroom looks uninterested, I would not go and try to talk to them. That would be rude to the teacher.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;True, but that&amp;#39;s a very, very different setting.  The teacher is paid to be there, certified, etc, and enjoys a clear position of authority.  You have limited authority over the conduct of your own game (and that gets more limited by the day, it seems, based on gaming trends), but none whatsoever over the game shop as a whole.  Again, that library room you reserved would also be a different story.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So, there.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sorry if I came off as hostile.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You realize what you&amp;#39;re doing wrong and you try to get better. That&amp;#39;s what I do.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Imagine for a minute what it must be like for those who don&amp;#39;t realize it and won&amp;#39;t get better no matter how much they try.  The best they can attain is faking it well.  Wouldn&amp;#39;t that just completely suck?  It horrifies me.  I&amp;#39;m like you, I really recoil when I see I&amp;#39;ve done something awkward and will try to build processes around it.  If someone makes a negative comment about a piece of clothing I own, for example, I&amp;#39;ll up and throw it away.  &amp;quot;Not making that mistake again.&amp;quot;  But I&amp;#39;ve seen with my own eyes people, and not just my son, who were born different and will never have even that level of self awareness.  They&amp;#39;re not exclusively autistic, either, there are kids in his class with completely different diagnoses who will likely wind up at a game store one of these days.  I pray that people treat them well, and give them the benefit of the doubt.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You&amp;#39;re right that we should have a modicum of sympathy for the awkward game store kid.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Bless you, sir.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgchzyc", "score_hidden": false, "stickied": false, "created": 1492402020.0, "created_utc": 1492373220.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchnei", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "HimuShin", "parent_id": "t1_dgcar6k", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "OP, here.  I've read through a lot of your activity in this thread, and I don't agree with many of your points.  I can tell you that you're spot-on about my social anxiety issues.  But I'll address your points in turn before we get to that.\n\n1.  You're demonstrating a clear lack of understanding of the situation.  But that's not on you.  You weren't there.  How could you know that I had no other place to do this that didn't require a table fee?  Am I not supposed to bring new players to a public place?  What if they're Internet strangers?  Am I to invite them into my home?  That seems unsafe.  And aren't game shops places where people can come and learn about games?  If new players should never play their first games in a game shop, then you just shut down a lot of people's opportunities to get into a hobby they might enjoy.\n\n2. Yes.  My player was giving off disengaged signals.  I know that.  And I was trying to reengage her before our interruption.  That's part of the DM learning curve -- learning how to get players into the game.  And that places it wholly in my jurisdiction.  Whether that player is having fun is between myself and the player in question.  Not random people of the street.  If a student in a classroom looks uninterested, I would not go and try to talk to them.  That would be rude to the teacher.\n\n3. We did take breaks...  Couple of bathroom and snack breaks.  So, there.\n\n**4.**\n\nAnd here we are at number four.  You've spoken a lot about social disorders in this thread.  You've made a few valid points...  People don't choose to be this way or that.  And it's rough.  I know.  I suffer from severe depression and anxiety.  I can't speak to what it's like to be on the spectrum, but it would appear that there are other people to that end.\n\nWhat I do know about is being an awkward dude.  It sucks.  Especially when you realize what you are.  But that's the key.  You realize what you're doing wrong and you try to get better.  That's what I do.  I push myself every day to beat my issues.  I deal with panic attacks and lethargy and existential dread, but I fucking push through to the next day and try to get better.\n\nIf people just said \"it's okay\" or \"you don't have to change,\" then do you know what I'd be?  I'd be dead.  'Cause you don't get anywhere by standing still.  And you know what?  It sucks to feel like you've done something wrong.  It sucks to be thrust into the outgroup.  But that's how you learn what's acceptable and what's not.  You take that, and you get better.  It hurts and it's scary and it's lonely, but it's a part of the grand social dance that we all do with each other to make society work.\n\nThat said, some of the rhetoric in this thread has gotten a little too harsh against the perpetrator.  You're right that we should have a modicum of sympathy for the awkward game store kid.  I didn't really do him any favors, and perhaps that was wrong of me.  But you are not elevating the level of discourse by throwing around wild assumptions and throwing social norms to the wind.  And just because we should have sympathy doesn't mean that we shouldn't express distaste for these kinds of intrusions.  That's how you set norms that people can learn to follow.  It's part of the improvement process.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP, here.  I&amp;#39;ve read through a lot of your activity in this thread, and I don&amp;#39;t agree with many of your points.  I can tell you that you&amp;#39;re spot-on about my social anxiety issues.  But I&amp;#39;ll address your points in turn before we get to that.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;You&amp;#39;re demonstrating a clear lack of understanding of the situation.  But that&amp;#39;s not on you.  You weren&amp;#39;t there.  How could you know that I had no other place to do this that didn&amp;#39;t require a table fee?  Am I not supposed to bring new players to a public place?  What if they&amp;#39;re Internet strangers?  Am I to invite them into my home?  That seems unsafe.  And aren&amp;#39;t game shops places where people can come and learn about games?  If new players should never play their first games in a game shop, then you just shut down a lot of people&amp;#39;s opportunities to get into a hobby they might enjoy.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Yes.  My player was giving off disengaged signals.  I know that.  And I was trying to reengage her before our interruption.  That&amp;#39;s part of the DM learning curve -- learning how to get players into the game.  And that places it wholly in my jurisdiction.  Whether that player is having fun is between myself and the player in question.  Not random people of the street.  If a student in a classroom looks uninterested, I would not go and try to talk to them.  That would be rude to the teacher.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;We did take breaks...  Couple of bathroom and snack breaks.  So, there.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&lt;strong&gt;4.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;And here we are at number four.  You&amp;#39;ve spoken a lot about social disorders in this thread.  You&amp;#39;ve made a few valid points...  People don&amp;#39;t choose to be this way or that.  And it&amp;#39;s rough.  I know.  I suffer from severe depression and anxiety.  I can&amp;#39;t speak to what it&amp;#39;s like to be on the spectrum, but it would appear that there are other people to that end.&lt;/p&gt;\n\n&lt;p&gt;What I do know about is being an awkward dude.  It sucks.  Especially when you realize what you are.  But that&amp;#39;s the key.  You realize what you&amp;#39;re doing wrong and you try to get better.  That&amp;#39;s what I do.  I push myself every day to beat my issues.  I deal with panic attacks and lethargy and existential dread, but I fucking push through to the next day and try to get better.&lt;/p&gt;\n\n&lt;p&gt;If people just said &amp;quot;it&amp;#39;s okay&amp;quot; or &amp;quot;you don&amp;#39;t have to change,&amp;quot; then do you know what I&amp;#39;d be?  I&amp;#39;d be dead.  &amp;#39;Cause you don&amp;#39;t get anywhere by standing still.  And you know what?  It sucks to feel like you&amp;#39;ve done something wrong.  It sucks to be thrust into the outgroup.  But that&amp;#39;s how you learn what&amp;#39;s acceptable and what&amp;#39;s not.  You take that, and you get better.  It hurts and it&amp;#39;s scary and it&amp;#39;s lonely, but it&amp;#39;s a part of the grand social dance that we all do with each other to make society work.&lt;/p&gt;\n\n&lt;p&gt;That said, some of the rhetoric in this thread has gotten a little too harsh against the perpetrator.  You&amp;#39;re right that we should have a modicum of sympathy for the awkward game store kid.  I didn&amp;#39;t really do him any favors, and perhaps that was wrong of me.  But you are not elevating the level of discourse by throwing around wild assumptions and throwing social norms to the wind.  And just because we should have sympathy doesn&amp;#39;t mean that we shouldn&amp;#39;t express distaste for these kinds of intrusions.  That&amp;#39;s how you set norms that people can learn to follow.  It&amp;#39;s part of the improvement process.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgchnei", "score_hidden": false, "stickied": false, "created": 1492401570.0, "created_utc": 1492372770.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcovwq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Jmed97", "parent_id": "t1_dgcmplo", "subreddit_name_prefixed": "r/DnD", "controversiality": 1, "body": "People like you are the reason I wish I could upvote comments more than once. Bravo my friend", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People like you are the reason I wish I could upvote comments more than once. Bravo my friend&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcovwq", "score_hidden": false, "stickied": false, "created": 1492411068.0, "created_utc": 1492382268.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcmplo", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "tildespamzor", "parent_id": "t1_dgcar6k", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "&gt; Your text reads to me as someone who has some unresolved social anxiety issues, ESPECIALLY THE PARTS IN ALL CAPS. If your text indicates how you feel about the situation, this reasonably normal situation has you pretty worked up. It might mean that you'd be more comfortable without trying to wedge your game into a social setting.\n\nWow, not only are you [diagnosing the outside person](https://www.reddit.com/r/DnD/comments/65pszu/rant_do_not_chat_up_my_players_while_were_in_the/dgclv99/) based on a single second-hand description on the internet of a single interaction, you're also diagnosing OP based on a single post containing partial capslock? \n\nIf capslock is a diagnostic tool for determining if someone has social anxiety, based on the emails I've received, my 90 year old aunt has the most severe case of social anxiety I've ever seen. \n\nAnd your qualification for making these diagnoses is, what, you have a kid who's autistic? \n\nI give about as much of a shit about your opinion on these matters, as I do about Jenny McCarthy's regarding vaccination. And I'm fairly sure I'm not the only one. ", "edited": 1492379895.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Your text reads to me as someone who has some unresolved social anxiety issues, ESPECIALLY THE PARTS IN ALL CAPS. If your text indicates how you feel about the situation, this reasonably normal situation has you pretty worked up. It might mean that you&amp;#39;d be more comfortable without trying to wedge your game into a social setting.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Wow, not only are you &lt;a href=\"https://www.reddit.com/r/DnD/comments/65pszu/rant_do_not_chat_up_my_players_while_were_in_the/dgclv99/\"&gt;diagnosing the outside person&lt;/a&gt; based on a single second-hand description on the internet of a single interaction, you&amp;#39;re also diagnosing OP based on a single post containing partial capslock? &lt;/p&gt;\n\n&lt;p&gt;If capslock is a diagnostic tool for determining if someone has social anxiety, based on the emails I&amp;#39;ve received, my 90 year old aunt has the most severe case of social anxiety I&amp;#39;ve ever seen. &lt;/p&gt;\n\n&lt;p&gt;And your qualification for making these diagnoses is, what, you have a kid who&amp;#39;s autistic? &lt;/p&gt;\n\n&lt;p&gt;I give about as much of a shit about your opinion on these matters, as I do about Jenny McCarthy&amp;#39;s regarding vaccination. And I&amp;#39;m fairly sure I&amp;#39;m not the only one. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcmplo", "score_hidden": false, "stickied": false, "created": 1492408155.0, "created_utc": 1492379355.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcar6k", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mcbobboreddit", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 1, "body": "Some counter points that you may not have considered:\n\n1.  Taking a new player to a place with a metric boatload of distractions is probably a tactical mistake, so you were swimming upstream from the very start.\n\n1.  Your least engaged player was likely giving off 'disengaged' signals, which the walkup player tried to exploit.  This could be considered a kindness if, for example, she genuinely appeared to be bored.  It's possible you're misreading the situation, but asking your friend about it and doing the whole adult conversation thing would be the best way to go.  Don't assume.\n\n1.  Take breaks.  When the flow of a game is interrupted next time just announce to everyone that we're taking a five minute break.  Not only is this a biologically and psychologically good thing to do, it sends a clear signal to the walkup that his conversation needs to be done in five minutes.\n\n1.  Your text reads to me as someone who has some unresolved social anxiety issues, ESPECIALLY THE PARTS IN ALL CAPS.  If your text indicates how you feel about the situation, this reasonably normal situation has you pretty worked up.  It might mean that you'd be more comfortable without trying to wedge your game into a social setting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some counter points that you may not have considered:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Taking a new player to a place with a metric boatload of distractions is probably a tactical mistake, so you were swimming upstream from the very start.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Your least engaged player was likely giving off &amp;#39;disengaged&amp;#39; signals, which the walkup player tried to exploit.  This could be considered a kindness if, for example, she genuinely appeared to be bored.  It&amp;#39;s possible you&amp;#39;re misreading the situation, but asking your friend about it and doing the whole adult conversation thing would be the best way to go.  Don&amp;#39;t assume.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Take breaks.  When the flow of a game is interrupted next time just announce to everyone that we&amp;#39;re taking a five minute break.  Not only is this a biologically and psychologically good thing to do, it sends a clear signal to the walkup that his conversation needs to be done in five minutes.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Your text reads to me as someone who has some unresolved social anxiety issues, ESPECIALLY THE PARTS IN ALL CAPS.  If your text indicates how you feel about the situation, this reasonably normal situation has you pretty worked up.  It might mean that you&amp;#39;d be more comfortable without trying to wedge your game into a social setting.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcar6k", "score_hidden": false, "stickied": false, "created": 1492392434.0, "created_utc": 1492363634.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcc8d8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Fayt-Harkwind", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "It must be absolute pleasure for store staff to kick these types of people out. I'm always fearful though because I know there's still stores in this world that cater to these types of creeps instead of the other way around.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It must be absolute pleasure for store staff to kick these types of people out. I&amp;#39;m always fearful though because I know there&amp;#39;s still stores in this world that cater to these types of creeps instead of the other way around.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcc8d8", "score_hidden": false, "stickied": false, "created": 1492394380.0, "created_utc": 1492365580.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcgi2l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Seems2likeBlu", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 1, "body": "THIS. IS. WHY. YOU. DONT. PLAY. AT. A. GAMESHOP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;THIS. IS. WHY. YOU. DONT. PLAY. AT. A. GAMESHOP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcgi2l", "score_hidden": false, "stickied": false, "created": 1492400071.0, "created_utc": 1492371271.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcs8wi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "r-n-w", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 1, "body": "[This](http://parisianqueen.tumblr.com/post/158937733644/so-last-night-myself-and-another-girl-were-asked) has been going round on tumblr recently, and it makes my blood boil just as much. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://parisianqueen.tumblr.com/post/158937733644/so-last-night-myself-and-another-girl-were-asked\"&gt;This&lt;/a&gt; has been going round on tumblr recently, and it makes my blood boil just as much. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcs8wi", "score_hidden": false, "stickied": false, "created": 1492415659.0, "created_utc": 1492386859.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgct18i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WaterMelon615", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Why didn't you just host the game in an environment where stuff like this wouldn't happen like someone's house ?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why didn&amp;#39;t you just host the game in an environment where stuff like this wouldn&amp;#39;t happen like someone&amp;#39;s house ?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgct18i", "score_hidden": false, "stickied": false, "created": 1492416754.0, "created_utc": 1492387954.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgd0mpm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Grimdalus", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I know I can be sexist towards women that's why I don't engage with them for discourse at flgs and it should be the same for them due to level of respect which should be levelled at them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know I can be sexist towards women that&amp;#39;s why I don&amp;#39;t engage with them for discourse at flgs and it should be the same for them due to level of respect which should be levelled at them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd0mpm", "score_hidden": false, "stickied": false, "created": 1492427041.0, "created_utc": 1492398241.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgd3roh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ianskull", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I'm confused as to why you would run a game in a public place if you brought the players with you and why you didn't just tell mr. mouthbreather to fuck off.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m confused as to why you would run a game in a public place if you brought the players with you and why you didn&amp;#39;t just tell mr. mouthbreather to fuck off.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd3roh", "score_hidden": false, "stickied": false, "created": 1492431883.0, "created_utc": 1492403083.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgd80dn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ghikas", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Honestly I'm more pissed at the rule thing. People would get fought around me for less. It's ok for my players to questions stuff because they at least have an investment in the games and are particular rule set. If someone came to my table and tried to rule lawyer me when I don't even know them I will rain down ungodly hell upon you. \n\nAlso don't ever hit on my players mid session. That to will get you fought. \n\nI say fought but I'm a non violent person but I'd yield at you and pick apart every aspect I could find about your personality and apperence. \n\nI am not a good person. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly I&amp;#39;m more pissed at the rule thing. People would get fought around me for less. It&amp;#39;s ok for my players to questions stuff because they at least have an investment in the games and are particular rule set. If someone came to my table and tried to rule lawyer me when I don&amp;#39;t even know them I will rain down ungodly hell upon you. &lt;/p&gt;\n\n&lt;p&gt;Also don&amp;#39;t ever hit on my players mid session. That to will get you fought. &lt;/p&gt;\n\n&lt;p&gt;I say fought but I&amp;#39;m a non violent person but I&amp;#39;d yield at you and pick apart every aspect I could find about your personality and apperence. &lt;/p&gt;\n\n&lt;p&gt;I am not a good person. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd80dn", "score_hidden": false, "stickied": false, "created": 1492440551.0, "created_utc": 1492411751.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgd9edu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "xeonicus", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Oh yea, that's awful.  The game I play in has been hosted at a nearby game store a few times.  It's usually fine, though it's noisy and you can't exactly crack open a beer while you play.  A similar thing happened to us one time though.  A guy sat down at our table and kept up a stream of commentary, questions, and laughter right in the middle of the game.  It was very interruptive.  I honestly have zero issue with people quietly observing, and I like talking and answering questions when we have short breaks.  We normally do our best to host games at someone's house.", "edited": 1492415649.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh yea, that&amp;#39;s awful.  The game I play in has been hosted at a nearby game store a few times.  It&amp;#39;s usually fine, though it&amp;#39;s noisy and you can&amp;#39;t exactly crack open a beer while you play.  A similar thing happened to us one time though.  A guy sat down at our table and kept up a stream of commentary, questions, and laughter right in the middle of the game.  It was very interruptive.  I honestly have zero issue with people quietly observing, and I like talking and answering questions when we have short breaks.  We normally do our best to host games at someone&amp;#39;s house.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd9edu", "score_hidden": false, "stickied": false, "created": 1492444168.0, "created_utc": 1492415368.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdbyp8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "austintracey90", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Sorry man biological imperative. Men will always try and get girls and/or vice versa. \n\nI feel your pain, keeping my players focused it like herding cats. However if your in public that is what you got do deal with. \n\nEdit:Not that i condone this behavior just your fighting against 1000s of years of evolution. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry man biological imperative. Men will always try and get girls and/or vice versa. &lt;/p&gt;\n\n&lt;p&gt;I feel your pain, keeping my players focused it like herding cats. However if your in public that is what you got do deal with. &lt;/p&gt;\n\n&lt;p&gt;Edit:Not that i condone this behavior just your fighting against 1000s of years of evolution. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdbyp8", "score_hidden": false, "stickied": false, "created": 1492452861.0, "created_utc": 1492424061.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdf83z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tragedyofphilosophy", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "We had this problem at the first few events we ran. The immediate solution was to fold.\n\n- First, we included a sign. (Please do not engage our participants during play. Breaks are at x and y time for 10 minutes.)\n\nThat stopped 90% of it. Of course we completely allowed for emergencies.\n\n- second we began scheduling another person from the team to be there to help answer any questions that popped up. They walked around and milled about engaging any watchers and answering questions, also reminding any problem individuals of the sign. Eventually we added a qr code to our sign to let others take our \"character builder\" test and sign up for the next event which the walk around guy could easily help them with.\n\nNow we rarely have an incident, even once ever few venues. Very simple. It also helped massively for filling each venue with players. No time like right now to get people signed up.", "edited": 1492432637.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We had this problem at the first few events we ran. The immediate solution was to fold.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;First, we included a sign. (Please do not engage our participants during play. Breaks are at x and y time for 10 minutes.)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;That stopped 90% of it. Of course we completely allowed for emergencies.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;second we began scheduling another person from the team to be there to help answer any questions that popped up. They walked around and milled about engaging any watchers and answering questions, also reminding any problem individuals of the sign. Eventually we added a qr code to our sign to let others take our &amp;quot;character builder&amp;quot; test and sign up for the next event which the walk around guy could easily help them with.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Now we rarely have an incident, even once ever few venues. Very simple. It also helped massively for filling each venue with players. No time like right now to get people signed up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdf83z", "score_hidden": false, "stickied": false, "created": 1492461252.0, "created_utc": 1492432452.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdkgv3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DeadlyBro", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I positively hate interruptions at the gaming table. This is why I am very excited to move my venue from my local game shop to my apartment. I hate when I have to literally shoo people away from the table or call back my players. I want my players to be invested and some can't handle other people there. And the other people don't help! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I positively hate interruptions at the gaming table. This is why I am very excited to move my venue from my local game shop to my apartment. I hate when I have to literally shoo people away from the table or call back my players. I want my players to be invested and some can&amp;#39;t handle other people there. And the other people don&amp;#39;t help! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdkgv3", "score_hidden": false, "stickied": false, "created": 1492469340.0, "created_utc": 1492440540.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdu0c2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "broomball99", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Maybe talk with the shop keeper(s) to see if you can help get signs put in that say \"game in progress: viewing is allowed please don't distract players!\" Where you have a sign per table that can be put up that way new groups being taught or first time DMs can put the sign up so as to only have to worry about the game and it is justified by the store's rules if a DM asks a player to leave because they are distracting the group with the shop keeper(s) backing the DM on telling the person to leave the game's immediate area.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe talk with the shop keeper(s) to see if you can help get signs put in that say &amp;quot;game in progress: viewing is allowed please don&amp;#39;t distract players!&amp;quot; Where you have a sign per table that can be put up that way new groups being taught or first time DMs can put the sign up so as to only have to worry about the game and it is justified by the store&amp;#39;s rules if a DM asks a player to leave because they are distracting the group with the shop keeper(s) backing the DM on telling the person to leave the game&amp;#39;s immediate area.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdu0c2", "score_hidden": false, "stickied": false, "created": 1492480238.0, "created_utc": 1492451438.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgdx5ye", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LilyRM", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "When someone is talking to one of the players, or a couple of players get talking too loud when another has a moment \"alone\", my DM stops talking and then fake whispers to the talkers: \"Hey. I'm trying to DM here. Stop distracting me.\" He'll do this once and people often chill out, because its a bit too obvious that they're being annoying.\nHonestly, just pause the game until they shut up or leave. I's clear enough in most cases.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When someone is talking to one of the players, or a couple of players get talking too loud when another has a moment &amp;quot;alone&amp;quot;, my DM stops talking and then fake whispers to the talkers: &amp;quot;Hey. I&amp;#39;m trying to DM here. Stop distracting me.&amp;quot; He&amp;#39;ll do this once and people often chill out, because its a bit too obvious that they&amp;#39;re being annoying.\nHonestly, just pause the game until they shut up or leave. I&amp;#39;s clear enough in most cases.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdx5ye", "score_hidden": false, "stickied": false, "created": 1492483765.0, "created_utc": 1492454965.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dge1uzr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LordCryofax", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "it was your first time at the shop, an awkward situation, so lesson learned. Now you know what ground rules to have and enforce. You don't need a big sign and you definitely don't need to be belligerent or confrontational. Just a simple and polite \"Only players at the table, please.\". If he doesn't comply THEN you escalate it.\n\nAs for him chatting her up, you could tell him to stop, OR you could just bring the whole game to a halt and wait, making it clear that's what you're waiting on. They'll get the message and the other players will help you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it was your first time at the shop, an awkward situation, so lesson learned. Now you know what ground rules to have and enforce. You don&amp;#39;t need a big sign and you definitely don&amp;#39;t need to be belligerent or confrontational. Just a simple and polite &amp;quot;Only players at the table, please.&amp;quot;. If he doesn&amp;#39;t comply THEN you escalate it.&lt;/p&gt;\n\n&lt;p&gt;As for him chatting her up, you could tell him to stop, OR you could just bring the whole game to a halt and wait, making it clear that&amp;#39;s what you&amp;#39;re waiting on. They&amp;#39;ll get the message and the other players will help you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dge1uzr", "score_hidden": false, "stickied": false, "created": 1492489071.0, "created_utc": 1492460271.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgchtw1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HimuShin", "parent_id": "t1_dgcdywp", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Answered up above: https://www.reddit.com/r/DnD/comments/65pszu/rant_do_not_chat_up_my_players_while_were_in_the/dgchsbi/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Answered up above: &lt;a href=\"https://www.reddit.com/r/DnD/comments/65pszu/rant_do_not_chat_up_my_players_while_were_in_the/dgchsbi/\"&gt;https://www.reddit.com/r/DnD/comments/65pszu/rant_do_not_chat_up_my_players_while_were_in_the/dgchsbi/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgchtw1", "score_hidden": false, "stickied": false, "created": 1492401804.0, "created_utc": 1492373004.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdywp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Chachslayer", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "You've peaked my interest, what imaginary rule did he try to correct you on?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ve peaked my interest, what imaginary rule did he try to correct you on?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcdywp", "score_hidden": false, "stickied": false, "created": 1492396714.0, "created_utc": 1492367914.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgcign1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Reven420", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Only time I've ever played at my local game shop is when it's after hours. We used to hold a Sunday night game every week. Shop was closed, just us, our character sheets, dice and some beer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Only time I&amp;#39;ve ever played at my local game shop is when it&amp;#39;s after hours. We used to hold a Sunday night game every week. Shop was closed, just us, our character sheets, dice and some beer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcign1", "score_hidden": false, "stickied": false, "created": 1492402607.0, "created_utc": 1492373807.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgd1i0d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Trinculoisdead", "parent_id": "t1_dgcrk0j", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Or not, also.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or not, also.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd1i0d", "score_hidden": false, "stickied": false, "created": 1492428299.0, "created_utc": 1492399499.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrk0j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tenshimaru_tokugawa1", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "These kinds of people really need to disappear. You g[uys in America are lucky that these kinds of gaming shops still exist, I live in Brazil and the tabletop-RPG genre almost disappeared in the early 2000s(it is super hard for me to find a D20, and I live in the biggest city in South America). Those guys who discourage newcomers from becoming gamers really have to disappear, or the hobby that we love so much may disappear for good.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;These kinds of people really need to disappear. You g[uys in America are lucky that these kinds of gaming shops still exist, I live in Brazil and the tabletop-RPG genre almost disappeared in the early 2000s(it is super hard for me to find a D20, and I live in the biggest city in South America). Those guys who discourage newcomers from becoming gamers really have to disappear, or the hobby that we love so much may disappear for good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcrk0j", "score_hidden": false, "stickied": false, "created": 1492414735.0, "created_utc": 1492385935.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgd7zxo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ziddersroofurry", "parent_id": "t1_dgcd9hm", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "That kid you want to punch doesn't belong in your store. If I was a customer and every time I came in I had to deal with someone like that I wouldn't come back. If someone can't respect other peoples boundaries they shouldn't be allowed in your place of business. It's disrespectful to you and you're being disrespectful to your customers by allowing them to do it there. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That kid you want to punch doesn&amp;#39;t belong in your store. If I was a customer and every time I came in I had to deal with someone like that I wouldn&amp;#39;t come back. If someone can&amp;#39;t respect other peoples boundaries they shouldn&amp;#39;t be allowed in your place of business. It&amp;#39;s disrespectful to you and you&amp;#39;re being disrespectful to your customers by allowing them to do it there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgd7zxo", "score_hidden": false, "stickied": false, "created": 1492440523.0, "created_utc": 1492411723.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcd9hm", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "Koalachan", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 1, "body": "If you don't want the possibility of people coming to your table then don't play on a game shop. People come and watch games all the time, and even chat with players. DnD takes a bit more focus, but I still see a lot of people chatting about other things when  not their turns (and even sometimes when it is their turns). You should have handled this if you didn't want it to happen. If you felt a player was too uncomfortable or too distracted it's part of your job as DM to resolve those issues. \n\nMany players are fine chatting with people outside the game. It's going to happen as people make friends and meet new people, and especially when their are new people to the shop and everyone is trying to see what's up. I personally don't feel this is \"women's\" or \"female\" issue, as it happens to both men and women. The guy might of just thought he was being welcoming to someone who may or may not if looked like she was having fun. If you felt it looked otherwise you should of asked him to leave. \n\nStory time: there is one \"kid\" who frequents my shop  (I think he's 18). The regulars are all aware of him at this point and just sort of learned to ignore him when possible and to tell him to back off when needed. He is either in the spectrum, I believe the term is these days, or is just the most personal space, rude, insensitive, and unable to take a clue person I have ever met. He always stands right over someone's shoulder, will pull up a seat after you tell him not to, tries to talk over you when you are trying to explain a game (sometimes trying to explain it himself, but like a different part then what you are explaining). He's a handful, and while normally a calm person, sometimes I just want to punch him. I mean literally punch him. I'm not proud of it, but I'm also not the only one. Among other things I run a kids DnD group, and he'll walk in and just start distracting all the kids. I've told him to leave several times because they are easily distracted already, but the next week he always comes back. \n\nAnother kid (also 18) we have I know has aspergers. He means well, and specifically comes to the shop to learn to interact with people. One time there were the girls (not sure if college or high school) playing magic, and he walked up and started talking to them about magic. They had been keeping to themselves and talking about other things before, but they just kinda tolerated him and humored him some. Eventual he asked to play with them (it's his favorite game) and they kinda said no without saying no, you know, like people being polite that other people pick up on. Well he didn't pick up. Long story short, he ended up playing magic with them, and they kinda looked uncomfortable the whole time. Now here's the thing about this, to someone outside they might think \"this is why you don't see more female gamers, cause men being rude and walkin up and making them uncomfortable.\" But for those who know more, it's really a person on the spectrum who doesn't know any better, is trying to learn to interact with people, and just loves to play magic.  \n\nMy point in this is I have no point, but I guess I see a lot of people instantly assume and judge things to be one way, when in reality it's not and they let that stop them from enjoying new hobbies.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you don&amp;#39;t want the possibility of people coming to your table then don&amp;#39;t play on a game shop. People come and watch games all the time, and even chat with players. DnD takes a bit more focus, but I still see a lot of people chatting about other things when  not their turns (and even sometimes when it is their turns). You should have handled this if you didn&amp;#39;t want it to happen. If you felt a player was too uncomfortable or too distracted it&amp;#39;s part of your job as DM to resolve those issues. &lt;/p&gt;\n\n&lt;p&gt;Many players are fine chatting with people outside the game. It&amp;#39;s going to happen as people make friends and meet new people, and especially when their are new people to the shop and everyone is trying to see what&amp;#39;s up. I personally don&amp;#39;t feel this is &amp;quot;women&amp;#39;s&amp;quot; or &amp;quot;female&amp;quot; issue, as it happens to both men and women. The guy might of just thought he was being welcoming to someone who may or may not if looked like she was having fun. If you felt it looked otherwise you should of asked him to leave. &lt;/p&gt;\n\n&lt;p&gt;Story time: there is one &amp;quot;kid&amp;quot; who frequents my shop  (I think he&amp;#39;s 18). The regulars are all aware of him at this point and just sort of learned to ignore him when possible and to tell him to back off when needed. He is either in the spectrum, I believe the term is these days, or is just the most personal space, rude, insensitive, and unable to take a clue person I have ever met. He always stands right over someone&amp;#39;s shoulder, will pull up a seat after you tell him not to, tries to talk over you when you are trying to explain a game (sometimes trying to explain it himself, but like a different part then what you are explaining). He&amp;#39;s a handful, and while normally a calm person, sometimes I just want to punch him. I mean literally punch him. I&amp;#39;m not proud of it, but I&amp;#39;m also not the only one. Among other things I run a kids DnD group, and he&amp;#39;ll walk in and just start distracting all the kids. I&amp;#39;ve told him to leave several times because they are easily distracted already, but the next week he always comes back. &lt;/p&gt;\n\n&lt;p&gt;Another kid (also 18) we have I know has aspergers. He means well, and specifically comes to the shop to learn to interact with people. One time there were the girls (not sure if college or high school) playing magic, and he walked up and started talking to them about magic. They had been keeping to themselves and talking about other things before, but they just kinda tolerated him and humored him some. Eventual he asked to play with them (it&amp;#39;s his favorite game) and they kinda said no without saying no, you know, like people being polite that other people pick up on. Well he didn&amp;#39;t pick up. Long story short, he ended up playing magic with them, and they kinda looked uncomfortable the whole time. Now here&amp;#39;s the thing about this, to someone outside they might think &amp;quot;this is why you don&amp;#39;t see more female gamers, cause men being rude and walkin up and making them uncomfortable.&amp;quot; But for those who know more, it&amp;#39;s really a person on the spectrum who doesn&amp;#39;t know any better, is trying to learn to interact with people, and just loves to play magic.  &lt;/p&gt;\n\n&lt;p&gt;My point in this is I have no point, but I guess I see a lot of people instantly assume and judge things to be one way, when in reality it&amp;#39;s not and they let that stop them from enjoying new hobbies.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgcd9hm", "score_hidden": false, "stickied": false, "created": 1492395758.0, "created_utc": 1492366958.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgc9iim", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "GaussWanker", "parent_id": "t1_dgc8txg", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "&gt;I didn't do what I thought I should've, and probably feel a little guilty.\n\nYou've had a lot more time to think now, and you've arrived at what I think is the right conclusion (that you, the one with the power, as the DM and as the experienced one in gaming shops in general even if not this one, could have and perhaps should have told them more forcefully to vacate your table). Just put that praxis into effect if you need to another time. \n\nAnd it is a bigger issue, but the big issue is always made up of a lot of smaller issues, and if you can tackle each and every one of those when they arise, then you're making good headway.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I didn&amp;#39;t do what I thought I should&amp;#39;ve, and probably feel a little guilty.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;ve had a lot more time to think now, and you&amp;#39;ve arrived at what I think is the right conclusion (that you, the one with the power, as the DM and as the experienced one in gaming shops in general even if not this one, could have and perhaps should have told them more forcefully to vacate your table). Just put that praxis into effect if you need to another time. &lt;/p&gt;\n\n&lt;p&gt;And it is a bigger issue, but the big issue is always made up of a lot of smaller issues, and if you can tackle each and every one of those when they arise, then you&amp;#39;re making good headway.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc9iim", "score_hidden": false, "stickied": false, "created": 1492390800.0, "created_utc": 1492362000.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65pszu", "likes": null, "replies": "", "user_reports": [], "id": "dgc90wy", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Daloowee", "parent_id": "t1_dgc8txg", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Valid points. I would definitely take more control of the game or ask the shop owner to impose some sort of etiquette.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Valid points. I would definitely take more control of the game or ask the shop owner to impose some sort of etiquette.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc90wy", "score_hidden": false, "stickied": false, "created": 1492390193.0, "created_utc": 1492361393.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8txg", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "HimuShin", "parent_id": "t1_dgc8ns4", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Lots of reasons.  First, I have no way to contact this man, and don't particularly wish to.  Second, I didn't do what I thought I should've, and probably feel a little guilty.  Third, it's a good way to vent.\n\nFourth, and most importantly, this is far bigger than a single instance.  This is a big issue that needs to be addressed.  I'm hardly the only or first one to bring this up.  But having a conversation is rarely a bad thing.  And maybe we can all learn from the discourse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lots of reasons.  First, I have no way to contact this man, and don&amp;#39;t particularly wish to.  Second, I didn&amp;#39;t do what I thought I should&amp;#39;ve, and probably feel a little guilty.  Third, it&amp;#39;s a good way to vent.&lt;/p&gt;\n\n&lt;p&gt;Fourth, and most importantly, this is far bigger than a single instance.  This is a big issue that needs to be addressed.  I&amp;#39;m hardly the only or first one to bring this up.  But having a conversation is rarely a bad thing.  And maybe we can all learn from the discourse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc8txg", "score_hidden": false, "stickied": false, "created": 1492389937.0, "created_utc": 1492361137.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 30}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8ns4", "gilded": 0, "archived": false, "score": -9, "report_reasons": null, "author": "Daloowee", "parent_id": "t3_65pszu", "subreddit_name_prefixed": "r/DnD", "controversiality": 1, "body": "Uh why do you make a rant on Reddit instead of talking to the offenders personally?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Uh why do you make a rant on Reddit instead of talking to the offenders personally?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgc8ns4", "score_hidden": false, "stickied": false, "created": 1492389711.0, "created_utc": 1492360911.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -9}}, {"kind": "more"}], "after": null, "before": null}}]