[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "DnD", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;TL;DR&lt;/strong&gt; There have been a lot of &amp;quot;horrible things happened to me during DnD&amp;quot; posts this weekend and it truly breaks my heart. When did we stop playing the game to have fun and stop giving a damn about the other people at the table?&lt;/p&gt;\n\n&lt;p&gt;I jumped on this sub for the first time today and the first three threads that caught my eye near the top of the &amp;quot;hot&amp;quot; page were all rants about how terrible outsiders were to someone&amp;#39;s game or how a DM was a horrible person to a player or even how an entire group seemed to gang up on one person for a particularly horrible event. And honestly, I can&amp;#39;t help but think &amp;quot;What the hell is going on?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Part of me wants to believe that one post enables another. If I see someone post about something that&amp;#39;s been bothering me but I&amp;#39;ve had reservations about making my post, I may feel more confident, seeing others in the same situation as me. But even then, I really still feel the need to ask why people are leaning away from the goal of DnD: To have a fun time in pretend land with our friends while we do awesome and epic things.&lt;/p&gt;\n\n&lt;p&gt;To that end, I want to say: Be good to one another. Remember that you&amp;#39;re not the only person at the table. If you&amp;#39;re a DM, please remember that your players aren&amp;#39;t just characters in the story, they&amp;#39;re human beings at your table. If someone looks uncomfortable or isn&amp;#39;t having fun, call a break and talk to them. If they say something you did in the game made them feel uncomfortable, apologize and try to change it. I&amp;#39;m not asking for you to hand out epic items to make the person rolling badly one night the new Main Character, but don&amp;#39;t let your group force someone into having their under aged character whored out for money if they&amp;#39;re against it. Don&amp;#39;t take away choices from a player and tell them they have to do things they don&amp;#39;t want to do, either. And if you&amp;#39;re an outside near a game, don&amp;#39;t distract the players or the DM. It may seem like they&amp;#39;re having fun and you want a piece of that fun, but that is something that can wait until they finish or take a break. Maybe they&amp;#39;ll accept a new player. Maybe you&amp;#39;ll just make chit-chat. But don&amp;#39;t interrupt. It&amp;#39;s just like talking in school or bursting into a meeting with your own topics/ideas that don&amp;#39;t relate back to what the original purpose of said meeting was. It&amp;#39;s rude and it can wait.&lt;/p&gt;\n\n&lt;p&gt;Seriously, people. We&amp;#39;re doing this to have fun, to enjoy each other&amp;#39;s company and make some stories about how EPIC it was when John or Jane Smith cut off the dragon&amp;#39;s head or stole an entire vault of gold from plain sight or talked a God into smiting an army, etc. etc.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re not here to be jerks to each other.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**TL;DR** There have been a lot of \"horrible things happened to me during DnD\" posts this weekend and it truly breaks my heart. When did we stop playing the game to have fun and stop giving a damn about the other people at the table?\n\nI jumped on this sub for the first time today and the first three threads that caught my eye near the top of the \"hot\" page were all rants about how terrible outsiders were to someone's game or how a DM was a horrible person to a player or even how an entire group seemed to gang up on one person for a particularly horrible event. And honestly, I can't help but think \"What the hell is going on?\"\n\nPart of me wants to believe that one post enables another. If I see someone post about something that's been bothering me but I've had reservations about making my post, I may feel more confident, seeing others in the same situation as me. But even then, I really still feel the need to ask why people are leaning away from the goal of DnD: To have a fun time in pretend land with our friends while we do awesome and epic things.\n\nTo that end, I want to say: Be good to one another. Remember that you're not the only person at the table. If you're a DM, please remember that your players aren't just characters in the story, they're human beings at your table. If someone looks uncomfortable or isn't having fun, call a break and talk to them. If they say something you did in the game made them feel uncomfortable, apologize and try to change it. I'm not asking for you to hand out epic items to make the person rolling badly one night the new Main Character, but don't let your group force someone into having their under aged character whored out for money if they're against it. Don't take away choices from a player and tell them they have to do things they don't want to do, either. And if you're an outside near a game, don't distract the players or the DM. It may seem like they're having fun and you want a piece of that fun, but that is something that can wait until they finish or take a break. Maybe they'll accept a new player. Maybe you'll just make chit-chat. But don't interrupt. It's just like talking in school or bursting into a meeting with your own topics/ideas that don't relate back to what the original purpose of said meeting was. It's rude and it can wait.\n\nSeriously, people. We're doing this to have fun, to enjoy each other's company and make some stories about how EPIC it was when John or Jane Smith cut off the dragon's head or stole an entire vault of gold from plain sight or talked a God into smiting an army, etc. etc.\n\nWe're not here to be jerks to each other.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Out of Game", "id": "65v6bw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 237, "report_reasons": null, "author": "DM_Cross", "saved": false, "mod_reports": [], "name": "t3_65v6bw", "subreddit_name_prefixed": "r/DnD", "approved_by": null, "over_18": false, "domain": "self.DnD", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r9ei", "edited": false, "link_flair_css_class": "OOG", "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/DnD/comments/65v6bw/psa_were_here_to_play_a_game_together_please_be/", "num_reports": null, "locked": false, "stickied": false, "created": 1492459971.0, "url": "https://www.reddit.com/r/DnD/comments/65v6bw/psa_were_here_to_play_a_game_together_please_be/", "author_flair_text": "DM", "quarantine": false, "title": "PSA: We're here to play a game together... Please be good to one another", "created_utc": 1492431171.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 54, "visited": false, "subreddit_type": "public", "ups": 237}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdr7z6", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "DarienDM", "parent_id": "t1_dgdr1ki", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "No one said it's common, but it happens. Acting as though it's so rare that it's not even worth talking about is both blind and dismissive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No one said it&amp;#39;s common, but it happens. Acting as though it&amp;#39;s so rare that it&amp;#39;s not even worth talking about is both blind and dismissive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdr7z6", "score_hidden": false, "stickied": false, "created": 1492477146.0, "created_utc": 1492448346.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dge0tmt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Teddybomb", "parent_id": "t1_dgdr1ki", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Everyone I'm gaming with currently has had a game implode because of 'that guy'.\n\nGranted, in my previous game me and my brother where 'that guy', constantly fighting and going at each other. But the straw that broke the camels, was the dm being a spineless bitch.\n\nLong story short, shit happens alot more than we would like to admit.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everyone I&amp;#39;m gaming with currently has had a game implode because of &amp;#39;that guy&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;Granted, in my previous game me and my brother where &amp;#39;that guy&amp;#39;, constantly fighting and going at each other. But the straw that broke the camels, was the dm being a spineless bitch.&lt;/p&gt;\n\n&lt;p&gt;Long story short, shit happens alot more than we would like to admit.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dge0tmt", "score_hidden": false, "stickied": false, "created": 1492487905.0, "created_utc": 1492459105.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdr1ki", "gilded": 0, "archived": false, "score": -11, "report_reasons": null, "author": "beardedheathen", "parent_id": "t1_dgdgwje", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Or, you know, that doesn't happen in that overwhelmingly vast majority of game and since most gamers are humans and on the whole we aren't a bunch of opportunistic rapist just waiting for the thin veil of civilization to rip before we shove our dicks wherever we can. It's not normal and it's not common and people need to stand up for themselves if they want something to change. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or, you know, that doesn&amp;#39;t happen in that overwhelmingly vast majority of game and since most gamers are humans and on the whole we aren&amp;#39;t a bunch of opportunistic rapist just waiting for the thin veil of civilization to rip before we shove our dicks wherever we can. It&amp;#39;s not normal and it&amp;#39;s not common and people need to stand up for themselves if they want something to change. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdr1ki", "score_hidden": false, "stickied": false, "created": 1492476945.0, "created_utc": 1492448145.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdgwje", "gilded": 0, "archived": false, "score": 59, "report_reasons": null, "author": "DarienDM", "parent_id": "t1_dgdez5c", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "The PSA might also be extended to include \"**if you see this happening, say something**\". If your DM is sexualizing someone else's character against their will, tell them it's not okay. If they're obviously uncomfortable, speak up. If the players won't let it go, leave the table.\n\nAbusive DMs and players don't deserve our time, but it's easy for us to think that it's not happening to us so it's not our place to make waves (or worse, to go along with it because everyone else at the table is). Making a stand, drawing a line, and walking out are hard to do, but until people start seeing situations like the \"DM sexually assaulted my teenage Aasimar and then punished her for it and the group was an asshole to me afterwards\" and telling everyone at the table that it's unacceptable behaviour no matter what, this shit will keep happening. The players meekly go along with the abuse to get it over with, and everyone else thinks they persuaded the person, when really they just bullied them into submission.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The PSA might also be extended to include &amp;quot;&lt;strong&gt;if you see this happening, say something&lt;/strong&gt;&amp;quot;. If your DM is sexualizing someone else&amp;#39;s character against their will, tell them it&amp;#39;s not okay. If they&amp;#39;re obviously uncomfortable, speak up. If the players won&amp;#39;t let it go, leave the table.&lt;/p&gt;\n\n&lt;p&gt;Abusive DMs and players don&amp;#39;t deserve our time, but it&amp;#39;s easy for us to think that it&amp;#39;s not happening to us so it&amp;#39;s not our place to make waves (or worse, to go along with it because everyone else at the table is). Making a stand, drawing a line, and walking out are hard to do, but until people start seeing situations like the &amp;quot;DM sexually assaulted my teenage Aasimar and then punished her for it and the group was an asshole to me afterwards&amp;quot; and telling everyone at the table that it&amp;#39;s unacceptable behaviour no matter what, this shit will keep happening. The players meekly go along with the abuse to get it over with, and everyone else thinks they persuaded the person, when really they just bullied them into submission.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdgwje", "score_hidden": false, "stickied": false, "created": 1492464227.0, "created_utc": 1492435427.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 59}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdir84", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ShawRe", "parent_id": "t1_dgdez5c", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Even if the assholes aren't (hopefully) in this sub, this post isnt entirely unnecessary. \n\nCan always do with a reminder to be good to one another - whether it be don't be an ass yourself, or saying something if you see someone else making another player uncomfortable.  I'm sure it happens, and sometimes a reminder to not tolerate that shit may be needed now and again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even if the assholes aren&amp;#39;t (hopefully) in this sub, this post isnt entirely unnecessary. &lt;/p&gt;\n\n&lt;p&gt;Can always do with a reminder to be good to one another - whether it be don&amp;#39;t be an ass yourself, or saying something if you see someone else making another player uncomfortable.  I&amp;#39;m sure it happens, and sometimes a reminder to not tolerate that shit may be needed now and again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdir84", "score_hidden": false, "stickied": false, "created": 1492467045.0, "created_utc": 1492438245.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdkt9r", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "DM_Cross", "parent_id": "t1_dgdj8w8", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I marked it on my character sheet :D Does it help that I'm playing a Bard in one of my current games? ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I marked it on my character sheet :D Does it help that I&amp;#39;m playing a Bard in one of my current games? ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdkt9r", "score_hidden": false, "stickied": false, "created": 1492469777.0, "created_utc": 1492440977.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdj8w8", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "TheHappyLingcod", "parent_id": "t1_dgdf319", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "🎶But I might just be the lunatic you're looking for! 🎶\n\nTake a d10 inspiration die. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;🎶But I might just be the lunatic you&amp;#39;re looking for! 🎶&lt;/p&gt;\n\n&lt;p&gt;Take a d10 inspiration die. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdj8w8", "score_hidden": false, "stickied": false, "created": 1492467722.0, "created_utc": 1492438922.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdf319", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "DM_Cross", "parent_id": "t1_dgdez5c", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "You may be right. I may be crazy. (God dammit, song in my head, now) But I guess the hope is putting out positivity into the community. If misery loves company and hate begets hate, maybe some optimism can do the same.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You may be right. I may be crazy. (God dammit, song in my head, now) But I guess the hope is putting out positivity into the community. If misery loves company and hate begets hate, maybe some optimism can do the same.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdf319", "score_hidden": false, "stickied": false, "created": 1492460977.0, "created_utc": 1492432177.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dge33g0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Teddybomb", "parent_id": "t1_dgdez5c", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Well, my brother and I broke our previous gaming group.\n\nIn hindsight we both got frustrated with the dm just serving us magic items and supplying the solution to his own obstacles (we needed a tunnel between point a and point b, so we could travel undisturbed to the upper city, so his dmpc dug the tunnel during a short rest.) \n\nAnyway, we where constantly at each other's throat about rules or plans or stuff that happened or jokes that didn't fly well.\n\nThat and poor scheduling. My brother wanted to kick someone, because we had only played once in 2 months in what was supposed to be a weekly game or bi weekly at worst, the dm took a stand on the wrong side, so we took our ball and left. End of campaign. \n\nBut I've found a better dm and my brother and I get along fine, so that wasn't the issue for us.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, my brother and I broke our previous gaming group.&lt;/p&gt;\n\n&lt;p&gt;In hindsight we both got frustrated with the dm just serving us magic items and supplying the solution to his own obstacles (we needed a tunnel between point a and point b, so we could travel undisturbed to the upper city, so his dmpc dug the tunnel during a short rest.) &lt;/p&gt;\n\n&lt;p&gt;Anyway, we where constantly at each other&amp;#39;s throat about rules or plans or stuff that happened or jokes that didn&amp;#39;t fly well.&lt;/p&gt;\n\n&lt;p&gt;That and poor scheduling. My brother wanted to kick someone, because we had only played once in 2 months in what was supposed to be a weekly game or bi weekly at worst, the dm took a stand on the wrong side, so we took our ball and left. End of campaign. &lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;ve found a better dm and my brother and I get along fine, so that wasn&amp;#39;t the issue for us.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dge33g0", "score_hidden": false, "stickied": false, "created": 1492490446.0, "created_utc": 1492461646.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgecsx5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "forgottenduck", "parent_id": "t1_dgdez5c", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "As a side note, I think we should definitely share stories about awesome sea combat.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a side note, I think we should definitely share stories about awesome sea combat.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgecsx5", "score_hidden": false, "stickied": false, "created": 1492502581.0, "created_utc": 1492473781.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdez5c", "gilded": 0, "archived": false, "score": 105, "report_reasons": null, "author": "axxl75", "parent_id": "t3_65v6bw", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "The people you're giving this PSA to aren't really the ones on this sub trying to get advice or share stories. \n\nAlso, on the point of where you saw so many of that type of posts that's just the nature of the sub. Things tend to come in waves. Someone will post a rant and then you'll see 10 others because people see it make it to the top of the sub and want to share their version. If you see a post asking about sea combat you'll see 5 other posts in the next couple days asking about sea combat. \n\nBut yeah. Pretty sure you're preaching to the choir here. The assholes out there aren't really coming to this sub in large numbers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The people you&amp;#39;re giving this PSA to aren&amp;#39;t really the ones on this sub trying to get advice or share stories. &lt;/p&gt;\n\n&lt;p&gt;Also, on the point of where you saw so many of that type of posts that&amp;#39;s just the nature of the sub. Things tend to come in waves. Someone will post a rant and then you&amp;#39;ll see 10 others because people see it make it to the top of the sub and want to share their version. If you see a post asking about sea combat you&amp;#39;ll see 5 other posts in the next couple days asking about sea combat. &lt;/p&gt;\n\n&lt;p&gt;But yeah. Pretty sure you&amp;#39;re preaching to the choir here. The assholes out there aren&amp;#39;t really coming to this sub in large numbers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdez5c", "score_hidden": false, "stickied": false, "created": 1492460761.0, "created_utc": 1492431961.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 105}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdktq5", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "TheMadDoctor", "parent_id": "t1_dgdjdbb", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Exactly what I'd say, Graybeard, except put more eloquently than I perhaps would have. And more convincing given you have maybe 20 years more experience than I. These cases stand out because they are distinctly ABnormal, and thus people will post them.\n\nWho would post here specifically about what happened in their everyday game session, and who would upvote it? Oh, I could regale with tales of aggravatingly average games in which our group barters with a large trading company to outfit our airship with adamantine and then cracks a few jokes about the Wizard's crazy experiments, but I don't. I've had maybe one game that stood out as less than fun, and I admit, I vented about it on a forum. That's just how it is in my experience as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly what I&amp;#39;d say, Graybeard, except put more eloquently than I perhaps would have. And more convincing given you have maybe 20 years more experience than I. These cases stand out because they are distinctly ABnormal, and thus people will post them.&lt;/p&gt;\n\n&lt;p&gt;Who would post here specifically about what happened in their everyday game session, and who would upvote it? Oh, I could regale with tales of aggravatingly average games in which our group barters with a large trading company to outfit our airship with adamantine and then cracks a few jokes about the Wizard&amp;#39;s crazy experiments, but I don&amp;#39;t. I&amp;#39;ve had maybe one game that stood out as less than fun, and I admit, I vented about it on a forum. That&amp;#39;s just how it is in my experience as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdktq5", "score_hidden": false, "stickied": false, "created": 1492469792.0, "created_utc": 1492440992.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdvtzz", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "foofad", "parent_id": "t1_dgdjdbb", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "You're making a signal to noise argument, but no one is saying that this happens *all the time*. No one is saying that these are anything other than isolated incidents, although for some people they are more of the norm than others. But that doesn't mean that we can't learn from them and take to heart that different people find different things uncomfortable or rude, and synthesize that knowledge into a better play environment for our own groups.\n\nYour post basically boils down to \"it's so rare it's not worth worrying about,\" which is great for you but not an option for others. Your issues are blessedly not so grave as some of the recent postings. Be thankful for that but considerate of the fact that other people can have events occur that are much more disheartening than what you have had to deal with yourself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re making a signal to noise argument, but no one is saying that this happens &lt;em&gt;all the time&lt;/em&gt;. No one is saying that these are anything other than isolated incidents, although for some people they are more of the norm than others. But that doesn&amp;#39;t mean that we can&amp;#39;t learn from them and take to heart that different people find different things uncomfortable or rude, and synthesize that knowledge into a better play environment for our own groups.&lt;/p&gt;\n\n&lt;p&gt;Your post basically boils down to &amp;quot;it&amp;#39;s so rare it&amp;#39;s not worth worrying about,&amp;quot; which is great for you but not an option for others. Your issues are blessedly not so grave as some of the recent postings. Be thankful for that but considerate of the fact that other people can have events occur that are much more disheartening than what you have had to deal with yourself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdvtzz", "score_hidden": false, "stickied": false, "created": 1492482257.0, "created_utc": 1492453457.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdjdbb", "gilded": 1, "archived": false, "score": 37, "report_reasons": null, "author": "TheItinerantSkeptic", "parent_id": "t3_65v6bw", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "At this point, I've been playing Dungeons &amp; Dragons for nearly 32 years (insert graybeard joke here). Aside from one year I took off, about a year before 4th Edition launched, I was playing weekly or biweekly that whole time The number of legitimately bad experiences I've had can probably be counted on one hand. The number of misbehaving players I've dealt with were likewise quite rare. For the most part people just want to sit down and play the game.\n\nEven when rules disputes arise (and in 3.5, in particular, they were quite frequent; this is what happens when you attempt to literally have a rule for every single thing in the game), they're usually peacefully resolved (though there may be a couple of small glares or subtle muttering. It usually works itself out fairly quickly).\n\nI lost a character at one point in a 3rd Edition game. I was playing a Rogue, I attempted to pocket a gem from a chest in the corner, and a player yelped, \"I'm watching him! I'm watching him! I want to roll a Perception check!\" There was no reason for him to be watching me, but the DM allowed it, and he happened to roll spectacularly against my otherwise fairly-impressive Stealth check. He caught me. That night as our party went to sleep, he did a coup de grace on me in my sleep. It was over. I was unhappy with it, so I left the group.\n\nI had another instance where we had invited a new player into our 4th Edition group. I'd \"interviewed\" him at a bookstore prior, as I didn't want to bring a complete stranger into my home without vetting him first. He seemed okay, so we went ahead. We were in the middle of a dungeon, so there was no easy way to bring his character into the party. He had also outfitted his character with a lot more magic items than the DM was giving the rest of us (it was a fairly low-magic campaign). We found his character in the dungeon captured; the DM had corrected the overgearing problem by having some of his items (but not all) reduced to residuum, which he'd have let the player have. To keep the player engaged until we got to his character, we had him playing the character of a player who wasn't there that session. This guy was grossly unhappy, but lost it after the item reduction. We wound up having him leave, never to return. He commented, \"That's 2.5 hours of my life I'm never getting back.\" It became an in-joke in our group forever after.\n\nWe were playing the old West End Games' Star Wars RPG. I was playing a Jedi (of course), and the GM decided I was edging a little too close to the Dark Side, so he gave me a Dark Side Point at the end of the session. In that RPG, you required training to advance in levels unless you wanted to spend twice the XP to train on your own, so in-game, the GM put my character's training in the hands of another player, who decided to adopt a really punitive method of deciding when he would or wouldn't train me. The GM later admitted to me that he should have never put my character's advancement in the hands of another player's judgment, but in the moment, it didn't work out well. After one session of dealing with that player, I left the group.\n\nIn nearly 32 years of gaming, those are the only ones that really stick out for me.\n\nThe thing is this: people remember the negative experiences more often because, at least in this hobby, they're typically the exception. When things go well, that becomes the norm, and it's no longer noteworthy (one reason I always make sure to communicate to the DM that I had a good time at the session, or if I'm running it, communicate to my players that I enjoyed myself and hope they did as well). So the negative experiences stick out.\n\nThis sub (and other discussion forums for gaming) becomes an easy place to vent, to analyze, or just to bitch. We can see those exceptional bad experiences more often, so it creates a \"false positive\" in our view that there are a lot of people who are hating their gaming experience.\n\nThe analogy I use is pre-Ebay and post-Ebay comic book collecting. Back issue values for popular comics used to be quite high prior to Ebay, because they were regionally difficult to acquire. After Ebay came out and no one had to limit their search just to a drivable area or ads published in once-a-month publications like pricing magazines, back issue values decreased, because availability increased. Whereas one could expect to (at its peak value) pay $45 or $50 for the first issue of Witchblade, now one can hop on Ebay and probably pay closer to $25 or $30 for it.\n\nIt's that way with gaming &amp; online discussions. Before they were common, one didn't note a ton of bad experiences with gaming groups; most cities don't support more than 10-15 regular gaming groups, most small towns don't support more than 3-4 (tops). But now that we can plug into the experiences of gamers from across the world via the Internet, we start to see an aggregate of those regionally infrequent bad experiences.\n\nIt helps to keep some perspective. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At this point, I&amp;#39;ve been playing Dungeons &amp;amp; Dragons for nearly 32 years (insert graybeard joke here). Aside from one year I took off, about a year before 4th Edition launched, I was playing weekly or biweekly that whole time The number of legitimately bad experiences I&amp;#39;ve had can probably be counted on one hand. The number of misbehaving players I&amp;#39;ve dealt with were likewise quite rare. For the most part people just want to sit down and play the game.&lt;/p&gt;\n\n&lt;p&gt;Even when rules disputes arise (and in 3.5, in particular, they were quite frequent; this is what happens when you attempt to literally have a rule for every single thing in the game), they&amp;#39;re usually peacefully resolved (though there may be a couple of small glares or subtle muttering. It usually works itself out fairly quickly).&lt;/p&gt;\n\n&lt;p&gt;I lost a character at one point in a 3rd Edition game. I was playing a Rogue, I attempted to pocket a gem from a chest in the corner, and a player yelped, &amp;quot;I&amp;#39;m watching him! I&amp;#39;m watching him! I want to roll a Perception check!&amp;quot; There was no reason for him to be watching me, but the DM allowed it, and he happened to roll spectacularly against my otherwise fairly-impressive Stealth check. He caught me. That night as our party went to sleep, he did a coup de grace on me in my sleep. It was over. I was unhappy with it, so I left the group.&lt;/p&gt;\n\n&lt;p&gt;I had another instance where we had invited a new player into our 4th Edition group. I&amp;#39;d &amp;quot;interviewed&amp;quot; him at a bookstore prior, as I didn&amp;#39;t want to bring a complete stranger into my home without vetting him first. He seemed okay, so we went ahead. We were in the middle of a dungeon, so there was no easy way to bring his character into the party. He had also outfitted his character with a lot more magic items than the DM was giving the rest of us (it was a fairly low-magic campaign). We found his character in the dungeon captured; the DM had corrected the overgearing problem by having some of his items (but not all) reduced to residuum, which he&amp;#39;d have let the player have. To keep the player engaged until we got to his character, we had him playing the character of a player who wasn&amp;#39;t there that session. This guy was grossly unhappy, but lost it after the item reduction. We wound up having him leave, never to return. He commented, &amp;quot;That&amp;#39;s 2.5 hours of my life I&amp;#39;m never getting back.&amp;quot; It became an in-joke in our group forever after.&lt;/p&gt;\n\n&lt;p&gt;We were playing the old West End Games&amp;#39; Star Wars RPG. I was playing a Jedi (of course), and the GM decided I was edging a little too close to the Dark Side, so he gave me a Dark Side Point at the end of the session. In that RPG, you required training to advance in levels unless you wanted to spend twice the XP to train on your own, so in-game, the GM put my character&amp;#39;s training in the hands of another player, who decided to adopt a really punitive method of deciding when he would or wouldn&amp;#39;t train me. The GM later admitted to me that he should have never put my character&amp;#39;s advancement in the hands of another player&amp;#39;s judgment, but in the moment, it didn&amp;#39;t work out well. After one session of dealing with that player, I left the group.&lt;/p&gt;\n\n&lt;p&gt;In nearly 32 years of gaming, those are the only ones that really stick out for me.&lt;/p&gt;\n\n&lt;p&gt;The thing is this: people remember the negative experiences more often because, at least in this hobby, they&amp;#39;re typically the exception. When things go well, that becomes the norm, and it&amp;#39;s no longer noteworthy (one reason I always make sure to communicate to the DM that I had a good time at the session, or if I&amp;#39;m running it, communicate to my players that I enjoyed myself and hope they did as well). So the negative experiences stick out.&lt;/p&gt;\n\n&lt;p&gt;This sub (and other discussion forums for gaming) becomes an easy place to vent, to analyze, or just to bitch. We can see those exceptional bad experiences more often, so it creates a &amp;quot;false positive&amp;quot; in our view that there are a lot of people who are hating their gaming experience.&lt;/p&gt;\n\n&lt;p&gt;The analogy I use is pre-Ebay and post-Ebay comic book collecting. Back issue values for popular comics used to be quite high prior to Ebay, because they were regionally difficult to acquire. After Ebay came out and no one had to limit their search just to a drivable area or ads published in once-a-month publications like pricing magazines, back issue values decreased, because availability increased. Whereas one could expect to (at its peak value) pay $45 or $50 for the first issue of Witchblade, now one can hop on Ebay and probably pay closer to $25 or $30 for it.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s that way with gaming &amp;amp; online discussions. Before they were common, one didn&amp;#39;t note a ton of bad experiences with gaming groups; most cities don&amp;#39;t support more than 10-15 regular gaming groups, most small towns don&amp;#39;t support more than 3-4 (tops). But now that we can plug into the experiences of gamers from across the world via the Internet, we start to see an aggregate of those regionally infrequent bad experiences.&lt;/p&gt;\n\n&lt;p&gt;It helps to keep some perspective. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdjdbb", "score_hidden": false, "stickied": false, "created": 1492467890.0, "created_utc": 1492439090.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 37}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdgjzh", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "MichaelDobby", "parent_id": "t3_65v6bw", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I agree wholeheartedly, and bless your soul for placing the tl;dr at the top so I didn't mistake this post as another sad gameplay story", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree wholeheartedly, and bless your soul for placing the tl;dr at the top so I didn&amp;#39;t mistake this post as another sad gameplay story&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdgjzh", "score_hidden": false, "stickied": false, "created": 1492463661.0, "created_utc": 1492434861.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdr418", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Sokensan", "parent_id": "t3_65v6bw", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I think the biggest problem is that groups don't often sit down and talk to each other before a game starts to make sure that everyone wants the same thing out of a game because they're eager to play or happy that they found people to play with, but if everyone isn't on the same page it can get heated and people will start to act in self-interest because they're not getting what they want out of the game, IMO it's one of the most important things to do during a session zero so problems like this don't occur/occur as often. Also, problems often come about when outside events influence gameplay but often times no one wants to talk to the player(s) about why they're acting different or why they brought a guest unannounced or whatever other problem happens. ", "edited": 1492450787.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the biggest problem is that groups don&amp;#39;t often sit down and talk to each other before a game starts to make sure that everyone wants the same thing out of a game because they&amp;#39;re eager to play or happy that they found people to play with, but if everyone isn&amp;#39;t on the same page it can get heated and people will start to act in self-interest because they&amp;#39;re not getting what they want out of the game, IMO it&amp;#39;s one of the most important things to do during a session zero so problems like this don&amp;#39;t occur/occur as often. Also, problems often come about when outside events influence gameplay but often times no one wants to talk to the player(s) about why they&amp;#39;re acting different or why they brought a guest unannounced or whatever other problem happens. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdr418", "score_hidden": false, "stickied": false, "created": 1492477024.0, "created_utc": 1492448224.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdu4my", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sneakpeekbot", "parent_id": "t1_dgdu3y8", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "**Here's a sneak peek of [/r/rpghorrorstories](https://np.reddit.com/r/rpghorrorstories) using the [top posts](https://np.reddit.com/r/rpghorrorstories/top/?sort=top&amp;t=all) of all time!**\n\n\\#1: [Dodged a Bullet](https://np.reddit.com/r/rpghorrorstories/comments/53ehid/dodged_a_bullet/)  \n\\#2: [\"That Guy\" Bingo - Starting off the sub with some \\[OC\\]](http://imgur.com/a/b29CD) | [24 comments](https://np.reddit.com/r/rpghorrorstories/comments/4tzyb3/that_guy_bingo_starting_off_the_sub_with_some_oc/)  \n\\#3: [The Worst DM in the world. (Xpost from /r/DND)](https://np.reddit.com/r/rpghorrorstories/comments/4u6yqw/the_worst_dm_in_the_world_xpost_from_rdnd/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/5lveo6/blacklist/)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Here&amp;#39;s a sneak peek of &lt;a href=\"https://np.reddit.com/r/rpghorrorstories\"&gt;/r/rpghorrorstories&lt;/a&gt; using the &lt;a href=\"https://np.reddit.com/r/rpghorrorstories/top/?sort=top&amp;amp;t=all\"&gt;top posts&lt;/a&gt; of all time!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;#1: &lt;a href=\"https://np.reddit.com/r/rpghorrorstories/comments/53ehid/dodged_a_bullet/\"&gt;Dodged a Bullet&lt;/a&gt;&lt;br/&gt;\n#2: &lt;a href=\"http://imgur.com/a/b29CD\"&gt;&amp;quot;That Guy&amp;quot; Bingo - Starting off the sub with some [OC]&lt;/a&gt; | &lt;a href=\"https://np.reddit.com/r/rpghorrorstories/comments/4tzyb3/that_guy_bingo_starting_off_the_sub_with_some_oc/\"&gt;24 comments&lt;/a&gt;&lt;br/&gt;\n#3: &lt;a href=\"https://np.reddit.com/r/rpghorrorstories/comments/4u6yqw/the_worst_dm_in_the_world_xpost_from_rdnd/\"&gt;The Worst DM in the world. (Xpost from /r/DND)&lt;/a&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;sup&gt;I&amp;#39;m&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;a&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;bot,&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;beep&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;boop&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;|&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;Downvote&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;to&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;remove&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;|&lt;/sup&gt;&lt;/sup&gt; &lt;a href=\"https://www.reddit.com/message/compose/?to=sneakpeekbot\"&gt;&lt;sup&gt;&lt;sup&gt;Contact&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;me&lt;/sup&gt;&lt;/sup&gt;&lt;/a&gt; &lt;sup&gt;&lt;sup&gt;|&lt;/sup&gt;&lt;/sup&gt; &lt;a href=\"https://np.reddit.com/r/sneakpeekbot/\"&gt;&lt;sup&gt;&lt;sup&gt;Info&lt;/sup&gt;&lt;/sup&gt;&lt;/a&gt; &lt;sup&gt;&lt;sup&gt;|&lt;/sup&gt;&lt;/sup&gt; &lt;a href=\"https://np.reddit.com/r/sneakpeekbot/comments/5lveo6/blacklist/\"&gt;&lt;sup&gt;&lt;sup&gt;Opt-out&lt;/sup&gt;&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdu4my", "score_hidden": false, "stickied": false, "created": 1492480369.0, "created_utc": 1492451569.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdu3y8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheHeadlessOne", "parent_id": "t1_dgdo41v", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "/r/rpghorrorstories is also beautiful and dysfunctional", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/rpghorrorstories\"&gt;/r/rpghorrorstories&lt;/a&gt; is also beautiful and dysfunctional&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdu3y8", "score_hidden": false, "stickied": false, "created": 1492480347.0, "created_utc": 1492451547.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdo41v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Zaorish9", "parent_id": "t3_65v6bw", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Agreed OP, and for those who really enjoy rants about terrible social RPG experiences, check out /r/badrperstories , where you can complain to your heart's delight and get support/advice :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed OP, and for those who really enjoy rants about terrible social RPG experiences, check out &lt;a href=\"/r/badrperstories\"&gt;/r/badrperstories&lt;/a&gt; , where you can complain to your heart&amp;#39;s delight and get support/advice :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdo41v", "score_hidden": false, "stickied": false, "created": 1492473671.0, "created_utc": 1492444871.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdoy1q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hmph_", "parent_id": "t3_65v6bw", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I really do appreciate your desire to help the community, and I do worry wholeheartedly about people who use D&amp;D incorrectly. However, this is cyclical. Every once in a while, people post about the problems in their campaigns, and then someone makes a post just like yours, with good intentions, and nothing really changes.\n\nI myself play D&amp;D 3 times with a week with 3 different groups and a few of my players joined groups of random people and began playing and for all the 8 or 9 groups that I'm constantly hearing about, none of them have had problems like the ones that you've described. This is the internet: people go online to vent frustrations and seek advice when they can't IRL. There's a reason why voluntary response samples aren't good for statistics: they attract people with strong opinions.\n\nThat said, I think for every rant about poor experiences there are a number of posts gushing about their latest adventure, character, or awesome session. D&amp;D has not changed, we just now have a public forum to discuss those (I'd say) minority problems. If anything, it's good that people post about those bad experiences because often the community is able to assist them. I've posted here ONCE about a bad player, and the community was extremely supportive. \n\nAll things considered, I'm fine with the rant posts because they are not representative of the majority. Perhaps (paging /u/HighTechnocrat ) we could add a filter for \"Social Issues at the Table\" or \"Rants\" so that people who enjoy augmenting their blood pressure or giving advice could easily find those threads and those who don't like seeing the uglier side could filter it out.\n\nI know that you have the best of intentions, but really, do not think that D&amp;D has changed. It's still about fun, friends, and occasionally kicking some ass. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really do appreciate your desire to help the community, and I do worry wholeheartedly about people who use D&amp;amp;D incorrectly. However, this is cyclical. Every once in a while, people post about the problems in their campaigns, and then someone makes a post just like yours, with good intentions, and nothing really changes.&lt;/p&gt;\n\n&lt;p&gt;I myself play D&amp;amp;D 3 times with a week with 3 different groups and a few of my players joined groups of random people and began playing and for all the 8 or 9 groups that I&amp;#39;m constantly hearing about, none of them have had problems like the ones that you&amp;#39;ve described. This is the internet: people go online to vent frustrations and seek advice when they can&amp;#39;t IRL. There&amp;#39;s a reason why voluntary response samples aren&amp;#39;t good for statistics: they attract people with strong opinions.&lt;/p&gt;\n\n&lt;p&gt;That said, I think for every rant about poor experiences there are a number of posts gushing about their latest adventure, character, or awesome session. D&amp;amp;D has not changed, we just now have a public forum to discuss those (I&amp;#39;d say) minority problems. If anything, it&amp;#39;s good that people post about those bad experiences because often the community is able to assist them. I&amp;#39;ve posted here ONCE about a bad player, and the community was extremely supportive. &lt;/p&gt;\n\n&lt;p&gt;All things considered, I&amp;#39;m fine with the rant posts because they are not representative of the majority. Perhaps (paging &lt;a href=\"/u/HighTechnocrat\"&gt;/u/HighTechnocrat&lt;/a&gt; ) we could add a filter for &amp;quot;Social Issues at the Table&amp;quot; or &amp;quot;Rants&amp;quot; so that people who enjoy augmenting their blood pressure or giving advice could easily find those threads and those who don&amp;#39;t like seeing the uglier side could filter it out.&lt;/p&gt;\n\n&lt;p&gt;I know that you have the best of intentions, but really, do not think that D&amp;amp;D has changed. It&amp;#39;s still about fun, friends, and occasionally kicking some ass. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdoy1q", "score_hidden": false, "stickied": false, "created": 1492474618.0, "created_utc": 1492445818.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdlrpj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Serious_Much", "parent_id": "t3_65v6bw", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "PSA: Don't be a dick to eachother- INCLUDING the DM. They don't want you to pester them about deciding what the ability to check is or giving out more stuff or giving more exp when they're doing a million other things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;PSA: Don&amp;#39;t be a dick to eachother- INCLUDING the DM. They don&amp;#39;t want you to pester them about deciding what the ability to check is or giving out more stuff or giving more exp when they&amp;#39;re doing a million other things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdlrpj", "score_hidden": false, "stickied": false, "created": 1492470959.0, "created_utc": 1492442159.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdpjlo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "UntarnishedCopper", "parent_id": "t1_dgdlytz", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "So unless you're playing Adventurer's Guild or Pathfinder Society or something of the like (Shadowrun Missions, for example) there really isn't a set gaming culture.  Each group is a culture all on its own.\n\nLet's say I have some hardcore number crunchers.  Must optimize, and treat the game as a DM vs Player roll-playing game.  If a role player comes in with an unoptimized build, they're going to have a bad time.  And they'll need to either deal with it and start number crunching, try and compromise with the group, or leave.\n\nAnd all that is totally acceptable.  Not every group will work for every person.  And that's ok.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So unless you&amp;#39;re playing Adventurer&amp;#39;s Guild or Pathfinder Society or something of the like (Shadowrun Missions, for example) there really isn&amp;#39;t a set gaming culture.  Each group is a culture all on its own.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s say I have some hardcore number crunchers.  Must optimize, and treat the game as a DM vs Player roll-playing game.  If a role player comes in with an unoptimized build, they&amp;#39;re going to have a bad time.  And they&amp;#39;ll need to either deal with it and start number crunching, try and compromise with the group, or leave.&lt;/p&gt;\n\n&lt;p&gt;And all that is totally acceptable.  Not every group will work for every person.  And that&amp;#39;s ok.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdpjlo", "score_hidden": false, "stickied": false, "created": 1492475288.0, "created_utc": 1492446488.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dge5ntt", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "larrynom", "parent_id": "t1_dgdp4rd", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "&gt; I just constantly see this about women. Women, women, women.\n\nwow.  \n  \n&gt;the rest of your shitty post  \n  \nalso, wow.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I just constantly see this about women. Women, women, women.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;wow.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;the rest of your shitty post  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;also, wow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dge5ntt", "score_hidden": false, "stickied": false, "created": 1492493433.0, "created_utc": 1492464633.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdp4rd", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "Craios125", "parent_id": "t1_dgdlytz", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I just constantly see this about women. Women, women, women. Oh how they are abused, oh how they're precious and feel disturbed, because some horny teenager DM said how your character is getting touched.\n\nYou shouldn't take this seriously, be you a man or a woman. It's so basic, and you'll encounter this all the time in life. Assholes are everywhere. You have to avoid them and don't take their words to heart.\n\nIt's literally a non-issue. Telling a horny DM with a bad touch, to stop being horny and stop rubbing everyone the wrong way - **won't help.** Telling about how \"**I have played with an asshole today and I feel dejected**\" won't help. It's just a circlejerk. **Everyone understands this is wrong.** But people will still do this, because people are people, and people will people.\n\n&gt;We can, and should, be critical of the things we love.\n\nYou love playing with assholes? Because just in this post you said that this isn't about the game.\n\n&gt;legitimate concerns with the gaming culture\n\nHow is this a problem with gaming culture? It's all about hormones and levels of education. There are fucking stupid men online. There are fucking stupid women online. Don't be either one of those, and if you got into a game with one of those - **identify the problem and leave.** It's not nuclear physics. It's a simple problem to solve.\n\nUnderstand, that anonimity makes people unhinged. It's so bloody obvious. Why is it such a difficult concept for you to accept, and deal with accordingly? That's not a \"*man*\" or \"*woman*\" thing. It's just a **human** thing.\n\n**People can be assholes!**\n\n&gt;justifies inaction\n\nHow does my post that *CLEARLY* says \"**Leave if you don't feel comfortable**\" justify INACTION?!\n\nLady, seems like you're just spinning your own rhetoric, without reading my arguments, properly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just constantly see this about women. Women, women, women. Oh how they are abused, oh how they&amp;#39;re precious and feel disturbed, because some horny teenager DM said how your character is getting touched.&lt;/p&gt;\n\n&lt;p&gt;You shouldn&amp;#39;t take this seriously, be you a man or a woman. It&amp;#39;s so basic, and you&amp;#39;ll encounter this all the time in life. Assholes are everywhere. You have to avoid them and don&amp;#39;t take their words to heart.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s literally a non-issue. Telling a horny DM with a bad touch, to stop being horny and stop rubbing everyone the wrong way - &lt;strong&gt;won&amp;#39;t help.&lt;/strong&gt; Telling about how &amp;quot;&lt;strong&gt;I have played with an asshole today and I feel dejected&lt;/strong&gt;&amp;quot; won&amp;#39;t help. It&amp;#39;s just a circlejerk. &lt;strong&gt;Everyone understands this is wrong.&lt;/strong&gt; But people will still do this, because people are people, and people will people.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We can, and should, be critical of the things we love.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You love playing with assholes? Because just in this post you said that this isn&amp;#39;t about the game.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;legitimate concerns with the gaming culture&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How is this a problem with gaming culture? It&amp;#39;s all about hormones and levels of education. There are fucking stupid men online. There are fucking stupid women online. Don&amp;#39;t be either one of those, and if you got into a game with one of those - &lt;strong&gt;identify the problem and leave.&lt;/strong&gt; It&amp;#39;s not nuclear physics. It&amp;#39;s a simple problem to solve.&lt;/p&gt;\n\n&lt;p&gt;Understand, that anonimity makes people unhinged. It&amp;#39;s so bloody obvious. Why is it such a difficult concept for you to accept, and deal with accordingly? That&amp;#39;s not a &amp;quot;&lt;em&gt;man&lt;/em&gt;&amp;quot; or &amp;quot;&lt;em&gt;woman&lt;/em&gt;&amp;quot; thing. It&amp;#39;s just a &lt;strong&gt;human&lt;/strong&gt; thing.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;People can be assholes!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;justifies inaction&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How does my post that &lt;em&gt;CLEARLY&lt;/em&gt; says &amp;quot;&lt;strong&gt;Leave if you don&amp;#39;t feel comfortable&lt;/strong&gt;&amp;quot; justify INACTION?!&lt;/p&gt;\n\n&lt;p&gt;Lady, seems like you&amp;#39;re just spinning your own rhetoric, without reading my arguments, properly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdp4rd", "score_hidden": false, "stickied": false, "created": 1492474831.0, "created_utc": 1492446031.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": -8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdlytz", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "ZappaPants", "parent_id": "t1_dgdl3yx", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "You realize these are posts directed at people, who play the game, right? I can't think of any situation where people have blamed the game. They are literally, \"hey if you play with women how about not doing this, k?\". \n\nWe can, and should, be critical of the things we love. Jumping on anyone who has legitimate concerns with the gaming culture, and telling them to take their gripes elsewhere, rather than dealing with the complaints or downplaying them (which is what you are doing) does nothing but create an environment that justifies inaction when it happens, and perpetuates the problem. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You realize these are posts directed at people, who play the game, right? I can&amp;#39;t think of any situation where people have blamed the game. They are literally, &amp;quot;hey if you play with women how about not doing this, k?&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;We can, and should, be critical of the things we love. Jumping on anyone who has legitimate concerns with the gaming culture, and telling them to take their gripes elsewhere, rather than dealing with the complaints or downplaying them (which is what you are doing) does nothing but create an environment that justifies inaction when it happens, and perpetuates the problem. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdlytz", "score_hidden": false, "stickied": false, "created": 1492471196.0, "created_utc": 1492442396.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdl3yx", "gilded": 0, "archived": false, "score": -7, "report_reasons": null, "author": "Craios125", "parent_id": "t1_dgdke0l", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "&gt;I'm a female, I'm assuming you are not. \n\nI am not, but I DM a game with 2 women, and play in two more with at least one female player.\n\n&gt;majority of games I've participated in over the years had times where I was sexualized inappropriately, the male characters never were\n\nAaand? How does this have anything to do with D&amp;D, and not the people you have played with? Where in the PHB does it say \"**Objectify your female players and make sexually tense situations in game.**\" ?\n\n&gt;being forced to role play sexual situations for your groups pleasure is degrading\n\nIf it is for you - cool. That's completely fine. Then find a group that doesn't want that, either. Again, what does this have to do with Dungeons &amp; Dragons?\n\n&gt;a lot of people still don't get this, and it obviously keeps happening and needs to be beat over some players heads. \n\n\"**YOU'RE PLAYING THIS ROLEPLAYING GAME WRONG!!!**\"\n\nIf people want to sexualize D&amp;D - they may. If they don't want to - find people who don't, either. It's *basic human interaction.*\n\n&gt;live in your bubble where women don't deal with this in D&amp;D\n\nNice strawman. I said that this happens. I also said that this happens very rarely. If it would happen all the time, NO WOMAN would play D&amp;D.\n\nI'll say this again - **this is a problem with the people you play with. Not with the game itself.**\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m a female, I&amp;#39;m assuming you are not. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I am not, but I DM a game with 2 women, and play in two more with at least one female player.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;majority of games I&amp;#39;ve participated in over the years had times where I was sexualized inappropriately, the male characters never were&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Aaand? How does this have anything to do with D&amp;amp;D, and not the people you have played with? Where in the PHB does it say &amp;quot;&lt;strong&gt;Objectify your female players and make sexually tense situations in game.&lt;/strong&gt;&amp;quot; ?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;being forced to role play sexual situations for your groups pleasure is degrading&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If it is for you - cool. That&amp;#39;s completely fine. Then find a group that doesn&amp;#39;t want that, either. Again, what does this have to do with Dungeons &amp;amp; Dragons?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;a lot of people still don&amp;#39;t get this, and it obviously keeps happening and needs to be beat over some players heads. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;quot;&lt;strong&gt;YOU&amp;#39;RE PLAYING THIS ROLEPLAYING GAME WRONG!!!&lt;/strong&gt;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;If people want to sexualize D&amp;amp;D - they may. If they don&amp;#39;t want to - find people who don&amp;#39;t, either. It&amp;#39;s &lt;em&gt;basic human interaction.&lt;/em&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;live in your bubble where women don&amp;#39;t deal with this in D&amp;amp;D&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Nice strawman. I said that this happens. I also said that this happens very rarely. If it would happen all the time, NO WOMAN would play D&amp;amp;D.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll say this again - &lt;strong&gt;this is a problem with the people you play with. Not with the game itself.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdl3yx", "score_hidden": false, "stickied": false, "created": 1492470145.0, "created_utc": 1492441345.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdke0l", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "ZappaPants", "parent_id": "t1_dgdijcv", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I'm a female, I'm assuming you are not. The majority of games I've participated in over the years had times where I was sexualized inappropriately, the male characters never were, and my only option was to go along and keep playing, or quit. So, I've quit a lot of games. It's not fragile, or weak, to realize you have no real out in a situation, no one cares you're uncomfortable, so you quit. Not all sessions are fun for your character, but being forced to role play sexual situations for your groups pleasure is degrading, and no one should ever have to do that. I'd argue that yes, a lot of people still don't get this, and it obviously keeps happening and needs to be beat over some players heads. If you don't like the posts or want to live in your bubble where women don't deal with this in D&amp;D, scroll by, but fuck yeah it happens. Often. \n\nNow I have a group, and we have a no sexual situations role play rule, seduction for info, etc. is fine, as long as it doesn't cross the line, and it's awesome. It's made a huge difference knowing that's a table rule and won't happen again.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a female, I&amp;#39;m assuming you are not. The majority of games I&amp;#39;ve participated in over the years had times where I was sexualized inappropriately, the male characters never were, and my only option was to go along and keep playing, or quit. So, I&amp;#39;ve quit a lot of games. It&amp;#39;s not fragile, or weak, to realize you have no real out in a situation, no one cares you&amp;#39;re uncomfortable, so you quit. Not all sessions are fun for your character, but being forced to role play sexual situations for your groups pleasure is degrading, and no one should ever have to do that. I&amp;#39;d argue that yes, a lot of people still don&amp;#39;t get this, and it obviously keeps happening and needs to be beat over some players heads. If you don&amp;#39;t like the posts or want to live in your bubble where women don&amp;#39;t deal with this in D&amp;amp;D, scroll by, but fuck yeah it happens. Often. &lt;/p&gt;\n\n&lt;p&gt;Now I have a group, and we have a no sexual situations role play rule, seduction for info, etc. is fine, as long as it doesn&amp;#39;t cross the line, and it&amp;#39;s awesome. It&amp;#39;s made a huge difference knowing that&amp;#39;s a table rule and won&amp;#39;t happen again.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdke0l", "score_hidden": false, "stickied": false, "created": 1492469239.0, "created_utc": 1492440439.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdijcv", "gilded": 0, "archived": false, "score": -12, "report_reasons": null, "author": "Craios125", "parent_id": "t1_dgdglqa", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "&gt;Are they rare, or do people just not share them?\n\nYes, they are rare.\n\n&gt;plenty of women who would have just immediately given up on the game rather than go post the horrible story of their first experience.\n\nStop thinking females are so weak and easy to offend and fragile. Women are just as insightful as men, and most of them will understand that it's a problem with the people, not the game.\n\n&gt;let people know that the wider community isn't like this and doesn't approve\n\nJesus, my man. Do you honestly think that the wider community will read this? Or any of this? Or will ever visit this subreddit? No, this is just upvote baiting, nothing else.\n\nAlso, if you think that the \"wider community\" thinks D&amp;D is anything beyond \"*That one thing that nerds do*\", you're sorely mistaken. People don't give a fuck about it for reasons that aren't PC rape.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Are they rare, or do people just not share them?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, they are rare.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;plenty of women who would have just immediately given up on the game rather than go post the horrible story of their first experience.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Stop thinking females are so weak and easy to offend and fragile. Women are just as insightful as men, and most of them will understand that it&amp;#39;s a problem with the people, not the game.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;let people know that the wider community isn&amp;#39;t like this and doesn&amp;#39;t approve&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Jesus, my man. Do you honestly think that the wider community will read this? Or any of this? Or will ever visit this subreddit? No, this is just upvote baiting, nothing else.&lt;/p&gt;\n\n&lt;p&gt;Also, if you think that the &amp;quot;wider community&amp;quot; thinks D&amp;amp;D is anything beyond &amp;quot;&lt;em&gt;That one thing that nerds do&lt;/em&gt;&amp;quot;, you&amp;#39;re sorely mistaken. People don&amp;#39;t give a fuck about it for reasons that aren&amp;#39;t PC rape.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdijcv", "score_hidden": false, "stickied": false, "created": 1492466739.0, "created_utc": 1492437939.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdglqa", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "DarienDM", "parent_id": "t1_dgdfbj9", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Are they rare, or do people just not share them? The story of the DM whose player got chatted up by some asshole might not be one you m hear every day, but here are plenty of DMs out there who wouldn't have posted the story and plenty of women who would have just immediately given up on the game rather than go post the horrible story of their first experience.\n\nThe point of telling these stories is to bring the other stories out of the woodwork, and to let people know that the wider community isn't like this and doesn't approve. You may think it's rare, and it may be, but until we know people are comfortable telling their stories we won't know if this is only happening rarely or if it's only being talked about rarely because the offenders are driving people out of the hobby entirely before they have the investment necessary to overcome this assholery.", "edited": 1492435460.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are they rare, or do people just not share them? The story of the DM whose player got chatted up by some asshole might not be one you m hear every day, but here are plenty of DMs out there who wouldn&amp;#39;t have posted the story and plenty of women who would have just immediately given up on the game rather than go post the horrible story of their first experience.&lt;/p&gt;\n\n&lt;p&gt;The point of telling these stories is to bring the other stories out of the woodwork, and to let people know that the wider community isn&amp;#39;t like this and doesn&amp;#39;t approve. You may think it&amp;#39;s rare, and it may be, but until we know people are comfortable telling their stories we won&amp;#39;t know if this is only happening rarely or if it&amp;#39;s only being talked about rarely because the offenders are driving people out of the hobby entirely before they have the investment necessary to overcome this assholery.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdglqa", "score_hidden": false, "stickied": false, "created": 1492463743.0, "created_utc": 1492434943.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdilpu", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Craios125", "parent_id": "t1_dgdfky2", "subreddit_name_prefixed": "r/DnD", "controversiality": 1, "body": "Yes. Because these threads are pointless upvote-baiting, and *they fucking work.*\n\nNobody thinks this is the norm. Nobody. You have to be exceptionally near-sighted to not understand that it's a problem with the people, not the game, OR community.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. Because these threads are pointless upvote-baiting, and &lt;em&gt;they fucking work.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Nobody thinks this is the norm. Nobody. You have to be exceptionally near-sighted to not understand that it&amp;#39;s a problem with the people, not the game, OR community.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdilpu", "score_hidden": false, "stickied": false, "created": 1492466832.0, "created_utc": 1492438032.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfky2", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "DM_Cross", "parent_id": "t1_dgdfbj9", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I must have a long memory, then, because I normally see a few posts a week with the same topic. Or maybe we're looking at different views, as I think my page is defaulted to Hot and not New. Or maybe it's vice versa?\n\nEither way, the point is, unless we're arguing over a perception of what \"rare\" means, I disagree; These posts happen seemingly every week and like I said, from Friday to today, there were 3 at the top of my page.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I must have a long memory, then, because I normally see a few posts a week with the same topic. Or maybe we&amp;#39;re looking at different views, as I think my page is defaulted to Hot and not New. Or maybe it&amp;#39;s vice versa?&lt;/p&gt;\n\n&lt;p&gt;Either way, the point is, unless we&amp;#39;re arguing over a perception of what &amp;quot;rare&amp;quot; means, I disagree; These posts happen seemingly every week and like I said, from Friday to today, there were 3 at the top of my page.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdfky2", "score_hidden": false, "stickied": false, "created": 1492461940.0, "created_utc": 1492433140.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dge7v4n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RBomb19", "parent_id": "t1_dgdu9ff", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "The posts that are real are important. And short of a crystal ball, I don't have any way to know which ones are fake or real. I'd rather participate positively in the discussion either way rather than decry what has been acknowledged by industry figures and fellow gamers as a real problem in our community.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The posts that are real are important. And short of a crystal ball, I don&amp;#39;t have any way to know which ones are fake or real. I&amp;#39;d rather participate positively in the discussion either way rather than decry what has been acknowledged by industry figures and fellow gamers as a real problem in our community.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dge7v4n", "score_hidden": false, "stickied": false, "created": 1492496173.0, "created_utc": 1492467373.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdu9ff", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Craios125", "parent_id": "t1_dgdttbg", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I'm not. I am asking, in your opinion, how many of those posts are genuine. And like legitimately important.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not. I am asking, in your opinion, how many of those posts are genuine. And like legitimately important.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdu9ff", "score_hidden": false, "stickied": false, "created": 1492480512.0, "created_utc": 1492451712.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdttbg", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "RBomb19", "parent_id": "t1_dgdrfws", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I dont think there's an objective argument to be made when you're referring to people coming to this sub for help as lying triggered snowflakes.  \n  \nWe are talking about how people treat one another at the table, virtual or not. I fail to see how most of those examples apply.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I dont think there&amp;#39;s an objective argument to be made when you&amp;#39;re referring to people coming to this sub for help as lying triggered snowflakes.  &lt;/p&gt;\n\n&lt;p&gt;We are talking about how people treat one another at the table, virtual or not. I fail to see how most of those examples apply.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdttbg", "score_hidden": false, "stickied": false, "created": 1492480021.0, "created_utc": 1492451221.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrfws", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Craios125", "parent_id": "t1_dgdpg6p", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "It's a smaller part still that make this happen in the real world. I can barely remember any posts that actually said that their own personal friends became abusive while in game.\n\n&gt;Its a big reason why I stopped playing them.\n\nSee, and here's the strong suite of D&amp;D: you can **actually choose who to play with, because it doesn't have matchmaking.**\n\n&gt;You don't need to have thin skin to just want to be treated halfway decently by other human beings when trying to have a good time.\n\nOoh \"**halfway decently**\". Such strong words. Such a folly of mankind.\n\nMate, tell me, but like as objectively as you can, how many of those posts are, in your opinion, made by overly sensitive snowflakes, and the type of people who are offended at an actress showing some skin? Or people who just get fully triggered when a nerd plays Blade &amp; Soul or Tera as a female character? Or when they hear the words containing \"*sex*\" in them?\n\nP.S. Oh and I remembered something else. I 100% know that some of those posts are literally lies made for upvote baiting, as OPs of those posts have contacted me myself. So keep that in mind, too. Where there's a lot of backpatting, there will be fake victims, too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a smaller part still that make this happen in the real world. I can barely remember any posts that actually said that their own personal friends became abusive while in game.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Its a big reason why I stopped playing them.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;See, and here&amp;#39;s the strong suite of D&amp;amp;D: you can &lt;strong&gt;actually choose who to play with, because it doesn&amp;#39;t have matchmaking.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You don&amp;#39;t need to have thin skin to just want to be treated halfway decently by other human beings when trying to have a good time.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ooh &amp;quot;&lt;strong&gt;halfway decently&lt;/strong&gt;&amp;quot;. Such strong words. Such a folly of mankind.&lt;/p&gt;\n\n&lt;p&gt;Mate, tell me, but like as objectively as you can, how many of those posts are, in your opinion, made by overly sensitive snowflakes, and the type of people who are offended at an actress showing some skin? Or people who just get fully triggered when a nerd plays Blade &amp;amp; Soul or Tera as a female character? Or when they hear the words containing &amp;quot;&lt;em&gt;sex&lt;/em&gt;&amp;quot; in them?&lt;/p&gt;\n\n&lt;p&gt;P.S. Oh and I remembered something else. I 100% know that some of those posts are literally lies made for upvote baiting, as OPs of those posts have contacted me myself. So keep that in mind, too. Where there&amp;#39;s a lot of backpatting, there will be fake victims, too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdrfws", "score_hidden": false, "stickied": false, "created": 1492477390.0, "created_utc": 1492448590.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdpg6p", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "RBomb19", "parent_id": "t1_dgdorxd", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Well a lot of these posts are talking about real world interaction which is when it's way harder and infinitely more important to address these problems.  \n  \nAnd I have played games with extremely toxic communities. Its a big reason why I stopped playing them. I dont enjoy spending my time with a bunch of assholes.  \n  \nYou don't need to have thin skin to just want to be treated halfway decently by other human beings when trying to have a good time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well a lot of these posts are talking about real world interaction which is when it&amp;#39;s way harder and infinitely more important to address these problems.  &lt;/p&gt;\n\n&lt;p&gt;And I have played games with extremely toxic communities. Its a big reason why I stopped playing them. I dont enjoy spending my time with a bunch of assholes.  &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t need to have thin skin to just want to be treated halfway decently by other human beings when trying to have a good time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdpg6p", "score_hidden": false, "stickied": false, "created": 1492475182.0, "created_utc": 1492446382.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdorxd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Craios125", "parent_id": "t1_dgdn5ru", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Phew. Here we go.\n\nHave you ever played an online game? Ever? Any game at all? Overwatch, Counter Strike 1.6, CS:GO, Team Fortress 2, Archeage, Final Fantasy 14, World of Warcraft, whatever?\n\nEVERY SINGLE GAME that has PLAYER INTERACTION, that is also ANONYMOUS (if you're playing D&amp;D online) **will have some sort of sexual jokes, remarks, humor, or even voiced abuse**.\n\nIt doesn't put a terrible spotlight on anything. It's just how people fucking are. If you don't like it - find a safe space with a group of people that are likeminded, and you won't encounter it - problem solved.\n\nThere's a reason why online interactions are never rated. Because they're impossible to rate objectively.\n\nHow do posts like these empower anyone whatsoever? It's a circlejerk is what it is. Grow up, realize people can be dicks sometimes and move on with your life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Phew. Here we go.&lt;/p&gt;\n\n&lt;p&gt;Have you ever played an online game? Ever? Any game at all? Overwatch, Counter Strike 1.6, CS:GO, Team Fortress 2, Archeage, Final Fantasy 14, World of Warcraft, whatever?&lt;/p&gt;\n\n&lt;p&gt;EVERY SINGLE GAME that has PLAYER INTERACTION, that is also ANONYMOUS (if you&amp;#39;re playing D&amp;amp;D online) &lt;strong&gt;will have some sort of sexual jokes, remarks, humor, or even voiced abuse&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t put a terrible spotlight on anything. It&amp;#39;s just how people fucking are. If you don&amp;#39;t like it - find a safe space with a group of people that are likeminded, and you won&amp;#39;t encounter it - problem solved.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a reason why online interactions are never rated. Because they&amp;#39;re impossible to rate objectively.&lt;/p&gt;\n\n&lt;p&gt;How do posts like these empower anyone whatsoever? It&amp;#39;s a circlejerk is what it is. Grow up, realize people can be dicks sometimes and move on with your life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdorxd", "score_hidden": false, "stickied": false, "created": 1492474428.0, "created_utc": 1492445628.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdn5ru", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "RBomb19", "parent_id": "t1_dgdfbj9", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "It doesn't matter if it's as rare as you seem to think it is. Shit like this ever happening puts a terrible spotlight on our community and posts like the harassment story empower players to stand up for each other.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It doesn&amp;#39;t matter if it&amp;#39;s as rare as you seem to think it is. Shit like this ever happening puts a terrible spotlight on our community and posts like the harassment story empower players to stand up for each other.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdn5ru", "score_hidden": false, "stickied": false, "created": 1492472582.0, "created_utc": 1492443782.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdjbhu", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "TheHappyLingcod", "parent_id": "t1_dgdij4l", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Emotional tactics, hum! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Emotional tactics, hum! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdjbhu", "score_hidden": false, "stickied": false, "created": 1492467823.0, "created_utc": 1492439023.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdij4l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DeathEatsCurry", "parent_id": "t1_dgdg0da", "subreddit_name_prefixed": "r/DnD", "controversiality": 1, "body": "Negativity bias, Ho! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Negativity bias, Ho! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdij4l", "score_hidden": false, "stickied": false, "created": 1492466730.0, "created_utc": 1492437930.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdikl2", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Craios125", "parent_id": "t1_dgdg0da", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Pretty much, yeah.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pretty much, yeah.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdikl2", "score_hidden": false, "stickied": false, "created": 1492466787.0, "created_utc": 1492437987.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdg0da", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Huscarl81", "parent_id": "t1_dgdfbj9", "subreddit_name_prefixed": "r/DnD", "controversiality": 1, "body": "There's 250,000+ people subscribed just to this sub and millions playing. The amount of horror stories involves what probably amount to a statistically insignificant percentage of games out there. The stories do suck, and give something to consider. But just like the TV news are sensational. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s 250,000+ people subscribed just to this sub and millions playing. The amount of horror stories involves what probably amount to a statistically insignificant percentage of games out there. The stories do suck, and give something to consider. But just like the TV news are sensational. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdg0da", "score_hidden": false, "stickied": false, "created": 1492462717.0, "created_utc": 1492433917.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdid4b", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Craios125", "parent_id": "t1_dgdhuqk", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Exactly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdid4b", "score_hidden": false, "stickied": false, "created": 1492466487.0, "created_utc": 1492437687.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdhuqk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ACBluto", "parent_id": "t1_dgdfbj9", "subreddit_name_prefixed": "r/DnD", "controversiality": 1, "body": "Plus, like any sub, people only come to post when they need help, or to show cool things they did. Tens of thousands of perfectly average, enjoyable games happen every night, but there's not much to post on those. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Plus, like any sub, people only come to post when they need help, or to show cool things they did. Tens of thousands of perfectly average, enjoyable games happen every night, but there&amp;#39;s not much to post on those. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdhuqk", "score_hidden": false, "stickied": false, "created": 1492465722.0, "created_utc": 1492436922.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfbj9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Craios125", "parent_id": "t3_65v6bw", "subreddit_name_prefixed": "r/DnD", "controversiality": 1, "body": "&gt;When did we stop playing the game to have fun and stop giving a damn about the other people at the table?\n\nNever. You're overreacting. The stories shared are rare as all fuck, and represent a miserably small minority of the community.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;When did we stop playing the game to have fun and stop giving a damn about the other people at the table?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Never. You&amp;#39;re overreacting. The stories shared are rare as all fuck, and represent a miserably small minority of the community.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdfbj9", "score_hidden": false, "stickied": false, "created": 1492461436.0, "created_utc": 1492432636.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdqjel", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wisdumb", "parent_id": "t3_65v6bw", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "What if I truly hate the person that plays the warlock in the party?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What if I truly hate the person that plays the warlock in the party?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdqjel", "score_hidden": false, "stickied": false, "created": 1492476388.0, "created_utc": 1492447588.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdvtuw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mcbobboreddit", "parent_id": "t3_65v6bw", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Well put OP.  We need to assume the best in others and treat one another like we would want to be treated.  Basic human decency stuff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well put OP.  We need to assume the best in others and treat one another like we would want to be treated.  Basic human decency stuff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdvtuw", "score_hidden": false, "stickied": false, "created": 1492482252.0, "created_utc": 1492453452.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dge6s73", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OneFallsAnotherYalls", "parent_id": "t3_65v6bw", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "The only way to keep a dnd group from falling into creep territory is to rule it with an iron fist. Nerds can't be trusted not to fuck everything up. The second anyone steps out of line, player or dm, the game has to be stopped and the offending party must be removed. Give them a second chance, maybe, but not a third. I can't count how many people I've banned from the store I dm for (the roleplsying rooms, not the store in general) for gross or creepy behavior. Every time we get somebody new, especially women or people who aren't white, we get compliments about how inclusive and safe the store is, and we wouldn't get there without removing the mouth breathers like they're cockroaches.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only way to keep a dnd group from falling into creep territory is to rule it with an iron fist. Nerds can&amp;#39;t be trusted not to fuck everything up. The second anyone steps out of line, player or dm, the game has to be stopped and the offending party must be removed. Give them a second chance, maybe, but not a third. I can&amp;#39;t count how many people I&amp;#39;ve banned from the store I dm for (the roleplsying rooms, not the store in general) for gross or creepy behavior. Every time we get somebody new, especially women or people who aren&amp;#39;t white, we get compliments about how inclusive and safe the store is, and we wouldn&amp;#39;t get there without removing the mouth breathers like they&amp;#39;re cockroaches.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dge6s73", "score_hidden": false, "stickied": false, "created": 1492494822.0, "created_utc": 1492466022.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdhqaj", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "BonusVir", "parent_id": "t1_dgdh277", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "That should be a thing", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That should be a thing&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdhqaj", "score_hidden": false, "stickied": false, "created": 1492465531.0, "created_utc": 1492436731.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdi2wx", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Cazmeister44", "parent_id": "t1_dgdh277", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I wholeheartedly disagree. People should talk about this kind of thing, it creates a culture of calling people out when they try and pull this bullshit. That's worth having a few disheartening stories amongst all the incredible art and awesome tales on this sub imo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wholeheartedly disagree. People should talk about this kind of thing, it creates a culture of calling people out when they try and pull this bullshit. That&amp;#39;s worth having a few disheartening stories amongst all the incredible art and awesome tales on this sub imo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdi2wx", "score_hidden": false, "stickied": false, "created": 1492466070.0, "created_utc": 1492437270.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdzo6j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "PennyPriddy", "parent_id": "t1_dgdh277", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "I don't know, if you're new to the hobby and hurt or frustrated and don't know if something is normal, this will probably be the first sub you find. People like that should feel like they're allowed to look for help or validation here without being chastised for putting it in the wrong place.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know, if you&amp;#39;re new to the hobby and hurt or frustrated and don&amp;#39;t know if something is normal, this will probably be the first sub you find. People like that should feel like they&amp;#39;re allowed to look for help or validation here without being chastised for putting it in the wrong place.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdzo6j", "score_hidden": false, "stickied": false, "created": 1492486616.0, "created_utc": 1492457816.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdh277", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "Kaarous", "parent_id": "t3_65v6bw", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "Seriously.  This is not r/DnDOffMyChest, and it's freaking tiresome to see the sub flooded with it all the time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seriously.  This is not &lt;a href=\"/r/DnDOffMyChest\"&gt;r/DnDOffMyChest&lt;/a&gt;, and it&amp;#39;s freaking tiresome to see the sub flooded with it all the time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdh277", "score_hidden": false, "stickied": false, "created": 1492464480.0, "created_utc": 1492435680.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdxzh0", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "SteveAkaGod", "parent_id": "t3_65v6bw", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "We'll complain if we want to!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;ll complain if we want to!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdxzh0", "score_hidden": false, "stickied": false, "created": 1492484691.0, "created_utc": 1492455891.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r9ei", "removal_reason": null, "link_id": "t3_65v6bw", "likes": null, "replies": "", "user_reports": [], "id": "dgdfgvg", "gilded": 0, "archived": false, "score": -7, "report_reasons": null, "author": "DemonZek", "parent_id": "t3_65v6bw", "subreddit_name_prefixed": "r/DnD", "controversiality": 0, "body": "This counts as rant?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This counts as rant?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DnD", "name": "t1_dgdfgvg", "score_hidden": false, "stickied": false, "created": 1492461720.0, "created_utc": 1492432920.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -7}}], "after": null, "before": null}}]