[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "wicked_edge", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64tg4r", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "TheBoed9000", "saved": false, "mod_reports": [], "name": "t3_64tg4r", "subreddit_name_prefixed": "r/wicked_edge", "approved_by": null, "over_18": false, "domain": "i.redd.it", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/kZ6QqIOVIX1kSJaHP3PQBlT-RfVU0LSm3WRNQpOpPbI.jpg?s=553c7b23bde2599c8c6ce43ec9e0dffd", "width": 4032, "height": 3024}, "resolutions": [{"url": "https://i.redditmedia.com/kZ6QqIOVIX1kSJaHP3PQBlT-RfVU0LSm3WRNQpOpPbI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=6fe11e1e3dc00c57173533b6256f58fa", "width": 108, "height": 81}, {"url": "https://i.redditmedia.com/kZ6QqIOVIX1kSJaHP3PQBlT-RfVU0LSm3WRNQpOpPbI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=f9ad7c150999b5bb68b8001a8a0d37a9", "width": 216, "height": 162}, {"url": "https://i.redditmedia.com/kZ6QqIOVIX1kSJaHP3PQBlT-RfVU0LSm3WRNQpOpPbI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=1faf8e2ac44e365781d6ee69e65e3053", "width": 320, "height": 240}, {"url": "https://i.redditmedia.com/kZ6QqIOVIX1kSJaHP3PQBlT-RfVU0LSm3WRNQpOpPbI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=5c5e0d784891afc807cef1d1805199ba", "width": 640, "height": 480}, {"url": "https://i.redditmedia.com/kZ6QqIOVIX1kSJaHP3PQBlT-RfVU0LSm3WRNQpOpPbI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=86619bea71a26868d2f19aa18e50187d", "width": 960, "height": 720}, {"url": "https://i.redditmedia.com/kZ6QqIOVIX1kSJaHP3PQBlT-RfVU0LSm3WRNQpOpPbI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=dcc4720d200103c5ec30d1a6384d0523", "width": 1080, "height": 810}], "variants": {}, "id": "id5gET64hP2zm6Kv7lZW1Joa7ObbD7-ouW2sWDelpGU"}], "enabled": true}, "thumbnail": "https://b.thumbs.redditmedia.com/e68zUXYJ_JO-dqv5lZKH0ZH15Px4hCN2wW8FrCXfsnc.jpg", "subreddit_id": "t5_2s46m", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "2", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "image", "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/wicked_edge/comments/64tg4r/sotd_41117_castle_forbes_cedarwood_and_sandalwood/", "num_reports": null, "locked": false, "stickied": false, "created": 1491970919.0, "url": "https://i.redd.it/1loserpagzqy.jpg", "author_flair_text": "witch hazel apostle", "quarantine": false, "title": "SOTD 4/11/17 Castle Forbes Cedarwood and Sandalwood", "created_utc": 1491942119.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_64tg4r", "likes": null, "replies": "", "user_reports": [], "id": "dg4v16r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheBoed9000", "parent_id": "t3_64tg4r", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "SOTD 4/11/17 \n\nPre:  Hot shower and glycerin soap  \nRazor: Rockwell 6s with 4/2 plate  \nBlade: brand-new Astra Green  \nSoap: Castle Forbes Cedarwood &amp; Sandalwood Cream  \nPost: Witch hazel splash and CF Cedarwood &amp; Sandalwood balm  \n\nThe last few days have been pretty hectic, and I hadn't had time to shave since the early morning of Sunday.  Usually I shave daily, both for work and as a relaxing treat to myself; so this was quite unusual.  I ended up getting the chance to use the 4 plate on my Rockwell for the WTG/ATG passes, which I rarely get to do.  \n\nThe Castle Forbes cream and balm came in a thank-you pack from my brother after I finally got him into wetshaving.  He sent me the software seen above as well as CF Limes cream and balm, Dapper Dragon Jasmine and Vanilla, and Dr. Jon's Arctic Hydra.  (He's a quite generous guy!)  I haven't used the Castle Forbes stuff much because it seems like a waste to hurry through a shave with such a luxurious product.  I've mentioned before that Castle Forbes makes good stuff and that it's more cost-effective than people give credit due to how little product is needed to get a good lather.  Castle Forbes creams really look to me to be super soft soaps rather than actual creams and I load them like soaps directly from the container; as opposed to my usual practice with creams to take a knurdle and slip it into a wet brush before face-lathering.  Performance-wise, CF product is some of the best in the business with excellent protection as well as great postshave feel.  It really does feel like my skin is ten years younger after shaving with it.  \n\nThe Kent BK8 is a brush I bought lightly-used on the shave bazaar here.  It's served me decently enough, but lacks the backbone I prefer in my brushes so I reach for a synthetic or boar more often.  (I grew up on boar brushes, so these high-end badgers all seem pretty limp to me.)  It's incredibly, impossibly soft at the tips though, so it's my preferred brush in the rare case of using a cream.  I think this brush used with a cream gives me an accurate experience of a traditional English gentlemanly shave.  The knot holds tons of lather!  I had enough for perhaps six passes from a quick couple of swirls in the tub.  On harder soaps I notice it sheds a hair or two still, but I can't remember any shed during this shave.  All in all I probably wouldn't have purchased one of these puppies new, but picking up one used and cleaning it well worked out nicely.  \n\nThe Rockwell I've mentioned quite a few times on this forum.  It's a great razor!  I'll avoid rehashing my praise for it, except to note that it was a birthday present from my wife which I will use daily for probably the rest of my life, and be able to pass on to...well I've got all girls but odds are one of them will give me a grandson some day right? :)  \n\nThe Castle Forbes balms are also excellent performers, and I find myself using the balms more often than their matching soaps.  They use all essential oils (rather than fragrance oils) for their scent, and obviously pair perfectly with their matching soaps.  The Lime scent is actually so appealing my teenage daughter made a habit of sneaking into the master bathroom to steal some for her fingers...I ended up giving her a bottle of her own for a stocking-stuffer during Christmas.  Cedarwood and Sandalwood isn't my favorite scent out there - I prefer the scent to B&amp;M Taiga or DD Green Dragon for woodsy scents - but there is nothing wrong with it, and it's hard to argue with the performance of the balm.  (Lime, however, is just short of heaven.)  \n\nFinally, I've got to mention my green Marvy mug.  This thing is almost as old as my wetshaving experience.  It's seen multiple states, three continents, and more shaves than I could count; and it's still going strong.  I use it as a supply of hot water for dipping my brush as well as a clean place to rest my razor when travelling.  ", "edited": 1491944280.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;SOTD 4/11/17 &lt;/p&gt;\n\n&lt;p&gt;Pre:  Hot shower and glycerin soap&lt;br/&gt;\nRazor: Rockwell 6s with 4/2 plate&lt;br/&gt;\nBlade: brand-new Astra Green&lt;br/&gt;\nSoap: Castle Forbes Cedarwood &amp;amp; Sandalwood Cream&lt;br/&gt;\nPost: Witch hazel splash and CF Cedarwood &amp;amp; Sandalwood balm  &lt;/p&gt;\n\n&lt;p&gt;The last few days have been pretty hectic, and I hadn&amp;#39;t had time to shave since the early morning of Sunday.  Usually I shave daily, both for work and as a relaxing treat to myself; so this was quite unusual.  I ended up getting the chance to use the 4 plate on my Rockwell for the WTG/ATG passes, which I rarely get to do.  &lt;/p&gt;\n\n&lt;p&gt;The Castle Forbes cream and balm came in a thank-you pack from my brother after I finally got him into wetshaving.  He sent me the software seen above as well as CF Limes cream and balm, Dapper Dragon Jasmine and Vanilla, and Dr. Jon&amp;#39;s Arctic Hydra.  (He&amp;#39;s a quite generous guy!)  I haven&amp;#39;t used the Castle Forbes stuff much because it seems like a waste to hurry through a shave with such a luxurious product.  I&amp;#39;ve mentioned before that Castle Forbes makes good stuff and that it&amp;#39;s more cost-effective than people give credit due to how little product is needed to get a good lather.  Castle Forbes creams really look to me to be super soft soaps rather than actual creams and I load them like soaps directly from the container; as opposed to my usual practice with creams to take a knurdle and slip it into a wet brush before face-lathering.  Performance-wise, CF product is some of the best in the business with excellent protection as well as great postshave feel.  It really does feel like my skin is ten years younger after shaving with it.  &lt;/p&gt;\n\n&lt;p&gt;The Kent BK8 is a brush I bought lightly-used on the shave bazaar here.  It&amp;#39;s served me decently enough, but lacks the backbone I prefer in my brushes so I reach for a synthetic or boar more often.  (I grew up on boar brushes, so these high-end badgers all seem pretty limp to me.)  It&amp;#39;s incredibly, impossibly soft at the tips though, so it&amp;#39;s my preferred brush in the rare case of using a cream.  I think this brush used with a cream gives me an accurate experience of a traditional English gentlemanly shave.  The knot holds tons of lather!  I had enough for perhaps six passes from a quick couple of swirls in the tub.  On harder soaps I notice it sheds a hair or two still, but I can&amp;#39;t remember any shed during this shave.  All in all I probably wouldn&amp;#39;t have purchased one of these puppies new, but picking up one used and cleaning it well worked out nicely.  &lt;/p&gt;\n\n&lt;p&gt;The Rockwell I&amp;#39;ve mentioned quite a few times on this forum.  It&amp;#39;s a great razor!  I&amp;#39;ll avoid rehashing my praise for it, except to note that it was a birthday present from my wife which I will use daily for probably the rest of my life, and be able to pass on to...well I&amp;#39;ve got all girls but odds are one of them will give me a grandson some day right? :)  &lt;/p&gt;\n\n&lt;p&gt;The Castle Forbes balms are also excellent performers, and I find myself using the balms more often than their matching soaps.  They use all essential oils (rather than fragrance oils) for their scent, and obviously pair perfectly with their matching soaps.  The Lime scent is actually so appealing my teenage daughter made a habit of sneaking into the master bathroom to steal some for her fingers...I ended up giving her a bottle of her own for a stocking-stuffer during Christmas.  Cedarwood and Sandalwood isn&amp;#39;t my favorite scent out there - I prefer the scent to B&amp;amp;M Taiga or DD Green Dragon for woodsy scents - but there is nothing wrong with it, and it&amp;#39;s hard to argue with the performance of the balm.  (Lime, however, is just short of heaven.)  &lt;/p&gt;\n\n&lt;p&gt;Finally, I&amp;#39;ve got to mention my green Marvy mug.  This thing is almost as old as my wetshaving experience.  It&amp;#39;s seen multiple states, three continents, and more shaves than I could count; and it&amp;#39;s still going strong.  I use it as a supply of hot water for dipping my brush as well as a clean place to rest my razor when travelling.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dg4v16r", "score_hidden": false, "stickied": false, "created": 1491971006.0, "created_utc": 1491942206.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]