[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "wicked_edge", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For the last year or so, I&amp;#39;ve been almost exclusively using vintage razors to shave, mostly Gillettes. I have nothing particularly against modern razors, but I very much enjoy the older ones. I felt like putting some thoughts down about them, in case others might be interested in an admittedly non-comprehensive review. The razors mentioned below will tend to be commonly found in flea markets or antique stores, and if you&amp;#39;re looking into starting with vintage razors these are the most likely starting possibilities. And of course these are only my opinions, and your experiences will vary, as will the availability of these razors based on where you&amp;#39;re shopping.&lt;/p&gt;\n\n&lt;p&gt;To begin, my favorites are the twist-to-open Gillette Super Speeds. I&amp;#39;ve used all variations of this razor, and I believe it combines comfort, efficiency, and aesthetics perfectly. Plus, you can almost always find at least one Super Speed at a flea market. &lt;/p&gt;\n\n&lt;p&gt;Some Super Speed examples: &lt;a href=\"http://imgur.com/UzhcKCN\"&gt;http://imgur.com/UzhcKCN&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The 40s style Super Speed is often described as a classic, but this one is my least favorite. Although many prefer the simple design, I find this one to be a bit boring looking. Additionally, the handles feel less &amp;quot;grippy&amp;quot; to me (Please note that all Super Speeds give truly exceptional shaves, so much of this comes to personal preference. These are cheap enough and generally easy enough to find that you can experiment). This razor is, I find, medium to low aggression. &lt;/p&gt;\n\n&lt;p&gt;I think the 50s style Flare Tips are amazing. They&amp;#39;re beautiful, and the options of blue, silver, and red tips give you a variety of choice in aggressiveness. I find the blue to be a mild razor, with the silver to be the standard Gillette, with the red to be intense but still gentle on the skin. I actually just started using a red tip and it&amp;#39;s maybe my new favorite of all time. It cuts the stubble like a weed whacker, but I&amp;#39;ve somehow still gotten more comfortable shaves with it than any other razor. &lt;/p&gt;\n\n&lt;p&gt;Late 60s style Super Speeds (up through the 80s) started having black handles, and shorter, more ergonomic heads. These are also lovely, and are great for getting around the troublesome areas. They shave comparably to the other Super Speeds, and I think the black handles are pretty slick looking. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re looking for a vintage razor, I can wholeheartedly recommend one of the Super Speeds as a starting place. &lt;/p&gt;\n\n&lt;p&gt;Also very, very common are Gillette Techs. These could be found throughout much of the 20th Century, and consequently can be found regularly in flea markets or especially in antique stores. Although Fat Handle Techs seem to be a little larger and heavier, I&amp;#39;ve honestly never been able to tell the difference in the shave between a Fat Handle or a Ball End. These razors are extremely mild, and while they&amp;#39;re comfortable I find that they sometimes can struggle to remove all the hair in a reasonable number of passes. However, I still find myself using a gold-plated Fat Handle Tech in a semi-regular basis, because it&amp;#39;s somewhat pleasant to use.&lt;/p&gt;\n\n&lt;p&gt;A Fat Handle Tech in a not-pretty, user condition: &lt;a href=\"http://imgur.com/fU4Eopa\"&gt;http://imgur.com/fU4Eopa&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not too uncommon to find older Gillettes, such as the Old Type, New, etc, in antique stores. I find these to be similar to the Techs, but slightly more aggressive. &lt;/p&gt;\n\n&lt;p&gt;Gillette adjustables are less commonly found in the wild in useable condition (and they&amp;#39;re getting more expensive), but I have to particularly give a mention to the later model black handled Super Speed Super Adjustable. This razor, I believe, combines the excellence of the Super Speed with the adjustment dial of the rarer and more expensive Fatboy or Slim Adjustables. I think, if you&amp;#39;re looking for an adjustable, that the Super Adjustable is a great choice.&lt;/p&gt;\n\n&lt;p&gt;A Super Adjustable: &lt;a href=\"http://imgur.com/aKgUlw5\"&gt;http://imgur.com/aKgUlw5&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Getting away from Gillettes, if you&amp;#39;re at all like me you&amp;#39;ll be running into single edge razors everywhere. I actually have a drawer full of single edges for some reason. You can find Gems and Ever-Readys pretty commonly, and they&amp;#39;re generally identical. These tend to be supremely aggressive shaves, but they have a real charm. If you&amp;#39;re looking for auditory feedback, these are for you. I use these occasionally, and I know that they have their dedicated users, but since the blade angle is incredibly different than with a double edge I tend to use these much less than my Gillettes. However, I think that their designs are amazing. Note that you&amp;#39;ll have fewer choices of blades with these, though. &lt;/p&gt;\n\n&lt;p&gt;A Gem: &lt;a href=\"http://imgur.com/YuD97qT\"&gt;http://imgur.com/YuD97qT&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll sometimes see Schicks as well. To me, their design makes them very difficult to clean and sanitize to be happy with using, so I don&amp;#39;t use these razors, but I understand that they have their fans as well. &lt;/p&gt;\n\n&lt;p&gt;That, I believe, generally covers the common vintage razors you&amp;#39;ll find. You may see others as well, and good for you! Snap them up because they&amp;#39;re more rare (like this Criterion De Luxe Chromium from 1930 that&amp;#39;s one of the stars of my collection &lt;a href=\"http://imgur.com/qjoFN5T\"&gt;http://imgur.com/qjoFN5T&lt;/a&gt;). The other razors mentioned above are reasonably easy to find, though. Go to a flea market and look in booths that specialize in &amp;quot;smalls&amp;quot; (little knick knack antiques) and you&amp;#39;ll be able to find at least one of these on almost every trip, and often for a cheaper price than modern razors. &lt;/p&gt;\n\n&lt;p&gt;Enjoy your vintage shaves!&lt;/p&gt;\n\n&lt;p&gt;Edit-typo&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "For the last year or so, I've been almost exclusively using vintage razors to shave, mostly Gillettes. I have nothing particularly against modern razors, but I very much enjoy the older ones. I felt like putting some thoughts down about them, in case others might be interested in an admittedly non-comprehensive review. The razors mentioned below will tend to be commonly found in flea markets or antique stores, and if you're looking into starting with vintage razors these are the most likely starting possibilities. And of course these are only my opinions, and your experiences will vary, as will the availability of these razors based on where you're shopping.\n\n\nTo begin, my favorites are the twist-to-open Gillette Super Speeds. I've used all variations of this razor, and I believe it combines comfort, efficiency, and aesthetics perfectly. Plus, you can almost always find at least one Super Speed at a flea market. \n\nSome Super Speed examples: http://imgur.com/UzhcKCN\n\n\nThe 40s style Super Speed is often described as a classic, but this one is my least favorite. Although many prefer the simple design, I find this one to be a bit boring looking. Additionally, the handles feel less \"grippy\" to me (Please note that all Super Speeds give truly exceptional shaves, so much of this comes to personal preference. These are cheap enough and generally easy enough to find that you can experiment). This razor is, I find, medium to low aggression. \n\n\nI think the 50s style Flare Tips are amazing. They're beautiful, and the options of blue, silver, and red tips give you a variety of choice in aggressiveness. I find the blue to be a mild razor, with the silver to be the standard Gillette, with the red to be intense but still gentle on the skin. I actually just started using a red tip and it's maybe my new favorite of all time. It cuts the stubble like a weed whacker, but I've somehow still gotten more comfortable shaves with it than any other razor. \n\n\nLate 60s style Super Speeds (up through the 80s) started having black handles, and shorter, more ergonomic heads. These are also lovely, and are great for getting around the troublesome areas. They shave comparably to the other Super Speeds, and I think the black handles are pretty slick looking. \n\n\nIf you're looking for a vintage razor, I can wholeheartedly recommend one of the Super Speeds as a starting place. \n\n\nAlso very, very common are Gillette Techs. These could be found throughout much of the 20th Century, and consequently can be found regularly in flea markets or especially in antique stores. Although Fat Handle Techs seem to be a little larger and heavier, I've honestly never been able to tell the difference in the shave between a Fat Handle or a Ball End. These razors are extremely mild, and while they're comfortable I find that they sometimes can struggle to remove all the hair in a reasonable number of passes. However, I still find myself using a gold-plated Fat Handle Tech in a semi-regular basis, because it's somewhat pleasant to use.\n\nA Fat Handle Tech in a not-pretty, user condition: http://imgur.com/fU4Eopa\n\n\nIt's not too uncommon to find older Gillettes, such as the Old Type, New, etc, in antique stores. I find these to be similar to the Techs, but slightly more aggressive. \n\n\nGillette adjustables are less commonly found in the wild in useable condition (and they're getting more expensive), but I have to particularly give a mention to the later model black handled Super Speed Super Adjustable. This razor, I believe, combines the excellence of the Super Speed with the adjustment dial of the rarer and more expensive Fatboy or Slim Adjustables. I think, if you're looking for an adjustable, that the Super Adjustable is a great choice.\n\nA Super Adjustable: http://imgur.com/aKgUlw5\n\n\nGetting away from Gillettes, if you're at all like me you'll be running into single edge razors everywhere. I actually have a drawer full of single edges for some reason. You can find Gems and Ever-Readys pretty commonly, and they're generally identical. These tend to be supremely aggressive shaves, but they have a real charm. If you're looking for auditory feedback, these are for you. I use these occasionally, and I know that they have their dedicated users, but since the blade angle is incredibly different than with a double edge I tend to use these much less than my Gillettes. However, I think that their designs are amazing. Note that you'll have fewer choices of blades with these, though. \n\nA Gem: http://imgur.com/YuD97qT\n\n\nYou'll sometimes see Schicks as well. To me, their design makes them very difficult to clean and sanitize to be happy with using, so I don't use these razors, but I understand that they have their fans as well. \n\n\nThat, I believe, generally covers the common vintage razors you'll find. You may see others as well, and good for you! Snap them up because they're more rare (like this Criterion De Luxe Chromium from 1930 that's one of the stars of my collection http://imgur.com/qjoFN5T). The other razors mentioned above are reasonably easy to find, though. Go to a flea market and look in booths that specialize in \"smalls\" (little knick knack antiques) and you'll be able to find at least one of these on almost every trip, and often for a cheaper price than modern razors. \n\n\nEnjoy your vintage shaves!\n\nEdit-typo", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65zi4p", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 35, "report_reasons": null, "author": "Boom-dog", "saved": false, "mod_reports": [], "name": "t3_65zi4p", "subreddit_name_prefixed": "r/wicked_edge", "approved_by": null, "over_18": false, "domain": "self.wicked_edge", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/kQHMOremVPlki8zDciHN_ppV-cEi0wwQGPZ2cjivIEo.jpg?s=768a1c699f3293ae1d66535c196e1538", "width": 3264, "height": 2448}, "resolutions": [{"url": "https://i.redditmedia.com/kQHMOremVPlki8zDciHN_ppV-cEi0wwQGPZ2cjivIEo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=e64bda3d4eb45d2373816107339599cc", "width": 108, "height": 81}, {"url": "https://i.redditmedia.com/kQHMOremVPlki8zDciHN_ppV-cEi0wwQGPZ2cjivIEo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=2e6607930b8be16dc5f7bc87b1e17a4a", "width": 216, "height": 162}, {"url": "https://i.redditmedia.com/kQHMOremVPlki8zDciHN_ppV-cEi0wwQGPZ2cjivIEo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=a11f604e5d8e956d928ec8ccae0c9ec5", "width": 320, "height": 240}, {"url": "https://i.redditmedia.com/kQHMOremVPlki8zDciHN_ppV-cEi0wwQGPZ2cjivIEo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=975ec794672b8934724c3e67ca5d5e5a", "width": 640, "height": 480}, {"url": "https://i.redditmedia.com/kQHMOremVPlki8zDciHN_ppV-cEi0wwQGPZ2cjivIEo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=dceb9cb0e67c0f297b8dc557e526ae1c", "width": 960, "height": 720}, {"url": "https://i.redditmedia.com/kQHMOremVPlki8zDciHN_ppV-cEi0wwQGPZ2cjivIEo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=ceefc21fc99aeba75c97abc8348f5ea8", "width": 1080, "height": 810}], "variants": {}, "id": "QIJ_VomEjG3YbeiDGxTXh8eYuFhILfv2LRAzaQHH2JI"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2s46m", "edited": 1492486837.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/wicked_edge/comments/65zi4p/thoughts_on_the_common_vintage_razors_mostly/", "num_reports": null, "locked": false, "stickied": false, "created": 1492503995.0, "url": "https://www.reddit.com/r/wicked_edge/comments/65zi4p/thoughts_on_the_common_vintage_razors_mostly/", "author_flair_text": null, "quarantine": false, "title": "Thoughts on the Common Vintage Razors, Mostly Gillettes", "created_utc": 1492475195.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 19, "visited": false, "subreddit_type": "public", "ups": 35}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": "", "user_reports": [], "id": "dgezk7u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DrRobb", "parent_id": "t1_dgei3z5", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "The Micromatic isn't nicknamed \"The Beast\" for nothing.. Tends to be very aggressive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Micromatic isn&amp;#39;t nicknamed &amp;quot;The Beast&amp;quot; for nothing.. Tends to be very aggressive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgezk7u", "score_hidden": false, "stickied": false, "created": 1492544231.0, "created_utc": 1492515431.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgei3z5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Boom-dog", "parent_id": "t1_dgeho96", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "I think that Gems are beautiful, they just look so nouveau. They're kind of fun to use, too.\n\n\nI want to like my Micromatic, but I cut myself every time I use it. It's probably just a bad sample or user error, but that one always gives me trouble :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that Gems are beautiful, they just look so nouveau. They&amp;#39;re kind of fun to use, too.&lt;/p&gt;\n\n&lt;p&gt;I want to like my Micromatic, but I cut myself every time I use it. It&amp;#39;s probably just a bad sample or user error, but that one always gives me trouble :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgei3z5", "score_hidden": false, "stickied": false, "created": 1492509179.0, "created_utc": 1492480379.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": "", "user_reports": [], "id": "dgek43v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rebeljpl64", "parent_id": "t1_dgeho96", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "Probably my favorite razor that is along the same line is the Eveready 1912. It's a wonderful SE razor and shaves like a dream.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Probably my favorite razor that is along the same line is the Eveready 1912. It&amp;#39;s a wonderful SE razor and shaves like a dream.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgek43v", "score_hidden": false, "stickied": false, "created": 1492511533.0, "created_utc": 1492482733.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeho96", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "DrRobb", "parent_id": "t3_65zi4p", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "Not near enough attention is paid to the old GEMs.  Two of my favorite shavers in regular rotation are the Micromatic Open Comb and, more recently, the Clog-Pruf.  I also have a G-Bar and a Featherweight.  All were found locally in excellent shape for under $10 each..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not near enough attention is paid to the old GEMs.  Two of my favorite shavers in regular rotation are the Micromatic Open Comb and, more recently, the Clog-Pruf.  I also have a G-Bar and a Featherweight.  All were found locally in excellent shape for under $10 each..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgeho96", "score_hidden": false, "stickied": false, "created": 1492508660.0, "created_utc": 1492479860.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": "", "user_reports": [], "id": "dgefh04", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Khalibre", "parent_id": "t3_65zi4p", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "Very nice post, thanks for sharing. Only vintage Gillette I have is the Super Adjustable, a fine razor.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very nice post, thanks for sharing. Only vintage Gillette I have is the Super Adjustable, a fine razor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgefh04", "score_hidden": false, "stickied": false, "created": 1492505924.0, "created_utc": 1492477124.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": "", "user_reports": [], "id": "dgek61f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rebeljpl64", "parent_id": "t1_dgega03", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "The 1912 is amazing, my favorite SE hands down.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The 1912 is amazing, my favorite SE hands down.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgek61f", "score_hidden": false, "stickied": false, "created": 1492511599.0, "created_utc": 1492482799.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgega03", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ahjoyc2", "parent_id": "t3_65zi4p", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "Vintage razors are about all I use any more.  I tend to alternate between a Slim, NEW, Fatboy, and a GEM 1912 right now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Vintage razors are about all I use any more.  I tend to alternate between a Slim, NEW, Fatboy, and a GEM 1912 right now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgega03", "score_hidden": false, "stickied": false, "created": 1492506926.0, "created_utc": 1492478126.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": "", "user_reports": [], "id": "dgegzth", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Boom-dog", "parent_id": "t1_dgegi8v", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "Cool, thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cool, thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgegzth", "score_hidden": false, "stickied": false, "created": 1492507831.0, "created_utc": 1492479031.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgegi8v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mpontiff", "parent_id": "t3_65zi4p", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "Regarding Schick Injectors, if you want to be able to open the head up for extra cleaning/verify cleanliness, look for an early E 2 - the spring slides to the side and the head opens - or an I 2 - it has a lever that opens the head for cleaning. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Regarding Schick Injectors, if you want to be able to open the head up for extra cleaning/verify cleanliness, look for an early E 2 - the spring slides to the side and the head opens - or an I 2 - it has a lever that opens the head for cleaning. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgegi8v", "score_hidden": false, "stickied": false, "created": 1492507217.0, "created_utc": 1492478417.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": "", "user_reports": [], "id": "dgekv4x", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Boom-dog", "parent_id": "t1_dgek7jt", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "Personally, I like the hunt of the flea market!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally, I like the hunt of the flea market!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgekv4x", "score_hidden": false, "stickied": false, "created": 1492512460.0, "created_utc": 1492483660.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": "", "user_reports": [], "id": "dgenb7i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mpontiff", "parent_id": "t1_dgek7jt", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "Flea markets, eBay and shave_bazaar will be cheaper. RE sells replated razors that can be quite pricey. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Flea markets, eBay and shave_bazaar will be cheaper. RE sells replated razors that can be quite pricey. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgenb7i", "score_hidden": false, "stickied": false, "created": 1492515718.0, "created_utc": 1492486918.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgek7jt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "serio1337", "parent_id": "t1_dgeifhv", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "Apparently razor emporium is based out of Phoenix...  http://www.razoremporium.com/\n\nDo you think it's worth checking out their shop, or only as a last ditch effort to the flea markets?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Apparently razor emporium is based out of Phoenix...  &lt;a href=\"http://www.razoremporium.com/\"&gt;http://www.razoremporium.com/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Do you think it&amp;#39;s worth checking out their shop, or only as a last ditch effort to the flea markets?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgek7jt", "score_hidden": false, "stickied": false, "created": 1492511649.0, "created_utc": 1492482849.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeifhv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Boom-dog", "parent_id": "t1_dgehrr3", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "That's what I do. To get started collecting I just bought whatever I saw, assuming that the moving parts worked, the bars were straight, the doors closed tightly, and no parts were missing. But these things are sturdy, most are pretty ok. After a while, you'll get more picky, but you can usually find them for under $10 (at least in rural Appalachia, where I am). The most expensive I've ever paid was for the Gillette Criterion, and that was only $30ish for the razor, blade holder, and case. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what I do. To get started collecting I just bought whatever I saw, assuming that the moving parts worked, the bars were straight, the doors closed tightly, and no parts were missing. But these things are sturdy, most are pretty ok. After a while, you&amp;#39;ll get more picky, but you can usually find them for under $10 (at least in rural Appalachia, where I am). The most expensive I&amp;#39;ve ever paid was for the Gillette Criterion, and that was only $30ish for the razor, blade holder, and case. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgeifhv", "score_hidden": false, "stickied": false, "created": 1492509572.0, "created_utc": 1492480772.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgehrr3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "serio1337", "parent_id": "t1_dgegz5c", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "Appreciate it!  I scoped out a few flea markets that I'll check out this week.  Is there anything specific I should be looking for?  I was thinking if the price was right to buy maybe a handful of different ones and sort them out later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Appreciate it!  I scoped out a few flea markets that I&amp;#39;ll check out this week.  Is there anything specific I should be looking for?  I was thinking if the price was right to buy maybe a handful of different ones and sort them out later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgehrr3", "score_hidden": false, "stickied": false, "created": 1492508772.0, "created_utc": 1492479972.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgegz5c", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Boom-dog", "parent_id": "t1_dgeg6ta", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "Honestly, don't be afraid of grunge. A lot of perfectly fine razors look terrible before they're cleaned. Just make sure the moving parts work and that everything is straight. Watch out you don't cut yourself on the old blades that might still be there. And they clean pretty easily with dish soap, Scrubbing Bubbles, rubbing alcohol, and a toothbrush. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, don&amp;#39;t be afraid of grunge. A lot of perfectly fine razors look terrible before they&amp;#39;re cleaned. Just make sure the moving parts work and that everything is straight. Watch out you don&amp;#39;t cut yourself on the old blades that might still be there. And they clean pretty easily with dish soap, Scrubbing Bubbles, rubbing alcohol, and a toothbrush. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgegz5c", "score_hidden": false, "stickied": false, "created": 1492507807.0, "created_utc": 1492479007.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeg6ta", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "serio1337", "parent_id": "t3_65zi4p", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "This post came in great time as I just made a post about seeing all of these vintage razors and wondering to myself...how on earth will I get my hands on one without paying a fortune to the gray market.\n\nAny advice from your personal experience?  I really want to get my hands on a Gillette vintage \n\n- saw your mention of the flea market and booths that specialize in \"smalls\" -  I'm going to see what I can find in the AZ area!", "edited": 1492478778.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This post came in great time as I just made a post about seeing all of these vintage razors and wondering to myself...how on earth will I get my hands on one without paying a fortune to the gray market.&lt;/p&gt;\n\n&lt;p&gt;Any advice from your personal experience?  I really want to get my hands on a Gillette vintage &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;saw your mention of the flea market and booths that specialize in &amp;quot;smalls&amp;quot; -  I&amp;#39;m going to see what I can find in the AZ area!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgeg6ta", "score_hidden": false, "stickied": false, "created": 1492506815.0, "created_utc": 1492478015.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": "", "user_reports": [], "id": "dgemmdc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Aromadegym", "parent_id": "t3_65zi4p", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "I recommend Super Speeds to every newbie because they're relatively cheap and absolutely amazing. There's a reason that they are the most produced razors in history. Try one. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I recommend Super Speeds to every newbie because they&amp;#39;re relatively cheap and absolutely amazing. There&amp;#39;s a reason that they are the most produced razors in history. Try one. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgemmdc", "score_hidden": false, "stickied": false, "created": 1492514741.0, "created_utc": 1492485941.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": "", "user_reports": [], "id": "dgf1kh7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JeanValJavert24601", "parent_id": "t3_65zi4p", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "Fantastic read. I am getting into vintage razors myself and recently acquired two Super Speeds and the shaves I get from them both are exceptional. I tried a vintage when I first started and wasn't very impressed with them but now a few years later and with a much improved technique. I love them. \n\nMy favourite vintage Razor is a Gibbs Adjustable, for me it knocks spots off the Gillette Adjustables, very user friendly and the shave is second to none. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fantastic read. I am getting into vintage razors myself and recently acquired two Super Speeds and the shaves I get from them both are exceptional. I tried a vintage when I first started and wasn&amp;#39;t very impressed with them but now a few years later and with a much improved technique. I love them. &lt;/p&gt;\n\n&lt;p&gt;My favourite vintage Razor is a Gibbs Adjustable, for me it knocks spots off the Gillette Adjustables, very user friendly and the shave is second to none. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgf1kh7", "score_hidden": false, "stickied": false, "created": 1492548045.0, "created_utc": 1492519245.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s46m", "removal_reason": null, "link_id": "t3_65zi4p", "likes": null, "replies": "", "user_reports": [], "id": "dgemobk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "p38thadl", "parent_id": "t3_65zi4p", "subreddit_name_prefixed": "r/wicked_edge", "controversiality": 0, "body": "I don't know if I'd dare pick up another open comb after the NEW LC. That's got to be the most aggressive one, right?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if I&amp;#39;d dare pick up another open comb after the NEW LC. That&amp;#39;s got to be the most aggressive one, right?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "wicked_edge", "name": "t1_dgemobk", "score_hidden": false, "stickied": false, "created": 1492514818.0, "created_utc": 1492486018.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]