[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "gamedev", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, Chris here. I&amp;#39;ve heard quite a few devs say the composers they hired didn&amp;#39;t live up to their promises, or just disappeared! &lt;/p&gt;\n\n&lt;p&gt;With that in mind here are my tips for ensuring that doesn&amp;#39;t happen to you (for whoever you hire - composer or otherwise): &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1. Do They Have The Chops?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Firstly, look at their website, read some of their articles and generally check them out online. Do they know what they are talking about? Have they the knowledge and skills you require and can they show examples of their work? Do you like them? If not, move on.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2. Take Things Slowly...&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Assuming they pass the above online snooping tests, initially just contact them with an initial enquiry. You&amp;#39;re not doing anything clever here, what you are looking for is how quickly they respond and what tone they use. &lt;/p&gt;\n\n&lt;p&gt;For example, do you want to work with someone who says &amp;#39;Hey man, cool.. how much?&amp;#39; vs &amp;#39;Sounds interesting. Here&amp;#39;s a link to my Getting Started PDF to see if we are a good fit&amp;#39;. Sounds pretty different right?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3. Start With Small Wins&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t just hire them because they are cheap. There are more things to consider. Try and get an initial conversation going, ask for their input or advice on a particular aspect up front. Most freelancers will answer small questions like this for free as a transition to working with you.&lt;/p&gt;\n\n&lt;p&gt;The idea isn&amp;#39;t to try and get things for free though - it&amp;#39;s to see if you can get a feel for what it&amp;#39;s like to work with them before you actually do. I for example will offer a consult about the music for a game upfront before any money changes hands. Lots of freelancers will do something similar, even if it&amp;#39;s just a couple of paragraphs or a quick e-mail exchange. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Isn&amp;#39;t This All Common Sense?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;All sound like common sense? It is, but I&amp;#39;m surprised how many people seem happy to go with freelancers based solely on price or because they like their work. These things are important of course, but so is the process, experience and professionalism that the interaction takes. &lt;/p&gt;\n\n&lt;p&gt;In my opinion, using the 3 points above will all help reduce the risk involved in hiring a freelancer. Hope that&amp;#39;s helpful. If you have any questions about this or indeed my process for music composition, let me know. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi, Chris here. I've heard quite a few devs say the composers they hired didn't live up to their promises, or just disappeared! \n\nWith that in mind here are my tips for ensuring that doesn't happen to you (for whoever you hire - composer or otherwise): \n\n**1. Do They Have The Chops?**\n\nFirstly, look at their website, read some of their articles and generally check them out online. Do they know what they are talking about? Have they the knowledge and skills you require and can they show examples of their work? Do you like them? If not, move on.\n\n**2. Take Things Slowly...**\n\nAssuming they pass the above online snooping tests, initially just contact them with an initial enquiry. You're not doing anything clever here, what you are looking for is how quickly they respond and what tone they use. \n\nFor example, do you want to work with someone who says 'Hey man, cool.. how much?' vs 'Sounds interesting. Here's a link to my Getting Started PDF to see if we are a good fit'. Sounds pretty different right?\n\n**3. Start With Small Wins**\n\nDon't just hire them because they are cheap. There are more things to consider. Try and get an initial conversation going, ask for their input or advice on a particular aspect up front. Most freelancers will answer small questions like this for free as a transition to working with you.\n\nThe idea isn't to try and get things for free though - it's to see if you can get a feel for what it's like to work with them before you actually do. I for example will offer a consult about the music for a game upfront before any money changes hands. Lots of freelancers will do something similar, even if it's just a couple of paragraphs or a quick e-mail exchange. \n\n**Isn't This All Common Sense?**\n\nAll sound like common sense? It is, but I'm surprised how many people seem happy to go with freelancers based solely on price or because they like their work. These things are important of course, but so is the process, experience and professionalism that the interaction takes. \n\nIn my opinion, using the 3 points above will all help reduce the risk involved in hiring a freelancer. Hope that's helpful. If you have any questions about this or indeed my process for music composition, let me know. \n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64qhln", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 38, "report_reasons": null, "author": "chrislines", "saved": false, "mod_reports": [], "name": "t3_64qhln", "subreddit_name_prefixed": "r/gamedev", "approved_by": null, "over_18": false, "domain": "self.gamedev", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qi0a", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/gamedev/comments/64qhln/how_to_get_rid_of_unreliable_music_composers_or/", "num_reports": null, "locked": false, "stickied": false, "created": 1491942269.0, "url": "https://www.reddit.com/r/gamedev/comments/64qhln/how_to_get_rid_of_unreliable_music_composers_or/", "author_flair_text": null, "quarantine": false, "title": "How to get rid of unreliable music composers (or any freelancer for your game) once and for all", "created_utc": 1491913469.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 38}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64qhln", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64qhln", "likes": null, "replies": "", "user_reports": [], "id": "dg5iuno", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "chrislines", "parent_id": "t1_dg4vzml", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Good point. You don't want to be stuck with someone you decide you can't work with. Benefits both sides. Exact termination provisions will differ a lot between contracts, but helpful to have something in there for sure. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good point. You don&amp;#39;t want to be stuck with someone you decide you can&amp;#39;t work with. Benefits both sides. Exact termination provisions will differ a lot between contracts, but helpful to have something in there for sure. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg5iuno", "score_hidden": false, "stickied": false, "created": 1492003748.0, "created_utc": 1491974948.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4vzml", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "jajiradaiNZ", "parent_id": "t3_64qhln", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "**0: Get the contract right**\n\nMake sure your contract has a termination clause that allows you to say \"thanks for your time, here's the money we owe you, good bye, and good luck with your next gig\".\n\nIt's all well and good to be slow and careful and pay for quality, but there's no guarantees, and the ability to realize you've made a mistake and back out of it without being an ass, or losing substantial money, is really important.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;0: Get the contract right&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Make sure your contract has a termination clause that allows you to say &amp;quot;thanks for your time, here&amp;#39;s the money we owe you, good bye, and good luck with your next gig&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s all well and good to be slow and careful and pay for quality, but there&amp;#39;s no guarantees, and the ability to realize you&amp;#39;ve made a mistake and back out of it without being an ass, or losing substantial money, is really important.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg4vzml", "score_hidden": false, "stickied": false, "created": 1491972080.0, "created_utc": 1491943280.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64qhln", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64qhln", "likes": null, "replies": "", "user_reports": [], "id": "dg5jo30", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "chrislines", "parent_id": "t1_dg4odd9", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Nice idea. It would be a more positive angle to take too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice idea. It would be a more positive angle to take too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg5jo30", "score_hidden": false, "stickied": false, "created": 1492005470.0, "created_utc": 1491976670.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64qhln", "likes": null, "replies": "", "user_reports": [], "id": "dg5jqkd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "chrislines", "parent_id": "t1_dg4odd9", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "...although it looks like you can't change the post title after it's published. At least the sentiment is here in the thread!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;...although it looks like you can&amp;#39;t change the post title after it&amp;#39;s published. At least the sentiment is here in the thread!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg5jqkd", "score_hidden": false, "stickied": false, "created": 1492005625.0, "created_utc": 1491976825.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4odd9", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Pacver", "parent_id": "t3_64qhln", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Hey, good post, Chris.  \n  \nMaybe you should reformat the title to reflect that it's not a question, but a tip/guide? \"This is how you find reliable composers(or any freelancers) for your game once and for all\"  \n  \nI think a good composer can demo a few tracks very quickly within a week, so that should be a good sign that he/she is up for the task and inspired. By demoing I mean just some ideas for the soundtrack in piano or any other format.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, good post, Chris.  &lt;/p&gt;\n\n&lt;p&gt;Maybe you should reformat the title to reflect that it&amp;#39;s not a question, but a tip/guide? &amp;quot;This is how you find reliable composers(or any freelancers) for your game once and for all&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;I think a good composer can demo a few tracks very quickly within a week, so that should be a good sign that he/she is up for the task and inspired. By demoing I mean just some ideas for the soundtrack in piano or any other format.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg4odd9", "score_hidden": false, "stickied": false, "created": 1491963805.0, "created_utc": 1491935005.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64qhln", "likes": null, "replies": "", "user_reports": [], "id": "dg5x3a0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "betafishmusic", "parent_id": "t3_64qhln", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "I hope some of the below proves helpful to folks. I've worked on a few AAA games, but (probably) hundreds of indies of all stripes and budget size. This may get too specifically into \"working with a composer\" territory and not be super applicable for other freelancers, but a few things I've noticed, having had a longish career with a very specific set of skills are...\n\n1. Know What You're Getting\n\nA composer writes music. I know a lot of us do other things too, but sometimes, independent projects need to understand that a project should be at the point at which it needs music composed for it. Asking someone to \"put some ideas together\" has its place too, but in my humble experience is a term often misused, that leads to a bunch of protracted work before the composition work would normally commence, leading to the DOA score or a ghosted composer.\n\n2. Guarantee What You're Getting\n\nI see it was mentioned above, but a good contract, that outlines dates, deliverables, expectations, and remuneration is worth something more substantiative's weight in gold. I've picked up projects before where the first composer ostensibly bailed unprofessionally, but realized after going through the contract negotiations that they had been run off by scope creep and moving goalposts. Get it on paper and up front, so everyone can be focused on the creative aspects. \n\n3. Hire Someone Who Knows\n\nUnless it's a huge project, I very rarely encounter music supervisors on games, but they're so helpful in communicating your needs to a composer, in mapping out music asset needs over the course of project, and in contract negotiations. They can also help a director or studio refine and manage their ideas for what the music should be aesthetically, before the composer is brought in, to avoid a shotgunning of ideas that can kill creativity and a schedule. Also, on larger projects, a composer might have a bunch of support staff and ancillary postproduction personnel, orchestrators, mixers, etc. that they won't have on an smaller game. That's ok, but account for that.\n\n4. Manage Your Expectations\n\nParticularly for smaller projects, you will notice that your composer probably has other skills, and the efficiency of utilizing them is just too tempting. Nothing wrong with that, but be sure and allocate time for the different roles a composer is expected to play. For instance, if they are mixing the score, give them the time they would need as a mixer, after an approved score is delivered.\n\nI may edit this later to add more, as I think of things, but I hope some of this can be helpful in getting the score you want for your project.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope some of the below proves helpful to folks. I&amp;#39;ve worked on a few AAA games, but (probably) hundreds of indies of all stripes and budget size. This may get too specifically into &amp;quot;working with a composer&amp;quot; territory and not be super applicable for other freelancers, but a few things I&amp;#39;ve noticed, having had a longish career with a very specific set of skills are...&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Know What You&amp;#39;re Getting&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;A composer writes music. I know a lot of us do other things too, but sometimes, independent projects need to understand that a project should be at the point at which it needs music composed for it. Asking someone to &amp;quot;put some ideas together&amp;quot; has its place too, but in my humble experience is a term often misused, that leads to a bunch of protracted work before the composition work would normally commence, leading to the DOA score or a ghosted composer.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Guarantee What You&amp;#39;re Getting&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I see it was mentioned above, but a good contract, that outlines dates, deliverables, expectations, and remuneration is worth something more substantiative&amp;#39;s weight in gold. I&amp;#39;ve picked up projects before where the first composer ostensibly bailed unprofessionally, but realized after going through the contract negotiations that they had been run off by scope creep and moving goalposts. Get it on paper and up front, so everyone can be focused on the creative aspects. &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Hire Someone Who Knows&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Unless it&amp;#39;s a huge project, I very rarely encounter music supervisors on games, but they&amp;#39;re so helpful in communicating your needs to a composer, in mapping out music asset needs over the course of project, and in contract negotiations. They can also help a director or studio refine and manage their ideas for what the music should be aesthetically, before the composer is brought in, to avoid a shotgunning of ideas that can kill creativity and a schedule. Also, on larger projects, a composer might have a bunch of support staff and ancillary postproduction personnel, orchestrators, mixers, etc. that they won&amp;#39;t have on an smaller game. That&amp;#39;s ok, but account for that.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Manage Your Expectations&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Particularly for smaller projects, you will notice that your composer probably has other skills, and the efficiency of utilizing them is just too tempting. Nothing wrong with that, but be sure and allocate time for the different roles a composer is expected to play. For instance, if they are mixing the score, give them the time they would need as a mixer, after an approved score is delivered.&lt;/p&gt;\n\n&lt;p&gt;I may edit this later to add more, as I think of things, but I hope some of this can be helpful in getting the score you want for your project.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg5x3a0", "score_hidden": false, "stickied": false, "created": 1492035551.0, "created_utc": 1492006751.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64qhln", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64qhln", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64qhln", "likes": null, "replies": "", "user_reports": [], "id": "dg7d944", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg796lf", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "I would do that too for big money items. Well big money for me is probably less than larger developers :-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would do that too for big money items. Well big money for me is probably less than larger developers :-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg7d944", "score_hidden": false, "stickied": false, "created": 1492106541.0, "created_utc": 1492077741.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg796lf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chrislines", "parent_id": "t1_dg5otbb", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Interesting. I think 50% upfront and 50% later is a good model too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting. I think 50% upfront and 50% later is a good model too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg796lf", "score_hidden": false, "stickied": false, "created": 1492094659.0, "created_utc": 1492065859.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5otbb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64qhln", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "I always start small and work up. Simple tasks and work up to bigger ones. I've worked with some terrible artists and its best to know they're terrible on the small tasks.\n\nI used to pay up front to show people I had money. Then at some point people would get bored with a project and not deliver. So I pay when they're done and that works fine... but if I try to do that with someone new I never get the work. That's just my experience.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always start small and work up. Simple tasks and work up to bigger ones. I&amp;#39;ve worked with some terrible artists and its best to know they&amp;#39;re terrible on the small tasks.&lt;/p&gt;\n\n&lt;p&gt;I used to pay up front to show people I had money. Then at some point people would get bored with a project and not deliver. So I pay when they&amp;#39;re done and that works fine... but if I try to do that with someone new I never get the work. That&amp;#39;s just my experience.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg5otbb", "score_hidden": false, "stickied": false, "created": 1492020138.0, "created_utc": 1491991338.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]