[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "gamedev", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Typically we all know when an indie game is bad. It&amp;#39;s very obvious from the moment you press start that something is wrong. But I think it&amp;#39;s important to break down those elements to their roots so we know what to avoid or fix in our own games.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll start with my own list and I hope to see others throwing in their two cents on the subject:&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Unclear Controls.&lt;/strong&gt; The button layout is unintuitive and the player needs to press everything to do something that should have been simple. R2 is typically never &amp;quot;Accept&amp;quot; and select is never &amp;quot;Jump.&amp;quot; Gamers have built up standards for what a lot of buttons mean, and it&amp;#39;s important to respect that.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Unergonomic Controls.&lt;/strong&gt; You as a developer have a responsibility to your players to make sure controls don&amp;#39;t hurt their hands. If I need to constantly hold a button or tap a button too quickly to play your game efficiently, I&amp;#39;m going to cramp up. Ergonomics are often ignored but you&amp;#39;d be surprised how much they will mean to players a few hours into your game.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Bad Controls.&lt;/strong&gt; It might look nice to add in lengthier animations, realistic rotations, and drawn out stops for character movements, but you need to consider if it&amp;#39;s actually enjoyable to control the character that they&amp;#39;ve been applied to. As a player, I want all of my inputs to have immediate output, otherwise there&amp;#39;s a disconnect. It might be subtle, but it&amp;#39;s an annoyance that will build up my frustration over time. You can make character motion look good and feel good at the same time, it just takes a bit of extra effort and planning.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Long Tutorials.&lt;/strong&gt; A player needs to know how to play the game, but they&amp;#39;ll be upset if you don&amp;#39;t let them play quickly. And if you can&amp;#39;t explain the elements in a timely manner, your game might just be too complicated. If it can&amp;#39;t be helped, try drawing the tutorial out over time in easily digestible chunks. Remember, the best kind of tutorial is one that you don&amp;#39;t even realize you&amp;#39;re in.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;The Uncanny Valley.&lt;/strong&gt; Those &amp;quot;somewhat-realistic-but-not-realistic-enough&amp;quot; character and terrain models. Even if they took a long time for you to create, they often appear unfinished and will serve to remind the player that more effort could have been applied which cheapens the experience overall. On the other hand, stylized or low poly models appear complete and intentional because the medium is fully realized, even though they might actually be easier to make. If you don&amp;#39;t have the time or ability to pursue true realism, maybe try something cartoony or abstract.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Unnecessary Voice Acting.&lt;/strong&gt; If you&amp;#39;ve attempted to add voice acting, take a step back and ask yourself if the quality seems truly professional. Does the mic sound clean? Is it audible through your music? Is the acting good? If you can&amp;#39;t honestly say yes to these, don&amp;#39;t add it. I know it might be fun to hear your own voice in your game but players might be turned off by it if it doesn&amp;#39;t meet their expectations. In some cases, reading plain text would be more enjoyable.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Ugly User Interfaces&lt;/strong&gt; This is a step that you can&amp;#39;t glaze over. Your user interface is going to be with the players for the entire game, and if it&amp;#39;s ugly to look at, your game is going to be ugly to look at. I can&amp;#39;t tell you how many games I didn&amp;#39;t look into because the screenshots were full of ugly UI. Take the extra time to do a little research on color theory and UX design. Google some popular games and look at what their user interfaces look like. I know it&amp;#39;s extra work, but players will definitely notice even if they don&amp;#39;t realize it themselves.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s plenty more I could mention, but I think that&amp;#39;s enough to get a good discussion going. I&amp;#39;m excited to hear what everyone comes up with!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Typically we all know when an indie game is bad. It's very obvious from the moment you press start that something is wrong. But I think it's important to break down those elements to their roots so we know what to avoid or fix in our own games.\n\n&amp;nbsp;\n\nI'll start with my own list and I hope to see others throwing in their two cents on the subject:\n\n&amp;nbsp;\n\n- **Unclear Controls.** The button layout is unintuitive and the player needs to press everything to do something that should have been simple. R2 is typically never \"Accept\" and select is never \"Jump.\" Gamers have built up standards for what a lot of buttons mean, and it's important to respect that.\n\n&amp;nbsp;\n\n- **Unergonomic Controls.** You as a developer have a responsibility to your players to make sure controls don't hurt their hands. If I need to constantly hold a button or tap a button too quickly to play your game efficiently, I'm going to cramp up. Ergonomics are often ignored but you'd be surprised how much they will mean to players a few hours into your game.\n\n&amp;nbsp;\n\n- **Bad Controls.** It might look nice to add in lengthier animations, realistic rotations, and drawn out stops for character movements, but you need to consider if it's actually enjoyable to control the character that they've been applied to. As a player, I want all of my inputs to have immediate output, otherwise there's a disconnect. It might be subtle, but it's an annoyance that will build up my frustration over time. You can make character motion look good and feel good at the same time, it just takes a bit of extra effort and planning.\n\n&amp;nbsp;\n\n- **Long Tutorials.** A player needs to know how to play the game, but they'll be upset if you don't let them play quickly. And if you can't explain the elements in a timely manner, your game might just be too complicated. If it can't be helped, try drawing the tutorial out over time in easily digestible chunks. Remember, the best kind of tutorial is one that you don't even realize you're in.\n\n&amp;nbsp;\n\n- **The Uncanny Valley.** Those \"somewhat-realistic-but-not-realistic-enough\" character and terrain models. Even if they took a long time for you to create, they often appear unfinished and will serve to remind the player that more effort could have been applied which cheapens the experience overall. On the other hand, stylized or low poly models appear complete and intentional because the medium is fully realized, even though they might actually be easier to make. If you don't have the time or ability to pursue true realism, maybe try something cartoony or abstract.\n\n&amp;nbsp;\n\n- **Unnecessary Voice Acting.** If you've attempted to add voice acting, take a step back and ask yourself if the quality seems truly professional. Does the mic sound clean? Is it audible through your music? Is the acting good? If you can't honestly say yes to these, don't add it. I know it might be fun to hear your own voice in your game but players might be turned off by it if it doesn't meet their expectations. In some cases, reading plain text would be more enjoyable.\n\n&amp;nbsp;\n\n- **Ugly User Interfaces** This is a step that you can't glaze over. Your user interface is going to be with the players for the entire game, and if it's ugly to look at, your game is going to be ugly to look at. I can't tell you how many games I didn't look into because the screenshots were full of ugly UI. Take the extra time to do a little research on color theory and UX design. Google some popular games and look at what their user interfaces look like. I know it's extra work, but players will definitely notice even if they don't realize it themselves.\n\n&amp;nbsp;\n\nThere's plenty more I could mention, but I think that's enough to get a good discussion going. I'm excited to hear what everyone comes up with!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Discussion", "id": "64z7w8", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 20, "report_reasons": null, "author": "braytendo", "saved": false, "mod_reports": [], "name": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "approved_by": null, "over_18": false, "domain": "self.gamedev", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qi0a", "edited": 1492097000.0, "link_flair_css_class": "discussion cat-talk", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/gamedev/comments/64z7w8/what_are_the_qualities_that_make_up_a_bad_game/", "num_reports": null, "locked": false, "stickied": false, "created": 1492043186.0, "url": "https://www.reddit.com/r/gamedev/comments/64z7w8/what_are_the_qualities_that_make_up_a_bad_game/", "author_flair_text": null, "quarantine": false, "title": "What are the qualities that make up a \"bad\" game?", "created_utc": 1492014386.0, "distinguished": null, "media": null, "upvote_ratio": 0.76, "num_comments": 38, "visited": false, "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg6lyjm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Schwertritter", "parent_id": "t1_dg6c6m9", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Yeah, a bad game is a game that is not fun to play. Or not immersive to play, or whatever emotional response are you looking to have from a game. If a game does what it's supposed to do, it's good, and we can forgive shortcomings.\n\nThen again, I can think of several games that don't quite fall under that definition... and aren't nessecarily \"bad\". Not good either, though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, a bad game is a game that is not fun to play. Or not immersive to play, or whatever emotional response are you looking to have from a game. If a game does what it&amp;#39;s supposed to do, it&amp;#39;s good, and we can forgive shortcomings.&lt;/p&gt;\n\n&lt;p&gt;Then again, I can think of several games that don&amp;#39;t quite fall under that definition... and aren&amp;#39;t nessecarily &amp;quot;bad&amp;quot;. Not good either, though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6lyjm", "score_hidden": false, "stickied": false, "created": 1492061963.0, "created_utc": 1492033163.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6c6m9", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "JetL33t", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "I think one of the biggest issues is terrible game design. If the game just is not fun to play, it is not worth your time, no matter how polished it might be.\nA game can have a lot of issues and still be fun to play if the game design is right.\n\nWe tend to look over bugs, terrible controls, missing options when a game is fun.", "edited": 1492038445.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think one of the biggest issues is terrible game design. If the game just is not fun to play, it is not worth your time, no matter how polished it might be.\nA game can have a lot of issues and still be fun to play if the game design is right.&lt;/p&gt;\n\n&lt;p&gt;We tend to look over bugs, terrible controls, missing options when a game is fun.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6c6m9", "score_hidden": false, "stickied": false, "created": 1492051573.0, "created_utc": 1492022773.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg74flp", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "KelvinShadewing", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "* **Surpise Deaths** A user should feel like if they die in your game, it's their fault and they should learn from it. This is especially bad if it's been a long time since their last checkpoint. Short iteration time is your friend.\n\n* **Locking On to Things You'd Never Lock On To** This seems obvious, but sadly, some games will feature a lockon system that causes you to shoot something you know you absolutely should not shoot, and usually, you have little to no control over this. An example would be the dynamite sticks in Sonic Adventure 2's ARK level which will create holes in the colony walls which suck Tails out into space if he gets near them. You know not to shoot them, but with all the enemies flying around, you don't have time to wait for the lockon to wear off, and creating the cause of your own demise is almost unavoidable.\n\n* **Wander Aimlessly to Progress** An issue I see all the time in JRPGs is where you have no direction and just have to rub the walls until you find someplace that triggers a story scene or boss fight. Give the player an idea of where to go, but don't hold their hand. This leads me to:\n\n* **Trail of Breadcrumbs** There's no better way to tell your players you think they're stupid than to have a glowing line coming from their avatar leading them down the quickest path to the goal. A compass or map marker is one thing, but not letting the player figure out how to get around obstacles or navigate corridors on their own takes away the challenge and stifles any drive to explore. You may as well make them walk automatically to the next challenge space.\n\n* **Unskippable Rerun Cutscenes** If a player has seen a cutscene or cinematic before, there's no excuse not to let them skip it, especially if they've already beaten the game. Let them play at their own pace and don't force them to watch something they've already seen.\n\n* **Arbitrary One-Way Paths** Let's say your character falls down a long shaft into a room. You can't go back up. Later on, you gain the ability to fly or infinity jump and decide you want to go back up, only to find a game wall has appeared and prevents you from going up. This is a slap in the face to explorers, especially if they have to go through a long slog to get back to that room, and can make end-game scavenger hunts a pain because a perfectly valid route has been blocked off for no reason at all. Another example of such a blockage are crumbling blocks that are invincible from any side but the top or trap doors that can't be pulled or otherwise opened with common sense.\n\nI may come up with more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Surpise Deaths&lt;/strong&gt; A user should feel like if they die in your game, it&amp;#39;s their fault and they should learn from it. This is especially bad if it&amp;#39;s been a long time since their last checkpoint. Short iteration time is your friend.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Locking On to Things You&amp;#39;d Never Lock On To&lt;/strong&gt; This seems obvious, but sadly, some games will feature a lockon system that causes you to shoot something you know you absolutely should not shoot, and usually, you have little to no control over this. An example would be the dynamite sticks in Sonic Adventure 2&amp;#39;s ARK level which will create holes in the colony walls which suck Tails out into space if he gets near them. You know not to shoot them, but with all the enemies flying around, you don&amp;#39;t have time to wait for the lockon to wear off, and creating the cause of your own demise is almost unavoidable.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Wander Aimlessly to Progress&lt;/strong&gt; An issue I see all the time in JRPGs is where you have no direction and just have to rub the walls until you find someplace that triggers a story scene or boss fight. Give the player an idea of where to go, but don&amp;#39;t hold their hand. This leads me to:&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Trail of Breadcrumbs&lt;/strong&gt; There&amp;#39;s no better way to tell your players you think they&amp;#39;re stupid than to have a glowing line coming from their avatar leading them down the quickest path to the goal. A compass or map marker is one thing, but not letting the player figure out how to get around obstacles or navigate corridors on their own takes away the challenge and stifles any drive to explore. You may as well make them walk automatically to the next challenge space.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Unskippable Rerun Cutscenes&lt;/strong&gt; If a player has seen a cutscene or cinematic before, there&amp;#39;s no excuse not to let them skip it, especially if they&amp;#39;ve already beaten the game. Let them play at their own pace and don&amp;#39;t force them to watch something they&amp;#39;ve already seen.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Arbitrary One-Way Paths&lt;/strong&gt; Let&amp;#39;s say your character falls down a long shaft into a room. You can&amp;#39;t go back up. Later on, you gain the ability to fly or infinity jump and decide you want to go back up, only to find a game wall has appeared and prevents you from going up. This is a slap in the face to explorers, especially if they have to go through a long slog to get back to that room, and can make end-game scavenger hunts a pain because a perfectly valid route has been blocked off for no reason at all. Another example of such a blockage are crumbling blocks that are invincible from any side but the top or trap doors that can&amp;#39;t be pulled or otherwise opened with common sense.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I may come up with more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg74flp", "score_hidden": false, "stickied": false, "created": 1492085398.0, "created_utc": 1492056598.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg6w1uf", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "dunoid", "parent_id": "t1_dg6krd8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "The characters in the recent GTA games control like beautifully animated boats.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The characters in the recent GTA games control like beautifully animated boats.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6w1uf", "score_hidden": false, "stickied": false, "created": 1492074342.0, "created_utc": 1492045542.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg6qlrp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mallenjordan", "parent_id": "t1_dg6krd8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "No joke the camera in GTA sucks most of the time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No joke the camera in GTA sucks most of the time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6qlrp", "score_hidden": false, "stickied": false, "created": 1492067704.0, "created_utc": 1492038904.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6krd8", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "grpft", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "&gt; Bad Controls. It might look nice to add in lengthier animations, realistic rotations, and drawn out stops for character movements, but you need to consider if it's actually enjoyable to control the character that they've been applied to.\n\nHear that, Rockstar? Take notes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Bad Controls. It might look nice to add in lengthier animations, realistic rotations, and drawn out stops for character movements, but you need to consider if it&amp;#39;s actually enjoyable to control the character that they&amp;#39;ve been applied to.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Hear that, Rockstar? Take notes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6krd8", "score_hidden": false, "stickied": false, "created": 1492060555.0, "created_utc": 1492031755.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg75fcc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "xx00xx00xx", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "* **Made with visual scripting.**  The game uses a stock character controller and the player's interaction with the environment is severely restricted.  Telltale signs include a promotional trailer which includes flyovers of various settings but demonstrates little to no interactive gameplay.  Proclaims to be a 'walking simulator' as if this was a deliberate design decision.  Sometimes includes decent visuals but ultimately destined for dollar bundles due to a negligible gaming experience.\n\n&lt;dives for cover&gt;", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Made with visual scripting.&lt;/strong&gt;  The game uses a stock character controller and the player&amp;#39;s interaction with the environment is severely restricted.  Telltale signs include a promotional trailer which includes flyovers of various settings but demonstrates little to no interactive gameplay.  Proclaims to be a &amp;#39;walking simulator&amp;#39; as if this was a deliberate design decision.  Sometimes includes decent visuals but ultimately destined for dollar bundles due to a negligible gaming experience.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;lt;dives for cover&amp;gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg75fcc", "score_hidden": false, "stickied": false, "created": 1492086961.0, "created_utc": 1492058161.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg8cjum", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pdp10", "parent_id": "t1_dg6b8jx", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "In the past publishers have even done this for brand new $60 physical releases, with no way to get the contents except signing up for an app store or waiting a year and buying the complete edition.\n\nDo publishers still do this? It's basically why I stopped buying console games.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the past publishers have even done this for brand new $60 physical releases, with no way to get the contents except signing up for an app store or waiting a year and buying the complete edition.&lt;/p&gt;\n\n&lt;p&gt;Do publishers still do this? It&amp;#39;s basically why I stopped buying console games.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg8cjum", "score_hidden": false, "stickied": false, "created": 1492151897.0, "created_utc": 1492123097.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6b8jx", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ncgreco1440", "parent_id": "t1_dg64zhd", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Intentionally placing day 1 release items and game mechanics behind a paywall. This practice is not only is shady it reveals your true nature in that you really don't a give a shit about your game, just the money that it can make you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Intentionally placing day 1 release items and game mechanics behind a paywall. This practice is not only is shady it reveals your true nature in that you really don&amp;#39;t a give a shit about your game, just the money that it can make you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6b8jx", "score_hidden": false, "stickied": false, "created": 1492050608.0, "created_utc": 1492021808.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg64zhd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Oxin126", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "A list of bad thing to do in a game is almost infinite. But i can give you some :\n\nBad sound design, not enough music / repetitive music, weird mix of art styles, Zombies (yes... :P), ridiculous loading times, unfriendly UI, missing key bidding, missing graphic setting, low FOV, weird camera angle, low fps lock on PC...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A list of bad thing to do in a game is almost infinite. But i can give you some :&lt;/p&gt;\n\n&lt;p&gt;Bad sound design, not enough music / repetitive music, weird mix of art styles, Zombies (yes... :P), ridiculous loading times, unfriendly UI, missing key bidding, missing graphic setting, low FOV, weird camera angle, low fps lock on PC...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg64zhd", "score_hidden": false, "stickied": false, "created": 1492044251.0, "created_utc": 1492015451.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg6vkfg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "oasisisthewin", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "My biggest problem; games where you decisions aren't meaningful. That's why we play games, for effect, for strategy, etc. \"Keep the ball on the trail\" isn't fun, for anyone. Don't give me a job, give me a goal and let me be creative and be rewarded for it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My biggest problem; games where you decisions aren&amp;#39;t meaningful. That&amp;#39;s why we play games, for effect, for strategy, etc. &amp;quot;Keep the ball on the trail&amp;quot; isn&amp;#39;t fun, for anyone. Don&amp;#39;t give me a job, give me a goal and let me be creative and be rewarded for it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6vkfg", "score_hidden": false, "stickied": false, "created": 1492073742.0, "created_utc": 1492044942.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg6wk69", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Niiue", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "My biggest issue with games 90% of the time is bad/slow controls.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My biggest issue with games 90% of the time is bad/slow controls.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6wk69", "score_hidden": false, "stickied": false, "created": 1492074967.0, "created_utc": 1492046167.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg77v40", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FluffexStudio", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "A few I can think of off my head:\n\n- Horrible Storyline: This is not a major one but it does irritate me. Storyline that doesn't make sense, doesn't have plot, not very interesting or pull some kind of incomprehensible logic.\n\n- Annoying Characters: Characters that do irritating stuffs such as say the same thing over and over and over again that tick the players off. Also, characters that have an arch type like Mary Sue/Gary Sue, Tsundere, sidekick, jester, etc... are bad as well as they are basically one dimension and it's difficult to have interesting development with them.\n\n- Unfair: You die without given a good chance to defend yourself or you die because of chance is a turn off. It hinders progression a lot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A few I can think of off my head:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Horrible Storyline: This is not a major one but it does irritate me. Storyline that doesn&amp;#39;t make sense, doesn&amp;#39;t have plot, not very interesting or pull some kind of incomprehensible logic.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Annoying Characters: Characters that do irritating stuffs such as say the same thing over and over and over again that tick the players off. Also, characters that have an arch type like Mary Sue/Gary Sue, Tsundere, sidekick, jester, etc... are bad as well as they are basically one dimension and it&amp;#39;s difficult to have interesting development with them.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Unfair: You die without given a good chance to defend yourself or you die because of chance is a turn off. It hinders progression a lot.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg77v40", "score_hidden": false, "stickied": false, "created": 1492091514.0, "created_utc": 1492062714.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg7aikr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NoDownvotesPlease", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Lack of feedback when you interact with the game. Like if I shoot a guy I want to see him stagger and blood fly out or something.\n\nSee the juice it or lose it talk\n\nhttps://www.youtube.com/watch?v=Fy0aCDmgnxg\n\nMore interactive options is almost always better in my opinion. Stuff like being able to roll around and break pots in Zelda is a simple thing, but makes the world way more fun to explore. A lot of amateurish indie games tend to overlook this stuff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lack of feedback when you interact with the game. Like if I shoot a guy I want to see him stagger and blood fly out or something.&lt;/p&gt;\n\n&lt;p&gt;See the juice it or lose it talk&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=Fy0aCDmgnxg\"&gt;https://www.youtube.com/watch?v=Fy0aCDmgnxg&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;More interactive options is almost always better in my opinion. Stuff like being able to roll around and break pots in Zelda is a simple thing, but makes the world way more fun to explore. A lot of amateurish indie games tend to overlook this stuff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg7aikr", "score_hidden": false, "stickied": false, "created": 1492098276.0, "created_utc": 1492069476.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg7ejp3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Schwertritter", "parent_id": "t1_dg7dul3", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Castlevania: Symphony of the Night has backtracking and is one of the best games of all time. It's about backtracking done right.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Castlevania: Symphony of the Night has backtracking and is one of the best games of all time. It&amp;#39;s about backtracking done right.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg7ejp3", "score_hidden": false, "stickied": false, "created": 1492110232.0, "created_utc": 1492081432.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7dul3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ReallyHadToFixThat", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "#Lack of satisfaction. \n\nThis is a bit hard to quantify, but when I fire a gun it should god damn go *BOOM*. When I hit with it the more pieces my enemy flies into the better. Think about why people prefer mechanical keyboards. This also  ties into story elements and side quests. Don't set up cool concepts in a side quest (or worse, story quest) then just let them disappear. \n\n#Backtracking\n\nIf you give me a quest that involves walking from one end of the world to another, fighting inconsequential but potentially lethal shit along the way, only to complete the quest and have to trek all the way back to hand it in....I hate you. Let me turn in the quest by radio. Have the NPC meet me near the quest after it is complete. Don't arbitrarily make me backtrack to make your game seem longer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;h1&gt;Lack of satisfaction.&lt;/h1&gt;\n\n&lt;p&gt;This is a bit hard to quantify, but when I fire a gun it should god damn go &lt;em&gt;BOOM&lt;/em&gt;. When I hit with it the more pieces my enemy flies into the better. Think about why people prefer mechanical keyboards. This also  ties into story elements and side quests. Don&amp;#39;t set up cool concepts in a side quest (or worse, story quest) then just let them disappear. &lt;/p&gt;\n\n&lt;h1&gt;Backtracking&lt;/h1&gt;\n\n&lt;p&gt;If you give me a quest that involves walking from one end of the world to another, fighting inconsequential but potentially lethal shit along the way, only to complete the quest and have to trek all the way back to hand it in....I hate you. Let me turn in the quest by radio. Have the NPC meet me near the quest after it is complete. Don&amp;#39;t arbitrarily make me backtrack to make your game seem longer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg7dul3", "score_hidden": false, "stickied": false, "created": 1492108307.0, "created_utc": 1492079507.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg7ify3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "klianc09", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Surprised nobody has mentioned the \"[No Twinkie](http://www.designersnotebook.com/Design_Resources/No_Twinkie_Database/no_twinkie_database.htm)\" columns yet. \n\nThey are really old, show specific examples rather than general \"qualities\" you asked for, and they are only the opinion of one person, but I think they are a good starting point for reading about game-design pitfalls.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Surprised nobody has mentioned the &amp;quot;&lt;a href=\"http://www.designersnotebook.com/Design_Resources/No_Twinkie_Database/no_twinkie_database.htm\"&gt;No Twinkie&lt;/a&gt;&amp;quot; columns yet. &lt;/p&gt;\n\n&lt;p&gt;They are really old, show specific examples rather than general &amp;quot;qualities&amp;quot; you asked for, and they are only the opinion of one person, but I think they are a good starting point for reading about game-design pitfalls.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg7ify3", "score_hidden": false, "stickied": false, "created": 1492117623.0, "created_utc": 1492088823.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg64wye", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kstacey", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Bad gameplay or just not being fun or rewarding", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bad gameplay or just not being fun or rewarding&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg64wye", "score_hidden": false, "stickied": false, "created": 1492044177.0, "created_utc": 1492015377.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg75ont", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SirGouki", "parent_id": "t1_dg6xftn", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Not 100% of the time.  If a game is built well around a specific control scheme, most of the time people wont care.\n\nThe problem arises when controls just don't feel right, like having a WASD style control scheme but instead of space to jump, you assign it to U.  A good example is terraria's controller support in PC.  The default controls make little sense with how the game plays.\n\nIf you're hard coding in a control scheme, it should detect what keyboard style someone is using and make the appropriate adjustments.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not 100% of the time.  If a game is built well around a specific control scheme, most of the time people wont care.&lt;/p&gt;\n\n&lt;p&gt;The problem arises when controls just don&amp;#39;t feel right, like having a WASD style control scheme but instead of space to jump, you assign it to U.  A good example is terraria&amp;#39;s controller support in PC.  The default controls make little sense with how the game plays.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re hard coding in a control scheme, it should detect what keyboard style someone is using and make the appropriate adjustments.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg75ont", "score_hidden": false, "stickied": false, "created": 1492087393.0, "created_utc": 1492058593.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg7dru1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ReallyHadToFixThat", "parent_id": "t1_dg6xftn", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "The best tutorials are just the game steadily introducing new concepts. Look at portal. The first half of the game is all tutorial, but you are still playing the game. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The best tutorials are just the game steadily introducing new concepts. Look at portal. The first half of the game is all tutorial, but you are still playing the game. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg7dru1", "score_hidden": false, "stickied": false, "created": 1492108089.0, "created_utc": 1492079289.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg71f4b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "graspee", "parent_id": "t1_dg70kqg", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "I used to do that but I got annoyed changing layouts all the time even though it seems like a simple thing. Also some games block the shortcut from getting through to Windows and it won't switch. Then you have the problem where you change the layout to qwerty so you can control the game but there is text entry in the game too...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to do that but I got annoyed changing layouts all the time even though it seems like a simple thing. Also some games block the shortcut from getting through to Windows and it won&amp;#39;t switch. Then you have the problem where you change the layout to qwerty so you can control the game but there is text entry in the game too...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg71f4b", "score_hidden": false, "stickied": false, "created": 1492081075.0, "created_utc": 1492052275.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg70kqg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DAsSNipez", "parent_id": "t1_dg6xprc", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Hey fellow dvorak user!\n\nAdd standard qwerty keyboard along side Dvorak, then Ctrl+Shift becomes your very best friend if you're gaming (and worst enemy if you're programming).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey fellow dvorak user!&lt;/p&gt;\n\n&lt;p&gt;Add standard qwerty keyboard along side Dvorak, then Ctrl+Shift becomes your very best friend if you&amp;#39;re gaming (and worst enemy if you&amp;#39;re programming).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg70kqg", "score_hidden": false, "stickied": false, "created": 1492079967.0, "created_utc": 1492051167.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xprc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "graspee", "parent_id": "t1_dg6xftn", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Yes, inability to rebind controls makes a game bad. It's an easy enough thing to code and it's a real pain if they use wasd for example and you're using a dvorak layout. (wasd in dvorak requires using the keys that are ,a;h on qwerty).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, inability to rebind controls makes a game bad. It&amp;#39;s an easy enough thing to code and it&amp;#39;s a real pain if they use wasd for example and you&amp;#39;re using a dvorak layout. (wasd in dvorak requires using the keys that are ,a;h on qwerty).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6xprc", "score_hidden": false, "stickied": false, "created": 1492076402.0, "created_utc": 1492047602.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg74t51", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "xx00xx00xx", "parent_id": "t1_dg6xftn", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "&gt; \"Inability to rebind controls\" makes a game bad?!\n\nA title lacking basic control options is the gaming equivalent of a restaurant with an 'F' rating from the health department.  It shows that the developer is lazy and/or probably doesn't know how to code.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Inability to rebind controls&amp;quot; makes a game bad?!&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A title lacking basic control options is the gaming equivalent of a restaurant with an &amp;#39;F&amp;#39; rating from the health department.  It shows that the developer is lazy and/or probably doesn&amp;#39;t know how to code.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg74t51", "score_hidden": false, "stickied": false, "created": 1492085963.0, "created_utc": 1492057163.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xftn", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "my-alt-account-", "parent_id": "t1_dg6hxv5", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "\"Inability to rebind controls\" makes a game bad?! \n\nAlso, a well-designed game might not require any tutorial.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Inability to rebind controls&amp;quot; makes a game bad?! &lt;/p&gt;\n\n&lt;p&gt;Also, a well-designed game might not require any tutorial.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6xftn", "score_hidden": false, "stickied": false, "created": 1492076060.0, "created_utc": 1492047260.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg6p2p5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "graspee", "parent_id": "t1_dg6ogqu", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "I never claimed a game had to have awesome visuals though. All the things I specified should be easy to add except the tutorial which could be a bit of work.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I never claimed a game had to have awesome visuals though. All the things I specified should be easy to add except the tutorial which could be a bit of work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6p2p5", "score_hidden": false, "stickied": false, "created": 1492065797.0, "created_utc": 1492036997.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ogqu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bartold", "parent_id": "t1_dg6ny31", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Yeah, you are right, game quality is made of many different factors. However, I believe that good gameplay design with strong fun factor is the most important part, especially when we're talking about smaller games which can't stun you with awesome visuals etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, you are right, game quality is made of many different factors. However, I believe that good gameplay design with strong fun factor is the most important part, especially when we&amp;#39;re talking about smaller games which can&amp;#39;t stun you with awesome visuals etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6ogqu", "score_hidden": false, "stickied": false, "created": 1492065053.0, "created_utc": 1492036253.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ny31", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "graspee", "parent_id": "t1_dg6noge", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "I assumed we were talking about pc games. If a version of pacman or tetris came out now without rebindable controls then it is a bad game. If one came out without a tutorial (if people didn't know about pacman or tetris) then it would be bad. If they added cutscenes with dialogue and had no subs it would be bad too. etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I assumed we were talking about pc games. If a version of pacman or tetris came out now without rebindable controls then it is a bad game. If one came out without a tutorial (if people didn&amp;#39;t know about pacman or tetris) then it would be bad. If they added cutscenes with dialogue and had no subs it would be bad too. etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6ny31", "score_hidden": false, "stickied": false, "created": 1492064401.0, "created_utc": 1492035601.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6noge", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "bartold", "parent_id": "t1_dg6hxv5", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "You just smashed Pacman and Tetris ;&lt;", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You just smashed Pacman and Tetris ;&amp;lt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6noge", "score_hidden": false, "stickied": false, "created": 1492064069.0, "created_utc": 1492035269.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6hxv5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "graspee", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Inability to rebind controls.  \nNo tutorial.  \nNo subtitles.  \nUse of an overused asset pack  e.g. Oryx sprite pack for a roguelike.  \nNo fullscreen or no windowed or no fullscreen windowed.  \nLocked max fps or max resolution.  \nNo graphic options.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Inability to rebind controls.&lt;br/&gt;\nNo tutorial.&lt;br/&gt;\nNo subtitles.&lt;br/&gt;\nUse of an overused asset pack  e.g. Oryx sprite pack for a roguelike.&lt;br/&gt;\nNo fullscreen or no windowed or no fullscreen windowed.&lt;br/&gt;\nLocked max fps or max resolution.&lt;br/&gt;\nNo graphic options.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6hxv5", "score_hidden": false, "stickied": false, "created": 1492057496.0, "created_utc": 1492028696.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg7109l", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Skerper", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "These are the things off the top of my head that have actually caused me to stop playing a game and uninstall it:\n\n * **Lack of sticky friction**: Metro 2033 and Tera are probably the two worst examples of this I ever played. Games that just give the user no real feedback, no sense of weight or impact in your motions. In metro, for example, no matter where you shoot enemies, they don't react until they die. The transition into the dying animation is very slow, so it's hard to tell if you're causing damage or if you're shooting an enemy that's already dead. It's especially easy to see this difference when one game in a series gets it right and another gets it wrong - for example, comparing RE5 to RE6. The latter has much poorer feedback for enemy damage. \n\n**Solution**: It should be immediately clear to the player whether their actions are having an effect. The player should never be left wondering \"am I doing the wrong thing, or is there just no animation for this action?\". \n\n * **Frustration by design**: This sort of thing comes up quite often, because it's very easy to think \"how can I make this more difficult\", but the measure you come up with ends up being something that simply annoys the player. Regular enemies with one-hit-kills attacks, weak enemies that can perma-bash due to their bash proc cooldown being shorter than the duration of their bash effect, penalties with dire implications for things that were not clearly due being punished (for example, losing a large amount of HP in a survival game for leaving the game area when the game area was not clearly defined). Mobile games leverage this sort of thing intentionally by then giving you the option to (literally) buy your way out of frustration. \n\n**Solution**: It's very important to consider any penalties you put on your player in terms of the bigger picture. Arbitrarily picked values or penalties that seem appropriate intuitively may actually frustrate your player to tears in the context of a level or situation. Penalties that were intended to be minor but compell your player to reload from a previous save file should be avoided at all costs.\n\n * **Poor visual distinction**: I think probably the worst offender of this one I've seen in recent years is Final Fantasy 14. Essentially, you've got all this beautiful art and detail and it looks quite realistic and vibrant, but there's very little to visually separate the things that are important to gameplay (your character, enemies, items) from the environment and scenery. It might be unrealistic for your character to be brighter or outlined, but it's positively eyestrain inducing to have your character and the enemies act like a Where's Waldo puzzle. I played FFXIV for a month as a ranged hero, and I can honestly say I can't even remember what any of the monsters looked like. Most of them blended into the background enough that I could complete entire story arcs without ever seeing what I was shooting. \n\n**Solution**: It's very easy to lose track of this one because when you iteratively are adding things to your game, you're training your eyes to decode the game screen. If you add a player to the backdrop, you'll immediately notice the player, and the lack of distinction will not be obvious because you know what you're looking for. It's important to get fresh eyes on your project and get feedback about readability. \n\n * **Trigger-related glitches**: You'd think this would be a priority but it's something that crops up even in AAA titles with alarming frequency -- when doing what the story tells you to do doesn't actually trigger the next step of the quest. Usually this is caused by unhandled edge cases and insufficient testing. This immediately destroys immersion - the player begins thinking \"what do I need to do to convince the game to progress\", rather than thinking in terms of the story. The worst example of this I encountered was Gothic 3, where it seemed that you needed to enter rooms or cities from specific paths or angles to get the story to progress. I don't even know if this was the cause, but I often found myself retracing steps to try to figure out what the game \"wanted\", even though I'd already completed all the in-universe steps of the current quest. A surprisingly bad example was Resident Evil 5, in which you will find an enormous amount of complaints about a boss that simply won't die. I'm not sure what triggered the issue, but most resorted to buying a rocket launcher and cheesing; something that made no sense in the context of the mission where you were provided with a flamethrower and didn't really have time to nip down to the store. \n\n**Solution**: Triggers need to be tied as closely as possible to the in-universe required actions. If the quest says \"find 5 goose eggs then talk to me\", the script triggers should match this. Edge cases such as \"the player bought them from the store\", \"the player found 6\", \"the player already has 5 when the quest begins\" should all be handled - and preferably they should be handled implicitly, not explicitly. Quests which require hidden specificity must be avoided at all costs.", "edited": 1492066941.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;These are the things off the top of my head that have actually caused me to stop playing a game and uninstall it:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Lack of sticky friction&lt;/strong&gt;: Metro 2033 and Tera are probably the two worst examples of this I ever played. Games that just give the user no real feedback, no sense of weight or impact in your motions. In metro, for example, no matter where you shoot enemies, they don&amp;#39;t react until they die. The transition into the dying animation is very slow, so it&amp;#39;s hard to tell if you&amp;#39;re causing damage or if you&amp;#39;re shooting an enemy that&amp;#39;s already dead. It&amp;#39;s especially easy to see this difference when one game in a series gets it right and another gets it wrong - for example, comparing RE5 to RE6. The latter has much poorer feedback for enemy damage. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Solution&lt;/strong&gt;: It should be immediately clear to the player whether their actions are having an effect. The player should never be left wondering &amp;quot;am I doing the wrong thing, or is there just no animation for this action?&amp;quot;. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Frustration by design&lt;/strong&gt;: This sort of thing comes up quite often, because it&amp;#39;s very easy to think &amp;quot;how can I make this more difficult&amp;quot;, but the measure you come up with ends up being something that simply annoys the player. Regular enemies with one-hit-kills attacks, weak enemies that can perma-bash due to their bash proc cooldown being shorter than the duration of their bash effect, penalties with dire implications for things that were not clearly due being punished (for example, losing a large amount of HP in a survival game for leaving the game area when the game area was not clearly defined). Mobile games leverage this sort of thing intentionally by then giving you the option to (literally) buy your way out of frustration. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Solution&lt;/strong&gt;: It&amp;#39;s very important to consider any penalties you put on your player in terms of the bigger picture. Arbitrarily picked values or penalties that seem appropriate intuitively may actually frustrate your player to tears in the context of a level or situation. Penalties that were intended to be minor but compell your player to reload from a previous save file should be avoided at all costs.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Poor visual distinction&lt;/strong&gt;: I think probably the worst offender of this one I&amp;#39;ve seen in recent years is Final Fantasy 14. Essentially, you&amp;#39;ve got all this beautiful art and detail and it looks quite realistic and vibrant, but there&amp;#39;s very little to visually separate the things that are important to gameplay (your character, enemies, items) from the environment and scenery. It might be unrealistic for your character to be brighter or outlined, but it&amp;#39;s positively eyestrain inducing to have your character and the enemies act like a Where&amp;#39;s Waldo puzzle. I played FFXIV for a month as a ranged hero, and I can honestly say I can&amp;#39;t even remember what any of the monsters looked like. Most of them blended into the background enough that I could complete entire story arcs without ever seeing what I was shooting. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Solution&lt;/strong&gt;: It&amp;#39;s very easy to lose track of this one because when you iteratively are adding things to your game, you&amp;#39;re training your eyes to decode the game screen. If you add a player to the backdrop, you&amp;#39;ll immediately notice the player, and the lack of distinction will not be obvious because you know what you&amp;#39;re looking for. It&amp;#39;s important to get fresh eyes on your project and get feedback about readability. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Trigger-related glitches&lt;/strong&gt;: You&amp;#39;d think this would be a priority but it&amp;#39;s something that crops up even in AAA titles with alarming frequency -- when doing what the story tells you to do doesn&amp;#39;t actually trigger the next step of the quest. Usually this is caused by unhandled edge cases and insufficient testing. This immediately destroys immersion - the player begins thinking &amp;quot;what do I need to do to convince the game to progress&amp;quot;, rather than thinking in terms of the story. The worst example of this I encountered was Gothic 3, where it seemed that you needed to enter rooms or cities from specific paths or angles to get the story to progress. I don&amp;#39;t even know if this was the cause, but I often found myself retracing steps to try to figure out what the game &amp;quot;wanted&amp;quot;, even though I&amp;#39;d already completed all the in-universe steps of the current quest. A surprisingly bad example was Resident Evil 5, in which you will find an enormous amount of complaints about a boss that simply won&amp;#39;t die. I&amp;#39;m not sure what triggered the issue, but most resorted to buying a rocket launcher and cheesing; something that made no sense in the context of the mission where you were provided with a flamethrower and didn&amp;#39;t really have time to nip down to the store. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Solution&lt;/strong&gt;: Triggers need to be tied as closely as possible to the in-universe required actions. If the quest says &amp;quot;find 5 goose eggs then talk to me&amp;quot;, the script triggers should match this. Edge cases such as &amp;quot;the player bought them from the store&amp;quot;, &amp;quot;the player found 6&amp;quot;, &amp;quot;the player already has 5 when the quest begins&amp;quot; should all be handled - and preferably they should be handled implicitly, not explicitly. Quests which require hidden specificity must be avoided at all costs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg7109l", "score_hidden": false, "stickied": false, "created": 1492080533.0, "created_utc": 1492051733.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg8b3rt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "braytendo", "parent_id": "t1_dg87sjo", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "It sounds like you're coming at this from an angle of profit. I guess I assumed when making my post that the discussion would be purely on the quality of the game itself. Sure, anyone can cheat the system and convince a player that they're engaged, but I don't know if I can get behind that style of development.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you&amp;#39;re coming at this from an angle of profit. I guess I assumed when making my post that the discussion would be purely on the quality of the game itself. Sure, anyone can cheat the system and convince a player that they&amp;#39;re engaged, but I don&amp;#39;t know if I can get behind that style of development.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg8b3rt", "score_hidden": false, "stickied": false, "created": 1492149993.0, "created_utc": 1492121193.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87sjo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "3fox", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "* **Lack of engagement.**\n\nThere is only one thing a game really has to do, and that is, engage players. That doesn't mean that it's fun or fulfilling, though you might want those things if you want to retain anyone for the long term. But \"low quality\" forms of engagement like playing more matches so that you can keep up your ladder ranking, grinding up your levels, or returning to the game periodically because of notifications and event timers - those are all prolific, and none of them are particularly great as ends in and of themselves.\n\nSo then, what's the answer here? Follow the crowd and make every game a casino game that pushes those same buttons? I don't think that's exactly right; you have to find a new form of engagement if you really want to interest anyone. When making a premium game, in fact, all the market-crucial engagement is happening before the game is purchased, as hype is built up for the experience that will take place. The experience itself might be somewhat vanilla, but something about the marketing message that built up to it made it good enough to trigger a purchase. And that gap allows a lot of games to be bad by being *disappointing* - by saying one thing and then delivering another. Games that are just bad all around don't even get that far because you aren't even given a chance to believe in them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Lack of engagement.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;There is only one thing a game really has to do, and that is, engage players. That doesn&amp;#39;t mean that it&amp;#39;s fun or fulfilling, though you might want those things if you want to retain anyone for the long term. But &amp;quot;low quality&amp;quot; forms of engagement like playing more matches so that you can keep up your ladder ranking, grinding up your levels, or returning to the game periodically because of notifications and event timers - those are all prolific, and none of them are particularly great as ends in and of themselves.&lt;/p&gt;\n\n&lt;p&gt;So then, what&amp;#39;s the answer here? Follow the crowd and make every game a casino game that pushes those same buttons? I don&amp;#39;t think that&amp;#39;s exactly right; you have to find a new form of engagement if you really want to interest anyone. When making a premium game, in fact, all the market-crucial engagement is happening before the game is purchased, as hype is built up for the experience that will take place. The experience itself might be somewhat vanilla, but something about the marketing message that built up to it made it good enough to trigger a purchase. And that gap allows a lot of games to be bad by being &lt;em&gt;disappointing&lt;/em&gt; - by saying one thing and then delivering another. Games that are just bad all around don&amp;#39;t even get that far because you aren&amp;#39;t even given a chance to believe in them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg87sjo", "score_hidden": false, "stickied": false, "created": 1492145929.0, "created_utc": 1492117129.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg97co5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "devtodev", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "I'd add that the download speed is surprisingly extremely important, especially during the first session. One our clients integrated a 120-step funnel into the tutorial and saw that the biggest user exit rate occurs during the 'invisible' steps for the user, when layers and levels are being downloaded. 40% of all of the users who dropped out during the tutorial simply didn't want to wait long enough until it was fully downloaded", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d add that the download speed is surprisingly extremely important, especially during the first session. One our clients integrated a 120-step funnel into the tutorial and saw that the biggest user exit rate occurs during the &amp;#39;invisible&amp;#39; steps for the user, when layers and levels are being downloaded. 40% of all of the users who dropped out during the tutorial simply didn&amp;#39;t want to wait long enough until it was fully downloaded&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg97co5", "score_hidden": false, "stickied": false, "created": 1492209362.0, "created_utc": 1492180562.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg6h3bt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theroarer", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Taking autonomy away from the player.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Taking autonomy away from the player.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6h3bt", "score_hidden": false, "stickied": false, "created": 1492056629.0, "created_utc": 1492027829.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_64z7w8", "likes": null, "replies": "", "user_reports": [], "id": "dg6q1kz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mallenjordan", "parent_id": "t1_dg6pp06", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "That is exactly what I meant. These games are great. I can think of hundreds of games I had a good time playing and eventually either beating and never having to return to.. Or playing so much I burnt out on them and returning to them just is not as fun as the memory of playing them fresh.\n\nHave you gone back and played Pac Man, NES Super Mario Bros. etc? I have and they are not as fun as I remembered, and game play length isn't nearly as long. Even with these new modern mobile games coming out for a hand full of old titles they are not that fun even revisited.", "edited": 1492038779.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is exactly what I meant. These games are great. I can think of hundreds of games I had a good time playing and eventually either beating and never having to return to.. Or playing so much I burnt out on them and returning to them just is not as fun as the memory of playing them fresh.&lt;/p&gt;\n\n&lt;p&gt;Have you gone back and played Pac Man, NES Super Mario Bros. etc? I have and they are not as fun as I remembered, and game play length isn&amp;#39;t nearly as long. Even with these new modern mobile games coming out for a hand full of old titles they are not that fun even revisited.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6q1kz", "score_hidden": false, "stickied": false, "created": 1492066995.0, "created_utc": 1492038195.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pp06", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RatherNott", "parent_id": "t1_dg6i80c", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "That thought process tends to only work for competitive games, though.\n\nFor instance I think [Another World](https://www.youtube.com/watch?v=c6MEXp5AvVw) is one of the best games ever made, but I'd likely only replay it once every 5 or 10 years, due to its linear nature.", "edited": 1492047939.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That thought process tends to only work for competitive games, though.&lt;/p&gt;\n\n&lt;p&gt;For instance I think &lt;a href=\"https://www.youtube.com/watch?v=c6MEXp5AvVw\"&gt;Another World&lt;/a&gt; is one of the best games ever made, but I&amp;#39;d likely only replay it once every 5 or 10 years, due to its linear nature.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6pp06", "score_hidden": false, "stickied": false, "created": 1492066556.0, "created_utc": 1492037756.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6i80c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mallenjordan", "parent_id": "t3_64z7w8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "This is a slippery slope to view.\n\nThe reason is think of a perfect game.\nOr how you would feel playing a perfect game.\nAnd now picture playing that same game for 10 years, say an average of 3 hours a day. 3 hours being a average daily playing per every player, ever. \n\nThat amazingly over 10 years comes to just under 11,000 hours game play.\n\nEven with it being perfect, it becomes boring because we also will eventually crave change.\n\nStarcraft 2 is probably the closest thing I could think of in a full game, which has lasted for a good long time and still has a game base large with players still. But even then playing it gets repetitive and slightly boring after you have beaten campaign, played many networked games, and know all the races and tactics.\n\nThere is no real way to avoid hitting the levels of mass exodus on the games we create. That is why it is also tightly tied into social communication and media.\n\nIf it isn't hip, people wont play.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a slippery slope to view.&lt;/p&gt;\n\n&lt;p&gt;The reason is think of a perfect game.\nOr how you would feel playing a perfect game.\nAnd now picture playing that same game for 10 years, say an average of 3 hours a day. 3 hours being a average daily playing per every player, ever. &lt;/p&gt;\n\n&lt;p&gt;That amazingly over 10 years comes to just under 11,000 hours game play.&lt;/p&gt;\n\n&lt;p&gt;Even with it being perfect, it becomes boring because we also will eventually crave change.&lt;/p&gt;\n\n&lt;p&gt;Starcraft 2 is probably the closest thing I could think of in a full game, which has lasted for a good long time and still has a game base large with players still. But even then playing it gets repetitive and slightly boring after you have beaten campaign, played many networked games, and know all the races and tactics.&lt;/p&gt;\n\n&lt;p&gt;There is no real way to avoid hitting the levels of mass exodus on the games we create. That is why it is also tightly tied into social communication and media.&lt;/p&gt;\n\n&lt;p&gt;If it isn&amp;#39;t hip, people wont play.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dg6i80c", "score_hidden": false, "stickied": false, "created": 1492057787.0, "created_utc": 1492028987.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]