[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "gamedev", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Howdy fellow developers. Olivers from Oneshark here. For the past 8.5 months we&amp;#39;ve been working on our second game-Twist of Destiny which is turn based adventure RPG. see \n&lt;a href=\"https://www.youtube.com/watch?v=nxBgPM4o__4\"&gt;trailer:&lt;/a&gt;\nAnd so we launched Early Access April 13/14th at midnight. But so far there&amp;#39;s nothing much seems to going on. Also we contacted about 200youtubers and various gaming websites. There&amp;#39;s not a single new gameplay video out there yet.\nIs this by any chance related to Easter or being the weekend?Or bad timing to release game on steam? Thanks for your time and have a great day!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Howdy fellow developers. Olivers from Oneshark here. For the past 8.5 months we've been working on our second game-Twist of Destiny which is turn based adventure RPG. see \n[trailer:](https://www.youtube.com/watch?v=nxBgPM4o__4)\nAnd so we launched Early Access April 13/14th at midnight. But so far there's nothing much seems to going on. Also we contacted about 200youtubers and various gaming websites. There's not a single new gameplay video out there yet.\nIs this by any chance related to Easter or being the weekend?Or bad timing to release game on steam? Thanks for your time and have a great day!\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Question", "id": "65iqce", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "diploms1", "saved": false, "mod_reports": [], "name": "t3_65iqce", "subreddit_name_prefixed": "r/gamedev", "approved_by": null, "over_18": false, "domain": "self.gamedev", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qi0a", "edited": false, "link_flair_css_class": "question", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/gamedev/comments/65iqce/launched_steam_early_access_game_but_receive/", "num_reports": null, "locked": false, "stickied": false, "created": 1492286297.0, "url": "https://www.reddit.com/r/gamedev/comments/65iqce/launched_steam_early_access_game_but_receive/", "author_flair_text": null, "quarantine": false, "title": "Launched Steam Early Access game but receive little to no attention?", "created_utc": 1492257497.0, "distinguished": null, "media": null, "upvote_ratio": 0.7, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": "", "user_reports": [], "id": "dgawkzg", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "TeTonicGames", "parent_id": "t3_65iqce", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Warning: Some incoming negative comments. It's far easier to criticize than create, and I'm incredibly far from a marketing expert, and everything I do know are just things taught by others in the industry, but I do invest a large amount of time in learning how to market effectively, so maybe something here can be of some use to you.  \n\nA positive point: Your art direction is good enough for your game to be taken seriously. Which is saying a lot given the number of games out there of varying quality. \n\nI'm going to focus on your trailer, as I think in a situation like this where no one is playing or talking about your game in the media, it's really the single biggest deciding factor for people playing your game:\n\n1) Unless you have a brand that means something to people, there is no point having a title card at the beginning of your trailer. To be blunt, and hopefully not mean, no one cares who you are. It's just 3-4 seconds of not getting to the point, and it is where you may lose some viewers for no actual reason. Put it at the end of the video to build your brand.   \n\n2) Your intro where you're blasting through the landscape is kinda janky and hurts my eyes. I assume the intention is for the fast pace to create excitement and grab the viewers attention, but I don't think it achieves this and is completely at odds with the music.  \n\n3) I barely have any idea of what's going on during most of your trailer. I agree with the idea of not spending to much time before cutting, but I think it needs to be more cohesive. Your cuts feel completely random and arbitrary, which makes it hard for me to keep up with what's going on.\n\n4) Your ending slate should have links to your website and all your social accounts.\n\n5) Probably the biggest problem in my opinion: You've really shown me no reason why I'd actually want to play your game. I've watched the trailer, and I don't really know anything besides it's a turn-based RPG with levels, items, and equipment. Which is really every RPG. Is there a story? How do I level up? Can I customize my abilities? Are there any twists on the turn-based combat? Even if I do watch the full trailer, I not really shown any reason for me to pick your game out of the sea of other games. \n\nThere was a lot of negativity, so I hope this didn't come across too poorly. This was just my initial impression after seeing your trailer, so I don't claim this as gospel. As a side note, I think many people choose not to pick up a turn-based story RPG in early access. If they are interested, they wait until it's done and the experience is complete. So maybe you'll see better numbers upon actual release?   \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Warning: Some incoming negative comments. It&amp;#39;s far easier to criticize than create, and I&amp;#39;m incredibly far from a marketing expert, and everything I do know are just things taught by others in the industry, but I do invest a large amount of time in learning how to market effectively, so maybe something here can be of some use to you.  &lt;/p&gt;\n\n&lt;p&gt;A positive point: Your art direction is good enough for your game to be taken seriously. Which is saying a lot given the number of games out there of varying quality. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to focus on your trailer, as I think in a situation like this where no one is playing or talking about your game in the media, it&amp;#39;s really the single biggest deciding factor for people playing your game:&lt;/p&gt;\n\n&lt;p&gt;1) Unless you have a brand that means something to people, there is no point having a title card at the beginning of your trailer. To be blunt, and hopefully not mean, no one cares who you are. It&amp;#39;s just 3-4 seconds of not getting to the point, and it is where you may lose some viewers for no actual reason. Put it at the end of the video to build your brand.   &lt;/p&gt;\n\n&lt;p&gt;2) Your intro where you&amp;#39;re blasting through the landscape is kinda janky and hurts my eyes. I assume the intention is for the fast pace to create excitement and grab the viewers attention, but I don&amp;#39;t think it achieves this and is completely at odds with the music.  &lt;/p&gt;\n\n&lt;p&gt;3) I barely have any idea of what&amp;#39;s going on during most of your trailer. I agree with the idea of not spending to much time before cutting, but I think it needs to be more cohesive. Your cuts feel completely random and arbitrary, which makes it hard for me to keep up with what&amp;#39;s going on.&lt;/p&gt;\n\n&lt;p&gt;4) Your ending slate should have links to your website and all your social accounts.&lt;/p&gt;\n\n&lt;p&gt;5) Probably the biggest problem in my opinion: You&amp;#39;ve really shown me no reason why I&amp;#39;d actually want to play your game. I&amp;#39;ve watched the trailer, and I don&amp;#39;t really know anything besides it&amp;#39;s a turn-based RPG with levels, items, and equipment. Which is really every RPG. Is there a story? How do I level up? Can I customize my abilities? Are there any twists on the turn-based combat? Even if I do watch the full trailer, I not really shown any reason for me to pick your game out of the sea of other games. &lt;/p&gt;\n\n&lt;p&gt;There was a lot of negativity, so I hope this didn&amp;#39;t come across too poorly. This was just my initial impression after seeing your trailer, so I don&amp;#39;t claim this as gospel. As a side note, I think many people choose not to pick up a turn-based story RPG in early access. If they are interested, they wait until it&amp;#39;s done and the experience is complete. So maybe you&amp;#39;ll see better numbers upon actual release?   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgawkzg", "score_hidden": false, "stickied": false, "created": 1492305930.0, "created_utc": 1492277130.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": "", "user_reports": [], "id": "dgaural", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Serendone", "parent_id": "t3_65iqce", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "I'm gonna throw my two cents into the ring here. \n\nFirst off, your trailer. It's decent. You get to the gameplay in a reasonable amount of time and I'm able to understand what kind of game this is just by watching. Music is a little bombastic and generic, and the end of the trailer just kind of peters out instead of carrying along that energy. Along that note, this is an RPG, so your promotional material works well when paired with *story* context. Who are the important characters? Why are we fighting this dude? What is our goal in this game? What makes this world unique? When I watch the footage I know what the gameplay is but I don't really understand what the premise is. All I see are people running around or battling against different backdrops. RPGs have an inherent strength in the environment and characters, so make sure to show that off. \n\nWhat definitely doesn't sell me on this game is it being in early access. I dislike EA as a whole, but even I'll admit that if you're gonna go that route, it works better with certain game genres over others. EA is more for games that could use stress testing or prototyping and feedback on a crazy new or ambitious concept. Games where the story and aesthetic aren't the selling point. An RPG (on anything smaller than an MMO scale) in early access makes me, as a consumer, think I'm buying into something lazily unfinished. If you're going EA to backload development of additional content, such as worlds or dungeons, you should probably just push that out as free or low-cost DLC, unless your game's story hinges on such content. Get the game into release state and you will probably see an uptick in sales due to you presenting the game as a finished, cohesive experience. This is what will draw in players that are on the fence. \n\nFinally, you mentioned you contacted \"various gaming websites.\" Do you have a press kit for this game? Games journalists love those, and it makes it easier for them to talk about your game if you supply the visuals and the copy yourself. Consider making a press kit for your game, a Google search will pull up articles on how to do so and it takes hardly any time. \n\ntl;dr the trailer has no personality, the game isn't really a good fit for EA, and it may not be well-equipped for the media.\n\nIt looks like a pretty fun game though. I wish you the best of luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m gonna throw my two cents into the ring here. &lt;/p&gt;\n\n&lt;p&gt;First off, your trailer. It&amp;#39;s decent. You get to the gameplay in a reasonable amount of time and I&amp;#39;m able to understand what kind of game this is just by watching. Music is a little bombastic and generic, and the end of the trailer just kind of peters out instead of carrying along that energy. Along that note, this is an RPG, so your promotional material works well when paired with &lt;em&gt;story&lt;/em&gt; context. Who are the important characters? Why are we fighting this dude? What is our goal in this game? What makes this world unique? When I watch the footage I know what the gameplay is but I don&amp;#39;t really understand what the premise is. All I see are people running around or battling against different backdrops. RPGs have an inherent strength in the environment and characters, so make sure to show that off. &lt;/p&gt;\n\n&lt;p&gt;What definitely doesn&amp;#39;t sell me on this game is it being in early access. I dislike EA as a whole, but even I&amp;#39;ll admit that if you&amp;#39;re gonna go that route, it works better with certain game genres over others. EA is more for games that could use stress testing or prototyping and feedback on a crazy new or ambitious concept. Games where the story and aesthetic aren&amp;#39;t the selling point. An RPG (on anything smaller than an MMO scale) in early access makes me, as a consumer, think I&amp;#39;m buying into something lazily unfinished. If you&amp;#39;re going EA to backload development of additional content, such as worlds or dungeons, you should probably just push that out as free or low-cost DLC, unless your game&amp;#39;s story hinges on such content. Get the game into release state and you will probably see an uptick in sales due to you presenting the game as a finished, cohesive experience. This is what will draw in players that are on the fence. &lt;/p&gt;\n\n&lt;p&gt;Finally, you mentioned you contacted &amp;quot;various gaming websites.&amp;quot; Do you have a press kit for this game? Games journalists love those, and it makes it easier for them to talk about your game if you supply the visuals and the copy yourself. Consider making a press kit for your game, a Google search will pull up articles on how to do so and it takes hardly any time. &lt;/p&gt;\n\n&lt;p&gt;tl;dr the trailer has no personality, the game isn&amp;#39;t really a good fit for EA, and it may not be well-equipped for the media.&lt;/p&gt;\n\n&lt;p&gt;It looks like a pretty fun game though. I wish you the best of luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgaural", "score_hidden": false, "stickied": false, "created": 1492303431.0, "created_utc": 1492274631.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": "", "user_reports": [], "id": "dgavh9t", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "xx00xx00xx", "parent_id": "t3_65iqce", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Personally I think early access for single player games is no longer a viable option.  Lots of projects get abandoned if they fail to take off and this puts a lot of risk on the buyers.\n\nSince the risk/reward ratio for buyers is skewed I believe we're going to see early access developers forced to make steep discounts to attract more interest.  There are just too many good, complete games on Steam competing for the same $$$.\n\nGood luck with the game it looks really interesting and the art is great.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally I think early access for single player games is no longer a viable option.  Lots of projects get abandoned if they fail to take off and this puts a lot of risk on the buyers.&lt;/p&gt;\n\n&lt;p&gt;Since the risk/reward ratio for buyers is skewed I believe we&amp;#39;re going to see early access developers forced to make steep discounts to attract more interest.  There are just too many good, complete games on Steam competing for the same $$$.&lt;/p&gt;\n\n&lt;p&gt;Good luck with the game it looks really interesting and the art is great.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgavh9t", "score_hidden": false, "stickied": false, "created": 1492304431.0, "created_utc": 1492275631.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": "", "user_reports": [], "id": "dgas819", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "diploms1", "parent_id": "t1_dganxd8", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Thanks man. That was our goal-go for bizarre kind of tim burton inspired fantasy rather than the classical mage/archer &amp; knight rpg. But it's definitely not for everybody hehe :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks man. That was our goal-go for bizarre kind of tim burton inspired fantasy rather than the classical mage/archer &amp;amp; knight rpg. But it&amp;#39;s definitely not for everybody hehe :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgas819", "score_hidden": false, "stickied": false, "created": 1492299876.0, "created_utc": 1492271076.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dganxd8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LongestLiving", "parent_id": "t3_65iqce", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Maybe create a playable demo with first 15-30 minute of gameplay to hook people up. \n\nIdk about that trailer, music not that great for the action imho, and the playable characters are creepy as f. I love your enemy design tho. Not my cuppa tea tbh even though i played caddilac and dinosaurs and alien vs predator in last 3 months this doesnt look good to me. Maybe if you explained game mechanics better in trailer.\n\nAnyway good luck guys, hopefully after easter it will blow out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe create a playable demo with first 15-30 minute of gameplay to hook people up. &lt;/p&gt;\n\n&lt;p&gt;Idk about that trailer, music not that great for the action imho, and the playable characters are creepy as f. I love your enemy design tho. Not my cuppa tea tbh even though i played caddilac and dinosaurs and alien vs predator in last 3 months this doesnt look good to me. Maybe if you explained game mechanics better in trailer.&lt;/p&gt;\n\n&lt;p&gt;Anyway good luck guys, hopefully after easter it will blow out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dganxd8", "score_hidden": false, "stickied": false, "created": 1492293292.0, "created_utc": 1492264492.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": "", "user_reports": [], "id": "dgb1kpw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sipos542", "parent_id": "t3_65iqce", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "I have a game on Early Access too. Its pretty hard to get steady buyers since there is so much competition. The visibility rounds really don't help that much either. What I am finding helps the most is finding random twitch users to play your game for free and watch them play it. Honestly it takes a lot of play testing to work out all the kinks and get the gamplay to the level of fun you wish to achieve. You want to get to the point were the gameplay is addictive and fun and people start spreading your game by word of mouth. Once you have reached that point you don't really have to do much as the came starts marketing itself. But it takes a long time and brutal work to get to that point. Its all about building a community and making your followers satisfied. Once your game has reached a level of polish you can do full release. I am about to do full release in 2 weeks. I will let you know how it goes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a game on Early Access too. Its pretty hard to get steady buyers since there is so much competition. The visibility rounds really don&amp;#39;t help that much either. What I am finding helps the most is finding random twitch users to play your game for free and watch them play it. Honestly it takes a lot of play testing to work out all the kinks and get the gamplay to the level of fun you wish to achieve. You want to get to the point were the gameplay is addictive and fun and people start spreading your game by word of mouth. Once you have reached that point you don&amp;#39;t really have to do much as the came starts marketing itself. But it takes a long time and brutal work to get to that point. Its all about building a community and making your followers satisfied. Once your game has reached a level of polish you can do full release. I am about to do full release in 2 weeks. I will let you know how it goes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgb1kpw", "score_hidden": false, "stickied": false, "created": 1492312696.0, "created_utc": 1492283896.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": "", "user_reports": [], "id": "dgbaj3l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "epeternally", "parent_id": "t1_dgb96eo", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Early access is definitely something to be wary of. You're essentially putting the decision about when your game is ready to ship in the hands of your customers. If you call it a 1.0 release before your community feels the game is ready, you're looking at being bombarded into oblivion with negative reviews. Indefinite support is expected of all indies these days but it's that much worse if your game went through early access. People immediately associate that model of development with Minecraft, which leads to similar expectations of an ever expanding game. Obviously this doesn't happen in every case, but it's worth being aware of. If you aren't confident that you can spend twice as much time on your game as you think it needs while making no meaningful amount of money from it, don't release a game in early access.", "edited": 1492296619.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Early access is definitely something to be wary of. You&amp;#39;re essentially putting the decision about when your game is ready to ship in the hands of your customers. If you call it a 1.0 release before your community feels the game is ready, you&amp;#39;re looking at being bombarded into oblivion with negative reviews. Indefinite support is expected of all indies these days but it&amp;#39;s that much worse if your game went through early access. People immediately associate that model of development with Minecraft, which leads to similar expectations of an ever expanding game. Obviously this doesn&amp;#39;t happen in every case, but it&amp;#39;s worth being aware of. If you aren&amp;#39;t confident that you can spend twice as much time on your game as you think it needs while making no meaningful amount of money from it, don&amp;#39;t release a game in early access.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgbaj3l", "score_hidden": false, "stickied": false, "created": 1492325072.0, "created_utc": 1492296272.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb96eo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SeeSharpGuy", "parent_id": "t3_65iqce", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Very relevant post for me team. We plan to do early access as well but I have given serious thought to not doing it because of this video https://youtu.be/6xCYoQ-hyu0", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very relevant post for me team. We plan to do early access as well but I have given serious thought to not doing it because of this video &lt;a href=\"https://youtu.be/6xCYoQ-hyu0\"&gt;https://youtu.be/6xCYoQ-hyu0&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgb96eo", "score_hidden": false, "stickied": false, "created": 1492323116.0, "created_utc": 1492294316.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": "", "user_reports": [], "id": "dgbfhmj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kondor0", "parent_id": "t3_65iqce", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "That's just normal. Did your 1st. game made it big? because your expectations sound a bit off.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s just normal. Did your 1st. game made it big? because your expectations sound a bit off.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgbfhmj", "score_hidden": false, "stickied": false, "created": 1492332180.0, "created_utc": 1492303380.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": "", "user_reports": [], "id": "dgbmue0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zase8", "parent_id": "t3_65iqce", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "It's only been a couple days, you can't expect to make millions overnight.\n\n200 youtubers seems like a lot, did you just go after random big youtubers? You should try to find your niche, find youtubers who play similar games and get in touch with them. Going after Pewdiepie and Markiplier isn't really worth it. There are plenty of people here who've had Pewdiepie play their game and they didn't notice any real increase in sales. What you need are youtubers who like similar games, and who will take the time to make a proper let's play of your game. One gameplay video is usually not enough to convince someone to buy your game. You need someone who will make a series out of your game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s only been a couple days, you can&amp;#39;t expect to make millions overnight.&lt;/p&gt;\n\n&lt;p&gt;200 youtubers seems like a lot, did you just go after random big youtubers? You should try to find your niche, find youtubers who play similar games and get in touch with them. Going after Pewdiepie and Markiplier isn&amp;#39;t really worth it. There are plenty of people here who&amp;#39;ve had Pewdiepie play their game and they didn&amp;#39;t notice any real increase in sales. What you need are youtubers who like similar games, and who will take the time to make a proper let&amp;#39;s play of your game. One gameplay video is usually not enough to convince someone to buy your game. You need someone who will make a series out of your game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgbmue0", "score_hidden": false, "stickied": false, "created": 1492342966.0, "created_utc": 1492314166.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": "", "user_reports": [], "id": "dgakm1w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "diploms1", "parent_id": "t3_65iqce", "subreddit_name_prefixed": "r/gamedev", "controversiality": 1, "body": "And here's the [Steam page](http://store.steampowered.com/app/615150/)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And here&amp;#39;s the &lt;a href=\"http://store.steampowered.com/app/615150/\"&gt;Steam page&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgakm1w", "score_hidden": false, "stickied": false, "created": 1492286347.0, "created_utc": 1492257547.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": "", "user_reports": [], "id": "dgayz66", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "UDXS", "parent_id": "t1_dgaodu4", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "How about to the press?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How about to the press?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgayz66", "score_hidden": false, "stickied": false, "created": 1492309175.0, "created_utc": 1492280375.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaodu4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "diploms1", "parent_id": "t1_dgann7p", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Yes we did, that's the only way. without keys they won't bother.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes we did, that&amp;#39;s the only way. without keys they won&amp;#39;t bother.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgaodu4", "score_hidden": false, "stickied": false, "created": 1492294084.0, "created_utc": 1492265284.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgann7p", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "UDXS", "parent_id": "t3_65iqce", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "have you tried reaching out to youtubers with steam keys?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;have you tried reaching out to youtubers with steam keys?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgann7p", "score_hidden": false, "stickied": false, "created": 1492292789.0, "created_utc": 1492263989.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": "", "user_reports": [], "id": "dgbdzze", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "BlackOpz", "parent_id": "t1_dgauphg", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "I dont agree. The visibility sytem was only recently changed and I have a projects I've used visibility rounds on both sides of the change. Giving your game the previous 500,000 impression would still be possible today is that same system existed. Those 500K impressions would only take 2-3 days at most to display. \n\nThey have no set time to display so even if 2X the developers released than just a few months ago it would only take longer. So what 3-5 days instead? Its not an issue. Sounds like the release system have been effected also. It used to be 1 million impressions. I hope it doesnt display using the same criteria as the later rounds (cause they kinda suck).\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I dont agree. The visibility sytem was only recently changed and I have a projects I&amp;#39;ve used visibility rounds on both sides of the change. Giving your game the previous 500,000 impression would still be possible today is that same system existed. Those 500K impressions would only take 2-3 days at most to display. &lt;/p&gt;\n\n&lt;p&gt;They have no set time to display so even if 2X the developers released than just a few months ago it would only take longer. So what 3-5 days instead? Its not an issue. Sounds like the release system have been effected also. It used to be 1 million impressions. I hope it doesnt display using the same criteria as the later rounds (cause they kinda suck).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgbdzze", "score_hidden": false, "stickied": false, "created": 1492330003.0, "created_utc": 1492301203.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgauphg", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "tcbkc", "parent_id": "t1_dgaqqgp", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Kind of hard to give them all decent visibility when there are 100 new indie games released every day. And 99 of them are early access garbage.  Not really steams fault. Imo of course. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Kind of hard to give them all decent visibility when there are 100 new indie games released every day. And 99 of them are early access garbage.  Not really steams fault. Imo of course. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgauphg", "score_hidden": false, "stickied": false, "created": 1492303360.0, "created_utc": 1492274560.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qi0a", "removal_reason": null, "link_id": "t3_65iqce", "likes": null, "replies": "", "user_reports": [], "id": "dgas2uz", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "diploms1", "parent_id": "t1_dgaqqgp", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "We're keeping the visibility round for later when we add more updates and content. But true, Steam is not indie friendly. Steam on it's own doesn't do wonders, you have to have large fan base, youtubers make videos or a publisher to get that kickstart. Plus many times youtubers ask money (5digits) to make videos about your game. But in the end it's all worth it, rather fight for something creative what u like to do than ordinary safe job which you hate :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;re keeping the visibility round for later when we add more updates and content. But true, Steam is not indie friendly. Steam on it&amp;#39;s own doesn&amp;#39;t do wonders, you have to have large fan base, youtubers make videos or a publisher to get that kickstart. Plus many times youtubers ask money (5digits) to make videos about your game. But in the end it&amp;#39;s all worth it, rather fight for something creative what u like to do than ordinary safe job which you hate :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgas2uz", "score_hidden": false, "stickied": false, "created": 1492299677.0, "created_utc": 1492270877.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaqqgp", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "BlackOpz", "parent_id": "t3_65iqce", "subreddit_name_prefixed": "r/gamedev", "controversiality": 0, "body": "Just more proof that Steam isnt giving the visibility to indie titles that it once did (not too long ago). Have you tried using a visibility round? I hope its better for a EA title than established products but at least its something that could get you some more players.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just more proof that Steam isnt giving the visibility to indie titles that it once did (not too long ago). Have you tried using a visibility round? I hope its better for a EA title than established products but at least its something that could get you some more players.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "gamedev", "name": "t1_dgaqqgp", "score_hidden": false, "stickied": false, "created": 1492297772.0, "created_utc": 1492268972.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -6}}], "after": null, "before": null}}]