[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Buddhism", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This past week, my first high school GF committed suicide and left the plains for good.  We hadn&amp;#39;t spoken in a long time, but her death triggered a major existential crisis in me.  I&amp;#39;ve lost many people I&amp;#39;ve grown close to over the years, and feel like the cumulative effect of realizing all these people that populated my life are gone, while I&amp;#39;m still here has sunk me into a hole emotionally.  My memories of this past life I had with them all, the way they affected me and memories we shared seem a little less real now that they have left this Earth.  &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s the first issue I&amp;#39;m reconciling, but the one that really smacked me in the face was for some reason, this time, this person I shared so many wonderful loving experiences with is now gone forever, and I feel a separation more permanent than anything I&amp;#39;ve ever experienced.  It seems regardless of any reincarnation, that we will never cross paths again ever.  That we can&amp;#39;t possibly see one another again.  The terminal meaning of that just takes my breathe away.&lt;/p&gt;\n\n&lt;p&gt;I try to reconcile this with the fact that we all must die, and we all go through it, but it goes beyond that.  It&amp;#39;s knowing in death and even in rebirth that we only get this fleeting chance to love the people we do, and then it&amp;#39;s gone for existence.  This person, I have such cherished memories with will never again be seen or felt in presence.  Then, I will die and my memory of that will fade too, so that we both are completely erased in all memory of the universe.&lt;/p&gt;\n\n&lt;p&gt;The only possible takeaway I&amp;#39;ve been able to make is that it simply must be this way, because we cannot be connected to anyone from this life in the next.  If it were otherwise, then we&amp;#39;d have to also face the realization that we must meet again with people we hold in a strong negative light, or  perhaps people we have wronged or done serious harm.&lt;/p&gt;\n\n&lt;p&gt;What does Buddhism say about this?  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This past week, my first high school GF committed suicide and left the plains for good.  We hadn't spoken in a long time, but her death triggered a major existential crisis in me.  I've lost many people I've grown close to over the years, and feel like the cumulative effect of realizing all these people that populated my life are gone, while I'm still here has sunk me into a hole emotionally.  My memories of this past life I had with them all, the way they affected me and memories we shared seem a little less real now that they have left this Earth.  \n\nThat's the first issue I'm reconciling, but the one that really smacked me in the face was for some reason, this time, this person I shared so many wonderful loving experiences with is now gone forever, and I feel a separation more permanent than anything I've ever experienced.  It seems regardless of any reincarnation, that we will never cross paths again ever.  That we can't possibly see one another again.  The terminal meaning of that just takes my breathe away.\n\nI try to reconcile this with the fact that we all must die, and we all go through it, but it goes beyond that.  It's knowing in death and even in rebirth that we only get this fleeting chance to love the people we do, and then it's gone for existence.  This person, I have such cherished memories with will never again be seen or felt in presence.  Then, I will die and my memory of that will fade too, so that we both are completely erased in all memory of the universe.\n\nThe only possible takeaway I've been able to make is that it simply must be this way, because we cannot be connected to anyone from this life in the next.  If it were otherwise, then we'd have to also face the realization that we must meet again with people we hold in a strong negative light, or  perhaps people we have wronged or done serious harm.\n\nWhat does Buddhism say about this?  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Question", "id": "65mqao", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 46, "report_reasons": null, "author": "lifemeansnthingthrow", "saved": false, "mod_reports": [], "name": "t3_65mqao", "subreddit_name_prefixed": "r/Buddhism", "approved_by": null, "over_18": false, "domain": "self.Buddhism", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhnf", "edited": false, "link_flair_css_class": "ques", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Buddhism/comments/65mqao/death_reincarnation_and_the_end_of_any_person_i/", "num_reports": null, "locked": false, "stickied": false, "created": 1492335489.0, "url": "https://www.reddit.com/r/Buddhism/comments/65mqao/death_reincarnation_and_the_end_of_any_person_i/", "author_flair_text": null, "quarantine": false, "title": "Death, reincarnation, and the end of any person I know...", "created_utc": 1492306689.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 46}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65mqao", "likes": null, "replies": "", "user_reports": [], "id": "dgbp56b", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Sacred_Silly_Sack", "parent_id": "t3_65mqao", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "Buddhism is totally with you right up to that last paragraph where you try and draw conclusions and make meaning about what it \"means\".   \n\nBuddhism wants you to stabilize your mind through meditation so that it is strong and clear enough to really hold that experience that \"takes your breath away\".  Not to understand it, but completely experience it.\n\nAccording to the teachings, \"when your breath is taken away\" or when you experience a deep truth that dissolves your ego, what is left behind is limitless compassion and wisdom.\n\nSo, I'm sorry your friend passed away, that is deeply sad.  I think you're strong for facing that pain so directly.  But that sadness and pain is also a profound truth that can illuminate real 'enlightenment' and peace within you that can help those around you.", "edited": 1492319180.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Buddhism is totally with you right up to that last paragraph where you try and draw conclusions and make meaning about what it &amp;quot;means&amp;quot;.   &lt;/p&gt;\n\n&lt;p&gt;Buddhism wants you to stabilize your mind through meditation so that it is strong and clear enough to really hold that experience that &amp;quot;takes your breath away&amp;quot;.  Not to understand it, but completely experience it.&lt;/p&gt;\n\n&lt;p&gt;According to the teachings, &amp;quot;when your breath is taken away&amp;quot; or when you experience a deep truth that dissolves your ego, what is left behind is limitless compassion and wisdom.&lt;/p&gt;\n\n&lt;p&gt;So, I&amp;#39;m sorry your friend passed away, that is deeply sad.  I think you&amp;#39;re strong for facing that pain so directly.  But that sadness and pain is also a profound truth that can illuminate real &amp;#39;enlightenment&amp;#39; and peace within you that can help those around you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgbp56b", "score_hidden": false, "stickied": false, "created": 1492346866.0, "created_utc": 1492318066.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65mqao", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65mqao", "likes": null, "replies": "", "user_reports": [], "id": "dgcbsw9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rowdy293", "parent_id": "t1_dgbne6y", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "That's interesting and seems to get at the idea of \"soul mates\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s interesting and seems to get at the idea of &amp;quot;soul mates&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgcbsw9", "score_hidden": false, "stickied": false, "created": 1492393815.0, "created_utc": 1492365015.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbne6y", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "Rks1157", "parent_id": "t3_65mqao", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "\"....because we cannot be connected to anyone from this life in the next.\"\n\nThis isn't necessarily so. ;)\n\n  In the [Samajavina Sutta](http://www.accesstoinsight.org/tipitaka/an/an04/an04.055.than.html) the Buddha instructed a married couple on how to stay in tune so that \"they will see one another not only in the present life but also in the life to come.\"\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;....because we cannot be connected to anyone from this life in the next.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t necessarily so. ;)&lt;/p&gt;\n\n&lt;p&gt;In the &lt;a href=\"http://www.accesstoinsight.org/tipitaka/an/an04/an04.055.than.html\"&gt;Samajavina Sutta&lt;/a&gt; the Buddha instructed a married couple on how to stay in tune so that &amp;quot;they will see one another not only in the present life but also in the life to come.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgbne6y", "score_hidden": false, "stickied": false, "created": 1492343853.0, "created_utc": 1492315053.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65mqao", "likes": null, "replies": "", "user_reports": [], "id": "dgbjwqd", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "nemo_13", "parent_id": "t3_65mqao", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "I'm very sorry for your loss; you have my deepest sympathies. It's a tragedy we've been deprived of her future.\n\nThat person isn't truly gone as long as their influence continues in the world. Their memory and the impact they've had on your life and how you impact the lives of others as a result is how she lives on.  \n\nI think it's important to reflect on the impermanence of our lives, and spend our time cherishing the moments we have rather than mourning the moments that have passed. \n\nCarry her memory forward and love others. Reflect on your time together and love her memory.   ", "edited": 1492310094.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m very sorry for your loss; you have my deepest sympathies. It&amp;#39;s a tragedy we&amp;#39;ve been deprived of her future.&lt;/p&gt;\n\n&lt;p&gt;That person isn&amp;#39;t truly gone as long as their influence continues in the world. Their memory and the impact they&amp;#39;ve had on your life and how you impact the lives of others as a result is how she lives on.  &lt;/p&gt;\n\n&lt;p&gt;I think it&amp;#39;s important to reflect on the impermanence of our lives, and spend our time cherishing the moments we have rather than mourning the moments that have passed. &lt;/p&gt;\n\n&lt;p&gt;Carry her memory forward and love others. Reflect on your time together and love her memory.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgbjwqd", "score_hidden": false, "stickied": false, "created": 1492338580.0, "created_utc": 1492309780.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65mqao", "likes": null, "replies": "", "user_reports": [], "id": "dgbuf7x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hunting2fish", "parent_id": "t3_65mqao", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "beautifully tragic. to me it just reiterates how much of a gift this life is. although it may not seem like it we are eternal brother just not in this body. stay positive. trying to hold onto anything goes against nature because nothing In nature is permanent. nothing. fighting against nature will only bring angst and sadness. embrace impermanence and let go. celebrate life don't mourn it. I'm no Buddhist but these are the realisations I've come to myself. good luck brother. sounds like you're dealing with some hard truths. I can talk you know but to really watch people around me pass I can't yet imagine. I hope you find peace ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;beautifully tragic. to me it just reiterates how much of a gift this life is. although it may not seem like it we are eternal brother just not in this body. stay positive. trying to hold onto anything goes against nature because nothing In nature is permanent. nothing. fighting against nature will only bring angst and sadness. embrace impermanence and let go. celebrate life don&amp;#39;t mourn it. I&amp;#39;m no Buddhist but these are the realisations I&amp;#39;ve come to myself. good luck brother. sounds like you&amp;#39;re dealing with some hard truths. I can talk you know but to really watch people around me pass I can&amp;#39;t yet imagine. I hope you find peace &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgbuf7x", "score_hidden": false, "stickied": false, "created": 1492359369.0, "created_utc": 1492330569.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65mqao", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65mqao", "likes": null, "replies": "", "user_reports": [], "id": "dgc1aon", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "YogSothothIsMyHomey", "parent_id": "t1_dgc04es", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "The way I think about it, Nirvana is like being able to fully understand the true essence of all aggregate experience and karma as a whole. Once that happens, you'll know everything, so ego will break down and there will be effectively no other to interact with. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The way I think about it, Nirvana is like being able to fully understand the true essence of all aggregate experience and karma as a whole. Once that happens, you&amp;#39;ll know everything, so ego will break down and there will be effectively no other to interact with. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgc1aon", "score_hidden": false, "stickied": false, "created": 1492378904.0, "created_utc": 1492350104.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc04es", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "KOCTb", "parent_id": "t3_65mqao", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "Your memories will not be erased, instead they will be stored up in Alaya consciousness forever. Yet sometimes I think in this way, what will we feel about all these memories once we got enlightened. It's hard to admit but it's a fact that they were merely endless dreams.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your memories will not be erased, instead they will be stored up in Alaya consciousness forever. Yet sometimes I think in this way, what will we feel about all these memories once we got enlightened. It&amp;#39;s hard to admit but it&amp;#39;s a fact that they were merely endless dreams.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgc04es", "score_hidden": false, "stickied": false, "created": 1492376625.0, "created_utc": 1492347825.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65mqao", "likes": null, "replies": "", "user_reports": [], "id": "dgbxf2b", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "obbans", "parent_id": "t3_65mqao", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "Thank you for sharing. I went through something similar three years ago (almost to the day) when my best friend decided to depart. We had been neighbours for a few years and did everything together. The hole in my heart was enormous and it wouldn't begin to shrink until a few months later. Once I was functioning more or less normally I faced my existential problems and started working on them with the motivation that no-one should be allowed to suffer like my friend must have. I came here to tell you what I found because it has had a major impact on my life for the better and I now wish to spare you whatever suffering I am able to. Here goes:\n\nTurn your attention to some bodily sensation, like the breath, or the feeling of the floor underneath your feet. Now, in the exact same way, point your attention to what it actually feels like to be you. Just you. I know it's vague, but try it. See if you can get just a taste of you, prior to thoughts or beliefs about who and what you are. See if you can find that feeling, the simple me-ness of you that  is always present.\n\nI hope you will find some benefit from this. Good luck and I hope you recover soon. I deeply empathize with your loss. However it goes you will recover. My milestones were 1st week, then 1st month, then 3rd month and now finally I mourn every year around the anniversary, which actually, today, is something I treasure as part of my life despite the sorrow.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for sharing. I went through something similar three years ago (almost to the day) when my best friend decided to depart. We had been neighbours for a few years and did everything together. The hole in my heart was enormous and it wouldn&amp;#39;t begin to shrink until a few months later. Once I was functioning more or less normally I faced my existential problems and started working on them with the motivation that no-one should be allowed to suffer like my friend must have. I came here to tell you what I found because it has had a major impact on my life for the better and I now wish to spare you whatever suffering I am able to. Here goes:&lt;/p&gt;\n\n&lt;p&gt;Turn your attention to some bodily sensation, like the breath, or the feeling of the floor underneath your feet. Now, in the exact same way, point your attention to what it actually feels like to be you. Just you. I know it&amp;#39;s vague, but try it. See if you can get just a taste of you, prior to thoughts or beliefs about who and what you are. See if you can find that feeling, the simple me-ness of you that  is always present.&lt;/p&gt;\n\n&lt;p&gt;I hope you will find some benefit from this. Good luck and I hope you recover soon. I deeply empathize with your loss. However it goes you will recover. My milestones were 1st week, then 1st month, then 3rd month and now finally I mourn every year around the anniversary, which actually, today, is something I treasure as part of my life despite the sorrow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgbxf2b", "score_hidden": false, "stickied": false, "created": 1492369502.0, "created_utc": 1492340702.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65mqao", "likes": null, "replies": "", "user_reports": [], "id": "dgbrlf3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sculptorman", "parent_id": "t3_65mqao", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "If you're attracted enough to a particular person in this life - sometimes you reincarnate with them in the next. This is what some teachers teach. Even families stick together from one life to the next.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re attracted enough to a particular person in this life - sometimes you reincarnate with them in the next. This is what some teachers teach. Even families stick together from one life to the next.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgbrlf3", "score_hidden": false, "stickied": false, "created": 1492351755.0, "created_utc": 1492322955.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65mqao", "likes": null, "replies": "", "user_reports": [], "id": "dgbwvg0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lacy_Drays", "parent_id": "t3_65mqao", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "I don't know what does Buddha say, but my take on this would be something like - the experience that she has offered to you in your life: will keep going on with you. So, in this sense - what you learned and experienced with and from that friend - it all keeps living with you. A part of her is a part of you for as long as you keep living, making choices. In a way you are a part of her \"reincarnation\", and your paths are forever crossed. Even though she is gone and when something like that happens, we must take our time and think and grieve - in a way your experience with her is complete now, there's nothing more coming. \n\nAnd the best thing you can do is try to be open for new people, new experiences - any person that might or might not appeal to you at the first glance has within them something to share you cannot even expect or dream of - this is the most exciting path we can take, I think. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know what does Buddha say, but my take on this would be something like - the experience that she has offered to you in your life: will keep going on with you. So, in this sense - what you learned and experienced with and from that friend - it all keeps living with you. A part of her is a part of you for as long as you keep living, making choices. In a way you are a part of her &amp;quot;reincarnation&amp;quot;, and your paths are forever crossed. Even though she is gone and when something like that happens, we must take our time and think and grieve - in a way your experience with her is complete now, there&amp;#39;s nothing more coming. &lt;/p&gt;\n\n&lt;p&gt;And the best thing you can do is try to be open for new people, new experiences - any person that might or might not appeal to you at the first glance has within them something to share you cannot even expect or dream of - this is the most exciting path we can take, I think. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgbwvg0", "score_hidden": false, "stickied": false, "created": 1492367688.0, "created_utc": 1492338888.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65mqao", "likes": null, "replies": "", "user_reports": [], "id": "dgc0gep", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "numbersev", "parent_id": "t3_65mqao", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "This is the nature of conditioned existence:\n\n&gt;\"From an inconstruable beginning comes transmigration. A beginning point is not evident, though beings hindered by ignorance and fettered by craving are transmigrating &amp; wandering on. Long have you thus experienced stress, experienced pain, experienced loss, swelling the cemeteries — enough to become disenchanted with all fabricated things, enough to become dispassionate, enough to be released.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the nature of conditioned existence:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;From an inconstruable beginning comes transmigration. A beginning point is not evident, though beings hindered by ignorance and fettered by craving are transmigrating &amp;amp; wandering on. Long have you thus experienced stress, experienced pain, experienced loss, swelling the cemeteries — enough to become disenchanted with all fabricated things, enough to become dispassionate, enough to be released.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgc0gep", "score_hidden": false, "stickied": false, "created": 1492377298.0, "created_utc": 1492348498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65mqao", "likes": null, "replies": "", "user_reports": [], "id": "dgc79bn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LevyLoft", "parent_id": "t3_65mqao", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "There are so many great books out there that help people deal with such a feeling.  \n\nWhen I start to become a little uneasy about the way things have been going in my life, whether it is due to a death or a change in plans that will seriously alter my path for the next few years I tell myself that this is how it is supposed to be.  This moment is absolutely perfect even though I cannot see it that way.  I have to trust the universe that this is the very best thing for me because that is the only way the universe works.  \n\n\"For the Universe to continue to exist, it can only permit the best possible events, perfect events, to occur at any\r\nmoment in time. If it were otherwise, the Universe would be in danger of its own destruction because one imperfect event\r\ncould lead to two imperfect events, to three, and so on unto destruction. Imperfect events are not tolerated, not even once.\r\nSince our Universe has continued for all those billions of years, there can be little doubt about the perfection of its\r\nconstruction. The Universe continues to be perfect at every moment and never permits even the first imperfect event to occur. It goes from perfect to perfect to perfect.\r\nThis is related to the Universal law of the conservation of energy: “Nothing can be lost or destroyed, only changed.”\r\nThat includes us. Being part of the Universe, we will continue to exist. Perhaps we will exist in a different form, perhaps in a\r\ndifferent state, but exist we shall.\r\nWhen the time comes for us to leave our physical bodies, we may keep our personalities and our souls, so to speak,\r\nor we may not. Perhaps we will simply merge into the totality of the Universe. Yet it’s actually not accurate to say that we\r\nwill merge with the totality of the Universe because we are never unmerged from it. And who’s to say we shall not come\r\nback to this planet again? Perhaps we will reemerge once again on earth. We may have forgotten how we came to planet\r\nEarth, but we certainly know the way to get here, evidenced by the fact that we are here.\r\nIn any case, we’ll continue in some form or another—every end being glorious. The greatest honor one can have is to\r\nbe part of the Universe. To additionally have been chosen to receive the degree of awareness we have is a wondrous gift,\r\nwondrous almost beyond belief.\r\nCarrying further the thought that the Universe is constructed so that it will continue to exist, it can be said that the\r\nUniverse wants to benefit itself to the maximum amount possible at all times. Since we are an integral, inseparable part of\r\nthe Universe, the same thing applies to us.\r\nEverything that happens to us is for our complete benefit.\" Chris Prentiss. From his book Zen and the art of happiness. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are so many great books out there that help people deal with such a feeling.  &lt;/p&gt;\n\n&lt;p&gt;When I start to become a little uneasy about the way things have been going in my life, whether it is due to a death or a change in plans that will seriously alter my path for the next few years I tell myself that this is how it is supposed to be.  This moment is absolutely perfect even though I cannot see it that way.  I have to trust the universe that this is the very best thing for me because that is the only way the universe works.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;For the Universe to continue to exist, it can only permit the best possible events, perfect events, to occur at any\nmoment in time. If it were otherwise, the Universe would be in danger of its own destruction because one imperfect event\ncould lead to two imperfect events, to three, and so on unto destruction. Imperfect events are not tolerated, not even once.\nSince our Universe has continued for all those billions of years, there can be little doubt about the perfection of its\nconstruction. The Universe continues to be perfect at every moment and never permits even the first imperfect event to occur. It goes from perfect to perfect to perfect.\nThis is related to the Universal law of the conservation of energy: “Nothing can be lost or destroyed, only changed.”\nThat includes us. Being part of the Universe, we will continue to exist. Perhaps we will exist in a different form, perhaps in a\ndifferent state, but exist we shall.\nWhen the time comes for us to leave our physical bodies, we may keep our personalities and our souls, so to speak,\nor we may not. Perhaps we will simply merge into the totality of the Universe. Yet it’s actually not accurate to say that we\nwill merge with the totality of the Universe because we are never unmerged from it. And who’s to say we shall not come\nback to this planet again? Perhaps we will reemerge once again on earth. We may have forgotten how we came to planet\nEarth, but we certainly know the way to get here, evidenced by the fact that we are here.\nIn any case, we’ll continue in some form or another—every end being glorious. The greatest honor one can have is to\nbe part of the Universe. To additionally have been chosen to receive the degree of awareness we have is a wondrous gift,\nwondrous almost beyond belief.\nCarrying further the thought that the Universe is constructed so that it will continue to exist, it can be said that the\nUniverse wants to benefit itself to the maximum amount possible at all times. Since we are an integral, inseparable part of\nthe Universe, the same thing applies to us.\nEverything that happens to us is for our complete benefit.&amp;quot; Chris Prentiss. From his book Zen and the art of happiness. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgc79bn", "score_hidden": false, "stickied": false, "created": 1492387851.0, "created_utc": 1492359051.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65mqao", "likes": null, "replies": "", "user_reports": [], "id": "dgc93z3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FenderFreak", "parent_id": "t3_65mqao", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "Hey friend, I am so sorry to hear about your loss. My understanding is that your inquiry can be answered in several ways. On a very literal level, if we consider rebirth and the beginning-less and end-less nature of all phenomena, then seeing the reincarnations of all your loved ones and enemies is not only a possibility, but an inevitability. Garchen Rinpoche has taught that we must view every being as if they were our mother or father in a previous life. Because time has no beginning and our mindstreams have taken infinite forms, we have been related to every sentient being in the entire universe in a previous life. We can reverse this observation as well, and assume that we will take many, many more rebirths, and even if we achieve realization, I think a \"bodhisattva\" vow is likely, in which the realized mind-stream continues to take rebirth in order to liberate others. In other words, your mind stream will continue to take form on and off again for endless time. This means that you will have infinite opportunities to reincarnate with all of your loved ones in future lives; however, this is just an aspect of your coming into contact in future lives with all beings. In an infinite amount time, an infinite amount of connections are made. Furthermore, as we gain more insight and practice in the dharma, I'd imagine that we will develop a sense of connection to all living beings, despite not being in their physical presence. May you be well! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey friend, I am so sorry to hear about your loss. My understanding is that your inquiry can be answered in several ways. On a very literal level, if we consider rebirth and the beginning-less and end-less nature of all phenomena, then seeing the reincarnations of all your loved ones and enemies is not only a possibility, but an inevitability. Garchen Rinpoche has taught that we must view every being as if they were our mother or father in a previous life. Because time has no beginning and our mindstreams have taken infinite forms, we have been related to every sentient being in the entire universe in a previous life. We can reverse this observation as well, and assume that we will take many, many more rebirths, and even if we achieve realization, I think a &amp;quot;bodhisattva&amp;quot; vow is likely, in which the realized mind-stream continues to take rebirth in order to liberate others. In other words, your mind stream will continue to take form on and off again for endless time. This means that you will have infinite opportunities to reincarnate with all of your loved ones in future lives; however, this is just an aspect of your coming into contact in future lives with all beings. In an infinite amount time, an infinite amount of connections are made. Furthermore, as we gain more insight and practice in the dharma, I&amp;#39;d imagine that we will develop a sense of connection to all living beings, despite not being in their physical presence. May you be well! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgc93z3", "score_hidden": false, "stickied": false, "created": 1492390304.0, "created_utc": 1492361504.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65mqao", "likes": null, "replies": "", "user_reports": [], "id": "dgc9lg7", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "jazztaprazzta", "parent_id": "t3_65mqao", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "I think she has already reborn. In general people who commit suicide or die in some other very unnatural way take rebirth very soon. It's possible that you'll meet again in your next life, but she might be your grandmother, father, aunt, etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think she has already reborn. In general people who commit suicide or die in some other very unnatural way take rebirth very soon. It&amp;#39;s possible that you&amp;#39;ll meet again in your next life, but she might be your grandmother, father, aunt, etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgc9lg7", "score_hidden": false, "stickied": false, "created": 1492390905.0, "created_utc": 1492362105.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]