[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Buddhism", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just want to start by saying I am very much a newbie to Buddhism so I apologize if I say anything ignorant.&lt;br/&gt;\nwe bought our house three years ago, and have a next door neighbor with two kids(well, teenagers now). we&amp;#39;ve never actually talked to them as we&amp;#39;re fairly shy and honestly thought people would come introduce themselves when we moved in (I think that may be less common nowadays). the boys and their father play a lot of sports in their small backyard, but mostly catch. because of the way they face each other when they play, they very very often throw balls into our backyard. they then open our gate and run into yard to retrieve them. the biggest issue here is that they never asked to do this. had they the first time I either would have said &amp;quot;sure don&amp;#39;t worry about, you can come get it whenever&amp;quot; or &amp;quot;no problem, we&amp;#39;ll toss it back over when we get the chance&amp;quot;.&lt;br/&gt;\nour very large kitchen window faces our yard so its very obvious when they come over. I feel very uncomfortable when they do because I know they can see inside. I feel disrespected, like our property and privacy doesn&amp;#39;t matter.&lt;br/&gt;\nthe father is aware of them doing this so he clearly sees no issue. I&amp;#39;m a very shy and nonconfrontational person so trying to talk to him (after three years of never speaking to each other)  does not feel like a possibility (and I have a feeling it wouldn&amp;#39;t change anything).&lt;br/&gt;\nso rather than get angry or flustered or try to find ways to retaliate (I&amp;#39;ve honestly considered leaving my dogs poo by the gate, I&amp;#39;m that frustrated),  how can I instead find peace and be ok with it all?  I think it&amp;#39;ll be healthier in the end if I don&amp;#39;t let it get to me, but I&amp;#39;m not sure how to get to that point. do I need to abandon the idea of respect?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I just want to start by saying I am very much a newbie to Buddhism so I apologize if I say anything ignorant.   \nwe bought our house three years ago, and have a next door neighbor with two kids(well, teenagers now). we've never actually talked to them as we're fairly shy and honestly thought people would come introduce themselves when we moved in (I think that may be less common nowadays). the boys and their father play a lot of sports in their small backyard, but mostly catch. because of the way they face each other when they play, they very very often throw balls into our backyard. they then open our gate and run into yard to retrieve them. the biggest issue here is that they never asked to do this. had they the first time I either would have said \"sure don't worry about, you can come get it whenever\" or \"no problem, we'll toss it back over when we get the chance\".  \nour very large kitchen window faces our yard so its very obvious when they come over. I feel very uncomfortable when they do because I know they can see inside. I feel disrespected, like our property and privacy doesn't matter.  \nthe father is aware of them doing this so he clearly sees no issue. I'm a very shy and nonconfrontational person so trying to talk to him (after three years of never speaking to each other)  does not feel like a possibility (and I have a feeling it wouldn't change anything).  \nso rather than get angry or flustered or try to find ways to retaliate (I've honestly considered leaving my dogs poo by the gate, I'm that frustrated),  how can I instead find peace and be ok with it all?  I think it'll be healthier in the end if I don't let it get to me, but I'm not sure how to get to that point. do I need to abandon the idea of respect?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65t49q", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 18, "report_reasons": null, "author": "mrspaprika", "saved": false, "mod_reports": [], "name": "t3_65t49q", "subreddit_name_prefixed": "r/Buddhism", "approved_by": null, "over_18": false, "domain": "self.Buddhism", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhnf", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Buddhism/comments/65t49q/can_i_find_peace_when_respect_is_ignored/", "num_reports": null, "locked": false, "stickied": false, "created": 1492426411.0, "url": "https://www.reddit.com/r/Buddhism/comments/65t49q/can_i_find_peace_when_respect_is_ignored/", "author_flair_text": "non-affiliated", "quarantine": false, "title": "Can I find peace when respect is ignored?", "created_utc": 1492397611.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65t49q", "likes": null, "replies": "", "user_reports": [], "id": "dgd28cy", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "happilyemployed", "parent_id": "t3_65t49q", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "You need to meet your neighbor. Overcome your reticence and reach out. Later, when you're able to call each other by name and have had a few conversations, mention that you'd prefer that they ask permission or come to the front door.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to meet your neighbor. Overcome your reticence and reach out. Later, when you&amp;#39;re able to call each other by name and have had a few conversations, mention that you&amp;#39;d prefer that they ask permission or come to the front door.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgd28cy", "score_hidden": false, "stickied": false, "created": 1492429382.0, "created_utc": 1492400582.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65t49q", "likes": null, "replies": "", "user_reports": [], "id": "dgd2oe2", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Gundi9", "parent_id": "t3_65t49q", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "I think you have it backwards. You moved into the neighborhood, so you should be going to introduce yourself to your neighbors. Of course it can go either way, but I think this is more common. You need to go meet your neighbor. Just go and introduce yourself  and form a connection. Don't bring this issue up, especially since you said you would not have minded at all if they had asked. That just means your ego is getting in the way. You don't care that they are going into your yard. You care that they never asked you.", "edited": 1492430363.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you have it backwards. You moved into the neighborhood, so you should be going to introduce yourself to your neighbors. Of course it can go either way, but I think this is more common. You need to go meet your neighbor. Just go and introduce yourself  and form a connection. Don&amp;#39;t bring this issue up, especially since you said you would not have minded at all if they had asked. That just means your ego is getting in the way. You don&amp;#39;t care that they are going into your yard. You care that they never asked you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgd2oe2", "score_hidden": false, "stickied": false, "created": 1492430080.0, "created_utc": 1492401280.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65t49q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65t49q", "likes": null, "replies": "", "user_reports": [], "id": "dgdlnnr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mrspaprika", "parent_id": "t1_dgdf1g6", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "So far this comment has made the most sense to me. Its hard because they've done other things to make me think they don't care (riding a four wheeler on part of our front lawn, letting soccer balls hit the side of our house, etc), but I think trying to change my way of thinking about it will help. The fact that they aren't ringing our doorbell constantly or I'm not having to throw over a bunch of balls is a positive. Thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So far this comment has made the most sense to me. Its hard because they&amp;#39;ve done other things to make me think they don&amp;#39;t care (riding a four wheeler on part of our front lawn, letting soccer balls hit the side of our house, etc), but I think trying to change my way of thinking about it will help. The fact that they aren&amp;#39;t ringing our doorbell constantly or I&amp;#39;m not having to throw over a bunch of balls is a positive. Thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgdlnnr", "score_hidden": false, "stickied": false, "created": 1492470821.0, "created_utc": 1492442021.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdf1g6", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Solieus", "parent_id": "t3_65t49q", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "They're just getting a ball right? They're not using it as an excuse to snoop or sneak around. They have no ill will towards you. And yet you have loads of Ill will towards them. They probably think they are being less of a bother by getting it themselves. I don't think you want to be That Neighbour that puts up 'no trespassing' signs and yells at kids when you know they mean no harm to you. This is a perfect opportunity to practice compassion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;re just getting a ball right? They&amp;#39;re not using it as an excuse to snoop or sneak around. They have no ill will towards you. And yet you have loads of Ill will towards them. They probably think they are being less of a bother by getting it themselves. I don&amp;#39;t think you want to be That Neighbour that puts up &amp;#39;no trespassing&amp;#39; signs and yells at kids when you know they mean no harm to you. This is a perfect opportunity to practice compassion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dgdf1g6", "score_hidden": false, "stickied": false, "created": 1492460889.0, "created_utc": 1492432089.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhnf", "removal_reason": null, "link_id": "t3_65t49q", "likes": null, "replies": "", "user_reports": [], "id": "dge1pvt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "literally_lite_rally", "parent_id": "t3_65t49q", "subreddit_name_prefixed": "r/Buddhism", "controversiality": 0, "body": "It works for them, but it doesn't work for you. They never introduced themselves or asked if you'd mind regular tresspassing. No need to explain. It is your property and they have no right to be there. Lock the gate. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It works for them, but it doesn&amp;#39;t work for you. They never introduced themselves or asked if you&amp;#39;d mind regular tresspassing. No need to explain. It is your property and they have no right to be there. Lock the gate. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Buddhism", "name": "t1_dge1pvt", "score_hidden": false, "stickied": false, "created": 1492488910.0, "created_utc": 1492460110.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]