[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "learnprogramming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey!\nSo I used to be a high school student in Dubai (I&amp;#39;m Indian, so not rich lol), and I was fairly good at programming back then (and I still am). As per our course requirements, we had to learn the basics of a programming language (in our case, Python). So, I was in the CBSE (Central Board of Secondary Education) school system, which is probably the hardest school system; mainly cuz most people kill themselves after they get the results. So here is how my story goes:&lt;/p&gt;\n\n&lt;p&gt;In the start of the school semester ( Probably April ) I was sitting with a teacher who was helping me in some chemistry work, and we started to converse. She was curious about why my knowledge of chemistry was so terrible and asked me what I was good at. Naturally, like any nerd, I answered: &amp;quot;Computers and Math seem fun&amp;quot;. After a few more questions, she asked me if I could make a program to make question papers (no automation in the CBSE School system sadly) and I shrugged &amp;quot;probably&amp;quot; and ended up thinking about it (a lot) for the next few months and often wrote (in pen and paper) algorithms and pseudo-code which I could use in the software. Around the end of the year, I discussed the business proposition with a friend (non-programmer fellow) and we decided to try to make a startup with the product being a software that could generate question papers for students to practice on, and intended to sell it to schools. &lt;/p&gt;\n\n&lt;p&gt;Now, being a student going out of school, I was pretty inexperienced and decided to pick up a programming language which could help in the UI design, and I decided that Visual Basic was pretty good for the job and picked up a book on it. Note that I still used python for most of the back end development. At the end of the year, with my final grade coming to about 70% on average ( I had 5 subjects and the highest score was in Computer Science of 84%. Yes, I was a terrible student), I decided to start working on my little &amp;#39;project&amp;#39;. Having just given the final exam, I realized that it was a good thing that I had a lot of mock exams that helped me understand most of the dynamics of how the papers are designed as well as excellent insights with the help of several teachers. &lt;/p&gt;\n\n&lt;p&gt;Out entire plan was to design the software in the 4 months of free time that we had, show a demo to to several schools which follow the CBSE school system and finally sell everything to a family friend of mine who had a software company of his own as we both would be in different parts of the world and wouldn&amp;#39;t be able to work on selling it further or update it in any way. Here is where things got complicated. &lt;/p&gt;\n\n&lt;p&gt;One of the most difficult things that I realized was who you pick to work with. My friend wasn&amp;#39;t exactly the most motivated and often stayed out of contact for weeks on end, which was quite frustrating. He was a gigantic pain to even get a hold of and rarely did anything. His main job was to design a small website, preferably from WordPress, a logo, and find question papers from where we could get some of the data. In the entire 4 months, I just got to see the face of the Logo, and the name of the startup (qUpa, if you&amp;#39;re interested). And would constantly be &amp;quot;busy&amp;quot; with something.&lt;/p&gt;\n\n&lt;p&gt;Another thing that was an issue was that I was moving from a scripting language to an Object Oriented Language and this was a difficult shift, to be honest. This took me a while to get used to (a month or so). That&amp;#39;s how a month of the 4 months got over. &lt;/p&gt;\n\n&lt;p&gt;The next few weeks went into perfecting the design of the question papers. This was a tedious task, as I usually wrote it in paper first, then prototyped it in python, then when I reached satisfaction, would go on to implement it in VB. This was taking, but it was also preferable, as I could use python to get more data on how the algorithm performed, along with using GeoGebra ( whoever made this is the best &amp;lt;3 ) and could often tweak it a little bit more to get the best resultant output. Anyway, I won&amp;#39;t go into more technicalities because I don&amp;#39;t want to bore you.&lt;/p&gt;\n\n&lt;p&gt;Another thing that I felt I should mention is how difficult was the task of getting all the questions. For each question, I had to fill the possible points that I could give to it, the subject it came from, its chapter, and its topic, as well as how long it would take to solve it. This was going to be a difficult job, as scouring for them on the internet was going to be difficult, and just relying on the ones in the question paper doesn&amp;#39;t give me a lot of clay to make bricks ( a metaphor for my non-native English speakers). To solve this problem, I decided to grab all the books of the &lt;em&gt;Xam Idea&lt;/em&gt; series for the 12th grade, and instead of typing all 500k questions, I went online and looked at all the Optical Character Recognition Websites that I could find and tested them out. Recently, I found out I could have used Wolfram Alpha instead, which would have been much easier and accurate. Anyway, stupid moments like that aside, I was all set to work on it. &lt;/p&gt;\n\n&lt;p&gt;I ended up getting pretty far with it, without much help from my &amp;#39;friend&amp;#39; but had to back down in around the final moments as I had to go back to India. I was applying for universities in Canada, and since my Visa was taking a long time to get processed, my dad wanted me to go and apply for some of the universities there too because he was worried that I would end up wasting a year. So, before the prototype was complete, I had to scrap the project entirely, as when I returned, I had to leave for Montreal ASAP for university reasons. That put an end to the entire prospect pretty quickly.&lt;/p&gt;\n\n&lt;p&gt;In the end, and a year later; here&amp;#39;s what I learned to do and not to do (sorry for making you read 700+ words):&lt;/p&gt;\n\n&lt;p&gt;To Do:&lt;/p&gt;\n\n&lt;p&gt;Start your Project: Journey of a Million Miles starts with a single step and all that bullshit. It&amp;#39;s true and most people usually end up quitting before they start. DONT DO THAT&lt;/p&gt;\n\n&lt;p&gt;Plan: The entire project would have been doomed from the start if I didn&amp;#39;t have a clear goal of what I wanted to do and stick to it.&lt;/p&gt;\n\n&lt;p&gt;Sometimes, you gotta run before you can walk: If something seems difficult, don&amp;#39;t be afraid to back down. Better to be defeated than to have quit.&lt;/p&gt;\n\n&lt;p&gt;Find a better way: Usually, when you start working on a problem, you&amp;#39;ll see that there&amp;#39;s going to be more than one way to solve it. Be sure to think out of the box, like I did with the Xam idea books and using a little rusty but faster and less manpower dependent way to do the job. &lt;/p&gt;\n\n&lt;p&gt;Not To Do:&lt;/p&gt;\n\n&lt;p&gt;Team up because you want to, not because you have to: Hey, most programmers like to think of themselves as lone wolfs and such. That is pure bullshit. It&amp;#39;s always better to work with someone who is good. What you should never do is team up with someone because you think you need them. If I hadn&amp;#39;t relied on my friend, I &lt;em&gt;may&lt;/em&gt; have done a better job. If I approached other people who were better suited rather than my friends, maybe I would have done a better job and finished it off quicker.&lt;/p&gt;\n\n&lt;p&gt;Be dedicated: I usually found myself taking breaks for a few days when I would get stuck on a small glitch and it would infuriate me. I usually regretted doing that. Oh well, better learn from it than repeat it :P\nDon&amp;#39;t hesitate to use every tool in your arsenal: I realize now that if I had asked for help from the family friend, who I was planning on selling it to, I probably would have gotten it done faster because he would have helped me out one way or another.&lt;/p&gt;\n\n&lt;p&gt;Give Up: Going to go back this summer for a month, and as usual, instead of continuing to study, I&amp;#39;m writing this and planning on contacting someone for some help in finishing what I left off. Hopefully, I&amp;#39;ll be able to pitch this idea to schools and sell it successfully this time. I haven&amp;#39;t touched it since September, but I&amp;#39;ll probably do more in this time because I&amp;#39;ve been practicing coding and not really shy anymore. &lt;/p&gt;\n\n&lt;p&gt;TL;DR: Just spent an hour writing this, fucking read it!&lt;/p&gt;\n\n&lt;p&gt;Hope this helps!&lt;/p&gt;\n\n&lt;p&gt;Sorry for the bad english! Not a native speaker!&lt;/p&gt;\n\n&lt;p&gt;:)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey!\nSo I used to be a high school student in Dubai (I'm Indian, so not rich lol), and I was fairly good at programming back then (and I still am). As per our course requirements, we had to learn the basics of a programming language (in our case, Python). So, I was in the CBSE (Central Board of Secondary Education) school system, which is probably the hardest school system; mainly cuz most people kill themselves after they get the results. So here is how my story goes:\n\nIn the start of the school semester ( Probably April ) I was sitting with a teacher who was helping me in some chemistry work, and we started to converse. She was curious about why my knowledge of chemistry was so terrible and asked me what I was good at. Naturally, like any nerd, I answered: \"Computers and Math seem fun\". After a few more questions, she asked me if I could make a program to make question papers (no automation in the CBSE School system sadly) and I shrugged \"probably\" and ended up thinking about it (a lot) for the next few months and often wrote (in pen and paper) algorithms and pseudo-code which I could use in the software. Around the end of the year, I discussed the business proposition with a friend (non-programmer fellow) and we decided to try to make a startup with the product being a software that could generate question papers for students to practice on, and intended to sell it to schools. \n\nNow, being a student going out of school, I was pretty inexperienced and decided to pick up a programming language which could help in the UI design, and I decided that Visual Basic was pretty good for the job and picked up a book on it. Note that I still used python for most of the back end development. At the end of the year, with my final grade coming to about 70% on average ( I had 5 subjects and the highest score was in Computer Science of 84%. Yes, I was a terrible student), I decided to start working on my little 'project'. Having just given the final exam, I realized that it was a good thing that I had a lot of mock exams that helped me understand most of the dynamics of how the papers are designed as well as excellent insights with the help of several teachers. \n\nOut entire plan was to design the software in the 4 months of free time that we had, show a demo to to several schools which follow the CBSE school system and finally sell everything to a family friend of mine who had a software company of his own as we both would be in different parts of the world and wouldn't be able to work on selling it further or update it in any way. Here is where things got complicated. \n\nOne of the most difficult things that I realized was who you pick to work with. My friend wasn't exactly the most motivated and often stayed out of contact for weeks on end, which was quite frustrating. He was a gigantic pain to even get a hold of and rarely did anything. His main job was to design a small website, preferably from WordPress, a logo, and find question papers from where we could get some of the data. In the entire 4 months, I just got to see the face of the Logo, and the name of the startup (qUpa, if you're interested). And would constantly be \"busy\" with something.\n\nAnother thing that was an issue was that I was moving from a scripting language to an Object Oriented Language and this was a difficult shift, to be honest. This took me a while to get used to (a month or so). That's how a month of the 4 months got over. \n\nThe next few weeks went into perfecting the design of the question papers. This was a tedious task, as I usually wrote it in paper first, then prototyped it in python, then when I reached satisfaction, would go on to implement it in VB. This was taking, but it was also preferable, as I could use python to get more data on how the algorithm performed, along with using GeoGebra ( whoever made this is the best &lt;3 ) and could often tweak it a little bit more to get the best resultant output. Anyway, I won't go into more technicalities because I don't want to bore you.\n\nAnother thing that I felt I should mention is how difficult was the task of getting all the questions. For each question, I had to fill the possible points that I could give to it, the subject it came from, its chapter, and its topic, as well as how long it would take to solve it. This was going to be a difficult job, as scouring for them on the internet was going to be difficult, and just relying on the ones in the question paper doesn't give me a lot of clay to make bricks ( a metaphor for my non-native English speakers). To solve this problem, I decided to grab all the books of the *Xam Idea* series for the 12th grade, and instead of typing all 500k questions, I went online and looked at all the Optical Character Recognition Websites that I could find and tested them out. Recently, I found out I could have used Wolfram Alpha instead, which would have been much easier and accurate. Anyway, stupid moments like that aside, I was all set to work on it. \n\nI ended up getting pretty far with it, without much help from my 'friend' but had to back down in around the final moments as I had to go back to India. I was applying for universities in Canada, and since my Visa was taking a long time to get processed, my dad wanted me to go and apply for some of the universities there too because he was worried that I would end up wasting a year. So, before the prototype was complete, I had to scrap the project entirely, as when I returned, I had to leave for Montreal ASAP for university reasons. That put an end to the entire prospect pretty quickly.\n\nIn the end, and a year later; here's what I learned to do and not to do (sorry for making you read 700+ words):\n\nTo Do:\n\nStart your Project: Journey of a Million Miles starts with a single step and all that bullshit. It's true and most people usually end up quitting before they start. DONT DO THAT\n\nPlan: The entire project would have been doomed from the start if I didn't have a clear goal of what I wanted to do and stick to it.\n\nSometimes, you gotta run before you can walk: If something seems difficult, don't be afraid to back down. Better to be defeated than to have quit.\n\nFind a better way: Usually, when you start working on a problem, you'll see that there's going to be more than one way to solve it. Be sure to think out of the box, like I did with the Xam idea books and using a little rusty but faster and less manpower dependent way to do the job. \n\nNot To Do:\n\nTeam up because you want to, not because you have to: Hey, most programmers like to think of themselves as lone wolfs and such. That is pure bullshit. It's always better to work with someone who is good. What you should never do is team up with someone because you think you need them. If I hadn't relied on my friend, I *may* have done a better job. If I approached other people who were better suited rather than my friends, maybe I would have done a better job and finished it off quicker.\n\nBe dedicated: I usually found myself taking breaks for a few days when I would get stuck on a small glitch and it would infuriate me. I usually regretted doing that. Oh well, better learn from it than repeat it :P\nDon't hesitate to use every tool in your arsenal: I realize now that if I had asked for help from the family friend, who I was planning on selling it to, I probably would have gotten it done faster because he would have helped me out one way or another.\n\nGive Up: Going to go back this summer for a month, and as usual, instead of continuing to study, I'm writing this and planning on contacting someone for some help in finishing what I left off. Hopefully, I'll be able to pitch this idea to schools and sell it successfully this time. I haven't touched it since September, but I'll probably do more in this time because I've been practicing coding and not really shy anymore. \n\nTL;DR: Just spent an hour writing this, fucking read it!\n\nHope this helps!\n\nSorry for the bad english! Not a native speaker!\n\n:)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ukoi", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 35, "report_reasons": null, "author": "v2thegreat", "saved": false, "mod_reports": [], "name": "t3_65ukoi", "subreddit_name_prefixed": "r/learnprogramming", "approved_by": null, "over_18": false, "domain": "self.learnprogramming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r7yd", "edited": 1492422123.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/learnprogramming/comments/65ukoi/motivation_my_first_attempt_at_a_business_project/", "num_reports": null, "locked": false, "stickied": false, "created": 1492450295.0, "url": "https://www.reddit.com/r/learnprogramming/comments/65ukoi/motivation_my_first_attempt_at_a_business_project/", "author_flair_text": null, "quarantine": false, "title": "[Motivation] My first attempt at a Business Project: What to do and not to do:", "created_utc": 1492421495.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 35}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r7yd", "removal_reason": null, "link_id": "t3_65ukoi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r7yd", "removal_reason": null, "link_id": "t3_65ukoi", "likes": null, "replies": "", "user_reports": [], "id": "dgdu5ot", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "v2thegreat", "parent_id": "t1_dgdqd6b", "subreddit_name_prefixed": "r/learnprogramming", "controversiality": 0, "body": "Thanks! I know it's not the usual stuff that you see here on this sub Reddit, but I hope that it helps someone ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks! I know it&amp;#39;s not the usual stuff that you see here on this sub Reddit, but I hope that it helps someone &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "learnprogramming", "name": "t1_dgdu5ot", "score_hidden": false, "stickied": false, "created": 1492480400.0, "created_utc": 1492451600.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqd6b", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "serimachi", "parent_id": "t3_65ukoi", "subreddit_name_prefixed": "r/learnprogramming", "controversiality": 0, "body": "Very cool dude. Thanks for sharing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very cool dude. Thanks for sharing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "learnprogramming", "name": "t1_dgdqd6b", "score_hidden": false, "stickied": false, "created": 1492476200.0, "created_utc": 1492447400.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]