[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "history", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all. So I&amp;#39;m 18, and my mind is at the time where I should be moulding it. As an impassioned history fan I was wondering how do all of you get such vast knowledge over many topics. As I&amp;#39;m only just starting out, I want to know the best ways to broaden my knowledge before university which I hope to go to next year. At the moment I&amp;#39;m reading books but that&amp;#39;s it. I&amp;#39;ve started with Monty and Rommel by Peter Caddick-Adams and 1771 by David McCullough, so any book suggestions to develop interest in other periods of time would certainly be welcomed &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi all. So I'm 18, and my mind is at the time where I should be moulding it. As an impassioned history fan I was wondering how do all of you get such vast knowledge over many topics. As I'm only just starting out, I want to know the best ways to broaden my knowledge before university which I hope to go to next year. At the moment I'm reading books but that's it. I've started with Monty and Rommel by Peter Caddick-Adams and 1771 by David McCullough, so any book suggestions to develop interest in other periods of time would certainly be welcomed ", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Discussion/Question", "id": "64mk5m", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 23, "report_reasons": null, "author": "adnansbadnan31", "saved": false, "mod_reports": [], "name": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "approved_by": null, "over_18": false, "domain": "self.history", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh53", "edited": false, "link_flair_css_class": "b", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/history/comments/64mk5m/how_do_you_learn_and_retain_such_a_broad_knowledge/", "num_reports": null, "locked": false, "stickied": false, "created": 1491888948.0, "url": "https://www.reddit.com/r/history/comments/64mk5m/how_do_you_learn_and_retain_such_a_broad_knowledge/", "author_flair_text": null, "quarantine": false, "title": "How do you learn and retain such a broad knowledge?", "created_utc": 1491860148.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg3i3o6", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "authoritrey", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "I've got a five-pound suggestion for you, and I swear it works: go to a junk store and get a globe of the world, and keep it by where you read, or you can do as I eventually did and put a giant world map on the wall everywhere I live.  \n\nIt doesn't have to be nice, expensive, or even current, but I like relief maps and globes--as a child I would run my fingers over the terrain of my beat-up globe, and I think that even the illusion of terrain helps to add a tactile component to learning.  As you learn new things, you will begin to habitually spot the place on the globe where they happened.  It will help you to remember and geography is critical to a hundred other disciplines, anyway.\n\nThis is not a bunch of crap.  It's a version of the \"method of loci\" or \"memory palace\" technique that has been successfully used for thousands of years.  And it makes reading Thomas Harris' *Hannibal* more interesting as well.\n\n* https://en.wikipedia.org/wiki/Method_of_loci", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve got a five-pound suggestion for you, and I swear it works: go to a junk store and get a globe of the world, and keep it by where you read, or you can do as I eventually did and put a giant world map on the wall everywhere I live.  &lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t have to be nice, expensive, or even current, but I like relief maps and globes--as a child I would run my fingers over the terrain of my beat-up globe, and I think that even the illusion of terrain helps to add a tactile component to learning.  As you learn new things, you will begin to habitually spot the place on the globe where they happened.  It will help you to remember and geography is critical to a hundred other disciplines, anyway.&lt;/p&gt;\n\n&lt;p&gt;This is not a bunch of crap.  It&amp;#39;s a version of the &amp;quot;method of loci&amp;quot; or &amp;quot;memory palace&amp;quot; technique that has been successfully used for thousands of years.  And it makes reading Thomas Harris&amp;#39; &lt;em&gt;Hannibal&lt;/em&gt; more interesting as well.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Method_of_loci\"&gt;https://en.wikipedia.org/wiki/Method_of_loci&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg3i3o6", "score_hidden": false, "stickied": false, "created": 1491897111.0, "created_utc": 1491868311.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg3gg3y", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ChocoBaconPancake", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Read books and articles, watch documentaries and shows, visit museums.\n\nI see where you are coming from being so impressed at people who seem to know about everything in history. Every time I tell my little brother something new I learned he already knows it and goes into even more detail. It's crazy", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Read books and articles, watch documentaries and shows, visit museums.&lt;/p&gt;\n\n&lt;p&gt;I see where you are coming from being so impressed at people who seem to know about everything in history. Every time I tell my little brother something new I learned he already knows it and goes into even more detail. It&amp;#39;s crazy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg3gg3y", "score_hidden": false, "stickied": false, "created": 1491894910.0, "created_utc": 1491866110.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg3lvos", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "moralsintodust", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "It's a matter of knowing what type of knowledge is worth keeping ready in your memory. The main attribute of a history buff is the ability to do research quickly and effectively. Many of us don't know, off the cuff, the intimate details of the information we present; however, we are capable of compiling resources to such a degree that makes it seem as if we knew it the whole time. Tl;dr History buffs are cool", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a matter of knowing what type of knowledge is worth keeping ready in your memory. The main attribute of a history buff is the ability to do research quickly and effectively. Many of us don&amp;#39;t know, off the cuff, the intimate details of the information we present; however, we are capable of compiling resources to such a degree that makes it seem as if we knew it the whole time. Tl;dr History buffs are cool&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg3lvos", "score_hidden": false, "stickied": false, "created": 1491901853.0, "created_utc": 1491873053.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg47glr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "shindigero", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Lots of people have given responses that i broadly agree with but learning is subjective and different for everybody so I may as well give you my view of things as well.\n\nI've found with history that context is everything. I read loads of history books and magazines and watched loads of documentaries as a kid and I loved it. I knew loads of anecdotes and facts but when it came down to it i actually had very little understanding. I was aware of Caesar, I had heard of the battle of the Somme, i knew a cool piece of trivia about Waterloo. But that specific knowledge gave me no broader understanding of the ancient mediterranean, the early 20th century or Napoleonic Europe.\n\nThat started to change at school around the time i was sitting my A level exams (around 16-18, so where you're at now). I started to look for context, taking history in broader sweeps. Specifically for me i was studying a course on Europe from 1815 to 1918. When i looked at an event i didn't so much care what actually happened, i was more concerned with why it happened and what effect it had. \n \nTo explain I'll take as an example the murder of Archduke Ferdinand. 8 year old me could tell you \"he was killed by Gavrillo Princip a member of the black hand gang, in Sarajevo in 1914 and it caused the First World War\". To my credit that basic knowledge includes some understanding of an effect but it's really pretty limited. I didn't know where Sarajevo  i was, who Franz Ferdinand was apart from  a victim of assassination, and i had no idea what \"caused the first world war\" meant. 18 year old me started to look more at the Balkan wars that preceded the First World War, the rise of European nationalist identities in the 19th century, Austria's imperial history and uneasy relationship with its Slavic subjects and their ethnic protectors, the Russians. I looked into the breakdown in Austria's alliance with Russia following the Crimean War and how this has contributed to Europe's alliance system (which in turn led me onto Bismarck who knew it was all a bad idea and had championed his more pragmatic, Realpolitik approach). I read about the blank cheque sent by the Germans and began to understand how this drew them towards war with Russia, and indeed how it determined the order and cause for all the nations joining the war. \n\nInstead of rambling on I'll get back to the point that looking for context in history is what allowed me to start connecting events and people together. That's how I developed broad understanding. Ask what caused things to be the way they are or were. Then ask what effect that had . From my very shallow look at an entire century of European history i gained an appreciation for what had come before and what would come after by simply asking those two questions about every topic i encountered. It provides leads to follow to allow for further learning as you piece together a net of interconnected events that make up you view of the past. \n\nThat's how I've started to approach things now and it means that over time it becomes easier and easier to pick up new subjects as you've already got some basic idea of the historical situation of any given topic.\n\n(ADDITIONAL EDIT: i should also say the BBC's  \"In Our Time\" podcast covers a huge  range of subjects and is a great way to build up your broad knowledge, it's what I'm listening to at the moment)", "edited": 1491915582.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lots of people have given responses that i broadly agree with but learning is subjective and different for everybody so I may as well give you my view of things as well.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve found with history that context is everything. I read loads of history books and magazines and watched loads of documentaries as a kid and I loved it. I knew loads of anecdotes and facts but when it came down to it i actually had very little understanding. I was aware of Caesar, I had heard of the battle of the Somme, i knew a cool piece of trivia about Waterloo. But that specific knowledge gave me no broader understanding of the ancient mediterranean, the early 20th century or Napoleonic Europe.&lt;/p&gt;\n\n&lt;p&gt;That started to change at school around the time i was sitting my A level exams (around 16-18, so where you&amp;#39;re at now). I started to look for context, taking history in broader sweeps. Specifically for me i was studying a course on Europe from 1815 to 1918. When i looked at an event i didn&amp;#39;t so much care what actually happened, i was more concerned with why it happened and what effect it had. &lt;/p&gt;\n\n&lt;p&gt;To explain I&amp;#39;ll take as an example the murder of Archduke Ferdinand. 8 year old me could tell you &amp;quot;he was killed by Gavrillo Princip a member of the black hand gang, in Sarajevo in 1914 and it caused the First World War&amp;quot;. To my credit that basic knowledge includes some understanding of an effect but it&amp;#39;s really pretty limited. I didn&amp;#39;t know where Sarajevo  i was, who Franz Ferdinand was apart from  a victim of assassination, and i had no idea what &amp;quot;caused the first world war&amp;quot; meant. 18 year old me started to look more at the Balkan wars that preceded the First World War, the rise of European nationalist identities in the 19th century, Austria&amp;#39;s imperial history and uneasy relationship with its Slavic subjects and their ethnic protectors, the Russians. I looked into the breakdown in Austria&amp;#39;s alliance with Russia following the Crimean War and how this has contributed to Europe&amp;#39;s alliance system (which in turn led me onto Bismarck who knew it was all a bad idea and had championed his more pragmatic, Realpolitik approach). I read about the blank cheque sent by the Germans and began to understand how this drew them towards war with Russia, and indeed how it determined the order and cause for all the nations joining the war. &lt;/p&gt;\n\n&lt;p&gt;Instead of rambling on I&amp;#39;ll get back to the point that looking for context in history is what allowed me to start connecting events and people together. That&amp;#39;s how I developed broad understanding. Ask what caused things to be the way they are or were. Then ask what effect that had . From my very shallow look at an entire century of European history i gained an appreciation for what had come before and what would come after by simply asking those two questions about every topic i encountered. It provides leads to follow to allow for further learning as you piece together a net of interconnected events that make up you view of the past. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s how I&amp;#39;ve started to approach things now and it means that over time it becomes easier and easier to pick up new subjects as you&amp;#39;ve already got some basic idea of the historical situation of any given topic.&lt;/p&gt;\n\n&lt;p&gt;(ADDITIONAL EDIT: i should also say the BBC&amp;#39;s  &amp;quot;In Our Time&amp;quot; podcast covers a huge  range of subjects and is a great way to build up your broad knowledge, it&amp;#39;s what I&amp;#39;m listening to at the moment)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg47glr", "score_hidden": false, "stickied": false, "created": 1491943983.0, "created_utc": 1491915183.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg3ly13", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "moralsintodust", "parent_id": "t1_dg3i7yg", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Connecting the dots is a good metaphor for effectively teaching history. Common Core syllabi tend to focus on memorization of dates, whereas presenting a series of points and demonstrating how they are connected across time is a much more effective way of teaching and understanding history.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Connecting the dots is a good metaphor for effectively teaching history. Common Core syllabi tend to focus on memorization of dates, whereas presenting a series of points and demonstrating how they are connected across time is a much more effective way of teaching and understanding history.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg3ly13", "score_hidden": false, "stickied": false, "created": 1491901940.0, "created_utc": 1491873140.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3i7yg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fredbnh", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Good question. I'm a firm believer in learning recent history (say civil war forward) in reverse, so as to be able to connect the dots in a way that is relevant to the real world of today, and how we got here. That way you have a point of connection as you delve back into history. When some specific aspect of history interests you, get more granular. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good question. I&amp;#39;m a firm believer in learning recent history (say civil war forward) in reverse, so as to be able to connect the dots in a way that is relevant to the real world of today, and how we got here. That way you have a point of connection as you delve back into history. When some specific aspect of history interests you, get more granular. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg3i7yg", "score_hidden": false, "stickied": false, "created": 1491897267.0, "created_utc": 1491868467.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg3ix3s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Skookum_J", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Stories.  \nCan't remember dates or names to save my life.  But a good story sticks.  Little stories filled with detail, interesting events &amp; people &amp; places.  A big story to sketch out the structure, string the little stories together, which came before which, what influenced what, how did effects ripple out over time.   Big stories weave together over time &amp; place to form the big picture.  \nCan always look up the details as needed, who, when, where, etc.  But the stories help make the details stick.  No longer just some random dead guys long time ago long ways way.  Their characters, locations, themes; I have a context to put them in, flesh them out, make them real.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stories.&lt;br/&gt;\nCan&amp;#39;t remember dates or names to save my life.  But a good story sticks.  Little stories filled with detail, interesting events &amp;amp; people &amp;amp; places.  A big story to sketch out the structure, string the little stories together, which came before which, what influenced what, how did effects ripple out over time.   Big stories weave together over time &amp;amp; place to form the big picture.&lt;br/&gt;\nCan always look up the details as needed, who, when, where, etc.  But the stories help make the details stick.  No longer just some random dead guys long time ago long ways way.  Their characters, locations, themes; I have a context to put them in, flesh them out, make them real.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg3ix3s", "score_hidden": false, "stickied": false, "created": 1491898142.0, "created_utc": 1491869342.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg3k9lh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "WayTooFurry", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "I just read alot. Any down time I have I'm reading and History intrests me the most so I read it the most. Over time your mind finds it easier to retain that knowledge.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just read alot. Any down time I have I&amp;#39;m reading and History intrests me the most so I read it the most. Over time your mind finds it easier to retain that knowledge.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg3k9lh", "score_hidden": false, "stickied": false, "created": 1491899808.0, "created_utc": 1491871008.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg3lwzz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "VesaAwesaka", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "For me it helped learning things chronologically starting with the Roman Republic.I found it really helped me learn European history. My dad was also a geologist and loved maps so i always was reading maps and looking up specific countries and how they came to exist. When i was very young my dad would constantly have documentaries on TV and although i found many of them very interesting it took a more linear approach to make it seem less chaotic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me it helped learning things chronologically starting with the Roman Republic.I found it really helped me learn European history. My dad was also a geologist and loved maps so i always was reading maps and looking up specific countries and how they came to exist. When i was very young my dad would constantly have documentaries on TV and although i found many of them very interesting it took a more linear approach to make it seem less chaotic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg3lwzz", "score_hidden": false, "stickied": false, "created": 1491901902.0, "created_utc": 1491873102.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg3zgd2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cww4517", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "I just recently became a instructor teaching maintenance procedures on aircraft weapons systems. But I went through a course that taught instructor basics and I had to give 50 minute lectures on whatever I want. I chose history for all of them and found myself more able to explain and understand events when I practiced explaining and lecturing it to someone else. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just recently became a instructor teaching maintenance procedures on aircraft weapons systems. But I went through a course that taught instructor basics and I had to give 50 minute lectures on whatever I want. I chose history for all of them and found myself more able to explain and understand events when I practiced explaining and lecturing it to someone else. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg3zgd2", "score_hidden": false, "stickied": false, "created": 1491923531.0, "created_utc": 1491894731.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg3gfl6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kevlarbuns", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "I've added audiobooks and informational podcasts to my routine.  At the gym, driving to work, doing chores, etc.  So when I'm not able to read, I am still able to take in information.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve added audiobooks and informational podcasts to my routine.  At the gym, driving to work, doing chores, etc.  So when I&amp;#39;m not able to read, I am still able to take in information.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg3gfl6", "score_hidden": false, "stickied": false, "created": 1491894891.0, "created_utc": 1491866091.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg3u8e4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "The_Dude_of_Dudeism", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "I was taught to construct \"umbrellas\" or a series of wide-spanning topics that break down into smaller and smaller subtopics. Each \"umbrella\" forms relational pairs with other subtopics, and thus effortlessly forms mind maps. As a process, it's difficult to start but certainly helps condense wide sets of data. Also, your walls start to look like a crazy person's conspiracy maps. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was taught to construct &amp;quot;umbrellas&amp;quot; or a series of wide-spanning topics that break down into smaller and smaller subtopics. Each &amp;quot;umbrella&amp;quot; forms relational pairs with other subtopics, and thus effortlessly forms mind maps. As a process, it&amp;#39;s difficult to start but certainly helps condense wide sets of data. Also, your walls start to look like a crazy person&amp;#39;s conspiracy maps. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg3u8e4", "score_hidden": false, "stickied": false, "created": 1491912796.0, "created_utc": 1491883996.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg3uilm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ShogunOfDarkness", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Always remember to understand while you read. Never memorize the stuff that will never help. Try to understand the concepts behind and soon you will be able to retain all the knowledge you want.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Always remember to understand while you read. Never memorize the stuff that will never help. Try to understand the concepts behind and soon you will be able to retain all the knowledge you want.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg3uilm", "score_hidden": false, "stickied": false, "created": 1491913259.0, "created_utc": 1491884459.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg3wtih", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RJB1337", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Personaly, i learn little facts and connect them to other facts i\ne ill learn something about WWI and then learn something about WWII, then ill learn something about the years in between the two wars", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personaly, i learn little facts and connect them to other facts i\ne ill learn something about WWI and then learn something about WWII, then ill learn something about the years in between the two wars&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg3wtih", "score_hidden": false, "stickied": false, "created": 1491917384.0, "created_utc": 1491888584.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg49itg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rmkelly1", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "In addition to the good suggestions here, you might enjoy looking into the theories about historical \"progress\": whether it exists, where it is going, why it matters, what it is, and so on. The big name here is Hegel, and his ideas about historical cycles, and of the dialectic, which was reinterpreted by Marx as dialectical materialism, the results of which when applied to political dogma has been decidedly mixed. I'm not saying you should go down the rabbit-hole of philosophy, never to return: but it is certainly relevant to be familiar with at least an outline-view of how the pre-Socratics and the Stoics differed from the medieval Scholastics, and why few of these ideas were held in high regard by the existentialists of the early 20th century. An excellent resource to dip in and out of philosophical thinking is the Stanford Encyclopedia of Philosophy, abbrev. SEP. &lt;https://plato.stanford.edu&gt; It is sometimes said that an expert is one who knows more and more about less and less. That may be true but I like your rather more generous and broadminded approach to the problem of learning. Good luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In addition to the good suggestions here, you might enjoy looking into the theories about historical &amp;quot;progress&amp;quot;: whether it exists, where it is going, why it matters, what it is, and so on. The big name here is Hegel, and his ideas about historical cycles, and of the dialectic, which was reinterpreted by Marx as dialectical materialism, the results of which when applied to political dogma has been decidedly mixed. I&amp;#39;m not saying you should go down the rabbit-hole of philosophy, never to return: but it is certainly relevant to be familiar with at least an outline-view of how the pre-Socratics and the Stoics differed from the medieval Scholastics, and why few of these ideas were held in high regard by the existentialists of the early 20th century. An excellent resource to dip in and out of philosophical thinking is the Stanford Encyclopedia of Philosophy, abbrev. SEP. &lt;a href=\"https://plato.stanford.edu\"&gt;https://plato.stanford.edu&lt;/a&gt; It is sometimes said that an expert is one who knows more and more about less and less. That may be true but I like your rather more generous and broadminded approach to the problem of learning. Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg49itg", "score_hidden": false, "stickied": false, "created": 1491946988.0, "created_utc": 1491918188.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg4uw0j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jeray2000", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "I for one like podcasts a lot. Listening to Mike Duncan's the History of Rome for example when you're in a car and cannot do anything else is a good way to pass the time and learn.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I for one like podcasts a lot. Listening to Mike Duncan&amp;#39;s the History of Rome for example when you&amp;#39;re in a car and cannot do anything else is a good way to pass the time and learn.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg4uw0j", "score_hidden": false, "stickied": false, "created": 1491970844.0, "created_utc": 1491942044.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64mk5m", "likes": null, "replies": "", "user_reports": [], "id": "dg4v75o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "improvedoscarwilde", "parent_id": "t3_64mk5m", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Read books... a lot. Fiction and non fiction. Read newspapers. I used to read the Irish Times every day and I learnt a lot just from that. If you're American you have the New York Times, which is one of the few mainstream newspapers that hasn't totally sold out or just given up. I think I was averaging 50 books a year at 18, now it's more like 20 :(\n\nI remember during my late adolescence I would see or hear something and get the urge to look it up. I was lucky as I was 16 and Wikipedia had just started getting going. I learnt so much from wikipedia. Like I'd be watching an historical drama and they'd reference the French city of Albi, so I'd look up Albi and then I'd discover the Albigensian crusades... which led to more searching which led to Pope Urban II, the Latin Kingdom of Jerusalem, feudalism, the 11th century renaissance... you get the idea? I started out with curiosity and it led me down a path of discovery, much of which was only tangentially related to the original inquiry.\n\nWhen I was 16 or so I was active on a number of forums where we'd talk and discuss things. Obviously I didn't know much, but every time a new thing came up I'd have the curiosity to learn about it.\n\nFor me, what marks a knowledgable person is a curious mind who is always willing to learn. Sure, wikipedia and the like are limiting and often wrong, but there has never been a better time to be well informed in my opinion. \n\nEDIT: Podcasts are great too. The BBC has some great ones - 'In our Time', 'Thinking Allowed', 'Moral Maze', 'Inquiry', 'Analysis'. Dan Carlin, 'Common Sense' and 'Hardcore History'. Malcolm Gladwell also had a great podcast last year 'Revisionist History'. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Read books... a lot. Fiction and non fiction. Read newspapers. I used to read the Irish Times every day and I learnt a lot just from that. If you&amp;#39;re American you have the New York Times, which is one of the few mainstream newspapers that hasn&amp;#39;t totally sold out or just given up. I think I was averaging 50 books a year at 18, now it&amp;#39;s more like 20 :(&lt;/p&gt;\n\n&lt;p&gt;I remember during my late adolescence I would see or hear something and get the urge to look it up. I was lucky as I was 16 and Wikipedia had just started getting going. I learnt so much from wikipedia. Like I&amp;#39;d be watching an historical drama and they&amp;#39;d reference the French city of Albi, so I&amp;#39;d look up Albi and then I&amp;#39;d discover the Albigensian crusades... which led to more searching which led to Pope Urban II, the Latin Kingdom of Jerusalem, feudalism, the 11th century renaissance... you get the idea? I started out with curiosity and it led me down a path of discovery, much of which was only tangentially related to the original inquiry.&lt;/p&gt;\n\n&lt;p&gt;When I was 16 or so I was active on a number of forums where we&amp;#39;d talk and discuss things. Obviously I didn&amp;#39;t know much, but every time a new thing came up I&amp;#39;d have the curiosity to learn about it.&lt;/p&gt;\n\n&lt;p&gt;For me, what marks a knowledgable person is a curious mind who is always willing to learn. Sure, wikipedia and the like are limiting and often wrong, but there has never been a better time to be well informed in my opinion. &lt;/p&gt;\n\n&lt;p&gt;EDIT: Podcasts are great too. The BBC has some great ones - &amp;#39;In our Time&amp;#39;, &amp;#39;Thinking Allowed&amp;#39;, &amp;#39;Moral Maze&amp;#39;, &amp;#39;Inquiry&amp;#39;, &amp;#39;Analysis&amp;#39;. Dan Carlin, &amp;#39;Common Sense&amp;#39; and &amp;#39;Hardcore History&amp;#39;. Malcolm Gladwell also had a great podcast last year &amp;#39;Revisionist History&amp;#39;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg4v75o", "score_hidden": false, "stickied": false, "created": 1491971190.0, "created_utc": 1491942390.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]