[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "history", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The Spicer controversy today provides a good opportunity to review what Nazi Germany did and did not use chemical weapons for between 1933 and 1945.  &lt;/p&gt;\n\n&lt;p&gt;I know very little generally about chemical weapons in Europe during this time period. Did Germany use them in combat against enemy troops in the Second World War, and if no, why not?  Are the chemicals used at death camps correctly understood to be chemical weapons as we use the word today?  Did the allies or anyone else use chemical weapons during the Second World War?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The Spicer controversy today provides a good opportunity to review what Nazi Germany did and did not use chemical weapons for between 1933 and 1945.  \n\nI know very little generally about chemical weapons in Europe during this time period. Did Germany use them in combat against enemy troops in the Second World War, and if no, why not?  Are the chemicals used at death camps correctly understood to be chemical weapons as we use the word today?  Did the allies or anyone else use chemical weapons during the Second World War?\n", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64vh4w", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 15, "report_reasons": null, "author": "Localtyrant", "saved": false, "mod_reports": [], "name": "t3_64vh4w", "subreddit_name_prefixed": "r/history", "approved_by": null, "over_18": false, "domain": "self.history", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh53", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/history/comments/64vh4w/explain_nazi_germanys_use_of_chemical_weapons/", "num_reports": null, "locked": false, "stickied": false, "created": 1491992674.0, "url": "https://www.reddit.com/r/history/comments/64vh4w/explain_nazi_germanys_use_of_chemical_weapons/", "author_flair_text": null, "quarantine": false, "title": "Explain Nazi Germany's use of chemical weapons.", "created_utc": 1491963874.0, "distinguished": null, "media": null, "upvote_ratio": 0.73, "num_comments": 17, "visited": false, "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": "", "user_reports": [], "id": "dg5ef0s", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "3-1oddsGOPerkillsdog", "parent_id": "t3_64vh4w", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "LSS: Not counting the Holocaust, They didn't.  The only reports of of German troops using chemical weapons, (specifically poison gas.) are overwhelmingly from Ukraine, the Battle of Kerch being the mother lode.  where the Soviets made a \"bunker\" out of underground tunnels in a quarry were gassed, to kill the soviets inside.\n\n\nLSL:\nIn general though, The Nazis did stockpile various chemical agents, but in general, since Hitler himself was gassed in WWI, -and he ALWAYS- had the final say regarding policy, naturally was not particularly fond of them on principal.  His generals were constantly afraid of allied reprisals, be they chemical attacks (the British Americans and Soviets all had their own chemical weapons stockpiles; and the germans thought allied stockpiles were far larger than their own.  or firebombings (like Dresden, where the allies intentionally effectively wiped an entire city of the map.) Also the effectiveness of chemical weapons is dependent on ideal weather conditions, wind that is too strong, or that changes direction makes gas useless for example.  Furthermore, Goering was concerned that because they couldn't design a decent gas mask for horses, and Germany began to rely more on horses as the war went on, (which arguably should have clued them in on the direction of the war) meant that gas would be a risk to their errr transportation infrastructure.\n\nThe British stockpiled every chemical agent imaginable at the time in preparation of D-Day, but, for generally the same reasons listed above, it was decided chemical weapons were only to be used if Germany used them first (and actually given that those gases are heavier than air, and the german defensive positions on what became the D-Day landings, particularly at points along the Omaha beachhead were elevated above the battlefield. (remember Saving Private Ryan.  That was a beach in Ireland, -playing the role of Omaha Beach)  This was the best potential place to use them, besides of course a mine shaft... like at Kerch...\n\nThe United States policy was as far as I know pretty much a carbon copy of the British. EXCEPT for one incident of note, during the Italian campaign, The American ship; SS John Harvey, was bombed by German Stukka bombers. The only part of this that was different from any other strafing run was that the John Harvey was loaded with mustard gas. Nothing was formally acknowledged by the US until after the war. (Thus this guy is tricky to find a good source for on the interwebs, sit tight though, if i have to go through my notes I will.)\n\nThe Soviets I suspect were uninterested in gas due in part to the weather argument, especially since so much of the Soviet Union is like land with a horizon flat.  but also because their Biological Weapons had to constantly moved to keep it behind the front lines. (you read that right Biological agents), The Soviets almost certainly spent more on Bioweapons than on education over the course of the interwar period at least, and potentially over the entire history of the Soviet Union. During the Civil War it was Typhus, during WWII, when released at Stalingrad it was  tularemia,[1](https://fas.org/nuke/guide/russia/cbw/jptac008_l94001.htm) and again the following was initially a classified event, so sit tight on the following, sources  DO exist, but arent popular reading material. Anyway... there is a nonzero chance of an intentional release of Yersinia Pestis.  (holy fucking shit) But it is also possible that this was just the result of millions of people living outside in the mud for years surrounded by rats. \n\nThe Japanese on the other hand was just seriously all about chemical agents.  Without any official numbers, the sheer number of reports of chemical attacks by war correspondents, civilians their own troops, (and the dark spot in both Japanese and American history that is [UNIT 516.](https://en.wikipedia.org/wiki/Unit_516)) point to Japan having deployed more chemical weapons than all other nations combined, and it isn't even close.  And they were used on civilians; but whether they were non combatants or soldiers, the victims of Japanese chemical agents were almost exclusively Chinese.\nThis is a field of study just about all of the academic historians I know, tend to not only avoid, but encourage others to shy away from.  The few souls brave enough to get their hands dirty (my thesis was on nuclear weapons and I don't want to touch the primary sources on this) have a habit of committing suicide. So continue with caution.  I promise you don't want to know how deep the rabbit hole goes. So forgive for stopping at the broad strokes.\n\nThe holocaust though.  That is the largest use of chemical weapons to kill people ever. period. It is the wild card regarding that \"The Japanese used more than everyone else combined\" statement.  If that is inaccurate; it is because so many people were killed by Zyklon B, as well as other agents that were used before they found their previously mentioned super gas.  \n\n\nI mentioned in a r/nottheonion post that the heart of Sean Spicer's comment earlier today was simply about how the Holocaust was just murder, plain and simple.  \"Chemical Weapons\" implies \"use in war, maybe on civilians, maybe on troops, but as an act of war.  The holocaust, you could call that just industrialized murder. \nI didn't bother then, but I want to make it clear here, that I don't think that this is a fair distinction to make, but I guess I do understand *why* he made the distinction.", "edited": 1491969647.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;LSS: Not counting the Holocaust, They didn&amp;#39;t.  The only reports of of German troops using chemical weapons, (specifically poison gas.) are overwhelmingly from Ukraine, the Battle of Kerch being the mother lode.  where the Soviets made a &amp;quot;bunker&amp;quot; out of underground tunnels in a quarry were gassed, to kill the soviets inside.&lt;/p&gt;\n\n&lt;p&gt;LSL:\nIn general though, The Nazis did stockpile various chemical agents, but in general, since Hitler himself was gassed in WWI, -and he ALWAYS- had the final say regarding policy, naturally was not particularly fond of them on principal.  His generals were constantly afraid of allied reprisals, be they chemical attacks (the British Americans and Soviets all had their own chemical weapons stockpiles; and the germans thought allied stockpiles were far larger than their own.  or firebombings (like Dresden, where the allies intentionally effectively wiped an entire city of the map.) Also the effectiveness of chemical weapons is dependent on ideal weather conditions, wind that is too strong, or that changes direction makes gas useless for example.  Furthermore, Goering was concerned that because they couldn&amp;#39;t design a decent gas mask for horses, and Germany began to rely more on horses as the war went on, (which arguably should have clued them in on the direction of the war) meant that gas would be a risk to their errr transportation infrastructure.&lt;/p&gt;\n\n&lt;p&gt;The British stockpiled every chemical agent imaginable at the time in preparation of D-Day, but, for generally the same reasons listed above, it was decided chemical weapons were only to be used if Germany used them first (and actually given that those gases are heavier than air, and the german defensive positions on what became the D-Day landings, particularly at points along the Omaha beachhead were elevated above the battlefield. (remember Saving Private Ryan.  That was a beach in Ireland, -playing the role of Omaha Beach)  This was the best potential place to use them, besides of course a mine shaft... like at Kerch...&lt;/p&gt;\n\n&lt;p&gt;The United States policy was as far as I know pretty much a carbon copy of the British. EXCEPT for one incident of note, during the Italian campaign, The American ship; SS John Harvey, was bombed by German Stukka bombers. The only part of this that was different from any other strafing run was that the John Harvey was loaded with mustard gas. Nothing was formally acknowledged by the US until after the war. (Thus this guy is tricky to find a good source for on the interwebs, sit tight though, if i have to go through my notes I will.)&lt;/p&gt;\n\n&lt;p&gt;The Soviets I suspect were uninterested in gas due in part to the weather argument, especially since so much of the Soviet Union is like land with a horizon flat.  but also because their Biological Weapons had to constantly moved to keep it behind the front lines. (you read that right Biological agents), The Soviets almost certainly spent more on Bioweapons than on education over the course of the interwar period at least, and potentially over the entire history of the Soviet Union. During the Civil War it was Typhus, during WWII, when released at Stalingrad it was  tularemia,&lt;a href=\"https://fas.org/nuke/guide/russia/cbw/jptac008_l94001.htm\"&gt;1&lt;/a&gt; and again the following was initially a classified event, so sit tight on the following, sources  DO exist, but arent popular reading material. Anyway... there is a nonzero chance of an intentional release of Yersinia Pestis.  (holy fucking shit) But it is also possible that this was just the result of millions of people living outside in the mud for years surrounded by rats. &lt;/p&gt;\n\n&lt;p&gt;The Japanese on the other hand was just seriously all about chemical agents.  Without any official numbers, the sheer number of reports of chemical attacks by war correspondents, civilians their own troops, (and the dark spot in both Japanese and American history that is &lt;a href=\"https://en.wikipedia.org/wiki/Unit_516\"&gt;UNIT 516.&lt;/a&gt;) point to Japan having deployed more chemical weapons than all other nations combined, and it isn&amp;#39;t even close.  And they were used on civilians; but whether they were non combatants or soldiers, the victims of Japanese chemical agents were almost exclusively Chinese.\nThis is a field of study just about all of the academic historians I know, tend to not only avoid, but encourage others to shy away from.  The few souls brave enough to get their hands dirty (my thesis was on nuclear weapons and I don&amp;#39;t want to touch the primary sources on this) have a habit of committing suicide. So continue with caution.  I promise you don&amp;#39;t want to know how deep the rabbit hole goes. So forgive for stopping at the broad strokes.&lt;/p&gt;\n\n&lt;p&gt;The holocaust though.  That is the largest use of chemical weapons to kill people ever. period. It is the wild card regarding that &amp;quot;The Japanese used more than everyone else combined&amp;quot; statement.  If that is inaccurate; it is because so many people were killed by Zyklon B, as well as other agents that were used before they found their previously mentioned super gas.  &lt;/p&gt;\n\n&lt;p&gt;I mentioned in a &lt;a href=\"/r/nottheonion\"&gt;r/nottheonion&lt;/a&gt; post that the heart of Sean Spicer&amp;#39;s comment earlier today was simply about how the Holocaust was just murder, plain and simple.  &amp;quot;Chemical Weapons&amp;quot; implies &amp;quot;use in war, maybe on civilians, maybe on troops, but as an act of war.  The holocaust, you could call that just industrialized murder. \nI didn&amp;#39;t bother then, but I want to make it clear here, that I don&amp;#39;t think that this is a fair distinction to make, but I guess I do understand &lt;em&gt;why&lt;/em&gt; he made the distinction.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg5ef0s", "score_hidden": false, "stickied": false, "created": 1491996083.0, "created_utc": 1491967283.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": "", "user_reports": [], "id": "dg5eq2c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "3-1oddsGOPerkillsdog", "parent_id": "t1_dg5dy2e", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "When Hitler talked to his Generals, he spoke with what was you could think as, \"the authority of God\"  actually a higher authority that that.\n\nThere were a few reasons  why they generally avoided chemical weapons, but his personal experience was a big one.\n\n\nEDIT: regarding the Nazi position on the Jews:\n[watch this video. Especially if you like Stephen Fry (but who doesn't)](https://www.youtube.com/watch?v=A2MoPsBg6m0)  But skip to 38:00 for just the relevant portion.\n\nhe puts it into perspective. Jews weren't animals, they were THINGS", "edited": 1491969534.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When Hitler talked to his Generals, he spoke with what was you could think as, &amp;quot;the authority of God&amp;quot;  actually a higher authority that that.&lt;/p&gt;\n\n&lt;p&gt;There were a few reasons  why they generally avoided chemical weapons, but his personal experience was a big one.&lt;/p&gt;\n\n&lt;p&gt;EDIT: regarding the Nazi position on the Jews:\n&lt;a href=\"https://www.youtube.com/watch?v=A2MoPsBg6m0\"&gt;watch this video. Especially if you like Stephen Fry (but who doesn&amp;#39;t)&lt;/a&gt;  But skip to 38:00 for just the relevant portion.&lt;/p&gt;\n\n&lt;p&gt;he puts it into perspective. Jews weren&amp;#39;t animals, they were THINGS&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg5eq2c", "score_hidden": false, "stickied": false, "created": 1491996546.0, "created_utc": 1491967746.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": "", "user_reports": [], "id": "dg6yjoz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "enfiel", "parent_id": "t1_dg5dy2e", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "The Japanese used chemical weapons rather frequently against the Chinese. They're also easier to handle than biological agents.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Japanese used chemical weapons rather frequently against the Chinese. They&amp;#39;re also easier to handle than biological agents.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg6yjoz", "score_hidden": false, "stickied": false, "created": 1492077434.0, "created_utc": 1492048634.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5dy2e", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Robjr83", "parent_id": "t3_64vh4w", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Just my guess but Hitler didn't want to use gas on enemy soldiers because he himself was nearly killed in a gas attack during WW1.  As far as using them on the Jews he probably didn't care because they were animals (In his mind).  The Japanese I don't think used chemical but did use biological weapons on the Chinese. ", "edited": 1491966915.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just my guess but Hitler didn&amp;#39;t want to use gas on enemy soldiers because he himself was nearly killed in a gas attack during WW1.  As far as using them on the Jews he probably didn&amp;#39;t care because they were animals (In his mind).  The Japanese I don&amp;#39;t think used chemical but did use biological weapons on the Chinese. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg5dy2e", "score_hidden": false, "stickied": false, "created": 1491995396.0, "created_utc": 1491966596.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": "", "user_reports": [], "id": "dg65ozo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "3-1oddsGOPerkillsdog", "parent_id": "t1_dg5ta5a", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "I meant no offense to either Romania or Italy. By \"token\" I meant more in terms of the limited scope *across the entire front, over the course of the entire war* Obviously if you were in the Red Army, staring down three battalions of Romanians in Bessarabia yeah they didn't look token.\n\nBut we are talking about a war that saw roughly the same number of people killed as currently live in Canada. 1,250,000 is a drop in the. Bucket. Especially since both Italy and Romania surrendered significantly earlier than the Germans. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I meant no offense to either Romania or Italy. By &amp;quot;token&amp;quot; I meant more in terms of the limited scope &lt;em&gt;across the entire front, over the course of the entire war&lt;/em&gt; Obviously if you were in the Red Army, staring down three battalions of Romanians in Bessarabia yeah they didn&amp;#39;t look token.&lt;/p&gt;\n\n&lt;p&gt;But we are talking about a war that saw roughly the same number of people killed as currently live in Canada. 1,250,000 is a drop in the. Bucket. Especially since both Italy and Romania surrendered significantly earlier than the Germans. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg65ozo", "score_hidden": false, "stickied": false, "created": 1492044990.0, "created_utc": 1492016190.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ta5a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rosstafarii", "parent_id": "t1_dg5evnt", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "&gt; token allied assistance from Romania and Italy\n\nwhilst largely ineffective, Romania's 1.2 Million and Italy's 250,000 men on the Eastern front was a bit more than token\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;token allied assistance from Romania and Italy&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;whilst largely ineffective, Romania&amp;#39;s 1.2 Million and Italy&amp;#39;s 250,000 men on the Eastern front was a bit more than token&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg5ta5a", "score_hidden": false, "stickied": false, "created": 1492030264.0, "created_utc": 1492001464.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5evnt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "3-1oddsGOPerkillsdog", "parent_id": "t1_dg5e3n8", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Soviets, if they were POWs soldiers, civilians, informants, or even voluntary soldiers in the wehrmacht were looked upon by nazi ideology as barely above the Jews.\n\nSo the thought was \"why bother with the Geneva Convention?\"\n\nEDIT: I actually go so far to divide WWII into Three different wars that occurred simultaneously, with the \"Eastern Front\" Or the Great Patriotic War as it is known in the Former Soviet States to this day(from 1941-1945 and between the Soviets and the Germans (and token allied assistance from Romania and Italy) being the most brutal and seeing the most atrocities in general. this is on its own merits one of the most lethal wars in human history. (30 million-ish estimated deaths, but that is on the higher end of possible) then the Second Sino-Japanese War(1937-1945, and growing to encapsulate the greater pacific war of 1941-1945 between US, the British Empire (India, Australia and New Zealand)) being the second worse, with massive atrocities too, but also coming in at around 25 Million dead, probably more actually, but definitely less than GPW.  The Western Front, the European (but also including the African campaign was by comparison a playground brawl between  GB, France, Poland, MOSt countries on both American continent, as well as local partisan groups of various nations that saw fighting, versus Germany and Italy. The death toll was pretty high, but nowhere near the numbers of the other two.  and war crimes/ crimes against humanity were limited to \"isolated incidents\" in battle, and of course the prison and concentration camps that were found at the end of the war. ", "edited": 1491969256.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Soviets, if they were POWs soldiers, civilians, informants, or even voluntary soldiers in the wehrmacht were looked upon by nazi ideology as barely above the Jews.&lt;/p&gt;\n\n&lt;p&gt;So the thought was &amp;quot;why bother with the Geneva Convention?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;EDIT: I actually go so far to divide WWII into Three different wars that occurred simultaneously, with the &amp;quot;Eastern Front&amp;quot; Or the Great Patriotic War as it is known in the Former Soviet States to this day(from 1941-1945 and between the Soviets and the Germans (and token allied assistance from Romania and Italy) being the most brutal and seeing the most atrocities in general. this is on its own merits one of the most lethal wars in human history. (30 million-ish estimated deaths, but that is on the higher end of possible) then the Second Sino-Japanese War(1937-1945, and growing to encapsulate the greater pacific war of 1941-1945 between US, the British Empire (India, Australia and New Zealand)) being the second worse, with massive atrocities too, but also coming in at around 25 Million dead, probably more actually, but definitely less than GPW.  The Western Front, the European (but also including the African campaign was by comparison a playground brawl between  GB, France, Poland, MOSt countries on both American continent, as well as local partisan groups of various nations that saw fighting, versus Germany and Italy. The death toll was pretty high, but nowhere near the numbers of the other two.  and war crimes/ crimes against humanity were limited to &amp;quot;isolated incidents&amp;quot; in battle, and of course the prison and concentration camps that were found at the end of the war. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg5evnt", "score_hidden": false, "stickied": false, "created": 1491996785.0, "created_utc": 1491967985.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": "", "user_reports": [], "id": "dg5yqub", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sevensidedmarble", "parent_id": "t1_dg5e3n8", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Because ideologically, they viewed the Slavs as subhuman. They believed that it was just to do things to them that they wouldn't do to the Western powers. The Russians offered to Germany that they both abide by Geneva on the eastern front but the Germans never even sent a reply.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because ideologically, they viewed the Slavs as subhuman. They believed that it was just to do things to them that they wouldn&amp;#39;t do to the Western powers. The Russians offered to Germany that they both abide by Geneva on the eastern front but the Germans never even sent a reply.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg5yqub", "score_hidden": false, "stickied": false, "created": 1492037478.0, "created_utc": 1492008678.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": "", "user_reports": [], "id": "dg97wi1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheTruthSetsUsFree", "parent_id": "t1_dg5e3n8", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "The Soviets did not sign the Geneva convention; so the Germans did not abide by it with them as they believed the Soviets treated German POWs just as inhumanely.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Soviets did not sign the Geneva convention; so the Germans did not abide by it with them as they believed the Soviets treated German POWs just as inhumanely.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg97wi1", "score_hidden": false, "stickied": false, "created": 1492210074.0, "created_utc": 1492181274.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5e3n8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Localtyrant", "parent_id": "t1_dg5e0v1", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Can you help me understand why Germany abided by this rule but not others? For example, Soviet POWs and citizens were not afforded the rights guaranteed by Geneva. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you help me understand why Germany abided by this rule but not others? For example, Soviet POWs and citizens were not afforded the rights guaranteed by Geneva. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg5e3n8", "score_hidden": false, "stickied": false, "created": 1491995618.0, "created_utc": 1491966818.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5e0v1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "jfurt16", "parent_id": "t3_64vh4w", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "The Geneva Protocol, signed in 1925 post WW1, outlawed the use of Use in War of Asphyxiating, Poisonous or other Gases, and of Bacteriological Methods of Warfare. As others have said, Zyklon-B was used in the camps to kill millions. So while chemical warfare in I guess the more traditional sense was not used against soldiers, if was used against civilians and possibly POWs  (not 100% sure on that one though)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Geneva Protocol, signed in 1925 post WW1, outlawed the use of Use in War of Asphyxiating, Poisonous or other Gases, and of Bacteriological Methods of Warfare. As others have said, Zyklon-B was used in the camps to kill millions. So while chemical warfare in I guess the more traditional sense was not used against soldiers, if was used against civilians and possibly POWs  (not 100% sure on that one though)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg5e0v1", "score_hidden": false, "stickied": false, "created": 1491995505.0, "created_utc": 1491966705.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": "", "user_reports": [], "id": "dg6z4qp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "enfiel", "parent_id": "t3_64vh4w", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "There was none. The Soviets claimed some gasses were used by the Germans to take out fortresses on the Crimea but in one case it was an oxygen mix that was used to blow up a fortification and in other cases it seems like they just put fires close to vents. During the first days of the invasion of Poland there was a case where Polish troops used artillery ammunition to blow up a bridge and some of those shells contained mustard gas. The Germans already expected general use of chemical weapons like WWI but thankfully the situation calmed down once the situation was explained. Chemical weapons were treated pretty much like nukes and with the nerve agents developed during the 30s it would have been easy to kill off entire cities within less than an hour. Cyanide gasses or engine exhausts were used for mass executions in concentration camps and during both uprisings in Warsaw to take out hiding places in the sewers or improvised bunkers. Zyklon B was not a chemical weapon though, it was a highly poisonous insecticide that was misused to kill people (originally it was developed within the German chemical weapons program but cyanide doesn't do enough damage in the open, the French already noticed this during WWI when they also experimented with it). There were isolated cases of depots with poisonous gasses getting hit but by the end of WWII most stockpiles of German chemical weapons got captured and were disposed (often by just dropping them into the north sea where they're already starting to causes problems).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There was none. The Soviets claimed some gasses were used by the Germans to take out fortresses on the Crimea but in one case it was an oxygen mix that was used to blow up a fortification and in other cases it seems like they just put fires close to vents. During the first days of the invasion of Poland there was a case where Polish troops used artillery ammunition to blow up a bridge and some of those shells contained mustard gas. The Germans already expected general use of chemical weapons like WWI but thankfully the situation calmed down once the situation was explained. Chemical weapons were treated pretty much like nukes and with the nerve agents developed during the 30s it would have been easy to kill off entire cities within less than an hour. Cyanide gasses or engine exhausts were used for mass executions in concentration camps and during both uprisings in Warsaw to take out hiding places in the sewers or improvised bunkers. Zyklon B was not a chemical weapon though, it was a highly poisonous insecticide that was misused to kill people (originally it was developed within the German chemical weapons program but cyanide doesn&amp;#39;t do enough damage in the open, the French already noticed this during WWI when they also experimented with it). There were isolated cases of depots with poisonous gasses getting hit but by the end of WWII most stockpiles of German chemical weapons got captured and were disposed (often by just dropping them into the north sea where they&amp;#39;re already starting to causes problems).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg6z4qp", "score_hidden": false, "stickied": false, "created": 1492078168.0, "created_utc": 1492049368.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64vh4w", "likes": null, "replies": "", "user_reports": [], "id": "dga3a93", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "g0rdito", "parent_id": "t1_dg97y9k", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Easy there, Steve Bannon.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Easy there, Steve Bannon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dga3a93", "score_hidden": false, "stickied": false, "created": 1492248907.0, "created_utc": 1492220107.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97y9k", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "TheTruthSetsUsFree", "parent_id": "t1_dg5esoo", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "How many were killed in a room and how long did it take for them to die? How much gas did they use?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How many were killed in a room and how long did it take for them to die? How much gas did they use?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg97y9k", "score_hidden": false, "stickied": false, "created": 1492210136.0, "created_utc": 1492181336.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5esoo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "3-1oddsGOPerkillsdog", "parent_id": "t1_dg5cpoo", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "more than that.\n\nabout 12,000,000 total holocaust deaths, and there were entire facilities dedicated to gassing.\n\nthey were shooting for 10,000s of people into the chambers every day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;more than that.&lt;/p&gt;\n\n&lt;p&gt;about 12,000,000 total holocaust deaths, and there were entire facilities dedicated to gassing.&lt;/p&gt;\n\n&lt;p&gt;they were shooting for 10,000s of people into the chambers every day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg5esoo", "score_hidden": false, "stickied": false, "created": 1491996657.0, "created_utc": 1491967857.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5cpoo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "g0rdito", "parent_id": "t3_64vh4w", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "The Nazi's used \"Zyklon B\" (a cyanide-based pesticide) to kill an estimated 1,000,000 people in gas chambers soooo....\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Nazi&amp;#39;s used &amp;quot;Zyklon B&amp;quot; (a cyanide-based pesticide) to kill an estimated 1,000,000 people in gas chambers soooo....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg5cpoo", "score_hidden": false, "stickied": false, "created": 1491993652.0, "created_utc": 1491964852.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]